var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلَا يَغْمِسْ يَدَهُ فِي وَضُوئِهِ حَتَّى يَغْسِلَهَا ثَلَاثًا فَإِنَّ أَحَدَكُمْ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ سےنے فرمایا: ’’جب تم میں سے کوئی نیند سے بیدار ہو تو اپنا ہاتھ وضو کے پانی میں نہ ڈالے حتی کہ اسے تین دفعہ دھو لے کیونکہ تم میں سے کوئی نہیں جانتا کہ اس کے ہاتھ نے رات کہاں گزاری ہے۔(رات بھر کہاں کہاں لگتا رہا ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;