var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ مَعْمَرًا عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الْفِطْرَةِ قَصُّ الشَّارِبِ وَنَتْفُ الْإِبْطِ وَتَقْلِيمُ الْأَظْفَارِ وَالِاسْتِحْدَادُ وَالْخِتَانُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’پانچ چیزیں فطری ہیں،مونچھوں کو کاٹنا،بغلوں کے بال اکھیڑنا،ناخن تراشنا،زیر ناف کے بال صاف کرنا اور ختنہ کرانا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;