var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ قَالَ حَدَّثَنَا أَبِي قَالَ أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْعِشَاءِ الْآخِرَةِ بِالشَّمْسِ وَضُحَاهَا وَأَشْبَاهِهَا مِنْ السُّوَرِ";
nasai.urdu = "حضرت بریدہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ عشاء کی نماز میں (والشمس وضحھا) اور اس جیسی دیگر سورتیں پڑھا کرتے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;