var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَقَرَأَ فِي الْعِشَاءِ فِي الرَّكْعَةِ الْأُولَى بِالتِّينِ وَالزَّيْتُونِ";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہ ﷺ سفر میں تھے تو آپ نے عشاء کی نماز کی پہلی رکعت میں سورۂ (والتین وازیتون) پڑھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;