var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَ إِنِّي لَأَعْرِفُ النَّظَائِرَ الَّتِي كَانَ يَقْرَأُ بِهِنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِشْرِينَ سُورَةً فِي عَشْرِ رَكَعَاتٍ ثُمَّ أَخَذَ بِيَدِ عَلْقَمَةَ فَدَخَلَ ثُمَّ خَرَجَ إِلَيْنَا عَلْقَمَةُ فَسَأَلْنَاهُ فَأَخْبَرَنَا بِهِنَّ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ بے شک میں ان ملتی جلتی بیس سورتوں کو بخوبی جانتا ہوں جنھیں رسول اللہ ﷺ دس رکعات میں پڑھتے تھے۔پر وہ علقمہ کا ہاتھ پکڑ کر اندر چلے گئے۔پھر علقمہ باہر آئے تو ہم نے ان سے ان سورتوں کے بارے میں پوچھا تو انھوں نے ہمیں ان کی تفصیل بتائی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;