var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ الْعَلَاءِ بْنِ الْمُسَيَّبِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ طَلْحَةَ بْنِ يَزِيدَ عَنْ حُذَيْفَةَ وَالْأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْبَقَرَةَ وَآلَ عِمْرَانَ وَالنِّسَاءَ فِي رَكْعَةٍ لَا يَمُرُّ بِآيَةِ رَحْمَةٍ إِلَّا سَأَلَ وَلَا بِآيَةِ عَذَابٍ إِلَّا اسْتَجَارَ";
nasai.urdu = "حضرت حذیفہ رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ نے ایک رکعت میں سورۂ بقرہ،آل عمران اور نساء پڑھیں۔جب بھی آپ کسی رحمت والی آیت پر پہنچتے تو اللہ تعالیٰ سے رحمت مانگتے اور عذاب کی آیت پر پہنچتے تو بچاؤ کا سوال فرماتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;