var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ قَتَادَةَ قَالَ سَأَلْتُ أَنَسًا كَيْفَ كَانَتْ قِرَاءَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ يَمُدُّ صَوْتَهُ مَدًّا";
nasai.urdu = "حضرت قتادہ بیان کرتے ہیں کہ میں نے حضرت انس رضی اللہ عنہ سے پوچھا کہ رسول اللہ ﷺ کی قراءت کیسے ہوتی تھی؟ انھوں نے فرمایا: آپ آواز کو کھینچ کھینچ کر پڑھتے تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;