var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي طَلْحَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ قَالَ ابْنُ عَوْسَجَةَ كُنْتُ نَسِيتُ هَذِهِ زَيِّنُوا الْقُرْآنَ حَتَّى ذَكَّرَنِيهِ الضَّحَّاكُ بْنُ مُزَاحِمٍ";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’قرآن مجید کو پرسوز آواز سے پڑھا کرو۔‘‘ راویٔ حدیث ابن عوسجہ بیان کرتے ہیں کہ یہ الفاظ [زینوا القرآن] میں بھول گیا تھا حتی کہ (میرے ساتھی) ضحاک بن مزاحم نے مجھے یاد دلائے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;