var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ زُنْبُورٍ الْمَكِّيُّ قَالَ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسَنِ الصَّوْتِ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،انھوں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا: ’’اللہ تعالیٰ نے کبھی کسی آواز کی طرف اتنی توجہ نہیں دی (غور سے نہیں سنا) جس قدر خوب صورت آواز والے نبی کی طرف توجہ دی جو بلند (اور پرسوز) آواز سے قرآن پڑھتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;