var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَذِنَ اللَّهُ عَزَّ وَجَلَّ لِشَيْءٍ يَعْنِي أَذَنَهُ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’اللہ تعالیٰ نے کسی چیز کی طرف اتنی توجہ نہیں دی جس قدر اس نبی کی طرف توجہ فرماتا ہے جو پرسوز آواز سے قرآن پڑھتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;