var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُ أَنَّ أَبَا سَلَمَةَ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ قِرَاءَةَ أَبِي مُوسَى فَقَالَ لَقَدْ أُوتِيَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ عَلَيْهِ السَّلَام";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ نے حضرت ابو موسیٰ رضی اللہ عنہ کی قراءت سنی تو فرمایا: ’’اسے تو داود علیہ السلام کی بانسریوں میں سے ایک بانسری دی گئی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;