var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ بْنِ عَبْدِ الْجَبَّارِ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِرَاءَةَ أَبِي مُوسَى فَقَالَ لَقَدْ أُوتِيَ هَذَا مِنْ مَزَامِيرِ آلِ دَاوُدَ عَلَيْهِ السَّلَام";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا بیان کرتے ہیں کہ نبی ﷺ نے ابوموسیٰ رضی اللہ عنہ کی قراءت سنی تو فرمایا: ’’بلاشبہ اسے تو داود علیہ السلام کی بانسریوں میں سے ایک بانسری دی گئی ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;