var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ سَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِرَاءَةَ أَبِي مُوسَى فَقَالَ لَقَدْ أُوتِيَ هَذَا مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ عَلَيْهِ السَّلَام";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انھوں نے فرمایا: رسول اللہ ﷺ نے حضرت ابو موسیٰ رضی اللہ عنہ کی قراءت سنی تو فرمایا: ’’بلاشبہ اسے داود علیہ السلام کی بانسریوں میں سے ایک بانسری دی گئی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;