var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ اللَّيْثِيِّ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا كَبَّرَ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ حَتَّى بَلَغَتَا فُرُوعَ أُذُنَيْهِ";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا،آپ جب تکبیر تحریمہ کہتے اور جب رکوع کو جاتے اور جب رکوع سے سر اٹھاتے تو اپنے دونوں ہاتھ اٹھاتے حتی کہ وہ کانوں کے کناروں کے برابر ہو جاتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;