var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا افْتَتَحَ الصَّلَاةَ يَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ مَنْكِبَيْهِ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے،انھوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا جب آپ نماز شروع فرماتے اور جب رکوع کو جاتے اور جب رکوع سے سر اٹھاتے تو اپنے دونوں ہاتھ اٹھاتے حتی کہ انھیں کندھوں کے برابر کرتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;