var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ أَلَا أُخْبِرُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَامَ فَرَفَعَ يَدَيْهِ أَوَّلَ مَرَّةٍ ثُمَّ لَمْ يُعِدْ";
nasai.urdu = "حضرت علقمہ سے روایت ہے،حضرت عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا: کیا میں تمھیں رسول اللہ ﷺ کی نماز کے بارے میں نہ بتاؤں؟ پھر آپ اٹھے (نماز شروع کی) پہلی دفعہ رفع الیدین کیا،پھر نہ کیا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (748) ترمذی (257)`;
nasai.anwaar = [328,1];