var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْفُضَيْلُ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُجْزِئُ صَلَاةٌ لَا يُقِيمُ الرَّجُلُ فِيهَا صُلْبَهُ فِي الرُّكُوعِ وَالسُّجُودِ";
nasai.urdu = "حضرت ابو مسعود رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’وہ نماز نہیں ہوتی جس میں انسان رکوع اور سجدے کے دوران میں اپنی پشت کو سیدھا نہ رکھے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;