var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ وَحَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اعْتَدِلُوا فِي الرُّكُوعِ وَالسُّجُودِ وَلَا يَبْسُطْ أَحَدُكُمْ ذِرَاعَيْهِ كَالْكَلْبِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’رکوع اور سجدے میں اعتدال رکھو۔تم میں سے کوئی آدمی کتے کی طرح اپنے بازو نہ پھیلائے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;