var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ الزُّبَيْرِ بْنِ عَدِيٍّ عَنْ مُصْعَبِ بْنِ سَعْدٍ قَالَ رَكَعْتُ فَطَبَّقْتُ فَقَالَ أَبِي إِنَّ هَذَا شَيْءٌ كُنَّا نَفْعَلُهُ ثُمَّ ارْتَفَعْنَا إِلَى الرُّكَبِ";
nasai.urdu = "حضرت مصعب بن سعد سے مروی ہے،انھوں نے فرمایا: میں نے رکوع میں تطبیق کی تو میرے والد محترم نے فرمایا: یہ کام ہم پہلے کیا کرتے تھے،پھر ہمیں گھٹنوں کے اوپر ہاتھ رکھنے کے لیے کہا گیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;