var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ ح وَأَنْبَأَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ عَنْ بِلَالٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ وَالْخِمَارِ";
nasai.urdu = "حضرت بلال رضی اللہ عنہ سے روایت ہے کہ میں نے نبی ﷺ کو موزوں اور پگڑی پر مسح کرتے دیکھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;