var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَكَعَ اعْتَدَلَ فَلَمْ يَنْصِبْ رَأْسَهُ وَلَمْ يُقْنِعْهُ وَوَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ";
nasai.urdu = "حضرت ابوحمید ساعدی رضی اللہ عنہ فرماتے ہیں: نبی ﷺ جب رکوع فرماتے تو میانہ روی اختیار فرماتے،یعنی نہ تو اپنا سر بہت نیچے جھکاتے اور نہ اسے اوپر اٹھاتے (بلکہ پشت کے برابر رکھتے)۔اور آپ اپنے دونوں ہاتھ اپنے دونوں گھٹنوں پر رکھتے۔";
nasai.hukam = "إسنادہ صحیح، صحیح بخاری";
nasai.description = ``;