var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ أَشْعَثَ عَنْ مُحَمَّدٍ عَنْ عَبِيدَةَ عَنْ عَلِيٍّ قَالَ نَهَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَسِّيِّ وَالْحَرِيرِ وَخَاتَمِ الذَّهَبِ وَأَنْ أَقْرَأَ وَأَنَا رَاكِعٌ وَقَالَ مَرَّةً أُخْرَى وَأَنْ أَقْرَأَ رَاكِعًا";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے کہ مجھے نبی ﷺ نے قسی اور ریشمی کپڑے اور سونے کی انگوٹھی پہننے سے روکا ہے اور اس بات سے بھی کہ میں رکوع کی حالت میں قرآن مجید پڑھوں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;