var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ عَجْلَانَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ عَلِيٍّ قَالَ نَهَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ الْقِرَاءَةِ رَاكِعًا وَعَنْ الْقَسِّيِّ وَالْمُعَصْفَرِ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے کہ مجھے نبی ﷺ نے سونے کی انگوٹھی پہننے،رکوع میں قراءت قرآن کرنے،قسی اور معصفر (زعفرانی زرد رنگ کا کپڑا) پہننے سے منع کیا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;