var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ دَاوُدَ الْمُنْكَدِرِيُّ قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ إِبْرَاهِيمَ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا أَقُولُ نَهَاكُمْ عَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَعَنْ لُبْسِ الْمُفَدَّمِ وَالْمُعَصْفَرِ وَعَنْ الْقِرَاءَةِ فِي الرُّكُوعِ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے مروی ہے،اللہ کے رسول ﷺ نے مجھے ……… میں نہیں کہتا کہ تمھیں ……… سونے کی انگوٹھی،قسی کپڑے،خالص اور انتہائی سرخ اور زعفرانی زرد رنگ کے کپڑے پہننے اور رکوع میں قرآن مجید پڑھنے سے منع فرمایا ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;