var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْقَسِّيِّ وَالْمُعَصْفَرِ وَعَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ الْقِرَاءَةِ فِي الرُّكُوعِ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے مروی ہے کہ مجھے رسول اللہ ﷺ نے قسی،زعفرانی زرد رنگ کے کپڑے اور سونے کی انگوٹھی پہننے اور رکوع میں قرآن مجید پڑھنے سے منع فرمایا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;