var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَكَعَ فَقَالَ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَفِي سُجُودِهِ سُبْحَانَ رَبِّيَ الْأَعْلَى";
nasai.urdu = "حضرت حذیفہ رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ ﷺ کے ساتھ نماز پڑھی۔آپ نے رکوع فرمایا تو اپنے رکوع میں [سبحان ربی العظیم] ’’پاک ہے میرا عظمتوں والا رب۔‘‘ اور سجدے میں [سبحان ربی الاعلی] ’’پاک ہے میرا بلند و بالا رب۔‘‘ پڑھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;