var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ وَيَزِيدُ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ أَنْ يَقُولَ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں: رسول اللہ ﷺ اپنے رکوع اور سجدے میں اکثر یہ دعا پڑھا کرتے تھے: [سبحان ربنا و بحمدک اللھم اغفرلی] ’’اے ہمارے رب! تو ہر قسم کے نقائص و عیوب سے پاک ہے اور ہر قسم کی تعریفوں کا مستحق ہے۔اے اللہ مجھے معاف فرما دے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;