var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَنْبَأَنِي قَتَادَةُ عَنْ مُطَرِّفٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں: رسول اللہ ﷺ رکوع میں [سبوح قدوس رب الملائکۃ و الروح] ’’بہت پاک ہے،منزہ ہے فرشتوں اور روح (جبریل امین) کا رب۔‘‘ پڑھا کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;