var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ قَيْسِ بْنِ سُلَيْمٍ الْعَنْبَرِيِّ قَالَ حَدَّثَنِي عَلْقَمَةُ بْنُ وَائِلٍ قَالَ حَدَّثَنِي أَبِي قَالَ صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُهُ يَرْفَعُ يَدَيْهِ إِذَا افْتَتَحَ الصَّلَاةَ وَإِذَا رَكَعَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ هَكَذَا وَأَشَارَ قَيْسٌ إِلَى نَحْوِ الْأُذُنَيْنِ";
nasai.urdu = "حضرت وائل بن حجر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کے پیچھے نماز پڑھی تو دیکھا کہ آپ جب نماز شروع فرماتے یا رکوع کو جاتے یا سمع اللہ لمن حمدہ کہتے تو اس طرح رفع الیدین کرتے۔(راویٔ حدیث) قیس نے کانوں کی طرف اشارہ کیا،یعنی کانوں تک۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;