var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ أَنَّهُ حَدَّثَهُمْ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ حَتَّى يُحَاذِيَ بِهِمَا فُرُوعَ أُذُنَيْهِ";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے،انھوں نے نبی ﷺ کو دیکھا آپ جب رکوع فرماتے یا رکوع سے سر اٹھاتے تو اپنے دونوں ہاتھ اٹھاتے حتی کہ انھیں کانوں کے کناروں کے برابر لے جاتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;