var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّهُ قَالَ أَلَا أُصَلِّي بِكُمْ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى فَلَمْ يَرْفَعْ يَدَيْهِ إِلَّا مَرَّةً وَاحِدَةً";
nasai.urdu = "حضرت علقمہ سے منقول ہے کہ حضرت عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا: کیا میں تمھیں رسول اللہ ﷺ کی نماز جیسی نماز نہ پڑھاؤں؟ تو انھوں نے نماز پڑھی اور ایک دفعہ سے زائد رفع الیدین نہ کیا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1027)`;
nasai.anwaar = [329,1];