var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ جب رکوع سے سر اٹھاتے تو [اللھم! ربنا ولک الحمد] کہتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;