var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ فَإِنَّ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺنے فرمایا: ’’جب امام [سمع اللہ لمن حمدہ] کہے تو تم [ربنا ولک الحمد] کہو کیونکہ جس آدمی کا یہ قول فرشتوں کے قول کے ساتھ مل گیا،اس کے پہلے سب گناہ معاف کر دیے جاتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;