var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ الْحَرَّانِيُّ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی ﷺ جب (رکوع سے اٹھتے وقت) [سمع اللہ لمن حمدہ] کہتے تو یوں فرماتے: [اللھم! ربنا لک الحمد ……… من شیی بعد] ’’اے اللہ! اے ہمارے رب! تیرے ہی لیے تعریف ہے،اس قدر کہ آسمان و زمین بھر جائیں اور ہر وہ چیز بھر جائے جو تو ان کے بعد چاہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;