var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ قَالَ حَدَّثَنَا بَكْرُ بْنُ عَبْدِ اللَّهِ الْمُزَنِيُّ عَنْ الْحَسَنِ عَنْ ابْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ الْمُغِيرَةِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَمَسَحَ نَاصِيَتَهُ وَعِمَامَتَهُ وَعَلَى الْخُفَّيْنِ قَالَ بَكْرٌ وَقَدْ سَمِعْتُهُ مِنِ ابْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أَبِيهِ";
nasai.urdu = "حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ نے وضو کیا اور آپ نے اپنی پیشانی،پگڑی اور موزوں پر مسح فرمایا: (راویٔ حدیث) بکر نے کہا: تحقیق میں نے یہ حدیث براہ راست حضرت مغیرہ بن شعبہ رضی اللہ عنہ کے بیٹے سے بھی سنی ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;