var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي مِجْلَزٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا بَعْدَ الرُّكُوعِ يَدْعُو عَلَى رِعْلٍ وَذَكْوَانَ وَعُصَيَّةَ عَصَتْ اللَّهَ وَرَسُولَهُ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے مروی ہے،فرماتے ہیں: رسول اللہ ﷺ نے ایک مہینہ رکوع کے بعد قنوت فرمائی۔آپ رعل،ذکوان اور عصیہ قبائل پر بددعا کرتے تھے۔(کیونکہ) انھوں نے اللہ تعالیٰ اور اس کے رسول ﷺ کی معصیت (نافرمانی) کی تھی";
nasai.hukam = "متفق علیہ";
nasai.description = ``;