var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ أَنَّ أَنَسَ بْنَ مَالِكٍ سُئِلَ هَلْ قَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ قَالَ نَعَمْ فَقِيلَ لَهُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَهُ قَالَ بَعْدَ الرُّكُوعِ";
nasai.urdu = "حضرت ابن سیرین سے روایت ہے کہ حضرت انس بن مالک رضی اللہ عنہ سے پوچھا گیا: کیا رسول اللہ ﷺ نے صبح کی نماز میں قنوت پڑھی ہے؟ آپ نے فرمایا: ہاں۔پوچھا گیا: رکوع سے پہلے یا بعد؟ آپ نے فرمایا: رکوع کے بعد۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;