var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ يُونُسَ عَنْ ابْنِ سِيرِينَ قَالَ حَدَّثَنِي بَعْضُ مَنْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ فَلَمَّا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فِي الرَّكْعَةِ الثَّانِيَةِ قَامَ هُنَيْهَةً";
nasai.urdu = "حضرت ابن سیرین بیان کرتے ہیں کہ مجھے ایک ایسے صحابی (رضی اللہ عنہ) نے بیان کیا جنھوں نے رسول اللہ ﷺ کے ساتھ نماز صبح پڑھی۔(ان کے بیان کے مطابق) جب آپ نتے دوسری رکعت میں [سمع اللہ لمن حمدہ] کہا تو آپ کچھ دیر کھڑے رہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1446)`;
nasai.anwaar = [329,1];