var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ وَشُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ ح و أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ وَسُفْيَانَ قَالَا حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْنُتُ فِي الصُّبْحِ وَالْمَغْرِبِ وَقَالَ عُبَيْدُ اللَّهِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہما سے مروی ہے کہ نبی ﷺ صبح اور مغرب کی نماز میں قنوت پڑھا کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;