var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا يَدْعُو عَلَى حَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ ثُمَّ تَرَكَهُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺنے ایک ماہ قنوت فرمائی۔آپ عرب کے قابئل میں سے ایک قبلے کے خلاف بددعا کرتے تھے۔پھر آپ نے قنوت چھوڑ دی۔";
nasai.hukam = "صحیح";
nasai.description = ``;