var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ سَعِيدِ بْنِ الْحَارِثِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فَآخُذُ قَبْضَةً مِنْ حَصًى فِي كَفِّي أُبَرِّدُهُ ثُمَّ أُحَوِّلُهُ فِي كَفِّي الْآخَرِ فَإِذَا سَجَدْتُ وَضَعْتُهُ لِجَبْهَتِي";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،فرماتے ہیں: ہم رسول اللہ ﷺ کے ساتھ ظہر کی نماز پڑھا کرتے تھے تو میں اپنی مٹھی میں کچھ کنکریاں پکڑ لیتا تھا تاکہ انھیں ٹھنڈا کروں۔پھر (جب ہاتھ جلنے لگتا تو) انھیں دوسری ہتھیلی میں منتقل کر لیتا تھا۔پھر جب میں سجدہ کرتا تو انھیں اپنے ماتھے کے نیچے رکھ لیتا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;