var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُعَاذٌ وَيَحْيَى قَالَا حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ وَيُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ وَكَانَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا يَفْعَلَانِهِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ ہر جھکنے اور اٹھنے کے وقت اللہ اکبر کہتے تھے اور آخر میں دائیں بائیں دونوں طرف سلام پھیرتے تھے۔حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما بھی ایسے ہی کیا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;