var nasai = {};
nasai.arabic = "أخبرنا محمد بن المثنى قال حدثنا ابن أبي عدي عن شعبة عن قتادة عن نصر بن عاصم عن مالك بن الحويرث أنه رأى النبي صلى الله عليه وسلم رفع يديه في صلاته وإذا ركع وإذا رفع رأسه من الركوع وإذا سجد وإذا رفع رأسه من السجود حتى يحاذي بهما فروع أذنيه .";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے،انھوں نے نبی ﷺ کو دیکھا آپ اپنی نماز میں جب رکوع کرتے یا رکوع سے سر اٹھاتے یا سجدے میں جاتے یا سجدے سے سر اٹھاتے تو اپنے دونوں ہاتھ اٹھاتے حتی کہ انھیں کانوں کے کناروں کے برابر کرتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن وھو مدلس وتلمیذہ ھو سعید بن أبي عروبۃ کما فی السنن الکبری للنسائي (672)۔`;
nasai.anwaar = [329,1];