var nasai = {};
nasai.arabic = "أخبرنا محمد بن المثنى قال حدثنا معاذ بن هشام قال حدثني أبي عن قتادة عن نصر بن عاصم عن مالك بن الحويرث أن نبي الله صلى الله عليه وسلم كان إذا دخل في الصلاة فذكر نحوه وزاد فيه وإذا ركع فعل مثل ذلك وإذا رفع رأسه من الركوع فعل مثل ذلك وإذا رفع رأسه من السجود فعل مثل ذلك .";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے مروی ہے،انھوں نے نبی ﷺ کو دیکھا،آآ جب نماز شروع فرماتے۔پھر اسی (سابقہ حدیث) کی طرح بیان کیا۔اس میں اتنا زیادہ کیا،اور جب رکوع کرتے،تب بھی ایسے ہی کرتے اور جب رکوع سے سر اٹھاتے،پھر بھی ایسے ہی کرتے اور جب سجدے سے سر اٹھاتے،تب بھی ایسے ہی کرتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیثین السابقین (1087،1086)`;
nasai.anwaar = [329,1];