var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْكُوفِيُّ الْمُحَارِبِيُّ قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا افْتَتَحَ الصَّلَاةَ وَإِذَا رَكَعَ وَإِذَا رَفَعَ وَكَانَ لَا يَفْعَلُ ذَلِكَ فِي السُّجُودِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہا بیان کرتے ہیں کہ اللہ کے رسول ﷺ جب نماز شروع فرماتے،جب رکوع کرتے اور جب رکوع سے اٹھتے تو رفع الیدین کرتے۔لیکن سجدے میں (جاتے یا سجدے سے اٹھتے وقت) ایسا نہیں کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;