var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى الْقُوْمَسِيُّ الْبَسْطَامِيُّ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَضَعَ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا نَهَضَ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ";
nasai.urdu = "حضرت وائل بن حجر رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا جب آپ سجدہ کرتے تو اپنے گھٹنے،اپنے ہاتھوں سے پہلے رکھتے۔اور جب اٹھتے تو اپنے ہاتھ گھٹنوں سے پہلے اٹھاتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (838) ترمذی (268) ابن ماجہ (882)`;
nasai.anwaar = [329,1];