var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ حَسَنٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْمِدُ أَحَدُكُمْ فِي صَلَاتِهِ فَيَبْرُكَ كَمَا يَبْرُكُ الْجَمَلُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’(کیا) تم میں سے ایک آدمی نماز میں بیٹھنا چاہتا ہے،پھر وہ اونٹ کی طرح بیٹھتا ہے؟‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;