var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ مِنْ كِتَابِهِ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ أَحَدُكُمْ فَلْيَضَعْ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ وَلَا يَبْرُكْ بُرُوكَ الْبَعِيرِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،اللہ کے رسول ﷺ نے فرمایا: ’’جب تم میں سے کوئی آدمی سجدہ کرنے لگے تو اپنے ہاتھ اپنے گھٹنوں سے پہلے زمین پر رکھے اور اونٹ کی طرح نہ بیٹھے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;