var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ دَلُّوَيْهِ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَفَعَهُ قَالَ إِنَّ الْيَدَيْنِ تَسْجُدَانِ كَمَا يَسْجُدُ الْوَجْهُ فَإِذَا وَضَعَ أَحَدُكُمْ وَجْهَهُ فَلْيَضَعْ يَدَيْهِ وَإِذَا رَفَعَهُ فَلْيَرْفَعْهُمَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے اور انھوں نے اسے رسول اللہ ﷺ کی طرف منسوب کیا ہے کہ آپ نے فرمایا: ’’تحقیق دونوں ہاتھ چہرے کی طرح سجدہ کرتے ہیں۔جب تم میں سے کوئی شخص اپنا چہرہ زمین پر رکھے تو اپنے دونوں ہاتھ بھی رکھے اور جب چہرہ اٹھائے تو انھیں بھی اٹھا لے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;