var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَجَدَ الْعَبْدُ سَجَدَ مِنْهُ سَبْعَةُ آرَابٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ";
nasai.urdu = "حضرت عباس بن عبدالمطلب رضی اللہ عنہ سے مروی ہے،انھوں نے رسول اللہ ﷺ کو یہ فرماتے سنا: ’’جب انسان سجدہ کرتا ہے تو اس کے ساتھ سات اعضاء سجدہ کرتے ہیں: اس کا چہرہ،اس کی دو ہتھیلیاں،اس کے دو گھٹنے اور اس کے دو پاؤں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;