var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ بَصُرَتْ عَيْنَايَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى جَبِينِهِ وَأَنْفِهِ أَثَرُ الْمَاءِ وَالطِّينِ مِنْ صُبْحِ لَيْلَةِ إِحْدَى وَعِشْرِينَ مُخْتَصَرٌ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے منقول ہے،فرمایا: (رمضان المبارک کی) اکیسویں رات کی صبح کو میری آنکھوں نے رسول اللہ ﷺ کے ماتھے اور ناک پر پانی اور مٹی،یعنی کیچڑ کے نشانات دیکھے۔یہ روایت مختصر ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;