var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةٍ لَا أَكُفَّ الشَّعْرَ وَلَا الثِّيَابَ الْجَبْهَةِ وَالْأَنْفِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَالْقَدَمَيْنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مجھے حکم دیا گیا ہے کہ میں سات اعضاء پر سجدہ کروں اور میں بال اور کپڑے نہ سمیٹوں۔(سات اعضاء یہ ہیںJ ماتھا اور ناک،دو ہاتھ،دو گھٹنے اور دو قدم۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;