var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ النَّسَائِيُّ قَالَ حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ عَلَى الْجَبْهَةِ وَأَشَارَ بِيَدِهِ عَلَى الْأَنْفِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَأَطْرَافِ الْقَدَمَيْنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’مجھے حکم دیا گیا ہے کہ میں سات اعضاء پر سجدہ کروں: ماتھے پر‘‘ اور (یہ کہتے ہوئے) آپ نے اپنی ناک کی طرف اشارہ کیا ’’دونوں ہاتھوں پر،دونوں گھٹنوں پر اور دونوں پاؤں کے اطراف پر۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;