var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ مِنْ الْفِطْرَةِ الْخِتَانُ وَحَلْقُ الْعَانَةِ وَنَتْفُ الْإِبْطِ وَتَقْلِيمُ الْأَظْفَارِ وَأَخْذُ الشَّارِبِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: پانچ چیزیں فطرت سے ہیں: ختنہ کرانا،زیر ناف کے بال مونڈنا،بغلوں کے بال اکھیڑنا،ناخن کاٹنا اور مونچھیں تراشنا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;