var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ شُعْبَةَ ح وَأَنْبَأَنَا مُؤَمَّلُ بْنُ هِشَامٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيْلٌ لِلْعَقِبِ مِنْ النَّارِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ابوالقاسم رسول اللہ ﷺ نے فرمایا: ’’اس ایڑی کے لیے (جو خشک رہ جائے) ویل،یعنی آگ ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;