var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَطَاءٍ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَهْوَى إِلَى الْأَرْضِ سَاجِدًا جَافَى عَضُدَيْهِ عَنْ إِبِطَيْهِ وَفَتَخَ أَصَابِعَ رِجْلَيْهِ مُخْتَصَرٌ";
nasai.urdu = "حضرت ابو حمید ساعدی رضی اللہ عنہ بیان کرتے ہیں کہ نبی ﷺ جب سجدہ کرتے ہوئے زمین پر گرتے تو اپنے بازو بغلوں سے دور رکھتے اور اپنے پاؤں کی انگلیوں کو (قبلے کی طرف) موڑ لیتے۔یہ روایت مختصر ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;