var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ قَالَ حَدَّثَنَا أَبُو الْعَلَاءِ وَاسْمُهُ أَيُّوبُ بْنُ أَبِي مِسْكِينٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَفْتَرِشْ أَحَدُكُمْ ذِرَاعَيْهِ فِي السُّجُودِ افْتِرَاشَ الْكَلْبِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تم میں سے کوئی آدمی سجدے کی حالت میں اپنے ازو اس طرح زمین پر نہ پھیلائے جس طرح کتا پھیلاتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;