var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ قَالَ وَصَفَ لَنَا الْبَرَاءُ السُّجُودَ فَوَضَعَ يَدَيْهِ بِالْأَرْضِ وَرَفَعَ عَجِيزَتَهُ وَقَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ";
nasai.urdu = "حضرت ابو اسحاق نے کہا کہ حضرت براء بن عازب نے ہمیں سجدہ کرنے کا طریقہ بیان کیا تو اپنے دونوں ہاتھ زمین پر رکھے،سرین کو اونچا کیا اور فرمایا: میں نے رسول اللہ ﷺ کو اسی طرح (سجدہ) کرتے دیکھا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (896)`;
nasai.anwaar = [329,1];