var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ هُوَ النَّضْرُ قَالَ أَنْبَأَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى جَخَّى";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ جب نماز میں سجدہ کرتے تو اپنے دونوں بازو کھولتے،انھیں اپنے پہلوؤں سے دور رکھتے اور پیٹ کو زمین سے اونچا رکھتے۔";
nasai.hukam = "حسن";
nasai.description = ``;