var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ الْأَعْرَجِ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى فَرَّجَ بَيْنَ يَدَيْهِ حَتَّى يَبْدُوَ بَيَاضُ إِبْطَيْهِ";
nasai.urdu = "حضرت عبداللہ بن مالک ابن بحینہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ جب نماز میں سجدہ فرماتے تو اپنے بازو کھولتے حتی کہ آپ کی بغلوں کی سفیدی نظر آتی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;