var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ عِمْرَانَ عَنْ أَبِي مِجْلَزٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ قَالَ لَوْ كُنْتُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَبْصَرْتُ إِبْطَيْهِ قَالَ أَبُو مِجْلَزٍ كَأَنَّهُ قَالَ ذَلِكَ لِأَنَّهُ فِي صَلَاةٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ اگر میں (مقتدی ہونے کی بجائے) رسول اللہ ﷺ کے سامنے ہوتا تو میں (آپ کے سجدہ فرمانے کے وقت) آپ کی بغلیں دیکھ لیتا۔ابومجلز (راوی) نے کہا: معلوم ہوتا ہے،ابوہریرہ رضی اللہ عنہ اس وقت نماز میں تھے،اس لیے یوں فرمایا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;