var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَقْرَمَ عَنْ أَبِيهِ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكُنْتُ أَرَى عُفْرَةَ إِبْطَيْهِ إِذَا سَجَدَ";
nasai.urdu = "حضرت عبداللہ بن اقرم رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کے ساتھ نمازیں پڑھیں۔جب آپ سجدہ فرماتے تو میں آپ کی بغلوں کی سفیدی دیکھتا تھا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;