var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ الْأَصَمِّ عَنْ عَمِّهِ يَزِيدَ وَهُوَ ابْنُ الْأَصَمِّ عَنْ مَيْمُونَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ جَافَى يَدَيْهِ حَتَّى لَوْ أَنَّ بَهْمَةً أَرَادَتْ أَنْ تَمُرَّ تَحْتَ يَدَيْهِ مَرَّتْ";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ جب سجدہ فرماتے تو اپنے دونوں ہاتھوں کو اتنا کشادہ رکھتے کہ اگر بھیڑ بکری کا چھوٹا سا بچہ آپ کے بازوؤں کے نیچے سے گزرنا چاہتا تو گزر سکتا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;