var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ ح و أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اعْتَدِلُوا فِي السُّجُودِ وَلَا يَبْسُطْ أَحَدُكُمْ ذِرَاعَيْهِ انْبِسَاطَ الْكَلْبِ اللَّفْظُ لِإِسْحَقَ";
nasai.urdu = "حدیث انس رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’سجدے میں اعتدال اختیار کرو اور کئوی شخص اپنے بازو اس طرح زمین پر نہ بچھائے جس طرح کتا بچھاتا ہے۔‘‘ یہ لفظ حضرت اسحاق بن ابراہیم کے ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;