var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ أَنَّ تَمِيمَ بْنَ مَحْمُودٍ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ شِبْلٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَلَاثٍ عَنْ نَقْرَةِ الْغُرَابِ وَافْتِرَاشِ السَّبُعِ وَأَنْ يُوَطِّنَ الرَّجُلُ الْمَقَامَ لِلصَّلَاةِ كَمَا يُوَطِّنُ الْبَعِيرُ";
nasai.urdu = "حضرت عبدالرحمٰن بن شبل رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے تین چیزوں سے منع فرمایا: کوے کی طرح ٹھونگیں مارنے سے،درندے کی طرح بازو بچھانے سے اور آدمی نماز کے لیے ایک ہی جگہ مقرر کرلے،جیسے اونٹ (بیٹھنے کے لیے) ایک جگہ مقرر کر لیتا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (862) ابن ماجہ (1429)`;
nasai.anwaar = [329,1];