var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ عَنْ يَزِيدَ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ وَرَوْحٌ يَعْنِي ابْنَ الْقَاسِمِ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةٍ وَلَا أَكُفَّ شَعْرًا وَلَا ثَوْبًا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’مجھے حکم دیا گیا ہے کہ میں سات اعضاء پر سجدہ کروں اور (سجدے میں جاتے وقت) بال اور کپڑے نہ سمیٹوں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;