var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ خَالِدِ بْنِ عَبْدِ الرَّحْمَنِ هُوَ السُّلَمِيُّ قَالَ حَدَّثَنِي غَالِبٌ الْقَطَّانُ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ أَنَسٍ قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالظَّهَائِرِ سَجَدْنَا عَلَى ثِيَابِنَا اتِّقَاءَ الْحَرِّ";
nasai.urdu = "حضرت انس رضی اللہ عنہ فرماتے ہیں کہ جب ہم رسول اللہ ﷺ کے پیچھے دوپہر کے وقت سخت گرمی میں نماز پڑھتے تو گرمی سے بچنے کے لیے اپنے کپڑوں پر سجدہ کر لیا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;