var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتِمُّوا الرُّكُوعَ وَالسُّجُودَ فَوَاللَّهِ إِنِّي لَأَرَاكُمْ مِنْ خَلْفِ ظَهْرِي فِي رُكُوعِكُمْ وَسُجُودِكُمْ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’رکوع اور سجدہ مکمل کرو۔اللہ کی قسم! میں تمھیں اپنے پیچھے تمھارے رکوع اور سجدے میں دیکھتا ہوں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;