var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ عَلِيًّا قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقْرَأَ رَاكِعًا أَوْ سَاجِدًا";
nasai.urdu = "حضرت علی رضی اللہ عنہ فرماتے ہیں کہ مجھے رسول اللہ ﷺ نے رکوع اور سجدے کی حالت میں قرآن مجید پڑھنے سے روکا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;