var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہما فرماتی ہیں کہ رسول اللہ ﷺ اپنے رکوع اور سجدے میں یہ پڑھا کرتے تھے: [سبحانک اللھم! ربنا وبحمدک اللھم! اغفرلی] ’’اے اللہ! ہمارے رب! تو ہر قسم کے عیوب و نقائص سے پاک ہے اور تمام خوبیوں کا حامل ہے۔اے اللہ! مجھے معاف فرم۔‘‘ آپ قرآن پر عمل کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;