var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں: رسول اللہ ﷺ اپنے رکوع اور سجدے میں یہ دعا پڑھتے تھے: [سبحانک اللھم! ربنا و بحمدک اللھم! اغفرلی] ’’اے اللہ! ہمارے رب! تو ہر قسم کے عیوب و نقائص سے پاک ہے اور ہر قسم کی خوبیوں اور تعریفوں والا ہے۔اے اللہ! مجھے معاف فرما۔‘‘ آپ قرآن پر عمل فرماتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;