var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ فَقَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَظَنَنْتُ أَنَّهُ أَتَى بَعْضَ جَوَارِيهِ فَطَلَبْتُهُ فَإِذَا هُوَ سَاجِدٌ يَقُولُ رَبِّ اغْفِرْ لِي مَا أَسْرَرْتُ وَمَا أَعْلَنْتُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انھوں نے فرمایا: (ایک رات) میں نے رسول اللہ ﷺ کو نہ پایا تو میں نے سمجھا کہ آپ اپنی کسی بیوی یا لونڈی کے پاس چلے گئے ہوں گے۔میں نے آپ کو تلاش کرنا شروع کر دیا تو آپ سجدے میں تھے،یہ دعا فرما رہے تھے: ’’اے میرے رب! مجھے معاف فرما دے،وہ گناہ جو میں نے چھپ کر کیے اور جو میں نے علانیہ کیے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;