var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ بْنِ سَوَّارٍ الْقَاضِي وَمُحَمَّدُ بْنُ بَشَّارٍ عَنْ عَبْدِ الْوَهَّابِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ أَبِي الْعَالِيَةِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے منقول ہے کہ نبی ﷺ رات کی نماز میں سجدۂ تلاوت کے دوران میں یہ دعا پڑھتے تھے: [سجد وجھی للذی خلقہ …… وقوتہ] ’’میرے چہرے نے اس ذات کے لیے سجدہ کیا جس نے اسے پیدا کیا اور اپنی تدبیر اور قوت سے اس میں آنکھ اور کان پیدا کیے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1414) ترمذی (580)`;
nasai.anwaar = [329,1];