var nasai = {};
nasai.arabic = "أَخْبَرَنَا بُنْدَارٌ مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ وَابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں: رسول اللہ ﷺ اپنے رکوع اور سجدے میں یہ تسبیح پڑھتے تھے: [سبوح قدوس رب الملائکۃ والروح] ’’بہت پاک ہے،منزہ ہے فرشتوں اور روح (جبریل امین) کا رب۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;