var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرٍو يَعْنِي ابْنَ الْحَارِثِ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ سُمَيٍّ أَنَّهُ سَمِعَ أَبَا صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ عَزَّ وَجَلَّ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’بندہ اپنے رب عزوجل کے سب سے زیادہ قریب سجدے کی حالت میں ہوتا ہے،لہٰذا سجدے میں خوب دعا کیا کرو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;