var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ عَنْ إِسْمَعِيلَ بْنِ كَثِيرٍ وَكَانَ يُكْنَى أَبَا هَاشِمٍ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي هَاشِمٍ عَنْ عَاصِمِ بْنِ لَقِيطٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتَ فَأَسْبِغْ الْوُضُوءَ وَخَلِّلْ بَيْنَ الْأَصَابِعِ";
nasai.urdu = "حضرت لقیط بن صبرہ رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا: ’’جب تو وضو کرے تو اچھی طرح وضو کر اور انگلیوں کے درمیان خلال کر۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;