var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ فِي الصَّلَاةِ رَفَعَ يَدَيْهِ وَإِذَا رَكَعَ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ فَعَلَ مِثْلَ ذَلِكَ كُلَّهُ يَعْنِي رَفْعَ يَدَيْهِ";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ جب نماز شروع فرماتے تو اپنے دونوں ہاتھ اٹھاتے اور جب رکوع کرتے تو ایسے کرتے اور جب رکوع سے سر اٹھاتے تو ایسے کرتے اور جب سجدے سے اپنا سر اٹھاتے تو ان سب میں ایسے ہی کرتے،یعنی رفع الیدین کرتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1086)`;
nasai.anwaar = [329,1];