var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا افْتَتَحَ الصَّلَاةَ كَبَّرَ وَرَفَعَ يَدَيْهِ وَإِذَا رَكَعَ وَبَعْدَ الرُّكُوعِ وَلَا يَرْفَعُ بَيْنَ السَّجْدَتَيْنِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے،انھوں نے فرمایا: نبی ﷺ جب نماز شروع فرماتے تو اللہ اکبر کہتے اور رفع الیدین کرتے۔اسی طرح جب رکوع میں جاتے اور رکوع سے سر اٹھاتے (تب بھی ایسا ہی کرتے۔) لیکن دو سجدوں کے درمیان رفع الیدین نہیں کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;