var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ دُحَيْمٌ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الْأَصَمِّ قَالَ حَدَّثَنِي يَزِيدُ بْنُ الْأَصَمِّ عَنْ مَيْمُونَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ خَوَّى بِيَدَيْهِ حَتَّى يُرَى وَضَحَ إِبْطَيْهِ مِنْ وَرَائِهِ وَإِذَا قَعَدَ اطْمَأَنَّ عَلَى فَخِذِهِ الْيُسْرَى";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہما فرماتی ہیں کہ رسول اللہ ﷺ جب سجدہ کرتے تو اپنے بازوؤں کو کھولتے حتی کہ پیچھے سے بغلوں کی سفیدی نظر آتی تھی اور جب بیٹھتے تھے تو بائیں ران پر اطمینان سے بیٹھتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;