var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو قُدَامَةَ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ قَالَ حَدَّثَنِي الْحَكَمُ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ قَالَ كَانَ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُكُوعُهُ وَسُجُودُهُ وَقِيَامُهُ بَعْدَ مَا يَرْفَعُ رَأْسَهُ مِنْ الرُّكُوعِ وَبَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہما فرماتے ہیں: رسول اللہ ﷺ کی نماز میں آپ کا رکوع اور سجدہ اور رکوع سے سر اٹھانے کے بعد قیام اور دو سجدوں کے درمیان جلسہ (بیٹھنا) تقریباً برابر ہوتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;