var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ الْأَسْوَدِ وَعَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي كُلِّ رَفْعٍ وَوَضْعٍ وَقِيَامٍ وَقُعُودٍ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ رَضِيَ اللَّهُ عَنْهُمْ";
nasai.urdu = "حضرت عبداللہ بن مسعو د رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ ہر اٹھنے،جھکنے اور قیام و قعود (کھڑے ہونے اور بیٹھنے) کے وقت اللہ اکبر کہتے تھے اور حضرت ابوبکر و عمرو عثمان رضی اللہ عنھم بھی ایسے ہی کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;