var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ قَالَ جَاءَنَا أَبُو سُلَيْمَانَ مَالِكُ بْنُ الْحُوَيْرِثِ إِلَى مَسْجِدِنَا فَقَالَ أُرِيدُ أَنْ أُرِيَكُمْ كَيْفَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَالَ فَقَعَدَ فِي الرَّكْعَةِ الْأُولَى حِينَ رَفَعَ رَأْسَهُ مِنْ السَّجْدَةِ الْآخِرَةِ";
nasai.urdu = "حضرت ابو قلابہ سے روایت ہے کہ حضرت مالک بن حویرث رضی اللہ عنہ ہماری مسجد میں تشریف لائے اور فرمایا: میں چاہتا ہوں،میں تمھیں دکھاؤں کہ میں نے اللہ کے رسول ﷺ کو کیسے نماز پڑھتے دیکھا ہے۔انھوں نے کہا: آپ نے جب پہلی رکعت میں دوسرے سجدے سے سر اٹھایا تو بیٹھ گئے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;