var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا هُشَيْمٌ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فَإِذَا كَانَ فِي وَتْرٍ مِنْ صَلَاتِهِ لَمْ يَنْهَضْ حَتَّى يَسْتَوِيَ جَالِسًا";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ فرماتے ہیں: میں نے رسول اللہ ﷺ کو نماز پڑھتے دیکھا۔جب آپ اپنی نماز کی طاق رکعت میں ہوتے تو آپ کھڑے نہیں ہوتے تھے حتی کہ پہلے سیدھے بیٹھ جاتے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;