var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَضَعَ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا نَهَضَ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ قَالَ أَبُو عَبْد الرَّحْمَنِ لَمْ يَقُلْ هَذَا عَنْ شَرِيكٍ غَيْرُ يَزِيدَ بْنِ هَارُونَ وَاللَّهُ تَعَالَى أَعْلَمُ";
nasai.urdu = "حضرت وائل بن حجر رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ کو دیکھا،جب آپ سجدہ کرتے تو اپنے دونوں گھٹنے اپنے دونوں ہاتھوں سے پہلے رکھتے اور جب اٹھتے تو دونوں ہاتھ گھٹنوں سے پہلے اٹھاتے۔ابوعبدالرحمٰن (امام نسائی) رحمہ اللہ بیان کرتے ہیں کہ یہ روایت شریک سے یزید بن ہارون کے علاوہ کسی نے بھی اس طرح بیان نہیں کی۔واللہ تعالی اعلم۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1090)`;
nasai.anwaar = [330,1];