var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ كَانَ يُصَلِّي بِهِمْ فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ فَإِذَا انْصَرَفَ قَالَ وَاللَّهِ إِنِّي لَأَشْبَهُكُمْ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت ابوسلمہ سے روایت ہے کہ حضرت ابوہریرہ رضی اللہ عنہ ہمیں نماز پڑھاتے تو جب بھی (رکوع اور سجدے کے لیے) جھکتے اور (سجدے سے) اٹھتے تو اللہ اکبر کہتے۔جب نماز سے فارغ ہوتے تو فرماتے: اللہ کی قسم! یقیناً میں اپنی نماز میں تم سب سے بڑھ کر رسول اللہ ﷺ کی مشابہ ہوں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;