var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّهُ قَالَ إِنَّ مِنْ سُنَّةِ الصَّلَاةِ أَنْ تُضْجِعَ رِجْلَكَ الْيُسْرَى وَتَنْصِبَ الْيُمْنَى";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما فرماتے ہیں: تحقیق نماز میں (بیٹھنے کا) طریقہ یہ ہے کہ تو اپنا بایاں پاؤں بچھائے اور دایاں پاؤں کھڑا کرے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;