var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرِ بْنِ مُضَرَ قَالَ حَدَّثَنِي أَبِي عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ يَحْيَى أَنَّ الْقَاسِمَ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ مِنْ سُنَّةِ الصَّلَاةِ أَنْ تَنْصِبَ الْقَدَمَ الْيُمْنَى وَاسْتِقْبَالُهُ بِأَصَابِعِهَا الْقِبْلَةَ وَالْجُلُوسُ عَلَى الْيُسْرَى";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما فرماتے ہیں: نماز میں (بیٹھنے کا) طریقہ یہ ہے کہ تو دائیں پاؤں کو کھڑا کرے اور اس کی انگلیاں قبلہ رخ کرے اور بائیں پاؤں پر بیٹھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;