var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى السِّجْزِيُّ يُعْرَفُ بِخَيَّاطِ السُّنَّةِ نَزَلَ بِدِمَشْقَ أَحَدُ الثِّقَاتِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ قَالَ حَدَّثَنَا مَخْرَمَةُ بْنُ بُكَيْرٍ قَالَ أَنْبَأَنَا عَامِرُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ فِي الثِّنْتَيْنِ أَوْ فِي الْأَرْبَعِ يَضَعُ يَدَيْهِ عَلَى رُكْبَتَيْهِ ثُمَّ أَشَارَ بِأُصْبُعِهِ";
nasai.urdu = "حضرت عبداللہ بن زبیر رضی اللہ عنہما فرماتے ہیں: رسول اللہ ﷺ جب دو یا چار رکعات کے بعد بیٹھتے تو اپنے ہاتھ اپنے گھٹنوں پر رکھتے۔پھر انگلی سے اشارہ فرماتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;