var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ آدَمَ قَالَ سَمِعْتُ سُفْيَانَ يَتَشَهَّدُ بِهَذَا فِي الْمَكْتُوبَةِ وَالتَّطَوُّعِ وَيَقُولُ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح وَحَدَّثَنَا مَنْصُورٌ وَحَمَّادٌ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت یحییٰ بن آدم بیان کرتے ہیں کہ میں نے حضرت سفیان کو یہ تشہد فرض اور نفل دونوں قسم کی نماز میں پڑھتے سنا اور وہ کہتے تھے: ہمیں (یہ تتشہد) ابواسحاق نے ابوالاحوص سے،انھوں (ابوالاحوص) نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے،انھوں نے نبی ﷺ سے بیان کیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;