var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ وَمَالِكٍ وَابْنِ جُرَيْجٍ عَنْ الْمَقْبُرِيِّ عَنْ عُبَيْدِ بْنِ جُرَيْجٍ قَالَ قُلْتُ لِابْنِ عُمَرَ رَأَيْتُكَ تَلْبَسُ هَذِهِ النِّعَالَ السِّبْتِيَّةَ وَتَتَوَضَّأُ فِيهَا قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُهَا وَيَتَوَضَّأُ فِيهَا";
nasai.urdu = "حضرت عبید بن جریج فرماتے ہیں کہ میں نے حضرت ابن عمر رضی اللہ عنہما سے کہا: میں دیکھتا ہوں کہ آپ صاف چمڑے کے جوتے پہنتے ہیں اور ان میں وضو کرتے ہیں۔انھوں نے فرمایا: میں نے اللہ کے رسول ﷺ کو یہ پہنتے اور ان میں وضو کرتے دیکھا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;