var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْهَيْثَمُ بْنُ أَيُّوبَ الطَّالَقَانِيُّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ حَدَّثَنَا أَبِي عَنْ أَبِي عُبَيْدَةَ بْنِ مَسْعُودٍ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّكْعَتَيْنِ كَأَنَّهُ عَلَى الرَّضْفِ قُلْتُ حَتَّى يَقُومَ قَالَ ذَلِكَ يُرِيدُ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ فرماتے ہیں: نبی ﷺ دو رکعتوں کے بعد اتنا ہلکا بیٹھتے تھے گویا گرم پتھر پر بیٹھے ہیں۔(یعنی جلدی کھڑے ہو جاتے۔) راویٔ حدیث ابو عبیدہ بیان کرتے ہیں کہ میں نے پوچھا: یہاں تک کہ اٹھ کھڑے ہوئے۔انھوں نے فرمایا: ہاں،یہی مراد ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (995) ترمذی (366)`;
nasai.anwaar = [330,1];