var nasai = {};
nasai.arabic = "أَخْبَرَنِي يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ الْبَصْرِيُّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فَقَامَ فِي الشَّفْعِ الَّذِي كَانَ يُرِيدُ أَنْ يَجْلِسَ فِيهِ فَمَضَى فِي صَلَاتِهِ حَتَّى إِذَا كَانَ فِي آخِرِ صَلَاتِهِ سَجَدَ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ ثُمَّ سَلَّمَ";
nasai.urdu = "حضرت مالک ابن بحینہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے (ایک دفعہ) نماز پڑھی تو دو رکعتوں کے بعد (بھول کر) کھڑے ہوگئے لیکن پھر نماز میں جاری رہے (واپس نہ ہوئے) حتی کہ جب نماز کے پخر میں پہنچے تو آپ نے سلام پھیرنے سے قبل دو سجدے (سجود سہو) کیے،پھر سلام پھیرا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;