var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فَقَامَ فِي الرَّكْعَتَيْنِ فَسَبَّحُوا فَمَضَى فَلَمَّا فَرَغَ مِنْ صَلَاتِهِ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ";
nasai.urdu = "حضرت مالک ابن بحینہ رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ نے (ایک دفعہ) نماز پڑھی تو دو رکعتوں کے بعد (بھول کر) کھڑے ہوگئے۔لوگوں نے سبحان اللہ کہا مگر آپ جاری رہے (دوبارہ نہ بیٹھے) پھر جب نماز سے فارغ ہوئے تو دو سجدے کیے۔پھر سلام پھیرا۔";
nasai.hukam = "صحیح";
nasai.description = ``;