var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ حَدَّثَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ قَالَ صَلَّى عَلِيُّ بْنُ أَبِي طَالِبٍ فَكَانَ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ يُتِمُّ التَّكْبِيرَ فَقَالَ عِمْرَانُ بْنُ حُصَيْنٍ لَقَدْ ذَكَّرَنِي هَذَا صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت مطرف بن عبداللہ سے مروی ہے کہ حضرت علی بن ابی طالب رضی اللہ عنہ نے نماز پڑھی تو وہ ہر جھکنے اور اٹھنے کے وقت پوری تکبیر کہتے تھے۔حضرت عمران بن حصین رضی اللہ عنہ نے فرمایا: یقینا انھوں نے مجھے رسول اللہ ﷺ کی نماز یاد کرا دی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;