var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ وَهُوَ ابْنُ عُمَرَ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَرْفَعُ يَدَيْهِ إِذَا دَخَلَ فِي الصَّلَاةِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَإِذَا قَامَ مِنْ الرَّكْعَتَيْنِ يَرْفَعُ يَدَيْهِ كَذَلِكَ حَذْوَ الْمَنْكِبَيْنِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے منقول ہے کہ نبی ﷺ جب نماز شروع کرتے تو رفع الیدین فرماتے اور جب رکوع کا ارادہ فرماتے اور جب رکوع سے سر اٹھاتے اور جب دو رکعتوں کے بعد کھڑے ہوتے تو اسی طرح کندھوں تک اپنے دونوں ہاتھ اٹھاتے۔(یعنی رفع الیدین فرماتے)۔";
nasai.hukam = "صحیح";
nasai.description = ``;