var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ الْأَعْمَشِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ رَافِعُو أَيْدِينَا فِي الصَّلَاةِ فَقَالَ مَا بَالُهُمْ رَافِعِينَ أَيْدِيَهُمْ فِي الصَّلَاةِ كَأَنَّهَا أَذْنَابُ الْخَيْلِ الشُّمُسِ اسْكُنُوا فِي الصَّلَاةِ";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہ ﷺ ہمارے پاس تشریف لائے تو ہم نماز (کے اختتام پر سلام) میں ہاتھ اٹھا رہے تھے۔آپ نے فرمایا: ’’انھیں کیا ہوا ہے کہ نماز میں ہاتھ اٹھا رہے ہیں گویا کہ وہ سرکش گھوڑوں کی دمیں ہیں؟ نماز میں سکون اختیار کرو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;