var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ نَابِلٍ صَاحِبِ الْعَبَاءِ عَنْ ابْنِ عُمَرَ عَنْ صُهَيْبٍ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَرَرْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ إِشَارَةً وَلَا أَعْلَمُ إِلَّا أَنَّهُ قَالَ بِإِصْبَعِهِ";
nasai.urdu = "صحابیٔ رسول حضرت صہیب رضی اللہ عنہ سے مروی ہے،انھوں نے فرمایا: میں رسول اللہ ﷺ کے پاس سے گزرا جب کہ آپ نماز پڑھ رہے تھے۔میں نے آپ کو سلام کہا تو آپ نے مجھے انگلی کے اشارے سے جواب دیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;