var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا وَهْبٌ يَعْنِي ابْنَ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَمَّارِ بْنِ يَاسِرٍ أَنَّهُ سَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَرَدَّ عَلَيْهِ";
nasai.urdu = "حضرت عمار بن یاسر رضی اللہ عنہ سے روایت ہے،انھوں نے رسول اللہ ﷺ کو سلام کہا جبکہ آپ نماز میں تھے تو آپ نے (اشارے سے) جواب دیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;