var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وَمَسَحَ عَلَى الْخُفَّيْنِ";
nasai.urdu = "حضرت عمرو بن امیہ ضمری رضی اللہ عنہ سےمنقول ہے کہ انھوں نے رسول اللہ ﷺ کو دیکھا کہ آپ نے وضو کیا اور اپنے موزوں پر مسح کیا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;