var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَةٍ ثُمَّ أَدْرَكْتُهُ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَأَشَارَ إِلَيَّ فَلَمَّا فَرَغَ دَعَانِي فَقَالَ إِنَّكَ سَلَّمْتَ عَلَيَّ آنِفًا وَأَنَا أُصَلِّي وَإِنَّمَا هُوَ مُوَجَّهٌ يَوْمَئِذٍ إِلَى الْمَشْرِقِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ مجھے نبی ﷺ نے کسی کام سے بھیجا،میں واپس آیا تو میں نے آپ کو نماز کی حالت میں پایا۔میں نے آپ کو سلام کیا،آپ نے میری طرف اشارہ کیا۔پھر آپ جب نماز سے فارغ ہوئے تو مجھے بلایا اور فرمایا: ’’تم نے ابھی مجھے سلام کیا تھا جب کہ میں نماز پڑھ رہا تھا۔‘‘ اصل میں آپ اس وقت مشرق کی طرف جا رہے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;