var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَالْحُسَيْنُ بْنُ حُرَيْثٍ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ فِي الصَّلَاةِ فَلَا يَمْسَحْ الْحَصَى فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ";
nasai.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی شخص نماز میں ہو تو کنکریاں نہ چھوئے کیونکہ رحمت الٰہی اس کی طرف متوجہ ہوتی ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;