var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي مُعَيْقِيبٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَمَرَّةً";
nasai.urdu = "حضرت معیقیب رضی اللہ عنہ سے مرووی ہے،رسول اللہ ﷺ نے فرمایا: ’’اگر تجھے ضرور کنکریوں کو ہموار کرنا پڑے تو ایک دفعہ کرلے (بار بار نہ کر)۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;