var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَشُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ فِي صَلَاتِهِمْ فَاشْتَدَّ قَوْلُهُ فِي ذَلِكَ حَتَّى قَالَ لَيَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کیا وجہ ہے،کچھ لوگ نماز میں اپنی نظریں آسمان کی طرف اٹھاتے ہیں۔‘‘ پھر آپ نے اس کے بارے میں سخت الفاظ ارشاد فرمائے،حتی کہ فرمایا: ’’لوگ اس کام سے باز آ جائیں ور نہ ان کی نظریں اچک لی جائیں گی۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;