var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا كَانَ أَحَدُكُمْ فِي الصَّلَاةِ فَلَا يَرْفَعْ بَصَرَهُ إِلَى السَّمَاءِ أَنْ يُلْتَمَعَ بَصَرُهُ";
nasai.urdu = "حضرت عبیداللہ بن عبداللہ سے روایت ہے کہ نبی ﷺ کے صحابہ میں سے ایک صحابی نے مجھ سے بیان کیا کہ انھوں نے رسول اللہ ﷺ کو فرماتے ہئے سنا: ’’جب تم میں سے کوئی شخص نماز میں ہو تو اپنی نظر آسمان کی طرف نہ اٹھائے (کہیں ایسا نہ ہو) کہ وہ اچک لی جائے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;