var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ أَبَا الْأَحْوَصِ يُحَدِّثُنَا فِي مَجْلِسِ سَعِيدِ ابْنِ الْمُسَيَّبِ وَابْنُ الْمُسَيَّبِ جَالِسٌ أَنَّهُ سَمِعَ أَبَا ذَرٍّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ اللَّهُ عَزَّ وَجَلَّ مُقْبِلًا عَلَى الْعَبْدِ فِي صَلَاتِهِ مَا لَمْ يَلْتَفِتْ فَإِذَا صَرَفَ وَجْهَهُ انْصَرَفَ عَنْهُ";
nasai.urdu = "حضرت ابوذر رضی اللہ سے منقول ہے،فرماتے ہیں: رسول اللہ ﷺ نے فرمایا: ’’نماز کی حالت میں اللہ تعالیٰ اپنے بندے کی طرف متوجہ رہتا ہے جب تک وہ ادھر ادھر نہ دیکھے۔جب وہ اپنا منہ ادھر ادھر کرتا ہے تو اللہ تعالیٰ اس سے توجہ منقطع فرما لیتا ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;