var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِي عَطِيَّةَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ";
nasai.urdu = "حضرت اشعث کی یہی روایت عمرو بن علی نے ہمیں اسی طرح بیان فرمائی،لیکن اس میں زائدہ اور ابوالاحوص کی بجائے اسرائیل کا واسطہ ذکر کیا جب کہ ابو الشعثاء کی بجائے ابو عطیہ کا ذکر کیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;