var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفِطْرَةُ قَصُّ الْأَظْفَارِ وَأَخْذُ الشَّارِبِ وَحَلْقُ الْعَانَةِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’ناخن تراشنا،مونچھیں کاٹنا اور زیر ناف کے بال مونڈنا فطرت (کا تقاضا) ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;