var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا الْمُعَافَى بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا الْقَاسِمُ وَهُوَ ابْنُ مَعْنٍ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ أَبِي عَطِيَّةَ قَالَ قَالَتْ عَائِشَةُ إِنَّ الِالْتِفَاتَ فِي الصَّلَاةِ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ الصَّلَاةِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ نماز میں ادھر ادھر دیکھنا شیطان کی لوٹ کھسوٹ ہے جو وہ انسان کی نماز (میں) سے کرتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;