var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ سُفْيَانَ وَيَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ ضَمْضَمِ بْنِ جَوْسٍ عَنْ أَبِي هُرَيْرَةَ قَالَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْأَسْوَدَيْنِ فِي الصَّلَاةِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے نماز میں دو سیاہ جانور (سانپ اور بچھو) قتل کرنے کا حکم دیا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;