var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي وَهُوَ حَامِلٌ أُمَامَةَ فَإِذَا سَجَدَ وَضَعَهَا وَإِذَا قَامَ رَفَعَهَا";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ اپنی نواسی امامہ رضی اللہ عنہا کو اٹھا کر نماز پڑھ لیا کرتے تھے۔جب آپ سجدہ کرتے تو اسے اتار دیتے اور جب کھڑے ہوتے تو اسے اٹھا لیتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;