var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّ النَّاسَ وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ عَلَى عَاتِقِهِ فَإِذَا رَكَعَ وَضَعَهَا فَإِذَا فَرَغَ مِنْ سُجُودِهِ أَعَادَهَا";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے دیکھا کہ نبی ﷺ لوگوں کو جماعت کروا رہے ہیں اور آپ نے امامہ بنت ابوالعاص کو اپنے کندھے پر اٹھا رکھا ہے۔جب رکوع فرماتے تو بچی کو اتار دیتے اور جب سجدے سے فارغ ہوتے تو دوبارہ اٹھا لیتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;