var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ قَالَ حَدَّثَنَا بُرْدُ بْنُ سِنَانٍ أَبُو الْعَلَاءِ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ اسْتَفْتَحْتُ الْبَابَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي تَطَوُّعًا وَالْبَابُ عَلَى الْقِبْلَةِ فَمَشَى عَنْ يَمِينِهِ أَوْ عَنْ يَسَارِهِ فَفَتَحَ الْبَابَ ثُمَّ رَجَعَ إِلَى مُصَلَّاهُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے دروازہ کھٹکھٹایا۔اللہ کے رسول ﷺ نفل نماز پڑھ رہے تھے۔دروازہ قبلے کی جانب تھا۔آپ نے تھوڑا سا دائیں یا بائیں چل کر دروازہ کھول دیا اور پھر اپنی نماز کی جگہ پر واپس چلے گئے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (922) ترمذی (601)`;
nasai.anwaar = [330,1];