var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ زَادَ ابْنُ الْمُثَنَّى فِي الصَّلَاةِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’نماز میں (امام کو متوجہ کرنے کے لیے) سبحان اللہ کہنا مردوں کے لیے ہے اور تالی بجانا عورتوں کے لیے ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;