var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ مَسَحَ عَلَى الْخُفَّيْنِ";
nasai.urdu = "حضرت سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے موزوں پر مسح فرمایا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;