var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْفُضَيْلُ بْنُ عِيَاضٍ عَنْ الْأَعْمَشِ ح وَأَنْبَأَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’سبحان اللہ کہنا مردوں کے لیے ہے اور تالی بجانا عورتوں کے لیے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;