var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْمُغِيرَةِ عَنْ الْحَارِثِ الْعُكْلِيِّ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُجَيٍّ عَنْ عَلِيٍّ قَالَ كَانَ لِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاعَةٌ آتِيهِ فِيهَا فَإِذَا أَتَيْتُهُ اسْتَأْذَنْتُ إِنْ وَجَدْتُهُ يُصَلِّي فَتَنَحْنَحَ دَخَلْتُ وَإِنْ وَجَدْتُهُ فَارِغًا أَذِنَ لِي";
nasai.urdu = "حضرت علی رضی اللہ بیان کرتے ہیں کہ میرے لیے ایک وقت مقرر تھا جب میں اللہ کے رسول ﷺ کے پاس حاضر ہوا کرتا تھا۔جب میں آپ کے پاس آتا تو اجازت طلب کرتا۔اگر میں آپ کو نماز کی حالت میں پاتا تو آپ کھنکار دیتے اور میں داخل ہو جاتا اور اگر میں آپ کو فراغت میں پاتا تو آپ مجھے اجازت عنایت فرماتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (3708) مسند احمد (1/ 80 ح 608)<br>في سماع عبد اللہ بن نجی من علي رضي اللّٰہ عنہ نظر۔<br>والحدیث الآتي (1214 وسندہ حسن) یغني عنہ۔`;
nasai.anwaar = [330,1];