var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ مُطَرِّفٍ عَنْ أَبِيهِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي وَلِجَوْفِهِ أَزِيزٌ كَأَزِيزِ الْمِرْجَلِ يَعْنِي يَبْكِي";
nasai.urdu = "حضرت مطرف اپنے والد (حضرت عبداللہ بن شخیر رضی اللہ عنہ) سے بیان کرتے ہیں،انھوں نے فرمایا: میں نبی ﷺ کے پاس آیا جب کہ آپ نماز پڑھ رہے تھے اور آپ کے سینے سے ایسی آواز آ رہی تھی جیسے ہنڈیا ابل رہی ہو،یعنی آپ رو رہے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;