var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ أَحْفَظُهُ مِنَ الزُّهْرِيِّ قَالَ أَخْبَرَنِي سَعِيدٌ عَنْ أَبِي هُرَيْرَةَ أَنَّ أَعْرَابِيًّا دَخَلَ الْمَسْجِدَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ قَالَ اللَّهُمَّ ارْحَمْنِي وَمُحَمَّدًا وَلَا تَرْحَمْ مَعَنَا أَحَدًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ تَحَجَّرْتَ وَاسِعًا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک اعرابی مسجد میں داخل ہوا۔اس نے دو رکعتیں پڑھیں،پھر کہنے لگا: [اللھم! ارحمنی………] ’’اے اللہ! مجھ پر اور محمد ﷺ پر رحم فرما۔ہمارے ساتھ کسی اور پر رحم نہ فرما۔‘‘ رسول اللہ ﷺ نے فرمایا: ’’تو نے ایک وسیع چیز کو تنگ کر دیا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;