var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْحِ عَلَى الْخُفَّيْنِ أَنَّهُ لَا بَأْسَ بِهِ";
nasai.urdu = "حضرت سعد بن ابی وقاص رضی اللہ عنہ سے منقول ہے کہ اللہ کے رسول ﷺ نے موزوں پر مسح کے بارے میں فرمایا کہ اس میں کوئی حرج نہیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;