var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ ثُمَّ قَامَ فَلَمْ يَجْلِسْ فَقَامَ النَّاسُ مَعَهُ فَلَمَّا قَضَى صَلَاتَهُ وَنَظَرْنَا تَسْلِيمَهُ كَبَّرَ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ ثُمَّ سَلَّمَ";
nasai.urdu = "حضرت عبداللہ ابن بحینہ رضی اللہ عنہ فرماتے ہیں: رسول اللہ ﷺ نے ہمیں دو رکعتیں پڑھائیں،پھر اٹھ کھڑے ہوئے،بیٹھے نہیں۔لوگ بھی آپ کے ساتھ کھڑے ہوگئے۔جب آپ نے نماز مکمل فرما لی اور ہم آپ کے سلام کے انتظار میں تھے تو آپ نے اللہ اکبر کہہ کر دو سجدے کیے جب کہ آپ سلام سے قبل بیٹھے تھے۔پھر آپ نے سلام پھیرا";
nasai.hukam = "صحیح";
nasai.description = ``;