var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَامَ فِي الصَّلَاةِ وَعَلَيْهِ جُلُوسٌ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ";
nasai.urdu = "حضرت عبداللہ ابن بحینہ سے روایت ہے،رسول اللہ ﷺ نماز میں (دو رکعتوں کے بعد) کھڑے ہوگئے،حالانکہ آپ نے بیٹھنا تھا تو آپ نے (آخر میں) سلام سے پہلے بیٹھے بیٹھے دو سجدے کیے۔";
nasai.hukam = "صحیح";
nasai.description = ``;