var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ أَنَّهُ سَمِعَ أَبَا سَلَمَةَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةَ الظُّهْرِ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَقَالُوا قُصِرَتْ الصَّلَاةُ فَقَامَ وَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْنِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ظہر کی نماز کی دو رکعتیں پڑھا کر سلام پھیر دیا۔لوگوں نے کہا: کیا نماز کم ہوگئی؟ آپ اٹھے اور دو رکعتیں مزید پڑھیں،پھر سلامپ ھیرا،پھر دو سجدے کیے";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;