var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ عُقَيْلٍ قَالَ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ وَأَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ وَابْنِ أَبِي حَثْمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَ لَمْ يَسْجُدْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ قَبْلَ السَّلَامِ وَلَا بَعْدَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہ ﷺ نے اس دن نہ سلام سے پہلے سجدے کیے نہ بعد میں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>الزہري مدلس وعنعن۔`;
nasai.anwaar = [330,1];