var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ يَوْمَ ذِي الْيَدَيْنِ سَجْدَتَيْنِ بَعْدَ السَّلَامِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے ذوالیدین والے واقعہ کے دن سلام کے بعد دو سجدے کیے";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;