var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ قَالَ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ";
nasai.urdu = "(امام نسائی رحمہ اللہ بیان کرتے ہیں:) ہمیں یہ روایت عمرو بن سواد بن اسود نے ابن وہب سے،انھوں نے عمرو بن حارث سے،انھوں نے قتادہ عن محمد ابن سیرین عن أبی ھریرۃ عن رسول اللہ ﷺ کی سند سے بھی اسی طرح بیان فرمائی۔";
nasai.hukam = "صحیح";
nasai.description = ``;