var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ قَالَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ وَحَدَّثَنِي ابْنُ عَوْنٍ وَخَالِدٌ الْحَذَّاءُ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي وَهْمِهِ بَعْدَ التَّسْلِيمِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ نے سہو کے (اس)واقعہ میںسلام کے بعد سجدے کیے";
nasai.hukam = "صحیح";
nasai.description = ``;