var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ قَالَ أَخْبَرَنِي أَشْعَثُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ ابْنِ حُصَيْنٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ فَسَهَا فَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ نے انھیں نماز پڑھائی۔آپ کو سہو ہو گیا۔آپ نے دو سجدے کیے،پھر سلام پھیرا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;