var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ عَنْ أَبِيهِ الْمُغِيرَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ خَرَجَ لِحَاجَتِهِ فَاتَّبَعَهُ الْمُغِيرَةُ بِإِدَاوَةٍ فِيهَا مَاءٌ فَصَبَّ عَلَيْهِ حَتَّى فَرَغَ مِنْ حَاجَتِهِ فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْہ";
nasai.urdu = "حضرت مغیرہ بن شعبہ رضی اللہ عنہ اللہ کے رسول ﷺ کے بارے میں بیان کرتے ہیں کہ آپ قضائے حاجت کے لیے نکلے تو مغیرہ بھی پانی کا لوٹا لے کر آپ کے ساتھ گئے۔جب آپ قضائے حاجت سے فارغ ہوئے تو انھوں نے اعضائے وضو پر پانی بہایا،آپ نے وضو کیا اور اپنے موزوں پر مسح فرمایا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;