var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيَتَحَرَّ وَيَسْجُدْ سَجْدَتَيْنِ بَعْدَ مَا يَفْرُغُ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کسی کو اپنی نماز میں شک پڑ جائے تو وہ صحیح بات جاننے کی کوشش کرے اور فارغ ہونے کے بعد دو سجدے کرے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;