var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ الْحَكَمِ قَالَ سَمِعْتُ أَبَا وَائِلٍ يَقُولُ قَالَ عَبْدُ اللَّهِ مَنْ أَوْهَمَ فِي صَلَاتِهِ فَلْيَتَحَرَّ الصَّوَابَ ثُمَّ يَسْجُدْ سَجْدَتَيْنِ بَعْدَ مَا يَفْرُغُ وَهُوَ جَالِسٌ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ جسے نماز میں وہم ہو جائے تو وہ درست بات تلاش کرے،پھر نماز مکمل کرنے کے بعد بیٹھے بیٹھے دو سجدے کرے";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;