var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ أَنْبَأَنَا الْوَلِيدُ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسَافِعٍ عَنْ عُقْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَكَّ فِي صَلَاتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ بَعْدَ التَّسْلِيمِ";
nasai.urdu = "حضرت عبداللہ بن جعفر رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جس آدمی کو نماز میں شک پڑ جائے تو وہ سلام پھیرنے کے بعد دو سجدے کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;