var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُسَافِعٍ أَنَّ مُصْعَبَ بْنَ شَيْبَةَ أَخْبَرَهُ عَنْ عُقْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَكَّ فِي صَلَاتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ بَعْدَ مَا يُسَلِّمُ";
nasai.urdu = "حضرت عبداللہ بن جعفر رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص اپنی نماز میں شک کرے تو وہ سلام پھیرنے کے بعد دو سجدے کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;