var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا حَجَّاجٌ وَرَوْحٌ هُوَ ابْنُ عُبَادَةَ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُسَافِعٍ أَنَّ مُصْعَبَ بْنَ شَيْبَةَ أَخْبَرَهُ عَنْ عُقْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَكَّ فِي صَلَاتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ قَالَ حَجَّاجٌ بَعْدَ مَا يُسَلِّمُ وَقَالَ رَوْحٌ وَهُوَ جَالِسٌ";
nasai.urdu = "حضرت عبداللہ بن جعفر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس شخص کو اپنی نماز میں شک ہو جائے تو وہ سلام کے بعد بیٹھے بیٹھے دو سجدے کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;