var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي جَاءَهُ الشَّيْطَانُ فَلَبَسَ عَلَيْهِ صَلَاتَهُ حَتَّى لَا يَدْرِيَ كَمْ صَلَّى فَإِذَا وَجَدَ أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی نماز پڑھنے کھڑا ہوتا ہے تو شیطان آکر اس پر اس کی نماز مشتبہ کر دیتا ہے حتی کہ اسے پتہ نہیں چلتا کہ کتنی نماز پڑھی ہے؟ جب تم میں سے کوئی شخص یہ صورت حال پائے تو (یقین کے مطابق نماز مکمل کرکے سلام پھیرے اور) بیٹھے بیٹھے دو سجدے کرے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;