var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلَاةِ قَالَ وَمَا ذَاكَ قَالُوا صَلَّيْتَ خَمْسًا فَثَنَى رِجْلَهُ وَسَجَدَ سَجْدَتَيْنِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ نبی ﷺ نے ظہر کی پانچ رکعتیں پڑھا دیں۔آپ سے عرض کیا گیا: کیا نماز میں اضافہ ہوگیا ہے؟ آپ نے فرمایا: ’’کیا ہوا؟‘‘ لوگوں نے عرض کیا: آپ نے پانچ رکعتیں پڑھی ہیں۔آپ نے اپنا پاؤں موڑا (یعنی قبلہ رخ ہوئے) اور دو سجدے کیے";
nasai.hukam = "متفق علیہ";
nasai.description = ``;