var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الْحَكَمِ وَمُغِيرَةُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى بِهِمْ الظُّهْرَ خَمْسًا فَقَالُوا إِنَّكَ صَلَّيْتَ خَمْسًا فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ وَهُوَ جَالِسٌ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ نے ہمیں ظہر کی نماز پانچ رکعتیں پڑھا دیں۔لوگوں نے کہا: آپ نے پانچ پڑھی ہیں تو آپ نے سلام پھیرنے کے بعد بیٹھے بیٹھے دو سجدے کیے";
nasai.hukam = "صحیح";
nasai.description = ``;