var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ عَنْ إِبْرَاهِيمَ أَنَّ عَلْقَمَةَ صَلَّى خَمْسًا فَلَمَّا سَلَّمَ قَالَ إِبْرَاهِيمُ بْنُ سُوَيْدٍ يَا أَبَا شِبْلٍ صَلَّيْتَ خَمْسًا فَقَالَ أَكَذَلِكَ يَا أَعْوَرُ فَسَجَدَ سَجْدَتَيْ السَّهْوِ ثُمَّ قَالَ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "ابراہیم بن سوید سے مروی ہے کہ حضرت علقمہ نے پانچ رکعتیں پڑھ لیں۔میں نے کہا: اے ابوشبل! (علقمہ کی کنیت ہے) آپ نے پانچ رکعتیں پڑھی ہیں۔کہنے لگے: اے اعور! کیا حقیقتاً ایسے ہی ہے؟ پھر انھوں نے سہو کے دو سجدے کیے۔پھر کہنے لگے: اللہ کے رسول ﷺ نے ایسے ہی کیا تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;