var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ صَفْوَانَ بْنِ عَسَّالٍ قَالَ رَخَّصَ لَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنَّا مُسَافِرِينَ أَنْ لَا نَنْزِعَ خِفَافَنَا ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ";
nasai.urdu = "حضرت صفوان بن عسال رضی اللہ عنہ سے روایت ہے،انھوں نے کہا: نبی ﷺ نے ہمیں اجازت دی کہ جب ہم مسافر ہوں تو تین دن رات تک اپنے موزے نہ اتاریں۔(بلکہ مسح کرتے رہیں۔)";
nasai.hukam = "حسن";
nasai.description = ``;