var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا جَلَسَ فِي الصَّلَاةِ وَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ وَرَفَعَ أُصْبُعَهُ الَّتِي تَلِي الْإِبْهَامَ فَدَعَا بِهَا وَيَدُهُ الْيُسْرَى عَلَى رُكْبَتِهِ بَاسِطُهَا عَلَيْهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ جب نماز میں بیٹھتے تو اپنے دونوں ہاتھ اپنے گھٹنوں پر رکھتے اور انگوٹھے کے ساتھ والی انگلی اٹھاتے اور اس کے ساتھ دعا کرتے اور بائیں ہاتھ کو کھول کر گھٹنے پر رکھتے";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;