var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ الْمَوْصِلِيُّ عَنْ الْمُعَافَى عَنْ عِصَامِ بْنِ قُدَامَةَ عَنْ مَالِكٍ وَهُوَ ابْنُ نُمَيْرٍ الْخُزَاعِيُّ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاضِعًا يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى فِي الصَّلَاةِ وَيُشِيرُ بِأُصْبُعِهِ";
nasai.urdu = "حضرت نمیر خزاعی رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: میں نے رسول اللہ ﷺ کو دوران نماز میں دایاں ہاتھ دائیں ران پر رکھے ہوئے دیکھا۔آپ اپنی انگلی سے اشارہ فرما رہے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;