var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ حَدَّثَنَا ابْنُ عَجْلَانَ عَنْ الْقَعْقَاعِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا كَانَ يَدْعُو بِأُصْبُعَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحِّدْ أَحِّدْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،ایک آدمی اپنی دو انگلیوں سے اشارہ کر رہا تھا تو رسول اللہ ﷺ نے فرمایا: ’’ایک انگلی سے اشارہ کر۔ایک انگلی سے اشارہ کر۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ترمذی (3557)`;
nasai.anwaar = [330,2];