var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ سَعْدٍ قَالَ مَرَّ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَدْعُو بِأَصَابِعِي فَقَالَ أَحِّدْ أَحِّدْ وَأَشَارَ بِالسَّبَّابَةِ";
nasai.urdu = "حضرت سعد رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ میرے پاس گزرے جبکہ میں اپنی کئی انگلیوں سے اشارہ کر رہا تھا۔آپ ﷺ نے فرمایا: ’’ایک سے کر۔ایک سے کر۔‘‘ اور آپ نے اپنی (دائیں ہاتھ کی) انگشت شہادت کے ساتھ اشارہ کیا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1499)`;
nasai.anwaar = [331,1];