var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَعَدَ فِي التَّشَهُّدِ وَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَأَشَارَ بِالسَّبَّابَةِ لَا يُجَاوِزُ بَصَرُهُ إِشَارَتَهُ";
nasai.urdu = "حضرت عبداللہ بن زبیر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ جب تشہد میں بیٹھتے تو اپنی بائیں ہتھیلی اپنی بائیںران پر رکھتے اور (دائیں ہاتھ کی) انگشت شہادت سے اشارہ فرماتے۔آپ کی نظر اشارے سے آگے نہیں جاتی تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;