var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي اللَّيْثُ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ رَفْعِ أَبْصَارِهِمْ عِنْدَ الدُّعَاءِ فِي الصَّلَاةِ إِلَى السَّمَاءِ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’لوگ نماز کے دوران میں دعا کے وقت آسمان کی طرف نظریں اٹھانے سے باز آ جائیں ورنہ ان کی نظریں اچک لی جائیں گی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;