var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدٍ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنْ الْقُرْآنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ ہمیں تشہد اس طرح سکھاتے تھے جس طرح قرآن مجید کی کوئی سورت سکھاتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;