var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا الثَّوْرِيُّ عَنْ عَمْرِو بْنِ قَيْسٍ الْمُلَائِيِّ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ شُرَيْحِ بْنِ هَانِئٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُسَافِرِ ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ وَيَوْمًا وَلَيْلَةً لِلْمُقِيمِ يَعْنِي فِي الْمَسْحِ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے مروی ہے کہ اللہ کے رسول ﷺ نے مسافر کے لیے تین دن رات اور مقیم کے لیے ایک دن رات موزوں پر مسح کی مدت مقرر فرمائی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;