var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْحَكَمِ الْوَرَّاقُ قَالَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ عَنْ سُفْيَانَ بْنِ سَعِيدٍ ح و أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ وَعَبْدُ الرَّزَّاقِ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ عَنْ زَاذَانَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِلَّهِ مَلَائِكَةً سَيَّاحِينَ فِي الْأَرْضِ يُبَلِّغُونِي مِنْ أُمَّتِي السَّلَامَ";
nasai.urdu = "حضرت عبداللہ بن مسعود ری اللہ عنہ سے روایت ہے،رسول اللہ ﷺ بیان کرتے ہیں کہ ’’تحقیق اللہ تعالیٰ نے کچھ فرشتے مقرر کر رکھے ہیں جو زمین میں ہر وقت چلتے پھرتے رہتے ہیں۔وہ مجھے میری امت کی طرف سے سلام پہنچاتے ہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;