var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْأُمَوِيُّ فِي حَدِيثِهِ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ حَكِيمٍ عَنْ خَالِدِ بْنِ سَلَمَةَ عَنْ مُوسَى بْنِ طَلْحَةَ قَالَ سَأَلْتُ زَيْدَ بْنَ خَارِجَةَ قَالَ أَنَا سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ صَلُّوا عَلَيَّ وَاجْتَهِدُوا فِي الدُّعَاءِ وَقُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ";
nasai.urdu = "حضرت موسیٰ بن طلحہ بیان کرتے ہیں کہ میں نے حضرت زید بن خارجہ رضی اللہ عنہ سے پوچھا،انھوں نے فرمایا: میں نے رسول اللہ ﷺ سےپوچھا تھا تو آپ نے فرمایا تھا: ’’مجھ پر درود پڑھو اور خوب کوشش سے دعا کرو اور کہو:[اللھم! صلی علی محمد و علی آل محمد] ’’اے اللہ!محمد (ﷺ) اور آل محمد پر خصوصی رحمتیں نازل فرما۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;