var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى عَلَيَّ صَلَاةً وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرَ صَلَوَاتٍ وَحُطَّتْ عَنْهُ عَشْرُ خَطِيئَاتٍ وَرُفِعَتْ لَهُ عَشْرُ دَرَجَاتٍ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص مجھ پر ایک دفعہ درود پڑھےگا،اللہ تعالیٰ اس پر دس رحمتیںنازل فرمائے گا اور اس کی دس غلطیاں معاف کر دی جائیں گی اور اس کے دس درجےبلند کیے جائیں گے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;