var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي صَلَاتِهِ بَعْدَ التَّشَهُّدِ أَحْسَنُ الْكَلَامِ كَلَامُ اللَّهِ وَأَحْسَنُ الْهَدْيِ هَدْيُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ اپنی نماز میں تشہد کے بعد یہ الفاظ کہتے تھے: (وأحسن الکلام کلام اللہ و أحسن الھدی ھدی محمد ﷺ] ’’سب سے بہترین کلام اللہ تعالیٰ کا کلام ہے اور سب سے اچھا طریقہ محمد ﷺ کا طریقہ ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;