var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ دَاوُدَ الْهَاشِمِيَّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ وَهُوَ ابْنُ سَعْدٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ جَعْفَرٍ وَهُوَ ابْنُ الْمِسْوَرِ الْمَخْرَمِيُّ عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ";
nasai.urdu = "حضرت سعد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ (نماز کے آخر میں) دائیں بائیں (منہ موڑتے تھے اور) سلام کہتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;