var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيَّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْخَلَاءِ فَقُرِّبَ إِلَيْهِ طَعَامٌ فَقَالُوا أَلَا نَأْتِيكَ بِوَضُوءٍ فَقَالَ إِنَّمَا أُمِرْتُ بِالْوُضُوءِ إِذَا قُمْتُ إِلَى الصَّلَاةِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ اللہ کے رسول ﷺ بیت الخلا سے باہر تشریف لائے اور آپ کو کھانا پیش کیا گیا۔صحابہ نے پوچھا کہ ہم آپ کے لیے وضو کا پانی نہ لائیں؟ آپ نے فرمایا ’’مجھے وضو کا حکم صرف اس وقت ہے جب میں نماز کے لیے اٹھوں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;