var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَيْدُ بْنُ أَخْزَمَ عَنْ ابْنِ دَاوُدَ يَعْنِي عَبْدَ اللَّهِ بْنَ دَاوُدَ الْخُرَيْبِيَّ عَنْ عَلِيِّ بْنِ صَالِحٍ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ خَدِّهِ عَنْ يَمِينِهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَعَنْ يَسَارِهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ گویا میں نبی ﷺ کے رخستار کی سفیدی کو دیکھ رہا ہوں،آپ اپنی دائیں طرف فرماتے: [السلام علیکم و رحمۃ اللہ] اور بائیں طرف فرماتے: [السلام علیکم و رحمۃ اللہ]۔";
nasai.hukam = "صحیح";
nasai.description = ``;