var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ عُمَرَ بْنِ عُبَيْدٍ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَلِّمُ عَنْ يَمِينِهِ حَتَّى يَبْدُوَ بَيَاضُ خَدِّهِ وَعَنْ يَسَارِهِ حَتَّى يَبْدُوَ بَيَاضُ خَدِّهِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ دائیں طرف سلام پھیرتے حتی کہ آپ کے رخسار کی سفیدی نظر آتی،پھر بائیں طرف حتی کہ آپ کے رخسار کی سفیدی نظر آتی۔";
nasai.hukam = "صحیح";
nasai.description = ``;