var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ مِنْ هَاهُنَا وَبَيَاضُ خَدِّهِ مِنْ هَاهُنَا";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ اپنی دائیں اور بائیں طرف سلام پھیرتے (اور کہتے:) [السلام علیکم و رحمۃ اللہ،السلام علیکم و رحمۃ اللہ] حتی کہ دائیں طرف بھی آپ کے رخسار کی سفیدی نظر آتی اور بائیں طرف بھی آپ کے رخسار کی سفیدی نظر آتی۔";
nasai.hukam = "صحیح";
nasai.description = ``;