var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ قَالَ حَدَّثَنَا ضَمْضَمُ بْنُ جَوْسٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْ السَّهْوِ وَهُوَ جَالِسٌ ثُمَّ سَلَّمَ قَالَ ذَكَرَهُ فِي حَدِيثِ ذِي الْيَدَيْنِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے سلام پھیرا،پھر بیٹھے بیٹھے سہو کے دو سجدے کیے،پھر سلام پھیرا۔(امام نسائی رحمہ اللہ نے) فرمایا: ذوالیدین کی حدیث میں بھی اس کا ذکر ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;