var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ قَالَ حَدَّثَنَا خَالِدٌ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى ثَلَاثًا ثُمَّ سَلَّمَ فَقَالَ الْخِرْبَاقُ إِنَّكَ صَلَّيْتَ ثَلَاثًا فَصَلَّى بِهِمْ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْ السَّهْوِ ثُمَّ سَلَّمَ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہما سے مروی ہے کہ نبی ﷺ نے تین رکعتوں کے بعد سلام پھیر دیا۔حضرت خرباق رضی اللہ عنہ نے کہا: آپ نے تین رکعتیں پڑھی ہیں۔آپ نے انھیں بقیہ رکعت پڑھائی،پھر سلام پھیرا،پھر سہو کے دو سجدے کیے،پھر سلام پھیرا۔";
nasai.hukam = "صحیح";
nasai.description = ``;