var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي يَعْلَى بْنُ عَطَاءٍ عَنْ جَابِرِ بْنِ يَزِيدَ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ أَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ فَلَمَّا صَلَّى انْحَرَفَ";
nasai.urdu = "حضرت یزید بن اسود رضی اللہ عنہ سے روایت ہے کہ انھوں نے رسول اللہ ﷺ کے ساتھ صبح کی نماز پڑھی،جب آپ نماز پڑھ چکے تو آپ نے اپنا رخ (قبلے سے) موڑ لیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;