var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى وَمُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ صُدْرَانَ عَنْ خَالِدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَلَّمَ قَالَ اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ جب سلام پھیرتے تو یوں فرماتے: [اللھم أنت السلام ……… والإکرام] ’’اے اللہ! تو سلام ہے اور تجھی سے سلامتی ملتی ہے۔اے احترام و عزت والے! تو بابرکت ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;