var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ سَمُرَةَ عَنْ أَسْبَاطٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ قَيْسٍ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعَقِّبَاتٌ لَا يَخِيبُ قَائِلُهُنَّ يُسَبِّحُ اللَّهَ فِي دُبُرِ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ وَيَحْمَدُهُ ثَلَاثًا وَثَلَاثِينَ وَيُكَبِّرُهُ أَرْبَعًا وَثَلَاثِينَ";
nasai.urdu = "حضرت کعب بن عجرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’فرض نمازوں کے بعد پڑھے جانےوالے کچھ ایسے کلمات ہیں جنھیں پڑھنے والا کبھی ناکام نہیں ہوتا۔ہر نماز کے بعد تینتیس دفعہ سبحان اللہ،تینتیس دفعہ الحمدللہ اور چونتیس دفعہ اللہ اکبر پڑھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;