var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ يَعْنِي ابْنَ طَهْمَانَ عَنْ الْحَجَّاجِ بْنِ الْحَجَّاجِ عَنْ أَبِي الزُّبَيْرِ عَنْ أَبِي عَلْقَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَبَّحَ فِي دُبُرِ صَلَاةِ الْغَدَاةِ مِائَةَ تَسْبِيحَةٍ وَهَلَّلَ مِائَةَ تَهْلِيلَةٍ غُفِرَتْ لَهُ ذُنُوبُهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص صبح کی نماز کے بعد سو دفعہ سبحان اللہ اور سو دفعہ لا إلہ إلا اللہ پڑھے،اس کے سب گناہ معاف ہو جائیں گے اگرچہ وہ سمندر کی جھاگ کےبرابر ہوں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أبو الزبیر عنعن۔`;
nasai.anwaar = [331,1];