var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ وَالْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّارِعُ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا عَثَّامُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُ التَّسْبِيحَ";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو تسبیحات شمار کرتے دیکھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;