var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا أَبُو عَتَّابٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي حَيَّةَ قَالَ رَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ ثَلَاثًا ثَلَاثًا ثُمَّ قَامَ فَشَرِبَ فَضْلَ وَضُوئِهِ وَقَالَ صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا صَنَعْتُ";
nasai.urdu = "حضرت ابوحیہ سے منقول ہے،انھوں نے فرمایا: میں نے حضرت علی رضی اللہ عنہ کو دیکھا،آپ نے اعضائے وضو کو تین تین دفعہ دھویا،پھر کھڑے ہوکر وضو سے بچا ہوا پانی پیا اور فرمایا: اللہ کے رسول ﷺ نے ایسے ہی کیا جیسے میں نے کیا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;