var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ السُّدِّيِّ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ كَيْفَ أَنْصَرِفُ إِذَا صَلَّيْتُ عَنْ يَمِينِي أَوْ عَنْ يَسَارِي قَالَ أَمَّا أَنَا فَأَكْثَرُ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْصَرِفُ عَنْ يَمِينِهِ";
nasai.urdu = "حضرت سدی سے روایت ہے کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا کہ جب میں نماز سے فارغ ہو جاؤں تو کیسے اٹھوں؟ دائیں جانب سے یا بائیں جانب سے؟ انھوں نے فرمایا: میں نے تو رسول اللہ ﷺ کو عمومی طور پر دائیں جانب مڑ کر اٹھتے دیکھا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;