var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ عُمَارَةَ عَنْ الْأَسْوَدِ قَالَ قَالَ عَبْدُ اللَّهِ لَا يَجْعَلَنَّ أَحَدُكُمْ لِلشَّيْطَانِ مِنْ نَفْسِهِ جُزْءًا يَرَى أَنَّ حَتْمًا عَلَيْهِ أَنْ لَا يَنْصَرِفَ إِلَّا عَنْ يَمِينِهِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرَ انْصِرَافِهِ عَنْ يَسَارِهِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ تم میں سے کوئی شخص اپنے آپ پر شیطان کا حصہ نہ رکھے کہ وہ اپنے آپ پر ضروری قرار دے کہ صرف دائیں جانب ہی سے مڑے گا۔بلاشبہ میں نے تو رسول اللہ ﷺ کو اکثر بائیں جانب سے مڑتے دیکھا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;