var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا بَقِيَّةُ قَالَ حَدَّثَنَا الزُّبَيْدِيُّ أَنَّ مَكْحُولًا حَدَّثَهُ أَنَّ مَسْرُوقَ بْنَ الْأَجْدَعِ حَدَّثَهُ عَنْ عَائِشَةَ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ قَائِمًا وَقَاعِدًا وَيُصَلِّي حَافِيًا وَمُنْتَعِلًا وَيَنْصَرِفُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے دیکھا کہ رسول اللہ ﷺ کھڑے ہوکر بھی پانی پی لیتے تھے اور بیٹھ کر بھی۔ننگے پاؤں بھی نماز پڑھ لیا کرتے تھے اور جوتے پہن کر بھی اور نمازیوں کی طرف دائیں طرف سے بھی مڑ جاتے تھے اور بائیں طرف سے بھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;