var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ النِّسَاءُ يُصَلِّينَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفَجْرَ فَكَانَ إِذَا سَلَّمَ انْصَرَفْنَ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ فَلَا يُعْرَفْنَ مِنْ الْغَلَسِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ عورتیں رسول اللہ ﷺ کے پیچھے فجر کی نماز پڑھتی تھیں۔جب آپ سلام پھیرتے تو وہ فوراً اٹھ کر چلی جاتیں۔انھوں نے بڑی چادریں لپیٹی ہوتی تھیں اور اندھیرے کی وجہ سے انھیں پہچانا نہیں جا سکتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;