var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ عَبِيدَةَ بْنِ سُفْيَانَ الْحَضْرَمِيِّ عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ وَكَانَتْ لَهُ صُحْبَةٌ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ ثَلَاثَ جُمَعٍ تَهَاوُنًا بِهَا طَبَعَ اللَّهُ عَلَى قَلْبِهِ";
nasai.urdu = "حضرت ابوالجعد ضمری سے روایت ہے ……… انھیں شرف صحابیت حاصل تھا رضی اللہ عنہ ……… کہ نبی ﷺ نے فرمایا: ’’جس آدمی نے سستی کرتے ہوئے اور معمولی سمجھتے ہوئے تین جمعے چھوڑ دیے تو اللہ تعالیٰ اس کے دل پر (نفاق کی) مہر لگا دیتا ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;