var nasai = {};
nasai.arabic = "أَخْبَرَنِي مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنِي الْمُفَضَّلُ بْنُ فَضَالَةَ عَنْ عَيَّاشِ بْنِ عَبَّاسٍ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَوَاحُ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ";
nasai.urdu = "نبی ﷺ کی زوجۂ محترمہ حضرت حفصہ رضی اللہ عنہا سے مروی ہے،نبی ﷺ نے فرمایا: ’’جمعے کے لیے جانا ہر بالغ مسلمان پر فرض ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;