var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ قُدَامَةَ بْنِ وَبَرَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص بلاعذر جمعہ چھوڑ دے تو اسے چاہیے وہ ایک دینار صدقہ کرے۔اگر اس کے پاس دنیار نہ ہو تو نصف دینار صدقہ کرے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `(الف) إسنادہ ضعیف<br>ابو داود (1053) ابن ماجہ (1128)<br>قتادۃ عنعن۔`;
nasai.anwaar = [331,1];