var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْأَعْرَجُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ عَلَيْهِ السَّلَام وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بہترین دن جس میں سورج طلوع ہوا ہے،جمعہ کا دن ہے۔اسی دن حضرت آدم علیہ السلام پیدا ہوئے،اسی دن جنت میں داخل کیے گئے اور اسی دن جنت سے نکالے گئے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;