var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا بِشْرٌ قَالَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ رَجُلٍ مُسْلِمٍ فِي كُلِّ سَبْعَةِ أَيَّامٍ غُسْلُ يَوْمٍ وَهُوَ يَوْمُ الْجُمُعَةِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقولہے،رسول اللہ ﷺ نے فرمایا: ’’ہر مسلمان آدمی کے لیے ہر سات دنوں میںایک دن غسل کرنا ضروری ہے اور وہ دن جمعۃ المبارک ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;