var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ قَالَ سَمِعْتُ ابْنَ الْمُنْكَدِرِ يَقُولُ سَمِعْتُ جَابِرًا يَقُولُ مَرِضْتُ فَأَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ يَعُودَانِي فَوَجَدَانِي قَدْ أُغْمِيَ عَلَيَّ فَتَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَبَّ عَلَيَّ وَضُوءَهُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ فرماتے ہیں کہ میں بیمار ہو گیا تو اللہ کے رسول ﷺ اور حضرت ابوبکر رضی اللہ عنہ میری بیمار پرسی کے لیے تشریف لائے تو مجھے بے ہوش پایا۔آپ نے وضو فرمایا اور وضو کا پانی مجھ پر ڈالا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;