var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ قَالَ حَدَّثَنَا اللَّيْثُ قَالَ حَدَّثَنَا خَالِدٌ عَنْ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ أَنَّ عَمْرَو بْنَ سُلَيْمٍ أَخْبَرَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْغُسْلَ يَوْمَ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَالسِّوَاكَ وَأَنْ يَمَسَّ مِنْ الطِّيبِ مَا يَقْدِرُ عَلَيْهِ";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جمعے کے دن غسل کرنا ہر بالغ مرد پر ضروری ہے،نیز وہ مسواک کرے اور جو خوشبو حاصل کرسکے،لگائے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;