var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْبَلُ اللَّهُ صَلَاةً بِغَيْرِ طُهُورٍ وَلَا صَدَقَةً مِنْ غُلُولٍ";
nasai.urdu = "حضرت ابو ملیح اپنے والد محترم سے بیان کرتے ہیں،انھوں نے کہا کہ رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ کوئی نماز بغیر طہارت (وضو) کے قبول نہیں فرماتا اور نہ حرام مال سے صدقہ قبول فرماتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;