var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا قُلْتُ أَيَّةَ سَاعَةٍ قَالَ زَوَالُ الشَّمْسِ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ ہم رسول اللہ ﷺ کے ساتھ جمعے کی نماز پڑھتے،پھر واپس آکر اپنے پانی ڈھونے والے اونٹوں کو آرام کا موقع دیتے۔حضرت محمد باقر نے (حضرت جابر رضی اللہ عنہ سے) پوچھا: کس وقت؟ انھوں نے فرمایا: زوال کے وقت۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;