var nasai = {};
nasai.arabic = "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ يَعْلَى بْنِ الْحَارِثِ قَالَ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِ يُحَدِّثُ عَنْ أَبِيهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ وَلَيْسَ لِلْحِيطَانِ فَيْءٌ يُسْتَظَلُّ بِهِ";
nasai.urdu = "حضرت سلمہ بن اکوع رضی اللہ عنہ فرماتے ہیں کہ ہم رسول اللہ ﷺ کے ساتھ جمعے کی نماز پڑھ کر واپس لوٹتے تھے تو دیواروں کا سایہ اتنا نہیں ہوتا تھا کہ ان سے (اپنے آپ کو) سایہ مہیا کیا جا سکے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;