var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَ كَانَ بِلَالٌ يُؤَذِّنُ إِذَا جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَإِذَا نَزَلَ أَقَامَ ثُمَّ كَانَ كَذَلِكَ فِي زَمَنِ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا";
nasai.urdu = "حضرت سسائب بن زیدی رضی اللہ عنہ نے فرمایا: جب رسول اللہ ﷺ جمعے کے دن منبر پر بیٹھتے تھے تو حضرت بلال رضی اللہ عنہ اذان کہتے،پھر جب (دو خطبوں کے بعد) آپ منبر سے اترتے تو بلال اقامت کہتے۔حضرت ابوبکر و عمر رضی اللہ عنہما کے زمانے میں بھی ایسے ہی رہا۔";
nasai.hukam = "صحیح";
nasai.description = ``;