var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَاءَ أَحَدُكُمْ وَقَدْ خَرَجَ الْإِمَامُ فَلْيُصَلِّ رَكْعَتَيْنِ قَالَ شُعْبَةُ يَوْمَ الْجُمُعَةِ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہا،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی شخص (جمعے کے لیے) آئے جب کہ امام (خطبے کے لیے) نکل چکا ہو تو وہ (مختصر سی) دو رکعتیں پڑھے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;