var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا جَعْفَرٌ هُوَ ابْنُ سُلَيْمَانَ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ وَقَّتَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَصِّ الشَّارِبِ وَتَقْلِيمِ الْأَظْفَارِ وَحَلْقِ الْعَانَةِ وَنَتْفِ الْإِبْطِ أَنْ لَا نَتْرُكَ أَكْثَرَ مِنْ أَرْبَعِينَ يَوْمًا وَقَالَ مَرَّةً أُخْرَى أَرْبَعِينَ لَيْلَةً";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سےروایت ہے کہ رسول اللہ ﷺ نے موننچھیں کاٹنے،ناخن تراشنے،زیر ناف کے بال مونڈنے اور بغلوں کے بال اکھیڑنے کی لیے یہ مدت مقرر کی ہے کہ ہم چالیس دن سے زائد نہ گزرنے دیں۔اور ایک دفعہ راوی نے چالیس رات کہا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;