var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا يَعْلَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُ عَنْ الْوُضُوءِ فَأَرَاهُ الْوُضُوءَ ثَلَاثًا ثَلَاثًا ثُمَّ قَالَ هَكَذَا الْوُضُوءُ فَمَنْ زَادَ عَلَى هَذَا فَقَدْ أَسَاءَ وَتَعَدَّى وَظَلَمَ";
nasai.urdu = "عمرو بن شعیب اپنے باپ اور وہ اپنے دادا سے بیان کرتے ہیں کہ ایک دیہاتی نبی ﷺ کے پاس آیا۔وہ آپ سے وضو کا طریقہ پوچھتا تھا۔آپ نے اسے تین تین دفعہ اعضائے وضو دھو کر دکھائے،پھر فرمایا: ’’وضو اس طرح ہے۔جس نے اس سے زیادہ کیا،اس نے برا کیا،حد سے بڑھا اور ظلم کا ارتکاب کیا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;