var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ قَالَ كُنْتُ جَالِسًا إِلَى جَانِبِهِ يَوْمَ الْجُمُعَةِ فَقَالَ جَاءَ رَجُلٌ يَتَخَطَّى رِقَابَ النَّاسِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْ اجْلِسْ فَقَدْ آذَيْتَ";
nasai.urdu = "حضرت ابو زاہریہ بیان کرتے ہیں کہ میں جمعے کے دن حضرت عبداللہ بن بسر رضی اللہ عنہ کے پہلو میں بیٹھا ہوا تھا تو انھوں نے کہا: (رسول اللہ ﷺ کے دور میں) ایک آدمی لوگوں کی گردنیں پھلانگتا ہوا آیا تو اس سے رسول اللہ ﷺ نے فرمایا: ’’او! بیٹھ جاؤ۔تم نے لوگوں کو تکلیف دی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;