var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ وَيُوسُفُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ جَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَقَالَ لَهُ أَرَكَعْتَ رَكْعَتَيْنِ قَالَ لَا قَالَ فَارْكَعْ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ ایک آدمی آیا جب کہ نبی ﷺ جمعے کے دن منبر پر (خطبہ دے رہے) تھے۔آپ نے اس سے فرمایا: ’’تو نے دو رکعتیں پڑھی ہیں؟‘‘ اس نےکہا: نہیں۔آپ نے فرمایا: ’’پھر پڑھ۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;