var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ لِصَاحِبِهِ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ أَنْصِتْ فَقَدْ لَغَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،نبی ﷺ نے فرمایا: ’’جس شخص نے جمعے کے دن خطبے کی حالت میں اپنے ساتھی سے کہا: ’’چپ رہ‘‘ اس نے بھی لغوبات کی۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;