var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا: ’’جب تو نے جمعے کے دن،جبکہ امام خطبہ دے رہا ہو،اپنے ساتھی سے کہا: ’’چپ ہو جا‘‘ تو تو نے لغو کام کیا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;