var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے خطبہ دیا،اس میں فرمایا: ’’جب تم میں سے کوئی شخص جمعے کے لیے جائے تو وہ غسل کرے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;