var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ إِبْرَاهِيمَ بْنِ نَشِيطٍ أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ الْغُسْلِ يَوْمَ الْجُمُعَةِ فَقَالَ سُنَّةٌ وَقَدْ حَدَّثَنِي بِهِ سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَكَلَّمَ بِهَا عَلَى الْمِنْبَرِ";
nasai.urdu = "ابراہیم بن نشیط نے حضرت ابن شہاب زہری سے جمعے کے دن غسل کرنے کے بارے میں پوچھا تو انھوں نے کہا: سنت ہے اور مجھے یہ بات حضرت سالم نے اپنے والد محترم سے بیان کی کہ اللہ کے رسول ﷺ نے یہ بات منبر پر ارشاد فرمائی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>عبد اللہ بن وھب مدلس و عنعن۔<br>وحدیث البخاري (894،919) ومسلم (844) یغني عنہ۔`;
nasai.anwaar = [332,1];