var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّيْتَ قَالَ لَا قَالَ قُمْ فَارْكَعْ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ ایک دفعہ نبی ﷺ جمعے کے دن خطبہ دے رہے تھے کہ ایک آدمی آیا۔نبی ﷺ نے اس سے فرمایا: ’’تو نے نماز پڑھی ہے؟‘‘ اس نے کہا: نہیں۔آپ نے فرمایا: ’’اٹھ اور (دو رکعتیں) پڑھ۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;