var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا هَارُونُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا عَلِيٌّ وَهُوَ ابْنُ الْمُبَارَكِ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ ابْنَةِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ حَفِظْتُ ق وَالْقُرْآنِ الْمَجِيدِ مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ";
nasai.urdu = "حضرت حارثہ بن نعمان رضی اللہ عنہ کی بیٹی ام ہشام رضی اللہ عنہا بیان کرتی ہیں کہ میں نے سورۂ (قo والقرآن المجید) جمعے کے دن منبر پر رسول اللہ ﷺ کی زبان مبارک سے سن سن کر یاد کی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;