var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حُصَيْنٍ أَنَّ بِشْرَ بْنَ مَرْوَانَ رَفَعَ يَدَيْهِ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فَسَبَّهُ عُمَارَةُ بْنُ رُوَيْبَةَ الثَّقَفِيُّ وَقَالَ مَا زَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذَا وَأَشَارَ بِإِصْبَعِهِ السَّبَّابَةِ";
nasai.urdu = "حضرت حصین سے روایت ہے کہ بشر بن مروان نے جمعے کے دن منبر پر (جوش خطابت میں) دونوں ہاتھ اٹھائے تو حضرت عمارہ بن رویبہ ثقفی رضی اللہ عنہ نے اسے ڈانٹا اور فرمایا: رسول اللہ ﷺ اس سے زائد اشارہ نہیں کرتے تھے،پھر انھوں نے اپنے دائیں ہاتھ کی انگشت شہادت سے اشارہ کیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;