var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ جَالَسْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا رَأَيْتُهُ يَخْطُبُ إِلَّا قَائِمًا وَيَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ الْخُطْبَةَ الْآخِرَةَ";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ میں نبی ﷺ کے ساتھ بیٹھتا رہا ہوں۔میں نے کبھی آپ کو خطبہ دیتے نہیں دیکھا مگر کھڑے ہوکر ہی۔آپ درمیان میں بیٹھتے،پھر دوبارہ کھڑے ہوتے اور دوسرا خطبہ ارشاد فرماتے";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;