var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ الْخُطْبَتَيْنِ وَهُوَ قَائِمٌ وَكَانَ يَفْصِلُ بَيْنَهُمَا بِجُلُوسٍ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ کھڑے ہوکر دو خطبے ارشاد فرماتے تھے اور درمیان میں بیٹھتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;