var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ وَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلَاتُهُ قَصْدًا";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کھڑے ہوکر خطبہ ارشاد فرماتے تھے،پھر بیٹھ جاتے،پھر کھڑے ہو جاتے اور قرپن مجید کی چند آیات تلاوت فرماتے اور اللہ تعالیٰ کا ذکر کرتے۔آپ کا خطبہ بھی درمیانہ ہوتا تھا اور نماز بھی درمیانی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;