var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا الْفِرْيَابِيُّ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْزِلُ عَنْ الْمِنْبَرِ فَيَعْرِضُ لَهُ الرَّجُلُ فَيُكَلِّمُهُ فَيَقُومُ مَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى يَقْضِيَ حَاجَتَهُ ثُمَّ يَتَقَدَّمُ إِلَى مُصَلَّاهُ فَيُصَلِّي";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ (دو خطبوں کے بعد) منبر سے اترتے تو کبھی کوئی آدمی آپ کے سامنے آکر آپ سے باتیں شروع کر دیتا۔نبی ﷺ اس کے ساتھ کھڑے رہتے حتی کہ وہ بات چیت مکمل کرتا۔پھر آپ اپنی مخصوص جائے نماز کی طرف بڑھتے اور نماز پڑھتے،یعنی پڑھاتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1120) ترمذی (517) ابن ماجہ (1117)`;
nasai.anwaar = [332,1];