var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي مُخَوَّلٌ قَالَ سَمِعْتُ مُسْلِمًا الْبَطِينَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ يَوْمَ الْجُمُعَةِ فِي صَلَاةِ الصُّبْحِ الم تَنْزِيلُ وَ هَلْ أَتَى عَلَى الْإِنْسَانِ وَفِي صَلَاةِ الْجُمُعَةِ بِسُورَةِ الْجُمُعَةِ وَالْمُنَافِقِينَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ جمعے کے دن صبح کی نماز میں سورۂ (المo تنزیل) اور سورۂ (ھل اتی علی الانسان) اور جمعے کی نماز میں سورۂ جمعہ اور سورۂ منافقوں پڑھا کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;