var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مَعْبَدُ بْنُ خَالِدٍ عَنْ زَيْدِ بْنِ عُقْبَةَ عَنْ سَمُرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جمعے کی نماز (کی پہلی رکعت) میں سورۂ (سبح اسم ربک الاعلی) اور (دوسری رکعت میں) (ھل اتک حدیث الغاشیۃ) پڑھا کرتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;