var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ مَاذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ";
nasai.urdu = "حضرت ضحاک بن قیس نے حضرت نعمان بن بشیر رضی اللہ عنہما سے پوچھا کہ رسول اللہ ﷺ جمعے کے دن سورۂ جمعہ کے بعد (دوسری رکعت میں) کون سی سورت پڑھا کرتے تھے؟ انھوں نے فرمایا: (ھل اتک حدیث الغاشیۃ)";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;