var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ أَنَّ إِبْرَاهِيمَ بْنَ مُحَمَّدِ بْنِ الْمُنْتَشِرِ أَخْبَرَهُ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ فَيَقْرَأُ بِهِمَا فِيهِمَا جَمِيعًا";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ جمعے کی نماز میں (سبح اسم ربک الاعلی) اور (ھل اتک حدیث الغاشیۃ) پڑھا کرتے تھے۔کبھی عید اور جمعہ ایک دن آ جاتے تو یہی دو سورتیں دونوں میں پڑھتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;