var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ عَنْ يَزِيدَ وَهُوَ ابْنُ هَارُونَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ يُطِيلُ فِيهِمَا وَيَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما جمعے کے بعد دو رکعتیں پڑھتے تھے اور انھیں لمبا کرتے تھے،نیز وہ فرماتے تھے: رسول اللہ ﷺ بھی اسی طرح کیا کرتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;