var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ عَزَّ وَجَلَّ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ قُلْنَا يُقَلِّلُهَا يُزَهِّدُهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ حضرت ابوالقاسم ﷺ نے فرمایا: ’’یقیناً جمعے کے دن ایک ایسا مخصوص وقت ہے جسے جو بھی مسلمان شخص کھڑا نماز پڑھتا ہوا پالے اور اس میں اللہ تعالیٰ سے کوئی چیز مانگتا ہو تو اللہ تعالیٰ اسے ضرور وہ چیز دے دیتا ہے۔‘‘ پ ﷺ (ہاتھ کے اشارے سے) اس وقت کو بہت قلیل بتاتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;