var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ لَا يَخَافُ إِلَّا رَبَّ الْعَالَمِينَ يُصَلِّي رَكْعَتَيْنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ مکہ سے مدینہ کی طرف نکلے (اور چار رکعت والی نمازیں) دو رکعت ہی پڑھتے رہے،حالانکہ رب العالمین کے سوا آپ کو کسی کا ڈر نہ تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;