var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كُنَّا نَسِيرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ لَا نَخَافُ إِلَّا اللَّهَ عَزَّ وَجَلَّ نُصَلِّي رَكْعَتَيْنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ ہم مکہ مکرمہ اور مدینہ منورہ کے درمیان رسول اللہ ﷺ کے ساتھ سفر کر رہے تھے۔ہمیں اللہ تعالیٰ کے سوا کسی کا خوف نہ تھا مگر ہم (رباعی نماز) دو رکعت پڑھتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;