var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ قَالَ سَمِعْتُ حَبِيبَ بْنَ عُبَيْدٍ يُحَدِّثُ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ ابْنِ السِّمْطِ قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ يُصَلِّي بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ إِنَّمَا أَفْعَلُ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ";
nasai.urdu = "حضرت ابن سمط بیان کرتے ہیں کہ میں نے حضرت عمر بن خطاب رضی اللہ عنہ کو ذوالحلیفہ کے مقام پر (کوئی رباعی نماز) دو رکعت پڑھتے دیکھا۔میں نے ان سے اس بارے میں پوچھا تو انھوں نے فرمایا: میں تو اسی طرح کرتا ہوں جس طرح میں نے رسول اللہ ﷺ کو کرتے دیکھا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;