var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ يَحْيَى بْنِ أَبِي إِسْحَقَ عَنْ أَنَسٍ قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَلَمْ يَزَلْ يَقْصُرُ حَتَّى رَجَعَ فَأَقَامَ بِهَا عَشْرًا";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ میں رسول اللہ ﷺ کے ساتھ مدینہ منورہ سے مکہ مکرمہ گیا۔آپ واپس مدینہ منورہ آنے تک نماز قصر کرتے رہے۔آپ مکے میں دس دن ٹھہرے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;