var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ قَالَ أَبِي أَنْبَأَنَا أَبُو حَمْزَةَ وَهُوَ السُّكَّرِيُّ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ رَكْعَتَيْنِ وَمَعَ أَبِي بَكْرٍ رَكْعَتَيْنِ وَمَعَ عُمَرَ رَكْعَتَيْنِ رَضِيَ اللَّهُ عَنْهُمَا";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ میں نے رسول اللہ ﷺ کے ساتھ سفر میں (چار رکعت والی نماز) دو رکعت پڑھی۔حضرت ابوبکر رضی اللہ عنہ کے ساتھ بھی دو رکعت پڑھی اور حضرت عمر رضی اللہ عنہ کے ساتھ بھی دو رکعت پڑھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;