var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ وَهُوَ ابْنُ حَبِيبٍ عَنْ شُعْبَةَ عَنْ زُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عُمَرَ قَالَ صَلَاةُ الْجُمُعَةِ رَكْعَتَانِ وَالْفِطْرِ رَكْعَتَانِ وَالنَّحْرِ رَكْعَتَانِ وَالسَّفَرِ رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عمر رضی اللہ عنہ بیان کرتے ہیں کہ جمعے کی نماز،عید الفطر کی نماز،قربانی (عید الاضحیٰ) کی نماز اور سفر کی نماز نبی ﷺ کی زبانی دو دو رکعت ہے اور یہ مکمل ہے۔اس میں کوئی نقص اور کمی نہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;