var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنِي زَيْدٌ عَنْ أَيُّوبَ وَهُوَ ابْنُ عَائِذٍ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ أَبِي الْحَجَّاجِ عَنْ ابْنِ عَبَّاسٍ قَالَ فُرِضَتْ صَلَاةُ الْحَضَرِ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعًا وَصَلَاةُ السَّفَرِ رَكْعَتَيْنِ وَصَلَاةُ الْخَوْفِ رَكْعَةً";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ گھر کی نماز تمھارے نبی ﷺ کی زبانی چچاار رکعت،سفر کی نماز دو رکعت اور خوف کی نماز ایک رکعت فرض کی گئی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;