var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ مَاهَانَ قَالَ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ عَنْ أَيُّوبَ بْنِ عَائِذٍ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ فَرَضَ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما فرماتے ہیں: اللہ تعالیٰ نے تمھارے نبی ﷺ کی زبانی گھر کی نماز چار رکعت،سفر میں دو رکعت اور خوف کی الت میں ایک رکعت فرض کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;