var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى فِي حَدِيثِهِ عَنْ خَالِدِ بْنِ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ مُوسَى وَهُوَ ابْنُ سَلَمَةَ قَالَ قُلْتُ لِابْنِ عَبَّاسٍ كَيْفَ أُصَلِّي بِمَكَّةَ إِذَا لَمْ أُصَلِّ فِي جَمَاعَةٍ قَالَ رَكْعَتَيْنِ سُنَّةَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت موسیٰ بن سلمہ بیان کرتے ہیں کہ میں نے حضرت ابن عباس رضی اللہ عنہما سے پوچھا کہ اگر میں باجماعت نماز نہ پاسکوں تو مکہ مکرمہ میں نماز کیسے پڑھوں؟ انھوں نے فرمایا: دو رکعتیں۔یہ ابو القاسم ﷺ کی سنت ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;