var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ قَالَ حَدَّثَنَا قَتَادَةُ أَنَّ مُوسَى بْنَ سَلَمَةَ حَدَّثَهُمْ أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ قُلْتُ تَفُوتُنِي الصَّلَاةُ فِي جَمَاعَةٍ وَأَنَا بِالْبَطْحَاءِ مَا تَرَى أَنْ أُصَلِّيَ قَالَ رَكْعَتَيْنِ سُنَّةَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت موسیٰ بن سلمہ بیان کرتے ہیں کہ میں نے حضرت ابن عباس رضی اللہ عنہما سے پوچھا: مجھ سے نماز باجماعت رہ جائے،جب کہ میں وادیٔ مکہک میں ہوں،تو آپ کے خیال کے مطابق میں کتنی رکعت نماز پڑھوں؟ انھوں نے فرمایا: دو رکعت۔یہ رسول اللہ ﷺ کی سنت ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;