var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ وَهْبٍ الْخُزَاعِيِّ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى آمَنَ مَا كَانَ النَّاسُ وَأَكْثَرَهُ رَكْعَتَيْنِ";
nasai.urdu = "حضرت حارثہ بن وہب خزاعی رضی اللہ عنہ بیان کترے ہیں کہ میں نے نبی ﷺ کے ساتھ منیٰ میں دو رکعتیں پڑھیں،حالانکہ آپ انتہائی امن کی حالت میں تھے اور آپ کے ساتھی بھی بہت زیادہ تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;