var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ أَخْبَرَنِي أَبُو إِسْحَقَ عَنْ حَارِثَةَ بْنِ وَهْبٍ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى أَكْثَرَ مَا كَانَ النَّاسُ وَآمَنَهُ رَكْعَتَيْنِ";
nasai.urdu = "حضرت حارثہ بن وہب خزاعی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے ہمیں منی میں دو رکعتیں پڑھائیں حالانکہ لوگ بہت زیادہ تھے اور انتہائی امن کی حالت میں تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;