var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سُلَيْمَانَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى وَمَعَ أَبِي بَكْرٍ وَعُمَرَ رَكْعَتَيْنِ وَمَعَ عُثْمَانَ رَكْعَتَيْنِ صَدْرًا مِنْ إِمَارَتِهِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ فرماتے ہیں کہ میں نے منیٰ میں رسول اللہ ﷺ کے ساتھ،حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما کے ساتھ دو رکعتیں پڑھیں اور حضرت عثمان رضی اللہ عنہ کے ساتھ بھی ان کی امارت کے ابتدائی زمانے میں دو رکعتیں ہی پڑھیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;