var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ عَنْ الْأَعْمَشِ قَالَ حَدَّثَنَا إِبْرَاهِيمُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ ح وَأَنْبَأَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ صَلَّيْتُ بِمِنًى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے منقول ہے،فرمایا: میں نے رسول اللہ ﷺ کے ساتھ منیٰ میں دورکعتیں پڑھیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;