var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ جَامِعِ بْنِ شَدَّادٍ قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ أَخْبَرَ أَبَا بُرْدَةَ فِي الْمَسْجِدِ أَنَّهُ سَمِعَ عُثْمَانَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَالصَّلَوَاتُ الْخَمْسُ كَفَّارَاتٌ لِمَا بَيْنَهُنَّ";
nasai.urdu = "حضرت عثمان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس شخص نے اس طرح وضو مکمل کیا جس طرح اللہ تعالیٰ نے اسے حکم دیا ہے تو اس کے لیے پانچ نمازیں درمیان والے گناہوں کا کفارہ بن جائیں گی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;