var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا عِيسَى عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ صَلَّى عُثْمَانُ بِمِنًى أَرْبَعًا حَتَّى بَلَغَ ذَلِكَ عَبْدَ اللَّهِ فَقَالَ لَقَدْ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ";
nasai.urdu = "حضرت عبدالرحمٰن بن یزید سے مروی ہے کہ حضرت عثمان رضی اللہ عنہ نے منیٰ میں چار رکعتیں پڑھیں حتی کہ یہ بات حضرت عبداللہ بن مسعود رضی اللہ عنہ کو پہنچی تو انھوں نے فرمایا: میں نے تو رسول اللہ ﷺ کے ساتھ دو رکعتیں ہی پڑھی ہیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;