var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ وَمَعَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ رَكْعَتَيْنِ وَمَعَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ رَكْعَتَيْنِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں نے نبی ﷺ کے ساتھ منیٰ میں دو رکعتیں پڑھیں۔حضرت ابوبکر رضی اللہ عنہ کے ساتھ دو رکعتیں پڑھیں اور حضرت عمر رضی اللہ عنہ کے ساتھ بھی دو رکعتیں پڑھیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;