var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ وَصَلَّاهَا أَبُو بَكْرٍ رَكْعَتَيْنِ وَصَلَّاهَا عُمَرُ رَكْعَتَيْنِ وَصَلَّاهَا عُثْمَانُ صَدْرًا مِنْ خِلَافَتِهِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے منیٰ میں دو رکعتیں پڑھیں۔حضرت ابوبکر رضی اللہ عنہ نے بھی یہاں دو رکعتیں ہی پڑھیں۔حضرت عمر رضی اللہ عنہ نے بھی دو ہی پڑھیں۔اور حضرت عثمان رضی اللہ عنہ نے بھی اپنی خلافت کی ابتدا میں دو رکعتیں ہی پڑھیں۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;