var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَكَانَ يُصَلِّي بِنَا رَكْعَتَيْنِ حَتَّى رَجَعْنَا قُلْتُ هَلْ أَقَامَ بِمَكَّةَ قَالَ نَعَمْ أَقَمْنَا بِهَا عَشْرًا";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے منقول ہے،فرماتے ہیں،ہم رسول اللہ ﷺ کے ساتھ مدینہ منورہ سے مکہ مکرمہ کو نکلے۔آپ واپس مدینہ تشریف لانے تک ہمیں دو رکعت ہی پڑھاتے رہے۔(شاگرد ابواسحق بیان کرتے ہیں کہ) میں نے کہا: کیا آپ مککہ میں ٹھہرے تھے؟ انھوں نے فرمایا: ہاں،ہم مکہ میں دس دن ٹھہرے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;