var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ الْبَصْرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ بِمَكَّةَ خَمْسَةَ عَشَرَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ مکہ مکرمہ میں پندرہ دن ٹھہرے۔دو دو رکعت پڑھتے رہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;