var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ زَنْجُوَيْهِ عَنْ عَبْدِ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي إِسْمَعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُ أَنَّهُ سَمِعَ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْكُثُ الْمُهَاجِرُ بَعْدَ قَضَاءِ نُسُكِهِ ثَلَاثًا";
nasai.urdu = "حضرت علا ء بن حضرمی ؓ سے منقول ہے،\nرسول اللہ ﷺ نے فرمایا: مہاجر شخص اپنا حج و عمرہ پورا\nکرنے کے بعد صرف تین دن مکے میں رہ سکتا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;