var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَبْد الرَّحْمَنِ قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ فِي حَدِيثِهِ عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْكُثُ الْمُهَاجِرُ بِمَكَّةَ بَعْدَ نُسُكِهِ ثَلَاثًا";
nasai.urdu = "حضرت علاء بن حضرمی ؓ سے روایت ہے،نبی ﷺ نے فرمایا: (مکے سے) ہجرے کرنے والا اپنا حج و عمرہ کرنے کے بعد تین دن (مکے میں) ٹھہرسکتا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;