var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا الْعَلَاءُ بْنُ زُهَيْرٍ قَالَ حَدَّثَنَا وَبَرَةُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ كَانَ ابْنُ عُمَرَ لَا يَزِيدُ فِي السَّفَرِ عَلَى رَكْعَتَيْنِ لَا يُصَلِّي قَبْلَهَا وَلَا بَعْدَهَا فَقِيلَ لَهُ مَا هَذَا قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ";
nasai.urdu = "حضرت وبرہ بن عبدالرحمان سے روایت ہے عبداللہ بن عمر سفر میں دو رکعت فرض سے ذیا دہ نہیں پڑتے تھے نہ فرض سے پہلے سنت پڑتے تھے نہ فرض کے بعد ایک شخص نے پوچھا یہ کیا ہے انہوں نے کہا میں نے رسول اللہﷺ کو ایسا کرتے دیکھا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;