var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ حُمْرَانَ مَوْلَى عُثْمَانَ أَنَّ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ امْرِئٍ يَتَوَضَّأُ فَيُحْسِنُ وُضُوءَهُ ثُمَّ يُصَلِّي الصَّلَاةَ إِلَّا غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الصَّلَاةِ الْأُخْرَى حَتَّى يُصَلِّيَهَا";
nasai.urdu = "حضرت عثمان رضی اللہ عنہ سے منقول ہے،وہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’جو آدمی وضو کرے اور اچھی طرح کرے،پھر نماز پڑھے،اس کے لیے اگلی نماز تک کے گناہ معاف فرما دیے جاتے ہیں یہاں تک کہ اس نماز کو پڑھ لے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;