var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ تَعَالَى لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّ اللَّهَ عَزَّ وَجَلَّ يُخَوِّفُ بِهِمَا عِبَادَهُ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’سورج اور چاند اللہ تعالیٰ کی دو نشانیاں ہیں۔انھیں کسی کی موت اور پیدائش کی وجہ سے گرہن نہیں لگتا بلکہ اللہ تعالیٰ ان کے ذریعے سے اپنے بندوں کو ڈراتا ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;