var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ حَدَّثَهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ تَعَالَى فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’سورج اور چاند کسی کی موت و حیات کی وجہ سے بے نور نہیں ہوتے بلکہ یہ تو اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں۔جب تم انھیں گرہن کی حالت میں دیکھو تو نماز پڑھو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;