var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ إِسْمَعِيلَ قَالَ حَدَّثَنِي قَيْسٌ عَنْ أَبِي مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ عَزَّ وَجَلَّ فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا";
nasai.urdu = "حضرت ابومسعود رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’سورج اور چاند کسی کی موت کی بنا پر بے نور نہیں ہوتے بلکہ یہ تو اللہ تعالیٰ کی نشانیاں ہیں۔جب تم انھیں (اس حال میں) دیکھو تو نماز پڑھو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;