var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ كَامِلٍ الْمَرْوَزِيُّ عَنْ هُشَيْمٍ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ عَزَّ وَجَلَّ وَإِنَّهُمَا لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا حَتَّى تَنْجَلِيَ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں۔انھیں کسی کی موت و حیات کی بنا پر گرہن نہیں لگتا۔جب تم انھیں گرہن کی حالت میں دیکھو تو نماز پڑھو حتی کہ یہ حالت ختم ہو جائے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;