var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ كُنَّا جُلُوسًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَسَفَتْ الشَّمْسُ فَوَثَبَ يَجُرُّ ثَوْبَهُ فَصَلَّى رَكْعَتَيْنِ حَتَّى انْجَلَتْ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ بیان کرتے ہیں کہ ہم نبی ﷺ کے پاس بیٹھے تھے کہ سورج کو گرہن لگ گیا۔آپ اپنا کپڑا گھسیٹتے ہئے اٹھے،پھر آپ نے دو رکعتیں پڑھیں حتی کہ سورج صاف روشن ہوگیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;