var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ إِسْمَعِيلَ ابْنِ عُلَيَّةَ قَالَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عِنْدَ كُسُوفِ الشَّمْسِ ثَمَانِيَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَعَنْ عَطَاءٍ مِثْلُ ذَلِكَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے سورج کے وقت آٹھ رکوع اور چار سجدے کیے۔(یعنی ہر رکعت میں چار رکوع کیے۔) حضرت عطاء سے بھی اسی قسم کی روایت آتی ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;