var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى فِي كُسُوفٍ فَقَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ سَجَدَ وَالْأُخْرَى مِثْلُهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے گرہن کے وقت نماز پڑھی۔پہلے قراءت کی،پھر رکوع کیا،پھر قراءت کی،پھر رکوع کیا،پھر قراءت کی،پھر رکوع کیا،پھر قراءت کی،پھر رکوع کیا،پھر سجدہ کیا،پھر دوسری رکعت بھی اسی طرح پڑھی۔(یعنی ہر رکعت میں چار رکوع کیے۔)";
nasai.hukam = "صحیح";
nasai.description = ``;