var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ نَمِرٍ وَهُوَ عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ عَنْ الزُّهْرِيِّ عَنْ كَثِيرِ بْنِ عَبَّاسٍ ح وَأَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي كَثِيرُ بْنُ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ كَسَفَتْ الشَّمْسُ أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے سورج گرہن کے دن دو رکعتوں میں چار رکوع اور چار سجدے کیے۔(یعنی ہر رکعت میں دو رکوع کیے۔)";
nasai.hukam = "متفق علیہ";
nasai.description = ``;