var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ فِي صَلَاةِ الْآيَاتِ عَنْ عَطَاءٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى سِتَّ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ قُلْتُ لِمُعَاذٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا شَكَّ وَلَا مِرْيَةَ.";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ نے چار سجدوں میں (یعنی دو رکعتوں میں) چھ رکوع کیے۔(راویٔ حدیث اسحاق کہتے ہیں کہ) میں نے معاذ (ابن ہشام) سے کہا: یہ نبی ﷺ سے ہے؟ انھوں نے کہا: کوئی شک و شبہ نہیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;