var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ خَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُودِيَ الصَّلَاةُ جَامِعَةٌ فَاجْتَمَعَ النَّاسُ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ کے زمانے میں سورج کو گرہن لگ گیا تو اعلان کیا: نماز کی جماعت ہونی ہے۔لوگ اکٹھے ہوگئے تو رسول اللہ ﷺ نے انھیں نماز پڑھائی۔اور (دورکعتوں میں) چار رکوع اور چار سجدے کیے۔";
nasai.hukam = "صحیح";
nasai.description = ``;