var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا ابْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي كُسُوفٍ فِي صُفَّةِ زَمْزَمَ أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے سورج گرہن کے موقع پر زم زم کے چبوترے پر نماز پڑھی،اس میں چار رکوع کیے اور چار سجدے کیے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;