var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُعَاذِ بْنِ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي قِلَابَةَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا خَسَفَتْ الشَّمْسُ وَالْقَمَرُ فَصَلُّوا كَأَحْدَثِ صَلَاةٍ صَلَّيْتُمُوهَا";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب سورج یا چاند کو گرہن لگ جائے تو اس قریب ترین نماز کی طرح نماز پڑھو جو تم نے پڑھی ہے،(یعنی فجر کی نماز)۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1486)`;
nasai.anwaar = [332,1];