var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي قِلَابَةَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى حِينَ انْكَسَفَتْ الشَّمْسُ مِثْلَ صَلَاتِنَا يَرْكَعُ وَيَسْجُدُ";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہما سے مروی ہے کہ جب سورج کو گرہن لگا تو رسول اللہ ﷺ نے ہماری نماز کی طرح نماز پڑھی۔آپ رکوع اور سجدہ کرتے تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1486)`;
nasai.anwaar = [332,1];