var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ ابْنِ عَبَّادٍ رَجُلٍ مِنْ بَنِي عَبْدِ الْقَيْسِ عَنْ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ فِي كُسُوفِ الشَّمْسِ لَا نَسْمَعُ لَهُ صَوْتًا";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ نے ہمیں نمازکسوف پڑھائی۔ہم آپ کی آواز نہیں سنتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;