var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّ عَمَّهُ حَدَّثَهُ أَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي فَحَوَّلَ رِدَاءَهُ وَحَوَّلَ لِلنَّاسِ ظَهْرَهُ وَدَعَا ثُمَّ صَلَّى رَكْعَتَيْنِ فَقَرَأَ فَجَهَرَ";
nasai.urdu = "حضرت عباد بن تمیم کے چچا (حضرت عبداللہ بن زید بن عاصم رضی اللہ عنہ) بیان کرتے ہیں کہ میں بھی دعائے استسقاء کے لیے رسول اللہ ﷺ کے ساتھ گیا تھا۔آپ نے اپنی چادر الٹائی اور لوگوں کی طرف پشت کرلی اور دعا کرنے لگے،پھر دو رکعتیں پڑھائیں اور ان میں بلند آواز سے قراءت کی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;