var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ زَيْدٍ يَقُولُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَسْقَى وَحَوَّلَ رِدَاءَهُ حِينَ اسْتَقْبَلَ الْقِبْلَةَ";
nasai.urdu = "حضرت عبداللہ بن زید رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ (مدینہ منورہ سے) باہر نکلے اور بارش کی دعا کی اور جب (دعا کے لیے) قبلہ رخ ہوئے تو آپ نے اپنی چادر الٹائی۔";
nasai.hukam = "حسن";
nasai.description = ``;