var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ أَبُو تَقِيٍّ الْحِمْصِيُّ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الِاسْتِسْقَاءِ اسْتَقْبَلَ الْقِبْلَةَ وَقَلَبَ الرِّدَاءَ وَرَفَعَ يَدَيْهِ";
nasai.urdu = "حضرت عباد بن تمیم کے چچا سے روایت ہے،انھوں نے رسول اللہ ﷺ کو دعائے استسقاء میں دیکھا۔آپ نے قبلے کی طرف منہ فرمایا،چادر کو الٹایا اور (دعا کے لیے) اپنے ہاتھ اٹھائے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;