var nasai = {};
nasai.arabic = "أَخْبَرَنِي شُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ الدُّعَاءِ إِلَّا فِي الِاسْتِسْقَاءِ فَإِنَّهُ كَانَ يَرْفَعُ يَدَيْهِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کسی بھی دعا میں اتنے بلند ہاتھ نہیں اٹھاتے تھے جتنے دعائے استسقاء میں۔آپ اس میں ہاتھ اتنے بلند اٹھاتے کہ آپ کی بغلوں کی سفیدی نظر آتی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;