var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ عَنْ آبِي اللَّحْمِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ أَحْجَارِ الزَّيْتِ يَسْتَسْقِي وَهُوَ مُقْنِعٌ بِكَفَّيْهِ يَدْعُو";
nasai.urdu = "حضرت آبی اللحم رضی اللہ عنہ سے رویات ہے انھوں نے نبی ﷺ کو احجارالزیت کے مقام پر بارش کی دعا کرتے دیکھا۔آپ نے اپنے ہاتھ اٹھائے ہوئے تھے اور دعا فرما رہے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;