var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ أَبِي حَصِينٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ قَالَ قَالَ عَلِيٌّ كُنْتُ رَجُلًا مَذَّاءً وَكَانَتْ ابْنَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحْتِي فَاسْتَحْيَيْتُ أَنْ أَسْأَلَهُ فَقُلْتُ لِرَجُلٍ جَالِسٍ إِلَى جَنْبِي سَلْهُ فَسَأَلَهُ فَقَالَ فِيهِ الْوُضُوءُ";
nasai.urdu = "حضرت علی ؓ فرماتے ہیں کہ مجھے مذی بہت آیا کرتی تھی۔چونکہ نبی ﷺ کی صاحب زادی میرے نکاحم یں تھی،لہٰذا مجھے آپ سے یہ مسئلہ پوچھتے شرم آتی تھی،چنانچہ میں نے اپنے پہلو میں بیٹھے ایک شخص سے کہا کہ آپ سے (یہ مسئلہ) پوچھو۔اس نے آپ سے پوچھا تو آپ نے فرمایا: ’’اس کے نکلنے سے وضو واجب ہوتا ہے (غسل نہیں۔‘‘)";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;