var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَسْتَسْقِي فَصَلَّى رَكْعَتَيْنِ وَاسْتَقْبَلَ الْقِبْلَةَ";
nasai.urdu = "حضرت عبداللہ بن زید رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ بارش کی دعا کرنے کے لیے (شہرسے) باہر نکلے،پھر آپ نے قبلہ رخ ہوکر (دعا کی اور) دو رکعتیں پڑھیں۔";
nasai.hukam = "حسن";
nasai.description = ``;