var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَاسْتَسْقَى فَصَلَّى رَكْعَتَيْنِ جَهَرَ فِيهِمَا بِالْقِرَاءَةِ";
nasai.urdu = "حضرت عباد بن تمیم کے چچا سے روایت ہے کہ نبی ﷺ (مدینہ منورہ سے) باہر نکلے،بارش کی دعا کی،پھر دو رکعتیں پڑھیں اور ان میں بلند آواز سے قراءت کی۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;