var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عَتَّابِ بْنِ حُنَيْنٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَمْسَكَ اللَّهُ عَزَّ وَجَلَّ الْمَطَرَ عَنْ عِبَادِهِ خَمْسَ سِنِينَ ثُمَّ أَرْسَلَهُ لَأَصْبَحَتْ طَائِفَةٌ مِنْ النَّاسِ كَافِرِينَ يَقُولُونَ سُقِينَا بِنَوْءِ الْمِجْدَحِ";
nasai.urdu = "حضرت ابوسعیدخدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اگر اللہ تعالیٰ پانچ سال تک اپنے بندوں سے بارش روک رکھے،پھر بھیجے،تب بھی کچھ لوگ ضرور کفر کریں گے۔وہ کہیں گے: ہمیں مجدح ستارے سے بارش ملی ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>عتاب: مجہول الحال (التحریر: 4420) لم یوثقہ غیر ابن حبان،وقال سفیان بن عینۃ أحد رواتہ:’’لا أدري من عتاب‘‘؟`;
nasai.anwaar = [333,1];