var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قُلْتُ لِلْمِقْدَادِ إِذَا بَنَى الرَّجُلُ بِأَهْلِهِ فَأَمْذَى وَلَمْ يُجَامِعْ فَسَلْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَإِنِّي أَسْتَحِي أَنْ أَسْأَلَهُ عَنْ ذَلِكَ وَابْنَتُهُ تَحْتِي فَسَأَلَهُ فَقَالَ يَغْسِلُ مَذَاكِيرَهُ وَيَتَوَضَّأُ وُضُوءَهُ لِلصَّلَاةِ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے منقول ہے کہ میں نے حضرت مقداد رضی اللہ عنہ سے کہا: جب کوئی آدمی اپنی بیوی سے دل لگی کرے اور اسے مذی آ جائے جب کہ اس نے جماع نہیں کیا (تو وہ کیا کرے؟) آپ یہ مسئلہ نبی ﷺ سے پوچھیں کیونکہ آپ کی بیٹی میرے نکاح میں ہے،اس لیے مجھے شرم آتی ہے۔حضرت مقداد نے پوچھا تو آپ نے فرمایا: ’’وہ اپنی شرم گاہ وغیرہ دھو لے اور نماز والا وضو کرلے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (208)`;
nasai.anwaar = [321,1];