var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ فَرَضَ اللَّهُ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ اللہ تعالیٰ نے تمھارے نبی ﷺ کی زبانی گھر کی نماز چار رکعت،سفر کی نماز دو رکعت اور خوف کی نماز ایک رکعت فرض کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;