var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ عَائِشِ بْنِ أَنَسٍ أَنَّ عَلِيًا قَالَ كُنْتُ رَجُلًا مَذَّاءً فَأَمَرْتُ عَمَّارَ بْنَ يَاسِرٍ يَسْأَلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَجْلِ ابْنَتِهِ عِنْدِي فَقَالَ يَكْفِي مِنْ ذَلِكَ الْوُضُوءُ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،وہ بیان کرتے ہیں کہ مجھے مذی بہت آیا کرتی تھی،چنانچہ آپ ﷺ کی بیٹی کے میرے نکاح میں ہونے کی وجہ سے میں نے حضرت عمار بن یاسر رضی اللہ عنہا کو کہا کہ وہ رسول اللہ ﷺ سے اس مسئلے کی بابت پوچھیں تو آپ نے فرمایا: ’’اس (مذی) سے وضو کافی ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;