var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ أَنْبَأَنَا أُمَيَّةُ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ أَنَّ رَوْحَ بْنَ الْقَاسِمِ حَدَّثَهُ عَنْ ابْنِ أَبِي نُجَيْحٍ عَنْ عَطَاءٍ عَنْ إِيَاسِ بْنِ خَلِيفَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ عَلِيًّا أَمَرَ عَمَّارًا أَنْ يَسْأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَذْيِ فَقَالَ يَغْسِلُ مَذَاكِيرَهُ وَيَتَوَضَّأُ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے مروی ہے،انھوں نے حضرت عمار رضی اللہ عنہ سے کہا کہ وہ اللہ کے رسول ﷺ سے مذی کے بارے میں پوچھیں۔آپ نے فرمایا: ’’وہ اپنی شرم گاہ وغیرہ دھولے اور وضو کرلے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;