var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى وَإِسْمَعِيلُ بْنُ مَسْعُودٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا خَالِدٌ عَنْ أَشْعَثَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِالْقَوْمِ فِي الْخَوْفِ رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ صَلَّى بِالْقَوْمِ الْآخَرِينَ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعًا";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ایک گروہ کو نماز خوف دو رکعت پڑھائی،پھر سلام پھیر دیا،پھر دوسرے گروہ کو دو رکعتیں پڑھائیں اورپھر سلام پھیر دیا۔اس طرح نبی ﷺ نے چار رکعات پڑھیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>الحسن البصري مدلس وعنعن۔<br>وحدیث مسلم (843) یغني عنہ۔`;
nasai.anwaar = [333,1];