var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِطَائِفَةٍ مِنْ أَصْحَابِهِ رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ صَلَّى بِآخَرِينَ أَيْضًا رَكْعَتَيْنِ ثُمَّ سَلَّمَ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے منقول ہے کہ نبی ﷺ نے اپنے صحابہ میں سے ایک گروہ کو دو رکعتیں پڑھائیں،پھر سلام پھیرا،پھر دوسرے گروہ کو بھی دو رکعتیں پڑھائیں،پھر سلام پھیرا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ و الحسن البصري عنعنا۔`;
nasai.anwaar = [333,1];