var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا الْأَشْعَثُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى صَلَاةَ الْخَوْفِ بِالَّذِينَ خَلْفَهُ رَكْعَتَيْنِ وَالَّذِينَ جَاءُوا بَعْدُ رَكْعَتَيْنِ فَكَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعُ رَكَعَاتٍ وَلِهَؤُلَاءِ رَكْعَتَيْنِ رَكْعَتَيْنِ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے اپنے پیچھے کھڑے لوگوں کو دو رکعتیں پڑھائیں،پھر جوان کے بعد آئے،انھیں بھی دو رکعتیں پڑھائیں۔تو نبی ﷺ کی چار رکعتیں ہوگئیں اور ان کی دو دو۔";
nasai.hukam = "حسن";
nasai.description = ``;