var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا أَبُو بِشْرٍ عَنْ أَبِي عُمَيْرِ بْنِ أَنَسٍ عَنْ عُمُومَةٍ لَهُ أَنَّ قَوْمًا رَأَوْا الْهِلَالَ فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُمْ أَنْ يُفْطِرُوا بَعْدَ مَا ارْتَفَعَ النَّهَارُ وَأَنْ يَخْرُجُوا إِلَى الْعِيدِ مِنْ الْغَدِ";
nasai.urdu = "حضرت ابوعمیر بن انس اپنے چچائوں سے بیان کرتے ہیں کہ کچھ لوگوں نے عید کا چاند دیکھا (مگر نبی ﷺ کو بروقت اطلاع نہ مل سکی اور عام لوگوں نے روزہ رکھ لیا)،پھر وہ نبی ﷺ کے پاس آئے (اور اطلاع کی) تو آپ نے لوگوں کو دن چڑھ آنے کے بعد روزہ کھولنے کا اور اگلے دن نماز (عید) کے لیے نکلنے کا حکم دیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;