var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ الْأَشْعَثِ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ أَنَّ عَلِيًّا اسْتَخْلَفَ أَبَا مَسْعُودٍ عَلَى النَّاسِ فَخَرَجَ يَوْمَ عِيدٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّهُ لَيْسَ مِنْ السُّنَّةِ أَنْ يُصَلَّى قَبْلَ الْإِمَامِ";
nasai.urdu = "حضرت ثعلبہ بن زہدم سے مروی ہے کہ حضرت علی رضی اللہ عنہ نے حضرت ابومسعودرضی اللہ عنہ کو (ایک دفعہ) لوگوں پر اپنا نائب مقرر فرمایا۔وہ عید کے دن (عید کے لیے) باہر نکلے تو فرمایا: اے لوگو! یہ نبی ﷺ کا طریقہ نہیں کہ امام (کے نماز عید پڑھانے) سے پہلے کوئی نفل نماز پڑھی جائے۔";
nasai.hukam = "حسن";
nasai.description = ``;