var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا كَانُوا يُصَلُّونَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ اور حضرت ابوبکر و عمر رضی اللہ عنہما عیدین میں نماز خطبے سے قبل پڑھا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;