var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخْرِجُ الْعَنَزَةَ يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى يُرْكِزُهَا فَيُصَلِّي إِلَيْهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ عیدالفطر اور عیدالاضحیٰ کے دن چھوٹا نیزہ ساتھ لے جایا کرتے تھے،پھر اسے گاڑ لیتے اور اس کی طرف نماز پڑھتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;