var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ عَنْ زُبَيْدٍ الْأَيَامِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى ذَكَرَهُ عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ صَلَاةُ الْأَضْحَى رَكْعَتَانِ وَصَلَاةُ الْفِطْرِ رَكْعَتَانِ وَصَلَاةُ الْمُسَافِرِ رَكْعَتَانِ وَصَلَاةُ الْجُمُعَةِ رَكْعَتَانِ تَمَامٌ لَيْسَ بِقَصْرٍ عَلَى لِسَانِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ بیان کرتے ہیں کہ عیدالاضحیٰ کی نماز دورکعت ہے،عیدالفطر کی نماز دورکعت ہے،مسافر کی نماز دو رکعت ہے اور جمعے کی نماز بھی دو رکعت ہے۔یہ تمام نمازیں نبی ﷺ کی زبانی مکمل ہیں،ان میں کوئی کمی اور نقص نہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;