var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا سُفْيَانُ قَالَ حَدَّثَنِي ضَمْرَةُ بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ خَرَجَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ يَوْمَ عِيدٍ فَسَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي هَذَا الْيَوْمِ فَقَالَ بِقَافْ وَاقْتَرَبَتْ";
nasai.urdu = "حضرت عمر رضی اللہ عنہ عید کے دن نکلے تو آپ نے حضرت ابوواقد لیثی رضی اللہ عنہ سے پوچھا کہ نبی ﷺ اس دن کون سی سورتیں (نماز عید میں) پڑھا کرتے تھے؟ انھوں نے کہا: سورۂ (ق) اور سورۂ (اقتربت الساعۃ)";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;