var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْعِيدَيْنِ وَيَوْمِ الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَا فِي يَوْمٍ وَاحِدٍ فَيَقْرَأُ بِهِمَا";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ عیدین اور جمعے کے دن سورۂ (سبح اسم ربک الاعلیٰ) اور (ھل اتک حدیث الغاشیۃ) پڑھا کرتے تھے۔کبھی جمع اور عید ایک دن میں اکٹھے ہوجاتے تو بھی آپ یہی دونوں سورتیں پڑھتے۔";
nasai.hukam = "حسن";
nasai.description = ``;