var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعَلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي سُلَيْمَانُ قَالَ سَمِعْتُ مُنْذِرًا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيٍّ قَالَ اسْتَحْيَيْتُ أَنْ أَسْأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَذْيِ مِنْ أَجْلِ فَاطِمَةَ فَأَمَرْتُ الْمِقْدَادَ بْنَ الْأَسْوَدِ فَسَأَلَهُ فَقَالَ فِيهِ الْوُضُوءُ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،وہ بیان کرتے ہیں کہ مجھے حضرت فاطمہ رضی اللہ عنہا کی وجہ سے شرم آتی تھی کہ میں رسول اللہ ﷺ سے مذی کے بارے میں پوچھوں،چنانچہ میں نے مقداد بن اسود رضی اللہ عنہ سے کہا تو انھوں نے آپ سے پوچھا۔آپ نے فرمایا: ’’اس میں وضو ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;