var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ أَيُّوبَ يُخْبِرُ عَنْ عَطَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَشْهَدُ أَنِّي شَهِدْتُ الْعِيدَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما فرماتے ہیں: میں گواہی دیتا ہوں کہ میں رسول اللہ ﷺ کے ساتھ عید کے موقع پر حاضر ہوا۔آپ نے خطبے سے پہلے نماز پڑھی،پھر خطبہ دیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;