var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْعِيدَ قَالَ مَنْ أَحَبَّ أَنْ يَنْصَرِفَ فَلْيَنْصَرِفْ وَمَنْ أَحَبَّ أَنْ يُقِيمَ لِلْخُطْبَةِ فَلْيُقِمْ";
nasai.urdu = "حضرت عبداللہ بن سائب رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ نے عید کی نمازپڑھائی،پھر فرمایا: ’’جو آدمی جانا چاہے وہ جاسکتا ہے اور جو خطبہ سننے کے لیے ٹھہرنا چاہتا ہے،وہ ٹھہرے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;