var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ قَالَ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ أَخِيهِ عَنْ أَبِي كَاهِلٍ الْأَحْمَسِيِّ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَةٍ وَحَبَشِيٌّ آخِذٌ بِخِطَامِ النَّاقَةِ";
nasai.urdu = "حضرت ابوکاہل احمسی رضی اللہ عنہ سے منقول ہے،فرماتے ہیں: میں نے رسول اللہ ﷺ کو اونٹنی پر سوار خطبہ ارشاد فرماتے دیکھا جبکہ ایک حبشی (سیدنا حضرت بلال رضی اللہ عنہ) نے اونٹنی کی مہار تھام رکھی تھی۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;