var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ قَالَ سَأَلْتُ جَابِرًا أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ قَعْدَةً ثُمَّ يَقُومُ";
nasai.urdu = "حضرت سماک نے کہا کہ میں نے حضرت جابر رضی اللہ عنہ سے پوچھا: کیا رسول اللہ ﷺ کھڑے ہوکر خطبہ ارشاد فرماتے تھے؟ انھوں نے فرمایا: رسول اللہ ﷺ کھڑے ہوکر خطبہ ارشاد فرماتے تھے،پھر کچھ دیر بیٹھتے،پھر کھڑے ہوجاتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;