var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ قَالَ حَدَّثَنِي عِيَاضٌ عَنْ أَبِي سَعِيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ يَوْمَ الْعِيدِ فَيُصَلِّي رَكْعَتَيْنِ ثُمَّ يَخْطُبُ فَيَأْمُرُ بِالصَّدَقَةِ فَيَكُونُ أَكْثَرَ مَنْ يَتَصَدَّقُ النِّسَاءُ فَإِنْ كَانَتْ لَهُ حَاجَةٌ أَوْ أَرَادَ أَنْ يَبْعَثَ بَعْثًا تَكَلَّمَ وَإِلَّا رَجَعَ";
nasai.urdu = "حضرت ابوسعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ عید کے دن باہر تشریف لے جاتے،دو رکعتیں پڑھتے،پھر خطبہ ارشاد فرماتے اور صدقے کا حکم دیتے۔اکثر عورتیں ہی صدقہ کرتیں۔اگر کوئی ضرورت پیش ہوتی یا لشکر بھیجنا مقصود ہوتا تو اس سے متعلق کلام فرماتے،ورنہ واپس تشریف لے آتے۔";
nasai.hukam = "حسن";
nasai.description = ``;