var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ قَعْدَةً لَا يَتَكَلَّمُ فِيهَا ثُمَّ قَامَ فَخَطَبَ خُطْبَةً أُخْرَى فَمَنْ خَبَّرَكَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ قَاعِدًا فَلَا تُصَدِّقْهُ";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ کو دیکھا ہے کہ آپ (پہلے) کھڑے ہوکر خطبہ ارشاد فرماتے،پھر (تھوڑی دیر کے لیے) بیٹھ جاتے اور اس دوران میں (کوئی تقریریا) بات چیت نہ کرتے،پھر کھڑے ہوجاتے اور دوسرا خطبہ ارشاد فرماتے،لہٰذا جو شخص تجھے بتائے کہ نبی ﷺ بیٹھ کر خطبہ دیتے تھے،اس کی تصدیق نہ کر۔";
nasai.hukam = "صحیح";
nasai.description = ``;