var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ وَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلَاتُهُ قَصْدًا";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ فرماتے ہیں کہ نبی ﷺ کھڑے ہوکر خطبہ ارشاد فرماتے،پھر بیٹھ جاتے،پھر کھڑے ہوجاتے اور چند آیات تلاوت فرماتے اور اللہ کی باتیں ذکر فرماتے۔آپ کا خطبہ بھی درمیانہ ہوتا اور نماز بھی۔";
nasai.hukam = "حسن";
nasai.description = ``;