var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ عَدِيٍّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ الْعِيدِ فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ عید کے دن باہر نکلے اور دورکعتیں پڑھیں۔ان (دورکعت) سے پہلے یا ان کے بعد کوئی (نفل) نماز نہیں پڑھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;