var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أَضْحًى وَانْكَفَأَ إِلَى كَبْشَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ ہمیں رسول اللہ ﷺ نے قربانی کے دن خطبہ ارشاد فرمایا،پھر اپنے دو سفید و سیاہ رنگ کے (ابلق) مینڈھوں کی طرف متوجہ ہوئے اور انھیں ذبح فرمایا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;