var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَإِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ عَنْ زِرٍّ قَالَ قَالَ صَفْوَانُ بْنُ عَسَّالٍ كُنَّا إِذَا كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ أَمَرَنَا أَنْ لَا نَنْزِعَهُ ثَلَاثًا إِلَّا مِنْ جَنَابَةٍ وَلَكِنْ مِنْ غَائِطٍ وَبَوْلٍ وَنَوْمٍ";
nasai.urdu = "حضرت صفوان بن عسال رضی اللہ عنہ بیان کرتے ہیں کہ جب ہم کسی سفر میں رسول اللہ ﷺ کے ساتھ ہوتے تھے تو آپ ہمیں ارشاد فرماتے تھے کہ ہم تین دن تک پیشاب،پاخانے اور نیند کی وجہ سے موزے نہ اتاریں،لیکن جنابت کی وجہ سے اتارنا پڑیں گے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;