var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ قُلْتُ عَنْ أَبِيهِ قَالَ نَعَمْ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ وَالْعِيدِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَإِذَا اجْتَمَعَ الْجُمُعَةُ وَالْعِيدُ فِي يَوْمٍ قَرَأَ بِهِمَا";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ جمعے اور عید کی نمازوں میں سورۂ (سبح اسم ربک الاعلیٰ) اور (ھل اتک حدیث الغاشیۃ) پڑھتے تھے۔جب جمعہ اور عید ایک دن اکٹھے ہوجاتے تو پھر بھی آپ یہی دونوں سورتیں پڑھتے۔";
nasai.hukam = "حسن";
nasai.description = ``;