var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ عَنْ إِيَاسِ بْنِ أَبِي رَمْلَةَ قَالَ سَمِعْتُ مُعَاوِيَةَ سَأَلَ زَيْدَ بْنَ أَرْقَمَ أَشَهِدْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِيدَيْنِ قَالَ نَعَمْ صَلَّى الْعِيدَ مِنْ أَوَّلِ النَّهَارِ ثُمَّ رَخَّصَ فِي الْجُمُعَةِ";
nasai.urdu = "حضرت معاویہ رضی اللہ عنہ نے حضرت زید بن ارقم رضی اللہ عنہ سے پوچھا: کیا آپ عیدین میں رسول اللہ ﷺ کے ساتھ حاضر ہوئے تھے؟ انھوں نے فرمایا: ہاں،آپ نے دن کے آغاز میں عید کی نماز پڑھی،پھر آپ نے جمعے کی رخصت دے دی۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;