var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ تَضْرِبَانِ بِدُفَّيْنِ فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُنَّ فَإِنَّ لِكُلِّ قَوْمٍ عِيدًا";
nasai.urdu = "حضرت عائشہ سے روایت ہے کہ رسول اللہ ﷺ (عید کے دن) ان کے پاس تشریف لے گئے اور ان کے ہاں (گھر میں) دو بچیاں دف بجا رہی تھیں۔(آپ نے انھیں نہ روکا،پھر ابوبکرداخل ہوئے تو) ابوبکر رضی اللہ عنہ نے انھیں ڈانٹا۔نبی ﷺ نے فرمایا: ’’رہنے دو! ہر قوم کی عید ہوتی ہے (جس میں وہ کھیل کود بھی لیتے ہیں)۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;