var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مُوسَى قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ دَخَلَ عُمَرُ وَالْحَبَشَةُ يَلْعَبُونَ فِي الْمَسْجِدِ فَزَجَرَهُمْ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُمْ يَا عُمَرُ فَإِنَّمَا هُمْ بَنُو أَرْفِدَةَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ حضرت عمر رضی اللہ عنہ مسجد میں داخل ہوئے تو حبشی مسجد میں (جنگی کھیل) کھیل رہے تھے۔حضرت عمر رضی اللہ عنہ نے انھیں ڈانٹا تو رسول اللہ ﷺ نے فرمایا: ’’عمر! رہنے دو۔یہ بنوارفدہ (حبشی لوگ) ہیں (اور جنگی کھیل کھیلنا ان کی فطرت میں داخل ہے)۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;