var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ قَالَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ عَنْ الْوَلِيدِ بْنِ أَبِي هِشَامٍ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلُّوا فِي بُيُوتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اپنے گھروں میں نماز (نفل) پڑھا کرو۔انھیں قبرستان نہ بنالو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;