var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ الْخَطْمِيُّ عُمَيْرُ بْنُ يَزِيدَ قَالَ حَدَّثَنِي الْحَارِثُ بْنُ فُضَيْلٍ وَعُمَارَةُ بْنُ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي قُرَادٍ قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْخَلَاءِ وَكَانَ إِذَا أَرَادَ الْحَاجَةَ أَبْعَدَ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابو قراد رضی اللہ عنہ سے روایت ہے،انھوں نے کہا: میں رسول اللہ کے ساتھ میدان میں گیا اور آپ جب قضائے حاجت کا ارادہ فرماتے تو دور جاتے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;