var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ فِي أُذُنَيْهِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کے پاس ایک آدمی کا ذکر کیا گیا جو ساری رات سوتا رہا حتی کہ صبح ہوگئی۔آپ نے فرمایا: ’’اس شخص کے کانوں میں شیطان نے پیشاب کردیا تھا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;