var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ وَحُمَيْدُ بْنُ مَسْعَدَةَ قَالَا حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ مَنَامِهِ فَلَا يُدْخِلْ يَدَهُ فِي الْإِنَاءِ حَتَّى يُفْرِغَ عَلَيْهَا ثَلَاثَ مَرَّاتٍ فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ";
nasai.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی شخص نیند سے جاگے تو اپنا ہاتھ برتن میں نہ ڈالے حتی کہ پہلے اس پر تین دفعہ پانی ڈال کر ڈھولے کیونکہ وہ نہیں جانتا کہ اس کے ہاتھ نے رات کہاں بسر کی۔(رات بھر کہاں کہاں لگتا رہا ہے۔‘‘)";
nasai.hukam = "صحیح";
nasai.description = ``;