var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ قَالَ حَدَّثَنَا مَنْصُورٌ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنَّ فُلَانًا نَامَ عَنْ الصَّلَاةِ الْبَارِحَةَ حَتَّى أَصْبَحَ قَالَ ذَاكَ شَيْطَانٌ بَالَ فِي أُذُنَيْهِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہما سے روایت ہے،ایک آدمی نے کہا: اے اللہ کے رسول! فلاں شخص رات سے سویا رہا حتی کہ روشنی ہوگئی۔آپ نے فرمایا: ’’اس کے کانوں میں شیطان نے پیشاب کردیا تھا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;