var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَأَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ صَلَاةُ اللَّيْلِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’رمضان المبارک کے بعد افضل روزے اللہ تعالیٰ کے مہینے محرم کے ہیں اور فرض نمازوں کے بعد افضل نماز رات کی نماز (تہجد) ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;