var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ جَعْفَرِ بْنِ أَبِي وَحْشِيَّةَ أَنَّهُ سَمِعَ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ قِيَامُ اللَّيْلِ وَأَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ الْمُحَرَّمُ أَرْسَلَهُ شُعْبَةُ بْنُ الْحَجَّاجِ";
nasai.urdu = "حضرت حمید بن عبدالرحمٰن سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’فرض نماز کے بعد افضل نماز رات کی نماز (تہجد) ہے اور رمضان المبارک کے بعد افضل روزے محرم کے ہیں۔‘‘ شعبہ بن حجاج نے اس روایت کو مرسل بیان کیا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;