var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ الْبَصْرِيُّ عَنْ بِشْرٍ هُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ قَالَ قُلْتُ لِعَائِشَةَ أَيُّ الْأَعْمَالِ أَحَبُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ الدَّائِمُ قُلْتُ فَأَيُّ اللَّيْلِ كَانَ يَقُومُ قَالَتْ إِذَا سَمِعَ الصَّارِخَ";
nasai.urdu = "حضرت مسروق سے روایت ہے کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ ﷺ کو کون سا عمل زیادہ پسند تھا؟ انھوں نے فرمایا: جو ہمیشہ کیا جائے (خواہ کم ہی ہو) میں نے کہا: آپ رات کو کس وقت تہجد کے لیے اٹھتے تھے؟ انھوں نے فرمایا: جب مرغ کی (پہلی) آواز سنتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;