var nasai = {};
nasai.arabic = "أَخْبَرَنَا بِشْرُ بْنُ هِلَالٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَيُّوبَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَعَسَ الرَّجُلُ وَهُوَ فِي الصَّلَاةِ فَلْيَنْصَرِفْ لَعَلَّهُ يَدْعُو عَلَى نَفْسِهِ وَهُوَ لَا يَدْرِي";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب کسی شخص کو نماز میں اونگھ آنے لگے تو وہ نماز چھوڑ کر پلٹ جائے۔ہوسکتا ہے کہ وہ انجانے میں اپنے آپ کو بددعا دے بیٹھے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;