var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ حُصَيْنٍ قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ حُذَيْفَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ";
nasai.urdu = "حضرت حذیفہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جب رات کو تہجد پڑھنے اٹھتے تو اپنے دہن مبارک کو مسواک کے ساتھ صاف فرماتے۔";
nasai.hukam = "حسن";
nasai.description = ``;