var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا يَزِيدُ قَالَ أَنْبَأَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَ مَا كُنَّا نَشَاءُ أَنْ نَرَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اللَّيْلِ مُصَلِّيًا إِلَّا رَأَيْنَاهُ وَلَا نَشَاءُ أَنْ نَرَاهُ نَائِمًا إِلَّا رَأَيْنَاهُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ اگر ہم چاہتے کہ رسول اللہ ﷺ کو رات میں نماز پڑھتے ہوئے دیکھ لیتے۔اور اگر ہم چاہتے کہ رسول اللہ ﷺ کو سویا ہوا دیکھیں تو یہ بھی دیکھ لیتے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;