var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ قَالَ حَدَّثَنَا مُعَاذُ بْنُ خَالِدٍ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى مُوسَى عَلَيْهِ السَّلَام عِنْدَ الْكَثِيبِ الْأَحْمَرِ وَهُوَ قَائِمٌ يُصَلِّي فِي قَبْرِهِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس رات مجھے معراج کروائی گئی،میں ایک سرخ ٹیلے کے قریب موسیٰ علیہ السلام کے پاس سے گزرا۔وہ کھڑے اپنی قبر میں نماز پڑھ رہے تھے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;