var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ثَابِتٌ وَسُلَيْمَانُ التَّيْمِيُّ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَرَرْتُ عَلَى قَبْرِ مُوسَى عَلَيْهِ السَّلَام وَهُوَ يُصَلِّي فِي قَبْرِهِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’میں موسیٰ علیہ السلام کی قبر کے پاس سے گزرا جبکہ وہ اپنی قبر میں نماز پڑھ رہے تھے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;