var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا عِيسَى عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى مُوسَى عَلَيْهِ السَّلَام وَهُوَ يُصَلِّي فِي قَبْرِهِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جس رات مجھے معراج کروائی گئی،میں موسیٰ علیہ السلام کے پاس سے گزرا جبکہ وہ اپنی قبر میں نماز پڑھ رہے تھے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;