var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ وَإِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَا حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ أَنَسًا يَقُولُ أَخْبَرَنِي بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ أُسْرِيَ بِهِ مَرَّ عَلَى مُوسَى عَلَيْهِ السَّلَام وَهُوَ يُصَلِّي فِي قَبْرِهِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ مجھے نبی ﷺ کے صحابہ میں سے ایک صحابی نے خبر دی کہ جس رات نبی ﷺ کو معراج کروائی گئی،آپ موسیٰ علیہ السلام کے پاس سے گزرے تھے جبکہ وہ اپنی قبر میں نماز پڑھ رہے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;