var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ عَنْ أَنَسٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْلَةَ أُسْرِيَ بِي مَرَرْتُ عَلَى مُوسَى وَهُوَ يُصَلِّي فِي قَبْرِهِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ نے نبی ﷺ کے کسی صحابی سے روایت کی ہے کہ نبی ﷺ نے فرمایا: ’’جس رات مجھے معراج کروائی گئی،میں موسیٰ علیہ السلام کے پاس سے گزرا جبکہ وہ اپنی قبر میں نماز پڑھ رہے تھے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;