var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي يَعْفُورٍ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ قَالَ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا كَانَ إِذَا دَخَلَتْ الْعَشْرُ أَحْيَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّيْلَ وَأَيْقَظَ أَهْلَهُ وَشَدَّ الْمِئْزَرَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ جب رمضان المبارک کا آخری دہاکا (دس دن) شروع ہوتا تو رسول اللہ ﷺ ساری رات جاگتے (عبادت کرتے) اور اپنے گھر والوں کو بھی جگاتے اور اپنا تہ بند کس لیتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;