var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ لَا أَعْلَمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً حَتَّى الصَّبَاحَ وَلَا صَامَ شَهْرًا كَامِلًا قَطُّ غَيْرَ رَمَضَانَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نہیں جانتی کہ رسول اللہ ﷺ نے کبھی ایک رات میں سارا قرآن پڑھا ہو یا صبح تک ساری رات نماز پڑھی ہو یا رمضان المبارک کے علاوہ کبھی پورے مہینے کے روزے رکھے ہوں۔";
nasai.hukam = "صحیح";
nasai.description = ``;