var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ مَنْصُورٍ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَوَرَّمَتْ قَدَمَاهُ فَقِيلَ لَهُ قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ قَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا";
nasai.urdu = "حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ (نفل) نماز اتنی لمبی پڑھتے تھے کہ آپ کے قدم مبارک سوج جاتے تھے۔آپ سے گزارش کی گئی کہ اللہ تعالیٰ نے تو آپ کے اگلے پچھلے سب قصور معاف فرما دیے ہیں (پھر آپ اتنی عبادت کیوں کرتے ہیں؟) آپ نے فرمایا: ’’کیا میں اللہ تعالیٰ کا شکرگزار بندہ نہ بنو؟‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;