var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا صَالِحُ بْنُ مِهْرَانَ وَكَانَ ثِقَةً قَالَ حَدَّثَنَا النُّعْمَانُ بْنُ عَبْدِ السَّلَامِ عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَتَّى تَزْلَعَ يَعْنِي تَشَقَّقُ قَدَمَاهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ اس قدر لمبی نماز پڑھتے تھے کہ آپ کے قدم مبارک پھٹ جاتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;