var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ بُدَيْلٍ وَأَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَيْلًا طَوِيلًا فَإِذَا صَلَّى قَائِمًا رَكَعَ قَائِمًا وَإِذَا صَلَّى قَاعِدًا رَكَعَ قَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ رات کو بہت دیر تک نماز پڑھتے رہتے۔جب آپ کھڑے ہوکر نماز شروع فرماتے تو رکوع بھی کھڑے ہوکر ہی فرماتے اور جب بیٹھ کر نماز شروع فرماتے تو رکوع بھی بیٹھ کر ہی فرماتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;