var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنِي يَزِيدُ بْنُ إِبْرَاهِيمَ عَنْ ابْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَائِمًا وَقَاعِدًا فَإِذَا افْتَتَحَ الصَّلَاةَ قَائِمًا رَكَعَ قَائِمًا وَإِذَا افْتَتَحَ الصَّلَاةَ قَاعِدًا رَكَعَ قَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،فرماتی ہیں: رسول اللہ ﷺ کبھی کھڑے ہوکر نفل نماز پرھتے تھے اور کبھی بیٹھ کر۔جب کھڑے ہوکر نماز شروع فرماتے تو رکوع بھی کھڑے ہوکر فرماتے اورجب بیٹھ کر نماز شروع فرماتے تو رکوع بھی بیٹھ کر فرماتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;