var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى جَالِسًا حَتَّى دَخَلَ فِي السِّنِّ فَكَانَ يُصَلِّي وَهُوَ جَالِسٌ يَقْرَأُ فَإِذَا غَبَرَ مِنْ السُّورَةِ ثَلَاثُونَ أَوْ أَرْبَعُونَ آيَةً قَامَ فَقَرَأَ بِهَا ثُمَّ رَكَعَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے کبھی رسول اللہ ﷺ کو بیٹھ کر نماز پڑھتے نہیں دیکھا حتی کہ آپ بڑھاپے میں داخل ہوگئے،پھر آپ بیٹھ کر نماز شروع فرماتے اور قراءت کرتے۔جب اس سورت کی تیس چالیس آیات رہ جاتیں تو کھڑے ہوکر انھیں پڑھتے،پھر رکوع فرماتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;