var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ قَالَ حَدَّثَنَا النَّضْرُ قَالَ أَنْبَأَنَا يُونُسُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ أُمِّ سَلَمَةَ قَالَتْ مَا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ جَالِسًا إِلَّا الْمَكْتُوبَةَ خَالَفَهُ شُعْبَةُ وَسُفْيَانُ وَقَالَا عَنْ أَبِي إِسْحَقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا سے مروی ہے،فرماتی ہیں: رسول اللہ ﷺ اپنی وفات کے قریب فرض نماز کے علاوہ نماز اکثر بیٹھ کر پڑھا کرتے تھے۔شعبہ اور سفیان نے یونس کی مخالفت کی ہے،انھوں نے یہ روایت عن ابی اسحاق عن ابی سلمۃ عن ام سلمۃ کی سند سے بیان کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;