var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ مَا مَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ قَاعِدًا إِلَّا الْفَرِيضَةَ وَكَانَ أَحَبُّ الْعَمَلِ إِلَيْهِ أَدْوَمَهُ وَإِنْ قَلَّ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ وفات کے قریب فرض نماز کے علاوہ باقی نماز اکثر بیٹھ کر پڑھا کرتے تھے۔اور آپ کے نزدیک زیادہ پسندیدہ عمل وہ تھا جس پر ہمیشگی کی جائے اگرچہ وہ کم ہو۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;