var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ حَجَّاجٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ أَنَّ أَبَا سَلَمَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَمُتْ حَتَّى كَانَ يُصَلِّي كَثِيرًا مِنْ صَلَاتِهِ وَهُوَ جَالِسٌ";
nasai.urdu = "عثمان بن ابوسلیمان سے مروی ہے کہ ابو سلمہ نے ان سے کہا کہ عائشہ رضی اللہ عنہا نے ان سے بیان فرمایا کہ وفات سے پہلے نبی ﷺ اپنی اکثر نمازوں کو بیٹھ کر پڑھتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;