var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو الْأَشْعَثِ عَنْ يَزِيدَ بْنِ زُرَيْعٍ قَالَ أَنْبَأَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ قُلْتُ لِعَائِشَةَ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَهُوَ قَاعِدٌ قَالَتْ نَعَمْ بَعْدَ مَا حَطَمَهُ النَّاسُ";
nasai.urdu = "حضرت عبداللہ بن شقیق سے مروی ہے کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا: کیا رسول اللہ ﷺ (نفل) نماز بیٹھ کر پڑھتے تھے؟ انھوں نے فرمایا: ہاں،جب لوگوں (کی فکر اور ان کے کاموں کے بوجھ) نے آپ کو بوڑھا کردیا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;