var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ عَنْ حَفْصَةَ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي سُبْحَتِهِ قَاعِدًا قَطُّ حَتَّى كَانَ قَبْلَ وَفَاتِهِ بِعَامٍ فَكَانَ يُصَلِّي قَاعِدًا يَقْرَأُ بِالسُّورَةِ فَيُرَتِّلُهَا حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا سے منقول ہے،فرماتی ہیں: میں نے کبھی رسول اللہ ﷺ کو بیٹھ کر نفل نماز پڑھتے نہیں دیکھا تھا حتی کہ آپ کی وفات سے ایک سال قبل ایسا ہوا کہ آپ بیٹھ کر نماز پڑھنے لگے،مگر آپ سورت کو اتنا ٹھہرٹھہر کر سکون سے پڑھتے تھے کہ وہ اپنے سے لمبی سورت سے بھی لمبی بن جاتی تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;