var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ أَنْبَأَنَا ابْنُ الْهَادِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُصَلِّي وَإِنِّي لَمُعْتَرِضَةٌ بَيْنَ يَدَيْهِ اعْتِرَاضَ الْجَنَازَةِ حَتَّى إِذَا أَرَادَ أَنْ يُوتِرَ مَسَّنِي بِرِجْلِهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،فرماتی ہیں کہ بے شک اللہ کے رسول ﷺ نماز پڑھتے ہوتے اور میں آپ کے سامنے اس طرح لیٹی ہوتی جیسے جنازہ ہوتا ہے حتی کہ جب آپ وتر پڑھنے کا ارادہ فرماتے تو مجھے پاؤں لگا کر جگا دیتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;