var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ حَفْصٍ عَنْ حُمَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مُتَرَبِّعًا قَالَ أَبُو عَبْد الرَّحْمَنِ لَا أَعْلَمُ أَحَدًا رَوَى هَذَا الْحَدِيثَ غَيْرَ أَبِي دَاوُدَ وَهُوَ ثِقَةٌ وَلَا أَحْسِبُ هَذَا الْحَدِيثَ إِلَّا خَطَأً وَاللَّهُ تَعَالَى أَعْلَمُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے منقول ہے،فرماتی ہیں: میں نے نبی ﷺ کو چارزانو بیٹھ کر نماز پڑھتے ہوئے دیکھا۔امام ابوعبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ میں نہیں جانتا کہ اس حدیث کو ابوداود (حفری) (مشہور محدث نہیں) کے علاوہ کسی اور نے بیان کیا ہے۔وہ اگرچہ ثقہ راوی ہے مگر میں سمجھتا ہوں،یہ حدیث خطا ہے۔واللہ تعالیٰ اعلم۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>حفص بن غیاث مدلس وعنعن،وشیخہ ھو حمید بن قیس۔<br>وحدیث البخاري (827) یخالفہ ولو صح لکان محمولاً علی العذر۔`;
nasai.anwaar = [334,1];