var nasai = {};
nasai.arabic = "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ قَالَ سَأَلْتُ عَائِشَةَ كَيْفَ كَانَتْ قِرَاءَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ يَجْهَرُ أَمْ يُسِرُّ قَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ رُبَّمَا جَهَرَ وَرُبَّمَا أَسَرَّ";
nasai.urdu = "حضرت عبداللہ بن ابی قیس سے منقول ہے،فرماتے ہیں: میں نے ام المومنین حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ رات کی نفل نماز میں رسول اللہ ﷺ کی قراءت کیسے ہوتی تھی؟ بلند آواز سے یا آہستہ؟ حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ آپ دونوں طرح قراءت فرمایا کرتے تھے،کبھی بلند آواز سے کبھی آہستہ۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;