var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ سُمَيْعٍ قَالَ حَدَّثَنَا زَيْدٌ يَعْنِي ابْنَ وَاقِدٍ عَنْ كَثِيرِ بْنِ مُرَّةَ أَنَّ عُقْبَةَ بْنَ عَامِرٍ حَدَّثَهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الَّذِي يَجْهَرُ بِالْقُرْآنِ كَالَّذِي يَجْهَرُ بِالصَّدَقَةِ وَالَّذِي يُسِرُّ بِالْقُرْآنِ كَالَّذِي يُسِرُّ بِالصَّدَقَةِ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ اپنے شاگردوں کو بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’جو شخص بلند آواز سے قرآن پڑھتا ہے،وہ اس شخص کی طرح ہے جو اعلانیہ صدقہ کرتا ہے اور جو شخص آہستہ قرآن پڑھتا ہے وہ اس شخص کی طرح ہے جو چھپا کر صدقہ کرتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;