var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الرَّحْمَنِ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ أَنَّهُ سَمِعَ عَلِيًّا الْأَزْدِيَّ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى أَبُو عَبْد الرَّحْمَنِ هَذَا الْحَدِيثُ عِنْدِي خَطَأٌ وَاللَّهُ تَعَالَى أَعْلَمُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’دن اور رات کی (نفل) نماز دو دو رکعت کرکے پڑھنی چاہیے۔‘‘ امام ابوعبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں میرے نزدیک یہ حدیث خطا ہے۔واللہ اعلم۔";
nasai.hukam = "حسن";
nasai.description = ``;