var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ حَبِيبٍ عَنْ طَاوُسٍ قَالَ قَالَ ابْنُ عُمَرَ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ مَثْنَى مَثْنَى فَإِذَا خَشِيتَ الصُّبْحَ فَوَاحِدَةٌ";
nasai.urdu = "حضرت طاؤس حضرت ابن عمر رضی اللہ عنہما سے بیان فرماتے ہیں کہ ایک آدمی نے رسول اللہ ﷺ سے رات کی نماز کا طریقہ پوچھا تو آپ نے فرمایا: ’’دودو کرکے پڑھتے جاؤ۔جب تجھے صبح کا خطرہ ہو تو ایک رکعت پڑھ لو۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;