var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ وَمُحَمَّدُ بْنُ صَدَقَةَ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ";
nasai.urdu = "حضرت سالم اپنے والد (ابن عمررضی اللہ عنہما) سے بیان فرماتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’رات کی نماز دو دو رکعت ہے۔جب تجھے صبح کے طلوع ہونے کا خطرہ ہو تو (صبح طلوع ہونے سے پہلے) ایک رکعت پڑھ لے۔‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;