var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْ لَقَدْ رَأَيْتُمُونِي مُعْتَرِضَةً بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فَإِذَا أَرَادَ أَنْ يَسْجُدَ غَمَزَ رِجْلِي فَضَمَمْتُهَا إِلَيَّ ثُمَّ يَسْجُدُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں: (یوں سمجھو کہ) تم مجھے دیکھ رہے ہو کہ میں اللہ کے رسول ﷺ کے سامنے لیٹی ہوتی اور اللہ کے رسول نماز پڑھتے ہوتے۔جب آپ سجدہ کرنے کا ارادہ فرماتے تو میرا پاؤں ہاتھ سے دباتے،میں پاؤں سکیڑ لیتی،پھر آپ سجدہ فرماتے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;