var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي لَبِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يُسْأَلُ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِرَكْعَةٍ";
nasai.urdu = "حضرت ابوسلمہ حضرت ابن عمر رضی اللہ عنہما سے بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو منبر پر یہ فرماتے سنا جبکہ آپ سے رات کی نماز کے بارے میں پوچھا گیاتھا۔(آپ نے فرمایا:) ’’دودوکرکے پڑھو۔جب صبح کا خطرہ ہوتو ایک رکعت پڑھ لو۔‘‘";
nasai.hukam = "";
nasai.description = ``;