var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُوسَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ الْحُرِّ قَالَ حَدَّثَنَا نَافِعٌ أَنَّ ابْنَ عُمَرَ أَخْبَرَهُمْ أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ قَالَ مَثْنَى مَثْنَى فَإِنْ خَشِيَ أَحَدُكُمْ الصُّبْحَ فَلْيُوتِرْ بِوَاحِدَةٍ";
nasai.urdu = "حضرت نافع بیان کرتے ہیں کہ حضرت ابن عمر رضی اللہ عنہما نے ہم کو بتایا کہ ایک آدمی نے رسول اللہ ﷺ سے رات کی نماز کے بارے میں پوچھا تو آپ نے فرمایا: ’’دو دو کرکے پڑھی جائے۔جب کسی کو صبح کے طلوع ہونے کا ڈر ہو تو ایک رکعت پڑھ لے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;