var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عُثْمَانُ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ سَأَلَ رَجُلٌ مِنْ الْمُسْلِمِينَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ صَلَاةُ اللَّيْلِ فَقَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ";
nasai.urdu = "حضرت سالم حضرت ابن عمر رضی اللہ عنہما سے بیان کرتے ہیں کہ مسلمانوں میں سے ایک آدمی نے رسول اللہ ﷺ سے پوچھا: رات کی نماز کیسے پڑھی جائے؟ تو آپ نے فرمایا: ’’رات کی نماز دو دو رکعت پڑھی جائے۔جب تجھے صبح کے طلوع کا قرب محسوس ہو تو ایک رکعت پڑھ لے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;