var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمٍ وَهُوَ ابْنُ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ أَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ يَا أَهْلَ الْقُرْآنِ أَوْتِرُوا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ وِتْرٌ يُحِبُّ الْوِتْرَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے نماز وتر پڑھی،پھر آپ نے فرمایا: ’’اے قرآن والو! وتر پڑھا کرو کیونکہ اللہ تعالیٰ وتر (اکیلا) ہے اور وتر کو پسند فرماتا ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1416) ترمذی (453) ابن ماجہ (1119)`;
nasai.anwaar = [334,1];