var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ أَبِي نُعَيْمٍ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ الْوِتْرُ لَيْسَ بِحَتْمٍ كَهَيْئَةِ الْمَكْتُوبَةِ وَلَكِنَّهُ سُنَّةٌ سَنَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ فرماتے ہیں کہ وتر کی نماز فرض نماز کی طرح واجب نہیں بلکہ یہ سنت (مؤکدہ) ہے جسے رسول اللہ ﷺ نے تمھارے لیے جاری فرمایا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;