var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ وَمُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ عَنْ النَّضْرِ بْنِ شُمَيْلٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ أَبِي شِمْرٍ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ النَّوْمِ عَلَى وِتْرٍ وَصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَيْ الضُّحَى";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ میرے دلی محبوب رسول اللہ ﷺ نے مجھے تین باتوں کی نصیحت تاکید کے ساتھ کی ہے: میں وتر پڑھ کر سوؤں،ہر مہینے میں تین روزے رکھوں اور فجر (یا ضحیٰ) کی دو رکعتوں کی پابندی کروں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;