var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا عَنْ عَبَّاسٍ الْجُرَيْرِيِّ قَالَ سَمِعْتُ أَبَا عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ الْوِتْرِ أَوَّلَ اللَّيْلِ وَرَكْعَتَيْ الْفَجْرِ وَصَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ مجھے میرے دلی محبوب ﷺ نے تین باتوں کی تاکید فرمائی کہ شروع رات میں وتر پڑھ لیا کروں،فجر کی سنتوں کی پابندی کروں اور ہر مہینے میں تین نفلی روزے رکھوں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;