var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَنَامُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرِجْلَايَ فِي قِبْلَتِهِ فَإِذَا سَجَدَ غَمَزَنِي فَقَبَضْتُ رِجْلَيَّ فَإِذَا قَامَ بَسَطْتُهُمَا وَالْبُيُوتُ يَوْمِئِذٍ لَيْسَ فِيهَا مَصَابِيحُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں اللہ کے رسول ﷺ کے سامنے سوئی ہوی تھی اور میرے پاؤں آپ کے قبلے میں ہوتے تھے۔جب آپ سجدہ فرماتے تو میرے پاؤں دبا دیتے۔میں انھیں سکیڑ لیتی۔جب آپ کھڑے ہوتے تو پھر بچھا لیتی۔ان دنوں گھروں میں چراغ نہیں ہوتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;