var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ أَبِي حَصِينٍ عَنْ يَحْيَى بْنِ وَثَّابٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ أَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَوَّلِهِ وَآخِرِهِ وَأَوْسَطِهِ وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ نے وتر اول رات میں بھی پڑھے،درمیان رات میں بھی اور آخر رات میں بھی۔آخری عمر میں آپ کے وتر آخر رات میں (فجر سے پہلے) ہوتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;