var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ الْحَسَنِ بْنِ الْحُرِّ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ كَانَ يُوتِرُ عَلَى بَعِيرِهِ وَيَذْكُرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ";
nasai.urdu = "حضرت نافع سے روایت ہے کہ حضرت ابن عمر رضی اللہ عنہما اپنے اونٹ پر وتر پڑھ لیا کرتے تھے اور وہ بیان فرماتے تھے کہ رسول اللہ ﷺ بھی ایسے کیا کرتے تھے۔";
nasai.hukam = "إسنادہ صحیح، متفق علیہ";
nasai.description = ``;