var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قَالَ لِي ابْنُ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى الْبَعِيرِ";
nasai.urdu = "حضرت سعید بن یسار نے کہا کہ مجھے حضرت ابن عمر رضی اللہ عنہما نے فرمایا: رسول اللہ ﷺ اونٹ پر وتر پڑھ لیا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;