var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ عَفَّانَ قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ ابْنِ عُمَرَ أَنَّ رَجُلًا مِنْ أَهْلِ الْبَادِيَةِ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ قَالَ مَثْنَى مَثْنَى وَالْوِتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے مروی ہے کہ ایک بدوی شخص نے رسول اللہ ﷺ سے رات کی نماز کے بارے میں پوچھا تو آپ نے فرمایا: ’’دو دورکعت کرکے پڑھتے جاؤ اور آخر رات میں ایک رکعت وتر پڑھ لو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;