var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ حَدَّثَهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا أَرَدْتَ أَنْ تَنْصَرِفَ فَارْكَعْ بِوَاحِدَةٍ تُوتِرُ لَكَ مَا قَدْ صَلَّيْتَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’رات کی نماز دو دو رکعت کرکے پڑھو۔جب تمھارا ارادہ نماز ختم کرنے کا ہو تو ایک رکعت پڑھ لو۔یہ رکعت تمھاری پڑھی ہوئی پوری نماز کو وتر بنادے گی۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;