var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ الْمُبَارَكِ قَالَ حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَنَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سَمِعَهُ يَقُولُ صَلَاةُ اللَّيْلِ رَكْعَتَيْنِ رَكْعَتَيْنِ فَإِذَا خِفْتُمْ الصُّبْحَ فَأَوْتِرُوا بِوَاحِدَةٍ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے منقول ہے کہ میں نے نبی ﷺ کو یہ فرماتے سنا ہے: ’’رات کی نماز دودورکعت ہے۔جب تمھیں طلوع صبح کا خطرہ ہو تو ایک رکعت وتر پڑھ لو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;