var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنْ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الْأَيْمَنِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی ﷺ رات کو گیارہ رکعات پڑھتے تھے۔ان میں سے ایک رکعت الگ وتر پڑھتے،پھر اپنے دائیں پہلو پر لیٹ جاتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;