var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ أَنَّ عَائِشَةَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يُسَلِّمُ فِي رَكْعَتَيْ الْوِتْرِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ وتر کی دو رکعتوں کے بعد سلام نہیں پھیرتے تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن۔`;
nasai.anwaar = [334,1];