var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الرَّكْعَةِ الْأُولَى مِنْ الْوِتْرِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَفِي الثَّانِيَةِ بِقُلْ يَا أَيُّهَا الْكَافِرُونَ وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ";
nasai.urdu = "حضرت ابی بن کعب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ وتر کی پہلی رکعت میں (سبح اسم ربک الاعلی) دوسری میں (قل یایھا الکفرون) اور تیسری میں (قل ہواللہ احد) پڑھتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;