var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ مُوسَى قَالَ أَنْبَأَنَا عَبْدُ الْعَزِيزِ بْنُ خَالِدٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْوِتْرِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَفِي الرَّكْعَةِ الثَّانِيَةِ بِقُلْ يَا أَيُّهَا الْكَافِرُونَ وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ وَلَا يُسَلِّمُ إِلَّا فِي آخِرِهِنَّ وَيَقُولُ يَعْنِي بَعْدَ التَّسْلِيمِ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثًا";
nasai.urdu = "حضرت ابی بن کعب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ وتر (کی پہلی رکعت) میں (سبح اسم ربک الاعلی) دوسری میں (قل یایھا الکفرون) اور تیسری میں (قل ہواللہ احد) پڑھا کرتے تھے اور سلام آخر ہی میں پھیرتے تھے۔اور سلام کے بعد تین دفعہ (سبحان الملک القدوس) پڑھتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن۔`;
nasai.anwaar = [334,1];