var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ أَبِي زَائِدَةَ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِثَلَاثٍ يَقْرَأُ فِي الْأُولَى بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَفِي الثَّانِيَةِ بِقُلْ يَا أَيُّهَا الْكَافِرُونَ وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ أَوْقَفَهُ زُهَيْرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ تین وتر پڑھتے تھے۔پہلی رکعت میں (سبح اسم ربک الاعلی) دوسری میں (قل یایھا الکفرون) اور تیسری میں (قل ھواللہ احد) پڑھتے تھے۔زہیر (بن معاویہ) نے اسے موقوف بیان کیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;