var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ كَانَ يُوتِرُ بِثَلَاثٍ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
nasai.urdu = "حضرت سعید بن جبیر سے روایت ہے کہ حضرت ابن عباس رضی اللہ عنہما تین وتر پڑھا کرتے تھے اور ان میں (سبح اسم ربک الاعلی)،(قل یایھا الکفرون) اور (قل ھواللہ احد) پڑھتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;