var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ جَبَلَةَ قَالَ حَدَّثَنَا مَعْمَرُ بْنُ مَخْلَدٍ ثِقَةٌ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ ابْنِ عَبَّاسٍ قَالَ اسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَنَّ وَسَاقَ الْحَدِيثَ";
nasai.urdu = "محمد بن علی حضرت ابن عباس رضی اللہ عنہما سے بیان کرتے ہیں کہ رسول اللہ ﷺ جاگے اور مسواک کی،پھر راوی نے پوری حدیث بیان کی۔";
nasai.hukam = "صحیح";
nasai.description = ``;