var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِثَلَاثَ عَشْرَةَ رَكْعَةً فَلَمَّا كَبِرَ وَضَعُفَ أَوْتَرَ بِتِسْعٍ خَالَفَهُ عُمَارَةُ بْنُ عُمَيْرٍ فَرَوَاهُ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ عَائِشَةَ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ رات کو تیرہ رکعت پڑھتے تھے،پھر جب آپ بوڑھے اور کمزور ہوگئے تو نو پڑھنے لگے۔عمارہ بن عمیر نے (عمرو بن مرہ کی) مخالفت کی ہے اور یہ روایت عن یحییٰ بن الحزار عن عائشۃ کی سند سے بیان کی ہے۔(جبکہ عمرو بن مرہ نے عن عائشۃ کے بجائے عن ام سلمہ کہا تھا۔)";
nasai.hukam = "صحیح";
nasai.description = ``;