var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ وَعَبْدُ الرَّزَّاقِ قَالَا حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انھوں نے کہا: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’آگ پر پکی ہوئی چیز کھانے سے وضو کرو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;