var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ عَنْ سُلَيْمَانَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ تِسْعًا فَلَمَّا أَسَنَّ وَثَقُلَ صَلَّى سَبْعًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ رات کو نو رکعت پڑھتے تھے۔جب آپ بوڑھے اور بوجھل ہوگئے تو سات پڑھنے لگے۔";
nasai.hukam = "صحیح";
nasai.description = ``;