var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنِي ضُبَارَةُ بْنُ أَبِي السَّلِيلِ قَالَ حَدَّثَنِي دُوَيْدُ بْنُ نَافِعٍ قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ عَنْ أَبِي أَيُّوبَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوِتْرُ حَقٌّ فَمَنْ شَاءَ أَوْتَرَ بِسَبْعٍ وَمَنْ شَاءَ أَوْتَرَ بِخَمْسٍ وَمَنْ شَاءَ أَوْتَرَ بِثَلَاثٍ وَمَنْ شَاءَ أَوْتَرَ بِوَاحِدَةٍ";
nasai.urdu = "حضرت ابوایوب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’وتر حق ہے جو چاہے سات پڑھ لے،جو چاہے پانچ پڑھ لے،جو چاہے تین پڑھ لے اور جو چاہے ایک پڑھ لے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;