var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ قَالَ أَخْبَرَنِي أَبِي قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي الزُّهْرِيُّ قَالَ حَدَّثَنَا عَطَاءُ بْنُ يَزِيدَ عَنْ أَبِي أَيُّوبَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوِتْرُ حَقٌّ فَمَنْ شَاءَ أَوْتَرَ بِخَمْسٍ وَمَنْ شَاءَ أَوْتَرَ بِثَلَاثٍ وَمَنْ شَاءَ أَوْتَرَ بِوَاحِدَةٍ";
nasai.urdu = "حضرت ابوایوب رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’وتر حق ہے جو شخص پانچ پڑھنا چاہے،پانچ پڑھ لے،جو تین پڑھنا چاہے تین پڑھ لے اور جو ایک پڑھنا چاہے ایک پڑھ لے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;