var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ قَالَ حَدَّثَنِي أَبُو مُعَيْدٍ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ يَقُولُ الْوِتْرُ حَقٌّ فَمَنْ أَحَبَّ أَنْ يُوتِرَ بِخَمْسِ رَكَعَاتٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِثَلَاثٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِوَاحِدَةٍ فَلْيَفْعَلْ";
nasai.urdu = "حضرت ابوایوب رضی اللہ عنہ بیان کرتے ہیں کہ وتر حق ہے۔جو شخص پانچ پڑھنا چاہے،پانچ پڑھ لے،جو تین پڑھنا چاہے تین پڑھ لے اور جو ایک پڑھنا چاہے ایک پڑھ لے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;