var nasai = {};
nasai.arabic = "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي أَيُّوبَ قَالَ مَنْ شَاءَ أَوْتَرَ بِسَبْعٍ وَمَنْ شَاءَ أَوْتَرَ بِخَمْسٍ وَمَنْ شَاءَ أَوْتَرَ بِثَلَاثٍ وَمَنْ شَاءَ أَوْتَرَ بِوَاحِدَةٍ وَمَنْ شَاءَ أَوْمَأَ إِيمَاءً";
nasai.urdu = "حضرت ابوایوب رضی اللہ عنہ فرماتے ہیں کہ جو شخص چاہے سات وتر پڑھ لے،جو شخص چاہے پانچ وتر پڑھ لے،جو شخص چاہے تین وتر پڑھ لے ور جو شخص چاہے ایک وتر پڑھ لے۔اور جو شخص چاہے (یعنی مجبور ہو) وہ اشارے سے پڑھ لے۔";
nasai.hukam = "حسن";
nasai.description = ``;