var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبْعٍ أَوْ بِخَمْسٍ لَا يَفْصِلُ بَيْنَهُنَّ بِتَسْلِيمٍ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا سے منقول ہے،فرماتی ہیں: رسول اللہ ﷺ سات یا پانچ وتر پڑھتے تو درمیان میں سلام نہیں پھیرتے تھے";
nasai.hukam = "صحیح";
nasai.description = ``;