var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ الْحُسَيْنِ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ قَالَ الْوِتْرُ سَبْعٌ فَلَا أَقَلَّ مِنْ خَمْسٍ فَذَكَرْتُ ذَلِكَ لِإِبْرَاهِيمَ فَقَالَ عَمَّنْ ذَكَرَهُ قُلْتُ لَا أَدْرِي قَالَ الْحَكَمُ فَحَجَجْتُ فَلَقِيتُ مِقْسَمًا فَقُلْتُ لَهُ عَمَّنْ قَالَ عَنْ الثِّقَةِ عَنْ عَائِشَةَ وَعَنْ مَيْمُونَةَ";
nasai.urdu = "حضرت حکم حضرت مقسم سے روایت کرتے ہیں،انھوں نے کہا: وتر سات ہیں اور پانچ کم تو قطعاً نہیں۔میں نے یہ بات حضرت ابراہیم نخعی سے ذکر کی تو انھوں نے کہا: مقسم نے یہ بات کس سے نقل کی ہے؟ میں نے کہا: مجھے تو علم نہیں۔حکم کہتے ہیں: میں حج کے لیے گیا تو مقسم سے ملا اور ان سے پوچھا کہ وہ روایت آپ کس سے بیان کرتے ہیں؟ وہ کہنے لگے: ثقہ اور معتبر اشخاص سے۔حضرت عائشہ اور حضرت میمونہ رضی اللہ عنہما سے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>الثقۃ: لم أعرفہ۔<br>ومقطوع الحکم بن عتیبۃ صحیح۔`;
nasai.anwaar = [334,1];