var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِخَمْسٍ وَلَا يَجْلِسُ إِلَّا فِي آخِرِهِنَّ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ جب رسول اللہ ﷺ بوڑھے اور فربہ ہوگئے تو آپ سات وتر پڑھتے تھے۔آخری کے سوا کسی رکعت میں (تشہد کے لیے) نہ بیٹھتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;