var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ حَرْبٍ قَالَ حَدَّثَنِي الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ قَارِظٍ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انھوں نے کہا: میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا: ’’آگ پر پکی ہوئی چیز (کھانے) سےوضو کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;