var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ قَالَ أَخْبَرَنِي سَعْدُ بْنُ هِشَامٍ عَنْ عَائِشَةَ أَنَّهُ سَمِعَهَا تَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِتِسْعِ رَكَعَاتٍ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَلَمَّا ضَعُفَ أَوْتَرَ بِسَبْعِ رَكَعَاتٍ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُوَ جَالِسٌ";
nasai.urdu = "حضرت سعد بن ہشام سے روایت ہے کہ میں نے حضرت عائشہ رضی اللہ عنہا کو فرماتے سنا: تحقیق رسول اللہ ﷺ نو رکعات وتر پڑھ کر،پھر بیٹھے بیٹھے دو رکعت پڑھتے۔اور جب کمزور ہوگئے تو سات رکعات وتر پڑھتے،پھر بیٹھے بیٹھے دورکعت پڑھتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;