var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِثَلَاثَ عَشْرَةَ رَكْعَةً فَلَمَّا كَبِرَ وَضَعُفَ أَوْتَرَ بِتِسْعٍ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ تیرہ رکعت وتر پڑھتے تھے۔جب بوڑھے اور کمزور ہوگئے تو نو رکعات وتر پڑھنے لگے۔";
nasai.hukam = "حسن";
nasai.description = ``;