var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ عَنْ حُصَيْنِ بْنِ نُمَيْرٍ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ ذَرٍّ عَنْ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْوِتْرِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ وتر نماز میں (سبح اسم ربک الاعلیٰ)،(قل یایھا الکفرون) اور (قل ھواللہ احد) پڑھا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;