var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ عَنْ زُبَيْدٍ عَنْ ابْنِ أَبْزَى عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ فَإِذَا فَرَغَ مِنْ الصَّلَاةِ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثَ مَرَّاتٍ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ وتروں میں (سبح اسم ربک الاعلیٰ)،(قل یایھا الکفرون) اور (قل ھواللہ احد) پڑھتے تھے اور جب نماز سے فارغ ہوتے تو تین دفعہ [سبحان الملک القدوس] پڑھتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;