var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ حَرْبٍ عَنْ مَالِكٍ عَنْ زُبَيْدٍ عَنْ ابْنِ أَبْزَى عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْوِتْرِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَد";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ وتر نماز میں (سبح اسم ربک الاعلیٰ)،(قل یایھا الکفرون) اور (قل ھواللہ احد) پڑھتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;