var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا مَالِكٌ عَنْ زُبَيْدٍ عَنْ ذَرٍّ عَنْ ابْنِ أَبْزَى مُرْسَلٌ وَقَدْ رَوَاهُ عَطَاءُ بْنُ السَّائِبِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ";
nasai.urdu = "یہ روایت عبدالرحمٰن بن ابزیٰ کے بیٹے سے ان کے واسطے کے بغیر یعنی مرسل بھی آئی ہے۔اور عطاء بن سائب نے سعید بن عبدالرحمٰن بن ابزیٰ سے اور انھوں نے اپنے باپ (عبدالرحمٰن) سے یہ روایت بیان کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;