var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ حَبِيبٍ قَالَ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْوِتْرِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ وتر میں (سبح اسم ربک الاعلیٰ)،(قل یایھا الکفرون) اور (قل ھواللہ احد) پڑھتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;