var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ عَزْرَةَ يُحَدِّثُ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ فَإِذَا فَرَغَ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثًا";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ سے روایت ہے کہ رسول اللہ ﷺ (سبح اسم ربک الاعلیٰ)،(قل یایھاالکفرون) اور (قل ھواللہ احد) کے ساتھ وتر پڑھا کرتے تھے،پھر جب فارغ ہوتے تو تین دفعہ [سبحان الملک القدوس] پڑھتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;