var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ فَإِذَا فَرَغَ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثًا وَيَمُدُّ فِي الثَّالِثَةِ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ رسول اللہ ﷺ کے بارے میں بیان فرماتے ہیں کہ آپ (سبح اسم ربک الاعلیٰ)،(قل یایھاالکفرون) اور (قل ھواللہ احد) کے ساتھ وتر پڑھا کرتے تھے،پھر جب فارغ ہوتے تو تین دفعہ [سبحان الملک القدوس] پڑھتے اور تیسری دفعہ آواز کھینچتے (لمبی کرتے) تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;