var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ زُرَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى خَالَفَهُمَا شَبَابَةُ فَرَوَاهُ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے بیان ہے کہ رسول اللہ ﷺ وتر میں سورۂ (سبح اسم ربک الاعلیٰ) پڑھتے تھے۔(شعبہ کے شاگرد) شبابہ نے دونوں (ابوداود اور محمد) کی مخالفت کی ہے اور اس روایت کو شعبۃ عن قتادۃ عن زرارۃ بن اوفی عن عمران بن حصین کی سند سے ذکر کیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;