var nasai = {};
nasai.arabic = "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا شَبَابَةُ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْتَرَ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى قَالَ أَبُو عَبْد الرَّحْمَنِ لَا أَعْلَمُ أَحَدًا تَابَعَ شَبَابَةَ عَلَى هَذَا الْحَدِيثِ خَالَفَهُ يَحْيَى بْنُ سَعِيدٍ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے سورۂ (سبح اسم ربک الاعلیٰ) کے ساتھ وتر پڑھا۔امام ابوعبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ میں نہیں جانتا کہ کسی راوی نے اس روایت میں شبابہ کی موافقت کی ہو۔یحییٰ بن سعید نے شبابہ کی مخالفت کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;