var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنَا لَيْثٌ قَالَ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلَاةِ الْعِشَاءِ إِلَى الْفَجْرِ بِاللَّيْلِ سِوَى رَكْعَتَيْ الْفَجْرِ وَيَسْجُدُ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ عشاء کی نماز سے فارغ ہونے کے بعد فجر تک رات میں،فجر کی دو سنتوں کے علاوہ،گیارہ رکعت پڑھا کرتے تھے اور آپ اتنا لمبا سجدہ کرتے تھے کہ تم میں سے ایک شخص پچاس آیات پڑھ سکتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;