var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ عَنْ سُفْيَانَ عَنْ زُبَيْدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يُوتِرُ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ وَيَقُولُ بَعْدَ مَا يُسَلِّمُ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثَ مَرَّاتٍ يَرْفَعُ بِهَا صَوْتَهُ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے روایت ہے،نبی ﷺ وتر کی نماز میں (سبح اسم ربک الاعلیٰ)،(قل یایھا الکفرون) اور (قل ھواللہ احد) پڑھا کرتے تھے اور سلام پھیرنے کے بعد تین دفعہ بلند آواز سے [سبحان الملک القدوس] پڑھتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;