var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَدَعُ أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ خَالَفَهُ عَامَّةُ أَصْحَابِ شُعْبَةَ مِمَّنْ رَوَى هَذَا الْحَدِيثَ فَلَمْ يَذْكُرُوا مَسْرُوقًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ ظہر سے قبل چار رکعت (سنت مؤکدہ) اور فجر سے قبل دو رکعت سنت نہیں چھوڑتے تھے۔یہ حدیث بیان کرنے والے شعبہ کے دوسرے شاگردوں نے عثمان بن عمر کی مخالفت کی ہے،یعنی انھوں نے (محمد بن منتشر اور حضرت عائشہ رضی اللہ عنہا کے درمیان) مسروق کا ذکر نہیں کیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;