var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا أَنْبَأَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ مُحَمَّدٌ الْقَارِيُّ عَنْ أَبِي أَيُّوبَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّئُوا مِمَّا غَيَّرَتْ النَّارُ";
nasai.urdu = "حضرت ابو ایوب انصاری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’آگ پر پکی ہوئی چیز (کھانے) سے وضو کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;