var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا نُودِيَ لِصَلَاةِ الصُّبْحِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ يَقُومَ إِلَى الصَّلَاةِ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا سے روایت ہے کہ جب صبح کی اذان ہوتی تو رسول اللہ ﷺ فرض نماز کے لیے جانے سے پہلے دوہلکی رکعتیں پڑھا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;