var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَكَتَ الْمُؤَذِّنُ بِالْأُولَى مِنْ صَلَاةِ الْفَجْرِ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ بَعْدَ أَنْ يَتَبَيَّنَ الْفَجْرُ ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الْأَيْمَنِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ جب مؤذن فجر کی نماز کی اذان سے فارغ ہوتا تو فجر واضح اور روشن ہونے کے بعد رسول اللہ ﷺ اٹھتے اور فجر کی فرض نماز سے پہلے دو ہلکی رکعتیں پڑھتے،پھر اپنے دائیں پہلو پر لیٹ جاتے";
nasai.hukam = "متفق علیہ";
nasai.description = ``;