var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكُنْ مِثْلَ فُلَانٍ كَانَ يَقُومُ اللَّيْلَ فَتَرَكَ قِيَامَ اللَّيْلِ";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے مجھ سے فرمایا: ’’توفلاں شخص کی طرح نہ ہوجانا جو پہلے رات کو (نفل) نماز پڑھا کرتا تھا پھر اس نے اسے چھوڑ دیا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;