var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَارِثُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ قَالَ حَدَّثَنِي الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ عُمَرَ بْنِ الْحَكَمِ بْنِ ثَوْبَانَ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكُنْ يَا عَبْدَ اللَّهِ مِثْلَ فُلَانٍ كَانَ يَقُومُ اللَّيْلَ فَتَرَكَ قِيَامَ اللَّيْلِ";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہما سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’اے عبداللہ! فلاں شخص کی طرح نہ ہوجانا جو رات کا قیام (نفل نماز) پڑھا کرتا تھا،پھر اس نے قیام اللیل چھوڑ دیا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;