var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ حَمْزَةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ هُوَ وَنَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَيْنَ النِّدَاءِ وَالْإِقَامَةِ رَكْعَتَيْنِ خَفِيفَتَيْنِ رَكْعَتَيْ الْفَجْرِ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا سے مروی ہے کہ نبی ﷺ اذان اور اقامت کے درمیان فجر کی دو ہلکی رکعتیں پڑھتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;