var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا حَرَمِيٌّ وَهُوَ ابْنُ عُمَارَةَ بْنِ أَبِي حَفْصَةَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ يَحْيَى بْنَ جَعْدَةَ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو الْقَارِيِّ عَنْ أَبِي طَلْحَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِمَّا غَيَّرَتْ النَّارُ";
nasai.urdu = "حضرت ابو طلحہ انصاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’آگ پر پکی ہوئی چیز (کھانے) سے وضو کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;