var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي نَافِعٌ أَنَّ ابْنَ عُمَرَ حَدَّثَهُ أَنَّ حَفْصَةَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ بَيْنَ النِّدَاءِ وَالْإِقَامَةِ مِنْ صَلَاةِ الصُّبْحِ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ صبح کی نماز کی اذان اور اقامت کے درمیان دو ہلکی رکعتیں پڑھتے تھے";
nasai.hukam = "حسن";
nasai.description = ``;