var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ أَنْبَأَنَا إِسْحَقُ بْنُ الْفُرَاتِ عَنْ يَحْيَى بْنِ أَيُّوبَ قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ أَنَّهَا أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا نُودِيَ لِصَلَاةِ الصُّبْحِ سَجَدَ سَجْدَتَيْنِ قَبْلَ صَلَاةِ الصُّبْحِ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا بتاتی ہیں کہ جب صبح کی نماز کی اذان ہوتی تو رسول اللہ ﷺ صبح کی نماز سے پہلے دو رکعتیں پڑھا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;