var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ إِسْحَقَ عَنْ أَبِي عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ";
nasai.urdu = "ام المومنین حضرت حفصہ رضی اللہ عنہا بیان کرتی ہیں کہ جب مؤذن (اذان کہہ کر) خاموش ہوتا تو رسول اللہ ﷺ دو ہلکی رکعتیں پڑھتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;