var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ حَفْصَةَ أُمَّ الْمُؤْمِنِينَ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ مِنْ الْأَذَانِ لِصَلَاةِ الصُّبْحِ وَبَدَا الصُّبْحُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ تُقَامَ الصَّلَاةُ";
nasai.urdu = "مومنوں کی ماں حضرت حفصہ رضی اللہ عنہا نے بتلایا: جب مؤذن صبح کی اذان کہہ کر خاموش ہوتا اور صبح ظاہر ہوجاتی تو رسول اللہ ﷺ صبح کی نماز کی اقامت سے پہلے دو ہلکی رکعتیں پڑھتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;