var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَ حَدَّثَتْنِي أُخْتِي حَفْصَةُ أَنَّهُ كَانَ يُصَلِّي قَبْلَ الْفَجْرِ رَكْعَتَيْنِ خَفِيفَتَيْنِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما فرماتے ہیں کہ مجھ سے میری بہن حضرت حفصہ رضی اللہ عنہا نے بیان کیا کہ آپ ﷺ فجر کی نماز سے پہلے دو ہلکی رکعتیں پڑھا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;