var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا نُودِيَ لِصَلَاةِ الصُّبْحِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ يَقُومَ إِلَى الصَّلَاةِ وَرَوَى سَالِمٌ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا سے مروی ہے کہ جب صبح کی نماز کی اذان ہوتی تو رسول اللہ ﷺ فرض نماز کو جانے سے پہلے دو ہلکی رکعتیں پڑھتے تھے۔یہ روایت حضرت سالم نے بھی (حضرت نافع کے بجائے) ابن عمر عن حفصۃ کی سند سے بیان کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;