var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ قَالَ ابْنُ عُمَرَ أَخْبَرَتْنِي حَفْصَةُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْكَعُ رَكْعَتَيْنِ قَبْلَ الْفَجْرِ وَذَلِكَ بَعْدَ مَا يَطْلُعُ الْفَجْرُ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا نے خبر دی کہ رسول اللہ ﷺ فجر کی نماز سے پہلے دو رکعتیں پڑھا کرتے تھے۔اور یہ (فعل) فجر طلوع ہونے کے بعد ہوتا تھا۔(یعنی دو رکعتوں کی ادائیگی۔)";
nasai.hukam = "حسن";
nasai.description = ``;