var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ أَبِي طَلْحَةَ عَنْ أَبِي طَلْحَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِمَّا أَنْضَجَتْ النَّارُ";
nasai.urdu = "حضرت ابوطلحہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’ہر اس چیز (کے کھانے) سے وضو کرو جسے آگ نے پکایا ہو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;