var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ أَبِي عَمْرٍو عَنْ يَحْيَى قَالَ حَدَّثَنِي أَبُو سَلَمَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ بَيْنَ النِّدَاءِ وَالْإِقَامَةِ مِنْ صَلَاةِ الْفَجْرِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ فجر کی نماز کی اذان اور اقامت کے درمیان دو ہلکی رکعتیں پڑھا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;