var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَثَّامُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي رَكْعَتَيْ الْفَجْرِ إِذَا سَمِعَ الْأَذَانَ وَيُخَفِّفُهُمَا قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا حَدِيثٌ مُنْكَرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما فرماتے ہیں کہ نبی ﷺ جب صبح کی اذان سنتے تو فجر کی دو سنتیں پڑھتے اور انھیں ہلکا پڑھتے تھے۔امام ابو عبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ یہ حدیث منکر ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;