var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ أَنْبَأَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ أَنَّ شُرَيْحًا الْحَضْرَمِيَّ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَوَسَّدُ الْقُرْآنَ";
nasai.urdu = "حضرت سائب بن یزید سے روایت ہے کہ رسول اللہ ﷺ کے پاس حضرت شریح حضرمی رضی اللہ عنہ کا ذکر کیا گیا تو آپ نے فرمایا: ’’وہ قرآن کو سرہانہ نہیں بناتا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;