var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَذَكَرَ نَحْوَهُ قَالَ أَبُو عَبْد الرَّحْمَنِ أَبُو جَعْفَرٍ الرَّازِيُّ لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: پھر اسی طرح بیان کیا جیسے پہلے بیان ہوا ہے۔امام ابوعبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ اس حدیث کی سند میں ایک راوی ابوجعفر رازی ہے جو علم حدیث میں قوی اور معتبر نہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;