var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا الزُّبَيْدِيُّ قَالَ أَخْبَرَنِي الزُّهْرِيُّ أَنَّ عَبْدَ الْمَلِكِ بْنَ أَبِي بَكْرٍ أَخْبَرَهُ أَنَّ خَارِجَةَ بْنَ زَيْدِ بْنِ ثَابِتٍ أَخْبَرَهُ أَنَّ زَيْدَ بْنَ ثَابِتٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ";
nasai.urdu = "حضرت زید بن ثابت رضی اللہ عنہ سے منقول ہے کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا: ’’ہر اس چیز (کے کھانے) سے وضو کرو جسے آگ نے پکایا ہو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;