var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا لَمْ يُصَلِّ مِنْ اللَّيْلِ مَنَعَهُ مِنْ ذَلِكَ نَوْمٌ أَوْ وَجَعٌ صَلَّى مِنْ النَّهَارِ ثِنْتَيْ عَشْرَةَ رَكْعَةً";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ جب رات کو نفل نماز نہ پڑھ سکتے،یعنی نیند یا تکلیف کا غلبہ ہو جاتا تو دن کو بارہ رکعات پڑھتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;