var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ أَنَّ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ قَالَ جُزْئِهِ مِنْ اللَّيْلِ فَقَرَأَهُ فِيمَا بَيْنَ صَلَاةِ الصُّبْحِ إِلَى صَلَاةِ الظُّهْرِ فَكَأَنَّمَا قَرَأَهُ مِنْ اللَّيْلِ";
nasai.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ فرماتے ہیں،رسول اللہ ﷺ نے فرمایا: ’’جو شخص رات کو اپنی معمول کی مکمل یا کچھ نفل نماز سے سویا رہا،پھر اس نے اسے صبح کی نماز (کا وقت ختم ہونے اور مکروہ وقت گزرنے کے بعد) سے ظہر کی نماز تک پڑھ لیا تو یوں سمجھو،اس نے رات ہی کو پڑھی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;