var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ الْأَعْرَجِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ مَنْ فَاتَهُ حِزْبُهُ مِنْ اللَّيْلِ فَقَرَأَهُ حِينَ تَزُولُ الشَّمْسُ إِلَى صَلَاةِ الظُّهْرِ فَإِنَّهُ لَمْ يَفُتْهُ أَوْ كَأَنَّهُ أَدْرَكَهُ رَوَاهُ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ مَوْقُوفًا";
nasai.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ فرماتے ہیں کہ جس شخص سے رات کی مقررہ (نفل) نماز رہ گئی اور اس نے زوال شمس سے لے کر ظہر کی نماز تک پڑھ لی تو یوں سمجھو کہ وہ نماز اس سے نہیں رہی بلکہ گویا اس نے بروقت پڑھ لی۔حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ کے بیٹے حمید نے اسے موقوف بیان کیا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;