var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ مَنْ فَاتَهُ وِرْدُهُ مِنْ اللَّيْلِ فَلْيَقْرَأْهُ فِي صَلَاةٍ قَبْلَ الظُّهْرِ فَإِنَّهَا تَعْدِلُ صَلَاةَ اللَّيْلِ";
nasai.urdu = "حضرت حمید بن عبدالرحمٰن بیان کرتے ہیں کہ جس آدمی کا رات کا مقرر ورد (ذکر،قرپن یا نماز) رہ جائے تو وہ اسے ظہر کی نماز سے پہلے کسی (نفل) نماز میں پڑھ لے تو یہ نماز بھی رات کی نماز کے برابر ہی متصور ہوگی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;