var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ قَالَ حَدَّثَنَا مَعْقِلٌ عَنْ عَطَاءٍ قَالَ أُخْبِرْتُ أَنَّ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَكَعَ ثِنْتَيْ عَشْرَةَ رَكْعَةً فِي يَوْمِهِ وَلَيْلَتِهِ سِوَى الْمَكْتُوبَةِ بَنَى اللَّهُ لَهُ بِهَا بَيْتًا فِي الْجَنَّةِ";
nasai.urdu = "حضرت ام حبیبہ بنت ابوسفیان رضی اللہ عنہا فرماتی ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ہے: ’’جو شخص دن اور رات میں فرض نمازوں کے علاوہ بارہ رکعات (سنت) پڑھے گا،اللہ تعالیٰ اس کے لیے جنت میں گھر بنائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;