var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ قَالَ حَدَّثَنَا حِبَّانُ وَمُحَمَّدُ بْنُ مَكِّيٍّ قَالَا أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ أَبِي يُونُسَ الْقُشَيْرِيِّ عَنْ ابْنِ أَبِي رَبَاحٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ حَدَّثَهُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ قَالَتْ مَنْ صَلَّى ثِنْتَيْ عَشْرَةَ رَكْعَةً فِي يَوْمٍ فَصَلَّى قَبْلَ الظُّهْرِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ";
nasai.urdu = "حضرت ام حبیبہ بنت ابو سفیان رضی اللہ عنہا فرماتی ہیں کہ جو آدمی ایک دن میں بارہ رکعات پڑھے۔ظہر سے پہلے (چار،بعد میں دو،مغرب کے بعد دو،عشاء کے بعد دو اور فجر سے پہلے دو) تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا۔";
nasai.hukam = "صحیح";
nasai.description = ``;