var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ أَنْبَأَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَنْبَسَةَ أَخِي أُمِّ حَبِيبَةَ عَنْ أُمِّ حَبِيبَةَ قَالَتْ مَنْ صَلَّى فِي الْيَوْمِ وَاللَّيْلَةِ ثِنْتَيْ عَشْرَةَ رَكْعَةً سِوَى الْمَكْتُوبَةِ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا وَثِنْتَيْنِ قَبْلَ الْعَصْرِ وَثِنْتَيْنِ بَعْدَ الْمَغْرِبِ وَثِنْتَيْنِ قَبْلَ الْفَجْرِ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہا فرماتی ہیں کہ جو شخص دن اور رات میں فرض نماز کے علاوہ بارہ رکعات (سنن مؤکدہ) پڑھے گا،اس کے لیے جنت میں گھر بنا دیا جائے گا: ظہر سے پہلے چار،بعد میں دو،عصر سے پہلے دو،مغرب کے بعد دو اور صبح سے پہلے دو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1803)`;
nasai.anwaar = [335,1];