var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى فِي الْيَوْمِ وَاللَّيْلَةِ ثِنْتَيْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’جو شخص دن اور رات میں بارہ رکعات پڑھے گا،اس کے لیے جنت میں گھر بنایا جائے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;