var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَعْلَى قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ قَالَتْ مَنْ صَلَّى فِي اللَّيْلِ وَالنَّهَارِ ثِنْتَيْ عَشْرَةَ رَكْعَةً سِوَى الْمَكْتُوبَةِ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہا فرماتی ہیں کہ جو شخص رات اور دن میں فرضوں کے علاوہ بارہ رکعات پڑھے گا،اس کے لیے جنت میں گھر بنایا جائے گا۔";
nasai.hukam = "صحیح";
nasai.description = ``;