var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مَكِّيٍّ وَحِبَّانُ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ عَنْ إِسْمَعِيلَ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ أُمِّ حَبِيبَةَ قَالَتْ مَنْ صَلَّى فِي يَوْمٍ وَلَيْلَةٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً سِوَى الْمَكْتُوبَةِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ لَمْ يَرْفَعْهُ حُصَيْنٌ وَأَدْخَلَ بَيْنَ عَنْبَسَةَ وَبَيْنَ الْمُسَيَّبِ ذَكْوَانَ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہا فرماتی ہیں کہ جو شخص دن اور رات میں فرضوں کے علاوہ بارہ رکعات (سنن مؤکدہ) پڑھے گا،اللہ عزوجل اس کے لیے جنت کے اندر گھر بنائے گا۔حصین نے اس حدیث کو مرفوع بیان نہیں کیا،نیز اس نے عنبسہ اور مسیب کے درمیان ذکوان کا واسطہ بیان کیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;