var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا وَهْبٌ قَالَ حَدَّثَنَا خَالِدٌ عَنْ حُصَيْنٍ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ أَبِي صَالِحٍ ذَكْوَانَ قَالَ حَدَّثَنِي عَنْبَسَةُ بْنُ أَبِي سُفْيَانَ أَنَّ أُمَّ حَبِيبَةَ حَدَّثَتْهُ أَنَّهُ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہا بیان کرتی ہیں کہ جو شخص ایک دن میں بارہ رکعات پڑھے گا،اس کے لیے جنت میں گھر بنایا جائے گا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;