var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبٍ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ عَنْ أُمِّ حَبِيبَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً سِوَى الْفَرِيضَةِ بَنَى اللَّهُ لَهُ أَوْ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہا سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جو آدمی ایک دن میں فرض نمازوں کے علاوہ بارہرکعات پڑھے گا،اللہ تعالیٰ اس کے لیے جنت میں گھر بنائے گا۔‘‘ یا (فرمایا:) ’’اس کے لیے جنت میں گھر بنا دیا جائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;