var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْمُثَنَّى عَنْ سُوَيْدِ بْنِ عَمْرٍو قَالَ حَدَّثَنِي حَمَّادٌ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ عَنْ أُمِّ حَبِيبَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى ثِنْتَيْ عَشْرَةَ رَكْعَةً فِي يَوْمٍ وَلَيْلَةٍ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص ایک دن رات میں بارہ رکعات پڑھے گا،اللہ تعالیٰ اس کے لیے جنت میں گھر بنائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;