var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ نَاصِحٍ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ مَكْحُولٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ مَنْ صَلَّى أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعًا بَعْدَهَا حَرَّمَهُ اللَّهُ عَزَّ وَجَلَّ عَلَى النَّارِ";
nasai.urdu = "حضرت ام حبیبہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ فرمایا کرتے تھے: ’’جوشخص ظہر سے پہلے چار رکعات اور ظہر کے بعد چار رکعات (پابندی سے) پڑھے گا تو اللہ تعالیٰ اسے آگ پر حرام فرما دے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;