var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَمَنَّيَنَّ أَحَدٌ مِنْكُمْ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَزْدَادَ خَيْرًا وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يَسْتَعْتِبَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تم میں سے کوئی شخص موت کی تمنا نہ کرے (کیونکہ) اگر وہ نیک ہے تو ہوسکتا ہے وہ اور نیکیاں کرے اور اگروہ گناہ گار ہے تو شاید وہ اپنے اللہ کو راضی کرلے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;