var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ كَتِفًا فَجَاءَهُ بِلَالٌ فَخَرَجَ إِلَى الصَّلَاةِ وَلَمْ يَمَسَّ مَاءً";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا سے مرووی ہے کہ اللہ کے رسول ﷺ نے کندھے کا گوشت کھایا،پھر آپ کے پاس بلال آئے تو پ نماز کے لیے تشریف لے گئے اور پانی کو چھوا تک نہیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;