var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنِي الزُّبَيْدِيُّ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي عُبَيْدٍ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَمَنَّيَنَّ أَحَدُكُمْ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَعِيشَ يَزْدَادُ خَيْرًا وَهُوَ خَيْرٌ لَهُ وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يَسْتَعْتِبَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’تم میں سے کئوی شخص موت کی خواہش نہ کرے۔اگر وہ نیک ہے تو شاید مزید زندہ رہ کر اور نیکیاں کرے اور یہ اس کے لیے بہتر ہے۔اور اگر وہ برا ہے تو شاید وہ اپنے اللہ کو راضی کرلے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;