var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَمَنَّيَنَّ أَحَدُكُمْ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ فِي الدُّنْيَا وَلَكِنْ لِيَقُلْ اللَّهُمَّ أَحْيِنِي مَا كَانَتْ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتْ الْوَفَاةُ خَيْرًا لِي";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تم میں سے کوئی شخص دنیا میں پیش آنے والی کسی مصیبت اور تکلیف کی بنا پر موت کی تمنا اور دعا نہ کرے بلکہ یوں کہے: [اللھم! أحینی ……… خیرالی] ’’اے اللہ! جب تک میرے لیے زندگی بہتر ہے،مجھے زندہ رکھ اور جب میرے لیے موت بہتر ہو تو مجھے موت دے دے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;