var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنِي قَيْسٌ قَالَ دَخَلْتُ عَلَى خَبَّابٍ وَقَدْ اكْتَوَى فِي بَطْنِهِ سَبْعًا وَقَالَ لَوْلَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ دَعَوْتُ بِهِ";
nasai.urdu = "حضرت قیس بیان کرتے ہیں کہ میں حضرت خباب رضی اللہ عنہ کے پاس گیا (تو دیکھا کہ) انھوں نے اپنا پیٹ سات جگہ سے آگ سے داغا ہوا ہے۔انھوں نے فرمایا: اگر رسول اللہ ﷺ نے ہمیں موت کی دعا کرنے سے روکا نہ ہوتا تو میں ضرور موت کی دعا کرتا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;