var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ عُمَارَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ ح وَأَنْبَأَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اللَّهُ";
nasai.urdu = "حضرت ابوسعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اپنے قریب الموت اشخاص کو [لا إلا إلا اللہ] پڑھنے کی تلقین کرو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;