var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا مَنْصُورُ ابْنُ صَفِيَّةَ عَنْ أُمِّهِ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِّنُوا هَلْكَاكُمْ قَوْلَ لَا إِلَهَ إِلَّا اللَّهُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اپنے قریب مرگ اشخاص کو [لا إلہ إلا اللہ] کی تلقین کرو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;