var nasai = {};
nasai.arabic = "أَخْبَرَنَاالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ حَدَّثَنِي مَالِكٌ ح وَأَنْبَأَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْمُغِيرَةُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ تَعَالَى إِذَا أَحَبَّ عَبْدِي لِقَائِي أَحْبَبْتُ لِقَاءَهُ وَإِذَا كَرِهَ لِقَائِي كَرِهْتُ لِقَاءَهُ";
nasai.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے منقول ے،رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ فرماتا ہے: جب میرا بندہ میری ملاقات کو پسند کرتا ہے تو میں بھی اس سے ملاقات کو پسند کرتا ہوں اور جب وہ میری ملاقات کو ناپسند کرتا ہے تو میں بھی اس سے ملاقات کو ناپسند کرتا ہوں۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;