var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا يُحَدِّثُ عَنْ عُبَادَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ";
nasai.urdu = "حضرت عباد (بن صامت) رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ سے ملنے کی خواہش کرتا ہے،اللہ تعالیٰ اس سے ملنے کی خواہش کرتا ہے اور جو شخص اللہ تعالیٰ سے ملنے کو ناپسند کرتا ہے،اللہ تعالیٰ اس سے ملنے کو ناپسند کرتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;