var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو الْأَشْعَثِ قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ";
nasai.urdu = "حضرت عباد بن صامت رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ سے ملنا چاہتا ہے،اللہ تعالیٰ بھی اس سے ملنا چاہتا ہے اور جو شخص اللہ تعالیٰ سے ملنا نہیں چاہتا اللہ تعالیٰ بھی اس سے ملنا نہیں چاہتا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;