var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ يُوسُفَ عَنْ ابْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَ شَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ خُبْزًا وَلَحْمًا ثُمَّ قَامَ إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں کہ میں نے دیکھا کہ اللہ کے رسول ﷺ نے روٹی اور گوشت کھایا،پھر نماز کے لیے اٹھ کھڑے ہوئے اور وضو نہیں فرمایا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;