var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرٍو قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ أَبَا بَكْرٍ قَبَّلَ بَيْنَ عَيْنَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مَيِّتٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ حضرت ابوبکر رضی اللہ عنہ نے نبی ﷺ کی وفات کے بعد آپ کی آنکھوں کے درمیان (پیشانی کو) بوسہ دیا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن شھاب الزہري عنعن۔<br>والحدیث الآتي (1841) یغني عنہ۔`;
nasai.anwaar = [335,2];