var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ فَاطِمَةَ بَكَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ مَاتَ فَقَالَتْ يَا أَبَتَاهُ مِنْ رَبِّهِ مَا أَدْنَاهُ يَا أَبَتَاهُ إِلَى جِبْرِيلَ نَنْعَاهْ يَا أَبَتَاهُ جَنَّةُ الْفِرْدَوْسِ مَأْوَاهُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ جب رسول اللہ ﷺ فوت ہوئے تو (آپ کے لخت جگر) حضرت فاطمہ رضی اللہ عنہا رونے لگیں۔ساتھ ساتھ کہہ رہی تھیں: ہاے میرے ابا جان! جو اپنے رب سے کس قدر قریب تھے۔ہائے میرے ابا جان! جن کی وفات کی اطلاع ہم حضرت جبریل علیہ السلام کو بھی دیتے ہیں۔ہائے میرے ابا جان! جن کا ٹھکانا جنت الفردوس بن چکا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;