var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ كَانَ آخِرَ الْأَمْرَيْنِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرْكُ الْوُضُوءِ مِمَّا مَسَّتْ النَّارُ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ ان دو کاموں میں سے اللہ کے رسول ﷺ کا آخری کام یہ تھا کہ آپ آگ پر پکی ہوئی چیز (کھانے) سے وضو نہیں فرماتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;