var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ صُبَيْحٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ سِيرِينَ يَقُولُ ذُكِرَ عِنْدَ عِمْرَانَ بْنِ حُصَيْنٍ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ الْحَيِّ فَقَالَ عِمْرَانُ قَالَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت محمد بن سیرین رحمہ اللہ فرماتے ہیں: حضرت عمران بن حصین رضی اللہ عنہما کے پاس یہ بات ذکر کی گئی کہ میت کو زندہ لوگوں کے رونے سے عذاب ہوتا ہے تو عمران رضی اللہ عنہ کہنے لگے: یہ بات رسول اللہ ﷺ نے ارشاد فرمائی ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;