var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ قَالَ سَالِمٌ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ عُمَرُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَذَّبُ الْمَيِّتُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ";
nasai.urdu = "حضرت عمر رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’میت کو اس کے گھر والوں کے اس پر رونے کی وجہ سے عذاب دیا جاتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;