var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ حَكِيمِ بْنِ قَيْسٍ أَنَّ قَيْسَ بْنَ عَاصِمٍ قَالَ لَا تَنُوحُوا عَلَيَّ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُنَحْ عَلَيْهِ مُخْتَصَرٌ";
nasai.urdu = "حضرت قیس بن عاصم رضی اللہ عنہ نے (اپنی وفات سے پہلے) فرمایا: مجھ پر نوحہ نہ کرنا کیونکہ رسول اللہ ﷺ پر نوحہ نہیں کیا گیا۔یہ روایت مختصر ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;