var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ بْنِ عَبْدِ الْجَبَّارِ عَنْ سُفْيَانَ قَالَ قَصَّهُ لَنَا عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ يَقُولُ قَالَ ابْنُ عَبَّاسٍ قَالَتْ عَائِشَةُ إِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَزِيدُ الْكَافِرَ عَذَابًا بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے منقول ہے کہ حضرت عائشہ رضی اللہ عنہما نے فرمایا کہ رسول اللہ ﷺ نے تو یہ فرمایا تھا: ’’بیشک اللہ تعالیٰ کافر کے لیے اس کے گھر والوں کے اس پر بعض (مخصوص قسم کے) رونے کی وجہ سے عذاب میں اضافہ کر دیتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;