var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ،قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ زُبَيْدٍ،عَنْ إِبْرَاهِيمَ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ،وَشَقَّ الْجُيُوبَ،وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ»";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’وہ شخص ہم میں سے نہیں جو (مصیبت کے وقت) رخسار پیٹے،گریبان پھاڑے اور جاہلیت کی پکار پکارے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;