var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ،قَالَ: حَدَّثَنَا يَحْيَى بْنُ آدَمَ،قَالَ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ،عَنْ يَزِيدَ بْنِ أَوْسٍ،عَنْ أُمِّ عَبْدِ اللَّهِ امْرَأَةِ أَبِي مُوسَى،عَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنَّا مَنْ حَلَقَ،وَسَلَقَ،وَخَرَقَ»";
nasai.urdu = "حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’وہ شخص ہم میں سے نہیں جو (سوگ میں) بال مونڈے،چیخے چلائے یا کپڑے پھاڑے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;