var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا ثُمَّ دَعَا بِمَاءٍ فَتَمَضْمَضَ ثُمَّ قَالَ إِنَّ لَهُ دَسَمًا";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے دودھ پیا،پھر پانی منگوایا اور کلی کی،پھر آپ نے فرمایا: ’’تحقیق اس میں چکناہٹ ہوتی ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;