var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمٍ يُتَوَفَّى لَهُ ثَلَاثَةٌ مِنْ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس مسلمان کے تین نابالغ بچے فوت ہو جائیں (پھر وہ ان پر صبر کرے) تو اللہ تعالیٰ ان (بچوں) پر اپنی رحمت زیادہ ہونے کے باعث اس (مسلمان) کو جنت میں داخل فرمائے گا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;