var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمُوتُ لِأَحَدٍ مِنْ الْمُسْلِمِينَ ثَلَاثَةٌ مِنْ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلَّا تَحِلَّةَ الْقَسَمِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جس مسلمان شخص کے تین بچے فوت ہو جائیں (اور وہ ان پر صبر کرے) تو اسے آگ نہیں چھوئے گی مگر قسم پوری کرنے کے لیے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;