var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى زَيْدًا وَجَعْفَرًا قَبْلَ أَنْ يَجِيءَ خَبَرُهُمْ فَنَعَاهُمْ وَعَيْنَاهُ تَذْرِفَانِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے حضرت زید اور حضرت جعفر رضی اللہ عنہا کی وفات کی اطلاع ان کی خبر آنے سے پہلے ہی (بذریعۂ وحی) فرما دی تھی۔جب آپ نے اطلاع فرمائی تو آپ کی آنکھوں سے آنسو بہہ رہے تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;