var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ وَابْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى لَهُمَا النَّجَاشِيَّ صَاحِبَ الْحَبَشَةِ الْيَوْمَ الَّذِي مَاتَ فِيهِ وَقَالَ اسْتَغْفِرُوا لِأَخِيكُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ رسول اللہ ﷺ نے حبشہ کے بادشاہ نجاشی رحمہ اللہ کی وفات کی اطلاع (بذریعۂ وحی) اسی دن دے دی تھی جس دن وہ فوت ہوئے اور فرمایا: ’’اپنے بھائی کے لیے بخشش کی دعا کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;