var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَيُّوبُ سَمِعْتُ حَفْصَةَ تَقُولُ حَدَّثَتْنَا أُمُّ عَطِيَّةَ أَنَّهُنَّ جَعَلْنَ رَأْسَ ابْنَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ قُرُونٍ قُلْتُ نَقَضْنَهُ وَجَعَلْنَهُ ثَلَاثَةَ قُرُونٍ قَالَتْ نَعَمْ";
nasai.urdu = "حضرت حفصہ بنت سیرین بیان کرتی ہیں کہ ہمیں حضرت ام عطیہ رضی اللہ عنہا (آپ کے دور کی غاسلہ) نے بیان فرمایا: غسل دینے والی عورتوں نے نبی ﷺ کی بیٹی کے سر کی تین مینڈھیاں بنائی تھیں۔میں نے پوچھا کہ بالوں کو کھول کر پھر تین مینڈھیاں بنائی تھیں؟ انھوں نے کہا: ہاں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;