var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ خَالِدٍ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي غَسْلِ ابْنَتِهِ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا";
nasai.urdu = "حضرت ام عطیہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے اپنی بیٹی کے غسل کے موقع پر فرمایا: ’’اس کے داہنے اور وضو والے اعضاء سے غسل شروع کرنا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;