var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ أَبِي عَرُوبَةَ يُحَدِّثُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَسُوا مِنْ ثِيَابِكُمْ الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ";
nasai.urdu = "حضرت سمرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’سفید کپڑے پہنا کرو کیونکہ یہ زیادہ صاف ستھرے اور عمدہ ہوتے ہیں اور اپنے فوت شدگان کو بھی انھی میں کفن دیا کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;