var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ قَالَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْخُبُثِ وَالْخَبَائِثِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سےروایت ہے کہ اللہ کے رسول ﷺ جب بیت الخلا میں داخل ہوتے،تو فرماتے: [اللھم! انی اعوذبک من الخبیث و الخبائث] ’’اے اللہ! میں شرارتی جنوں اور جننیوں سے تیری پناہ میں آتا ہوں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;