var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ الْبَصْرِىُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ جَابِرًا يَقُولُ وَكَانَ الْعَبَّاسُ بِالْمَدِينَةِ فَطَلَبَتْ الْأَنْصَارُ ثَوْبًا يَكْسُونَهُ فَلَمْ يَجِدُوا قَمِيصًا يَصْلُحُ عَلَيْهِ إِلَّا قَمِيصَ عَبْدِ اللَّهِ بْنِ أُبَيٍّ فَكَسَوْهُ إِيَّاهُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ فرماتے ہیں کہ حضرت عباس رضی اللہ عنہ مدینہ میں (قید) تھے تو (ان کی قمیص پھٹی ہوئی تھی،لہٰذا) انصار نے ان کے لیے کوئی کپڑا تلاش کیا جو انھیں پہنا سکیں مگر عبداللہ بن ابی کی قمیص کے علاوہ کوئی قمیص ان پر صحیح نہ آتی تھی (کیونکہ وہ قد آور تھے اور وہ بھی قد آور تھا) آخر انھوں نے وہی ان کو پہنا دی۔";
nasai.hukam = "حسن";
nasai.description = ``;