var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا وُضِعَ الرَّجُلُ الصَّالِحُ عَلَى سَرِيرِهِ قَالَ قَدِّمُونِي قَدِّمُونِي وَإِذَا وُضِعَ الرَّجُلُ يَعْنِي السُّوءَ عَلَى سَرِيرِهِ قَالَ يَا وَيْلِي أَيْنَ تَذْهَبُونَ بِي";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’جب نیک شخص چارپائی پر رکھا جاتا ہے تو وہ کہتا ہے: مجھے جلدی لے چلو،مجھے جلدی لے چلو۔اور جب برا آدمی چار پائی پر رکھاجاتا ہے تو وہ کہتا ہے: افسوس! مجھے کہاں لے جا رہے ہو؟‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;