var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ الْحَسَنَ يُحَدِّثُ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الْأَرْبَعِ ثُمَّ اجْتَهَدَ فَقَدْ وَجَبَ الْغُسْلُ";
nasai.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جب آدمی عورت کی چار شاخوں (ہاتھ پاؤں) کے درمیان بیٹھ کر کوشش کرے تو غسل واجب ہوگیا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;