var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،اور وہ اس روایت کو نبی ﷺ تک پہنچاتے تھے،کہ آپ نے فرمایا: ’’جنازہ جلدی لے کر چلو۔اگر وہ نیک ہے تو تم اسے خیر کی طرف لے جا رہے ہو اور اگروہ نیک نہیں تو تم ایک شر کو اپنی گردنوں سے اتار رہے ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;