var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ كَانَتْ صَالِحَةً قَدَّمْتُمُوهَا إِلَى الْخَيْرِ وَإِنْ كَانَتْ غَيْرَ ذَلِكَ كَانَتْ شَرًّا تَضَعُونَهُ عَنْ رِقَابِكُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو یہ فرماتے سنا: ’’میت کو جلدی لے جاؤ کیونکہ اگر وہ نیک ہے تو تم اسے خیر کی طرف جلدی لے جا رہے ہو اور اگر وہ نیک نہیں تو تم ایک شرکو اپنی گردنوں سے اتار رہے ہو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;