var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ وَهُشَيْمٌ عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَ لَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّا لَنَكَادُ نَرْمُلُ بِهَا رَمَلًا وَاللَّفْظُ حَدِيثُ هُشَيْمٍ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ فرماتے ہیں کہ اللہ کی قسم! مجھے خوب یاد ہے کہ ہم رسول اللہ ﷺ کی موجودگی میں میت کو لے کر تیز تیز چلتے تھے۔حدیث کے مذکورہ الفاظ ہیثم کے ہیں (نہ کہ اسماعیل کے۔)";
nasai.hukam = "حسن";
nasai.description = ``;