var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ عَنْ يَحْيَى أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَّتْ بِكُمْ جَنَازَةٌ فَقُومُوا فَمَنْ تَبِعَهَا فَلَا يَقْعُدْ حَتَّى تُوضَعَ";
nasai.urdu = "حضرت ابو سعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب جنازہ تمھارے پاس سے گزرے تو کھڑے ہو جاؤ،پھر جو شخص جنازے کے ساتھ جائے،وہ جنازہ (زمین پر) رکھے جانے تک نہ بیٹھے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;