var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عَامِرِ بْنِ رَبِيعَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَأَى أَحَدُكُمْ الْجَنَازَةَ فَلَمْ يَكُنْ مَاشِيًا مَعَهَا فَلْيَقُمْ حَتَّى تُخَلِّفَهُ أَوْ تُوضَعَ مِنْ قَبْلِ أَنْ تُخَلِّفَهُ";
nasai.urdu = "حضرت عامر بن ربیعہ رضی اللہ عنہ سے مروی ہے،نبی ﷺ نے فرمایا: ’’جب تم میں سے کوئی جنازہ (آتا ہوا) دیکھے اور اس نے جنازے کے ساتھ نہ جانا ہو تو (کم از کم) کھڑا ہو جائے حتی کہ جنازہ اس سے آگے گزر جائے یا گزرنے سے پہلے زمین پر رکھ دیا جائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;