var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ عَامِرِ بْنِ رَبِيعَةَ الْعَدَوِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ";
nasai.urdu = "حضرت عامر بن ربیعہ عدوی رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم جنازہ (آتا) دیکھو تو کھڑے ہو جاؤ حتی کہ جنازہ تم سے آگے گزر جائے یا (زمین پر) رکھ دیا جائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;