var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ ح و أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوا فَمَنْ تَبِعَهَا فَلَا يَقْعُدْ حَتَّى تُوضَعَ";
nasai.urdu = "حضرت ابوسعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم جنازہ (آتا) دیکھو تو کھڑے ہو جاؤ جو شخص جنازے کے ساتھ جائے وہ نہ بیٹھے حتی کہ جنازہ (زمین پر) رکھ دیا جائے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;