var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ قَالَا مَا رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهِدَ جَنَازَةً قَطُّ فَجَلَسَ حَتَّى تُوضَعَ";
nasai.urdu = "حضرت ابوہریرہ اور ابو سعید رضی اللہ عنہما دونوں نے فرمایا: ہم نے تو کبھی نہیں دیکھا کہ رسول اللہ ﷺ کسی جنازے کے ساتھ تشریف فرما ہوں اور جنازہ زمین پر رکھے جانے سے پہلے بیٹھ گئے ہوں۔";
nasai.hukam = "صحیح";
nasai.description = ``;