var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ قَالَ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ عَنْ عَمِّهِ يَزِيدَ بْنِ ثَابِتٍ أَنَّهُمْ كَانُوا جُلُوسًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَلَعَتْ جَنَازَةٌ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَامَ مَنْ مَعَهُ فَلَمْ يَزَالُوا قِيَامًا حَتَّى نَفَذَتْ";
nasai.urdu = "حضرت یزید بن ثابت رضی اللہ عنہ سے منقول ہے کہ (ایک دفعہ) ہم رسول اللہ ﷺ کے ساتھ بیٹھے تھے کہ ایک جنازہ آتا نظر آیا۔رسول اللہ ﷺ اٹھ کھڑے ہوئے اور جو لوگ آپ کے پاس تھے وہ بھی اٹھ کھڑے ہوئے،پھر سب کھڑے رہے حتی کہ جنازہ آگے گزر گیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;