var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ أَنَّ جَنَازَةً مَرَّتْ بِالْحَسَنِ بْنِ عَلِيٍّ وَابْنِ عَبَّاسٍ فَقَامَ الْحَسَنُ وَلَمْ يَقُمْ ابْنُ عَبَّاسٍ فَقَالَ الْحَسَنُ أَلَيْسَ قَدْ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجَنَازَةِ يَهُودِيٍّ قَالَ ابْنُ عَبَّاسٍ نَعَمْ ثُمَّ جَلَسَ";
nasai.urdu = "حضرت محمد بن سیرین سے روایت ہے کہ حضرات حسن بن علی اور ابن عباس رضی اللہ عنھم کے پاس سے ایک جنازہ گزرا۔حضرت حسن رضی اللہ عنہ کھڑے ہوگئے لیکن حضرت ابن عباس رضی اللہ عنہما کھڑے نہ ہوئے۔حضرت حسن رضی اللہ عنہ کہنے لگے: کیا رسول اللہ ﷺ ایک یہودی کے جنازے کی وجہ سے کھڑے نہیں ہوئے تھے؟ حضرت ابن عباس رضی اللہ عنہما نے کہا: ٹھیک ہے مگر پھر بیٹھے بھی رہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;