var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجَنَازَةِ يَهُودِيٍّ مَرَّتْ بِهِ حَتَّى تَوَارَتْ و أَخْبَرَنِي أَبُو الزُّبَيْرِ أَيْضًا أَنَّهُ سَمِعَ جَابِرًا رَضِيَ اللَّهُ عَنْهُ يَقُولُ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لِجَنَازَةِ يَهُودِيٍّ حَتَّى تَوَارَتْ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ نبی ﷺ اور آپ کے صحابہ رضی اللہ عنھم ایک یہودی کے جنازے کو دیکھ کر کھڑے ہوئے جو پاس سے گزرا تھا حتی کہ وہ نظروں سے اوجھل ہوگیا (پھر بیٹھے)۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;