var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لِقُتَيْبَةَ قَالَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ الرُّكَيْنِ بْنِ الرَّبِيعِ عَنْ حُصَيْنِ بْنِ قَبِيصَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ كُنْتُ رَجُلًا مَذَّاءً فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتَ الْمَذْيَ فَاغْسِلْ ذَكَرَكَ وَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ وَإِذَا فَضَخْتَ الْمَاءَ فَاغْتَسِلْ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے منقول ہے کہ مجھے مذی بہت زیادہ آتی تھی تو مجھ سے رسول اللہ ﷺ نے فرمایا: ’’جب تم مذی دیکھو تو اپنے عضو (وغیرہ) کو دھو لو اور نماز والا وضو کرو لیکن جب تم زور سے منی نکالو تو غسل کرو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;