var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ جَنَازَةً مَرَّتْ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ فَقِيلَ إِنَّهَا جَنَازَةُ يَهُودِيٍّ فَقَالَ إِنَّمَا قُمْنَا لِلْمَلَائِكَةِ";
nasai.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ ایک جنازہ رسول اللہ ﷺ کے پاس سے گزرا تو آپ کھڑے ہوگئے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن۔<br>وللحدیث شاھد ضعیف عند أحمد (4/ 413)۔`;
nasai.anwaar = [336,1];