var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ ذُكِرَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَالِكٌ بِسُوءٍ فَقَالَ لَا تَذْكُرُوا هَلْكَاكُمْ إِلَّا بِخَيْرٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہما فرماتی ہیں کہ نبی ﷺ کے پاس کسی فوت شدہ شخص کی برائی بیان کی گئی تو آپ نے فرمایا: ’’اپنے فوت شدگان کا ذکر خیر ہی کیا کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;