var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ بِشْرٍ وَهُوَ ابْنُ الْمُفَضَّلِ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَسُبُّوا الْأَمْوَاتَ فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہما سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’مردوں کو برا نہ کہو کیونکہ وہ اپنے اعمال (کی جزا و سزا) کی طرف پہنچ چکے ہیں۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;