var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتْبَعُ الْمَيِّتَ ثَلَاثَةٌ أَهْلُهُ وَمَالُهُ وَعَمَلُهُ فَيَرْجِعُ اثْنَانِ أَهْلُهُ وَمَالُهُ وَيَبْقَى وَاحِدٌ عَمَلُهُ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’میت کے ساتھ تین چیزیں قبر کی طرف جاتی ہیں: اس کے رشتے دار،اس کا مال اور اس کا عمل۔دو چیزیں،یعنی رشتے دار اور مال تو واپس آ جاتے ہیں اور ایک چیز،یعنی اس کا عمل اس کے پاس رہ جاتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;