var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ بُرْدٍ أَخِي يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَبِعَ جَنَازَةً حَتَّى يُصَلَّى عَلَيْهَا كَانَ لَهُ مِنْ الْأَجْرِ قِيرَاطٌ وَمَنْ مَشَى مَعَ الْجَنَازَةِ حَتَّى تُدْفَنَ كَانَ لَهُ مِنْ الْأَجْرِ قِيرَاطَانِ وَالْقِيرَاطُ مِثْلُ أُحُدٍ";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہا سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص جنازے کے ساتھ جائے حتی کہ اس کا جنازہ پڑھا جائے تو اسے ایک قیراط ثواب ملے گا،اور جو شخص جنازے کے ساتھ جائے حتی کہ اسے دفن کیا جائے تو اسے دو قیراط ثواب ملے گا،اور قیراط احد پہاڑ کے برابر ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;