var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغَفَّلِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَبِعَ جِنَازَةً حَتَّى يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطَانِ فَإِنْ رَجَعَ قَبْلَ أَنْ يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطٌ";
nasai.urdu = "حضرت عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو آدمی جنازے کے ساتھ جائے اور (دفن سے) فراغت تک ساتھ رہے تو اسے دو قیراط ثواب ملے گا۔اور جو شخص فراغت سے پہلے واسآ جائے تو اسے ایک قیراط ملے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;