var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ وَأَخُوهُ الْمُغِيرَةُ جَمِيعًا عَنْ زِيَادِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ";
nasai.urdu = "حضرت مغیرہ بن شعبہ رضی اللہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’سوار شخص جنازے کے پیچھے چلے اور پیدل چلنے والا جہاں چاہے چلے (آگے یا پیچھے یا برابر) اور بچے کا بھی جنازہ پڑھا جائے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;