var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ بَكَّارٍ الْحَرَّانِيُّ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ عَنْ سَعِيدٍ الثَّقَفِيِّ عَنْ عَمِّهِ زِيَادِ بْنِ جُبَيْرِ بْنِ حَيَّةَ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ";
nasai.urdu = "حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے فرمایا: ’’سوار جنازے کے پیچھے چلے اور پیدل جہاں چاہے چلے اور نومولود بچے کا جنازہ پڑھا جائے گا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;