var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ حُجْرٍ وَقُتَيْبَةُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَمْشُونَ أَمَامَ الْجَنَازَةِ";
nasai.urdu = "حضرت سالم کے والد محترم حضرت ابن عمر رضی اللہ عنہما سے منقول ہے کہ انھوں نے رسول اللہ ﷺ اور ابوبکر و عمر رضی اللہ عنہما کو جنازے کے آگے چلتے دیکھا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;