var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ وَعَمْرُو بْنُ زُرَارَةَ النَّيْسَابُورِيُّ قَالَا حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخَاكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ (جب نجاشی رحمہ اللہ فوت ہوئے تو) رسول اللہ ﷺ نے فرمایا: ’’تمھارا (اسلامی) بھائی (حبشہ میں) فوت ہوگیا ہے،لہٰذا اٹھو اور اس کی نماز جنازہ پڑھو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;