var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدَةُ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ أُمَّ سُلَيْمٍ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ قَالَ إِذَا أَنْزَلَتْ الْمَاءَ فَلْتَغْتَسِلْ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ ام سلیم رضی اللہ عنہا نے رسول اللہ ﷺ سے عورت کے بارے میں پوچھا جو خواب میں وہی کچھ دیکھتی ہے جو مرد دیکھتا ہے تو آپ نے فرمایا: ’’جب وہ پانی نکالے تو غسل کرے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;