var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ زِيَادَ بْنَ جُبَيْرٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّهُ ذَكَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ";
nasai.urdu = "حضرت مغیرہ بن شعبہ نے ذککر کیا کہ رسول اللہ ﷺ نے فرمایا: ’’سوار جنازے کے پیچھے چلے،پیدل جہاں چاہے چلے اور نومولود کا جنازہ پڑھا جائے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;