var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ سے مشرکین کی اولاد کے بارے میں پوچھا گیا (کہ وہ کہاں جائے گی؟) تو آپ نے فرمایا: ’’اللہ ہی خوب جانتا ہے کہ انھوں نے کیا کام کرنے تھے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;