var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسٍ هُوَ ابْنُ سَعْدٍ عَنْ طَاوُسٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ سے مشرکین کی اولاد کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’اللہ تعالیٰ خوب جانتا ہے کہ وہ کیا کرنے والے تھے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;