var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ خَلَقَهُمْ اللَّهُ حِينَ خَلَقَهُمْ وَهُوَ يَعْلَمُ بِمَا كَانُوا عَامِلِينَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ سے مشرکین کی اولاد کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’جب اللہ تعالیٰ نے انھیں پیدا فرمایا تو اللہ تعالیٰ خوب جانتا تھا کہ وہ کیا کرنے والے تھے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;