var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُجَاهِدُ بْنُ مُوسَى عَنْ هُشَيْمٍ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَرَارِيِّ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی ﷺ سے مشرکین کی اولاد کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’اللہ تعالیٰ ہی خوب جانتا ہے کہ (اگر وہ بلوغت کو پاتے) وہ کیا کرنے والے تھے؟‘‘";
nasai.hukam = "حسن";
nasai.description = ``;