var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلَاتَهُ عَلَى الْمَيِّتِ ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ إِنِّي فَرَطٌ لَكُمْ وَأَنَا شَهِيدٌ عَلَيْكُمْ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ ایک دن (اپنی زندگی کے آخری دنوں میں) احد کی طرف گئے اور احد کے شہداء کے لیے اس طرح (آہ و زاری سے) دعائیں کیں جس طرح میت کے لیے کرتے تھے،پھر واپس آکر منبر پر چڑھے اور فرمایا: ’’میں تمھارا پیش رو ہوں۔(تمھارا میر سامان ہوں) اور میں تمھارے حق میں (ایمان و نصرت کی) گواہی دوں گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;