var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ زُهَيْرٌ قَالَ حَدَّثَنَا سِمَاكٌ عَنْ ابْنِ سَمُرَةَ أَنَّ رَجُلًا قَتَلَ نَفْسَهُ بِمَشَاقِصَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنَا فَلَا أُصَلِّي عَلَيْهِ";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے تیروں سے خودکشی کرلی۔رسول اللہ ﷺ نے فرمایا: ’’میں اس کا جنازہ نہیں پڑھوں گا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;