var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ أَنَّ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَخْبَرَهُ أَنَّ عَائِشَةَ قَالَتْ مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلَّا فِي جَوْفِ الْمَسْجِدِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ نے حضرت سہل بن بیضاء رضی اللہ عنہ کا جنازہ مسجد ہی میں پڑھایا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;