var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَخَاكُمْ النَّجَاشِيَّ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ فَقَامَ فَصَفَّ بِنَا كَمَا يُصَفُّ عَلَى الْجَنَازَةِ وَصَلَّى عَلَيْهِ";
nasai.urdu = "حضرت جابر رضی اللہ ہنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’تمھارا (اسلامی) بھائی نجاشی فوت ہو گیا ہے۔اٹھو،اس کا جنازہ پڑھو۔‘‘ آپ کھڑے ہوئے اور ہماری صف بندی فرمائی جیسے جنازے میں صف بندی کی جاتی ہے،پھر اس کا جنازہ پڑھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;