var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ،قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ،عَنْ مَالِكٍ،عَنْ ابْنِ شِهَابٍ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَعَى لِلنَّاسِ النَّجَاشِيَّ الْيَوْمَ الَّذِي مَاتَ فِيهِ،ثُمَّ خَرَجَ بِهِمْ إِلَى الْمُصَلَّى،فَصَفَّ بِهِمْ فَصَلَّى عَلَيْهِ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے لوگوں کو حضرت نجاشی رحمہ اللہ کی وفات کی اطلاع ان کی وفات ہی کے دن فرمائی تھی،پھر پ لوگوں کو ساتھ لے کر جنازہ گاہ میں گئے۔ان کی صف بندی کی اور ان کا جنازہ پڑھایا۔اور چار تکبیریں کہیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;