var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ،قَالَ: أَنْبَأَنَا إِسْمَعِيلُ،عَنْ أَيُّوبَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَخَاكُمْ قَدْ مَاتَ،فَقُومُوا فَصَلُّوا عَلَيْهِ»،فَصَفَفْنَا عَلَيْهِ صَفَّيْنِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تمھارا بھائی فوت ہوگیا ہے۔اٹھو! اس کا جنازہ پڑھو۔‘‘ تو ہم نے اس کے جنازے میں دو صفیں بنائیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;