var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا أَبُو دَاوُدَ،سَمِعْتُ شُعْبَةَ،يَقُولُ: ـ السَّاعَةَ يَخْرُجُ السَّاعَةَ يَخْرُجُ ـ حَدَّثَنَا أَبُو الزُّبَيْرِ،عَنْ جَابِرٍ قَالَ: «كُنْتُ فِي الصَّفِّ الثَّانِي يَوْمَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى النَّجَاشِيِّ»";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ جس دن رسول اللہ ﷺ نے حضرت نجاشی رحمہ اللہ کا جنازہ پڑھایا،میں دوسری صف میں تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;