var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ،قَالَ: حَدَّثَنَا يُونُسُ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي الْمُهَلَّبِ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَخَاكُمُ النَّجَاشِيَّ قَدْ مَاتَ،فَقُومُوا فَصَلُّوا عَلَيْهِ»،قَالَ: فَقُمْنَا فَصَفَفْنَا عَلَيْهِ كَمَا يُصَفُّ عَلَى الْمَيِّتِ،وَصَلَّيْنَا عَلَيْهِ كَمَا يُصَلَّى عَلَى الْمَيِّتِ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہما سے روایت ہے،ہم سے رسول اللہ ﷺ نے فرمایا: ’’تمھارا (اسلامی) بھائی نجاشی فوت ہوگیا ہے،اٹھو اس کا جنازہ پڑھو۔‘‘ ہم کھڑے ہوئے اور صف بندی کی جیسے میت پر کی جاتی ہے۔اور اس کا جنازہ پڑھا جیسے میت کا جنازہ پڑھا جاتا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;