var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،عَنْ عَبْدِ الْوَارِثِ،قَالَ: حَدَّثَنَا حُسَيْنٌ،عَنْ ابْنِ بُرَيْدَةَ،عَنْ سَمُرَةَ،قَالَ: «صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى أُمِّ كَعْبٍ مَاتَتْ فِي نِفَاسِهَا،فَقَامَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ فِي وَسَطِهَا»";
nasai.urdu = "حضرت سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کے ساتھ حضرت ام کعب رضی اللہ عنہا کا جنازہ پڑھا جو بچے کی پیدائش کے وقت فوت ہوگئی تھیں،تو رسول اللہ ﷺ ان کی کمر کے برابر کھڑے ہوئے۔";
nasai.hukam = "حسن";
nasai.description = ``;