var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ شُعْبَةَ قَالَ سَمِعْتُ عَطَاءً الْخُرَاسَانِيَّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَرْأَةِ تَحْتَلِمُ فِي مَنَامِهَا فَقَالَ إِذَا رَأَتْ الْمَاءَ فَلْتَغْتَسِلْ";
nasai.urdu = "حضرت خولہ بنت حکیم رضی اللہ عنہا بیان کرتی ہیں کہ میں نے رسول اللہ ﷺ سے اس عورت کے بارے میں پوچھا جسے نیند میں احتلام ہو جاتا ہے۔آپ نے فرمایا: ’’جب وہ پانی (منی) دیکھے تو غسل کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;