var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ،قَالَ: أَنْبَأَنَا ابْنُ الْمُبَارَكِ،وَالْفَضْلُ بْنُ مُوسَى،ح وأَخْبَرَنَا سُوَيْدٌ،قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ،عَنْ حُسَيْنٍ الْمُكْتِبِ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى أُمِّ فُلَانٍ مَاتَتْ فِي نِفَاسِهَا،فَقَامَ فِي وَسَطِهَا»";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ام فلاں (ام کعب رضی اللہ عنہا) کا جنازہ پڑھا جو بچے کی پیدائش کے وقت فوت ہوگئی تھیں تو آپ ان کے درمیان میں (یعنی کمر کے برابر) کھڑے ہوئے۔";
nasai.hukam = "حسن";
nasai.description = ``;