var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،عَنْ مَالِكٍ،عَنْ ابْنِ شِهَابٍ،عَنْ سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَعَى لِلنَّاسِ النَّجَاشِيَّ،وَخَرَجَ بِهِمْ فَصَفَّ بِهِمْ،وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے لوگوں کو حضرت نجاشی رحمہ اللہ کی وفات کی اطلاع دی۔انھیں لے کر (باہر) نکلے۔ان کی صف بندی کی اور جنازے میں چار تکبیریں کہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;