var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا يَحْيَى،قَالَ: حَدَّثَنَا شُعْبَةُ،قَالَ: حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ،عَنْ ابْنِ أَبِي لَيْلَى،أَنَّ زَيْدَ بْنَ أَرْقَمَ صَلَّى عَلَى جَنَازَةٍ فَكَبَّرَ عَلَيْهَا خَمْسًا،وَقَالَ: «كَبَّرَهَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
nasai.urdu = "حضرت ابن ابی لیلیٰ سے منقول ہے کہ حضرت زید بن ارقم رضی اللہ عنہ نے ایک میت کا جنازہ پڑھا تو اس پر پانچ تکبیریں کہیں،پھر فرمایا: رسول اللہ ﷺ نے (بعض اوقات) پانچ تکبیریں بھی کہی ہیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;