var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ،قَالَ: حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي إِبْرَاهِيمَ الْأَنْصَارِيِّ،عَنْ أَبِيه،أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي الصَّلَاةِ عَلَى الْمَيِّتِ: «اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا،وَشَاهِدِنَا وَغَائِبِنَا،وَذَكَرِنَا وَأُنْثَانَا،وَصَغِيرِنَا وَكَبِيرِنَا»";
nasai.urdu = "حضرت ابو ابراہیم انصاری اپنے والد محترم سے بیان کرتے ہیں انھوں نے نبی ﷺ کو ایک میت کے جنازے میں یوں دعا کرتے سنا: [اللھم! اغفر لحینا …… وکبیرنا] ’’اے اللہ! معاف فرما دے ہمارے فوت شدہ اور زندہ کو اور حاضر و غائب کو اور مذکر و مؤنث کو اور چھوٹے اور بڑے کو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;