var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْهَيْثَمُ بْنُ أَيُّوبَ،قَالَ: حَدَّثَنَا إِبْرَاهِيمُ وَهُوَ ابْنُ سَعْدٍ،قَالَ: حَدَّثَنَا أَبِي،عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ،قَالَ: صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ،فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ،وَسُورَةٍ وَجَهَرَ حَتَّى أَسْمَعَنَا،فَلَمَّا فَرَغَ أَخَذْتُ بِيَدِهِ،فَسَأَلْتُهُ فَقَالَ: «سُنَّةٌ وَحَقٌّ»";
nasai.urdu = "حضرت طلحہ بن عبداللہ بن عوف بیان کرتے ہیں کہ میں نے حضرت ابن عباس رضی اللہ عنہما کے پیچھے ایک میت کا جنازہ پڑھا۔انھوں نے سورۂ فاتحہ اور ایک اور سورت پڑھی اور (دونوں) بلند آواز سے پڑھیں حتی کہ ہمیں سنائی دیں۔جب وہ فارغ ہوئے تو میں نے ان کا ہاتھ پکڑا اور ان سے اس بارے میں پوچھا تو انھوں نے فرمایا: یہ سنت اور حق ہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;