var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ،قَالَ: حَدَّثَنَا مُحَمَّدٌ،قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ،قَالَ: صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَسَمِعْتُهُ يَقْرَأُ بِفَاتِحَةِ الْكِتَابِ،فَلَمَّا انْصَرَفَ أَخَذْتُ بِيَدِهِ،فَسَأَلْتُهُ فَقُلْتُ: تَقْرَأُ،قَالَ: «نَعَمْ،إِنَّهُ حَقٌّ وَسُنَّةٌ»";
nasai.urdu = "حضرت طلحہ بن عبداللہ سے روایت ہے کہ میں نے حضرت ابن عباس رضی اللہ عنہما کے پیچھے ایک جنازہ پڑھا۔میں نے انھیں سورۂ فاتحہ پڑھتے سنا۔جب وہ جنازے سے فارغ ہوئے تو میں نے ان کا ہاتھ پکڑ لیا اور ان سے پوچھا کہ کیا آپ (جنازے میں) قراءت کرتے ہیں؟ انھوں نے فرمایا: ہاں،یہ حق ہے اور نبی (ﷺ) کی سنت ہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;