var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ ابْنِ شِهَابٍ،عَنْ أَبِي أُمَامَةَ أَنَّهُ قَالَ: «السُّنَّةُ فِي الصَّلَاةِ عَلَى الْجَنَازَةِ أَنْ يَقْرَأَ فِي التَّكْبِيرَةِ الْأُولَى بِأُمِّ الْقُرْآنِ مُخَافَتَةً،ثُمَّ يُكَبِّرَ ثَلَاثًا،وَالتَّسْلِيمُ عِنْدَ الْآخِرَةِ»";
nasai.urdu = "حضرت ابو امامہ رضی اللہ عنہ سے روایت ہے کہ نماز جنازہ میں سنت یہ ہے کہ پہلی تکبیر کے بعد سورۂ فاتحہ آہستہ پڑھے،پھر تین تکبیریں کہے اور آخری تکبیر کے بعد سلام پھیر دے۔";
nasai.hukam = "صحیح";
nasai.description = ``;