var nasai = {};
nasai.arabic = "-أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ،قَالَ: أَنْبَأَنَا إِسْمَعِيلُ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ،رَضِيعٍ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَمُوتُ أَحَدٌ مِنَ الْمُسْلِمِينَ فَيُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ النَّاسِ فَيَبْلُغُوا أَنْ يَكُونُوا مِائَةً،فَيَشْفَعُوا إِلَّا شُفِّعُوا فِيهِ»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی ﷺ نے فرمایا: ’’جو مسلمان فوت ہو جائے،پھر اس پر مسلمانوں کی ایک جماعت جنازہ پڑھے جو ایک سو تک پہنچتے ہوں اور وہ اس کے لیے سفارش کریں تو لازماً ان کی سفارش اس کے حق میں قبول کی جاتی ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;