var nasai = {};
nasai.arabic = "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ،قَالَ: أَنْبَأَنَا عَبْدُ الرَّزَّاقِ،قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ،وَمَنِ انْتَظَرَهَا حَتَّى تُوضَعَ فِي اللَّحْدِ فَلَهُ قِيرَاطَانِ،وَالْقِيرَاطَانِ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص کسی میت کا جنازہ پڑھے،اس کے لیے ایک قیراط ثواب ہے اور جو شخص (جنازے کے بعد) انتظار کرتا رہے حتی کہ اسے لحد میں رکھ دیا جائے تو اس کے لیے دو قیراط (ثواب) ہے اور دو قیراط دو عظیم پہاڑوں کی طرح ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;