var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ،قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،عَنْ عَوْفٍ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ تَبِعَ جَنَازَةَ رَجُلٍ مُسْلِمٍ احْتِسَابًا فَصَلَّى عَلَيْهَا وَدَفَنَهَا فَلَهُ قِيرَاطَانِ،وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ قَبْلَ أَنْ تُدْفَنَ فَإِنَّهُ يَرْجِعُ بِقِيرَاطٍ مِنَ الْأَجْرِ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص ثواب کی نیت سے کسی مسلمان کے جنازے کے ساتھ جائے،اس کا جنازہ پڑھے اور اسے دفن کرے تو اس کے لیے دو قیراط ہیں۔اور جو شخص جنازہ پڑھ کر دفن سے پہلے واپس آ جائے تو وہ ایک قیراط (ثواب) کے ساتھ پلٹتا ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;