var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاءُ الرَّجُلِ غَلِيظٌ أَبْيَضُ وَمَاءُ الْمَرْأَةِ رَقِيقٌ أَصْفَرُ فَأَيُّهُمَا سَبَقَ كَانَ الشَّبَهُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مرد کی منی گاڑھی سفید اور عوررت کی منی پتلی اور زرد ہوتی ہے۔ان دونوں میں سے جو غالب آ جائے،اسی سے (بچے کی) مشابہت ہوتی ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;