var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ،قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ،عَنْ هِشَامٍ،وَالْأَوْزَاعِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَيْتُمُ الْجَنَازَةَ،فَقُومُوا وَمَنْ تَبِعَهَا فَلَا يَقْعُدَنَّ حَتَّى تُوضَعَ»";
nasai.urdu = "حضرت ابوسعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم جنازہ دیکھو تو کھڑے ہو جاؤ۔اور جو شخص جنازے کے ساتھ جائے،وہ نہ بیٹھے حتی کہ جنازہ (زمین پر) رکھ دیا جائے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;