var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ يَحْيَى،عَنْ وَاقِدٍ،عَنْ نَافِعِ بْنِ جُبَيْرٍ،عَنْ مَسْعُودِ بْنِ الْحَكَمِ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،أَنَّهُ ذُكِرَ الْقِيَامُ عَلَى الْجَنَازَةِ حَتَّى تُوضَعَ،فَقَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ: «قَامَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَعَدَ»";
nasai.urdu = "حضرت علی رضی اللہ عنہ کے سامنے جنازہ (زمین پر) رکھے جانے تک کھڑے رہنے کا ذکر کیا گیا تو حضرت علی بن ابی طالب رضی اللہ عنہ نے فرمایا: رسول اللہ ﷺ (پہلے) کھڑے رہتے تھے،مگر بعد میں بیٹھے رہتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;