var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا خَالِدٌ،قَالَ: حَدَّثَنَا شُعْبَةُ،قَالَ: أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ،عَنْ مَسْعُودِ بْنِ الْحَكَمِ،عَنْ عَلِيٍّ قَالَ: «رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَامَ فَقُمْنَا وَرَأَيْنَاهُ قَعَدَ فَقَعَدْنَا»";
nasai.urdu = "حضرت علی رضی اللہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو کھڑے ہوتے دیکھا تو ہم بھی کھڑے رہے،پھر ہم نے آپ کو بیٹھے دیکھا تو ہم بھی بیٹھے رہے۔";
nasai.hukam = "حسن";
nasai.description = ``;