var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ،قَالَ: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ عَمْرِو بْنِ قَيْسٍ،عَنْ الْمِنْهَالِ بْنِ عَمْرٍو،عَنْ زَاذَانَ،عَنْ الْبَرَاءِ قَالَ: «خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةٍ،فَلَمَّا انْتَهَيْنَا إِلَى الْقَبْرِ وَلَمْ يُلْحَدْ،فَجَلَسَ وَجَلَسْنَا حَوْلَهُ كَأَنَّ عَلَى رُءُوسِنَا الطَّيْرَ»";
nasai.urdu = "حضرت براء رضی اللہ عنہ فرماتے ہیں کہ ہم رسول اللہ ﷺ کے ساتھ ایک جنازے میں گئے۔جب ہم قبر کے پاس پہنچے تو (دیکھا کہ) قبر تیار نہیں ہوئی تھی۔آپ بیٹھ گئے اور ہم آپ کے ارد گرد بیٹھ گئے (بغیر کسی حرکت و آواز کے) گویا کہ ہمارے سروں پر پرندے بیٹھے ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;