var nasai = {};
nasai.arabic = "-أَخْبَرَنَا هَنَّادٌ،عَنْ ابْنِ الْمُبَارَكِ،عَنْ مَعْمَرٍ،عَنْ الزُّهْرِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِقَتْلَى أُحُدٍ: «زَمِّلُوهُمْ بِدِمَائِهِمْ،فَإِنَّهُ لَيْسَ كَلْمٌ يُكْلَمُ فِي اللَّهِ إِلَّا يَأْتِي يَوْمَ الْقِيَامَةِ يَدْمَى،لَوْنُهُ لَوْنُ الدَّمِ،وَرِيحُهُ رِيحُ الْمِسْكِ»";
nasai.urdu = "حضرت عبداللہ بن ثعلبہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے جنگ احد کے شہداء کے بارے میں فرمایا تھا: ’’انھیں ان کے خون آلود جسموں اور کپڑوں سمیت کفن دو کیونکہ جو زخم بھی اللہ تعالیٰ کے راستے میں لگا ہو،قیامت کے دن اس کی یہ حالت ہوگی کہ رنگ تو خون جیسا ہی ہوگا مگر خوشبو کستوری جیسی ہوگی۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;