var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: أَنْبَأَنَا وَكِيعٌ،قَالَ: حَدَّثَنَا سَعِيدُ بْنُ السَّائِبِ،عَنْ رَجُلٍ،يُقَالُ لَهُ: عُبَيْدُ اللَّهِ بْنُ مُعَيَّةَ،قَالَ: أُصِيبَ رَجُلَانِ مِنَ الْمُسْلِمِينَ يَوْمَ الطَّائِفِ فَحُمِلَا إِلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«فَأَمَرَ أَنْ يُدْفَنَا حَيْثُ أُصِيبَا»،وَكَانَ ابْنُ مُعَيَّةَ وُلِدَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عبید اللہ بن معیہ سے روایت ہے انھوں نے فرمایا: طائف کے دوران میں دو مسلمان شہید ہوئے تو ان کو اٹھا کر رسول اللہ ﷺ کے پاس لایا گیا۔آپ نے حکم دیا کہ انھیں وہیں دفن کیا جائے جہاں یہ شہید ہوئے۔(راویٔ حدیث) حضرت ابن معیہ رسول اللہ ﷺ کے زمانے میں پیدا ہوئے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;