var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ،قَالَ: حَدَّثَنَا سُفْيَانُ،قَالَ: حَدَّثَنَا الْأَسْوَدُ بْنُ قَيْسٍ،عَنْ نُبَيْحٍ الْعَنَزِيِّ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلَى أُحُدٍ أَنْ يُرَدُّوا إِلَى مَصَارِعِهِمْ»،وَكَانُوا قَدْ نُقِلُوا إِلَى الْمَدِينَةِ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے حکم دیا تھا کہ شدائے احد کو ان کی شہادت کے میدان میں واپس لایا جائے کیونکہ ان (میں سے بعض) کو مدینہ منورہ لے جایا گیا تھا";
nasai.hukam = "صحیح";
nasai.description = ``;