var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ،قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ،عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ،عَنْ أَبِيهِ،عَنْ سَعْدٍ قَالَ: «أَلْحِدُوا لِي لَحْدًا،وَانْصِبُوا عَلَيَّ نَصْبًا كَمَا فُعِلَ بِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
nasai.urdu = "حضرت سعد رضی اللہ نہ (وصیت کے طور پر) فرمایا: میرے لیے لحد بنانا اور پھر اینٹیں لگا دینا جیسا کہ اللہ کے رسول ﷺ کے لیے کیا گیا تھا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;