var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،قَالَ: حَدَّثَنَا أَبُو عَامِرٍ،عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ،عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدٍ،عَنْ عَامِرِ بْنِ سَعْدٍ،أَنَّ سَعْدًا لَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ: «أَلْحِدُوا لِي لَحْدًا،وَانْصِبُوا عَلَيَّ نَصْبًا،كَمَا فُعِلَ بِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
nasai.urdu = "حضرت عامر بن سعد سے روایت ہے کہ جب (والد محترم) حضرت سعد رضی اللہ عنہ کی وفات کا وقت قریب آیا تو انھوں نے فرمایا: میرے لیے لحد بنانا اور پھر اینٹیں لگا دینا جیسا کہ رسول اللہ ﷺ کے لیے کیا گیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;