var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَبْدِ الرَّحْمَنِ الْأَذْرَمِيُّ،عَنْ حَكَّامِ بْنِ سَلْمٍ الرَّازِيِّ،عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى،عَنْ أَبِيهِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنْ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللَّحْدُ لَنَا،وَالشَّقُّ لِغَيْرِنَا»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’لحد ہمارے لیے ہے اور شق دوسروں کے لیے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3208) ترمذی (1045) ابن ماجہ (1554)`;
nasai.anwaar = [336,1];