var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ،قَالَ: حَدَّثَنَا مُسَدَّدٌ،قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ،عَنْ أَيُّوبَ،عَنْ حُمَيْدِ بْنِ هِلَالٍ،عَنْ أَبِي الدَّهْمَاءِ،عَنْ هِشَامِ بْنِ عَامِرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «احْفِرُوا وَأَحْسِنُوا،وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ،وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًا»";
nasai.urdu = "حضرت ہشام بن عامر رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’دقبریں کھودو اور اچھی طرح کھودو اور دو دو،تین تین کو (اکٹھا) دفن کرو۔اور جو شخص قرآن مجید زیادہ پڑھا ہوا ہو،اسے آگے رکھو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;