var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا سَهْلُ بْنُ هَاشِمٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَقْبَلَتْ الْحَيْضَةُ فَاتْرُكِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب حیض کا خون آنا شروع ہو جائے تو نماز (وغیرہ) چھوڑ دو اور جب خون آنا رک جائے تو غسل کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;