var nasai = {};
nasai.arabic = "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ: قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ،عَنْ سُفْيَانَ،قَالَ: سَمِعَ عَمْرٌو،جَابِرًا يَقُولُ: «أَتَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَبْدَ اللَّهِ بْنَ أُبَيٍّ بَعْدَ مَا أُدْخِلَ فِي قَبْرِهِ فَأَمَرَ بِهِ فَأُخْرِجَ،فَوَضَعَهُ عَلَى رُكْبَتَيْهِ،وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ،وَأَلْبَسَهُ قَمِيصَهُ» وَاللَّهُ أَعْلَمُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ فرماتے ہیں کہ عبداللہ بن ابی کو قبر میں رکھے جانے کے بعد نبی ﷺ تشریف لائے اور اسے باہر نکالنے کا حکم دیا،پھر آپ نے اسے اپنے گھٹنوں پر رکھا اور کسی قدر اپنا لعاب دہن اس پر ڈالا۔اور اسے اپنی قمیص پہنائی۔اللہ تعالیٰ ہی (اس کی مصلحت) جانتا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;