var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا خَالِدٌ،عَنْ شُعْبَةَ،عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ،عَنْ الشَّعْبِيِّ،أَخْبَرَنِي مَنْ «مَرَّ مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى قَبْرٍ مُنْتَبِذٍ،فَأَمَّهُمْ،وَصَفَّ خَلْفَهُ»،قُلْتُ: مَنْ هُوَ يَا أَبَا عَمْرٍو؟ قَالَ: ابْنُ عَبَّاسٍ";
nasai.urdu = "حضرت شعبی سے روایت ہے کہ مجھے اس صحابی نے بتایا جو رسول اللہ ﷺ کے ساتھ ایک علیحدہ بنی ہوئی قبر کے پاس سے گزرے تھے،پ نے امامت فرمائی اور انھوں (ابن عباس اور دوسرے لوگوں) نے آپ کے پیچھے صف بندی کی۔شعبی سے پوچھا گیا: وہ کون سے صحابی ہیں؟ انھوں نے کہا: حضرت ابن عباس رضی اللہ عنہما۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;