var nasai = {};
nasai.arabic = "-أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا هُشَيْمٌ،قَالَ: الشَّيْبَانِيُّ أَنْبَأَنَا،عَنْ الشَّعْبِيِّ،قَالَ: أَخْبَرَنِي مَنْ رَأَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «مَرَّ بِقَبْرٍ مُنْتَبِذٍ فَصَلَّى عَلَيْهِ،وَصَفَّ أَصْحَابَهُ خَلْفَهُ»،قِيلَ مَنْ حَدَّثَكَ؟ قَالَ: ابْنُ عَبَّاسٍ";
nasai.urdu = "حضرت شعبی رحمہ اللہ بیان کرتے ہیں کہ مجھے اس صحابی نے خبر دی جنھوں نے خود دیکھا تھا کہ رسول اللہ ﷺ ایک علیحدہ بنی ہوئی قبر کے قریب سے گزرے تو آپ نے اپنے صحابہ کی اپنے پیچھے صف بنائی اور جنازہ پڑھایا۔(شعبی سے) پوچھا گیا: آپ کو کس صحابی نے بیان فرمایا؟ انھوں نے کہا: حضرت ابن عباس رضی اللہ عنہما نے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;