var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ،قَالَ: حَدَّثَنَا زَيْدُ بْنُ عَلِيٍّ وَهُوَ أَبُو أُسَامَةَ،قَالَ: حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ،عَنْ حَبِيبِ بْنِ أَبِي مَرْزُوقٍ،عَنْ عَطَاءٍ،عَنْ جَابِرٍ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى قَبْرِ امْرَأَةٍ بَعْدَ مَا دُفِنَتْ»";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے ایک عورت کی قبر پر اس کے دفن کیے جانے کے بعد جنازہ پڑھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;