var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ،قَالَ: حَدَّثَنَا أَبُو نُعَيْمٍ،وَيَحْيَى بْنُ آدَمَ،قَالَ: حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ،عَنْ سِمَاكٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: «خَرَجَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى جَنَازَةِ أَبِي الدَّحْدَاحِ،فَلَمَّا رَجَعَ أُتِيَ بِفَرَسٍ مُعْرَوْرًى،فَرَكِبَ وَمَشَيْنَا مَعَهُ»";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ حضرت ابن وحداح رضی اللہ عنہ کے جنازے کے لیے نکلے (پیدل تشریف لے گئے)۔جب واپس ہوئے تو آپ کے پاس بغیر کاٹھی کے گھوڑا لایا گیا۔آپ سوار ہوگئے۔ہم آپ کے ساتھ ساتھ پیدل چلتے رہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;