var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ،قَالَ: حَدَّثَنَا حَفْصٌ،عَنْ ابْنِ جُرَيْجٍ،عَنْ سُلَيْمَانَ بْنِ مُوسَى،وَأَبِي الزُّبَيْرِ،عَنْ جَابِرٍ قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُبْنَى عَلَى الْقَبْرِ،أَوْ يُزَادَ عَلَيْهِ،أَوْ يُجَصَّصَ» زَادَ سُلَيْمَانُ بْنُ مُوسَى: «أَوْ يُكْتَبَ عَلَيْهِ»";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے منع فرمایا کہ قبر پر کوئی عمارت بنائی جائے یا قبر پر اضافہ کیا جائے یا قبر کو پختہ بنایا جائے۔راوی سلیمان بن موسیٰ نے یہ الفاظ زیادہ بیان کیے ہیں: یا اس پر کچھ لکھا جائے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;