var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ،قَالَ: أَنْبَأَنَا ابْنُ وَهْبٍ،قَالَ: أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ،أَنَّ ثُمَامَةَ بْنَ شُفَيٍّ حَدَّثَهُ،قَالَ: كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ بِأَرْضِ الرُّومِ،فَتُوُفِّيَ صَاحِبٌ لَنَا فَأَمَرَ فَضَالَةُ بِقَبْرِهِ فَسُوِّيَ ثُمَّ قَالَ: «سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِتَسْوِيَتِهَا»";
nasai.urdu = "حضرت ثمامہ بن شفی بیان کرتے ہیں کہ ہم حضرت فضالہ بن عبید رضی اللہ عنہ کے ساتھ رومیوں کے علاقے میں تھے کہ ہمارا ایک ساتھی فوت ہوگیا۔تو حضرت فضالہ نے حکم دیا اور اس کی قبر ہموار کر دی گئی،پھر فرمانے لگے: میں نے رسول اللہ ﷺ سے سنا آپ قبروں کو ہموار کرنے کا حکم دیتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;