var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا يَحْيَى،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ حَبِيبٍ،عَنْ أَبِي وَائِلٍ،عَنْ أَبِي الْهَيَّاجِ،قَالَ: قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ: أَلَا أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«لَا تَدَعَنَّ قَبْرًا مُشْرِفًا إِلَّا سَوَّيْتَهُ،وَلَا صُورَةً فِي بَيْتٍ إِلَّا طَمَسْتَهَا»";
nasai.urdu = "حضرت ابو ہیاج سے منقول ہے،حضرت علی رضی اللہ عنہ نے مجھ سے فرمایا: کیا میں تجھے اس کام پر نہ بھیجو جس پر مجھے رسول اللہ ﷺ نے بھیجا تھا کہ تو کوئی بلند قبر نہ چھوڑ مگر اسے ہموار کر دے اور نہ کسی گھر میں کوئی بت یا تصویر چھوڑ مگر اسے توڑ پھوڑ دے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;