var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ،قَالَ: حَدَّثَنَا يَعْقُوبُ،قَالَ: حَدَّثَنَا أَبِي،عَنْ صَالِحٍ،عَنْ ابْنِ شِهَابٍ،قَالَ: حَدَّثَنِي أَبُو سَلَمَةَ،وَابْنُ الْمُسَيَّبِ،أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُمَا،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَعَى لَهُمُ النَّجَاشِيَّ صَاحِبَ الْحَبَشَةِ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ،فَقَالَ: «اسْتَغْفِرُوا لِأَخِيكُمْ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ جس دن حبشہ کے بادشاہ نجاشی رحمہ اللہ فوت ہوئے،رسول اللہ ﷺ نے اسی دن ان کی وفات کی اطلاع ہمیں دی اور فرمایا: ’’اپنے (اسلامی) بھائی کے لیے استغفار کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;