var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ،عَنْ مُحَمَّدِ بْنِ جُحَادَةَ،عَنْ أَبِي صَالِحٍ،عَنْ ابْنِ عَبَّاسٍ قَالَ: «لَعَنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَائِرَاتِ الْقُبُورِ،وَالْمُتَّخِذِينَ عَلَيْهَا الْمَسَاجِدَ وَالسُّرُجَ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے قبرستان جانے والی عورتوں اور قبروں پر عبادت گاہیں بنانے والوں اور چراغ جلانے والوں پر لعنت کی ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3236) ترمذی (320)`;
nasai.anwaar = [336,1];