var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ،عَنْ وَكِيعٍ،عَنْ سُفْيَانَ،عَنْ سُهَيْلٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ حَتَّى تَحْرُقَ ثِيَابَهُ خَيْرٌ لَهُ مِنْ أَنْ يَجْلِسَ عَلَى قَبْرٍ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تم میں سے کسی شخص کا انگارے پر بیٹھنا جس سے اس کے کپڑے جل جائیں،قبر پر بیٹھنے سے بہتر ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;