var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ،عَنْ شُعَيْبٍ،قَالَ: حَدَّثَنَا اللَّيْثُ،قَالَ: حَدَّثَنَا خَالِدٌ،عَنْ ابْنِ أَبِي هِلَالٍ،عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ،عَنْ النَّضْرِ بْنِ عَبْدِ اللَّهِ السَّلَمِيِّ،عَنْ عَمْرِو بْنِ حَزْمٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَقْعُدُوا عَلَى الْقُبُورِ»";
nasai.urdu = "حضرت عمرو بن حزم رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’قبروں پر مت بیٹھو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;