var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ قَوْمًا اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’اللہ تعالیٰ ان لوگوں (یہود و نصاری) پر لعنت فرمائے جنھوں نے اپنے انبیاء کی قبروں کو عبادت گاہ بنایا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;