var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى صَاعِقَةُ،قَالَ: حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ،قَالَ: حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَزِيدَ بْنِ الْهَادِ،عَنْ ابْنِ شِهَابٍ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ»\n__________";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ ان یہودیوں اور عیسائیوں پ لعنت فرمائے جنھوں نے اپنے انبیاء کی قبروں کو عبادت گاہ بنایا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;