var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ أَبِي عُبَيْدِ اللَّهِ الْوَرَّاقُ،قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ»";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’میت کو جب قبر میں رکھ دیا جاتا ہے اور اس کے ساتھی اسے دفن کرنے کے بعد واپس آ جاتے ہیں تو وہ ان کے جوتوں کی آواز سن رہا ہوتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;