var nasai = {};
nasai.arabic = "-أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ،قَالَ: حَدَّثَنَا حَجَّاجٌ،عَنْ لَيْثِ بْنِ سَعْدٍ،عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ،أَنَّ صَفْوَانَ بْنَ عَمْرٍو حَدَّثَهُ،عَنْ رَاشِدِ بْنِ سَعْدٍ،عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ،مَا بَالُ الْمُؤْمِنِينَ يُفْتَنُونَ فِي قُبُورِهِمْ إِلَّا الشَّهِيدَ؟ قَالَ: «كَفَى بِبَارِقَةِ السُّيُوفِ عَلَى رَأْسِهِ فِتْنَةً»";
nasai.urdu = "حضرت راشد بن سعد نبی ﷺ کے ایک صحابی سے بیان کرتے ہیں کہ ایک آدمی نے کہا: اے اللہ کے رسول! کیا وجہ ہے کہ اہل ایمان کا ان کی قبروں میں امتحان لیا جاتا ہے مگر شہید کا نہیں؟ آپ نے فرمایا: ’’اس کے سر پر چمکتی تلواریں اس کے لیے امتحان سے کافی ہوگئیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;