var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ،قَالَ: حَدَّثَنَا يَحْيَى،عَنْ التَّيْمِيِّ،عَنْ أَبِي عُثْمَانَ،عَنْ عَامِرِ بْنِ مَالِكٍ،عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَ: «الطَّاعُونُ،وَالْمَبْطُونُ،وَالْغَرِيقُ،وَالنُّفَسَاءُ شَهَادَةٌ»،قَالَ: وَحَدَّثَنَا أَبُو عُثْمَانَ مِرَارًا،وَرَفَعَهُ مَرَّةً إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت صفوان بن امیہ رضی اللہ عنہ فرماتے ہیں: طاعون،پیٹ کی تکلیف،غرق اور دروزہ سے آنے والی موت شہادت ہے۔(راویٔ حدیث سلیمان تیمی نے) کہا: ہم سے یہ حدیث ابوعثمان نے کئی بار بیان کی۔اور ایک بار اس کو (مرفوع) نبی ﷺ کا فرمان بیان کیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;