var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ الْعَنْقَزِيُّ،قَالَ: حَدَّثَنَا ابْنُ إِدْرِيسَ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَذَا الَّذِي تَحَرَّكَ لَهُ الْعَرْشُ،وَفُتِحَتْ لَهُ أَبْوَابُ السَّمَاءِ،وَشَهِدَهُ سَبْعُونَ أَلْفًا مِنَ الْمَلَائِكَةِ،لَقَدْ ضُمَّ ضَمَّةً،ثُمَّ فُرِّجَ عَنْهُ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے (حضرت سعد بن معاذ رضی اللہ عنہ کے دفن کے وقت) فرمایا: ’’یہ شخص جس کے لیے عرش جھوم گیا،اس (کی روح) کے لیے آسمان کے تمام دروازے کھول دیے گئے اور اس کے جنازے پر ستر ہزار فرشتے حاضر ہوئے،وہ بھی بھینچ دیا گیا مگر پھر اسے چھوڑ دیا گیا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;