var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ،قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ،عَنْ سُفْيَانَ،عَنْ أَبِيهِ،عَنْ خَيْثَمَةَ،عَنْ الْبَرَاءِ قَالَ: يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ [إبراهيم: 27]،قَالَ: «نَزَلَتْ فِي عَذَابِ الْقَبْرِ»";
nasai.urdu = "حضرت براء رضی اللہ عنہ بیان کرتے ہیں کہ یہ آیت عذاب قبر کے بارے میں اتری ہے: (یثبت اللہ الذین امنوا ……… وفی الاخرۃ) ’’اللہ تعالیٰ مومنین کو دنیا اور آخرت (قبر) میں صحیح بات پر قائم رکھتا ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;