var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ اسْتَفْتَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ فَقَالَ إِنَّمَا ذَلِكَ عِرْقٌ فَاغْتَسِلِي وَصَلِّي فَكَانَتْ تَغْتَسِلُ لِكُلِّ صَلَاةٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ ام حبیبہ بنت جحش نے رسول اللہ ﷺ سے مسئلہ پوچھا اور کہا: اے اللہ کے رسول! مجھے (خون) استحاضہ آتا ہے۔آپ نے فرمایا: ’’یہ تو ایک رگ (کا خون) ہے۔تم (حیض کے اختتام پر) غسل کرو اور نماز پڑھو۔‘‘ تو وہ ہر نماز کے لیے غسل کر لیا کرتی تھیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;