var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ،قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَمِعَ صَوْتًا مِنْ قَبْرٍ فَقَالَ: «مَتَى مَاتَ هَذَا؟» قَالُوا: مَاتَ فِي الْجَاهِلِيَّةِ،فَسُرَّ بِذَلِكَ،وَقَالَ: «لَوْلَا أَنْ لَا تَدَافَنُوا لَدَعَوْتُ اللَّهَ أَنْ يُسْمِعَكُمْ عَذَابَ الْقَبْرِ»";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے ایک قبر سے آواز سنی تو فرمایا: ’’یہ کب فوت ہوا؟‘‘ لوگوں نے بتایا کہ یہ دور جاہلیت میں فوت ہوا تھا۔تو آپ کو خوشی ہوئی،پھر فرمایا: ’’اگر یہ خطرہ نہ ہو کہ تم مردوں کو دفن نہیں کر و گے تو میں اللہ تعالیٰ سے دعا کرتا کہ وہ تمھیں عذاب قبر سنا دے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;