var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ،قَالَ: حَدَّثَنَا يَحْيَى،عَنْ شُعْبَةَ،قَالَ: أَخْبَرَنِي عَوْنُ بْنُ أَبِي جُحَيْفَةَ،عَنْ أَبِيهِ،عَنْ الْبَرَاءِ بْنِ عَازِبِ،عَنْ أَبِي أَيُّوبَ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ مَا غَرَبَتِ الشَّمْسُ فَسَمِعَ صَوْتًا فَقَالَ: «يَهُودُ تُعَذَّبُ فِي قُبُورِهَا»";
nasai.urdu = "حضرت ابو ایوب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ غروب شمس کے بعد باہر تشریف لے گئے۔آپ نے ایک آواز سنی تو فرمایا: ’’یہودیوں کو ان کی قبروں میں عذاب ہو رہا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;