var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو،عَنْ ابْنِ وَهْبٍ،قَالَ: حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ،عَنْ ابْنِ شِهَابٍ،عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي هُرَيْرَةَ قَالَ: «سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ يَسْتَعِيذُ مِنْ عَذَابِ الْقَبْرِ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا: میں نے رسول اللہ ﷺ کو اس کے بعد عذاب قبر سے اللہ تعالیٰ کی پناہ مانگتے سنا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;