var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ يَحْيَى،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَعِيذُ مِنْ عَذَابِ الْقَبْرِ،وَمِنْ فِتْنَةِ الدَّجَّالِ،وَقَالَ: «إِنَّكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ عذاب قبر اور فتنہ دجال سے اللہ تعالیٰ کی پناہ طلب کیا کرتے تھے اور نبی ﷺ نے فرمایا: ’’قبروں میں تمھارا امتحان ہوگا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;