var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،عَنْ مَالِكٍ،عَنْ ابْنِ شِهَابٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ أَنَّهُ أَخْبَرَهُ،أَنَّ أَبَاهُ كَعْبَ بْنَ مَالِكٍ كَانَ يُحَدِّثُ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا نَسَمَةُ الْمُؤْمِنِ طَائِرٌ فِي شَجَرِ الْجَنَّةِ حَتَّى يَبْعَثَهُ اللَّهُ عَزَّ وَجَلَّ إِلَى جَسَدِهِ يَوْمَ الْقِيَامَةِ»";
nasai.urdu = "حضرت کعب بن مالک رضی اللہ عنہ بیان کرتے تھے کہ رسول اللہ ﷺ نے فرمایا: ’’مومن کی روح (وفات کے بعد) جنت کے درختوں میں اڑتی رہتی ہے حتی کہ اللہ تعالیٰ قیامت کے دن اسے اس کے جسم میں داخل کرے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;