var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،عَنْ مَالِكٍ،وَمُغِيرَةُ،عَنْ أَبِي الزِّنَادِ،عَنْ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ بَنِي آدَمَ» ـ وَفِي حَدِيثِ مُغِيرَةَ ـ: «كُلُّ ابْنِ آدَمَ يَأْكُلُهُ التُّرَابُ إِلَّا عَجْبَ الذَّنَبِ مِنْهُ خُلِقَ،وَفِيهِ يُرَكَّبُ»";
nasai.urdu = "حضرت ابو ہریرہ ؓ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: (مرنے کے بعد) انسان کے تمام اعضاء کو مٹی کھا لیتی ہے سوائے بن دُم کے۔(ریڑ ھ کی ہڈی کا آخر ی سرا) اسی وجہ سے انسان کی پیدائش کی ابتدا ہوئی اور اسی سے (دوبارہ) جسم جوڑا جائے گا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;