var nasai = {};
nasai.arabic = "-وأَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَمْرٍو،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنْ ابْنِ عَبَّاسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى الْمِنْبَرِ يَقُولُ: «إِنَّكُمْ مُلَاقُو اللَّهَ عَزَّ وَجَلَّ حُفَاةً عُرَاةً غُرْلًا»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے کہ میں نے رسول اللہ ﷺ کو منبر پر خطبے کی حالت میں یہ فرماتے ہوئے سنا: ’’تم ننگے پاؤں،ننگے جسم اور بغیر ختنوں کے اللہ تعالیٰ سے ملو گے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;