var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا أَبُو سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ شَهْرُ رَمَضَانَ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ النَّارِ وَصُفِّدَتْ الشَّيَاطِينُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جب ماہ رمضان المبارک شروع ہو جاتا ہے تو جنت کے دروازے کھول دیئے جاتے ہیں اور آگ کے دروازے بند کر دیے جاتے ہیں اور شیاطین جکڑ دیے جاتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;