var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي أَيُّوبَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَسْتَقْبِلُوا الْقِبْلَةَ وَلَا تَسْتَدْبِرُوهَا لِغَائِطٍ أَوْ بَوْلٍ وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا";
nasai.urdu = "حضرت ابوایوب انصاری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’بول و براز کے وقت قبلے کی طرف منہ کرو نہ پیٹھ،بلکہ مشرق یا مغرب کی طرف کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;