var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ الْجُوْزَجَانِيُّ قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ قَالَ أَنْبَأَنَا نَافِعُ بْنُ يَزِيدَ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ النَّارِ وَصُفِّدَتْ الشَّيَاطِينُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’جب رمضان المبارک شروع ہوتا ہے تو جنت کے دروازے کھول دیے جاتے ہیں اور آگ کے دروازے بند کر دیے جاتے ہیں اور شیاطین جکڑ دیے جاتے ہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;