var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي نَافِعُ بْنُ أَبِي أَنَسٍ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتْ الشَّيَاطِينُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہﷺ نے فرمایا: ’’جب رمضان المبارک شروع ہوتا ہے تو جنت کے دروازے کھول دیے جاتے ہیں اور جہنم کے دروازے بند کر دیے جاتے ہیں اور شیاطین قید کر دیے جاتے ہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;