var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ فِي حَدِيثِهِ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابنِ شِهَابٍ عَنْ ابْنِ أَبِي أَنَسٍ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتْ الشَّيَاطِينُ رَوَاهُ ابْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جب رمضان المبارک آتا ہے تو جنت کے دروازے کھول دیے جاتے ہیں اور آگ کے دروازے بند کر دیے جاتے ہیں اور شیاطین جکڑ دیے جاتے ہیں۔‘‘ اس روایت کو زہری سے ابن اسحاق نے بھی بیان کیا ہے۔(جو آگے آرہی ہے)۔";
nasai.hukam = "حسن";
nasai.description = ``;