var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ بْنُ مُوسَى خُرَاسَانِيٌّ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ رَمَضَانُ فُتِحَتْ أَبْوَابُ الرَّحْمَةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتْ الشَّيَاطِينُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،نبیﷺ نے فرمایا: ’’جب رمضان المبارک شروع ہوتا ہے تو رحمت کے دروازے کھول دیے جاتے ہیں،جہنم کے دروازے بند کر دیے جاتے ہیں اور شیاطین قید کر دیے جاتے ہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;