var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا الْمُهَلَّبُ بْنُ أَبِي حَبِيبَةَ ح وَأَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ الْمُهَلَّبِ بْنِ أَبِي حَبِيبَةَ قَالَ أَخْبَرَنِي الْحَسَنُ عَنْ أَبِي بَكْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقُولَنَّ أَحَدُكُمْ صُمْتُ رَمَضَانَ وَلَا قُمْتُهُ كُلَّهُ وَلَا أَدْرِي كَرِهَ التَّزْكِيَةَ أَوْ قَالَ لَا بُدَّ مِنْ غَفْلَةٍ وَرَقْدَةٍ اللَّفْظُ لِعُبَيْدِ اللَّهِ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’تم میں سے کوئی شخص یہ نہ کہے کہ میں نے پورے رمضان کے روزے رکھے یا میں نے تمام راتوں کا قیام کیا۔‘‘ (راوی کہتا ہے) میں نہیں جانتا کہ آپ نے اپنے منہ تعریف کو برا سمجھایا اس لیے کہ انسان سے غفلت اور نیند کا ہونا جانا لازمی امر ہے۔یہ الفاظ عبیداللہ (بن سعید) کے ہیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2415)`;
nasai.anwaar = [337,1];