var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ بْنِ خَالِدٍ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يُخْبِرُنَا قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِامْرَأَةٍ مِنْ الْأَنْصَارِ إِذَا كَانَ رَمَضَانُ فَاعْتَمِرِي فِيهِ فَإِنَّ عُمْرَةً فِيهِ تَعْدِلُ حَجَّةً";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بتاتے ہیں کہ رسول اللہﷺ نے انصار کی ایک عورت کو فرمایا: ’’جب رمضان المبارک شروع ہو جائے تو اس میں عمرہ کر لینا کیونکہ رمضان المبارک میں عمرہ حج کے برابر ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;