var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَأَيْتُ الْهِلَالَ فَقَالَ أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ قَالَ نَعَمْ فَنَادَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ صُومُوا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ ایک اعرابی نبیﷺ کے پاس آیا اور کہنے لگا: میں نے چاند دیکھا ہے۔فرمایا: ’’تو گواہی دیتا ہے کہ اللہ تعالیٰ کے سوا کوئی معبود نہیں اور حضرت محمد(ﷺ) اللہ تعالیٰ کے بندے اور رسول ہیں؟‘‘ اس نے کہا: جی ہاں۔تو نبیﷺ نے اعلان کر دیا: ’’روزہ رکھو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2340) ترمذی (691) ابن ماجہ (1652)`;
nasai.anwaar = [337,1];