var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبْصَرْتُ الْهِلَالَ اللَّيْلَةَ قَالَ أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ قَالَ نَعَمْ قَالَ يَا بِلَالُ أَذِّنْ فِي النَّاسِ فَلْيَصُومُوا غَدًا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ ایک اعرابی نبیﷺ کے پاس آیا اور کہنے لگا: میں نے آج رات چاند دیکھا ہے۔آپ نے فرمایا: ’’تو گواہی دیتا ہے کہ اللہ تعالیٰ کے سوا کوئی معبود نہیں اور محمد(ﷺ) اس کے بندے اور رسول ہیں؟‘‘ اس نے کہا: جی ہاں۔آپ نے فرمایا: ’’اے بلال! لوگوں میں اعلان کر دو کل روزہ رکھیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2341) وانظر الحدیث السابق (2114)`;
nasai.anwaar = [337,1];