var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُؤَمَّلُ بْنُ هِشَامٍ عَنْ إِسْمَعِيلَ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غُمَّ عَلَيْكُمْ الشَّهْرُ فَعُدُّوا ثَلَاثِينَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’روزوں کا آغاز چاند دیکھ کر کرو اور اختتام بھی چاند دیکھ کر کرو۔اگر بادل ہوں (اور چاند نظر نہ آئے) تو تیس دن پورے کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;