var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا وَرْقَاءُ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدِرُوا ثَلَاثِينَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’چاند دیکھ کر روزے رکھنا شروع کرو اور چاند دیکھ کر ہی روزے رکھنا بند کرو اور اگر بادل ہوں (اور چاند نظر نہ آئے) تو مہینہ تیس کا سمجھو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;