var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَأَيْتُمْ الْهِلَالَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَصُومُوا ثَلَاثِينَ يَوْمًا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہﷺ نے فرمایا: ’’جب تم (رمضان المبارک کا) چاند دیکھ لو،تب روزے رکھنا شروع کرو اور جب تم (شوال کا) چاند دیکھ لو تو روزے رکھنا بند کر دو۔اگر بادل ہوں (اور تمہیں شوال کا چاند نظر نہ آئے) تو تیس روزے پورے کرو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;