var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا رَأَيْتُمْ الْهِلَالَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدِرُوا لَهُ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’جب تم چاند دیکھو تو روزے رکھنا شروع کر دو اور جب تم (شوال کا) چاند دیکھو تو روزہ رکھنا بند کر دو۔اگر بادل ہوں (اور چاند نظر نہ آئے) تو اس مہینے کو تیس کا سمجھو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;