var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ رَمَضَانَ فَقَالَ لَا تَصُومُوا حَتَّى تَرَوْا الْهِلَالَ وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدِرُوا لَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے رمضان المبارک کا ذکر فرمایا تو فرمانے لگے: ’’جب تک چاند نہ دیکھ لو،روزے رکھنا شروع نہ کرو۔اسی طرح روزے رکھنا بند نہ کرو جب تک (شوال کا) چاند نہ دیکھ لو۔اگر بادل ہوں (اور چاند نظر نہ آئے) تو اس مہینے کو تیس دن کا فرض کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;