var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصُومُوا حَتَّى تَرَوْهُ وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدِرُوا لَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے منقول ہے،نبیﷺ نے فرمایا: ’’تم روزے رکھنا شروع نہ کرو حتیٰ کہ (رمضان المبارک کا) چاند دیکھ لو اور روزے رکھنا بند نہ کرو حتیٰ کہ (شوال کا) چاند دیکھ لو۔اگر چاند نظر نہ آئے تو مہینہ تیس کا بناؤ۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;