var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ صَاحِبَ حِمْصَ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْهِلَالَ فَقَالَ إِذَا رَأَيْتُمُوهُ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَعُدُّوا ثَلَاثِينَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان فرماتے ہیں کہ رسول اللہﷺ نے چاند کا ذکر کیا تو فرمایا: ’’جب تم چاند دیکھو تو روزے رکھنا شروع کر دو اور جب تم چاند دیکھو تو روزے رکھنا بند کر دو اور اگر بادل ہوں (اور چاند نظر نہ آئے) تو تیس دن پورے کرو۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;