var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ أَبُو الْجَوْزَاءِ وَهُوَ ثِقَةٌ بَصْرِيٌّ أَخُو أَبِي الْعَالِيَةِ قَالَ أَنْبَأَنَا حِبَّانُ بْنُ هِلَالٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلَاثِينَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جاند دیکھ کر روزے رکھو اور چاند دیکھ کر عید کرو۔اگر چاند چھپ جائے (نظر نہ آئے) تو اس مہینے کی گنتی تیس دن مکمل کرو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;