var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ مُحَمَّدِ بْنِ حُنَيْنٍ عَنْ ابْنِ عَبَّاسٍ قَالَ عَجِبْتُ مِمَّنْ يَتَقَدَّمُ الشَّهْرَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الْهِلَالَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلَاثِينَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ مجھے اس شخص پر تعجب ہے جو ماہ رمضان شروع ہونے سے پہلے روزہ رکھتا ہے جبکہ رسول اللہﷺ نے فرمایا ہے: ’’جب تم چاند دیکھو تو پھر روزہ رکھو اور جب اگلا چاند دیکھو تو روزے رکھنا چھوڑ دو۔اگر چاند چھپ جائے (نظر نہ آئے) تو مہینے کی گنتی تیس دن پوری کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;