var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقَدَّمُوا الشَّهْرَ حَتَّى تَرَوْا الْهِلَالَ قَبْلَهُ أَوْ تُكْمِلُوا الْعِدَّةَ ثُمَّ صُومُوا حَتَّى تَرَوْا الْهِلَالَ أَوْ تُكْمِلُوا الْعِدَّةَ قَبْلَهُ";
nasai.urdu = "حضرت حذیفہ بن یمان رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ماہ رمضان سے پہلے روزہ نہ رکھو حتیٰ کہ روزہ رکھنے سے پہلے (رمضان المبارک کا) چاند دیکھ لو،ورنہ (شعبان کے) تیس دن پورے کر کے روزہ رکھو،پھر تم روزے رکھتے رہو حتیٰ کہ (شوال کا) چاند دیکھ لو یا چاند دیکھنے سے پہلے تیس دن پورے کر لو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;