var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَصُومُوا قَبْلَ رَمَضَانَ صُومُوا لِلرُّؤْيَةِ وَأَفْطِرُوا لِلرُّؤْيَةِ فَإِنْ حَالَتْ دُونَهُ غَيَايَةٌ فَأَكْمِلُوا ثَلَاثِينَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’رمضان المبارک شروع ہونے سے پہلے روزہ نہ رکھو بلکہ چاند دیکھ کر روزہ رکھو اور چاند دیکھ کر ہی روزے رکھنے بند کرو۔اگر چاند نظر آنے میں بادل رکاوٹ بن جائیں تو تیس دن پورے کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;