var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ هُوَ أَبُو بُرَيْدٍ الْجَرْمِيُّ بَصْرِيٌّ عَنْ بَهْزٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ عَنْ أَبِي الْحَكَمِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ الشَّهْرُ تِسْعٌ وَعِشْرُونَ يَوْمًا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’میرے پاس حضرت جبریل علیہ السلام آئے اور بتایا کہ مہینہ انتیس دن کا بھی ہوتا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;