var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ ضَرَبَ بِيَدِهِ عَلَى الْأُخْرَى وَقَالَ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا وَنَقَصَ فِي الثَّالِثَةِ إِصْبَعًا";
nasai.urdu = "حضرت سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے اپنے ایک دست مبارک کو دوسرے پر مارا اور فرمایا: ’’کبھی مہینہ اتنا،اتنا اور اتنا بھی ہوتا ہے اور تیسری دفعہ آپ نے ایک انگلی کم کر لی۔‘‘ (یعنی انتیس)۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;