var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ إِسْمَعِيلَ عَنْ مُحَمَّدِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا يَعْنِي تِسْعَةً وَعِشْرِينَ رَوَاهُ يَحْيَى بْنُ سَعِيدٍ وَغَيْرُهُ عَنْ إِسْمَعِيلَ عَنْ مُحَمَّدِ بْنِ سَعْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت سعد رضی اللہ عنہ سے مروی ہے،نبیﷺ نے فرمایا: ’’مہینہ کبھی اتنا،اتنا اور اتنا بھی ہوتا ہے۔‘‘ (یعنی انتیس دن کا)۔\nیحییٰ بن سعید وغیرہ نے اس روایت کو بواسطہ اسماعیل،محمد بن سعد سے (صحابی رسول سعد بن ابی وقاص رضی اللہ عنہ کے واسطے کے بغیر) نبی اکرمﷺ سے بیان کیا ہے،یعنی مرسلاً۔";
nasai.hukam = "حسن";
nasai.description = ``;