var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا هَارُونُ قَالَ حَدَّثَنَا عَلِيٌّ هُوَ ابْنُ الْمُبَارَكِ قَالَ حَدَّثَنَا يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّهْرُ يَكُونُ تِسْعَةً وَعِشْرِينَ وَيَكُونُ ثَلَاثِينَ فَإِذَا رَأَيْتُمُوهُ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’مہینہ کبھی انتیس دن کا اور کبھی تیس دن کا ہوتا ہے۔جب تم چاند دیکھو تو روزے رکھنا شروع کرو اور جب تم چاند دیکھو تو روزے رکھنا بند کر دو اور اگر بادل ہوں (اور چاند نظر نہ آئے) تو (تیس دن کی) گنتی پوری کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;