var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ سَعِيدِ بْنِ عَمْرٍو عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّا أُمَّةٌ أُمِّيَّةٌ لَا نَكْتُبُ وَلَا نَحْسُبُ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا ثَلَاثًا حَتَّى ذَكَرَ تِسْعًا وَعِشْرِينَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’ہم امی لوگ ہیں۔ہم حساب کتاب نہیں جانتے۔مہینہ اتنا،اتنا اور اتنا ہوتا ہے۔‘‘ تین دفعہ ہاتھوں سے اشارہ فرمایا حتیٰ کہ انتیس ہوگئے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;