var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً وَقَفَهُ عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’سحری کھایا کرو،بلا شبہ سحری کھانے میں برکت ہے۔‘‘\nعبیداللہ بن سعید نے اس روایت کو موقوف بیان کیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;