var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ جَرِيرٍ نَسَائِيٌّ قَالَ حَدَّثَنَا أَبُو الرَّبِيعِ قَالَ حَدَّثَنَا مَنْصُورُ بْنُ أَبِي الْأَسْوَدِ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً";
nasai.urdu = "حضرت ابوہریرہؓ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’سحری کھایا کرو،بلا شبہ سحری کھانے میں برکت ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;