var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ فِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ مُرْهَا أَنْ تَغْتَسِلَ وَتُهِلَّ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہا سے حضرت اسماء بنت عمیس کے واقعہ کے بارے میں روایت ہے کہ ذوالحلیفہ میں جب ان کے ہاں بچہ پیدا ہوا تو رسول اللہ ﷺ نے ابوبکر صدیق رضی اللہ عنہ سے فرمایا: ’’انھیں کہو کہ غسل کرکے احرام باندھیں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;