var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمٍ عَنْ زِرٍّ قَالَ قُلْنَا لِحُذَيْفَةَ أَيَّ سَاعَةٍ تَسَحَّرْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هُوَ النَّهَارُ إِلَّا أَنَّ الشَّمْسَ لَمْ تَطْلُعْ";
nasai.urdu = "حضرت زر بیان کرتے ہیں کہ ہم نے حضرت حذیفہ ؓ سے پوچھا کہ آپ نے رسول اللہﷺ کے ساتھ سحری کس وقت کھائی؟ انہوں نے فرمایا: دن شروع ہونے ہی کو تھا،بس سورج طلوع نہ ہوا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;