var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ قَالَ سَمِعْتُ زِرَّ بْنَ حُبَيْشٍ قَالَ تَسَحَّرْتُ مَعَ حُذَيْفَةَ ثُمَّ خَرَجْنَا إِلَى الصَّلَاةِ فَلَمَّا أَتَيْنَا الْمَسْجِدَ صَلَّيْنَا رَكْعَتَيْنِ وَأُقِيمَتْ الصَّلَاةُ وَلَيْسَ بَيْنَهُمَا إِلَّا هُنَيْهَةٌ";
nasai.urdu = "حضرت زر بن حبیش بیان کرتے ہیں کہ میں نے حضرت حذیفہ رضی اللہ عنہ کے ساتھ سحری کھائی،پھر ہم نماز کے لیے نکلے۔جب ہم مسجد میں آئے تو دو رکعتیں پڑھیں۔اتنے میں جماعت کھڑی ہوگئی۔سنتوں اور اقامت کے درمیان بالکل معمولی فاصلہ تھا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;