var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ حَدَّثَنَا أَبُو يَعْفُورٍ قَالَ حَدَّثَنَا إِبْرَاهِيمُ عَنْ صِلَةَ بْنِ زُفَرَ قَالَ تَسَحَّرْتُ مَعَ حُذَيْفَةَ ثُمَّ خَرَجْنَا إِلَى الْمَسْجِدِ فَصَلَّيْنَا رَكْعَتَيْ الْفَجْرِ ثُمَّ أُقِيمَتْ الصَّلَاةُ فَصَلَّيْنَا";
nasai.urdu = "حضرت صلہ بن زفر بیان کرتے ہیں کہ میں نے حضرت حذیفہؓ کے ساتھ سحری کھائی۔پھر ہم مسجد کو چلے۔ہم نے فجر کی دو سنتیں پڑھیں،اتنے میں نماز فجر کی اقامت ہوگئی تو ہم نے فرض نماز پڑھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;