var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ تَسَحَّرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قُمْنَا إِلَى الصَّلَاةِ قُلْتُ كَمْ كَانَ بَيْنَهُمَا قَالَ قَدْرُ مَا يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً";
nasai.urdu = "حضرت زید بن ثابت رضی اللہ عنہ سے منقول ہے کہ ہم نے رسول اللہﷺ کے ساتھ سحری کھائی،پھر ہم نماز کے لیے اٹھے۔حضرت انس رضی اللہ عنہ نے فرمایا: میں نے پوچھا کہ درمیان میں کتنا فاصلہ تھا؟ انہوں نے فرمایا: اتنا کہ آدمی پجاس آیتیں پڑھ سکے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;