var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ تَسَحَّرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قُمْنَا إِلَى الصَّلَاةِ قُلْتُ زُعِمَ أَنَّ أَنَسًا الْقَائِلُ مَا كَانَ بَيْنَ ذَلِكَ قَالَ قَدْرُ مَا يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً";
nasai.urdu = "حضرت زید بن ثابتؓ بیان کرتے ہیں کہ ہم نے رسول اللہﷺ کے ساتھ سحری کھائی،پھر ہم نماز کے لیے اٹھے۔میں نے کہا… خیال کیا جاتا ہے کہ کہنے والے حضرت انسؓ ہیں… درمیان میں کتنا فاصلہ تھا؟ انہوں (زیدؓ) نے فرمایا: اتنا کہ آدمی پچاس آیات پڑھ سکے۔";
nasai.hukam = "حسن";
nasai.description = ``;