var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ مُحَمَّدٍ وَهُوَ ابْنُ عَمْرِو بْنِ عَلْقَمَةَ بْنِ وَقَّاصٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ فَاطِمَةَ بِنْتِ أَبِي حُبَيْشٍ أَنَّهَا كَانَتْ تُسْتَحَاضُ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ دَمُ الْحَيْضِ فَإِنَّهُ دَمٌ أَسْوَدُ يُعْرَفُ فَأَمْسِكِي عَنْ الصَّلَاةِ فَإِذَا كَانَ الْآخَرُ فَتَوَضَّئِي فَإِنَّمَا هُوَ عِرْقٌ";
nasai.urdu = "حضرت فاطمہ بنت ابی حبیش رضی اللہ عنہا نے کہا کہ مجھے استحاضے کا خون آتا تھا تو مجھ سے اللہ کے رسول ﷺ نے فرمایا: ’’جب حیض کا خون آ رہا ہو اور یہ سیاہی مائل خون ہوتا ہے جو پہچانا جاتا ہے،تو نماز سے رک جاؤ اور جب دوسرا خون (استحاضے کا) ہو تو وضو کر کے نماز پڑھا کرو یہ تو رگ (کا خون) ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (286)<br>ابن شھاب الزھري مدلس وعنعن۔<br>والحدیث السابق (201) یغني عنہ۔`;
nasai.anwaar = [322,1];