var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْحَمِيدِ صَاحِبِ الزِّيَادِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُحَدِّثُ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَسَحَّرُ فَقَالَ إِنَّهَا بَرَكَةٌ أَعْطَاكُمْ اللَّهُ إِيَّاهَا فَلَا تَدَعُوهُ";
nasai.urdu = "ایک صحابی رسول ؓسے روایت ہے کہ میں نبیﷺ کے پاس حاضر ہوا تو آپ سحری تناول فرما رہے تھے۔آپ نے فرمایا: ’’بلا شبہ سحری برکت ہے جو اللہ تعالیٰ نے تمہیں عطا فرمائی ہے،لہٰذا تم اسے نہ چھوڑو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;