var nasai = {};
nasai.arabic = "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ بَصْرِيٌّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ يُونُسَ بْنِ سَيْفٍ عَنْ الْحَارِثِ بْنِ زِيَادٍ عَنْ أَبِي رُهْمٍ عَنْ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَدْعُو إِلَى السَّحُورِ فِي شَهْرِ رَمَضَانَ وَقَالَ هَلُمُّوا إِلَى الْغَدَاءِ الْمُبَارَكِ";
nasai.urdu = "حضرت عرباض بن ساریہؓ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو رمضان المبارک میں سحری کی دعوت دیتے سنا۔آپ فرما رہے تھے: ’’آؤ اس مبارک کھانے کی طرف۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;