var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ مُوسَى بْنِ عُلَيٍّ عَنْ أَبِيهِ عَنْ أَبِي قَيْسٍ عَنْ عَمْرِو بْنِ الْعَاصِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السُّحُورِ";
nasai.urdu = "حضرت عمرو بن عاص رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ہمارے اور اہل کتاب کے روزے کے درمیان فرق،سحری کھانا ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;