var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ تَعَالَى حَتَّى يَتَبَيَّنَ لَكُمْ الْخَيْطُ الْأَبْيَضُ مِنْ الْخَيْطِ الْأَسْوَدِ قَالَ هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہﷺ سے اللہ تعالیٰ کے فرمان: حَتّٰی یَتَبَیَّنَ لَکُمْ الْاَسْوَدِ ’’حتیٰ کہ تمہارے لیے سفید دھاری سیاہ دھاری سے واضح ہو جائے۔‘‘ کے بارے میں پوچھا۔اپ نے فرمایا: ’’اس سے رات کی سیاہی اور دن کی سفیدی مراد ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;