var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ أَنْبَأَنَا سَوَادَةُ بْنُ حَنْظَلَةَ قَالَ سَمِعْتُ سَمُرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغُرَّنَّكُمْ أَذَانُ بِلَالٍ وَلَا هَذَا الْبَيَاضُ حَتَّى يَنْفَجِرَ الْفَجْرُ هَكَذَا وَهَكَذَا يَعْنِي مُعْتَرِضًا قَالَ أَبُو دَاوُدَ وَبَسَطَ بِيَدَيْهِ يَمِينًا وَشِمَالًا مَادًّا يَدَيْهِ";
nasai.urdu = "حضرت سمرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’بلال کی اذان اور اس سفیدی (فجر کاذب) سے تمہیں دھوکا نہ لگے حتیٰ کہ فجر اس طرح دائیں بائیں پھیل جائے۔‘‘ ابوداؤد (راوی) نے کہا: اور اس (استاد شعبہ) نے اپنے دونوں ہاتھ کھول کر دائیں بائیں کھینچ کر پھیلائے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;