var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقَدَّمُوا قَبْلَ الشَّهْرِ بِصِيَامٍ إِلَّا رَجُلٌ كَانَ يَصُومُ صِيَامًا أَتَى ذَلِكَ الْيَوْمُ عَلَى صِيَامِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ماہ رمضان المبارک شروع ہونے سے پہلے کوئی روزہ نہ رکھوالا یہ کہ کوئی شخص پہلے خاص دن کا روزہ رکھتا ہو اور وہ دن ایسے موقع پر آجائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;