var nasai = {};
nasai.arabic = "أَخْبَرَنِي عِمْرَانُ بْنُ يَزِيدَ بْنِ خَالِدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ قَالَ أَنْبَأَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى قَالَ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ أَخْبَرَنِي أَبُو هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَقَدَّمَنَّ أَحَدٌ الشَّهْرَ بِيَوْمٍ وَلَا يَوْمَيْنِ إِلَّا أَحَدٌ كَانَ يَصُومُ صِيَامًا قَبْلَهُ فَلْيَصُمْهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ رسول اللہﷺ نے فرمایا: ’’کوئی شخص رمضان المبارک سے ایک دو دن پہلے روزہ نہ رکھے مگر جو شخص پہلے سے کسی خاص دن کا روزہ رکھتا ہے،وہ رکھ سکتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;