var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَتَقَدَّمُوا الشَّهْرَ بِصِيَامِ يَوْمٍ أَوْ يَوْمَيْنِ إِلَّا أَنْ يُوَافِقَ ذَلِكَ يَوْمًا كَانَ يَصُومُهُ أَحَدُكُمْ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ماہ رمضان المبارک سے ایک دو دن پہلے روزہ نہ رکھو مگر یہ کہ اتفاقاً وہ دن آجائے جس کا کوئی شخص پہلے سے روزہ رکھنے کا عادی ہو۔‘‘\nابوعبدالرحمٰن (نسائی) رحمہ اللہ نے فرمایا: یہ غلطی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;