var nasai = {};
nasai.arabic = "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ سَالِمٍ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلَّا أَنَّهُ كَانَ يَصِلُ شَعْبَانَ بِرَمَضَانَ";
nasai.urdu = "ابو سلمہ کہتے ہیں کہ حضرت ام سلمہؓ نے فرمایا: میں نے رسول اللہﷺ کو پے در پے دو ماہ کے روزے رکھتے نہیں دیکھا،البتہ آپ شعبان (کے روزوں) کو رمضان المبارک (کے روزوں) سے ملا لیتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;