var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ عَنْ عَبْدَةَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ لَا أَعْلَمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَلَا صَامَ شَهْرًا كَامِلًا قَطُّ غَيْرَ رَمَضَانَ";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے کہ میں تو نہیں جانتی کہ رسول اللہﷺ نے کبھی ایک رات میں مکمل قرآن مجید پڑھا ہو یا کسی رات (شروع سے آخر تک) مسلسل نماز پڑھتے رہے ہوں یا رمضان المبارک کے علاوہ کسی مہینے کے مکمل روزے رکھے ہوں۔";
nasai.hukam = "حسن";
nasai.description = ``;