var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ عَنْ بَقِيَّةَ قَالَ حَدَّثَنَا بَحِيرٌ عَنْ خَالِدٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ أَنَّ رَجُلًا سَأَلَ عَائِشَةَ عَنْ الصِّيَامِ فَقَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ وَيَتَحَرَّى صِيَامَ الِاثْنَيْنِ وَالْخَمِيسِ";
nasai.urdu = "حضرت جبیر بن نفیر سے منقول ہے کہ ایک آدمی نے حضرت عائشہؓ سے (نفل) روزوں کے بارے میں سوال کیا تو انہوں نے فرمایا: رسول اللہﷺ شعبان (کے تقریباً) سبھی روزے رکھتے تھے اور سوموار اور جمعرات کا روزہ قصداً رکھا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;