var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ قَالَ حَدَّثَنَا ثَوْرٌ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ رَبِيعَةَ الْجُرَشِيِّ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَعْبَانَ وَرَمَضَانَ وَيَتَحَرَّى الِاثْنَيْنِ وَالْخَمِيسَ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ رسول اللہﷺ شعبان اور رمضان المبارک کے مکمل روزے رکھتے تھے اور سوموار اور جمعرات کا روزہ قصداً رکھتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;