var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ عَنْ أَبِي خَالِدٍ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ أَبِي إِسْحَقَ عَنْ صِلَةَ قَالَ كُنَّا عِنْدَ عَمَّارٍ فَأُتِيَ بِشَاةٍ مَصْلِيَّةٍ فَقَالَ كُلُوا فَتَنَحَّى بَعْضُ الْقَوْمِ قَالَ إِنِّي صَائِمٌ فَقَالَ عَمَّارٌ مَنْ صَامَ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت صلہ سے مروی ہے کہ ہم حضرت عمار رضی اللہ عنہ کے پاس تھے تو ان کے پاس بھنی ہوئی (سالم) بکری لائی گئی۔انہوں نے (حاضرین سے) فرمایا: کھاؤ۔لیکن کچھ لوگ ایک طرف ہوگئے اور کہنے لگے: ہمارا روزہ ہے۔حضرت عمار رضی اللہ عنہ نے فرمایا: جس نے شک والے دن کا روزہ رکھا اس نے حضرت ابوالقاسمﷺ کی نافرمانی کی۔";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف<br>ابو داود (2334) ترمذی (686) ابن ماجہ (1645)`;
nasai.anwaar = [337,1];