var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ قَالَ أَخْبَرَنِي أَبِي عَنْ جَدِّي قَالَ أَخْبَرَنِي شُعَيْبُ بْنُ إِسْحَقَ عَنْ الْأَوْزَاعِيِّ وَابْنُ أَبِي عَرُوبَةَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ أَلَا لَا تَقَدَّمُوا الشَّهْرَ بِيَوْمٍ أَوْ اثْنَيْنِ إِلَّا رَجُلٌ كَانَ يَصُومُ صِيَامًا فَلْيَصُمْهُ";
nasai.urdu = "حضرت ابو ہریرہؓ سے روایت ہے کہ رسول اللہﷺ فرمایا کرتے تھے: ’’خبردار! رمضان المبارک کے شروع ہونے سے ایک دو دن پہلے روزہ نہ رکھو،ہاں وہ شخص جو پہلے سے اس دن کا روزہ رکھتا تھا،وہ رکھ لے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;