var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ أَنْبَأَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت سعید بن مسیبؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جو شخص ایمان کی حالت میں اور ثواب کی نیت سے رمضان المبارک (کی راتوں) میں نقل عبادت کرے (تراویح پڑھے) اس کے سب پہلے گناہ معاف کر دئیے جائیں گے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;