var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رَمَضَانَ مَنْ قَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ: میں نے رسول اللہﷺ کو رمضان المبارک کے بارے میں فرماتے سنا: ’’جو شخص ایمان کی بنا پر اور ثواب کے حصول کی نیت سے اس (رمضان المبارک) کا قیام کرے گا،اس کے سب پہلے گناہ معاف کر دیے جائیں گے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;