var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِرَمَضَانَ مَنْ قَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہؓ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو رمضان المبارک کے بارے میں فرماتے سنا: ’’جو شخص ایمان کی بنا پر اور ثواب کی نیت سے اس کی راتوں کا قیام کرے گا (یعنی تراویح پڑھے گا) اس کے سب پہلے گناہ معاف کر کر دیے جائیں گے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;