var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا سَلَمَةَ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جو شخص ایمان کے ساتھ اور ثواب حاصل کرنے کے لیے قیام رمضان کرے گا،اس کے سب پہلے گناہ معاف کر دیے جائیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;