var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا غُنْدَرٌ قَالَ أَنْبَأَنَا مَعْمَرٌ قَالَ أَنْبَأَنَا ابْنُ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَى أَحَدُكُمْ الْغَائِطَ فَلَا يَسْتَقْبِلْ الْقِبْلَةَ وَلَكِنْ لِيُشَرِّقْ أَوْ لِيُغَرِّبْ";
nasai.urdu = "حضرت ابو ایوب انصاری رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’جب تم میں سے کوئی قضائے حاجت کرے تو قبلے کی طرف منہ نہ کرے بلکہ مشرق یا مغرب کی طرف منہ کرے۔‘‘ (بشرطیکہ قبلہ مشرق یا مغرب کی طرف نہ ہو)۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;