var nasai = {};
nasai.arabic = "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ رسول اللہﷺ قیامت رمضان میں رغبت دلایا کرتے تھے،بغیر اس کے کہ ان کو اس کا قطعی حکم دیں۔آپ نے فرمایا: ’’جو شخص ایمان کی حالت میں اور ثواب حاصل کرنے کے لیے رمضان المبارک (کی راتوں) میں قیام کرے گا،اس کے سب پہلے گناہ معاف ہو جائیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;