var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہؓ سے منقول ہے،رسول اللہﷺ نے فرمایا: ’’جس شخص نے ایمان کے جذبے سے اور حصول ثواب کی نیت سے رمضان المبارک (کی راتوں) میں نفل نماز (تراویح) پڑھی،اس کے سب پہلے گناہ معاف کر دیے جائیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;