var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہؓ سے منقول ہے،نبیﷺ نے فرمایا: ’’جو شخص ایمان کی وجہ سے اور ثواب حاصل کرنے کے لیے رمضان المبارک کے روزے رکھے،اس کے سب پہلے گناہ معاف کر دیے جائیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;