var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہؓ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’جو آدمی ایمان واحتساب کے ساتھ رمضان المبارک کے روزے رکھے گا تو اس کے سب پہلے گناہ معاف کر دیے جائیں گے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;