var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرٍ أَنَّ أَبَا السَّائِبِ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’تم میں سے جب کوئی شخص جنبی ہو تو ٹھہرے ہوئے پانی میں غسل نہ کرے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;