var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ قَالَ عَبْدُ اللَّهِ قَالَ اللَّهُ عَزَّ وَجَلَّ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ وَلِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ حِينَ يَلْقَى رَبَّهُ وَفَرْحَةٌ عِنْدَ إِفْطَارِهِ وَلَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ";
nasai.urdu = "حضرت عبداللہ بن مسعودؓ سے روایت ہے کہ اللہ عزوجل نے فرمایا: ’’روزہ میرے لیے ہے اور میں ہی اس کا بدلہ دوں گا۔روزے دار کو دو خوشیاں نصیب ہیں: ایک خوشی جب وہ اپنے رب تعالیٰ سے ملے گا اور دوسری خوشی افطار کے وقت۔اور روزے دار کے منہ کی بو اللہ تعالیٰ کے نزدیک کستوری سے بھی بڑھ کر خوشبودار ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;