var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرٌو أَنَّ الْمُنْذِرَ بْنَ عُبَيْدٍ حَدَّثَهُ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصِّيَامُ لِي وَأَنَا أَجْزِي بِهِ وَالصَّائِمُ يَفْرَحُ مَرَّتَيْنِ عِنْدَ فِطْرِهِ وَيَوْمَ يَلْقَى اللَّهَ وَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے،رسول اللہﷺ نے (اللہ تعالیٰ سے حکایت کرتے ہوئے) فرمایا: ’’روزہ میرے لیے ہے اور میں ہی اس کا بدلہ دوں گا۔روزے دار دو دفعہ خوش ہوگا: افطار کے وقت اور جب اللہ تعالیٰ کو ملے گا۔اور روزے دار کے منہ کی بو اللہ تعالیٰ کے نزدیک کستوری کی مہک سے بھی زیادہ اچھی ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;