var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِي عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الرَّاكِدِ ثُمَّ يَغْتَسِلُ مِنْهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تم میں سے کوئی ٹھہرے ہوئے پانی میں ہرگز پیشاب نہ کرے کہ پھر اس میں غسل کرے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;