var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عِيسَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرٍو عَنْ بُكَيْرٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ حَسَنَةٍ يَعْمَلُهَا ابْنُ آدَمَ فَلَهُ عَشْرُ أَمْثَالِهَا إِلَّا الصِّيَامَ لِي وَأَنَا أَجْزِي بِهِ";
nasai.urdu = "حضرت ابوہریرہؓ سے مروی ہے،نبیﷺ نے اللہ تعالیٰ سے بیان فرمایا: ’’ہر نیکی جو انسان کرتا ہے وہ اسے (ثواب کے لحاظ سے کم از کم) دس گنا ہو کر ملے گی مگر روزہ کہ وہ میرے لیے ہے اور میں ہی اس کا بدلہ دوں گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;