var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ قَالَ أَخْبَرَنِي رَجَاءُ بْنُ حَيْوَةَ عَنْ أَبِي أُمَامَةَ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مُرْنِي بِأَمْرٍ آخُذُهُ عَنْكَ قَالَ عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا مِثْلَ لَهُ";
nasai.urdu = "حضرت ابو امامہ رضی اللہ عنہ بیان کرتے ہیں کہ میں رسول اللہﷺ کے پاس حاضر ہوا اور عرض کیا: مجھے ایسی چیز کا حکم دیجئے جو میں آپ سے خصوصی طور پر حاصل کروں (اس پر عمل کروں)۔آپ نے فرمایا: ’’روزہ رکھا کرو کیونکہ اس جیسی کوئی چیز نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;