var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الضَّعِيفُ شَيْخٌ صَالِحٌ وَالضَّعِيفُ لَقَبٌ لِكَثْرَةِ عِبَادَتِهِ قَالَ أَخْبَرَنَا يَعْقُوبُ الْحَضْرَمِيُّ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ عَنْ أَبِي نَصْرٍ عَنْ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَ أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْعَمَلِ أَفْضَلُ قَالَ عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا عِدْلَ لَهُ";
nasai.urdu = "حضرت ابو امامہؓ سے روایت ہے کہ میں نے رسول اللہﷺ سے پوچھا: کون سا عمل افضل ہے؟ آپ نے فرمایا: ’’روزے کی عادت ڈال کیونکہ کوئی اور کام اس کے برابر نہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;