var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجٍ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ أَبِي صَالِحٍ الزَّيَّاتِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصِّيَامُ جُنَّةٌ";
nasai.urdu = "حضرت حکم نے کہا کہ مجھے اس (حضرت معاذؓ کی) روایت کو اپنے استاد سے سنے،چالیس سال ہوگئے ہیں،پھر کہتے ہیں: مجھے یہ روایت معاذ بن جبل سے (عروہ کے علاوہ) میمون بن ابی شبیب نے بھی بیان کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;