var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مَخْلَدٌ عَنْ سُفْيَانَ عَنْ أَبِي الْعَلَاءِ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ غُضَيْفِ بْنِ الْحَارِثِ أَنَّهُ سَأَلَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَيُّ اللَّيْلِ كَانَ يَغْتَسِلُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ رُبَّمَا اغْتَسَلَ أَوَّلَ اللَّيْلِ وَرُبَّمَا اغْتَسَلَ آخِرَهُ قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةً";
nasai.urdu = "حضرت غضیف بن حارث سے روایت ہے کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ رسول اللہ ﷺ رات کے کس حصے میں غسل فرمایا کرتے تھے؟ انھوں نے فرمایا: آپ کبھی رات کے شروع میں غسل فرماتے اور کبھی آخر میں۔میں نے کہا: ہر تعریف اللہ کی جس نے اس معاملے میں وسعت رکھی۔";
nasai.hukam = "حسن";
nasai.description = ``;