var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ أَنَّ مُطَرِّفًا رَجُلًا مِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ حَدَّثَهُ أَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ دَعَا لَهُ بِلَبَنٍ لِيَسْقِيَهُ فَقَالَ مُطَرِّفٌ إِنِّي صَائِمٌ فَقَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصِّيَامُ جُنَّةٌ كَجُنَّةِ أَحَدِكُمْ مِنْ الْقِتَالِ";
nasai.urdu = "حضرت عثمان بن ابی العاصؓ نے حضرت مطرف کے لیے دودھ منگوایا تاکہ وہ اسے پیے تو انہوں نے کہا: میں روزے سے ہوں۔تو حضرت عثمان بن ابی العاصؓ کہنے لگے: میں نے رسول اللہﷺ کو فرماتے سنا: ’’روزہ ڈھال ہے جیسے تمہارے پاس جنگ میں ڈھال ہوتی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;