var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ،قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ ابْنِ إِسْحَقَ،عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ،عَنْ مُطَرِّفٍ،قَالَ: دَخَلْتُ عَلَى عُثْمَانَ بْنِ أَبِي الْعَاصِ،فَدَعَا بِلَبَنٍ،فَقُلْتُ: إِنِّي صَائِمٌ،فَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «الصَّوْمُ جُنَّةٌ مِنَ النَّارِ كَجُنَّةِ أَحَدِكُمْ مِنَ الْقِتَالِ»";
nasai.urdu = "حضرت مطرف کہتے ہیں کہ میں حضرت عثمان بن ابی العاصؓ کے پاس حاضر ہوا تو انہوں نے میرے لیے دودھ منگوایا۔میں نے عرض کیا: بلاشبہ میں روزے سے ہوں۔فرمانے لگے: میں نے رسول اللہﷺ کو فرماتے سنا: ’’روزہ (جہنم کی) آگ سے (بچاؤ کے لیے) ڈھال ہے جیسے تمہارے پاس جنگ میں (بچاؤ کے لیے) ڈھال ہوتی ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;