var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلصَّائِمِينَ بَابٌ فِي الْجَنَّةِ يُقَالُ لَهُ الرَّيَّانُ لَا يَدْخُلُ فِيهِ أَحَدٌ غَيْرُهُمْ فَإِذَا دَخَلَ آخِرُهُمْ أُغْلِقَ مَنْ دَخَلَ فِيهِ شَرِبَ وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا";
nasai.urdu = "حضرت سہل بن سعد رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’ض’جنت میں روزے داروں کے لیے ایک دروازہ مخصوص ہے جسے ’’ریان‘‘ کہا جاتا ہے۔اس میں ان کے علاوہ کوئی اور داخل نہ ہوگا۔جب آخری روزے دار داخل ہو جائے گا تو دروازہ بند کر دیا جائاے گا۔جو شخص اس میں داخل ہوگا پیے گا اور جس نے ایک دفعہ پی لیا،کبھی پیاسا نہ ہوگا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;