var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَعْقُوبُ عَنْ أَبِي حَازِمٍ قَالَ حَدَّثَنِي سَهْلٌ أَنَّ فِي الْجَنَّةِ بَابًا يُقَالُ لَهُ الرَّيَّانُ يُقَالُ يَوْمَ الْقِيَامَةِ أَيْنَ الصَّائِمُونَ هَلْ لَكُمْ إِلَى الرَّيَّانِ مَنْ دَخَلَهُ لَمْ يَظْمَأْ أَبَدًا فَإِذَا دَخَلُوا أُغْلِقَ عَلَيْهِمْ فَلَمْ يَدْخُلْ فِيهِ أَحَدٌ غَيْرُهُمْ";
nasai.urdu = "حضرت سہلؓ بیان کرتے ہیں کہ جنت میں ایک دروازہ ہے جسے ریان کہا جاتا ہے۔قیامت کے دن اعلان کیا جائے گا: کہاں ہیں روزے دار؟ کیا تمہیں ریان (سیرابی) دروازے کی خواہش ہے؟ جو اس سے جنت میں داخل ہوگا،کبھی پیاس محسوس نہ کرے گا۔جب روزے دار داخل ہو جائیں گے،وہ دروازہ بند کر دیا جائے گا۔ان کے علاوہ کوئی اور اس سے داخل نہ ہوگا۔";
nasai.hukam = "حسن";
nasai.description = ``;