var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا الْمُحَارِبِيُّ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَطَاعَ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ وَمَنْ لَمْ يَجِدْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ";
nasai.urdu = "حضرت عبداللہ بن مسعودؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’تم میں سے جو شخص نکاح (کے اخراجات) کی طاقت رکھے وہ شادی کرے اور جو اتنی وسعت نہ پائے،وہ روزے رکھے کیونکہ روزہ اس کی شہوت کو کچل دے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;