var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَخْبَرَنِي أَنَسٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ زَحْزَحَ اللَّهُ وَجْهَهُ عَنْ النَّارِ بِذَلِكَ الْيَوْمِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جو شخص اللہ کی راہ میں ایک دن روزہ رکھے،اللہ تعالیٰ اس ایک دن کی بدولت اس کے چہرے کو آگ سے ستر سال کے فاصلے تک دور کر دے گا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;