var nasai = {};
nasai.arabic = "أَخْبَرَنَا دَاوُدُ بْنُ سُلَيْمَانَ بْنِ حَفْصٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ الضَّرِيرُ عَنْ سُهَيْلٍ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ بِذَلِكَ الْيَوْمِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ کی خوشنودی کے لیے ایک دن روزہ رکھے،اللہ تعالیٰ اس دن کی وجہ سے اس کے اور آگ کے درمیان ستر سال کا فاصلہ فرما دے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;