var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ أَخْبَرَنِي سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ عَزَّ وَجَلَّ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ کے راستے میں ایک دن روزہ رکھے،اللہ تعالیٰ اس کے چہرے کو آگ سے ستر سال کے فاصلے تک دور فرما دے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;