var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُهَيْلٍ عَنْ صَفْوَانَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَ اللَّهُ وَجْهَهُ مِنْ جَهَنَّمَ سَبْعِينَ عَامًا";
nasai.urdu = "حضرت ابو سعید رضی اللہ عنہ سے منقول ہے،نبیﷺ نے فرمایا: ’’جو آدمی اللہ تعالیٰ کے راستے میں ایک دن روزہ رکھے،اللہ تعالیٰ اس کے چہرے کو جہنم سے ستر سال کے فاصلے تک دور فرما دے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;