var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنِي يَحْيَى بْنُ الْوَلِيدِ قَالَ حَدَّثَنِي مُحِلُّ بْنُ خَلِيفَةَ قَالَ حَدَّثَنِي أَبُو السَّمْحِ قَالَ كُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا أَرَادَ أَنْ يَغْتَسِلَ قَالَ وَلِّنِي قَفَاكَ فَأُوَلِّيهِ قَفَايَ فَأَسْتُرُهُ بِهِ";
nasai.urdu = "حضرت ابو سمح رضی اللہ عنہ بیان کرتے ہیں کہ میں اللہ کے رسول ﷺ کی خدمت کیا کرتا تھا۔جب آپ غسل کا ارادہ فرماتے تو مجھ سے فرماتے: ’’میری طرف اپنی پیٹھ کرلو۔‘‘ میں آپ کی طرف پیٹھ کر لیتا۔اس طرح میں آپ کو پردہ بھی کر دیتا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;