var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ الْهَادِ عَنْ سُهَيْلٍ عَنْ ابْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَصُومُ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ إِلَّا بَعَّدَ اللَّهُ عَزَّ وَجَلَّ بِذَلِكَ الْيَوْمِ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے رسول اللہﷺ کو فرماتے سنا: ’’جو شخص اللہ تعالیٰ عزوجل کے راستے میں ایک دن روزہ رکھے،اللہ تعالیٰ اس ایک دن (کے روزے) کی وجہ سے اس کے چہرے کو آگ سے ستر سال کے فاصلے تک دور فرما دے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;