var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ عَنْ حُمَيْدِ بْنِ الْأَسْوَدِ قَالَ حَدَّثَنَا سُهَيْلٌ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَهُ اللَّهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے منقول ہے،رسول اللہﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ کے راستے میں ایک دن روزہ رکھے،اللہ تعالیٰ اس کو آگ سے ستر سال کے فاصلے تک دور فرما دے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;