var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُؤَمَّلُ بْنُ إِهَابٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ وَسُهَيْلُ بْنُ أَبِي صَالِحٍ سَمِعَا النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ تَبَارَكَ وَتَعَالَى بَاعَدَ اللَّهُ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’جو شخص اللہ تبارک و تعالیٰ کے راستے میں ایک دن روزہ رکھے،اللہ تعالیٰ اس کے چہرے کو آگ سے ستر سال کے فاصلے تک دور کر دے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;