var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ نَيْسَابُورِيٌّ قَالَ حَدَّثَنَا يَزِيدُ الْعَدَنِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَصُومُ عَبْدٌ يَوْمًا فِي سَبِيلِ اللَّهِ إِلَّا بَاعَدَ اللَّهُ تَعَالَى بِذَلِكَ الْيَوْمِ النَّارَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’جو بندہ اللہ تعالیٰ کے راستے میں ایک دن روزہ رکھے،اللہ تعالیٰ اس ایک دن کی وجہ سے آگ کو اس کے چہرے سے ستر سال کے فاصلے تک دور فرما دے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;