var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ عَنْ سُفْيَانَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ حَرَّ جَهَنَّمَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابو سعیید خدری رضی اللہ عنہ سے مروی ہے،نبیﷺ نے فرمایا: ’’جو شخص ایک دن اللہ تعالیٰ کے راستے میں روزہ رکھے گا،اللہ تعالیٰ اس دن کی برکت سے جہنم کی تپش کو اس کے چہرے سے ستر سال کے فاصلے تک دور کر دے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;