var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ قَرَأْتُ عَلَى أَبِي حَدَّثَكُمْ ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُمَيٍّ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ النَّارَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جس شخص نے اللہ تعالیٰ کے راستے میں ایک دن روزہ رکھا،اللہ تعالیٰ اس دن کی بنا پر آگ کو اس کے چہرے سے ستر سال کے فاصلے تک دور رکھے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;