var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ الَّذِي قَبْلَهُ لَا نَعْلَمُ أَحَدًا تَابَعَ ابْنَ كَثِيرٍ عَلَيْهِ";
nasai.urdu = "حضرت سعید بن مسیب سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’سفر میں روزہ رکھنا نیکی نہیں۔‘‘\nامام ابوعبدالرحمٰن (نسائی) رحمہ اللہ فرماتے ہیں کہ یہ غلط ہے،درست اس سے پہلی (سند) ہے۔ہمارے علم میں نہیں ہے کہ اس پر کسی نے ابن کثیر کی متابعت کی ہو۔";
nasai.hukam = "صحیح";
nasai.description = ``;