var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى نَاسًا مُجْتَمِعِينَ عَلَى رَجُلٍ فَسَأَلَ فَقَالُوا رَجُلٌ أَجْهَدَهُ الصَّوْمُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے لوگوں کو ایک شخص کے اردگرد جمع دیکھا تو پوچھا (کیا بات ہے؟) لوگوں نے کہا: ایک آدمی ہے جسے روزے کی وجہ سے سخت تکلیف ہے۔رسول اللہﷺ نے فرمایا: ’’سفر کے دوران میں (اس حد تک پہنچانے والا) روزہ رکھنا نیکی نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;