var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ عَلَيْكُمْ بِرُخْصَةِ اللَّهِ عَزَّ وَجَلَّ فَاقْبَلُوهَا";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’سفر کے دوران میں (اس قسم کا) روزہ رکھنا نیکی نہیں،بلکہ اللہ تعالیٰ کی رخصت سے فائدہ اٹھاؤ اور اسے قبول کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;