var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبدِ اللَّهِ وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَا حَدَّثَنَا أَبُو دَاوُدَ عَنْ سُفْيَانَ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِطَعَامٍ بِمَرِّ الظَّهْرَانِ فَقَالَ لِأَبِي بَكْرٍ وَعُمَرَ أَدْنِيَا فَكُلَا فَقَالَا إِنَّا صَائِمَانِ فَقَالَ ارْحَلُوا لِصَاحِبَيْكُمْ اعْمَلُوا لِصَاحِبَيْكُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبیﷺ کے پاس مَرُّ الظَّہران مقام میں کھانا لایا گیا۔آپ نے حضرت ابوبکر اور حضرت عمر رضی اللہ عنہ سے فرمایا: ’’قریب آؤ اور کھاؤ۔‘‘ ان دونوں نے کہا: ہم روزے سے ہیں۔آپ نے دیگر صحابہ رضی اللہ عنہم سے فرمایا: ’’اپنے ان دو محترم ساتھیوں کے لیے سواریاں تم تیار کرنا اور ان کے دوسرے کام بھی تم کرنا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن وھو مدلس،والصواب أنہ مرسل۔`;
nasai.anwaar = [338,1];