var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ،قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ،قَالَ: أَخْبَرَنِي الْأَوْزَاعِيُّ،عَنْ يَحْيَى،أَنَّهُ حَدَّثَهُ عَنْ أَبِي سَلَمَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَغَدَّى بِمَرِّ الظَّهْرَانِ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ،فَقَالَ: «الْغَدَاءَ» مُرْسَلٌ،";
nasai.urdu = "حضرت ابو سلمہ سے روایت ہے کہ رسول اللہﷺ ایک دفعہ مَرُّ الظَّہران مقام پر کھانا کھا رہے تھے۔آپ کے ساتھ حضرت ابوبکر و عمر رضی اللہ عنہ تھے۔آپ نے فرمایا: ’’تم بھی کھانا کھاؤ۔‘‘ یہ روایت مرسل ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br> السند مرسل۔`;
nasai.anwaar = [338,1];