var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،قَالَ: حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ،قَالَ: حَدَّثَنَا عَلِيٌّ،عَنْ يَحْيَى،عَنْ أَبِي سَلَمَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ،كَانُوا بِمَرِّ الظَّهْرَانِ مُرْسَلٌ";
nasai.urdu = "حضرت ابو سلمہ سے مروی ہے کہ رسول اللہﷺ اور حضرت ابوبکر و عمر رضی اللہ عنہ مَرُّ الظَّہران مقام پر تھے۔یہ روایت بھی مرسل ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (2267)`;
nasai.anwaar = [338,1];