var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ مُوسَى الْجُهَنِيِّ قَالَ أُتِيَ مُجَاهِدٌ بِقَدَحٍ حَزَرْتُهُ ثَمَانِيَةَ أَرْطَالٍ فَقَالَ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ بِمِثْلِ هَذَا";
nasai.urdu = "موسیٰ جہجنی سے روایت ہے کہ حضرت مجاہد کے پاس ایک پیالہ لایا گیا۔میرے اندازے کے مطابق وہ آٹھ رطل تھا۔مجاہد کہنے لگے کہ مجھ سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا: بے شک رسول اللہ ﷺ اتنے پانی سے غسل فرما لیا کرتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;