var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ،قَالَ: حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ،قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ،عَنِ الْأَوْزَاعِيِّ،قَالَ: أَخْبَرَنِي يَحْيَى،قَالَ: حَدَّثَنِي أَبُو قِلَابَةَ،قَالَ: حَدَّثَنِي أَبُو الْمُهَاجِرِ،قَالَ: حَدَّثَنِي أَبُو أُمَيَّةَ يَعْنِي الضَّمْرِيَّ،أَنَّهُ قَدِمَ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ";
nasai.urdu = "حضرت ابو امیہ ضمری سے روایت ہے کہ میں نبیﷺ کے پاس آیا۔اور مذکورہ بالا کی مانند حدیث بیان کی۔";
nasai.hukam = "صحیح";
nasai.description = ``;