var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ التَّلِّ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ وَضَعَ عَنْ الْمُسَافِرِ نِصْفَ الصَّلَاةِ وَالصَّوْمَ وَعَنْ الْحُبْلَى وَالْمُرْضِعِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’اللہ تعالیٰ نے مسافر کو آدھی نماز اور روزہ معاف کر دیا ہے۔اور (اسی طرح) حاملہ اور دودھ پلانے والی عورت کو بھی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;