var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ قَالَ حَدَّثَنَا مَعْنٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ يُقَالُ الصِّيَامُ فِي السَّفَرِ كَالْإِفْطَارِ فِي الْحَضَرِ";
nasai.urdu = "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ فرماتے ہیں: کہا جاتا ہے کہ سفر میں روزہ رکھنا گھر میں رہ کر روزہ نہ رکھنے کے برابر ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (1666)<br>أبو سلمۃ لم یسمع من أبیہ کما قال یحیی بن معین (المراسیل لإبن أبي حاتم: ص 255 وسندہ صحیح)`;
nasai.anwaar = [338,1];