var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ قَالَ حَدَّثَنَا حَمَّادُ الْخَيَّاطِ وَأَبُو عَامِرٍ قَالَا حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ الصَّائِمُ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ";
nasai.urdu = "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے فرمایا: سفر میں روزہ رکھنے والا گھر رہ کر روزہ نہ رکھنے والے کی طرح ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (1666)<br>أبو سلمۃ لم یسمع من أبیہ کما قال یحیی بن معین (المراسیل لإبن أبي حاتم: ص 255 وسندہ صحیح)`;
nasai.anwaar = [338,1];