var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا سُوَيْدٌ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فِي رَمَضَانَ فَصَامَ حَتَّى أَتَى قُدَيْدًا ثُمَّ أُتِيَ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبَ وَأَفْطَرَ هُوَ وَأَصْحَابُهُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے منقول ہے کہ نبیﷺ رمضان المبارک میں (فتح مکہ کے لیے) نکلے۔آپ روزے رکھتے رہے حتیٰ کہ قُدَیْد مقام پر آئے تو آپ کے پا دودھ کا پیالہ لایا گیا۔آپ نے پیا اور صحابہ سمیت روزہ کھول لیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;