var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ فِي الْقَدَحِ وَهُوَ الْفَرَقُ وَكُنْتُ أَغْتَسِلُ أَنَا وَهُوَ فِي إِنَاءٍ وَاحِدٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ ایک پیالے سے غسل فرما لیا کرتے تھے جو ایک فرق کے برابر تھا،نیز میں اور آپ ﷺ (بیک وقت) ایک برتن میں غسل کر لیا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;