var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ الْعَلَاءِ بْنِ الْمُسَيَّبِ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ صَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ حَتَّى أَتَى قُدَيْدًا ثُمَّ أَفْطَرَ حَتَّى أَتَى مَكَّةَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ نے فرمایا: رسول اللہﷺ مدینہ منورہ سے چلے تو روزے رکھتے رہے حتیٰ کہ قدید کے مقام پر آگئے،پھر آپ نے روزے رکھنے بند کر دیئے حتیٰ کہ مکہ مکرمہ آگئے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;