var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ فَصَامَ حَتَّى أَتَى عُسْفَانَ فَدَعَا بِقَدَحٍ فَشَرِبَ قَالَ شُعْبَةُ فِي رَمَضَانَ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ مَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ (فتح مکہ کے وقت) مکہ مکرمہ کو چلے تو روزے رکھتے رہے حتیٰ کہ عسفان مقام پر پہنچے تو پیالہ منگوایا اورپی لیا۔اور یہ رمضان المبارک کی بات ہے۔حضرت ابن عباس رضی اللہ عنہ (اس بنا پر) فرمایا کرتے تھے: (سفر میں) جو شخص چاہے روزہ رکھے،جو چاہے نہ رکھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;