var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَافَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَشَرِبَ نَهَارًا يَرَاهُ النَّاسُ ثُمَّ أَفْطَرَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے رمضان المبارک میں (فتح مکہ کا) سفر کیا۔روزے رکھتے رہے حتیٰ کہ مقام عسفان میں پہنچے تو برتن منگوایا اور ابھی دن ہی تھا کہ آپ نے پی کر روزہ کھول لیا۔سب لوگ آپ کو دیکھ رہے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;