var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْعَوَّامِ بْنِ حَوْشَبٍ قَالَ قُلْتُ لِمُجَاهِدٍ الصَّوْمُ فِي السَّفَرِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ وَيُفْطِرُ";
nasai.urdu = "حضرت عوام بن حوشب سے روایت ہے کہ میں نے حضرت مجاہد سے سفر میں روزہ رکھنے کے بارے میں پوچھا تو انہوں نے فرمایا: رسول اللہ% (سفر کے دوران میں) روزہ رکھ بھی لیتے تھے اور چھوڑ بھی دیتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;