var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ،قَالَ: حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ،قَالَ: حَدَّثَنَا هِشَامٌ،عَنْ قَتَادَةَ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ،أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الصَّوْمِ فِي السَّفَرِ؟ قَالَ: «إِنْ-ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا-إِنْ شِئْتَ صُمْتَ،وَإِنْ شِئْتَ أَفْطَرْتَ»";
nasai.urdu = "حضرت حمزہ بن عمرو اسلمیؓ سے روایت ہے کہ میں نے رسول اللہﷺ سے سفر کے دوران میں روزہ رکھنے کے بارے میں پوچھا۔آپ نے فرمایا ’’اگر تو چاہے تو رکھ لے اور چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;