var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ قَالَ إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ";
nasai.urdu = "حضرت حمزہ اسلمیؓ سے منقول ہے کہ میں نے رسول اللہﷺ سے دوران سفر میں روزہ رکھنے کے بارے میں پوچھا تو آپ نے فرمایا: ’’اگر تو روزہ رکھنا چاہے تو روزہ رکھ لے اور اگر نہ رکھنا چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;