var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا أَبُو بَكْرٍ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ بْنِ عَمْرٍو قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ";
nasai.urdu = "حضرت حمزہ بن عمروؓ سے مروی ہے کہ میں نے رسول اللہﷺ سے سفر کی حالت میں روزہ رکھنے کے بارے میں پوچھا تو آپ نے فرمایا: ’’تو روزہ رکھنا چاہے تو روزہ رکھ سکتا ہے۔نہ رکھنا چاہے تو چھوڑ بھی سکتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;