var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ لَقَدْ ارْتَقَيْتُ عَلَى ظَهْرِ بَيْتِنَا فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى لَبِنَتَيْنِ مُسْتَقْبِلَ بَيْتِ الْمَقْدِسِ لِحَاجَتِهِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انھوں نے کہا: میں اپنے گھر کی چھت پر چڑھا تو میں نے اللہ کے رسول ﷺ کو دو کچی انٹوں پر بیت المقدس کی طرف منہ کیے ہوئے قضائے حاجت کرتے دیکھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;