var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ وَاللَّيْثُ فَذَكَرَ آخَرَ عَنْ بُكَيْرٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ قَالَ يَا رَسُولَ اللَّهِ إِنِّي أَجِدُ قُوَّةً عَلَى الصِّيَامِ فِي السَّفَرِ قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
nasai.urdu = "حضرت حمزہ بن عمرو اسلمیؓ نے عرض کیا: اے اللہ کے رسول! یقینا میں سفر کی حالت میں روزہ رکھنے کی طاقت رکھتا ہوں (تو کیا میں روزہ رکھ لیا کروں) آپ نے فرمایا: ’’اگر چاہے تو رکھ لے،چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;