var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَنْبَأَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ أَخْبَرَنِي عِمْرَانُ بْنُ أَبِي أَنَسٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَمْزَةَ بْنِ عَمْرٍو أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ قَالَ إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ";
nasai.urdu = "حضرت حمزہ بن عمروؓسے روایت ہے کہ میں نے رسول اللہﷺ سے دوران سفر میں روزہ رکھنے کے بارے میںپوچھا۔آپ نے فرمایا: ’’اگر روزہ رکھنا چاہے تو رکھ لے اور اگر نہ رکھنا چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;