var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا مُحَمَّدٌ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ وَحَنْظَلَةَ بْنِ عَلِيٍّ قَالَ حَدَّثَانِي جَمِيعًا عَنْ حَمْزَةَ بْنِ عَمْرٍو قَالَ كُنْتُ أَسْرُدُ الصِّيَامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَسْرُدُ الصِّيَامَ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
nasai.urdu = "حضرت حمزہ بن عمروؓ بیان کرتے ہیں کہ میں رسول اللہﷺ کے دور میں لگاتار نفل روزے رکھا کرتا تھا تو میں نے عرض کیا: اے اللہ کے رسول! میں سفر میں بھی لگاتار روزے رکھ لیتا ہوں (کوئی حرج تو نہیں؟) آپ نے فرمایا: ’’چاہے تو روزہ رکھ،چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;