var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي عِمْرَانُ بْنُ أَبِي أَنَسٍ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ حَدَّثَهُ أَنَّ أَبَا مُرَاوِحٍ حَدَّثَهُ أَنَّ حَمْزَةَ بْنَ عَمْرٍو حَدَّثَهُ أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ رَجُلًا يَصُومُ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
nasai.urdu = "حضرت حمزہ بن عمروؓ نے جو کہ سفر میں روزے رکھا کرتے تھے،رسول اللہﷺ سے (اس بارے میں) پوچھا تو آپ نے فرمایا: ’’چاہے تو روزہ رکھ،چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;