var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ بِشْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصُومُ فِي السَّفَرِ قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
nasai.urdu = "حضرت حمزہ بن عمرو اسلمیؓ سے مروی ہے کہ میں سفر میں روزے رکھا کرتا تھا۔(اس لیے) میں نے رسول اللہa سے پوچھا: کیا میں دوران سفر میں روزہ رکھ سکتا ہوں؟ آپ نے فرمایا: ’’اگر تو چاہے تو روزہ رکھ لے اور اگر چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;