var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْحَسَنِ اللَّانِيُّ بِالْكُوفَةِ قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ الرَّازِيُّ عَنْ هِشَامٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ حَمْزَةَ بْنِ عَمْرٍو أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَصُومُ أَفَأَصُومُ فِي السَّفَرِ قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ حضرت حمزہ بن عمرو اسلمی نے کہا: اے اللہ کے رسول! میں اکثر نفل روزے رکھتا ہوں تو کیا سفر میں بھی رکھ لیا کروں؟ آپ نے فرمایا: ’’اگر چاہے تو روزہ رکھ لے اور اگر چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;