var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ إِنَّ حَمْزَةَ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ أَصُومُ فِي السَّفَرِ وَكَانَ كَثِيرَ الصِّيَامِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ حضرت حمزہ (اسلمی)ؓ نے رسول اللہﷺ سے عرض کیا: اے اللہ کے رسول! میں سفر میں روزہ رکھ لیا کروں؟ اور وہ اکثر (نفل) روزے رکھا کرتے تھے۔تو رسول اللہa نے ان سے فرمایا: ’’اگر چاہے تو روزہ رکھ لے اور چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;