var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ حَمْزَةَ الْأَسْلَمِيَّ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ وَكَانَ رَجُلًا يَسْرُدُ الصِّيَامَ فَقَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے کہ حضرت حمزہ رضی اللہ عنہ اسلمی رضی اللہ عنہ نے رسول اللہﷺ سے دوران سفر روزہ رکھنے کے بارے میں سوال کیا اور یہ (اللہ کے بندے) لگاتار نفل روزے رکھا کرتے تھے۔آپ نے فرمایا: ’’اگر تو چاہے تو روزہ رکھ لے اور اگر چاہے تو چھوڑ دے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;