var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ قَالَ حَدَّثَنَا أَبُو سَعِيدٍ قَالَ كُنَّا نُسَافِرُ فِي رَمَضَانَ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ لَا يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا يَعِيبُ الْمُفْطِرُ عَلَى الصَّائِمِ";
nasai.urdu = "حضرت ابو سعیدؓ بیان کرتے ہیں کہ ہم رمضان المبارک میں سفر کیا کرتے تھے۔کوئی ہم میں سے روزے دار ہوتا تھا اور کسی کا روزہ نہیں ہوتا تھا۔نہ روزے دار روزہ چھوڑنے والے پر اعتراض کرتا تھا اور نہ روزہ چھوڑنے والا روزہ دار پر۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;