var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَعِيدُ بْنُ يَعْقُوبَ الطَّالْقَانِيُّ قَالَ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ عَنْ أَبِي مَسْلَمَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ كُنَّا نُسَافِرُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ وَلَا يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا يَعِيبُ الْمُفْطِرُ عَلَى الصَّائِمِ";
nasai.urdu = "حضرت ابو سعیدؓ سے روایت ہے کہ ہم نبیﷺ کے ساتھ سفر کیا کرتے تھے۔ہم میں سے کوئی روزہ رکھتا تھا،کوئی نہیں رکھتا تھا۔نہ تو روزہ رکھنے والا،نہ رکھنے والے پر اعتراض کرتا تھا اور نہ روزہ نہ رکھنے والا روزہ رکھنے والے پر کوئی اعتراض کرتا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;