var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَنَا عَاصِمٌ عَنْ أَبِي نَضْرَةَ الْمُنْذِرِ عَنْ أَبِي سَعِيدٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُمَا سَافَرَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَصُومُ الصَّائِمُ وَيُفْطِرُ الْمُفْطِرُ وَلَا يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا الْمُفْطِرُ عَلَى الصَّائِمِ";
nasai.urdu = "حضرت ابو سعید اور حضرت جابرؓ سے منقول ہے کہ ہم نے رسول اللہﷺ کے ساتھ سفر کیے کوئی روزہ رکھتا تھا،کوئی نہیں رکھتا تھا۔نہ روزے دار روزہ چھوڑنے والے پر اعتراض کرتا تھا اور نہ روزہ چھوڑنے والا روزہ دار پر۔";
nasai.hukam = "حسن";
nasai.description = ``;