var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ صَائِمًا فِي رَمَضَانَ حَتَّى إِذَا كَانَ بِالْكَدِيدِ أَفْطَرَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ فتح مکہ والے سال رمضان المبارک میں روزے رکھتے ہوئے گئے،حتیٰ کہ جب مقام کدید میں پہنچے تو (اس دن کا) روزہ کھول لیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;