var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ ح وَأَنْبَأَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ وَابْنُ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَهُوَ قَدْرُ الْفَرَقِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں اور اللہ کے رسول ﷺ ایک برتن سے غسل کیا کرتے تھے جو تقریباً ایک فرق کے برابر ہوتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;