var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ سَمِعْتُ أَبَا سَلَمَةَ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْ إِنْ كَانَ لَيَكُونُ عَلَيَّ الصِّيَامُ مِنْ رَمَضَانَ فَمَا أَقْضِيهِ حَتَّى يَجِيءَ شَعْبَانُ";
nasai.urdu = "حضرت عائشہ ؓ فرماتی ہیں کہ مجھ پر رمضان المبارک کے کچھ روزے (حیض کی وجہ سے) واجب الادارہ جاتے تھے تو میں ان کی قضا ادا نہیں کر سکتی تھی،یہاں تک کہ شعبان آجاتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;