var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ يَزِيدَ قَالَ حَدَّثَنَا سَلَمَةُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ أَذِّنْ يَوْمَ عَاشُورَاءَ مَنْ كَانَ أَكَلَ فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ وَمَنْ لَمْ يَكُنْ أَكَلَ فَلْيَصُمْ";
nasai.urdu = "حضرت سلمہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے ایک آدمی کو عاشوراء کے دن حکم دیا کہ اعلان کرو: ’’جس نے کچھ کھا لیا ہے،وہ باقی دن نہ کھائے پیے اور جس نے کچھ نہیں کھایا،وہ روزہ رکھ لے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;