var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقُلْنَا أُهْدِيَ لَنَا حَيْسٌ قَدْ جَعَلْنَا لَكَ مِنْهُ نَصِيبًا فَقَالَ إِنِّي صَائِمٌ فَأَفْطَرَ";
nasai.urdu = "حضرت عائشہ ام المومنینؓ فرماتی ہیں کہ ایک دن رسول اللہﷺ میرے پاس تشریف لائے۔میں نے کہا: ہمارے پاس حیس کا تحفہ آیا ہے۔میں نے آپ کا حصہ سنبھال کر رکھا ہوا ہے۔آپ نے فرمایا: ’’تحقیق میں نے روزے کی نیت کی ہوئی تھی۔‘‘ پھر آپ نے روزہ ختم کر دیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;