var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ عَمَّتِهِ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَقَالَ هَلْ عِنْدَكُمْ شَيْءٌ قُلْنَا لَا قَالَ فَإِنِّي صَائِمٌ";
nasai.urdu = "ام المومنین حضرت عائشہؓ سے مروی ہے کہ ایک دن رسول اللہﷺ میرے پاس تشریف لائے اور فرمایا: ’’تمہارے پاس (کھانے کی) کوئی چیز ہے؟‘‘ ہم نے کہا: نہیں۔آپ نے فرمایا: ’’میں روزہ رکھ لیتا ہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;