var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هِشَامِ بْنِ عُرْوَةَ ح وَأَنْبَأَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ وَأَنَا مِنْ إِنَاءٍ وَاحِدٍ نَغْتَرِفُ مِنْهُ جَمِيعًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ اللہ کے رسول ﷺ اور میں ایک برتن سے غسل کر لیا کرتے تھے۔ہم بیک وقت اس سے چلو بھرتے تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;