var nasai = {};
nasai.arabic = "أَخْبَرَنِي الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ شُرَحْبِيلَ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ حَفْصَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُبَيِّتْ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُ";
nasai.urdu = "حضرت حفصہؓ سے روایت ہے،نبیﷺ نے فرمایا: ’’جو شخص طلوع فجر سے پہلے رات کے وقت روزے کی نیت کرے تو اس کا روزہ نہیں ہوتا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (1700)<br>عبد اللّٰہ بن أبي بکر لم یسمعہ من سالم۔<br>وانظر الحدیث الآتي (2334)`;
nasai.anwaar = [338,1];