var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَ حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ عَنْ حَفْصَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُبَيِّتْ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُ";
nasai.urdu = "حضرت حفصہؓ سے منقول ہے،نبیﷺ نے فرمایا: ’’جو شخص طلوع فجر سے قبل رات کو روزے کی نیت نہ کرے،اس کا روزہ نہیں ہوتا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2454) ترمذی (730)`;
nasai.anwaar = [338,2];