var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ أَشْهَبَ قَالَ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ وَذَكَرَ آخَرَ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ حَدَّثَهُمَا عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ حَفْصَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُجْمِعْ الصِّيَامَ قَبْلَ طُلُوعِ الْفَجْرِ فَلَا يَصُومُ";
nasai.urdu = "حضرت حفصہؓ سے مروی ہے،نبیﷺ نے فرمایا: ’’جس شخص نے طلوع فجر سے پہلے روزے کی نیت نہ کی،وہ روزہ نہ رکھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2454) ترمذی (730)`;
nasai.anwaar = [338,2];