var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُبَيِّتْ الصِّيَامَ مِنْ اللَّيْلِ فَلَا صِيَامَ لَهُ";
nasai.urdu = "حضرت حفصہؓ سے بیان ہے کہ نبیﷺ نے فرمایا: ’’جو شخص رات کے وقت روزے کی نیت نہ کرے،اس کا روزہ نہیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2454) ترمذی (730)`;
nasai.anwaar = [338,2];