var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ عَنْ حَفْصَةَ أَنَّهَا كَانَتْ تَقُولُ مَنْ لَمْ يُجْمِعْ الصِّيَامَ مِنْ اللَّيْلِ فَلَا يَصُومُ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ حضرت حفصہؓ فرمایا کرتی تھیں: جو شخص رات کے وقت روزے کی نیت نہ کرے،وہ روزہ نہ رکھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2454) ترمذی (730)`;
nasai.anwaar = [338,2];