var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ قَالَتْ حَفْصَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صِيَامَ لِمَنْ لَمْ يُجْمِعْ قَبْلَ الْفَجْرِ";
nasai.urdu = "حضرت حفصہؓ جو کہ نبیﷺ کی زوجہ مطہرہ تھیں‘ انہوں نے فرمایا: اس آدمی کا روزہ نہیں ہوتا جو طلوع فجر سے پہلے روزے کی نیت نہ کرے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;