var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ مِنْ الْجَنَابَةِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ تحقیق میں اور اللہ کے رسول ﷺ (بیک وقتض ایک برتن سے غسل جنابت کر لیا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;