var nasai = {};
nasai.arabic = "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عَائِشَةَ وَحَفْصَةَ مِثْلَهُ لَا يَصُومُ إِلَّا مَنْ أَجْمَعَ الصِّيَامَ قَبْلَ الْفَجْرِ";
nasai.urdu = "حضرت عائشہ اور حضرت حفصہؓ سے اسی کے مثل مروی ہے،انہوں نے فرمایا: وہ شخص روزہ نہ رکھے جس نے طلوع فجر سے قبل روزے کی نیت نہیں کی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>السند ضعیف لإنقطاعہ۔<br>والحدیث الموقوف المتقدم (2338) یغني عنہ۔`;
nasai.anwaar = [339,1];