var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ مَا يُرِيدُ أَنْ يَصُومَ وَمَا صَامَ شَهْرًا مُتَتَابِعًا غَيْرَ رَمَضَانَ مُنْذُ قَدِمَ الْمَدِينَةَ";
nasai.urdu = "حضرت ابن عباسؓ سے مروی ہے کہ رسول اللہﷺ (بسا اوقات نفل) روزے مسلسل رکھتے حتیٰ کہ ہم کہتے تھے کہ آپ چھوڑیں گے نہیں اور پھر چھوڑنا شروع فرماتے حتیٰ کہ ہم کہتے: آپ رکھیں گے نہیں،جب سے آپ مدینہ تشریف لائے آپ نے کبھی بھی رمضان المبارک کے علاوہ ایک ماہ مسلسل روزے نہیں رکھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;