var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ النَّضْرِ بْنِ مُسَاوِرٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ مَرْوَانَ أَبِي لُبَابَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ مَا يُرِيدُ أَنْ يُفْطِرَ وَيُفْطِرُ حَتَّى نَقُولَ مَا يُرِيدُ أَنْ يَصُومَ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں: رسول اللہﷺ روزے رکھتے جاتے حتیٰ کہ ہم کہتے: آپ کسی بھی دن روزہ چھوڑنے کا ارادہ نہیں رکھتے۔اور پھر چھوڑنے لگتے حتیٰ کہ ہم کہتے: آپ کسی بھی دن روزہ رکھنے کا ارادہ نہیں رکھتے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;