var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ لَقَدْ رَأَيْتُنِي أُنَازِعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِنَاءَ أَغْتَسِلُ أَنَا وَهُوَ مِنْهُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے اپنے آپ کو دیکھا،میں اور اللہ کے رسول ﷺ غسل کرتے وقت برتن اپنی اپنی طرف کھینچتے تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;