var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ قَالَ حَدَّثَنَا سَعِيدٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ لَا أَعْلَمُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَلَا صَامَ شَهْرًا قَطُّ كَامِلًا غَيْرَ رَمَضَانَ";
nasai.urdu = "حضرت عائشہ ؓ بیان کرتی ہیں کہ میرے علم میں نہیں کہ نبیﷺ نے ایک رات میں سارا قرآن مجید پڑھا ہو یا ساری رات صبح تک نفل نماز پڑھتے رہے ہوں یا رمضان المبارک کے علاوہ کسی مہینے کے مکمل روزے رکھے ہوں۔";
nasai.hukam = "حسن";
nasai.description = ``;