var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي قَيْسٍ حَدَّثَهُ أَنَّهُ سَمِعَ عَائِشَةَ تَقُولُ كَانَ أَحَبَّ الشُّهُورِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَصُومَهُ شَعْبَانُ بَلْ كَانَ يَصِلُهُ بِرَمَضَانَ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ روزے رکھنے کے لیے رسول اللہﷺ کا سب سے زیادہ پسندیدہ مہینہ شعبان تھا۔بلکہ آپ تقریباً اسے رمضان المبارک سے ملا ہی دیتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;