var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي مَالِكٌ وَعَمْرُو بْنُ الْحَارِثِ وَذَكَرَ آخَرَ قَبْلَهُمَا أَنَّ أَبَا النَّضْرِ حَدَّثَهُمْ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ مَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ مَا يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ رسول اللہﷺ روزے رکھتے جاتے حتیٰ کہ ہم کہتے: آپ چھوڑیں گے نہیں۔اور آپ روزے چھوڑنے لگتے تو ہم کہتے: رکھیں گے نہیں،اور میں نے رسول اللہﷺ کو شعبان سے زیادہ کسی مہینے میں روزے رکھتے نہیں دیکھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;