var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ مَنْصُورٍ قَالَ سَمِعْتُ سَالِمَ بْنَ أَبِي الْجَعْدِ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلَّا شَعْبَانَ وَرَمَضَانَ";
nasai.urdu = "حضرت ام سلمہؓ سے روایت ہے کہ رسول اللہﷺ شعبان ورمضان کے علاوہ دو مہینے مسلسل روزے نہیں رکھتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;