var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْوَلِيدِ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ تَوْبَةَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ لَمْ يَكُنْ يَصُومُ مِنْ السَّنَةِ شَهْرًا تَامًّا إِلَّا شَعْبَانَ وَيَصِلُ بِهِ رَمَضَانَ";
nasai.urdu = "حضرت ام سلمہؓ سے مروی ہے کہ نبیﷺ شعبان کے علاوہ سال بھر کے کسی مہینے میں مکمل (نفل) روزے نہیں رکھتے تھے۔شعبان کو تو آپ تقریباً رمضان المبارک کے ساتھ ہی ملا دیتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;