var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِشَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ لِشَعْبَانَ كَانَ يَصُومُهُ أَوْ عَامَّتَهُ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں رسول اللہﷺشعبان سے زیادہ کسی مہینے میں روزے نہیں رکھتے تھے۔شعبان کے مہینے میں اپ اکثر روزے رکھا کرتے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;