var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ أَخْبَرَنِي ثَابِتُ بْنُ قَيْسٍ الْغِفَارِيُّ قَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْمَقْبُرِيُّ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْرُدُ الصَّوْمَ فَيُقَالُ لَا يُفْطِرُ وَيُفْطِرُ فَيُقَالُ لَا يَصُومُ";
nasai.urdu = "حضرت اسامہ بن زیدؓ سے روایت ہے کہ رسول اللہﷺ بسا اوقات لگاتار روزے رکھتے تھے حتیٰ کہ کہا جاتا: آپ چھوڑیں گے نہیں اور کبھی چھوڑنے لگتے حتیٰ کہ کہا جاتا: آپ رکھیں گے نہیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;