var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو نَصْرٍ التَّمَّارُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَاصِمٍ عَنْ سَوَاءٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ الِاثْنَيْنِ وَالْخَمِيسَ مِنْ هَذِهِ الْجُمُعَةِ وَالِاثْنَيْنِ مِنْ الْمُقْبِلَةِ";
nasai.urdu = "حضرت ام سلمہؓ سے مروی ہے کہ رسول اللہﷺ ہر مہینے میں تین دن روزہ رکھتے تھے: دو ایک ہفتے میں پیر اور جمعرات کو اور اگلے ہفتے کے پیر کو۔";
nasai.hukam = "صحیح";
nasai.description = ``;