var nasai = {};
nasai.arabic = "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا إِسْحَقُ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ أَنْبَأَنَا حَمَّادٌ عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ عَنْ سَوَاءٍ عَنْ حَفْصَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ كُلِّ شَهْرٍ يَوْمَ الْخَمِيسِ وَيَوْمَ الِاثْنَيْنِ وَمِنْ الْجُمُعَةِ الثَّانِيَةِ يَوْمَ الِاثْنَيْنِ";
nasai.urdu = "حضرت حفصہؓ فرماتی ہیں رسول اللہﷺ ہر مہینے جمعرات اور سوموار کو اور دوسرے جمعہ (ہفتے) سے سوموار کو روزہ رکھتے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;