var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ عَنْ عَاصِمٍ عَنْ الْمُسَيَّبِ عَنْ حَفْصَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ مَضْجَعَهُ جَعَلَ كَفَّهُ الْيُمْنَى تَحْتَ خَدِّهِ الْأَيْمَنِ وَكَانَ يَصُومُ الِاثْنَيْنِ وَالْخَمِيسَ";
nasai.urdu = "حضرت حفصہؓ سے منقول ہے،انھوں نے فرمایا: رسول اللہﷺ جب بستر پر لیٹتے تھے تو اپنا دایاں ہاتھ مبارک (ہتھیلی) اپنے دائیں رخسار کے نیچے رکھتے تھے اور سوموار اور جمعرات کا روزہ رکھا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;