var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَخْبَرَتْنِي خَالَتِي مَيْمُونَةُ أَنَّهَا كَانَتْ تَغْتَسِلُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما کہتے ہیں کہ مجھے میری خالہ،ام المومنین حضرت میمونہ رضی اللہ عنہا نے بتایا کہ بے شک وہ اور اللہ کے رسول ﷺ ایک ہی برتن سے غسل کر لیا کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;