var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ قَالَ أَبِي أَنْبَأَنَا أَبُو حَمْزَةَ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ ثَلَاثَةَ أَيَّامٍ مِنْ غُرَّةِ كُلِّ شَهْرٍ وَقَلَّمَا يُفْطِرُ يَوْمَ الْجُمُعَةِ";
nasai.urdu = "حضرت عبداللہ بن مسعودؓ سے مروی ہے کہ رسول اللہﷺ ہر مہینے کے شروع سے تین دن کا روزہ رکھتے تھے اور جمعۃ المبارک کے دن کم ہی روزہ چھوڑتے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;