var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو كَامِلٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ رَجُلٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ أَبِي هُرَيْرَةَ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَكْعَتَيْ الضُّحَى وَأَنْ لَا أَنَامَ إِلَّا عَلَى وِتْرٍ وَصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ الشَّهْرِ";
nasai.urdu = "حضرت ابوہریرہؓسے روایت ہے انھوں نے فرمایا: رسول اللہﷺ نے ضحی (چاشت) کی دو رکعتیں پڑھا کروں اور بغیر وتر پڑھے نہ سوؤں اور ہر مہینے میں تین روزے رکھوں۔";
nasai.hukam = "صحیح";
nasai.description = ``;