var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ وَسُئِلَ عَنْ صِيَامِ عَاشُورَاءَ قَالَ مَا عَلِمْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَامَ يَوْمًا يَتَحَرَّى فَضْلَهُ عَلَى الْأَيَّامِ إِلَّا هَذَا الْيَوْمَ يَعْنِي شَهْرَ رَمَضَانَ وَيَوْمَ عَاشُورَاءَ";
nasai.urdu = "حضرت عبیداللہ بیان کرتے ہیں کہ میں نے سنا جبکہ حضرت ابن عباسؓ سے عاشوراء کے روزے کے بارے میں پوچھا گیا،آپ نے فرمایا: میں تو نہیں جانتا کہ نبیﷺ نے کسی دن کو دوسرے دنوں سے افضل سمجھ کر اس کا روزہ رکھا ہو،سوائے اس دن کے،یعنی عاشوراء اور ماہ رمضان المبارک کے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;