var nasai = {};
nasai.arabic = "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا شَيْبَانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْحُرِّ بْنِ صَيَّاحٍ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنْ امْرَأَتِهِ قَالَتْ حَدَّثَتْنِي بَعْضُ نِسَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ يَوْمَ عَاشُورَاءَ وَتِسْعًا مِنْ ذِي الْحِجَّةِ وَثَلَاثَةَ أَيَّامٍ مِنْ الشَّهْرِ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ وَخَمِيسَيْنِ";
nasai.urdu = "حضرت ہنیدہ بن خالد کی زوجہ محترمہ سے روایت ہے،انھوں نے فرمایا: مجھ سے نبیﷺ کی کسی زوجہ محترمہ نے بیان فرمایا کہ نبیﷺ عاشورائِ محرم،ذوالحجہ کے پہلے نو دن اور ہر مہینے کے تین دن،مہینے کا پہلا سوموار اور دو ابتدائی جمعراتیں روزہ رکھا کرتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;