var nasai = {};
nasai.arabic = "حَدَّثَنَا عِيسَى بْنُ مُسَاوِرٍ عَنْ الْوَلِيدِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ أَخْبَرَنِي عَطَاءٌ عَنْ عَبْدِ اللَّهِ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنَا عَطَاءٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ الْأَبَدَ فَلَا صَامَ وَلَا أَفْطَرَ";
nasai.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’۔جس نے ہمیشہ روزہ رکھا،تو (ایسے سمجھو کہ) اس نے نہ روزہ رکھا اور نہ افطار کیا (وہ بے روزہ رہا)۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;