var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ،قَالَ: حَدَّثَنَا ابْنُ عَائِذٍ،قَالَ: حَدَّثَنَا يَحْيَى،عَنْ الْأَوْزَاعِيِّ،عَنْ عَطَاءٍ،أَنَّهُ حَدَّثَهُ،قَالَ: حَدَّثَنِي مَنْ،سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ الْأَبَدَ فَلَا صَامَ،وَلَا أَفْطَرَ»";
nasai.urdu = "حضرت عبداللہ بن عمرو بن عاصؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جس نے ہر روز روزہ رکھا،اس نے روزہ رکھا،نہ چھوڑا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;