var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ الْجُرَيْرِيِّ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَخِيهِ مُطَرِّفٍ عَنْ عِمْرَانَ قَالَ قِيلَ يَا رَسُولَ اللَّهِ إِنَّ فُلَانًا لَا يُفْطِرُ نَهَارًا الدَّهْرَ قَالَ لَا صَامَ وَلَا أَفْطَرَ";
nasai.urdu = "حضرت عمران رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ کو بتلایا گیا: فلاں شخص کبھی بھی روزے سے ناغہ نہیں کرتا۔آپ نے فرمایا: ’۔نہ اس نے روزہ رکھا اور نہ چھوڑا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;