var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مَخْلَدٌ عَنْ الْأَوْزَاعِيِّ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ أَخْبَرَنِي أَبِي أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذُكِرَ عِنْدَهُ رَجُلٌ يَصُومُ الدَّهْرَ قَالَ لَا صَامَ وَلَا أَفْطَرَ";
nasai.urdu = "حضرت عبداللہ بن شخیر رضی اللہ عنہ سے روایت ہے،انھوں نے رسول اللہﷺ سے سنا جب آپ کے پاس ایک آدمی کا ذکر ہوا جو بلا ناغہ روزے رکھا کرتا تھا۔آپ نے فرمایا: ’’اس نے نہ روزہ رکھا اور نہ چھوڑا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;