var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ يُحَدِّثُ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي صَوْمِ الدَّهْرِ لَا صَامَ وَلَا أَفْطَرَ";
nasai.urdu = "حضرت عبداللہ بن شخیر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے ہمیشہ روزہ رکھنے (والے) کے بارے میں فرمایا: ’’اس نے نہ روزہ رکھا اور نہ چھوڑا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;