var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ أَنْبَأَنَا أَبُو هِلَالٍ قَالَ حَدَّثَنَا غَيْلَانُ وَهُوَ ابْنُ جَرِيرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ مَعْبَدٍ الزِّمَّانِيُّ عَنْ أَبِي قَتَادَةَ عَنْ عُمَرَ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَرْنَا بِرَجُلٍ فَقَالُوا يَا نَبِيَّ اللَّهِ هَذَا لَا يُفْطِرُ مُنْذُ كَذَا وَكَذَا فَقَالَ لَا صَامَ وَلَا أَفْطَرَ";
nasai.urdu = "حضرت عمرؓ بیان کرتے ہیں کہ ہم رسول اللہﷺ کے ساتھ تھے کہ ہم ایک آدمی کے پاس سے گزرے۔لوگوں نے کہا: اے اللہ کے نبی! یہ شخص اتنے عرصے سے روزے کا ناغہ نہیں کر رہا۔آپ نے فرمایا: ’’نہ اس نے روزہ رکھا اور نہ چھوڑا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;