var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ حَمْزَةَ بْنَ عَمْرٍو الْأَسْلَمِيَّ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصَّوْمَ أَفَأَصُومُ فِي السَّفَرِ قَالَ صُمْ إِنْ شِئْتَ أَوْ أَفْطِرْ إِنْ شِئْتَ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ حضرت حمزہ بن عمرو اسلمی رضی اللہ عنہ نے رسول اللہﷺ سے پوچھا: اے اللہ کے رسول! میں لگاتار روزے رکھتا ہوں تو کیا سفر میں بھی رکھ لیا کروں؟ آپ نے فرمایا: ’’اگر تو چاہے تو رکھ لے اور اگر چاہے تو نہ رکھ۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;