var nasai = {};
nasai.arabic = "قَالَ وَفِيمَا قَرَأَ عَلَيْنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا حُصَيْنٌ وَمُغِيرَةُ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصِّيَامِ صِيَامُ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا";
nasai.urdu = "حضرت عبداللہ بن عمروؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’افضل ترین روزے داؤدعلیہ السلام کے روزے ہیں۔وہ ایک دن روزہ رکھتے اور ایک دن ناغہ فرماتے تھے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;