var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ أَنْبَأَنَا أَبُو إِسْمَعِيلَ وَهُوَ الْقَنَّادُ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ حَدَّثَهُ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا بَالَ أَحَدُكُمْ فَلَا يَأْخُذْ ذَكَرَهُ بِيَمِينِهِ";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’جب تم میں سے کوئی پیشاب کرے تو اپنے عضو تناسل (شرم گاہ) کو دائیں ہاتھ سے نہ پکڑے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;