var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي ذَرٍّ قَالَ أَوْصَانِي حَبِيبِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثَةٍ لَا أَدَعُهُنَّ إِنْ شَاءَ اللَّهُ تَعَالَى أَبَدًا أَوْصَانِي بِصَلَاةِ الضُّحَى وَبِالْوَتْرِ قَبْلَ النَّوْمِ وَبِصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ";
nasai.urdu = "حضرت ابو ذر رضی اللہ عنہ فرماتے ہیں کہ مجھے میرے پیارے حبیبﷺ نے تین باتوں کی نصیحت فرمائی اور ان شاء اللہ تعالیٰ میں انھیں کبھی نہیں چھوڑوں گا: مجھے نصیحت فرمائی کہ صلاۃ ضحی پڑھا کروں،وتر پڑھ کر سوؤں اور ہر مہینے سے تین روزے رکھوں۔";
nasai.hukam = "صحیح";
nasai.description = ``;