var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ قَالَ سَمِعْتُ أَبِي قَالَ أَنْبَأَنَا أَبُو حَمْزَةَ عَنْ عَاصِمٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ أَبِي هُرَيْرَةَ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ بِنَوْمٍ عَلَى وِتْرٍ وَالْغُسْلِ يَوْمَ الْجُمُعَةِ وَصَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ";
nasai.urdu = "حضرت ابوہریرہؓ فرماتے ہیں کہ مجھے رسول اللہﷺ نے تین چیزوں کا حکم دیا: وتر پڑھ کر سونا۔جمعۃ المبارک کے دن غسل کرنا اور ہر مہینے سے تین دن روزے رکھنا۔";
nasai.hukam = "حسن";
nasai.description = ``;