var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَوْمٍ عَلَى وَتْرٍ وَالْغُسْلِ يَوْمَ الْجُمُعَةِ وَصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ";
nasai.urdu = "حضرت ابوہریرہؓ سے مروی ہے کہ رسول اللہﷺ نے مجھے وتر پڑھ کر سونے،جمعۃ المبارک کے دن غسل کرنے اور ہر مہینے سے تین دن روزے رکھنے کا حکم دیا";
nasai.hukam = "حسن";
nasai.description = ``;