var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْحَسَنِ اللَّانِيُّ بِالْكُوفَةِ عَنْ عَبْدِ الرَّحِيمِ وَهُوَ ابْنُ سُلَيْمَانَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ ثَلَاثَةَ أَيَّامٍ مِنْ الشَّهْرِ فَقَدْ صَامَ الدَّهْرَ كُلَّهُ ثُمَّ قَالَ صَدَقَ اللَّهُ فِي كِتَابِهِ مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا(الانعام:160)";
nasai.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص ہر مہینے تین روزے رکھے تو یوں سمجھو اس نے زمانہ بھر کے روزے رکھ لیے۔‘‘ پھر فرمایا: ’۔اللہ تعالیٰ نے اپنی کتاب قرآن مجید میں سچ فرمایا ہے: مَنْ جَآئَ بِالْحَسَنَۃِ فَلَہٗ عَشْرُ أَمْثَالِھَا ’’جو شخص نیکی کرے گا اسے (اس نیکی کا) دس گنا ثواب دیا جائے گا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف<br>ترمذی (762) ابن ماجہ (1708)`;
nasai.anwaar = [339,1];