var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ رَجُلٍ قَالَ أَبُو ذَرٍّ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَامَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ فَقَدْ تَمَّ صَوْمُ الشَّهْرِ أَوْ فَلَهُ صَوْمُ الشَّهْرِ شَكَّ عَاصِمٌ";
nasai.urdu = "حضرت ابو ذر رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ ﷺ نے فرماتے سنا: ’’جو شخص ہر مہینے سے تین روزے رکھے تو گویا مہینے بھر کے روزے ہوگئے (یا اسے مہینے بھر کے روزوں کا ثواب ملے گا)۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف<br>رجل: مجھول`;
nasai.anwaar = [339,1];