var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ أَنَّ مُطَرِّفًا حَدَّثَهُ أَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ صِيَامٌ حَسَنٌ ثَلَاثَةُ أَيَّامٍ مِنْ الشَّهْرِ";
nasai.urdu = "حضرت عثمان بن ابی العاص رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’اچھے روزے ہر ماہ میں تین روزے ہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;