var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ شَرِيكٍ عَنْ الْحُرِّ بْنِ صَيَّاحٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ يَوْمَ الِاثْنَيْنِ مِنْ أَوَّلِ الشَّهْرِ وَالْخَمِيسِ الَّذِي يَلِيهِ ثُمَّ الْخَمِيسِ الَّذِي يَلِيهِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ ہر ماہ تین دن روزہ رکھا کرتے تھے۔مہینے کی پہلی سوموار اور جمعرات کو اور پھر اگلی جمعرات کو۔";
nasai.hukam = "حسن";
nasai.description = ``;