var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا خَلَفُ بْنُ تَمِيمٍ عَنْ زُهَيْرٍ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ قَالَ سَمِعْتُ هُنَيْدَةَ الْخُزَاعِيَّ قَالَ دَخَلْتُ عَلَى أُمِّ الْمُؤْمِنِينَ سَمِعْتُهَا تَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ ثُمَّ الْخَمِيسَ ثُمَّ الْخَمِيسَ الَّذِي يَلِيهِ";
nasai.urdu = "حضرت ہنیدہ خزاعی سے روایت ہے کہ میں ام المومنین (حضرت حفصہ رضی اللہ عنہا) کی خدمت میں حاضر ہوا۔میں نے سنا آپ فرما رہی تھیں: رسول اللہ ﷺ ہر ماہ تین دن روزہ رکھا کرتے تھے: مہینے کی پہلی سوموار کو،پھر جمعرات کو،پھر اگلی جمعرات کو۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;