var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ قَالَ حَدَّثَنِي أَبُو النَّضْرِ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ الْأَشْجَعِيُّ كُوفِيٌّ عَنْ عَمْرِو بْنِ قَيْسٍ الْمُلَائِيِّ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ الْخُزَاعِيِّ عَنْ حَفْصَةَ قَالَتْ أَرْبَعٌ لَمْ يَكُنْ يَدَعُهُنَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِيَامَ عَاشُورَاءَ وَالْعَشْرَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَيْنِ قَبْلَ الْغَدَاةِ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا فرماتی ہیں کہ چار کام نبی ﷺ کبھی نہیں چھوڑتے تھے: عاشوراء (۱۰محرم) کا روزہ،ذوالحجہ کے پہلے عشرے (یعنی نو دن) کے روزے،ہر مہینے سے تین دن کے روزے اور نماز فجر سے پہلے دو رکعتیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أبو إسحاق الأشجعي: لم أجد من وثقہ،والحدیث الآتي (2419) یغني عن حدیثہ۔`;
nasai.anwaar = [339,1];