var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى عَنْ أَبِي نُعَيْمٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنْ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ تِسْعًا مِنْ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ وَخَمِيسَيْنِ";
nasai.urdu = "نبی ﷺ کی کسی زوجہ محترمہ سے روایت ہے کہ رسول اللہ ﷺ ذوالحجہ کے نو دن،عاشوراء کے دن اور ہر مہینے سے تین دن (یعنی پہلا سوموار اور اس کے بعد والی دو جمعراتیں) روزہ رکھتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;