var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ أَبِي صَفْوَانَ الثَّقَفِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنْ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ الْعَشْرَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ الِاثْنَيْنِ وَالْخَمِيسَ";
nasai.urdu = "نبی ﷺ کی کوئی زوجہ محترمہ بیان کرتی ہیں کہ نبی ﷺ عشرہ ذوالحجہ (یعنی نو دن) اور ہر مہینے سے تین دن روزہ رکھتے تھے: (پہلا) سوموار کو اور اس کے بعد جمعرات کو (یعنی دو جمعراتیں)۔";
nasai.hukam = "حسن";
nasai.description = ``;