var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ عَنْ هُنَيْدَةَ الْخُزَاعِيِّ عَنْ أُمِّهِ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِصِيَامِ ثَلَاثَةِ أَيَّامٍ أَوَّلِ خَمِيسٍ وَالِاثْنَيْنِ وَالِاثْنَيْنِ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ (ہر مہینے میں) تین دن کے روزوں کا حکم دیتے تھے،یعنی مہینے کی پہلی جمعرات اور دو سوموار۔";
nasai.hukam = "صحیح";
nasai.description = ``;