var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَخْلَدُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ أَبِي إِسْحَقَ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صِيَامُ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صِيَامُ الدَّهْرِ وَأَيَّامُ الْبِيضِ صَبِيحَةَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ";
nasai.urdu = "حضرت جریر بن عبداللہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’ہر مہینے تین روزے رکھنا (ثواب کے لحاظ سے) زمانے بھر کے روزوں کے برابر ہے۔اور ایام بیض (چمکتی راتوں والے دن) تیرہ،چودہ اور پندرہ ہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;