var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى عَنْ فِطْرٍ عَنْ يَحْيَى بْنِ سَامٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِي ذَرٍّ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَصُومَ مِنْ الشَّهْرِ ثَلَاثَةَ أَيَّامٍ الْبِيضَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ";
nasai.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ہمیں حکم دیا کہ ہم ہر مہینے میں ایام بیض (روشن راتوں کے دنوں) کے تین روزے رکھا کریں،یعنی (چاند کی) تیرہ،چودہ اور پندرہ تاریخ کو۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;