var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَامٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِي ذَرٍّ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَصُومَ مِنْ الشَّهْرِ ثَلَاثَةَ أَيَّامٍ الْبِيضَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ";
nasai.urdu = "حضرت ابوذر رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ ﷺ نے ہمیں ہر ماہ تین روشن (راتوں کے) دنوں کے روزے رکھنے کا حکم دیا،یعنی تیرہ چودہ اور پندرہ کو۔";
nasai.hukam = "حسن";
nasai.description = ``;