var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَامٍ عَنْ مُوسَى بْنِ طَلْحَةَ قَالَ سَمِعْتُ أَبَا ذَرٍّ بِالرَّبَذَةِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صُمْتَ شَيْئًا مِنْ الشَّهْرِ فَصُمْ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ";
nasai.urdu = "حضرت موسیٰ بن طلحہ بیان کرتے ہیں کہ میں نے ربذہ بستی میں حضرت ابوذر رضی اللہ عنہ سے سنا،وہ فرما رہے تھے کہ مجھ سے رسول اللہ ﷺ نے فرمایا: ’’جب تو مہینے میں کچھ دنوں کے روزے رکھے تو (چاند کی) تیرہ،چودہ اور پندرہ تاریخ کو رکھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;