var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا رَجُلَانِ مُحَمَّدٌ وَحَكِيمٌ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ ابْنِ الْحَوْتَكِيَّةِ عَنْ أَبِي ذَرٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ رَجُلًا بِصِيَامِ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ";
nasai.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے ایک آدمی کو تیرہ،چودہ اور پندرہ تاریخ کے روزے رکھنے کا حکم دیا۔";
nasai.hukam = "حسن";
nasai.description = ``;