var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَنْبَأَنَا أَنَسُ بْنُ سِيرِينَ عَنْ رَجُلٍ يُقَالُ لَهُ عَبْدُ الْمَلِكِ يُحَدِّثُ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِهَذِهِ الْأَيَّامِ الثَّلَاثِ الْبِيضِ وَيَقُولُ هُنَّ صِيَامُ الشَّهْرِ";
nasai.urdu = "حضرت عبدالملک اپنے والد سے بیان کرتے ہیں کہ رسول اللہ ﷺ چاندنی راتوں والے تین دنوں کے روزے رکھنے کا حکم دیتے تھے اور فرماتے تھے: ’’یہ تین روزے (ثواب کے لحاظ سے) مہینے بھر کے روزوں کے برابر ہیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2449) ابن ماجہ (1707)`;
nasai.anwaar = [339,1];