var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ أَنَسِ بْنِ سِيرِينَ قَالَ سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ أَبِي الْمِنْهَالِ يُحَدِّثُ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُمْ بِصِيَامِ ثَلَاثَةِ أَيَّامٍ الْبِيضِ قَالَ هِيَ صَوْمُ الشَّهْرِ";
nasai.urdu = "حضرت عبدالملک بن ابومنہال اپنے والد سے بیان کرتے تھے کہ نبی ﷺ نے صحابہ کرامؓ کو چاندنی راتوں والے تین دنوں کے روزے رکھنے کا حکم دیا۔اور فرمایا: ’’یہ مہینے بھر کے روزوں کے برابر ہیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (2432)`;
nasai.anwaar = [339,1];