var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ قَالَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ قُدَامَةَ بْنِ مِلْحَانَ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِصَوْمِ أَيَّامِ اللَّيَالِي الْغُرِّ الْبِيضِ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ";
nasai.urdu = "حضرت عبدالملک بن قدامہ بن ملحان نے اپنے والد سے بیان کیا کہ رسول اللہ ﷺ ہمیں چاندنی راتوں والے دنوں کے روزوں کا حکم دیا کرتے تھے،یعنی (چاند کی) تیرہ،چودہ اور پندرہ (تاریخ) کا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (2432)`;
nasai.anwaar = [340,1];