var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسَةِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’پانچ اونٹوں سے کم میں زکاۃ نہیں اور پانچ اوقیے سے کم (چاندی یا رقم میں زکاۃ نہیں اور پانچ وسق سے کم غلے میں زکاۃ نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;