var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا مُفَضَّلٌ وَهُوَ ابْنُ مُهَلْهَلٍ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ إِلَى الْيَمَنِ وَأَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ وَمِنْ الْبَقَرِ مِنْ ثَلَاثِينَ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً";
nasai.urdu = "حضرت معاذ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے انھیں (مجھے) یمن کی طرف (حاکم بنا کر) بھیجا اور حکم دیا کہ ہر غیر مسلم بالغ سے ایک دینار (بطور جزیہ) لوں یا اس کے برابر معافری کپڑا۔اور ہر تیس گایوں میں سے تبعیۃ (دوسرے سال میں داخل بچھڑا یا بچھڑی) اور ہر چالیس گایوں میں سے دو دانت والا بچھڑایا بچھڑی (بطور زکاۃ) وصول کروں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1578) ترمذی (623) ابن ماجہ (1803)`;
nasai.anwaar = [340,1];