var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَعْلَى وَهُوَ ابْنُ عُبَيْدٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ وَالْأَعْمَشُ عَنْ إِبْرَاهِيمَ قَالَا قَالَ مُعَاذٌ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ أَرْبَعِينَ بَقَرَةً ثَنِيَّةً وَمِنْ كُلِّ ثَلَاثِينَ تَبِيعًا وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ";
nasai.urdu = "حضرت معاذ رضی اللہ عنہ فرماتے ہیں کہ مجھے رسول اللہ ﷺ نے یمن کی طرف (حاکم بنا کر بھیجا اور مجھے حکم دیا کہ میں ہر چالیس گایوں میں سے ایک دو سالہ (دو دانتا اور ہر تیس میں سے ایک سالہ بچھڑا یا بچھڑی زکاۃ وصول کروں،نیز ہر بالغ (یہودی وغیرہ سے ایک دینار یا اس کے برابر یمنی کپڑا (بطور جزیہ وصول کروں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1578) ترمذی (623) ابن ماجہ (1803)`;
nasai.anwaar = [340,1];