var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ قَالَ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ أَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ ثَلَاثِينَ مِنْ الْبَقَرِ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ";
nasai.urdu = "حضرت معاذ رضی اللہ عنہ سے مروی ہے کہ جب رسول اللہ ﷺ نے انھیں (مجھے یمن کی طرف بھیجا تو حکم دیا کہ ہر تیس گایوں میں سے ایک سالہ بچھڑا یا بچھڑی اور ہر چالیس گایوں میں سے ایک دو سالہ (دو دانتا وصول کروں اور ہر (غیر مسلم بالغ سے ایک دینار یا اس کے برابر معافری کپڑا (بطور جزیہ وصول کروں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1578) ترمذی (623) ابن ماجہ (1803)`;
nasai.anwaar = [340,1];