var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ عَمْرُو بْنُ مُرَّةَ أَخْبَرَنِي قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ اللَّهُمَّ صَلِّ عَلَى آلِ فُلَانٍ فَأَتَاهُ أَبِي بِصَدَقَتِهِ فَقَالَ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى";
nasai.urdu = "حضرت عبداللہ بن ابی اوفی رضی اللہ عنہ بیان کرتے ہیں کہ جب رسول اللہ ﷺ کے پاس کوئی قوم اپنے مالوں کی زکاۃ لے کر آتی تو آپ فرماتے ہیں: ’’اے اللہ! فلاں کی آل پر رحمت نازل فرما۔‘‘ میرے والد محترم آپ کے پاس اپنی زکاۃ لے کر گئے تو آپ نے فرمایا: ’’اے اللہ! ابو اوفیٰ کے خاندان پر رحمت نازل فرما۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;