var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ أُمَيَّةَ عَنْ مَكْحُولٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا زَكَاةَ عَلَى الرَّجُلِ الْمُسْلِمِ فِي عَبْدِهِ وَلَا فَرَسِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مسلمان آدمی پر اس کے (خدمت والے غلام اور (سواری والے گھوڑے میں کوئی زکاۃ نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;