var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى عَنْ مَكْحُولٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ يَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ نے نبی ﷺ کی طرف منسوب کرتے ہوئے کہا کہ آپ نے فرمایا: ’’مسلمان پر اس کے غلام اور گھوڑے میں کوئی زکاۃ نہیں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;