var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ عَنْ حَمَّادٍ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ صَدَقَةٌ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’پانچ اوقیوں سے کم چاندی میں زکاۃ نہیں۔نہ پانچ اونٹوں سے کم میں صدقہ ہے۔اسی طرح پانچ وسق سے کم غلے میں بھی صدقہ (عشر نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;