var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الْمَازِنِيُّ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ مِنْ التَّمْرِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنْ الْإِبِلِ صَدَقَةٌ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’پانچ وسق سے کم کھجوروں (یا دوسرے غلہ جات میں کوئی صدقہ (عشر نہیں اور نہ پانچ اوقیوں سے کم چاندی میں زکاۃ ہے اور نہ پانچ اونٹوں سے کم میں زکاۃ ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;