var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عَفَوْتُ عَنْ الْخَيْلِ وَالرَّقِيقِ فَأَدُّوا زَكَاةَ أَمْوَالِكُمْ مِنْ كُلِّ مِائَتَيْنِ خَمْسَةً";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’میں نے گھوڑوں اور غلاموں کی زکاۃ معاف کر دی ہے۔اب تم اپنے مال (سونا،چاندی اور رقم کی زکاۃ دو سو درہم میں سے پانچ درہم ادا کرو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1574) ترمذی (620) ابن ماجہ (1790)`;
nasai.anwaar = [340,1];