var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عَفَوْتُ عَنْ الْخَيْلِ وَالرَّقِيقِ وَلَيْسَ فِيمَا دُونَ مِائَتَيْنِ زَكَاةٌ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’میں نے (سواری کے گھوڑوں اور (خدمت کے غلاموں میں زکاۃ معاف کر دی ہے،نیز دو سو درہم سے کم میں زکاۃ نہیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1574) ترمذی (620) ابن ماجہ (1790)`;
nasai.anwaar = [340,1];