var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ مِنْ حَبٍّ أَوْ تَمْرٍ صَدَقَةٌ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’پانچ وسق سے کم کسی بھی غلے میں یا کھجور میں زکاۃ نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;