var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِي حَبٍّ وَلَا تَمْرٍ صَدَقَةٌ حَتَّى تَبْلُغَ خَمْسَةَ أَوْسُقٍ وَلَا فِيمَا دُونَ خَمْسٍ ذَوْدٍ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’کسی دانے (غلے اور کھجور میں زکاۃ نہیں حتیٰ کہ وہ پانچ وسق ہو جائیں۔اور پانچ اونٹوں سے کم میں اور پانچ اوقیوں سے کم چاندی میں بھی زکاۃ نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;