var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ يَحْيَى بْنِ سَعِيدٍ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے مروی ہے،نبی ﷺ نے فرمایا: ’’پانچ اوقیوں (۲۰۰ درہم سے کم چاندی میں زکاۃ نہیں،نہ پانچ اونٹوں سے کم میں زکاۃ ہے اور نہ پانچ وسق سے کم غلے میں زکاۃ ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;