var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا يَحْيَى قَالَ أَنْبَأَنَا هِشَامُ بْنُ عُرْوَةَ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا عَنْ غُسْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ أَنَّهُ كَانَ يَغْسِلُ يَدَيْهِ وَيَتَوَضَّأُ وَيُخَلِّلُ رَأْسَهُ حَتَّى يَصِلَ إِلَى شَعْرِهِ ثُمَّ يُفْرِغُ عَلَى سَائِرِ جَسَدِهِ";
nasai.urdu = "حضرت عمروہ بیان کرتے ہیں کہ مجھے حضرت عائشہ رضی اللہ عنہا نے نبی ﷺ کے غسل جنابت کی بابت بیان کیا کہ آپ ﷺ (سب سے پہلے) اپنے ہاتھ دھوتے تھے اور وضو فرماتے اور اپنے سر کے بالوں میں (گیلی) انگلیاں پھیرتے تھے،(حتی کہ بال گیلے ہو جاتے) پھر اپنے سارے جسم پر پانی بہاتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;