var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ سَعِيدِ بْنِ الْهَيْثَمِ أَبُو جَعْفَرٍ الْأَيْلِيُّ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا سَقَتْ السَّمَاءُ وَالْأَنْهَارُ وَالْعُيُونُ أَوْ كَانَ بَعْلًا الْعُشْرُ وَمَا سُقِيَ بِالسَّوَانِي وَالنَّضْحِ نِصْفُ الْعُشْرِ";
nasai.urdu = "حضرت سالم اپنے والد (حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’جس فصل کو بارش،نہریں یا چشمے سیراب کریں یا وہ نمی والی ہو،اس میں دسواں حصہ زکاۃ واجب ہے۔اور جس فصل کو اونٹوں اور ڈول (راہٹ وغیرہ کے ذریعے سے سیراب کیا جائے،اس میں بیسواں حصہ زکاۃ واجب ہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;