var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو وَأَحْمَدُ بْنُ عَمْرٍو وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا الزُّبَيْرِ حَدَّثَهُ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا سَقَتْ السَّمَاءُ وَالْأَنْهَارُ وَالْعُيُونُ الْعُشْرُ وَفِيمَا سُقِيَ بِالسَّانِيَةِ نِصْفُ الْعُشْرِ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس فصل کو بارش،نہریں اور چشمے سیراب کریں،اس میں دسواں حصہ زکاۃ ہے۔اور جس فصل کو اونٹوں کے ذریعے سے سیراب کیا جائے،س میں بیسواں حصہ ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;