var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرٍ وَهُوَ ابْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ مُعَاذٍ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِمَّا سَقَتْ السَّمَاءُ الْعُشْرَ وَفِيمَا سُقِيَ بِالدَّوَالِي نِصْفَ الْعُشْرِ";
nasai.urdu = "حضرت معاذ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مجھے یمن کی طرف (حاکم بنا کر بھیجا تو مجھے حکم دیا کہ میں بارش سے سیراب ہونے والی فصل میں سے دسواں حصہ اور ڈول وراہٹ کے ذریعے سے سیراب ہونے والی فصل سے بیسواں حصہ زکاۃ وصول کروں۔";
nasai.hukam = "حسن";
nasai.description = ``;