var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جُرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جانور کا لگایا ہوا زخم رائیگاں ہے اور کنویں کی وجہ سے ہونے والا نقصان رائیگاں ہے۔اور معدنی کان کی وجہ سے ہونے والا نقصان بھی رائیگاں ہے اور مدفون خزانہ (ملنے کی صورت) میں پانچواں حصہ (بیت المال کا) ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;