var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ هِشَامٍ عَنْ يَحْيَى هُوَ ابْنُ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ أَحَدُكُمْ الْخَلَاءَ فَلَا يَمَسَّ ذَكَرَهُ بِيَمِينِهِ";
nasai.urdu = "حضرت ابو قتادہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’جب تم میں سے کوئی بیت الخلا میں داخل ہو تو اپنے عضو تناسل کو دایاں ہاتھ نہ لگائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;