var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُشَرِّبُ رَأْسَهُ ثُمَّ يَحْثِي عَلَيْهِ ثَلَاثًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ (پہلے) اپنے سر کے بالوں کو خلال سے اچھی طرح تر کر لیتے تھے،پھر سر پر تین چلو (پانی) ڈالتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;