var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا مَنْصُورٌ وَهِشَامٌ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبِئْرُ جُبَارٌ وَالْعَجْمَاءُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’کنویں کی وجہ سے ہونے والا نقصان رائیگاں ہے،جانور کا لگایا ہوا زخم رائیگاں ہے اور کان (معدنی) کی وجہ سے ہونے والا نقصان بھی رائیگاں ہے،اور مدفون شدہ خزانہ (مل جائے تو اس) میں سے پانچواں حصہ (بیت المال کا) ہوگا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;