var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى عَنْ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ رَمَضَانَ عَلَى الْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالْأُنْثَى صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ فَعَدَلَ النَّاسُ بِهِ نِصْفَ صَاعٍ مِنْ بُرٍّ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے رمضان المبارک کا صدقہ (صدقۃ الفطر) ہر آزاد،غلام،مذکر اور مؤنث پر کھجور اور جو کا ایک صاع مقرر فرمایا تھا۔بعد میں لوگوں نے اس کی جگہ گندم کا نصف صاع ٹھہرا لیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;