var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ رَمَضَانَ عَلَى كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ وَعَبْدٍ ذَكَرٍ وَأُنْثَى صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے رمضان کی زکاۃ (صدقۃ الفطر) ہر چھوٹے،بڑے،آزاد،غلام اور مذکر ومونث پر کھجور اور جو کا ایک صاع مقرر فرمایا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;