var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَةَ الْفِطْرِ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالذَّكَرِ وَالْأُنْثَى وَالْحُرِّ وَالْعَبْدِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے صدقۃ الفطر ہر چھوٹے،بڑے،مذکر،مؤنث،آزاد اور غلام پر کھجور اور جو سے ایک صاع فرض (مقرر) کیا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;