var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَ قَالَ كُنَّا نَصُومُ عَاشُورَاءَ وَنُؤَدِّي زَكَاةَ الْفِطْرِ فَلَمَّا نَزَلَ رَمَضَانُ وَنَزَلَتْ الزَّكَاةُ لَمْ نُؤْمَرْ بِهِ وَلَمْ نُنْهَ عَنْهُ وَكُنَّا نَفْعَلُهُ";
nasai.urdu = "حضرت قیس بن سعد بن عبادہ سے مروی ہے کہ ہم عاشوراء (۱۰ محرم الحرام) کا روزہ رکھتے تھے اور صدقۃ الفطر ادا کیا کرتے تھے۔جب رمضان المبارک کے روزوں اور زکاۃ کی فرضیت نازل ہوئی تونہ ہمیں اس کا نیا حکم دیا گیا اور نہ اس سے روکا گیا۔ویسے ہم یہ کام کرتے رہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;