var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ تَمَارَوْا فِي الْغُسْلِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ الْقَوْمِ إِنِّي لَأَغْسِلُ كَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنَا فَأُفِيضُ عَلَى رَأْسِي ثَلَاثَ أَكُفٍّ";
nasai.urdu = "حضرت جبیر بن مطعم رضی اللہ عنہ سے مروی ہے کہ کچھ لوگوں نے اللہ کے رسول ﷺ کے پاس غسل کے بارے میں اختلاف کیا۔کسی نے کہا کہ میں تو اتنی اتنی دفعہ (سر کو) دھوتا ہوں،چنانچہ رسول اللہ ﷺ نے فرمایا: ’’میں تو اپنے سر پر صرف تین چلو پانی بہاتا ہوں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;