var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي رَجَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَخْطُبُ عَلَى مِنْبَرِكُمْ يَعْنِي مِنْبَرَ الْبَصْرَةِ يَقُولُ صَدَقَةُ الْفِطْرِ صَاعٌ مِنْ طَعَامٍ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا أَثْبَتُ الثَّلَاثَةِ";
nasai.urdu = "حضرت ابو رجاء سے روایت ہے انھوں نے کہا: میں نے حضرت ابن عباس رضی اللہ عنہ کو تمہارے،یعنی بصرے کے منبر پر خطبہ ارشاد فرماتے سنا کہ صدقۃ الفطر ہر کھائی جانے والی چیز سے ایک صاع ہے۔\nامام ابوعبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ (اس حدیث کا راوی ایوب) تینوں میں سے زیادہ قوی ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;