var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ أُمَيَّةَ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ أَقِطٍ";
nasai.urdu = "حضرت ابو سعید خدریؓ فرماتے ہیں: رسول اللہﷺ نے صدقۃ الفطر جو،خشک کھجور یا پنیر سے ایک صاع مقرر فرمایا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;