var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ قَالَ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ أَقِطٍ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ جب رسول اللہﷺ ہم میں موجود تھے تو ہم صدقۃ الفطر طعام (گندم یا ہر خوراک والا غلہ) جو،خشک کھجور،کشمش یا پنیر سے ایک صاع دیا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;