var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ قَالَ سَمِعْتُ عِيَاضَ بْنَ عَبْدِ اللَّهِ يُخْبِرُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ لَمْ نُخْرِجْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ دَقِيقٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ سُلْتٍ ثُمَّ شَكَّ سُفْيَانُ فَقَالَ دَقِيقٍ أَوْ سُلْتٍ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ کے دورِ مبارک میں ہم کھجور،جَو،کشمش،آٹا،پنیر یا سلت وغیرہ سے ایک صاع ہی (صدقۃ الفطر) دیتے تھے،پھر راوی سفیان کو شک ہوا اور انھوں نے کہا: آٹا یا سلت۔";
nasai.hukam = "صحیح";
nasai.description = ``;