var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُثْمَانَ أَنَّ عِيَاضَ بْنَ عَبْدِ اللَّهِ بْنِ سَعْدٍ حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ كُنَّا نُخْرِجُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ أَقِطٍ لَا نُخْرِجُ غَيْرَهُ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ فرماتے ہیں کہ ہم رسول اللہ ﷺ کے دور میں (صدقۃ الفطر) کھجور یا جو یا پنیر سے ایک صاع ہی دیا کرتے تھے۔ہم ان کے علاوہ اور کوئی چیز نہ دیا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;