var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا الْقَاسِمُ وَهُوَ ابْنُ مَالِكٍ عَنْ الْجُعَيْدِ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ قَالَ كَانَ الصَّاعُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُدًّا وَثُلُثًا بِمُدِّكُمْ الْيَوْمَ وَقَدْ زِيدَ فِيهِ قَالَ أَبُو عَبْد الرَّحْمَنِ و حَدَّثَنِيهِ زِيَادُ بْنُ أَيُّوبَ";
nasai.urdu = "حضرت سائب بن یزید بیان کرتے ہیں کہ رسول اللہﷺ کے دور میں صاع تمھارے آج کل کے حساب سے ایک مد اور ایک تہائی مد کے برابر تھا۔اب اس (مد کی مقدار) میں اضافہ کر دیا گیا ہے۔\nامام ابوعبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ مجھے یہ حدیث زیاد بن ایوب نے بھی بیان کی ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `2/ إسنادہ ضعیف<br>الثوری عنعن فی حدیث: ’’المکیال مکیال أھل المدینۃ‘‘<br>ابو داود (3340) وانظر الحدیث الآتی (4598)`;
nasai.anwaar = [341,1];