var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّارِعُ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ وَأَنْبَأَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرٌ وَهُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا شُعْبَةُ وَاللَّفْظُ لِبِشْرٍ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يَقْبَلُ صَلَاةً بِغَيْرِ طُهُورٍ وَلَا صَدَقَةً مِنْ غُلُولٍ";
nasai.urdu = "حضرت ابو ملیح کے والد سے مروی ہے،وہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو یہ فرماتے سنا: ’’اللہ تعالیٰ طہارت کے بغیر نماز قبول نہیں کرتا اور حرام مال سے صدقہ قبول نہیں کرتا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;