var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ حَدَّثَنَا ابْنُ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَقَ دِرْهَمٌ مِائَةَ أَلْفٍ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ قَالَ رَجُلٌ لَهُ دِرْهَمَانِ فَأَخَذَ أَحَدَهُمَا فَتَصَدَّقَ بِهِ وَرَجُلٌ لَهُ مَالٌ كَثِيرٌ فَأَخَذَ مِنْ عُرْضِ مَالِهِ مِائَةَ أَلْفٍ فَتَصَدَّقَ بِهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’(کبھی) ایک درہم (کا ثواب) لاکھ درہم سے بڑھ جاتا ہے۔صحابہ نے پوچھا: وہ کیسے؟ آپ نے فرمایا: ’’ایک آدمی کے پاس کل دو درہم ہوں،اس نے ان میں سے ایک صدقہ کر دیا۔اور دوسرا شخص اپنے مال کے ایک کونے میں گیا۔اس میں سے ایک لاکھ درہم اٹھایا اور صدقہ کر دیا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن عجلان عنعن،وانظر الحدیث السابق (2528)`;
nasai.anwaar = [341,1];