var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَهُوَ يَذْكُرُ الصَّدَقَةَ وَالتَّعَفُّفَ عَنْ الْمَسْأَلَةِ الْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى وَالْيَدُ الْعُلْيَا الْمُنْفِقَةُ وَالْيَدُ السُّفْلَى السَّائِلَةُ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے صدقہ کرنے اور مانگنے سے بچنے کا ذکر کرتے ہوئے فرمایا: ’’اوپر والا ہاتھ نیچے والے ہاتھ سے بہتر ہے۔اوپر والا ہاتھ دینے والا ہاتھ ہے اور نیچے والا ہاتھ مانگنے والا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;