var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وَالْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’بہترین صدقہ وہ ہے جس کے بعد بھی صدقہ کرنے والا غنی رہے۔اور اوپر والا ہاتھ نیچے والے ہاتھ سے بہتر ہے۔اور سب سے اسے پہلے دے جس کا تو ذمے دار ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;