var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ لَمَّا فَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَامَ خَطِيبًا فَقَالَ فِي خُطْبَتِهِ لَا يَجُوزُ لِامْرَأَةٍ عَطِيَّةٌ إِلَّا بِإِذْنِ زَوْجِهَا مُخْتَصَرٌ";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ بیان کرتے ہیں کہ جب رسول اللہﷺ نے مکہ مکرمہ فتح کیا تو خطبے کے لیے کھڑے ہوئے اور آپ نے اپنے خطبے میں ارشاد فرمایا: ’’کسی عورت کے لیے جائز نہیں کہ خاوند کی اجازت کے بغیر کوئی تحفہ یا عطیہ دے۔‘‘ یہ روایت مختصر ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;