var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ شَحِيحٌ تَأْمُلُ الْعَيْشَ وَتَخْشَى الْفَقْرَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ سے ایک آدمی نے پوچھا: اے اللہ کے رسول! کون سا صدقہ افضل ہے؟ آپ نے فرمایا: ’’تو اس حال میں صدقہ کرے کہ تو تندرست ہو اور مال کا خواہش مند ہو۔زندگی کی امید رکھتا ہو اور فقر سے ڈرتا ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;