var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ سَمِعْتُ مُوسَى بْنَ طَلْحَةَ أَنَّ حَكِيمَ بْنَ حِزَامٍ حَدَّثَهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وَالْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ";
nasai.urdu = "حضرت حکیم بن حزام رضی اللہ عنہ نے بیان کیا کہ رسول اللہﷺ نے فرمایا: ’’افضل صدقہ وہ ہے جس کے بعد غنا باقی رہے اور اوپر والا ہاتھ نیچے والے ہاتھ سے بہتر ہے۔اور سب سے پہلے اس شخص کو دے جس کا تو ذمے دار ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;