var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو عَنْ ابْنِ وَهْبٍ قَالَ أَنْبَأَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وَابْدَأْ بِمَنْ تَعُولُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’بہترین صدقہ وہ ہے جس کے بعد غنا باقی رہے اور پہلے اس شخص کو دے جس کا تو ذمے دار (کفیل) ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;