var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْأَنْصَارِيَّ يُحَدِّثُ عَنْ أَبِي مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَنْفَقَ الرَّجُلُ عَلَى أَهْلِهِ وَهُوَ يَحْتَسِبُهَا كَانَتْ لَهُ صَدَقَةً";
nasai.urdu = "حضرت ابو مسعود رضی اللہ عنہ سے منقول ہے کہ نبی اکرمﷺ نے فرمایا: ’’جب آدمی اپنے گھر والوں پر ثواب کی نیت سے خرچ کرے تو وہ اس کے لیے صدقہ ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;