var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَ فَأُتِيَ بِمِنْدِيلٍ فَلَمْ يَمَسَّهُ وَجَعَلَ يَقُولُ بِالْمَاءِ هَكَذَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے حسل فرمایا اور بعد میں رومال لایا گیا تو آپ نے اسے قبول نہ فرمایا بلکہ پانی کو ہاتھوں کے ساتھ اس طرح جھاڑنے لگے۔";
nasai.hukam = "صحیح";
nasai.description = ``;