var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا لَا تُحْصِي فَيُحْصِيَ اللَّهُ عَزَّ وَجَلَّ عَلَيْكِ";
nasai.urdu = "حضرت اسماء بنت ابی بکر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے مجھ سے فرمایا تھا: ’’گن گن کر اللہ کے راستے میں نہ دے ورنہ اللہ تعالیٰ بھی تجھے گن گن کر دے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;