var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَعْبَدِ بْنِ خَالِدٍ عَنْ حَارِثَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَصَدَّقُوا فَإِنَّهُ سَيَأْتِي عَلَيْكُمْ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ فَيَقُولُ الَّذِي يُعْطَاهَا لَوْ جِئْتَ بِهَا بِالْأَمْسِ قَبِلْتُهَا فَأَمَّا الْيَوْمَ فَلَا";
nasai.urdu = "حضرت حارثہ رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’صدقہ کرو اس لیے کہ ایک ایسا زمانہ آنے والا ہے کہ آدمی صدقہ لے کر چلے گا۔(کہ کسی کو دے) مگر جسے وہ صدقہ دیا جائے گا،وہ کہے گا: اگر تو کل لے آتا تو میں قبول کر لیتا،آج نہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;