var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ أَخْبَرَنِي أَبُو بُرْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ عَنْ جَدِّهِ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اشْفَعُوا تُشَفَّعُوا وَيَقْضِي اللَّهُ عَزَّ وَجَلَّ عَلَى لِسَانِ نَبِيِّهِ مَا شَاءَ";
nasai.urdu = "حضرت ابو موسیٰ رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’سفارش کرو۔تمہاری سفارش قبول کی جائے گی۔اور اللہ تعالیٰ اپنے نبیﷺ کی زبانی جو چاہے گا،فیصلہ فرمائے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;