var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ ابْنِ مُنَبِّهٍ عَنْ أَخِيهِ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الرَّجُلَ لَيَسْأَلُنِي الشَّيْءَ فَأَمْنَعُهُ حَتَّى تَشْفَعُوا فِيهِ فَتُؤْجَرُوا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اشْفَعُوا تُؤْجَرُوا";
nasai.urdu = "حضرت معاویہ بن ابی سفیان رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ایک آدمی مجھ سے کوئی چیز مانگتا ہے اور میں انکار کر دیتا ہوں تاکہ تم سفارش کر کے ثواب حاصل کرو۔‘‘ تحقیق رسول اللہﷺ نے فرمایا: ’’سفارش کیا کرو،تمھیں ثواب ملے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;