var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوا وَتَصَدَّقُوا وَالْبَسُوا فِي غَيْرِ إِسْرَافٍ وَلَا مَخِيلَةٍ";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’کھاؤ اور صدقہ کرو اور لباس پہنو مگر فضول خرچی اور تکبر نہ ہو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (3605)<br>قتادۃ مدلس وعنعن،وعلقہ البخاري في أول کتاب اللباس (قبل ح5783)`;
nasai.anwaar = [341,1];