var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجَاهِرُ بِالْقُرْآنِ كَالْجَاهِرِ بِالصَّدَقَةِ وَالْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’بلند آواز سے قرآن مجید پڑھنے والا،علانیہ صدقہ کرنے والے کی طرح ہے اور آہستہ قرآن پڑھنے والا چھپا کر صدقہ کرنے والے کی طرح۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;