var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مَالِكٌ ح وَأَنْبَأَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ بُجَيْدٍ الْأَنْصَارِيِّ عَنْ جَدِّتِهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُدُّوا السَّائِلَ وَلَوْ بِظِلْفٍ فِي حَدِيثِ هَارُونَ مُحْرَقٍ";
nasai.urdu = "حضرت ابن بجید انصاری کی دادی بیان کرتی ہیں کہ رسول اللہﷺ نے فرمایا: ’’سوالی کو کچھ نہ کچھ دے کر واپس کرو،خواہ جلا ہوا کھر ہی ہو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;