var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ بَهْزَ بْنَ حَكِيمٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَأْتِي رَجُلٌ مَوْلَاهُ يَسْأَلُهُ مِنْ فَضْلٍ عِنْدَهُ فَيَمْنَعُهُ إِيَّاهُ إِلَّا دُعِيَ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعٌ أَقْرَعُ يَتَلَمَّظُ فَضْلَهُ الَّذِي مَنَعَ";
nasai.urdu = "حضرت بہز بن حکیم کے دادا نے کہا: میں نے رسول اللہﷺ کو فرماتے سنا: ’’جب کوئی شخص اپنے مالک کے پاس جائے اور اس سے اس کی ضرورت سے زائد کوئی چیز مانگے اور وہ اسے نہ دے تو اس مالک کے لیے قیامت کے دن ایک گنجا سانپ بلایا جائے گا جو اس کے زائد مال کو چبائے گا،جو اس نے نہیں دیا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;