var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَعَاذَ بِاللَّهِ فَأَعِيذُوهُ وَمَنْ سَأَلَكُمْ بِاللَّهِ فَأَعْطُوهُ وَمَنْ اسْتَجَارَ بِاللَّهِ فَأَجِيرُوهُ وَمَنْ آتَى إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ فَإِنْ لَمْ تَجِدُوا فَادْعُوا لَهُ حَتَّى تَعْلَمُوا أَنْ قَدْ كَافَأْتُمُوهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے رسول اللہﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ کا واسطہ دے کر پناہ طلب کرے،اسے پناہ دو۔جو شخص اللہ تعالیٰ کے نام پر مانگے،اسے دو۔اور جو شخص اللہ تعالیٰ کے نام پر امن مانگے،اسے امن دو۔اور جو شخص تم سے حسن سلوک کرے،اسے اس کا بدلہ دو اور اگر تمھیں بدلہ دینے کو کچھ نہ ملے تو اس کے لیے دعا کرو (اور کرتے رہو) حتیٰ کہ تمھیں یقین ہو جائے کہ تم نے اس کے احسان کا بدلہ چکا دیا ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1672،5109)`;
nasai.anwaar = [341,1];