var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وَإِذَا أَرَادَ أَنْ يَأْكُلَ غَسَلَ يَدَيْهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ جب جنابت کی حالت میں سونے کا ارادہ کرتے تو وضو فرماتے اور جب کھانے کا ارادہ کرتے تو ہاتھ دھو لیتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;