var nasai = {};
nasai.arabic = "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ الْأُكْلَةُ وَالْأُكْلَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ قَالُوا فَمَا الْمِسْكِينُ يَا رَسُولَ اللَّهِ قَالَ الَّذِي لَا يَجِدُ غِنًى وَلَا يَعْلَمُ النَّاسُ حَاجَتَهُ فَيُتَصَدَّقَ عَلَيْهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’مسکین وہ نہیں جسے ایک دو لقمے یا ایک دو کھجوریں پلٹا دیتی ہیں۔‘‘ لوگوں نے کہا: تو اے اللہ کے رسول! پھر مسکین کون ہے؟ آپ نے فرمایا: ’’جو شخص اتنا مال نہیں رکھتا جو کفایت کر سکے اور لوگوں کو اس (کے فقر) کا پتا نہیں چلتا کہ اس پر صدقہ ہو سکے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1632)`;
nasai.anwaar = [341,1];