var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ الشَّيْخُ الزَّانِي وَالْعَائِلُ الْمَزْهُوُّ وَالْإِمَامُ الْكَذَّابُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’۔تین شخص ایسے ہیں کہ اللہ تعالیٰ قیامت کے دن ان سے کلام نہیں فرمائے گا۔بوڑھا بدکار،مغرور ومتکبر فقیر اور جھوٹا بادشاہ۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;