var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا عَارِمٌ قَالَ حَدَّثَنَا حَمَّادٌ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرْبَعَةٌ يَبْغُضُهُمْ اللَّهُ عَزَّ وَجَلَّ الْبَيَّاعُ الْحَلَّافُ وَالْفَقِيرُ الْمُخْتَالُ وَالشَّيْخُ الزَّانِي وَالْإِمَامُ الْجَائِرُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہﷺ نے فرمایا: ’’جار اشخاص سے اللہ تعالیٰ بغض رکھتا ہے: جھوٹی قسمیں کھا کر سامان بیچنے والا،مغرور و متکبر فقیر،بوڑھا زنا کار اور ظالم بادشاہ۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;