var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَ حَدَّثَنَا مَالِكٌ عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيْلِيِّ عَنْ أَبِي الْغَيْثِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’بیوہ اور مسکین کے لیے دوڑ دھوپ کرنے والا اس شخص کی طرح ہے جو اللہ تعالیٰ کے راستے میں جہاد کرتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;