var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وَإِذَا أَرَادَ أَنْ يَأْكُلَ أَوْ يَشْرَبَ قَالَتْ غَسَلَ يَدَيْهِ ثُمَّ يَأْكُلُ أَوْ يَشْرَبُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کے رسول ﷺ جب جنابت کی حالت میں سونے کا ارادہ فرماتے تو وضو فرماتے اور جب کھانے یا پینے کا ارادہ فرماتے تو اپن ہاتھ دھوتے،پھر کھاتے پیتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;