var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعَلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ حَفْصَةَ عَنْ أُمِّ الرَّائِحِ عَنْ سَلْمَانَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الصَّدَقَةَ عَلَى الْمِسْكِينِ صَدَقَةٌ وَعَلَى ذِي الرَّحِمِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ";
nasai.urdu = "حضرت سلمان بن عامر رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’مسکین آدمی کو صدقہ دینا صرف صدقہ ہے جبکہ قرابت دار کو صدقہ دینا صدقہ بھی ہے اور صلہ رحمی بھی۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;