var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا عُبَيْدٍ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَحْتَزِمَ أَحَدُكُمْ حُزْمَةَ حَطَبٍ عَلَى ظَهْرِهِ فَيَبِيعَهَا خَيْرٌ مِنْ أَنْ يَسْأَلَ رَجُلًا فَيُعْطِيَهُ أَوْ يَمْنَعَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مذکور ہے کہ رسول اللہﷺ نے فرمایا: ’’تم میں سے ایک شخص لکڑیوں کا گٹھا اپنی پیٹھ پر اٹھائے اور اسے فروخت کرے (اور منافع حاصل کرے) یہ اس بات سے بہتر ہے کہ وہ کسی آدمی سے مانگے۔وہ اسے کچھ دے یا نہ دے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;