var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ مُسْلِمِ بْنِ مَخْشِيٍّ عَنْ ابْنِ الْفِرَاسِيِّ أَنَّ الْفِرَاسِيَّ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُ يَا رَسُولَ اللَّهِ قَالَ لَا وَإِنْ كُنْتَ سَائِلًا لَا بُدَّ فَاسْأَلْ الصَّالِحِينَ";
nasai.urdu = "ابن فراسی سے روایت ہے کہ میرے والد حضرت فراسی رضی اللہ عنہ نے رسول اللہﷺ سے عرض کیا: اے اللہ کے رسول! کیا میں کسی سے کچھ مانگ لیا کروں؟ آپ نے فرمایا: ’’نہیں۔اور اگر تجھے مجبوراً مانگنا پڑے تو نیک لوگوں سے مانگ۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1646)`;
nasai.anwaar = [341,1];