var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ قَبْلَ أَنْ يَنَامَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ بے شک رسول اللہ ﷺ جب سونے کا ارادہ فرماتے اور جنبی ہوتے تو سونے سے پہلے نماز والا وضو فرما لیتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;