var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ حَدَّثَنِي مُحَمَّدُ بْنُ قَيْسٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ مُعَاوِيَةَ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَضْمَنْ لِي وَاحِدَةً وَلَهُ الْجَنَّةُ قَالَ يَحْيَى هَاهُنَا كَلِمَةٌ مَعْنَاهَا أَنْ لَا يَسْأَلَ النَّاسَ شَيْئًا";
nasai.urdu = "حضرت ثوبان رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جو شخص مجھے ایک بات کی ضمانت دے دے،اس کے لیے جنت ہے۔اور وہ بات یہ ہے کہ وہ کسی انسان سے کچھ نہ مانگے گا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;