var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ وَهْبِ بْنِ مُنَبِّهٍ عَنْ أَخِيهِ عَنْ مُعَاوِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُلْحِفُوا فِي الْمَسْأَلَةِ وَلَا يَسْأَلْنِي أَحَدٌ مِنْكُمْ شَيْئًا وَأَنَا لَهُ كَارِهٌ فَيُبَارَكَ لَهُ فِيمَا أَعْطَيْتُهُ";
nasai.urdu = "حضرت معاویہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’اصرار کے ساتھ (چمٹ کر) نہ مانگا کرو۔تم میں سے جو شخص بھی مجھ سے کچھ مانگے گا جبکہ میں اسے دینا پسند نہ کروں (اور وہ مجھے تنگ کر کے کچھ مال لے جائے) تو اس کے لیے اس میں برکت نہ ہوگی جو میں اسے دوں گا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;