var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ دَاوُدَ بْنِ شَابُورَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ وَلَهُ أَرْبَعُونَ دِرْهَمًا فَهُوَ الْمُلْحِفُ";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’جو آدمی چالیس درہم ہونے کے باوجود مانگے تو وہ اصرار کے ساتھ (چمٹ کر) مانگنے والا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;