var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ قَالَ يَا رَسُولَ اللَّهِ أَيَنَامُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ إِذَا تَوَضَّأَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہا سے روایت ہے کہ حضرت عمر رضی اللہ عنہ نے گزارش کی کہ اے اللہ کے رسول! کیا ہم میں سے کوئی جنابت کی حالت میں سو سکتا ہے؟ آپ نے فرمایا: ’’بشرطیکہ وضو کرلے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;