var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ مُحَمَّدُ بْنُ بِشْرٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ عَنْ زَيْدِ بْنِ عُقْبَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْمَسَائِلَ كُدُوحٌ يَكْدَحُ بِهَا الرَّجُلُ وَجْهَهُ فَمَنْ شَاءَ كَدَحَ وَجْهَهُ وَمَنْ شَاءَ تَرَكَ إِلَّا أَنْ يَسْأَلَ الرَّجُلُ ذَا سُلْطَانٍ أَوْ شَيْئًا لَا يَجِدُ مِنْهُ بُدًّا";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’بلا شبہ مانگنا خراشیں ہیں۔آدمی اپنے چہرے کو ان کے ذریعے سے نوچتا ہے۔اب جو چاہے اپنا چہرہ نوچے اور جو چاہے رہنے دے۔الا یہ کہ کوئی شخص صاحب اقتدار سے مانگے یا ایسی چیز مانگے جس کے بغیر چارہ نہ ہو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;