var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ عَنْ زَيْدِ بْنِ عُقْبَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْأَلَةُ كَدٌّ يَكُدُّ بِهَا الرَّجُلُ وَجْهَهُ إِلَّا أَنْ يَسْأَلَ الرَّجُلُ سُلْطَانًا أَوْ فِي أَمْرٍ لَا بُدَّ مِنْهُ";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’مانگنا تو اپنے آپ کو زخمی کرنا ہے۔اس طریقے سے آدمی اپنے چہرے کو نوچتا ہے،مگر یہ کہ حاکم سے مانگے یا ایسی چیز مانگے جس کے بغیر چارہ نہ ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;