var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ ذَكَرَ عُمَرُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ تُصِيبُهُ الْجَنَابَةُ مِنْ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ حضرت عمر رضی اللہ عنہ نے رسول اللہ ﷺ کے سامنے ذکر کیا کہ (کبھی) میں رات کو جنبی ہو جاتا ہوں (تو کیا کروں؟) آپ نے فرمایا: ’’اپنی شرم گاہ دھولو،وضو کرلو،پھر سو جاؤ۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;