var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ قُلْتُ لِأَبِي إِيَاسٍ مُعَاوِيَةَ بْنِ قُرَّةَ أَسَمِعْتَ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنُ أُخْتِ الْقَوْمِ مِنْ أَنْفُسِهِمْ قَالَ نَعَمْ";
nasai.urdu = "حضرت شعبہ بیان کرتے ہیں کہ میں نے حضرت ابو ایاس معاویہ بن قرہ سے پوچھا: کیا تم نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ہے کہ رسول اللہﷺ نے فرمایا: ’’کسی قوم کا بھانجا بھی اس قوم میں شامل ہے؟‘‘ انھوں نے کہا: ہاں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;