var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ قَالَ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِشَيْءٍ سَأَلَ عَنْهُ أَهَدِيَّةٌ أَمْ صَدَقَةٌ فَإِنْ قِيلَ صَدَقَةٌ لَمْ يَأْكُلْ وَإِنْ قِيلَ هَدِيَّةٌ بَسَطَ يَدَهُ";
nasai.urdu = "حضرت بہز بن حکیم کے دادا بیان کرتے ہیں کہ جب نبیﷺ کے پاس کوئی چیز لائی جاتی تو آپ اس کے بارے میں پوچھتے کہ یہ تحفہ ہے یا صدقہ؟ اگر کہا جاتا: صدقہ ہے،تو آپ نہیں کھاتے تھے اور اگر کہا جاتا ہے: تحفہ ہے،تو آپ تناول فرما لیتے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;