var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عُمَرَ أَنَّهُ حَمَلَ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَرَآهَا تُبَاعُ فَأَرَادَ شِرَاءَهَا فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَعْرِضْ فِي صَدَقَتِكَ";
nasai.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے کہ انھوں نے ایک گھوڑا فی سبیل اللہ صدقہ کیا،پھر انھیں پتا چلا کہ وہ گھوڑا فروخت ہو رہا ہے تو انھوں نے خود ہی خریدنے کا ارادہ کر لیا۔نبیﷺ نے فرمایا: ’’اپنے کیے ہوئے صدقے (کی واپسی) کا خیال بھی نہ کر۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;