var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا بِشْرٌ وَيَزِيدُ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ عَتَّابَ بْنَ أَسِيدٍ أَنْ يَخْرُصَ الْعِنَبَ فَتُؤَدَّى زَكَاتُهُ زَبِيبًا كَمَا تُؤَدَّى زَكَاةُ النَّخْلِ تَمْرًا";
nasai.urdu = "حضرت سعید بن مسیب سے منقول ہے کہ رسول اللہﷺ نے (مکہ مکرمہ کے گورنر) حضرت عتاب بن اسید رضی اللہ عنہ کو حکم دیا تھا کہ انگوروں کی فصل کا اندازہ لگا کر ان کی زکاۃ کشمش کی صورت میں ادا کی جائے جس طرح کھجوروں کی زکاۃ خشک کھجوروں (چھوہاروں) کی صورت میں ادا کی جاتی ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1603،1604) ترمذی (644) ابن ماجہ (1819)<br>السند مرسل ولہ طریق آخر عند أبي داود (1603) وسندہ ضعیف لإنقطاعہ۔`;
nasai.anwaar = [341,1];