var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ أَنْبَأَنَا شُعْبَةُ ح وَأَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ وَاللَّفْظُ لَهُ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ صُورَةٌ وَلَا كَلْبٌ وَلَا جُنُبٌ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے مروی ہے،نبی ﷺ نے فرمایا: ’’اس گھر میں (رحمت کے) فرشتے داخل نہیں ہوتے جس میں تصویر،کتا یا جنبی ہو۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;