var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ سَالِمٍ قَالَ سَمِعْتُ عَمْرَو بْنَ أَوْسٍ يُحَدِّثُ عَنْ أَبِي رَزِينٍ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ الْحَجَّ وَلَا الْعُمْرَةَ وَلَا الظَّعْنَ قَالَ فَحُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ";
nasai.urdu = "حضرت عمرو بن اوس رضی اللہ عنہ سے روایت ہے کہ حضرت ابو رزین رضی اللہ عنہ نے کہا: اے اللہ کے رسول! میرے والد بہت بوڑھے ہو چکے ہیں۔وہ حج و عمرہ بلکہ سفر تک کی طاقت نہیں رکھتے۔آپ نے فرمایا: ’’تم اپنے والد کی طرف سے حج اور عمرہ کرو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;