var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الصَّفَّارِ الْبَصْرِيُّ قَالَ حَدَّثَنَا سُوَيْدٌ وَهُوَ ابْنُ عَمْرٍو الْكَلْبِيُّ عَنْ زُهَيْرٍ قَالَ حَدَّثَنَا سُهَيْلٌ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَجَّةُ الْمَبْرُورَةُ لَيْسَ لَهَا جَزَاءٌ إِلَّا الْجَنَّةُ وَالْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’حج مبرور کا بدلہ جنت کے سوا کچھ نہیں۔اور ایک عمرہ دوسرے عمرے تک کے درمیانی گناہوں کا کفارہ بن جاتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;