var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي سُهَيْلٌ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحَجَّةُ الْمَبْرُورَةُ لَيْسَ لَهَا ثَوَابٌ إِلَّا الْجَنَّةُ مِثْلَهُ سَوَاءً إِلَّا أَنَّهُ قَالَ تُكَفِّرُ مَا بَيْنَهُمَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،نبیﷺ نے فرمایا: ’’حج مبرور کا ثواب صرف جنت ہے۔‘‘ باقی روایت تقریباً سابقہ روایت ہی کی طرح ہے۔مگر اس روایت میں فرق صرف یہ ہے کہ آپ نے فرمایا: ’’ایک عمرہ دوسرے عمرے تک کے درمیانی گناہوں کو ختم کر دیتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;