var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ الْإِيمَانُ بِاللَّهِ قَالَ ثُمَّ مَاذَا قَالَ الْجِهَادُ فِي سَبِيلِ اللَّهِ قَالَ ثُمَّ مَاذَا قَالَ ثُمَّ الْحَجُّ الْمَبْرُورُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں ایک آدمی نے نبیﷺ سے پوچھا: اے اللہ کے رسول! کون سا عمل سب سے افضل ہے؟ آپ نے فرمایا: ’’اللہ تعالیٰ پر ایمان۔‘‘ اس نے کہا: پھر کون سا؟ آپ نے فرمایا: ’’اللہ تعالیٰ کے راستے میں جہاد۔‘‘ اس نے پوچھا: پھر کون سا؟ آپ نے فرمایا: ’’پھر حج مبرور۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;