var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ بْنِ مَثْرُودٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ عَنْ أَبِيهِ قَالَ سَمِعْتُ سُهَيْلَ بْنَ أَبِي صَالِحٍ قَالَ سَمِعْتُ أَبِي يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفْدُ اللَّهِ ثَلَاثَةٌ الْغَازِي وَالْحَاجُّ وَالْمُعْتَمِرُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’تین شخص اللہ تعالیٰ کے خصوصی مہمان ہیں: جہاد کو جانے والا،حج کے لیے سفر کرنے والا اور عمرے کو جانے والا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;