var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جِهَادُ الْكَبِيرِ وَالصَّغِيرِ وَالضَّعِيفِ وَالْمَرْأَةِ الْحَجُّ وَالْعُمْرَةُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہﷺ نے فرمایا: ’’بوڑھے،بچے،کمزور اور عورت کا جہاد حج اور عمرہ کرنا ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;