var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا الْفُضَيْلُ وَهُوَ ابْنُ عِيَاضٍ عَنْ مَنْصُورٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَجَّ هَذَا الْبَيْتَ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَمَا وَلَدَتْهُ أُمُّهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’۔جس نے اس گھر (بیت اللہ) کا حج کیا اور اس دوران میں کوئی شہوانی بات کی نہ فسق (کبیرہ گناہ کا ارتکاب) کیا،وہ (گناہوں سے) اس طرح (پاک صاف ہو کر) پلٹتا ہے جیسے اس دن تھا جب اسے اس کی ماں نے جنا تھا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;