var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ حَبِيبٍ وَهُوَ ابْنُ أَبِي عَمْرَةَ عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ قَالَتْ أَخْبَرَتْنِي أُمُّ الْمُؤْمِنِينَ عَائِشَةُ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَلَا نَخْرُجُ فَنُجَاهِدَ مَعَكَ فَإِنِّي لَا أَرَى عَمَلًا فِي الْقُرْآنِ أَفْضَلَ مِنْ الْجِهَادِ قَالَ لَا وَلَكُنَّ أَحْسَنُ الْجِهَادِ وَأَجْمَلُهُ حَجُّ الْبَيْتِ حَجٌّ مَبْرُورٌ";
nasai.urdu = "ام المومنین حضرت عائشہؓ فرماتی ہیں کہ میں نے گزارش کی: اے اللہ کے رسول! کیا ہم عورتیں بھی آپ کے ساتھ جہاد کے لیے نہ جایا کریں؟ کیونکہ میں تو قرآن مجید میں کوئی عمل جہاد سے افضل نہیں پاتی۔آپ نے فرمایا: ’’نہیں تم عورتوں کے لیے افضل اور خوب صورت ترین جہاد بیت اللہ کا حج مبرور ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;