var nasai = {};
nasai.arabic = "أَخْبَرَنِي عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَلِيُّ بْنُ حَكِيمٍ الْأَوْدِيُّ قَالَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِيُّ قَالَ حَدَّثَنَا حَمَّادُ ابْنُ زَيْدٍ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ الزُّهْرِيِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ امْرَأَةً سَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَبِيهَا مَاتَ وَلَمْ يَحُجَّ قَالَ حُجِّي عَنْ أَبِيكِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ ایک عورت نے نبیﷺ سے اپنے والد کے بارے میں پوچھا جو (فرض) حج کیے بغیر فوت ہوگیا تھا۔آپ نے فرمایا: ’’تو اپنے والد کی طرف سے حج کر لے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;