var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ امْرَأَةً مِنْ خَثْعَمَ سَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدَاةَ جَمْعٍ فَقَالَتْ يَا رَسُولَ اللَّهِ فَرِيضَةُ اللَّهِ فِي الْحَجِّ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لَا يَسْتَمْسِكُ عَلَى الرَّحْلِ أَفَأَحُجُّ عَنْهُ قَالَ نَعَمْ أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عُبَيْدِ اللَّهِ الْمَخْزُومِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ مِثْلَهُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے (ایک دوسری سند سے) سابقہ حدیث کی مثل روایت آتی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;