var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ عَنْ عَمْرِو بْنِ أَوْسٍ عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ الْحَجَّ وَلَا الْعُمْرَةَ وَالظَّعْنَ قَالَ حُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ";
nasai.urdu = "حضرت ابو رزین عقیلی رضی اللہ عنہ بیان کرتے ہیں کہ میں نے کہا: اے اللہ کے رسول! میرے والد بہت بوڑھے ہو چکے ہیں،حج وعمرہ بلکہ سفر بھی نہیں کر سکتے۔آپ نے فرمایا: ’’تم اپنے والد کی طرف سے حج اور عمرہ کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;