var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِإِسْحَقَ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ عَلَى نِسَائِهِ فِي لَيْلَةٍ بِغُسْلٍ وَاحِدٍ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اکرم ﷺ ایک رات میں اپنی تمام بییوں کے پاس ایک ہی غسل کے ساتھ گئے۔";
nasai.hukam = "صحیح";
nasai.description = ``;