var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ النَّسَائِيُّ عَنْ عَبْدِ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الْحَكَمِ بْنِ أَبَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّ أَبِي مَاتَ وَلَمْ يَحُجَّ أَفَأَحُجُّ عَنْهُ قَالَ أَرَأَيْتَ لَوْ كَانَ عَلَى أَبِيكَ دَيْنٌ أَكُنْتَ قَاضِيَهُ قَالَ نَعَمْ قَالَ فَدَيْنُ اللَّهِ أَحَقُّ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے منقول ہے کہ ایک آدمی نے کہا: اے اللہ کے رسول! میرے والد حج کیے بغیر فوت ہوگئے ہیں،تو کیا میں ان کی طرف سے حج کر سکتا ہوں؟ آپ نے فرمایا: ’’بتاؤ اگر تمھارے والد پر قرض ہوتا تو کیا تم اسے ادا کرتے؟‘‘ اس نے کہا: جی ہاں۔آپ نے فرمایا: ’’تو اللہ کا قرض ادائیگی کا زیادہ حق دار ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;