var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ يُوسُفَ عَنْ ابْنِ الزُّبَيْرِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ أَنْتَ أَكْبَرُ وَلَدِ أَبِيكَ فَحُجَّ عَنْهُ";
nasai.urdu = "حضرت ابن زبیر رضی اللہ عنہ سے منقول ہے،نبی ﷺ نے ایک آدمی سے فرمایا: ’’تو اپنے والد کا سب سے بڑا بیٹا ہے،لہٰزا ترو اس کی طرف سے حج کر۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (2639)`;
nasai.anwaar = [342,1];