var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ امْرَأَةً رَفَعَتْ صَبِيًّا لَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ ایک عورت نے اپنا بچہ رسول اللہ ﷺ کی طرف ہاتھوں پر بلند کیا اور کہنے لگی: اے اللہ کے رسول! کیا اس کا بھی حج ہے؟ آپ نے فرمایا: ’’ہاں،اور ثواب تجھے ملے گا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;