var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ رَفَعَتْ امْرَأَةٌ صَبِيًّا لَهَا مِنْ هَوْدَجٍ فَقَالَتْ يَا رَسُولَ اللَّهِ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ ایک عورت نے اپنا بچہ ہودج سے اٹھایا اور (رسول اللہ ﷺ کو دکھا کر آپ سے) کہنے لگی: اے اللہ کے رسول! کیا اس کا بھی حج ہوگا؟ آپ نے فرمایا: ’’ہاں۔اور ثواب تجھے ملے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;