var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ رَفَعَتْ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَبِيًّا فَقَالَتْ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ ایک عورت نے نبی ﷺ کی طرف ایک بچہ اٹھایا اور کہنے لگی: کیا اس کا بھی حج ہوگا؟ آپ نے فرمایا: ’’ہاں۔اور ثواب تیرے لیے ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;