var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ بْنِ حَمَّادِ بْنِ سَعْدٍ ابْن أَخِي رِشْدِينَ بْنِ سَعْدٍ أَبُو الرَّبِيعِ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِامْرَأَةٍ وَهِيَ فِي خِدْرِهَا مَعَهَا صَبِيٌّ فَقَالَتْ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مذکور ہے کہ رسول اللہ ﷺ (حج سے واپسی کے دوران میں) ایک عورت کے پاس سے گزرے۔وہ پردے میں تھی اور اس کے ساتھ اس کا ایک بچہ تھا۔وہ کہنے لگی: کیا اس کے لیے حج ہے؟ آپ نے فرمایا: ’’ہاں۔اور ثواب تیرے لیے ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;