var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ بَهْرَامٍ قَالَ حَدَّثَنَا الْمُعَافَى عَنْ أَفْلَحَ بْنِ حُمَيْدٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ وَلِأَهْلِ الشَّامِ وَمِصْرَ الْجُحْفَةَ وَلِأَهْلِ الْعِرَاقِ ذَاتَ عِرْقٍ وَلِأَهْلِ الْيَمَنِ يَلَمْلَمَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے مدینہ منورہ والوں کے لیے ذوالحلیفہ،شام اور مصر والوں کے لیے جحفہ عراق والوں کے لیے ذات عرق اور یمن والوں کے لیے یلملم میقات مقرر فرمائے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;