var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ وَأَهْلُ الشَّامِ مِنْ الْجُحْفَةِ وَأَهْلُ نَجْدٍ مِنْ قَرْنٍ وَذُكِرَ لِي وَلَمْ أَسْمَعْ أَنَّهُ قَالَ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ نے فرمایا: ’’مدینے والے ذوالحلیفہ سے،شام والے جحفہ سے اور نجد والے قرن (المنازل) سے احرام باندھیں۔‘‘ اور مجھے بتایا گیا ہے،میں نے خود نہیں سنا کہ آپ نے فرمایا تھا: ’’یمن والے یلملم سے احرام باندھیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;