var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ الْمَوْصِلِيُّ قَالَ حَدَّثَنَا أَبُو هَاشِمٍ مُحَمَّدُ بْنُ عَلِيٍّ عَنْ الْمُعَافَى عَنْ أَفْلَحَ بْنِ حُمَيْدٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ وَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ وَلِأَهْلِ الشَّامِ وَمِصْرَ الْجُحْفَةَ وَلِأَهْلِ الْعِرَاقِ ذَاتَ عِرْقٍ وَلِأَهْلِ نَجْدٍ قَرْنًا وَلِأَهْلِ الْيَمَنِ يَلَمْلَمَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ نے مدینہ منورہ والوں کے لیے ذوالحلیفہ،شام اور مصر والوں کے لیے جحفہ عراق والوں کے لیے ذات عرق،نجد والوں کے لیے قرن اور یمن والوں کے لیے یلملم کو میقات مقرر فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;