var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ قَالَ أَتَيْتُ عَلِيًّا أَنَا وَرَجُلَانِ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ مِنْ الْخَلَاءِ فَيَقْرَأُ الْقُرْآنَ وَيَأْكُلُ مَعَنَا اللَّحْمَ وَلَمْ يَكُنْ يَحْجُبُهُ عَنْ الْقُرْآنِ شَيْءٌ لَيْسَ الْجَنَابَةَ";
nasai.urdu = "حضرت عبداللہ بن سلمہ بیان کرتے ہیں کہ میں اور دو آدمی حضرت علی رضی اللہ عنہ کے اس آئے تو انھوں نے فرمایا: اللہ کے رسول ﷺ بیت الخلا سے باہر تشریف لاتے تو قرآن مجید پڑھتے۔آپ ﷺ ہمارے ساتھ گوشت کھاتے اور آپ کو قرپن مجید پڑھنے سے جنابت کے سوا کوئی چیز مانع نہ ہوتی تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;