var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ بْنِ مَثْرُودٍ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ أَبَاهُ قَالَ بَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذِي الْحُلَيْفَةِ بِبَيْدَاءَ وَصَلَّى فِي مَسْجِدِهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے ابتداء ً ذوالحلیفہ میں رات گزاری اور اس کی مسجد میں نماز پڑھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;