var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ عَنْ سُوَيْدٍ عَنْ زُهَيْرٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ وَهُوَ فِي الْمُعَرَّسِ بِذِي الْحُلَيْفَةِ أُتِيَ فَقِيلَ لَهُ إِنَّكَ بِبَطْحَاءَ مُبَارَكَةٍ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ ذوالحلیفہ میں اپنے پڑاؤ کی جگہ میں تھے کہ آپ کو خواب آیا۔آپ سے کہا گیا: آپ ایک بابرکلت وادی میں ہیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;