var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَاخَ بِالْبَطْحَاءِ الَّذِي بِذِي الْحُلَيْفَةِ وَصَلَّى بِهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ذوالحلیفہ کی وادی مقدس میں پڑاؤ ڈالا اور وہاں نماز پڑھی";
nasai.hukam = "متفق علیہ";
nasai.description = ``;