var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا النَّضْرُ وَهُوَ ابْنُ شُمَيْلٍ قَالَ حَدَّثَنَا أَشْعَثُ وَهُوَ ابْنُ عَبْدِ الْمَلِكِ عَنْ الْحَسَنِ عَنْ أَنَسِ ابْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ بِالْبَيْدَاءِ ثُمَّ رَكِبَ وَصَعِدَ جَبَلَ الْبَيْدَاءِ فَأَهَلَّ بِالْحَجِّ وَالْعُمْرَةِ حِينَ صَلَّى الظُّهْرَ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ظہر کی نماز بیداء میں پڑھی،پھر سوار ہوئے اور بیداء کے پہاڑ پر چڑھے۔اور نماز ظہر کے بعد حج و عمرے کا احرام باندھا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1774) وحدیث الآتی (2756،2934)`;
nasai.anwaar = [342,1];