var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ أَنَّهَا وَلَدَتْ مُحَمَّدَ بْنَ أَبِي بَكْرٍ الصِّدِّيقِ بِالْبَيْدَاءِ فَذَكَرَ أَبُو بَكْرٍ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرْهَا فَلْتَغْتَسِلْ ثُمَّ لِتُهِلَّ";
nasai.urdu = "حضرت اسماء بن عمی رضی اللہ عنہا سے روایت ہے کہ مقام بیداء میں انھوں نے محمد بن ابوبکر صدیق کو جنا۔حضرت ابوبکر رضی اللہ عنہ نے اس بات کا تذکرہ رسول اللہ ﷺ سے کیا تو آپ نے فرمایا: ’’اسماء سے کہو وہ غسل کرے اور احرام باندھ لے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;