var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَهُوَ يَقُولُ السَّرَاوِيلُ لِمَنْ لَا يَجِدُ الْإِزَارَ وَالْخُفَّيْنِ لِمَنْ لَا يَجِدُ النَّعْلَيْنِ لِلْمُحْرِمِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی ﷺ کو خطبہ دیتے سنا،آپ فرما رہے تھے: ’’جس شخص کے پاس تہبند نہ ہو،وہ شلوار پہن سکتا ہے اور جس کے پاس جوتے نہ ہوں،وہ موزے پہن سکتا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;