var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ سَرَاوِيلَ وَمَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا: ’’جس شخص (محرم) کے پاس تہبند نہ ہو،وہ شلوار پہن سکتا ہے اور جس شخص کے پاس جوتے نہ ہوں،وہ موزے پہن سکتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;