var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ أَبِي زَائِدَةَ قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَلْبَسُوا فِي الْإِحْرَامِ الْقَمِيصَ وَلَا السَّرَاوِيلَاتِ وَلَا الْعَمَائِمَ وَلَا الْبَرَانِسَ وَلَا الْخِفَافَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ میں نے نبی ﷺ کو فرماتے سنا: ’’تم احرام کی حالت میں قمیص،شلوار،پگڑی،برانڈی اور موزے نہ پہنو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;