var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ أَنْبَأَنَا أَيُّوبُ عَنْ عَمْرٍو عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ السَّرَاوِيلَ وَإِذَا لَمْ يَجِدْ النَّعْلَيْنِ فَلْيَلْبَسْ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنْ الْكَعْبَيْنِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ ﷺ کو یہ فرماتے سنا: ’’جب کوئی شخص (محرم) تہبند نہ پائے تو شلوار پہن سکتا ہے اور جب جوتے نہ پائے تو موزے پہن سکتا ہے لیکن وہ انھیں ٹخنوں کے نیچے سے کاٹ لے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;