var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا ابْنُ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا لَمْ يَجِدْ الْمُحْرِمُ النَّعْلَيْنِ فَلْيَلْبَسْ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنْ الْكَعْبَيْنِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے فرمایا: ’۔جب محرم کے پاس جوتے نہ ہوں تو وہ موزے پہن لے مگر انھیں ٹخنوں کے نیچے سے کاٹ لے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;