var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أُخْتِهِ حَفْصَةَ قَالَتْ قُلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحِلَّ مِنْ عُمْرَتِكَ قَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَا أُحِلُّ حَتَّى أُحِلَّ مِنْ الْحَجِّ";
nasai.urdu = "ام المومنین حضرت حفصہ رضی اللہ عنہا فرماتی ہیں کہ میں نے نبی ﷺ سے حلال ہوگئے ہیں مگر آپ عمرہ کر کے حلال نہیں ہوئے؟ آپ نے فرمایا: ’’میں نے اپنے سر کے بالوں کو گوند سے چپکایا ہے اور قربانی کے جانور کو قلادہ (ہار) پہنا دیا ہے،اس لیے میں حلال نہیں ہو سکتا حتیٰ کہ حج سے حلال ہو جاؤں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;