var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو عَنْ سَالِمٍ عَنْ عَائِشَةَ قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ إِحْرَامِهِ حِينَ أَرَادَ أَنْ يُحْرِمَ وَعِنْدَ إِحْلَالِهِ قَبْلَ أَنْ يُحِلَّ بِيَدَيَّ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے رسول اللہ ﷺ کو اپنے ہاتھوں سے خوشبو لگائی آپ کے احرام کے وقت جب آپ نے احرام کا ارادہ فرمایا اور حلال ہونے (احرام کھولنے) کے وقت (خوشبو لگائی) پہلے اس سے کہ آپ مکمل حلال ہوں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;