var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے رسول اللہ ﷺ کو خوشبو لگائی آپ کے احرام کے وقت احرام باندھنے سے پہلے اور آپ کے حلال ہونے (احرام کھولنے) کے وقت طواف زیارت کرنے سے پہلے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;