var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عُبَيْدِ اللَّهِ الْمَخْزُومِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُرْمِهِ حِينَ أَحْرَمَ وَلِحِلِّهِ بَعْدَ مَا رَمَى جَمْرَةَ الْعَقَبَةِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے رسول اللہ ﷺ کو آپ کے احرام کے وقت خوشبو لگائی جب آپ نے احرام باندھا۔اور جب آپ جمرۂ عقبہ کو رمی کرنے کے بعد حلال ہوئے اس وقت بھی خوشبو لگائی اس سے پہلے کہ آپ بیت اللہ کا طواف فرمائیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;