var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ مُحَمَّدٍ أَبُو عُمَيْرٍ عَنْ ضَمْرَةَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِإِحْلَالِهِ وَطَيَّبْتُهُ لِإِحْرَامِهِ طِيبًا لَا يُشْبِهُ طِيبَكُمْ هَذَا تَعْنِي لَيْسَ لَهُ بَقَاءٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ میں نے رسول اللہ ﷺ کو حلال ہوتے وقت خوشبو لگائی اور احرام باندھنے کے وقت بھی ایسی خوشبو لگائی جو تمھاری اس خوشبو کی طرح نہیں تھی،یعنی جو باقی نہیں رہتی۔";
nasai.hukam = "صحیح";
nasai.description = ``;