var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَخْبَرَنَا يَحْيَى قَالَ حَدَّثَنَا مِسْعَرٌ قَالَ حَدَّثَنِي وَاصِلٌ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَهُ وَهُوَ جُنُبٌ فَأَهْوَى إِلَيَّ فَقُلْتُ إِنِّي جُنُبٌ فَقَالَ إِنَّ الْمُسْلِمَ لَا يَنْجُسُ";
nasai.urdu = "حضرت حذیفہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ مجھے ملے جب کہ میں جنبی تھا۔آپ (ملاقات کے لیے) میری طرف مائل ہوئے۔میں نے کہا: میں جنبی ہوں۔آپ نے فرمایا: ’’تحقیق مسلمان ناپاک نہیں ہوتا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;