var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُرْوَةَ عَنْ أَبِيهِ قَالَ قُلْتُ لِعَائِشَةَ بِأَيِّ شَيْءٍ طَيَّبْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ بِأَطْيَبِ الطِّيبِ عِنْدَ حُرْمِهِ وَحِلِّهِ";
nasai.urdu = "حضرت عروہ بیان کرتے ہیں کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا: آپ نے رسول اللہ ﷺ کو کون سی خوشبو لگائی تھی؟ انھوں نے فرمایا: میں نے آپ کو سب سے بہترین خوشبو لگائی،احرام باندھنے کے وقت بھی اور حلال ہونے کے وقت بھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;