var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى بْنِ الْوَزِيرِ بْنِ سُلَيْمَانَ قَالَ أَنْبَأَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ إِحْرَامِهِ بِأَطْيَبِ مَا أَجِدُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ میں رسول اللہ ﷺ کو آپ کے احرام باندھنے کے وقت بہترین خوشبو لگایا کرتی تھی جو میرے پاس ہوتی تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;