var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ يَحْيَى بْ نِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَطْيَبِ مَا أَجِدُ لِحُرْمِهِ وَلِحِلِّهِ وَحِينَ يُرِيدُ أَنْ يَزُورَ الْبَيْتَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے رسول اللہ ﷺ کو آپ کے احرام باندھنے کے وقت اور حلال ہونے کے وقت اور جب آپ بیت اللہ کا طوافِ زیارت کرنے چلے،اپنے پاس موجود بہترین خوشبو لگائی۔";
nasai.hukam = "حسن";
nasai.description = ``;