var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ قَالَ قَالَتْ عَائِشَةُ طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يُحْرِمَ وَيَوْمَ النَّحْرِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ بِطِيبٍ فِيهِ مِسْكٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ میں نے رسول اللہ ﷺ کو آپ کے احرام باندھنے سے قبل اور قربانی والے دن طواف بیت اللہ کرنے سے پہلے خوشبو لگائی جس میں کستوری شامل تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;