var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ مَنْصُورٍ قَالَ قَالَ لِي إِبْرَاهِيمُ حَدَّثَنِي الْأَسْوَدُ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ لَقَدْ كَانَ يُرَى وَبِيصُ الطِّيبِ فِي مَفَارِقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ دوران احرام رسول اللہ ﷺ کی مانگ مبارک میں خوشبو کی چمک صاف نظر آتی تھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;