var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ قَالَ حَدَّثَنِي شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفْرِقِ رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ";
nasai.urdu = "حضرت عائشہؓ بیان کرتی ہیں کہ مجھے ایسے محسوس ہوتا ہے کہ میں رسول اللہﷺ کے سر مبارک کی مانگ میں خوشبو کی چمک دیکھ رہی ہوں جبکہ آپ احرام کی حالت میں ہیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;