var nasai = {};
nasai.arabic = "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ الْعَسْكَرِيُّ قَالَ أَنْبَأَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ غُنْدُرٌ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ لَقَدْ رَأَيْتُ وَبِيصَ الطِّيبِ فِي رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ";
nasai.urdu = "حضرت عائشہؓ نے فرمایا: تحقیق میں نے رسول اللہﷺ کے سر مبارک میں خوشبو کی چمک دیکھی جبکہ آپ احرام کی حالت میں تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;