var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ وَهَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ هَنَّادٌ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يُحْرِمَ ادَّهَنَ بِأَطْيَبِ مَا يَجِدُهُ حَتَّى أَرَى وَبِيصَهُ فِي رَأْسِهِ وَلِحْيَتِهِ تَابَعَهُ إِسْرَائِيلُ عَلَى هَذَا الْكَلَامِ وَقَالَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَائِشَةَ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ نبیﷺ،ہناد (راوی) نے (نبیﷺ کے بجائے) کہا: رسول اللہﷺ،جب احرام باندھنے کا ارادہ فرماتے تو اپنے پاس موجود بہترین خوشبو لگاتے حتیٰ کہ میں اس کی چمک آپ کے سر اور داڑھی مبارک میں دیکھا کرتی تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;