var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ أَنْبَأَنَا يَحْيَى بْنُ آدَمَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَطْيَبِ مَا كُنْتُ أَجِدُ مِنْ الطِّيبِ حَتَّى أَرَى وَبِيصَ الطِّيبِ فِي رَأْسِهِ وَلِحْيَتِهِ قَبْلَ أَنْ يُحْرِمَ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ میں رسول اللہﷺ کو احرام سے قبل اپنے پاس موجود بہترین خوشبو لگاتی تھی حتیٰ کہ میں اس خوشبو کی چمک آپ کے سر اور داڑھی مبارک میں دیکھتی تھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;