var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ لَقَدْ رَأَيْتُ وَبِيصَ الطِّيبِ فِي مَفَارِقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ثَلَاثٍ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ تحقیق میں نے (احرام باندھنے سے) تین دن بعد رسول اللہﷺ کی مانگ مبارک میں خوشبو کی چمک دیکھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>إبراھیم النخعي مدلس وعنعن۔`;
nasai.anwaar = [371,1];