var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَرَى وَبِيصَ الطِّيبِ فِي مَفْرِقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ثَلَاثٍ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ میں (احرام باندھنے سے) تین دن بعد بھی رسول اللہﷺ کی مانگ مبارک میں خوشبو کی چمک دیکھا کرتی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (2928)<br>شریک و أبو إسحاق مدلسان وعنعنا۔<br>`;
nasai.anwaar = [371,1];