var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَزِيدَ بْنَ كَيْسَانَ قَالَ حَدَّثَنِي أَبُو حَازِمٍ قَالَ قَالَ أَبُو هُرَيْرَةَ بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ إِذْ قَالَ يَا عَائِشَةُ نَاوِلِينِي الثَّوْبَ فَقَالَتْ إِنِّي لَا أُصَلِّي قَالَ إِنَّهُ لَيْسَ فِي يَدِكِ فَنَاوَلَتْهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ایک دفعہ رسول اللہ ﷺ مسجد میں تھے کہ آپ نے فرمایا: ’’اے عائشہ! مجھے کپڑا پکڑاؤ۔‘‘ انھوں نے کہا: میں نماز نہیں پڑھتی (میں حیض سے ہوں۔) آپ نے فرمایا: ’’بے شک وہ (حیض) تمھارے ہاتھ میں نہیں۔‘‘ تو انھوں نے کپڑا پکڑا دیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;