var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ نُبَيْهِ بْنِ وَهْبٍ عَنْ أَبَانَ بْنِ عُثْمَانَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمُحْرِمِ إِذَا اشْتَكَى رَأْسَهُ وَعَيْنَيْهِ أَنْ يُضَمِّدَهُمَا بِصَبِرٍ";
nasai.urdu = "حضرت عثمان رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے محرم کے بارے میں فرمایا: ’’جب اسے سر یا آنکھوں میں تکلیف ہو تو اپنی آنکھوں پر ایلوے کا لیپ کرے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;