var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الصَّفَّارُ قَالَ حَدَّثَنَا أَبُو دَاوُدَ يَعْنِي الْحَفَرِيَّ عَنْ سُفْيَانَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ مَاتَ رَجُلٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثِيَابِهِ وَلَا تُخَمِّرُوا وَجْهَهُ وَرَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ ایک (محرم) آدمی فوت ہوگیا تو نبیﷺ نے فرمایا: ’’اسے پانی اور بیری کے پتوں سے غسل دو اور اس کے (احرام کے) کپڑوں میں اسے کفنا دو۔اور اس کے چہرے اور سر کو نہ ڈھانپو۔یہ قیامت کے دن لبیک کہتا ہوا اٹھے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;