var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ عَنْ حَمَّادٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُوَافِينَ لِهِلَالِ ذِي الْحِجَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَاءَ أَنْ يُهِلَّ بِحَجٍّ فَلْيُهِلَّ وَمَنْ شَاءَ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ بِعُمْرَةٍ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ ہم رسول اللہﷺ کے ساتھ ذوالحجہ کا چاند طلوع ہونے سے چند دن قبل (حج کو) نکلے۔رسول اللہﷺ نے فرمایا: ’’تم میں سے جو شخص صرف حج کا احرام باندھنا چاہے،وہ حج کا احرام باندھے اور جو عمرے کا احرام باندھنا چاہے،وہ عمرے کا احرام باندھے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;