var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ الطَّبَرَانِيُّ أَبُو بَكْرٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي مَنْصُورٌ وَسُلَيْمَانُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَرَى إِلَّا أَنَّهُ الْحَجُّ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ ہم رسول اللہﷺ کے ساتھ نکلے تو ہمارا ارادہ یہی تھا کہ یہ صرف حج ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;