var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ عَبِيدَةَ عَنْ الْأَعْمَشِ ح و أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاوِلِينِي الْخُمْرَةَ مِنْ الْمَسْجِدِ قَالَتْ إِنِّي حَائِضٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَتْ حَيْضَتُكِ فِي يَدِكِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کے رسول ﷺ نے فرمایا: ’’مجھے مسجد سے چٹائی پکڑا دو۔‘‘ میں نے کہا: میں حالت حیض میں ہوں تو رسول اللہ ﷺ نے فرمایا: ’’تمھارا حیض تمھارے ہاتھ میں نہیں ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;