var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُصْعَبُ بْنُ الْمِقْدَامِ عَنْ زِائِدَةَ عَنْ مَنْصُورٍ عَنْ شَقِيقٍ قَالَ أَنْبَأَنَا الصُّبَيُّ فَذَكَرَ مِثْلَهُ قَالَ فَأَتَيْتُ عُمَرَ فَقَصَصْتُ عَلَيْهِ الْقِصَّةَ إِلَّا قَوْلَهُ يَا هَنَاهْ";
nasai.urdu = "حضرت عبسی نے (مذکورہ بالا) کے مثل حدیث بیان کی۔کہا: پھر میں حضرت عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا،پھر پورا قصہ (واقعہ) بیان کیا لیکن یَا ھَنَّاہُ! ’’اے وہ ہریم!‘‘ کے الفاظ بیان نہیں کیے۔";
nasai.hukam = "حسن";
nasai.description = ``;