var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي حُمَيْدُ بْنُ هِلَالٍ قَالَ سَمِعْتُ مُطَرِّفًا يَقُولُ قَالَ لِي عِمْرَانُ بْنُ حُصَيْنٍ جَمَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ حَجٍّ وَعُمْرَةٍ ثُمَّ تُوُفِّيَ قَبْلَ أَنْ يَنْهَى عَنْهَا وَقَبْلَ أَنْ يَنْزِلَ الْقُرْآنُ بِتَحْرِيمِهِ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے حج اور عمرہ اکٹھا کیا،پھر آپ فوت ہوگئے،نہ تو آپ نے (اس سے) روکا اور نہ قرآن میں اس کی حرمت کا حکم نازل ہوا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;