var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ عِمْرَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ حَجٍّ وَعُمْرَةٍ ثُمَّ لَمْ يَنْزِلْ فِيهَا كِتَابٌ وَلَمْ يَنْهَ عَنْهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهِمَا رَجُلٌ بِرَأْيِهِ مَا شَاءَ";
nasai.urdu = "حضرت عمران رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے حج و عمرہ اکٹھا کیا،پھر (اس سے روکنے کے بارے میں) کوئی حکم نازل نہیں ہوا،نہ رسول اللہﷺ نے اس سے منع فرمایا۔(بعد میں) ایک شخص (حضرت عمر رضی اللہ عنہ) نے اپنی رائے سے اس کے بارے میں جو چاہا،کیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;