var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى عَنْ هُشَيْمٍ عَنْ يَحْيَى وَعَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ وَحُمَيْدٌ الطَّوِيلُ ح وَأَنْبَأَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ وَحُمَيْدٌ الطَّوِيلُ وَيَحْيَى بْنُ أَبِي إِسْحَقَ كُلُّهُمْ عَنْ أَنَسٍ سَمِعُوهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَبَّيْكَ عُمْرَةً وَحَجًّا لَبَّيْكَ عُمْرَةً وَحَجًّا";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہﷺ کو [لَبَّیْکَ عُمْرَۃً وَّ حَجًّا] ’’اے اللہ! میں تیرے سامنے حج و عمرے کے لیے حاضر ہوں۔‘‘ فرماتے ہوئے سنا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;