var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ قَالَ أَنْبَأَنَا أَبِي قَالَ أَنْبَأَنَا أَبُو حَمْزَةَ عَنْ مُطَرِّفٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ عُمَرَ يَقُولُ وَاللَّهِ إِنِّي لَأَنْهَاكُمْ عَنْ الْمُتْعَةِ وَإِنَّهَا لَفِي كِتَابِ اللَّهِ وَلَقَدْ فَعَلَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي الْعُمْرَةَ فِي الْحَجِّ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ میں نے حضرت عمر رضی اللہ عنہ کو فرماتے سنا کہ اللہ کی قسم! میں تمھیں تمتع سے روکتا ہوں،حالانکہ میں جانتا ہوں کہ اس کا ذکر اللہ کا کتاب میں ہے اور اللہ کے رسولﷺ نے یہ کیا ہے،یعنی حج سے پہلے عمرہ کرنا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;