var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ مَنْبُوذٍ عَنْ أُمِّهِ أَنَّ مَيْمُونَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ رَأْسَهُ فِي حَجْرِ إِحْدَانَا فَيَتْلُو الْقُرْآنَ وَهِيَ حَائِضٌ وَتَقُومُ إِحْدَانَا بِالْخُمْرَةِ إِلَى الْمَسْجِدِ فَتَبْسُطُهَا وَهِيَ حَائِضٌ";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کے رسول ﷺ ازواج مطہرات میں سے کسی کی گود میں سر رکھتے اور قرآن مجید کی تلاوت فرماتے،حالانکہ وہ حیض سے ہوتی تھی۔اسی طرح ہم میں سے کوئی چٹائی لے کر مسجد میں بچھا دیتی تھی،حالانکہ وہ حائضہ ہوتی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أم منبوذ: لم أجد من وثقھا۔`;
nasai.anwaar = [322,1];