var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ وَاسِعٍ عَنْ مُطَرِّفٍ قَالَ قَالَ لِي عِمْرَانُ بْنُ حُصَيْنٍ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ تَمَتَّعَ وَتَمَتَّعْنَا مَعَهُ قَالَ فِيهَا قَائِلٌ بِرَأْيِهِ";
nasai.urdu = "حضرت مطرف فرماتے ہیں کہ حضرت عمران بن حصین رضی اللہ عنہ نے مجھ سے کہا: رسول اللہﷺ نے تمتع فرمایا۔ہم نے بھی آپ کے ساتھ تمتع کیا،پھر ایک کہنے والے نے اپنی رائے سے کہا (کہ تمتع نہیں کرنا چاہیے)۔";
nasai.hukam = "حسن";
nasai.description = ``;