var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لَهُ أَنْبَأَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ أُمِّهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَأْسُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجْرِ إِحْدَانَا وَهِيَ حَائِضٌ وَهُوَ يَتْلُو الْقُرْآنَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ کا سر مبارک ہم (ازواج مطہرات) میں سے کسی ایک کی گود میں ہوتا تھا جب کہ وہ حیض کی حالت میں ہوتی تھی اور قرآن مجید تلاوت فرماتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;