var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ تَلْبِيَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيكَ لَكَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ کی لبیک اس طرح تھی: [لَبَّیْکَ اللّٰھُمَّ! لَبَّیْکَ… لَا شَرِیْکَ لَکَ] ’’میں حاضر ہوں۔اے اللہ! میں حاضر ہوں۔بار بار حاضر ہوں۔تیرا کوئی شریک نہیں۔میں حاضر ہوں۔یقینا تمام تعریفیں تیرے لیے ہیں اور انعامات تیرے ساتھ خاص ہیں اور حکومت بھی تیری ہی ہے۔تیرا کوئی شریک نہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;