var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبَانَ بْنِ تَغْلِبَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ كَانَ مِنْ تَلْبِيَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبیﷺ کی لبیک یوں تھی: [لَبَّیْکَ اللّٰھُمَّ! لَبَّیْکَ… اِنَّ الْحَمْدَ وَالنَّعْمَۃَ لَکَ] ’’میں حاضر ہوں۔اے اللہ! میں حاضر ہوں۔بار بار حاضر ہوں۔تیرا کوئی شریک نہیں۔حاضر ہوں۔یقینا تمام تعریفیں اور انعامات تیرے لیے خاص ہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;