var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ عَنْ خَلَّادِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَاءَنِي جِبْرِيلُ فَقَالَ لِي يَا مُحَمَّدُ مُرْ أَصْحَابَكَ أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالتَّلْبِيَةِ";
nasai.urdu = "حضرت سائب رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’میرے پاس جبریل علیہ السلام آئے اور کہنے لگے: اے محمد! اپنے ساتھیوں کو حکم دیں کہ لبیک بلند آواز سے کہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;