var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ السَّلَامِ عَنْ خُصَيْفٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ فِي دُبُرِ الصَّلَاةِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے نماز کے بعد تلبیہ پکارا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ترمذی (819)<br>خصیف: لیس بالقوي،کما قال النسائي في کتاب الضعفاء و المتروکین (177) وضعفہ الجمہور (انظر سنن أبي داود بتحقیقی: 266)`;
nasai.anwaar = [342,1];