var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَنْبَأَنَا النَّضْرُ قَالَ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ بِالْبَيْدَاءِ ثُمَّ رَكِبَ وَصَعِدَ جَبَلَ الْبَيْدَاءِ وَأَهَلَّ بِالْحَجِّ وَالْعُمْرَةِ حِينَ صَلَّى الظُّهْرَ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے ظہر کی نماز بیداء میں پڑھی،پھر سوار ہوئے اور بیداء کے پہاڑ پر چڑھے اور جب ظہر کی نماز پڑھی تھی،سی وقت حج اور عمرے کی لبیک کہی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (2663)`;
nasai.anwaar = [342,1];