var nasai = {};
nasai.arabic = "أَخْبَرَنِي عِمْرَانُ بْنُ يَزِيدَ قَالَ أَنْبَأَنَا شُعَيْبٌ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ جَعْفَرَ بْنَ مُحَمَّدٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ جَابِرٍ فِي حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَتَى ذَا الْحُلَيْفَةِ صَلَّى وَهُوَ صَامِتٌ حَتَّى أَتَى الْبَيْدَاءَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے نبیﷺ کے حجۃ الوداع کے بارے میں روایت ہے کہ جب آپﷺ ذوالحلیفہ میں تشریف لائے تو آپ نے نماز پڑھی۔آپ (لبیک سے) خاموش رہے حتیٰ کہ آپ بیداء میں پہنچے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;