var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ حَاتِمِ بْنِ إِسْمَاعِيلَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمٍ أَنَّهُ سَمِعَ أَبَاهُ يَقُولُ بَيْدَاؤُكُمْ هَذِهِ الَّتِي تَكْذِبُونَ فِيهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ مَسْجِدِ ذِي الْحُلَيْفَةِ";
nasai.urdu = "حضرت سالم نے اپنے والد (حضرت ابن عمر رضی اللہ عنہ) کو فرماتے سنا کہ یہ تمھاری بیداء ہے جس کی بابت تم نبیﷺ پر جھوٹ بولتے (غلط بیانی کرتے) ہو۔نبیﷺ نے ذوالحلیفہ کی مسجد سے لبیک کہہ لیا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;