var nasai = {};
nasai.arabic = "أَخْبَرَنِي عِيسَى بْنُ إِبْرَاهِيمَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْكَبُ رَاحِلَتَهُ بِذِي الْحُلَيْفَةِ ثُمَّ يُهِلُّ حِينَ تَسْتَوِي بِهِ قَائِمَةً";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہﷺ کو دیکھا کہ آپ ذوالحلیفہ میں اپنی سواری پر سوار ہوتے تھے،پھر سواری آپ کو لے کر کھڑی ہوتی تو آپ لبیک فرماتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;