var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُومِئُ إِلَيَّ رَأْسَهُ وَهُوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی ﷺ اعتکاف کی حالت میں اپنا سر میرے قریب کر دیتے،میں اسے دھو دیتی،حالانکہ میں حیض کی حالت میں ہوتی تھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;