var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ أَنْبَأَنَا شُعَيْبٌ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي صَالِحُ بْنُ كَيْسَانَ ح و أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا إِسْحَقُ يَعْنِي ابْنَ يُوسُفَ عَنْ ابْنِ جُرَيْجٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يُخْبِرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ حِينَ اسْتَوَتْ بِهِ رَاحِلَتُهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان فرمایا کرتے تھے کہ نبیﷺ اس وقت لبیک کہتے جب آپ کی سواری آپ کو لے کر کھڑی ہوتی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;