var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ أَنْبَأَنَا ابْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ وَابْنِ جُرَيْجٍ وَابْنِ إِسْحَقَ وَمَالِكِ بْنُ أَنَسٍ عَنْ الْمَقْبُرِيِّ عَنْ عُبَيْدِ بْنِ جُرَيْجٍ قَالَ قُلْتُ لِابْنِ عُمَرَ رَأَيْتُكَ تُهِلُّ إِذَا اسْتَوَتْ بِكَ نَاقَتُكَ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُهِلُّ إِذَا اسْتَوَتْ بِهِ نَاقَتُهُ وَانْبَعَثَتْ";
nasai.urdu = "حضرت عبید بن جریج بیان کرتے ہیں کہ میں نے حضرت ابن عمر رضی اللہ عنہ سے عرض کیا کہ میں نے آپ کو دیکھا ہے آپ اس وقت لبیک کہتے ہیں جب سواری آپ کو لے کر کھڑی ہوتی ہے (کیا وجہ ہے؟) انھوں نے فرمایا: بلا شبہ نبیﷺ بھی اسی وقت لبیک فرمایا کرتے تھے جب آپ کی سواری آپ کو لے کر اٹھتی اور سیدھی کھڑی ہو جاتی۔";
nasai.hukam = "صحیح";
nasai.description = ``;