var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ نَفَسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْأَلُهُ كَيْفَ تَفْعَلُ فَأَمَرَهَا أَنْ تَغْتَسِلَ وَتَسْتَثْفِرَ بِثَوْبِهَا وَتُهِلَّ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ حضرت اسماء بنت عمیسؓ نے (حجۃ الوداع کے موقع پر ذوالحلیفہ میں) محمد بن ابی بکر کو جنم دیا تو انھوں نے رسول اللہﷺ کو پیغام بھیجا،وہ آپ سے پوچھ رہی تھیں کہ اب کیا کرے؟ آپ نے انھیں حکم دیا کہ غسل کر کے لنگوٹ باندھ لے اور لبیک کہے (یعنی احرام شروع کر دے۔)";
nasai.hukam = "حسن";
nasai.description = ``;