var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا حَبِيبٌ عَنْ عَمْرِو بْنِ هَرِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ وَعِكْرِمَةُ عَنْ ابْنِ عَبَّاسٍ أَنَّ ضُبَاعَةَ أَرَادَتْ الْحَجَّ فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَشْتَرِطَ فَفَعَلَتْ عَنْ أَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ حضرت ضباعہؓ نے حج کا ارادہ کیا تو نبیﷺ نے انھیں حکم دیا کہ وہ (احرام کے وقت) شرط لگا لیں تو انھوں نے رسول اللہﷺ کے حکم سے ایسے ہی کیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;