var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ وَذَكَرَ آخَرُ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخْرِجُ إِلَيَّ رَأْسَهُ مِنْ الْمَسْجِدِ وَهُوَ مُجَاوِرٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کے رسول ﷺ اعتکاف کی حالت میں اپنا سر مبارک مسجد سے باہر میری طرف نکال دیتے اور میں اسے دھو دیتی تھی،حالانکہ میں حیض کی حالت میں ہوتی تھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;