var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى عَنْ هُشَيْمٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ الْأَعْرَجِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْعَرَ بُدْنَهُ مِنْ الْجَانِبِ الْأَيْمَنِ وَسَلَتَ الدَّمَ عَنْهَا وَأَشْعَرَهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے اپنے اونٹوں کو دائیں جانب زخم لگایا،پھر اس سے خون پونچھا۔اس طرح آپ نے اشعار کیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;