var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ الْأَعْرَجِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا كَانَ بِذِي الْحُلَيْفَةِ أَمَرَ بِبَدَنَتِهِ فَأُشْعِرَ فِي سَنَامِهَا مِنْ الشِّقِّ الْأَيْمَنِ ثُمَّ سَلَتَ عَنْهَا وَقَلَّدَهَا نَعْلَيْنِ فَلَمَّا اسْتَوَتْ بِهِ عَلَى الْبَيْدَاءِ أَهَلَّ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ جب ذوالحلیفہ میں پہنچے تو آپ نے اپنی اونٹنی کے بارے میں حکم دیا تو اس کی کوہان کی دائیں جانب اشعار کیا گیا،پھر آپ نے اس سے خون پونچھا۔اور دو جوتے (رسی میں ڈال کر) اس کے گلے میں لٹکا دیے۔جب اونٹنی آپ کو لے کر بیداء پر چڑھی تو آپ نے بلند آواز سے لبیک کہا۔";
nasai.hukam = "حسن";
nasai.description = ``;