var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهْدِي مِنْ الْمَدِينَةِ فَأَفْتِلُ قَلَائِدَ هَدْيِهِ ثُمَّ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُهُ الْمُحْرِمُ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ رسول اللہﷺ مدینہ منورہ سے قربانی کے جانور مکہ مکرمہ کو بھیجا کرتے تھے۔میں آپ کے قربانی کے جانوروں کے قلادے (رسیاں) بٹتی تھی،پھر آپ ان چیزوں سے پرہیز نہیں فرماتے تھے جن سے ایک محرم پرہیز کرتا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;