var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ قَالَ أَنْبَأَنَا يَزِيدُ قَالَ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَبْعَثُ بِهَا ثُمَّ يَأْتِي مَا يَأْتِي الْحَلَالُ قَبْلَ أَنْ يَبْلُغَ الْهَدْيُ مَحِلَّهُ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ میں رسول اللہﷺ کے قربانی کے جانوروں کے لیے قلادے بٹتی (تیار کرتی) تھی،پھر آپ انھیں (حرم کے لیے) بھیج دیتے،پھر وہ سب کام کرتے جو ایک حلال شخص کرتا ہے،حالانکہ وہ جانور ابھی تک اپنی جگہ نہیں پہنچے ہوتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;