var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا عَامِرٌ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ إِنْ كُنْتُ لَأَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يُقِيمُ وَلَا يُحْرِمُ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ یقینا میں رسول اللہﷺ کے حرم کو بھیجے جانے والے جانوروں کے قلادے تیار کرتی تھی،پھر (انھیں بھیجنے کے بعد) آپ مدینہ منورہ ہی میں ٹھہرتے اور محرم نہیں بنتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;