var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الضَّعِيفُ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَفْتِلُ الْقَلَائِدَ لِهَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُقَلِّدُ هَدْيَهُ ثُمَّ يَبْعَثُ بِهَا ثُمَّ يُقِيمُ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُهُ الْمُحْرِمُ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ میں رسول اللہﷺ کے قربانی کے جانوروں کے لیے قلادے بٹتی (تیار کیا کرتی) تھی۔آپ وہ قلادے ان جانوروں کو پہناتے،پھر انھیں حرم کے لیے بھیج کر خود مدینہ منورہ ہی میں رہتے اور کسی ایسی چیز سے اجتناب نہیں فرماتے تھے جس سے محرم اجتناب کرتا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;