var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ عَنْ عَبِيدَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ لَقَدْ رَأَيْتُنِي أَفْتِلُ قَلَائِدَ الْغَنَمِ لِهَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يَمْكُثُ حَلَالًا";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے،فرماتی ہیں کہ مجھے اچھی طرح یاد ہے کہ میں رسول اللہﷺ کی حرم کو بھیجی جانے والی بکریوں کے لیے قلادے تیار کرتی تھی،پھر آپ (انھیں حرم کی طرف بھیجنے کے بعد) حلال رہتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;