var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ قَالَ حَدَّثَنَا حُسَيْنٌ يَعْنِي ابْنَ حَسَنٍ عَنْ ابْنِ عَوْنٍ عَنْ الْقَاسِمِ عَنْ أُمِّ الْمُؤْمِنِينَ قَالَتْ أَنَا فَتَلْتُ تِلْكَ الْقَلَائِدَ مِنْ عِهْنٍ كَانَ عِنْدَنَا ثُمَّ أَصْبَحَ فِينَا فَيَأْتِي مَا يَأْتِي الْحَلَالُ مِنْ أَهْلِهِ وَمَا يَأْتِي الرَّجُلُ مِنْ أَهْلِهِ";
nasai.urdu = "حضرت ام المومنین (عائشہ صدیقہؓ) نے فرمایا: میں نے وہ قلادے اون سے بٹے تھے جو ہمارے پاس تھی،پھر آپ (قلادے والے جانوروں کو حرم بھیجنے کے بعد) ہم میں رہے۔وہ تمام کام کرتے تھے جو ایک حلال شخص یا عام آدمی اپنی بیوی کے ساتھ کرتا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;