var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ حَفْصَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ قَدْ حَلُّوا بِعُمْرَةٍ وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَا أَحِلُّ حَتَّى أَنْحَرَ";
nasai.urdu = "حضرت حفصہ نبیﷺ کی زوجہ محترمہؓ نے عرض کیا: اے اللہ کے رسول! کیا وجہ ہے کہ لوگ تو عمرہ کر کے حلال ہوگئے ہیں مگر آپ اپنے عمرے سے حلال نہیں ہوئے؟ آپ نے فرمایا: ’’میں نے اپنے سر کو گوند لگائی ہے اور جانوروں کو قلادے ڈالے ہیں،لہٰذا میں حلال نہیں ہوں گا حتیٰ کہ میں جانور ذبح کروں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;