var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ وَهُوَ ابْنُ يَزِيدَ قَالَ حَدَّثَنَا أَفْلَحُ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ فَتَلْتُ قَلَائِدَ بُدْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ ثُمَّ قَلَّدَهَا وَأَشْعَرَهَا وَوَجَّهَهَا إِلَى الْبَيْتِ وَبَعَثَ بِهَا وَأَقَامَ فَمَا حَرُمَ عَلَيْهِ شَيْءٌ كَانَ لَهُ حَلَالًا";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ میں نے رسول اللہﷺ کے قربانی والے اونٹوں کے قلادے اپنے ہاتھوں سے بنے،پھر آپﷺ نے وہ قلادے ان کے گلوں میں لٹکائے اور انھیں شعار کیا اور انھیں بیت اللہ کی طرف بھیجا مگر خود (مدینہ منورہ میں) تشریف فرما رہے۔آپ پر کوئی ایسی چیز حرام نہ ہوئی جو پہلے حلال تھی۔(یعنی آپ پر احرام کی پابندیاں لاگو نہ ہوئیں۔)";
nasai.hukam = "حسن";
nasai.description = ``;