var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ فَتَلْتُ قَلَائِدَ بُدْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ لَمْ يُحْرِمْ وَلَمْ يَتْرُكْ شَيْئًا مِنْ الثِّيَابِ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ میں نے رسول اللہﷺ کے قربانی والے اونٹوں کے قلتادے تیار کیے،پھر آپ (انھیں حرم میں بھیجنے کے باوجود) نہ تو محرم بنے اور نہ کسی قسم کے کپڑے پہنے ترک کیے (جو محرم کو ترک کرنے پڑتے ہیں)۔";
nasai.hukam = "حسن";
nasai.description = ``;