var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا حَائِضٌ أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ ح وَأَنْبَأَنَا عَلِيُّ بْنُ شُعَيْبٍ قَالَ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا مِثْلَ ذَلِكَ";
nasai.urdu = "قتیبہ بن سعید نے امام مالک کی سند سے ایسی ہی حدیث بیان کی ہے مگر اس حدیث میں مالک کے استاذ ہشام بن عروہ کے بجائے زہری ہیں۔اس روایت میں قتیبہ کے ساتھ علی بن شعیب بھی ان کی موافقت کرتے ہیں-";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;