var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَنَمًا ثُمَّ لَا يُحْرِمُ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ میں رسول اللہﷺ کی قربانی کی بکریوں کے قلادے تیار کیا کرتی تھی،پھر (انھیں حرم میں بھیجنے کے باوجود) آپ محرم نہیں ہوتے تھے";
nasai.hukam = "حسن";
nasai.description = ``;