var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَنَمًا ثُمَّ لَا يُحْرِمُ";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے کہ میں رسول اللہﷺ کی قربانی (کی حرم) والی بکریوں کے لیے قلادے بٹا کرتی تھی،پھر آپ انھیں حرم کی طرف بھیجنے کے بعد) محرم نہیں ہوتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;