var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُمْ كَانُوا إِذَا كَانُوا حَاضِرِينَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ بَعَثَ بِالْهَدْيِ فَمَنْ شَاءَ أَحْرَمَ وَمَنْ شَاءَ تَرَكَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقول ہے کہ جب صحابہ رسول اللہﷺ کے ساتھ مدینہ منورہ میں ہوتے تھے تو وہ (بسا اوقات) قربانی کے جانور حرم کو بھیجتے تھے۔پھر جو چاہتا احرام باندھ لیتا،جو نہ چاہتا نہ باندھتا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;