var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَقُتَيْبَةُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُهُ الْمُحْرِمُ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ میں رسول اللہﷺ کے حرم جانے والے جانوروں کے لیے قلادے بٹا کرتی تھی،پھر آپ کسی ایسی چیز سے پرہیز نہیں فرماتے تھے جن سے محرم پرہیز کرتا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;