var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ يُحَدِّثُ عَنْ أَبِيهِ قَالَ قَالَتْ عَائِشَةُ كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا يَجْتَنِبُ شَيْئًا وَلَا نَعْلَمُ الْحَجَّ يُحِلُّهُ إِلَّا الطَّوَافُ بِالْبَيْتِ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ میں رسول اللہﷺ کے حرم کو جانے والے قربانی کے جانوروں کے قلادے خود بٹا کرتی تھی تو آپ (انھیں حرم بھیجنے کے بعد) کسی چیز سے اجتناب نہیں فرماتے تھے۔فرماتی ہیں: ہمیں معلوم ہے کہ حاجی کو بیت اللہ کا طواف ہی حلال کرتا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;