var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ إِنْ كُنْتُ لَأَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُخْرَجُ بِالْهَدْيِ مُقَلَّدًا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُقِيمٌ مَا يَمْتَنِعُ مِنْ نِسَائِهِ";
nasai.urdu = "حضرت عائشہ ؓفرماتی ہیں: بلا شبہ میں رسول اللہﷺ کے قربانی کے حرم جانے والے جانوروں کے قلادے خود بٹا کرتی تھی،پھر انھیں قلادے ڈال کر حرم کی طرف روانہ کیا جاتا جبکہ رسول اللہﷺ (مدینہ منورہ ہی میں) مقیم رہتے تھے اور اپنی عورتوں (کے ساتھ جماع) سے پرہیز نہیں فرماتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;