var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائَشَةَ قَالَتْ لَقَدْ رَأَيْتُنِي أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْغَنَمِ فَيَبْعَثُ بِهَا ثُمَّ يُقِيمُ فِينَا حَلَالًا";
nasai.urdu = "حضرت عائشہؓ نے فرمایا: مجھے اچھی طرح یاد ہے کہ میں رسول اللہﷺ کی قربانیوں،یعنی بکریوں کے لیے قلادے بٹا کرتی تھی،پھر آپ انھیں حرم کی طرف بھیجتے،پھر ہم میں حلال شخص کی طرح رہتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;