var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ قَالَ أَنْبَأَنَا بَهْزٌ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ سُلَيْمَانَ وَمَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَشَى إِلَى سُبَاطَةِ قَوْمٍ فَبَالَ قَائِمًا قَالَ سُلَيْمَانُ فِي حَدِيثِهِ وَمَسَحَ عَلَى خُفَّيْهِ وَلَمْ يَذْكُرْ مَنْصُورٌ الْمَسْحَ";
nasai.urdu = "حضرت حذیفہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ ایک قوم کے کوڑے کرکٹ کے ڈھیر کی طرف چلے۔پھر کھڑے کھڑے پیشاب کیا۔راویٔ حدیث سلیمان نے اپنی روایت میں کہا: اور پ نے اپنے موزوں پر مسح کیا۔جب کہ (ان کے ساتھی) منصور نے مسح کا ذکر نہیں کیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;