var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ أَنْبَأَنَا شُعَيْبُ بْنُ إِسْحَقَ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ سَمِعَهُ يُحَدِّثُ عَنْ جَابِرٍ أَنَّهُ سَمِعَهُ يُحَدِّثُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاقَ هَدْيًا فِي حَجِّهِ";
nasai.urdu = "حضرت محمد (باقر) رحمہ اللہ سے مروی ہے کہ میں نے حضرت جابر رضی اللہ عنہ کو بیان کرتے ہوئے سنا کہ نبیﷺ حجۃ الوداع میں اپنے قربانی کے جانوروں کو ہانک کر لے گئے۔";
nasai.hukam = "حسن";
nasai.description = ``;