var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً قَالَ ارْكَبْهَا قَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ قَالَ ارْكَبْهَا وَيْلَكَ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے ایک شخص کو دیکھا کہ وہ قربانی کے اونٹ کو ہانک کر لے جا رہا تھا (اور خود پیچھے پیدل چل رہا تھا۔) آپ نے فرمایا: ’’اس پر سوار ہو جا۔‘‘ اس نے کہا: اے اللہ کے رسول! یہ قربانی کا اونٹ ہے۔آپ نے فرمایا: ’’سوار ہو جا تجھ پر افسوس!‘‘ یہ آپ نے دوسری یا تیسری دفعہ فرمایا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;