var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ قَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ قَالَ فِي الرَّابِعَةِ ارْكَبْهَا وَيْلَكَ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے ایک آدمی کو دیکھا کہ وہ پیدل ایک اونٹ کو ہانکتا لے جا رہا ہے۔آپ نے فرمایا: ’’اس پر سوار ہو جا۔‘‘ اس نے کہا: یہ قربانی کا اونٹ ہے۔آپ نے فرمایا: ’’تو سوار ہو جا۔‘‘ اس نے پھر کہا: یہ قربانی کا اونٹ ہے۔آپ نے چوتھی دفعہ فرمایا: ’’اس پر سوار ہو جا۔تجھ پر افسوس!‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;