var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً وَقَدْ جَهَدَهُ الْمَشْيُ قَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ قَالَ ارْكَبْهَا وَإِنْ كَانَتْ بَدَنَةً";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے منقول ہے کہ نبیﷺ نے ایک آدمی کو دیکھا جو قربانی کا جانور ہانک کر لے جا رہا تھا۔وہ بے چارہ بڑی مشقت سے چل رہا تھا۔آپ نے فرمایا: ’’اس اونٹ پر سوار ہو جا۔‘‘ اس نے کہا: یہ قربانی کا اونٹ ہے۔آپ نے فرمایا: ’’سوار ہو جا اگرچہ یہ قربانی کا ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;