var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَسْأَلُ عَنْ رُكُوبِ الْبَدَنَةِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ارْكَبْهَا بِالْمَعْرُوفِ إِذَا أُلْجِئْتَ إِلَيْهَا حَتَّى تَجِدَ ظَهْرًا";
nasai.urdu = "حضرت ابو زبیر بیان کرتے ہیں کہ میرے سامنے حضرت جابر بن عبداللہ رضی اللہ عنہ سے قربانی کے اونٹ پر سوار ہونے کے بارے پوچھا گیا تو انھوں نے فرمایا: میں نے رسول اللہﷺ کو فرماتے سنا: ’’اس پر اچھے طریقے سے سواری کر،جب تجھے ضرورت پیش آئے حتیٰ کہ تجھے سواری مل جائے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;