var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ عَنْ طَاوُسٍ عَنْ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ عُمْرَتَنَا هَذِهِ لِعَامِنَا أَمْ لِأَبَدٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ لِأَبَدٍ";
nasai.urdu = "حضرت سراقہ بن مالک بن جعشم رضی اللہ عنہ سے روایت ہے کہ انھوں نے پوچھا: ’’اے اللہ کے رسول! آپ فرمائیں،کیا ہمارا یہ عمرہ (یعنی ایام حج کے دوران میں) صرف اسی سال کے لیے ہے یا ہمیشہ کے لیے ہے؟ آپ نے فرمایا: ’’ہمیشہ کے لیے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;