var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدَةَ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ مَالِكِ بْنِ دِينَارٍ عَنْ عَطَاءٍ قَالَ قَالَ سُرَاقَةُ تَمَتَّعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَمَتَّعْنَا مَعَهُ فَقُلْنَا أَلَنَا خَاصَّةً أَمْ لِأَبَدٍ قَالَ بَلْ لِأَبَدٍ";
nasai.urdu = "حضرت سراقہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے تمتع کیا اور ہم نے بھی آپ کے ساتھ تمتع کیا،پھر ہم نے کہا: کیا یہ ہمارے لیے خاص ہے یا ہمیشہ کے لیے ہے؟ آپ نے فرمایا: ’’بلکہ ہمیشہ کے لیے ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;