var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ الْأَعْمَشِ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ فَاهُ عَلَى الْمَوْضِعِ الَّذِي أَشْرَبُ مِنْهُ فَيَشْرَبُ مِنْ فَضْلِ سُؤْرِي وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ اپنا منہ مبارک اس جگہ رکھتے جہاں سے میں نے پیا ہوتا تھا،پھر مجھ سے بچا ہوا پانی نوش فرماتے،حالانکہ میں حیض کی حالت میں ہوتی تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;