var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الْعَزِيزِ وَهُوَ الدَّرَاوَرْدِيُّ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ الْحَارِثِ بْنِ بِلَالٍ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَفَسْخُ الْحَجِّ لَنَا خَاصَّةً أَمْ لِلنَّاسِ عَامَّةً قَالَ بَلْ لَنَا خَاصَّةً";
nasai.urdu = "حضرت بلال رضی اللہ عنہ بیان کرتے ہیں کہ میں نے کہا: اے اللہ کے رسول! کیا حج کو فسخ کر کے عمروہ بنانا صرف ہمارے لیے ہے یا سب لوگوں کے لیے؟ آپ نے فرمایا: ’’بلکہ صرف ہمارے لیے ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;