var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَبْدَ الْوَارِثِ بْنَ أَبِي حَنِيفَةَ قَالَ سَمِعْتُ إِبْرَاهِيمَ التَّيْمِيَّ يُحَدِّثُ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ قَالَ فِي مُتْعَةِ الْحَجِّ لَيْسَتْ لَكُمْ وَلَسْتُمْ مِنْهَا فِي شَيْءٍ إِنَّمَا كَانَتْ رُخْصَةً لَنَا أَصْحَابَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت ابوذر رضی اللہ عنہ نے تمتع کے بارے میں فرمایا کہ یہ تمھارے لیے نہیں۔نہ تمھارا اس سے کوئی تعلق ہے۔یہ تو صرف ہم،یعنی اصحاب محمدﷺ کے لیے رخصت تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;