var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذِهِ عُمْرَةٌ اسْتَمْتَعْنَاهَا فَمَنْ لَمْ يَكُنْ عِنْدَهُ هَدْيٌ فَلْيَحِلَّ الْحِلَّ كُلَّهُ فَقَدْ دَخَلَتْ الْعُمْرَةُ فِي الْحَجِّ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے منقول ہے،نبیﷺ نے فرمایا: ’۔یہ عمرہ ہے۔ہم نے (حج کے ساتھ) اس کا فائدہ اٹھایا ہے،لہٰذا جس شخص کے پاس قربانی کا جانور نہیں،وہ مکمل طور پر حلال ہو جائے،اور سن لو کہ عمرہ حج میں داخل ہوگیا ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;