var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ الصَّعْبِ بْنِ جَثَّامَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ حَتَّى إِذَا كَانَ بِوَدَّانَ رَأَى حِمَارَ وَحْشٍ فَرَدَّهُ عَلَيْهِ وَقَالَ إِنَّا حُرُمٌ لَا نَأْكُلُ الصَّيْدَ";
nasai.urdu = "حضرت صعب بن جثامہ رضی اللہ عنہ سے مروی ہے کہ نبیﷺ تشریف لائے حتی کہ جب آپ ودان میں پہنچے تو آپ نے ایک جنگلی گدھا (میرے پاس بطور تحفہ) دیکھا۔آپ نے وہ مجھے واپس فرما دیا اور فرمانے لگے: ’’ہم محرم ہیں۔یہ شکار نہیں کھا سکتے (کیونکہ یہ ہمارے لیے شکار کیا گیا ہے)۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;