var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا قَيْسُ بْنُ سَعْدٍ عَنْ عَطَاءٍ أَنَّ ابْنَ عَبَّاسٍ قَالَ لِزَيْدِ بْنِ أَرْقَمَ مَا عَلِمْتَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُهْدِيَ لَهُ عُضْوُ صَيْدٍ وَهُوَ مُحْرِمٌ فَلَمْ يَقْبَلْهُ قَالَ نَعَمْ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ نے حضرت زید بن ارقم رضی اللہ عنہ سے کہا: کیا آپ نہیں جانتے کہ نبیﷺ کی خدمت عالیہ میں شکار کیے ہوئے جانور کا ایک ٹکڑا پیش کیا گیا تھا جبکہ آپ محرم تھے،لہٰذا آپ نے قبول نہ فرمایا۔حضرت زید نے کہا: ہاں! (میں جانتا ہوں)۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;