var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَهْدَى الصَّعْبُ بْنُ جَثَّامَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِجْلَ حِمَارِ وَحْشٍ تَقْطُرُ دَمًا وَهُوَ مُحْرِمٌ وَهُوَ بِقُدَيْدٍ فَرَدَّهَا عَلَيْهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ حضرت صعب بن جثامہ رضی اللہ عنہ نے رسول اللہﷺ کی خدمت میں جنگلی گدھے کی ایک ران پیش کی جس سے خون کے قطرے گر رہے تھے۔آپ اس وقت محرم تھے اور مقام قدید میں فروکش تھے۔تو آپ نے اسے واپس فرما دیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;