var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ عَنْ عَمْرٍو عَنْ الْمُطَّلِبِ عَنْ جَابِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ صَيْدُ الْبَرِّ لَكُمْ حَلَالٌ مَا لَمْ تَصِيدُوهُ أَوْ يُصَادَ لَكُمْ قَالَ أَبُو عَبْد الرَّحْمَنِ عَمْرُو بْنُ أَبِي عَمْرٍو لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ وَإِنْ كَانَ قَدْ رَوَى عَنْهُ مَالِكٌ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’تمھارے لیے خشکی کا شکار کھانا حلال ہے بشرطیکہ تم نے شکار نہ کیا ہو اور نہ تمھارے لیے شکار کیا گیا ہو۔‘‘\nابوعبدالرحمٰن (امام نسائی رحمہ اللہ) بیان کرتے ہیں کہ راوی حدیث عمرو بن ابی عمرو علم حدیث میں قوی نہیں اگرچہ امام مالک نے ان سے روایت لی ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1851) ترمذی (846)`;
nasai.anwaar = [342,1];