var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ لَيْسَ عَلَى الْمُحْرِمِ فِي قَتْلِهِنَّ جُنَاحٌ الْغُرَابُ وَالْحِدَأَةُ وَالْعَقْرَبُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’پانچ جانور ایسے ہیں کہ محرم کے لیے انھیں قتل کر دینے میں کوئی حرج نہیں،کوا،چیل،بچھو،چوہا اور کاٹنے والا کتا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;