var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ يَقْتُلُهُنَّ الْمُحْرِمُ الْحَيَّةُ وَالْفَأْرَةُ وَالْحِدَأَةُ وَالْغُرَابُ الْأَبْقَعُ وَالْكَلْبُ الْعَقُورُ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے،نبی کریمﷺ نے فرمایا: ’’پانچ جانور ایسے ہیں جنھیں محرم قتل کر سکتا ہے: سانپ،چوہا،چیل،سفید پیٹ یا پشت والا کوا اور کاٹنے والا کتا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;