var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذِنَ فِي قَتْلِ خَمْسٍ مِنْ الدَّوَابِّ لِلْمُحْرِمِ الْغُرَابُ وَالْحِدَأَةُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ وَالْعَقْرَبُ";
nasai.urdu = "حضرت ا بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے محرم کو پانچ قسم کے جانور قتل کرنے کی اجازت دی ہے: کوا،چیل،چوہا،کاٹنے والا کتا اور بچھو۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;