var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو قُدَامَةَ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ مِنْ الدَّوَابِّ لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ أَوْ فِي قَتْلِهِنَّ وَهُوَ حَرَامٌ الْحِدَأَةُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ وَالْعَقْرَبُ وَالْغُرَابُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’پانچ جانور ایسے ہیں کہ جو شخص بھی انھیں قتل کر دے،(خواہ محرم ہی ہو)،اس پر کوئی حرج اور گناہ نہیں: چیل،چوہا،کاٹنے والا کتا،بچھو اور کوا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;