var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَا نَقْتُلُ مِنْ الدَّوَابِّ إِذَا أَحْرَمْنَا قَالَ خَمْسٌ لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ الْحِدَأَةُ وَالْغُرَابُ وَالْفَأْرَةُ وَالْعَقْرَبُ وَالْكَلْبُ الْعَقُورُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی نے عرض کیا: اے اللہ کے رسول! ہم جب محرم ہوں تو کن جانوروں کو قتل کر سکتے ہیں؟ آپﷺ نے فرمایا: ’’پانچ چیزیں ایسی ہیں کہ انھیں قتل کرنے والے پر کوئی گناہ نہیں: چیل،کوا،چوہا،بچھو اور کاٹنے والا کتا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;