var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ مَا يَقْتُلُ الْمُحْرِمُ قَالَ يَقْتُلُ الْعَقْرَبَ وَالْفُوَيْسِقَةَ وَالْحِدَأَةَ وَالْغُرَابَ وَالْكَلْبَ الْعَقُورَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ نبی کریمﷺ سے پوچھا گیا: محرم کون سے جانور قتل کر سکتا ہے؟ آپ نے فرمایا: ’’بچھو،چوہے،چیل،کوے اور کاٹنے والے کتے کو قتل کر سکتا ہے؟‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;