var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الدَّوَابِّ لَا جُنَاحَ فِي قَتْلِهِنَّ عَلَى مَنْ قَتَلَهُنَّ فِي الْحَرَمِ وَالْإِحْرَامِ الْفَأْرَةُ وَالْحِدَأَةُ وَالْغُرَابُ وَالْعَقْرَبُ وَالْكَلْبُ الْعَقُورُ";
nasai.urdu = "حضرت سالم کے والد محترم سے روایت ہے کہ نبیﷺ نے فرمایا: ’’پانچ جانور ایسے ہیں کہ اگر کوئی انھیں احرام کی حالت میں یا حرم کے اندر بھی قتل کر دے تو اس پر کوئی گناہ نہیں (اور وہ یہ ہیں): چوہا،چیل،کوا،بچھو اور کاٹنے والا کتا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;