var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي ابْنُ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ ابْنِ أَبِي عَمَّارٍ قَالَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ الضَّبُعِ فَأَمَرَنِي بِأَكْلِهَا قُلْتُ أَصَيْدٌ هِيَ قَالَ نَعَمْ قُلْتُ أَسَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ";
nasai.urdu = "حضرت ابن ابی عمار بیان کرتے ہیں کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے بجو کے بارے میں پوچھا تو انھوں نے مجھے اس کے کھانے کی اجازت بتلائی۔میں نے کہا کہ وہ بھی شکار ہے؟ انھوں نے فرمایا: ہاں۔میں نے کہا: کیا اپ نے یہ بات رسول اللہﷺ سے سنی ہے؟ انھوں نے فرمایا: ہاں۔";
nasai.hukam = "صحیح";
nasai.description = ``;