var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَ مَيْمُونَةَ وَهُمَا مُحْرِمَانِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے حضرت میمونہؓ سے نکاح کیا تو دونوں احرام کی حالت میں تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>حمید الطویل مدلس وعنعن۔<br>والحدیث السابق (الأصل: 2840،صحیح البخاري: 5114،وصحیح مسلم: 1410) یغني عنہ۔`;
nasai.anwaar = [343,1];