var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ نُبَيْهِ بْنِ وَهْبٍ أَنَّ أَبَانَ بْنَ عُثْمَانَ قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْكِحُ الْمُحْرِمُ وَلَا يَخْطُبُ وَلَا يُنْكِحُ";
nasai.urdu = "حضرت عثمان بن عفان رضی اللہ عنہ کا بیان ہے کہ رسول اللہﷺ نے فرمایا: ’’محرم نہ اپنا نکاح کرے،نہ نکاح کا پیغام بھیجے اور نہ کسی دوسرے کا نکاح کرے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;