var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ مَالِكٍ أَخْبَرَنِي نَافِعٌ عَنْ نُبَيْهِ بْنِ وَهْبٍ عَنْ أَبَانَ بْنِ عُثْمَانَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يَنْكِحَ الْمُحْرِمُ أَوْ يُنْكِحَ أَوْ يَخْطُبَ";
nasai.urdu = "حضرت عثمان رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے منع فرمایا کہ محرم اپنا نکاح کرے یا کسی اور کا نکاح کرے یا نکاح کا پیغام بھیجے۔";
nasai.hukam = "حسن";
nasai.description = ``;