var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ سُفْيَانَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ نُبَيْهِ بْنِ وَهْبٍ قَالَ أَرْسَلَ عُمَرُ بْنُ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ إِلَى أَبَانَ بْنِ عُثْمَانَ يَسْأَلُهُ أَيَنْكِحُ الْمُحْرِمُ فَقَالَ أَبَانُ إِنَّ عُثْمَانَ بْنَ عَفَّانَ حَدَّثَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْكِحُ الْمُحْرِمُ وَلَا يَخْطُبُ";
nasai.urdu = "حضرت نبیہ بن وہب سے روایت ہے کہ حضرت عمر بن عبیداللہ بن معمر نے حضرت ابان بن عثمان کی طرف پیغام بھیجا،وہ پوچھ رہے تھے کہ کیا محرم نکاح کر سکتا ہے؟ تو حضرت ابان نے کہا: مجھے حضرت عثمان بن عفان رضی اللہ عنہ نے بیان کیا کہ نبیﷺ نے ارشاد فرمایا: ’’محرم نہ نکاح کرے،نہ نکاح کا پیغام بھیجے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;