var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ قَالَ أَنْبَأَنَا عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ عَطَاءً قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ احْتَجَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ ثُمَّ قَالَ بَعْدُ أَخْبَرَنِي طَاوُسٌ عَنْ ابْنِ عَبَّاسٍ يَقُولُ احْتَجَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ";
nasai.urdu = "عمرو بن دینار رحمہ اللہ بیان کرتے ہیں کہ میں نے عطاء سے سنا،انھوں نے کہا: میں نے حضرت ابن عباس رضی اللہ عنہ سے سنا،وہ فرما رہے تھے کہ نبیﷺ نے احرام کی حالت میں سینگی لگوائی۔بعد ازاں انھوں (عمرو بن دینار) نے کہا کہ مجھے طاؤس نے حضرت ابن عباس رضی اللہ عنہ سے خبر دی،وہ فرما رہے تھے کہ نبیﷺ نے حالت احرام میں سینگی لگوائی۔";
nasai.hukam = "حسن";
nasai.description = ``;