var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ مِنْ وَثْءٍ كَانَ بِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے احرام کی حالت میں سینگی لگوائی کیونکہ آپ (کے پاؤں) کو موچ آگئی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3863) ابن ماجہ (3082)`;
nasai.anwaar = [343,1];