var nasai = {};
nasai.arabic = "أَخْبَرَنِي هِلَالُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ وَهُوَ ابْنُ عَثْمَةَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ قَالَ قَالَ عَلْقَمَةُ بْنُ أَبِي عَلْقَمَةَ أَنَّهُ سَمِعَ الْأَعْرَجَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَسَطَ رَأْسِهِ وَهُوَ مُحْرِمٌ بِلَحْيِ جَمَلٍ مِنْ طَرِيقِ مَكَّةَ";
nasai.urdu = "حضرت عبداللہ بن بحینہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے مکہ مکرمہ کے راستے میں لحی جمل کے مقام پر اپنے سر مبارک کے درمیان سینگی لگوائی،حالانکہ آپ محرم تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;