var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ وَقَصَتْ رَجُلًا مُحْرِمًا نَاقَتُهُ فَقَتَلَتْهُ فَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اغْسِلُوهُ وَكَفِّنُوهُ وَلَا تُغَطُّوا رَأْسَهُ وَلَا تُقَرِّبُوهُ طِيبًا فَإِنَّهُ يُبْعَثُ يُهِلُّ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ ایک محرم کو اس کی اونٹنی نے گرا کر مار دیا۔اسے رسول اللہﷺ کے پاس لایا گیا تو آپ نے فرمایا: ’’اسے غسل اور کفن دو مگر اس کا سر نہ ڈھانپو اور نہ خوشبو لگاؤ،یقینا یہ لبیک کہتا ہوا اٹھے گا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;