var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَنْ تَشُدَّ إِزَارَهَا ثُمَّ يُبَاشِرُهَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ اللہ کے رسول ﷺ ہم (ازواج مطہرات) میں سے کسی کو جب وہ حائضہ ہوتی،حکم دیتے تھے کہ وہ اپنا ازار باندھ لے،پھر آپ اس کے ساتھ لیٹ جاتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;