var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُزَاحِمٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ بْنِ خَالِدِ بْنِ أُسَيْدٍ عَنْ مُحَرِّشٍ الْكَعْبِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْجِعِرَّانَةِ لَيْلًا كَأَنَّهُ سَبِيكَةُ فِضَّةٍ فَاعْتَمَرَ ثُمَّ أَصْبَحَ بِهَا كَبَائِتٍ";
nasai.urdu = "حضرت محرش کعبی رضی اللہ عنہ سے روایت ہے کہ نبیﷺ جعرانہ سے ایسی رات میں نکلے جو پگھلی ہوئی چاندی کی طرح سفید تھی،پھر آپ نے (مکہ مکرمہ پہنچ کر) عمرہ فرمایا اور پھر صبح سے پہلے واپس جعرانہ میں لوٹ آئے گویا کہ رات یہیں رہے ہوں۔";
nasai.hukam = "حسن";
nasai.description = ``;