var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ مِنْ الثَّنِيَّةِ الْعُلْيَا الَّتِي بِالْبَطْحَاءِ وَخَرَجَ مِنْ الثَّنِيَّةِ السُّفْلَى";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ اونچی گھاٹی سے مکہ مکرمہ میں داخل ہوئے جو بطحاء کے قریب ہے اور نیچی گھاٹی سے نکلے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;