var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَتْ إِحْدَانَا إِذَا حَاضَتْ أَمَرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَتَّزِرَ ثُمَّ يُبَاشِرُهَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ ہم (ازواج مطہرات) میں سے کسی کو حیض شروع ہوتا تو رسول اللہ ﷺ اسے حکم دیتے تھے کہ وہ ازار باندھ لے،پھر آپ اس کے ساتھ لیٹ جاتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;