var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ وَعَلَيْهِ الْمِغْفَرُ فَقِيلَ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ فَقَالَ اقْتُلُوهُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ مکہ مکرمہ میں داخل ہوئے تو آپ کے سر پر خود تھا۔آپ سے کہاگیا کہ ابن خطل کعبہ کے پردوں سے لٹکا ہوا ہے۔آپ نے فرمایا: ’’اسے قتل کر دو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;