var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمَّارٍ قَالَ حَدَّثَنِي أَبُو الزُّبَيْرِ الْمَكِّيُّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ بِغَيْرِ إِحْرَامٍ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے مروی ہے کہ نبیﷺ فتح مکہ کے دن مکہ مکرمہ میں داخل ہوئے تو آپ نے سیاہ پگڑی باندھ رکھی تھی اور آپ احرام کے بغیر تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;