var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لِصُبْحِ رَابِعَةٍ وَهُمْ يُلَبُّونَ بِالْحَجِّ فَأَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَحِلُّوا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ اور آپ کے صہابہ چار ذوالحجہ کی صبح کو حج کی لبیک کہتے ہوئے مکہ مکرمہ میں تشریف لائے۔رسول اللہﷺ نے انھیں حکم دیا کہ وہ (عمرہ کرنے کے بعد) حلال ہو جائیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;