var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ وَاللَّيْثِ عَنْ ابْنِ شِهَابٍ عَنْ حَبِيبٍ مَوْلَى عُرْوَةَ عَنْ بُدَيَّةَ وَكَانَ اللَّيْثُ يَقُولُ نَدَبَةَ مَوْلَاةُ مَيْمُونَةَ عَنْ مَيْمُونَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَاشِرُ الْمَرْأَةُ مِنْ نِسَائِهِ وَهِيَ حَائِضٌ إِذَا كَانَ عَلَيْهَا إِزَارٌ يَبْلُغُ أَنْصَافَ الْفَخِذَيْنِ وَالرُّكُبَتَيْنِ فِي حَدِيثِ اللَّيْثِ مُحْتَجِزَةً بِهِ";
nasai.urdu = "ام المومنین حضرت میمونہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ اپنی عورتوں میں سے کسی کے ساتھ لیٹ جایا کرتے تھے جب کہ وہ حیض سے ہوتی تھی،بشرطیکہ اس نے کمر پر ایسا ازار باندھ رکھا ہوتا تھا جو نصف رانوں یا گھٹنوں تک پہنچتا۔لیث کی حدیث میں ہے: وہ ازار باندھے ہوتی";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (267)`;
nasai.anwaar = [322,1];