var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا بِشْرٌ أَخْبَرَنِي أَبِي عَنْ الزُّهْرِيِّ أَخْبَرَنِي سُحَيْمٌ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْزُو هَذَا الْبَيْتَ جَيْشٌ فَيُخْسَفُ بِهِمْ بِالْبَيْدَاءِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ایک لشکر بیت اللہ پر حملہ کرنے آئے گا مگر اسے مقام بیداء پر دھنسا دیا جائے گا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;