var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ أَبُو حَاتِمٍ الرَّازِيُّ قَالَ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ قَالَ حَدَّثَنَا أَبِي عَنْ مِسْعَرٍ قَالَ أَخْبَرَنِي طَلْحَةُ بْنُ مُصَرِّفٍ عَنْ أَبِي مُسْلِمٍ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْتَهِي الْبُعُوثُ عَنْ غَزْوِ هَذَا الْبَيْتِ حَتَّى يُخْسَفَ بِجَيْشٍ مِنْهُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،نبیﷺ نے فرمایا: ’’لشکر بیت اللہ پرحملہ کرنے سے باز نہیں آئیں گے حتیٰ کہ ان میں سے ایک لشکر کو دھنسا دیا جائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;