var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسُ فَوَاسِقَ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْغُرَابُ وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُ وَالْعَقْرَبُ وَالْفَأْرَةُ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’پانچ موذی جانور حل اور حرم میں (ہر جگہ) قتل کیے جا سکتے ہیں: کوا،چیل،کاٹنے والا کتا،بچھو اور چوہا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;