var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ قَتَادَةَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ يُحَدِّثُ عَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسُ فَوَاسِقَ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْحَيَّةُ وَالْكَلْبُ الْعَقُورُ وَالْغُرَابُ الْأَبْقَعُ وَالْحِدَأَةُ وَالْفَأْرَةُ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’پانچ جانور موذی ہیں،انھیں حل اور حرم میں (ہر جگہ) قتل کیا جا سکتا ہے،سانپ،کاٹنے والا کتا،سفید پیٹ یا پشت والا کوا،چیل اور چوہا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;