var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْخَيْفِ مِنْ مِنًى حَتَّى نَزَلَتْ وَالْمُرْسَلَاتِ عُرْفًا فَخَرَجَتْ حَيَّةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوهَا فَابْتَدَرْنَاهَا فَدَخَلَتْ فِي جُحْرِهَا";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے منقول ہے کہ ہم رسول اللہﷺ کے ساتھ منیٰ میں وادی خیف کے مقام پر تھے کہ سورئہ والمرسلات اتری۔ایک سانپ نکلا۔رسول اللہﷺ نے فرمایا: ’’اسے قتل کر دو۔‘‘ ہم اس کی طرف لپکے لیکن وہ اپنے بل میں داخل ہوگیا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;