var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الرَّقِّيُّ الْقَطَّانُ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبَانُ بْنُ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ عُرْوَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ قَالَتْ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الدَّوَابِّ كُلُّهُنَّ فَاسِقٌ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْكَلْبُ الْعَقُورُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْعَقْرَبُ وَالْفَأْرَةُ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے،نبیﷺ نے فرمایا: ’’پانچ (قسم کے) جانور فاسق ہیں۔ان کو حل میں بھی قتل کیا جا سکتا ہے اور حرم میں بھی: کاٹنے والا کتا،کوا،چیل،بچھو اور چوہا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;