var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الدَّوَابِّ كُلُّهَا فَاسِقٌ يُقْتَلْنَ فِي الْحَرَمِ الْغُرَابُ وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُ وَالْفَأْرَةُ وَالْعَقْرَبُ";
nasai.urdu = "ام المومنین حضرت عائشہؓ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’پانچ (قسم کے) جانور فاسق ہیں جنھیں حرم میں بھی قتل کیا جا سکتا ہے: کوا،چیل،کاٹنے والا کتا،چوہا اور بچھو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;