var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ قَالَتْ حَفْصَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الدَّوَابِّ لَا حَرَجَ عَلَى مَنْ قَتَلَهُنَّ الْعَقْرَبُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ";
nasai.urdu = "نبیﷺ کی زوجہ محترمہ حضرت حفصہؓ بیان کرتی ہیں کہ رسول اللہﷺ نے فرمایا: ’’پانچ جانور ایسے ہیں جنھیں مار ڈالنے والے پر کوئی حرج نہیں: بچھو،کوا،چیل،چوہا اور کاٹنے والا کتا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;