var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ مَكَّةَ اسْتَقْبَلَهُ أُغَيْلِمَةُ بَنِي هَاشِمٍ قَالَ فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَآخَرَ خَلْفَهُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ جب مکہ تشریف لائے تو بنی ہاشم کے نوجوانوں نے آپ کا استقبال کیا۔آپ نے ایک کو اپنے آگے اور ایک کو اپنے پیچھے (سواری پر) بٹھا لیا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;