var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا قَزَعَةَ الْبَاهِلِيَّ يُحَدِّثُ عَنْ الْمُهَاجِرِ الْمَكِّيِّ قَالَ سُئِلَ جَابِرُ بْنُ عَبْدِ اللَّهِ عَنْ الرَّجُلِ يَرَى الْبَيْتَ أَيَرْفَعُ يَدَيْهِ قَالَ مَا كُنْتُ أَظُنُّ أَحَدًا يَفْعَلُ هَذَا إِلَّا الْيَهُودَ حَجَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ نَكُنْ نَفْعَلُهُ";
nasai.urdu = "حضرت مہاجر مکی سے روایت ہے کہ حضرت جابر رضی اللہ عنہ سے اس آدمی کے بارے میں پوچھا گیا جو بیت اللہ کو دیکھتا ہے،کیا وہ ہاتھ اٹھائے؟ وہ فرمانے لگے: میں تو نہیں سمجھتا کہ یہودیوں کے علاوہ کوئی شخص یہ کام کرتا ہو۔ہم نے رسول اللہﷺ کے ساتھ حج کیا۔ہم تو ایسے نہیں کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;