var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ مَنْ حَدَّثَكُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ قَائِمًا فَلَا تُصَدِّقُوهُ مَا كَانَ يَبُولُ إِلَّا جَالِسًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ جو شخص تم سے بیان کرے کہ اللہ کے رسول ﷺ نے کھڑے ہوکر پیشاب کیا تو اس کی تصدیق نہ کرو۔آپ بیٹھ کر ہی پیشاب کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;