var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ عَبْدِ الْحَمِيدِ عَنْ مُقْسَمٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما نبی ﷺ سے اس شخص کے بارے میں روایت کرتے ہیں جو اپنی بیوی سے حیض کی حالت میں جماع کرتا ہے کہ وہ ایک دینار یا نصف دینار صدقہ کرے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (264)`;
nasai.anwaar = [322,1];