var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ قَالَ سَأَلْتُ الْأَغَرَّ عَنْ هَذَا الْحَدِيثِ فَحَدَّثَ الْأَغَرُّ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ مِنْ الْمَسَاجِدِ إِلَّا الْكَعْبَةَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’میری اس مسجد میں ایک نماز دوسری مساجد میں ہزار نماز سے افضل ہے،علاوہ کعبہ مشرفہ کے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;