var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى عَنْ خَالِدٍ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ أَنَّ أُمَّ الْمُؤْمِنِينَ قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْلَا أَنَّ قَوْمِي وَفِي حَدِيثِ مُحَمَّدٍ قَوْمَكِ حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ لَهَدَمْتُ الْكَعْبَةَ وَجَعَلْتُ لَهَا بَابَيْنِ فَلَمَّا مَلَكَ ابْنُ الزُّبَيْرِ جَعَلَ لَهَا بَابَيْنِ";
nasai.urdu = "ام المومنین (حضرت عائشہؓ) سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’اگر میری یا تیری قوم کا دور جاہلیت قریب نہ ہوتا تو میں کعبے کو گرانے کا حکم دیتا اور اس کے دو دروازے بنا دیتا۔‘‘ جب حضرت ابن زبیر رضی اللہ عنہ کو اقتدار ملا توانھوں نے اس کے دو دروازے بنا دیے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;