var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَرِّبُ الْكَعْبَةَ ذُو السُّوَيْقَتَيْنِ مِنْ الْحَبَشَةِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’(قیامت کے قریب) دو چھوٹی چھوٹی پنڈلیوں والا حبشی بیت اللہ (کعبے) کو ڈھائے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;