var nasai = {};
nasai.arabic = "أَخْبَرَنَا حَاجِبُ بْنُ سُلَيْمَانَ الْمَنْبِجِيُّ عَنْ ابْنِ أَبِي رَوَّادٍ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَعْبَةَ فَسَبَّحَ فِي نَوَاحِيهَا وَكَبَّرَ وَلَمْ يُصَلِّ ثُمَّ خَرَجَ فَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ ثُمَّ قَالَ هَذِهِ الْقِبْلَةُ";
nasai.urdu = "حضرت اسامہ بن زید رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ کعبے کے اندر تشریف لے گئے۔آپ نے کعبے کے اطراف (کونوں) میں تسبیحات و تکبیرات کہیں،نماز نہیں پڑھی،پھر آپ باہر تشریف لائے تو مقام ابراہیم کے پیچھے (کعبہ رخ ہو کر) دو رکعات پڑھیں،پھر فرمایا: ’’یہ قبلہ ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>عبدالمجید بن عبدالعزیز بن أبي رواد: ضعفہ الجمھور (الفتح المبین: 82/ 3 ص 101)`;
nasai.anwaar = [343,1];