var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سَعِيدٍ الرِّبَاطِيُّ قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرٍ عَنْ عَمَّتِهِ صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْ حَدَّثَتْنَا عَائِشَةُ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَلَا أَدْخُلُ الْبَيْتَ قَالَ ادْخُلِي الْحِجْرَ فَإِنَّهُ مِنْ الْبَيْتِ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ میں نے عرض کیا: اے اللہ کے رسولﷺ! میں بیت اللہ کے اندر داخل نہ ہوں؟ آپ نے فرمایا: ’’حجر میں داخل ہو جاؤ۔یہ بیت اللہ کا (اندرونی) حصہ ہی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;