var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ عَبْدِ الْمَلِكِ عَنْ عَطَاءٍ عَنْ أُسَامَةَ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْبَيْتِ صَلَّى رَكْعَتَيْنِ فِي قُبُلِ الْكَعْبَةِ ثُمَّ قَالَ هَذِهِ الْقِبْلَةُ";
nasai.urdu = "حضرت اسامہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ بیت اللہ سے باہر تشریف لائے تو کعبے کے سامنے دو رکعات پڑھیں،پھر فرمایا: ’’یہ قبلہ ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;