var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ النَّسَائِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْبَيْتَ فَدَعَا فِي نَوَاحِيهِ كُلِّهَا وَلَمْ يُصَلِّ فِيهِ حَتَّى خَرَجَ مِنْهُ فَلَمَّا خَرَجَ رَكَعَ رَكْعَتَيْنِ فِي قُبُلِ الْكَعْبَةِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ مجھے حضرت اسامہ بن زید رضی اللہ عنہ نے بتایا کہ نبیﷺ بیت اللہ کے اندر داخل ہوئے تو اس کے تمام اطراف (چاروں کونوں) میں دعائیں کیں،مگر نماز نہیں پڑھی حتیٰ کہ باہر تشریف لے آئے اور کعبے کے عین سامنے دو رکعتیں پڑھیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;