var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي سُلَيْمَانُ الْأَحْوَلُ أَنَّ طَاوُسًا أَخْبَرَهُ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ وَهُوَ يَطُوفُ بِالْكَعْبَةِ بِإِنْسَانٍ يَقُودُهُ إِنْسَانٌ بِخِزَامَةٍ فِي أَنْفِهِ فَقَطَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ ثُمَّ أَمَرَهُ أَنْ يَقُودَهُ بِيَدِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ نبیﷺ کعبے کے طواف کے دوران میں ایک شخص کے پاس سے گزرے جس کی ناک میں نکیل ڈال کر ایک اور شخص اسے لے جا رہا تھا۔آپ نے اپنے دست مبارک سے وہ نکیل (رسی) کاٹ دی اور فرمایا: ’’اسے ہاتھ سے پکڑ کر چلاؤ۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;