var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنِي سُلَيْمَانُ الْأَحْوَلُ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ يَقُودُهُ رَجُلٌ بِشَيْءٍ ذَكَرَهُ فِي نَذْرٍ فَتَنَاوَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَطَعَهُ قَالَ إِنَّهُ نَذْرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ ایک آدمی کے پاس سے گزرے جسے ایک دوسرا آدمی کسی چیز سے چلا رہا تھا جس کی اس نے نذر مان رکھی تھی۔نبیﷺ نے اسے پکڑا اور توڑ دیا اور فرمایا: ’’یہ (عجب) نذر ہے!‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;