var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ بَابَاهَ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا بَنِي عَبْدِ مَنَافٍ لَا تَمْنَعُنَّ أَحَدًا طَافَ بِهَذَا الْبَيْتِ وَصَلَّى أَيَّ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ";
nasai.urdu = "حضرت جبیر بن مطعم رضی اللہ عنہ سے منقول ہے،نبیﷺ نے فرمایا: ’’اے عبد مناف کی اولاد! تم کسی کو بیت اللہ کے طواف اور نماز سے نہ روکو جس وقت بھی کوئی کرنا چاہے،دن ہو یا رات۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;