var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ قَالَتْ يَا رَسُولَ اللَّهِ مَا طُفْتُ طَوَافَ الْخُرُوجِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُقِيمَتْ الصَّلَاةُ فَطُوفِي عَلَى بَعِيرِكِ مِنْ وَرَاءِ النَّاسِ عُرْوَةُ لَمْ يَسْمَعْهُ مِنْ أُمِّ سَلَمَةَ";
nasai.urdu = "حضرت ام سلمہؓ فرماتی ہیں: اے اللہ کے رسول! اللہ کی قسم! میں نے طواف وداع نہیں کیا۔تو نبیﷺ نے فرمایا: ’’جب جماعت شروع ہو جائے تو تم اپنے اونٹ پر سوار ہو کر لوگوں کے اوپر اوپر سے طواف کر لینا۔‘‘ عروہ نے یہ حضرت ام سلمہؓ سے نہیں سنا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;