var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو الْمِقْدَامِ ثَابِتٌ الْحَدَّادُ عَنْ عَدِيِّ بْنِ دِينَارٍ قَالَ سَمِعْتُ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ قَالَ حُكِّيهِ بِضِلَعٍ وَاغْسِلِيهِ بِمَاءٍ وَسِدْرٍ";
nasai.urdu = "حضرت ام قیس بنت محصن سے روایت ہے،انھوں نے اللہ کے رسول ﷺ سے حیض کے خون کے بارے میں پوچھا جو کپڑے کو لگ جاتا ہے۔آپ نے فرمایا: ’’اس کو کسی لکڑی (یا ہڈی وغیرہ) سے کھرچ دو،پھر اس کو پانی اور بیری کے پتوں سے دھو دو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;