var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا شُعَيْبٌ وَهُوَ ابْنُ إِسْحَقَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ طَافَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ حَوْلَ الْكَعْبَةِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنِهِ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں: رسول اللہﷺ نے حجۃ الوداع میں اونٹ پر سوار ہو کر کعبے کے اردگرد طواف فرمایا اور آپ حجر اسود کو اپنی خم دار چھڑی کے ساتھ چھوتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;