var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَرَنَ الْحَجَّ وَالْعُمْرَةَ فَطَافَ طَوَافًا وَاحِدًا وَقَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ";
nasai.urdu = "حضرت نافع سے روایت ہے کہ حضرت ابن عمر رضی اللہ عنہ نے حج اور عمرے کا اکٹھا احرام باندھ اور ایک طواف کیا،پھر فرمایا: میں نے رسول اللہﷺ کو ایسے کرتے دیکھا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;