var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْأَعْلَى عَنْ سُوَيْدِ بْنِ غَفَلَةَ أَنَّ عُمَرَ قَبَّلَ الْحَجَرَ وَالْتَزَمَهُ وَقَالَ رَأَيْتُ أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَ حَفِيًّا";
nasai.urdu = "حضرت سوید بن غفلہ سے منقول ہے کہ حضرت عمر رضی اللہ عنہ نے حجر اسود کو بوسہ دیا اور اس سے چمٹ گئے۔فرمانے لگے: میں نے حضرت ابوالقاسم (رسول اللہ)ﷺ کو دیکھا،تجھ سے بہت شفقت ومحبت فرماتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;