var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ وَجَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَابِسِ بْنِ رَبِيعَةَ قَالَ رَأَيْتُ عُمَرَ جَاءَ إِلَى الْحَجَرِ فَقَالَ إِنِّي لَأَعْلَمُ أَنَّكَ حَجَرٌ وَلَوْلَا أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ مَا قَبَّلْتُكَ ثُمَّ دَنَا مِنْهُ فَقَبَّلَهُ";
nasai.urdu = "حضرت عابس بن ربیعہ سے روایت ہے کہ میں نے حضرت عمر رضی اللہ عنہ کو دیکھا کہ وہ حجر اسود کے پاس آئے اور فرمایا: مجھے یقین ہے کہ تو ایک پتھر ہے اور اگر میں نے رسول اللہﷺ کو تجھے بوسہ دیتے ہوئے نبہ دیکھا ہوتا تو میں تجھے بوسہ نہ دیتا،پھر اس کے قریب ہوئے اور بوسہ دیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;