var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَرْمُلُ الثَّلَاثَ وَيَمْشِي الْأَرْبَعَ وَيَزْعُمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ";
nasai.urdu = "حضرت نافع سے روایت ہے کہ حضرت عبداللہ بن عمر رضی اللہ عنہ پہلے تین چکروں میں رمل کرتے تھے اور آخری چار چکروں میں آرام سے چلتے تھے اور وہ فرماتے تھے کہ رسول اللہﷺ بھی ایسے ہی کیا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;