var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَعْقُوبُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا طَافَ فِي الْحَجِّ وَالْعُمْرَةِ أَوَّلَ مَا يَقْدَمُ فَإِنَّهُ يَسْعَى ثَلَاثَةَ أَطْوَافٍ وَيَمْشِي أَرْبَعًا ثُمَّ يُصَلِّي سَجْدَتَيْنِ ثُمَّ يَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ جب حج اور عمرے میں پہلا طواف کرتے تو تین چکروں میں تیز چلتے اور چار چکروں میں آہستہ چلتے،پھر دو رکعتیں پڑھتے،پھر صفا اور مروہ کے درمیان چکر لگاتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;