var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرٍو وَسُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ يَقْدَمُ مَكَّةَ يَسْتَلِمُ الرُّكْنَ الْأَسْوَدَ أَوَّلَ مَا يَطُوفُ يَخُبُّ ثَلَاثَةَ أَطْوَافٍ مِنْ السَّبْعِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ جب مکہ مکرمہ پہنچے تو طواف میں سب سے پہلے حجر اسود کو بوسہ دیتے۔سات میں سے تین چکروں میں کندھے ہلا کر تیز چلتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;