var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدٌ وَعَبْدُ الرَّحْمَنِ ابْنَا عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَا حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ كَثِيرِ بْنِ فَرْقَدٍ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَخُبُّ فِي طَوَافِهِ حِينَ يَقْدَمُ فِي حَجٍّ أَوْ عُمْرَةٍ ثَلَاثًا وَيَمْشِي أَرْبَعًا قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ ذَلِكَ";
nasai.urdu = "حضرت نافع سے روایت ہے کہ حضرت عبداللہ بن عمر رضی اللہ عنہ جب حج یا عمرے میں آتے تو اپنے (پہلے) طواف میں تین چکروں میں بھاگتے تھے اور چار چکروں میں چلتے تھے،نیز انھوں نے فرمایا کہ رسول اللہﷺ بھی ایسے ہی کیا کرتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;