var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَلَ مِنْ الْحِجْرِ إِلَى الْحِجْرِ حَتَّى انْتَهَى إِلَيْهِ ثَلَاثَةَ أَطْوَافٍ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو دیکھا کہ آپ نے حجر اسود سے حجر اسود تک رمل فرمایا حتی کہ تین چکر پورے ہوگئے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;