var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّهُ سَأَلَ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الثَّوْبِ الَّذِي كَانَ يُجَامِعُ فِيهِ قَالَتْ نَعَمْ إِذَا لَمْ يَرَ فِيهِ أَذًى";
nasai.urdu = "حضرت معاویہ بن ابو سفیان رضی اللہ عنہما نے نی ﷺ کی زوجۂ مطہرہ ام حبیبہ رضی اللہ عنہا سے پوچھا: کیا رسول اللہ ﷺ اس کپڑے میں نماز پڑھتے تھے جس میں جماع کرتے تھے؟ انھوں نے فرمایا: ہاں! جب اس میں کوئی آلودگی نہ دیکھتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;