var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرٍو وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُ مِنْ أَرْكَانِ الْبَيْتِ إِلَّا الرُّكْنَ الْأَسْوَدَ وَالَّذِي يَلِيهِ مِنْ نَحْوِ دُورِ الْجُمَحِيِّينَ";
nasai.urdu = "حضرت سالم کے والد (حضرت ابن عمر رضی اللہ عنہ) بیان کرتے ہیں کہ رسول اللہﷺ بیت اللہ کے کونوں میں سے صرف دو کونوں ہی کو چھوتے تھے۔ایک حجر اسود اور دوسرا اس کے ساتھ والا جو جمحیین کے گھروں (محلے) کی طرف ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;