var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ قَالَ قَالَ عَبْدُ اللَّهِ رَضِيَ اللَّهُ عَنْهُ مَا تَرَكْتُ اسْتِلَامَ هَذَيْنِ الرُّكْنَيْنِ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُهُمَا الْيَمَانِيَ وَالْحَجَرَ فِي شِدَّةٍ وَلَا رَخَاءٍ";
nasai.urdu = "حضرت عبداللہ (بن عمر) رضی اللہ عنہ سے مروی ہے کہ جب سے میں نے رسول اللہﷺ کو یہ دو کونے،حجر اسود اور رکن یمانی،چھوتے دیکھا ہے میں نے کبھی بھی،سختی ہو یا سہولت،ان دو کونوں کو چھونا ترک نہیں کیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;