var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ مَا تَرَكْتُ اسْتِلَامَ الْحَجَرِ فِي رَخَاءٍ وَلَا شِدَّةٍ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان کرتے ہیں کہ جب سے میں نے رسول اللہﷺ کو حجر اسود کو چھوتے دیکھا ہے،میں نے شدت ہو یا سہولت،کبھی اسے چھونا ترک نہیں کیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;