var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى وَسُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے حجۃ الوداع میں اونٹ پر سوار ہو کر طواف فرمایا۔آپ حجر اسود کو چھڑی کے ساتھ چھوتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;