var nasai = {};
nasai.arabic = "أَخْبَرَنَا بِشْرُ بْنُ هِلَالٍ قَالَ أَنْبَأَنَا عَبْدُ الْوَارِثِ عَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَطُوفُ بِالْبَيْتِ عَلَى رَاحِلَتِهِ فَإِذَا انْتَهَى إِلَى الرُّكْنِ أَشَارَ إِلَيْهِ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ (حجۃ الوداع میں) اپنی سواری پر بیٹھ کر بیت اللہ کا طواف فرما رہے تھے۔جب حجر اسود کے پاس پہنچتے تو اس کی طرف اشارہ فرماتے تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;