var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَمْرِو بْنِ مَيْمُونٍ الْجَزَرِيِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَغْسِلُ الْجَنَابَةَ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَخْرُجُ إِلَى الصَّلَاةِ وَإِنَّ بُقَعَ الْمَاءِ لَفِي ثَوْبِهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں رسول اللہ ﷺ کے کپڑے سے جنابت (منی) کو دھو دیتی تھی،پھر آپ نماز کے لیے تشریف لے جاتے جب کہ پانی کے نشانات آپ کے کپڑے میں نظر آتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;