var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ كَثِيرِ بْنِ كَثِيرٍ عَنْ أَبِيهِ عَنْ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ فَرَغَ مِنْ سُبُعِهِ جَاءَ حَاشِيَةَ الْمَطَافِ فَصَلَّى رَكْعَتَيْنِ وَلَيْسَ بَيْنَهُ وَبَيْنَ الطَّوَّافِينَ أَحَدٌ";
nasai.urdu = "حضرت مطلب بن ابی وداعہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہﷺ کو دیکھا جب آپ ساتویں چکر سے فارغ ہوئے تو آپ طواف والی جگہ کے (باہر والے) کنارے کے پاس آگئے اور دو رکعتیں پڑھیں۔(اس وقت) طواف کرنے والوں اور آپ کے درمیان کوئی شخص (بطور سترہ) نہ تھا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (759)`;
nasai.anwaar = [343,1];