var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو قَالَ يَعْنِي ابْنَ عُمَرَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَافَ بِالْبَيْتِ سَبْعًا وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَقَالَ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ(الاحزاب:21)";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ (مکہ مکرمہ) تشریف لائے تو بیت اللہ کے سات چکر لگائے۔مقام ابراہیم کے پیچھے دو رکعتیں پڑھیں اور صفا مروہ کے درمیان سات چکر لگائے۔پھر حضرت ابن عمر رضی اللہ عنہ نے قرآن کی آیت تلاوت فرمائی: لَقَدْ کَانَ لَکُمْ… ’’تمھارے لیے رسول اللہﷺ (کے طرز عمل) میں بہترین نمونہ ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;