var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا عَاصِمٌ وَمُغِيرَةُ ح وَأَنْبَأَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا عَاصِمٌ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ مِنْ مَاءِ زَمْزَمَ وَهُوَ قَائِمٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے زم زم کا پانی کھڑے ہو کر پیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;