var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ خَرَجَ مِنْ الْمَسْجِدِ وَهُوَ يُرِيدُ الصَّفَا وَهُوَ يَقُولُ نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا جب آپ مسجد سے نکل کر صفا مروہ کے طواف کے ارادے سے آرہے تھے: ’’ہم اس مقام سے ابتدا کریں گے جس کا ذکر اللہ تعالیٰ نے پہلے فرمایا ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;