var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا جَابِرٌ قَالَ خَرَجَ رَسُولُ اللَّهِ إِلَى الصَّفَا وَقَالَ نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ ثُمَّ قَرَأَ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ(البقرہ:158)";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ کوہ صفا کی طرف نکلے اور فرمایا: ’’ہم اس پہاڑی سے ابتدا کریں گے جس کا ذکر اللہ تعالیٰ نے پہلے فرمایا ہے۔‘‘ پھر آپ نے یہ آیت تلاوت فرمائی: اِنَّ الصَّفَا وَ الْمَرْوَۃَ مِنْ شَعَآئِرِ اللہِ ’’بلاشبہ صفا اور مروہ اللہ تعالیٰ کی مقرر کردہ علامات میں سے ہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;