var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا جَابِرٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَقِيَ عَلَى الصَّفَا حَتَّى إِذَا نَظَرَ إِلَى الْبَيْتِ كَبَّرَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ کوہ صفا پر چڑھے حتی کہ جب آپ کی نظر بیت اللہ پر پڑی تو آپ نے اللہ اکبر کہا۔";
nasai.hukam = "حسن";
nasai.description = ``;