var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ أَنْبَأَنَا شُعَيْبٌ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ مُحَمَّدٍ أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُ أَنَّهُ سَمِعَ جَابِرًا عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ وَقَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الصَّفَا يُهَلِّلُ اللَّهَ عَزَّ وَجَلَّ وَيَدْعُو بَيْنَ ذَلِكَ";
nasai.urdu = "حضرت محمد باقر رحمہ اللہ سے روایت ہے کہ میں نے حضرت جابر رضی اللہ عنہ سے نبیﷺ کے حج کے بارے میں سنا کہ آپ کوہ صفا پر کھڑے ہو کر (بار بار) لا الٰہ الا اللہ پڑھتے تھے اور اس ذکر کے دوران میں دعائیں بھی فرماتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;