var nasai = {};
nasai.arabic = "أَخْبَرَنِي عِمْرَانُ بْنُ يَزِيدَ قَالَ أَنْبَأَنَا شُعَيْبٌ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ طَافَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ عَلَى رَاحِلَتِهِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ لِيَرَاهُ النَّاسُ وَلِيُشْرِفَ وَلِيَسْأَلُوهُ إِنَّ النَّاسَ غَشُوهُ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے مروی ہے کہ نبیﷺ نے حجۃ الوداع میں بیت اللہ اور صفا مروہ کے طواف اپنی اونٹنی پر کیے تاکہ لوگ آپ کو دیکھ سکیں اور آپ ان سے اونچے ہوں اور وہ آپ سے سوال کر سکیں کیونکہ لوگوں نے آپ کو گھیر رکھا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;