var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ كَثِيرِ بْنِ جُمْهَانَ قَالَ رَأَيْتُ ابْنَ عُمَرَ يَمْشِي بَيْنَ الصَّفَا وَالْمَرْوَةِ فَقَالَ إِنْ أَمْشِي فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي وَإِنْ أَسْعَى فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَى";
nasai.urdu = "حضرت کثیر بن جمہان بیان کرتے ہیں کہ میں نے حضرت ابن عمر رضی اللہ عنہ کو صفا اور مروہ کے درمیان چلتے دیکھا۔(میں نے ان سے پوچھا) تو انھوں نے فرمایا: اگر میں چلتا ہوں تو میں نے رسول اللہﷺ کو چلتے دیکھا ہے اور اگر میں دوڑوں تو میں نے رسول اللہﷺ کو دوڑتے بھی دیکھا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;