var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ الْحَكَمُ أَخْبَرَنِي عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ أَنَّ عَائِشَةَ قَالَتْ لَقَدْ رَأَيْتُنِي وَمَا أَزِيدُ عَلَى أَنْ أَفْرُكَهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ مجھے اچھی طرح یاد ہے کہ میں اللہ کے رسول ﷺ کے کپڑے سے منی کو رگڑ دیا کرتی تھی۔اس سے زیادہ کچھ نہیں کرتی تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;