var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا الثَّوْرِيُّ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ رَأَيْتُ ابْنَ عُمَرَ ذَكَرَ نَحْوَهُ إِلَّا أَنَّهُ قَالَ وَأَنَا شَيْخٌ كَبِيرٌ";
nasai.urdu = "حضرت سعید بن جبیر سے روایت ہے کہ میں نے حضرت ابن عمر رضی اللہ عنہ کو دیکھا،پھر انھوں نے مندرجہ بالا روایت کی طرح بیان کیا مگر (آخر میں) کہا کہ حضرت ابن عمر رضی اللہ عنہ نے فرمایا: میں بوڑھا آدمی ہوں۔";
nasai.hukam = "حسن";
nasai.description = ``;