var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا صَدَقَةُ بْنُ يَسَارٍ عَنْ الزُّهْرِيِّ قَالَ سَأَلُوا ابْنَ عُمَرَ هَلْ رَأَيْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَلَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَقَالَ كَانَ فِي جَمَاعَةٍ مِنْ النَّاسِ فَرَمَلُوا فَلَا أُرَاهُمْ رَمَلُوا إِلَّا بِرَمَلِهِ";
nasai.urdu = "امام زہری بیان کرتے ہیں کہ لوگوں نے حضرت ابن عمر رضی اللہ عنہ سے پوچھا: کیا آپ نے رسول اللہﷺ کو صفا اور مروہ کے درمیان رمل کرتے دیکھا ہے؟ تو انھوں نے فرمایا کہ رسول اللہﷺ لوگوں کی ایک جماعت میں تھے اور وہ لوگ رمل کر رہے تھے۔میرا خیال ہے وہ آپ کے رمل کرنے کی وجہ ہی سے رمل کر رہے تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>الزہري لم یسمع من ابن عمر رضي اللہ عنہما فالسند منقطع۔`;
nasai.anwaar = [343,2];