var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ بُدَيْلٍ عَنْ الْمُغِيرَةِ بْنِ حَكِيمٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ امْرَأَةٍ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَى فِي بَطْنِ الْمَسِيلِ وَيَقُولُ لَا يُقْطَعُ الْوَادِي إِلَّا شَدًّا";
nasai.urdu = "ایک صحابیہؓ بیان کرتی ہیں کہ میں نے رسول اللہ ﷺ کو وادی کے پیٹ میں دوڑتے دیکھا ہے۔آپ فرما رہے تھے: ’’اس وادی کو ضرور دوڑ کر طے کیا جائے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;