var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا نَزَلَ مِنْ الصَّفَا مَشَى حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي سَعَى حَتَّى يَخْرُجَ مِنْهُ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ جب صفا سے اترتے تھے تو آرام سے چلتے تھے حتی کہ جب آپ کے قدم وادی کے پیٹ میں نشیبی جگہ پہنچتے تو آپ دوڑنے لگتے حتی کہ وادی سے نکل جاتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;