var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا جَابِرٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ يَعْنِي عَنْ الصَّفَا حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي الْوَادِي رَمَلَ حَتَّى إِذَا صَعِدَ مَشَى";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ کوہ صفا سے اترے حتیٰ کہ جب آپ کے قدم مبارک وادی میں اترے تو آپ نے رمل کیا،حتی کہ جب چڑھنا شروع ہوئے تو پھر چلنے لگے۔";
nasai.hukam = "حسن";
nasai.description = ``;