var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ أَنَّ طَاوُسًا أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ عَنْ مُعَاوِيَةَ أَنَّهُ قَصَّرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِشْقَصٍ فِي عُمْرَةٍ عَلَى الْمَرْوَةِ";
nasai.urdu = "حضرت معاویہ رضی اللہ عنہ سے مروی ہے کہ میں نے نبیﷺ کے عمرے میں آپ کے بال مبارک مروہ پر ایک تیر کے ساتھ کاٹے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;