var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مُعَاوِيَةَ قَالَ قَصَّرْتُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمَرْوَةِ بِمِشْقَصِ أَعْرَابِيٍّ";
nasai.urdu = "حضرت معاویہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کے بال مروہ پر ایک اعرابی کے تیر سے کاٹے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;