var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ عَنْ مُعَاوِيَةَ قَالَ أَخَذْتُ مِنْ أَطْرَافِ شَعْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِشْقَصٍ كَانَ مَعِي بَعْدَ مَا طَافَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ فِي أَيَّامِ الْعَشْرِ قَالَ قَيْسٌ وَالنَّاسُ يُنْكِرُونَ هَذَا عَلَى مُعَاوِيَةَ";
nasai.urdu = "حضرت معاویہ رضی اللہ عنہ ے مروی ہے کہ جب رسول اللہﷺ بیت اللہ اور صفا ومروہ کے طواف سے فارغ ہوئے تو میں نے آپ کے بالوں کے کنارے اپنے ایک تیرے سے کاٹے تھے۔اور یہ ذوالحجہ کے پہلے دہاکے کی بات ہے۔راوی قیس نے کہا: علماء حضرت معاویہ رضی اللہ عنہ کے ان الفاظ کو درست نہیں سمجھتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;