var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ أَخْبَرَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَسْتَنُّ وَطَرَفُ السِّوَاكِ عَلَى لِسَانِهِ وَهُوَ يَقُولُ عَأْ عَأْ";
nasai.urdu = "حضرت ابوموسیٰ رضی اللہ عنہ سےروایت ہے کہ میں اللہ کے رسول ﷺ کے پاس گیا تو آپ دانت صاف فرما رہے تھے اور مسواک کا سرا آپ کی زبان مبارک پر تھا اور آپ [عَأُ عَأُ] کر رہے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;