var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ قَالَ غَدَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مِنًى إِلَى عَرَفَةَ فَمِنَّا الْمُلَبِّي وَمِنَّا الْمُكَبِّرُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ بیان کرتے ہیں کہ ہم رسول اللہﷺ کے ساتھ منیٰ سے عرفات گئے۔کوئی لبیک کہتا تھا اور کوئی تکبیریں۔";
nasai.hukam = "صحیح";
nasai.description = ``;