var nasai = {};
nasai.arabic = "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا مُوسَى بْنُ عَلِيٍّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ يَوْمَ عَرَفَةَ وَيَوْمَ النَّحْرِ وَأَيَّامَ التَّشْرِيقِ عِيدُنَا أَهْلَ الْإِسْلَامِ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے منقول ہے،رسول اللہﷺ نے فرمایا: ’’یوم عرفہ (۹ ذوالحجہ) یوم نحر (۱۰ ذوالحجہ) اور ایام تشریق (۱۱،۱۲،۱۳ ذوالحجہ) ہم مسلمانوں کے لیے عید کے دن ہیں اور یہ کھانے پینے کے دن ہیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;