var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى جَمَلٍ أَحْمَرَ بِعَرَفَةَ قَبْلَ الصَّلَاةِ";
nasai.urdu = "حضرت نبیط رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہﷺ کو عرفات میں نماز سے پہلے ایک سرخ اونٹ پر خطبہ ارشاد فرماتے دیکھا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1916)`;
nasai.anwaar = [344,1];