var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الصَّلَاةَ لِوَقْتِهَا إِلَّا بِجَمْعٍ وَعَرَفَاتٍ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ ہر نماز اس کے وقت پر پڑھتے تھے مگر مزدلفہ اور عرفات میں (جمع کرتے تھے)۔";
nasai.hukam = "حسن";
nasai.description = ``;