var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ هُشَيْمٍ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ قَالَ قَالَ أُسَامَةُ بْنُ زَيْدٍ كُنْتُ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ فَرَفَعَ يَدَيْهِ يَدْعُو فَمَالَتْ بِهِ نَاقَتُهُ فَسَقَطَ خِطَامُهَا فَتَنَاوَلَ الْخِطَامَ بِإِحْدَى يَدَيْهِ وَهُوَ رَافِعٌ يَدَهُ الْأُخْرَى";
nasai.urdu = "حضرت اسامہ بن زید رضی اللہ عنہ بیان کرتے ہیں کہ میں (دوران وقوف) عرفات میں نبیﷺ کے پیچھے سوار تھا۔آپ ہاتھ اٹھا کر دعا کرنے لگے۔اتنے میں آپ کی اونٹنی ایک طرف کو مڑی تو مہار آپ کے ہاتھ سے گر پڑی۔آپ نے ایک ہاتھ سے مہار پکڑ لی اور دوسرا ہاتھ (دعا کے لیے) اٹھائے رکھا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;