var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَ أَضْلَلْتُ بَعِيرًا لِي فَذَهَبْتُ أَطْلُبُهُ بِعَرَفَةَ يَوْمَ عَرَفَةَ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا فَقُلْتُ مَا شَأْنُ هَذَا إِنَّمَا هَذَا مِنْ الْحُمْسِ";
nasai.urdu = "حضرت جبیر بن مطعم رضی اللہ عنہ سے روایت ہے کہ میرا ایک اونٹ گم ہوگیا۔میں اسے تلاش کرنے کے لیے عرفہ پہنچ گیا۔یہ عرفے کا دن تھا۔میں نے نبیﷺ کو وہاں وقوف کرتے دیکھا۔میں نے (دل میں) کہا: آپ کا یہاں کیا کام؟ آپ تو حمس میں سے ہیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;