var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبِي قَالَ أَتَيْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَسَأَلْنَاهُ عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثَنَا أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَرَفَةُ كُلُّهَا مَوْقِفٌ";
nasai.urdu = "حضرت محمد باقر رحمہ اللہ بیان کرتے ہیں کہ ہم حضرت جابر بن عبداللہ رضی اللہ عنہ کے پاس گئے اور ان سے نبیﷺ کے حج کے بارے میں پوچھا تو انھوں نے بیان کیا کہ اللہ تعالیٰ کے نبیﷺ نے فرمایا: ’’عرفات سارے کا سارا وقوف کی جگہ ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;