var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ السَّكِينَةُ وَأَمَرَهُمْ بِالسَّكِينَةِ وَأَوْضَعَ فِي وَادِي مُحَسِّرٍ وَأَمَرَهُمْ أَنْ يَرْمُوا الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے واپسی کا سفر کیا تو اطمینان و سکون سے چلتے رہے اور لوگوں کو سکون واطمینان سے چلنے کا حکم دیا،البتہ وادی محسر میں اپنی سواری کو تیز کر لیا اور لوگوں کو حکم دیا کہ وہ جمرۂ عقبہ (اور دوسرے جمرات) کو خذف کی کنکریوں جیسی کنکریوں سے رمی کریں۔";
nasai.hukam = "صحیح";
nasai.description = ``;