var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَبُو دَاوُدَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَاضَ مِنْ عَرَفَةَ وَجَعَلَ يَقُولُ السَّكِينَةَ عِبَادَ اللَّهِ يَقُولُ بِيَدِهِ هَكَذَا وَأَشَارَ أَيُّوبُ بِبَاطِنِ كَفِّهِ إِلَى السَّمَاءِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبیﷺ عرفات سے واپس چلے تو فرماتے تھے: ’’اے اللہ کے بندو! سکون واطمینان اختیار کرو۔‘‘ آپ اپنے ہاتھ سے اس طرح اشارہ فرما رہے تھے۔اور (راوی حدیث) ایوب نے اپنی ہتھیلی سے آسمان کی طرف اشارہ کیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;