var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ سُئِلَ عَنْ مَسِيرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ قَالَ كَانَ يَسِيرُ الْعَنَقَ فَإِذَا وَجَدَ فَجْوَةً نَصَّ وَالنَّصُّ فَوْقَ الْعَنَقِ";
nasai.urdu = "حضرت اسامہ بن زید رضی اللہ عنہ سے حجۃ الوداع میں نبیﷺ (کی سواری) کی چال کے بارے میں پوچھا گیا تو انھوں نے فرمایا: درمیانی چال چلتے تھے۔جب خالی جگہ پاتے تو سواری کو مزید تیز فرما دیتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;