var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ أَفَاضَ مِنْ عَرَفَةَ مَالَ إِلَى الشِّعْبِ قَالَ فَقُلْتُ لَهُ أَتُصَلِّي الْمَغْرِبَ قَالَ الْمُصَلَّى أَمَامَكَ";
nasai.urdu = "حضرت اسامہ بن زید رضی اللہ عنہ سے روایت ہے کہ نبیﷺ جب عرفات سے واپس لوٹے تو (راستے میں) ایک گھاٹی کی طرف ہو لیے۔میں نے عرض کیا: (اللہ کے رسول!) مغرب کی نماز پڑھیں گے؟ فرمایا: ’’(نہیں) نماز کی جگہ تو آگے (مزدلفہ میں) ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;