var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ أَنَّهَا أَتَتْ بِابْنٍ لَهَا صَغِيرٍ لَمْ يَأْكُلْ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَجْلَسَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجْرِهِ فَبَالَ عَلَى ثَوْبِهِ فَدَعَا بِمَاءٍ فَنَضَحَهُ وَلَمْ يَغْسِلْهُ";
nasai.urdu = "حضرت ام قیس بنت محصن رضی اللہ عنہا سے روایت ہے کہ میں اپنے ایک چھوٹے بچے کو جس نے ابھی کھانا شروع نہیں کیا تھا،رسول اللہ ﷺ کے پاس لائی۔رسول اللہ ﷺ نے اسے گود میں بٹھا لیا۔اس نے آپ کے کپڑے پر پیشاب کر دیا۔آپ نے پانی منگوایا اور اسے کپڑے پر چھڑک دیا اور اسے دھویا نہیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;