var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي ذِئْبٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ بِإِقَامَةٍ وَاحِدَةٍ لَمْ يُسَبِّحْ بَيْنَهُمَا وَلَا عَلَى إِثْرِ كُلِّ وَاحِدَةٍ مِنْهُمَا";
nasai.urdu = "حضرت سالم کے والد (حضرت عبداللہ بن عمر رضی اللہ عنہ) سے منقول ہے کہ رسول اللہﷺ نے مغرب اور عشاء کی نمازیں مزدلفہ میں ایک اقامت کے ساتھ پڑھی تھیں۔ان کے درمیان یا ان کے بعد آپ نے کوئی نوافل ادا نہیں کیے۔";
nasai.hukam = "حسن";
nasai.description = ``;