var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَنَا مِمَّنْ قَدَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْمُزْدَلِفَةِ فِي ضَعَفَةِ أَهْلِهِ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ بیان کرتے ہیں کہ میں ان لوگوں میں شامل تھا جنھیں نبیﷺ نے مزدلفہ کی رات اپنے کمزوروں (یعنی عورتوں،بچوں،بوڑھوں،مریضوں وغیرہ) کے ساتھ پہلے بھیجا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;