var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ وَعَفَّانُ وَسُلَيْمَانُ عَنْ شُعْبَةَ عَنْ مُشَاشٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ ضَعَفَةَ بَنِي هَاشِمٍ أَنْ يَنْفِرُوا مِنْ جَمْعٍ بِلَيْلٍ";
nasai.urdu = "حضرت فضل بن عباس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے بنی ہاشم کے کمزوروں (عورتوں اور بچوں) کو حکم دیا تھا کہ وہ مزدلفہ سے رات ہی کو چل پڑیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;