var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ إِنَّمَا أَذِنَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِسَوْدَةَ فِي الْإِفَاضَةِ قَبْلَ الصُّبْحِ مِنْ جَمْعٍ لِأَنَّهَا كَانَتْ امْرَأَةً ثَبِطَةً";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ نبیﷺ نے حضرت سودہؓ کو مزدلفہ سے فجر طلوع ہونے سے قبل چل پڑنے کی اجازت اس لیے دی تھی کہ وہ بھاری جسم والی سست رفتار عورت تھیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;