var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةً قَطُّ إِلَّا لِمِيقَاتِهَا إِلَّا صَلَاةَ الْمَغْرِبِ وَالْعِشَاءِ صَلَّاهُمَا بِجَمْعٍ وَصَلَاةَ الْفَجْرِ يَوْمَئِذٍ قَبْلَ مِيقَاتِهَا";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ میں نے کبھی رسول اللہﷺ کو بے وقت نماز پڑْتے نہیں دیکھا مگر مغرب وعشاء کی نمازیں جو آپ نے مزدلفہ میں (بہت رات گئے) پڑھیں اور اسی رات فجر کی نماز بھی آپ نے وقت (معتاد) سے پہلے پڑھی۔";
nasai.hukam = "حسن";
nasai.description = ``;