var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ وَدَاوُدَ وَزَكَرِيِّا عَنْ الشَّعْبِيِّ عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا بِالْمُزْدَلِفَةِ فَقَالَ مَنْ صَلَّى مَعَنَا صَلَاتَنَا هَذِهِ هَا هُنَا ثُمَّ أَقَامَ مَعَنَا وَقَدْ وَقَفَ قَبْلَ ذَلِكَ بِعَرَفَةَ لَيْلًا أَوْ نَهَارًا فَقَدْ تَمَّ حَجُّهُ";
nasai.urdu = "حضرت عروہ بن مضرس رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہﷺ کو مزدلفہ میں وقوف فرماتے (ٹھہرے) دیکھا۔آپ نے فرمایا: ’’جس شخص نے یہ نماز (نماز فجر) اس جگہ ہمارے ساتھ پڑھی،پھر ہمارے ساتھ ٹھہرا رہا اور وہ اس سے قبل دن یا رات کسی وقت عرفات میں وقوف کر چکا ہو تو اس کا حج پورا ہو گیا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;