var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنِي جَرِيرٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ جَمْعًا مَعَ الْإِمَامِ وَالنَّاسِ حَتَّى يُفِيضَ مِنْهَا فَقَدْ أَدْرَكَ الْحَجَّ وَمَنْ لَمْ يُدْرِكْ مَعَ النَّاسِ وَالْإِمَامِ فَلَمْ يُدْرِكْ";
nasai.urdu = "حضرت عروہ بن مضرس رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جس شخص نے امام اور لوگوں کے ساتھ مزدلفے کا وقوف پا لیا اور پھر وہ منیٰ کو گیا تو اس نے حج پا لیا (بشرطیکہ وہ اس سے پہلے عرفات سے ہو آیا ہو)۔اور جس شخص نے لوگوں اور امام کے ساتھ یہ وقوف نہ پایا (یعنی اتنا لیٹ ہوگیا) تو اس کا حج نہیں ہوا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;