var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي قَالَ أَتَيْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُزْدَلِفَةُ كُلُّهَا مَوْقِفٌ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’مزدلفہ سارے کا سارا وقوف کی جگہ ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;