var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ الْوَلِيدِ قَالَ حَدَّثَنِي مُحِلُّ بْنُ خَلِيفَةَ قَالَ حَدَّثَنِي أَبُو السَّمْحِ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُغْسَلُ مِنْ بَوْلِ الْجَارِيَةِ وَيُرَشُّ مِنْ بَوْلِ الْغُلَامِ";
nasai.urdu = "حضرت ابوسمح رضی اللہ سے روایت ہے،انھوں نے کہا: نبی ﷺ نے فرمایا: ’’لڑکی کے پیشاب کی وجہ سے کپڑا دھویا جائے اور لڑکے کے پیشاب کی وجہ سے پانی چھڑک دیا جائے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;