var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ سَمِعْتُهُ يَقُولُ شَهِدْتُ عُمَرَ بِجَمْعٍ فَقَالَ إِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا لَا يُفِيضُونَ حَتَّى تَطْلُعَ الشَّمْسُ وَيَقُولُونَ أَشْرِقْ ثَبِيرُ وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالَفَهُمْ ثُمَّ أَفَاضَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ";
nasai.urdu = "حضرت عمرو بن میمون بیان کرتے ہیں کہ میں نے دیکھا کہ حضرت عمر رضی اللہ عنہ مزدلفہ میں فرما رہے تھے: جاہلیت والے سورج طلوع ہونے سے پہلے مزدلفہ سے نہیں چلتے تھے بلکہ کہتے تھے: اے ثبیر! روشن ہو۔لیکن رسول اللہﷺ نے ان کی مخالفت فرمائی،پھر وہ طلوع شمس سے پہلے ہی چل پڑے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;