var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ أَشْهَبَ أَنَّ دَاوُدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُمْ أَنَّ عَمْرَو بْنَ دِينَارٍ حَدَّثَهُ أَنَّ عَطَاءَ بْنَ أَبِي رَبَاحٍ حَدَّثَهُمْ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُ أَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ضَعَفَةِ أَهْلِهِ فَصَلَّيْنَا الصُّبْحَ بِمِنًى وَرَمَيْنَا الْجَمْرَةَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے مجھے کمزور،عورتوں اور بچوں میں (رات ہی کو) بھیج دیا تھا۔ہم نے صبح کی نماز منیٰ میں پڑھی اور جمرہ (عقبہ) کو کنکریاں ماریں۔";
nasai.hukam = "حسن";
nasai.description = ``;