var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّ مَوْلًى لِأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَخْبَرَهُ قَالَ جِئْتُ مَعَ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ مِنًى بِغَلَسٍ فَقُلْتُ لَهَا لَقَدْ جِئْنَا مِنًى بِغَلَسٍ فَقَالَتْ قَدْ كُنَّا نَصْنَعُ هَذَا مَعَ مَنْ هُوَ خَيْرٌ مِنْكَ";
nasai.urdu = "حضرت اسماء بنت ابی بکر رضی اللہ عنہ کے ایک مولیٰ (آزاد کردہ غلام) سے روایت ہے کہ میں حضرت اسماء بنت ابی بکر رضی اللہ عنہ کے ساتھ رات کے اندھیرے ہی میں منیٰ آگیا تو میں نے ان سے کہا کہ ہم منیٰ میں اندھیرے ہی میں آگئے ہیں۔وہ فرمانے لگیں: ہم اس شخصیت کے ہوتے ہوئے ایسا کیا کرتے تھے جو تجھ (اور ہم) سے بہت افضل تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;