var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ قَالَ سُئِلَ أُسَامَةُ بْنُ زَيْدٍ وَأَنَا جَالِسٌ مَعَهُ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ فِي حَجَّةِ الْوَدَاعِ حِينَ دَفَعَ قَالَ كَانَ يُسَيِّرُ نَاقَتَهُ فَإِذَا وَجَدَ فَجْوَةً نَصَّ";
nasai.urdu = "حضرت عروہ بیان کرتے ہیں کہ حضرت اسامہ بن زید رضی اللہ عنہ سے پوچھا گیا،جبکہ میں بھی ان کے پاس بیٹھا تھا کہ رسول اللہﷺ جب حجۃ الوداع میں واپس چلے تو آپ کی رفتار کیسی تھی؟ انھوں نے فریا: آپ اپنی اونٹنی کو درمیانی چال سے چلا رہے تھے،البتہ جب خالی جگہ پاتے تو (مزید) تیز فرما دیتے۔";
nasai.hukam = "حسن";
nasai.description = ``;