var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ وَهُوَ ابْنُ حَبِيبٍ عَنْ عَبْدِ الْمَلِكِ بْنِ جُرَيْجٍ وَعَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ أَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ";
nasai.urdu = "حضرت فضل بن عباس رضی اللہ عنہ سے روایت ہے کہ میں نبیﷺ کے پیچھے سوار تھا (یعنی مزدلفہ سے منیٰ تک)۔آپ لبیک کہتے رہے حتیٰ کہ آپ نے جمرے کی رمی شروع کی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;