var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا أَيْمَنُ بْنُ نَابِلٍ عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي جَمْرَةَ الْعَقَبَةِ يَوْمَ النَّحْرِ عَلَى نَاقَةٍ لَهُ صَهْبَاءَ لَا ضَرْبَ وَلَا طَرْدَ وَلَا إِلَيْكَ إِلَيْكَ";
nasai.urdu = "حضرت قدامہ بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہﷺ کو قربانیوں والے دن اپنی بھورے رنگ کی اونٹنی پر سوار جمرہ عقبہ کو رمی کرتے دیکھا۔نہ سواریوں کو مارا جا رہا تھا،نہ انھیں بھگایا جا رہا تھا اور نہ ہٹو بچو کا شور تھا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;