var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي الْجَمْرَةَ وَهُوَ عَلَى بَعِيرِهِ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ خُذُوا مَنَاسِكَكُمْ فَإِنِّي لَا أَدْرِي لَعَلِّي لَا أَحُجُّ بَعْدَ عَامِي هَذَا";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو اونٹ پر سوار جمرہ کو رمی کرتے دیکھا۔آپ فرما رہے تھے: ’’اے لوگو! مجھ سے حج کی عبادات کے طریقے سیکھ لو۔شاید میں اس سال کے بعد حج نہ کر سکوں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;