var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُغَيْلِمَةَ بَنِي عَبْدِ الْمُطَّلِبِ عَلَى حُمُرَاتٍ يَلْطَحُ أَفْخَاذَنَا وَيَقُولُ أُبَيْنِيَّ لَا تَرْمُوا جَمْرَةَ الْعَقَبَةِ حَتَّى تَطْلُعَ الشَّمْسُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ ہمیں،یعنی خاندان عبدالمطلب کے بچوں کو رسول اللہﷺ نے گدھوں پر سوار کر کے (صبح سے پہلے ہیں) بھیج دیا تھا۔آپ ہماری رانوں کو تھپتھپانے تھے اور فرماتے تھے: ’’اے میرے بیٹو! سورج طلوع ہونے سے پہلے جمرۂ عقبہ کو رمی نہ کرنا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1940) ابن ماجہ (3025)`;
nasai.anwaar = [344,1];