var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدَّمَ أَهْلَهُ وَأَمَرَهُمْ أَنْ لَا يَرْمُوا الْجَمْرَةَ حَتَّى تَطْلُعَ الشَّمْسُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے اپنے گھر والوں (عورتوں اور بچوں) کو صبح سے پہلے ہی بھیج دیا تھا۔اور آپ نے انھیں حکم دیا تھا کہ جب تک سورج طلوع نہ ہو،وہ جمرے کو رمی نہ کریں۔";
nasai.hukam = "حسن";
nasai.description = ``;