var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أَبِي الْبَدَّاحِ بْنِ عَدِيٍّ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرُّعَاةِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا";
nasai.urdu = "حضرت عدی رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے چرواہوں کو رخصت دی ہے کہ وہ ایک دن رمی کر لیں اور ایک دن چھوڑ لیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;