var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمِ بْنِ عَدِيٍّ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرُّعَاةِ فِي الْبَيْتُوتَةِ يَرْمُونَ يَوْمَ النَّحْرِ وَالْيَوْمَيْنِ اللَّذَيْنِ بَعْدَهُ يَجْمَعُونَهُمَا فِي أَحَدِهِمَا";
nasai.urdu = "حضرت عاصم بن عدی رضی اللہ عنہ سے منقول ہے کہ نبیﷺ نے چرواہوں کو (منیٰ سے) باہر رات گزارنے کی اجازت دی ہے،نیز وہ یوم نحر کو رمی کریں اور بعد والے دو دنوں کی رمی ان میں سے کسی ایک دن اکٹھی ادا کر لیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;