var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى عَنْ هُشَيْمٍ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ قَالَ رَأَيْتُ ابْنَ مَسْعُودٍ رَمَى جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي ثُمَّ قَالَ هَا هُنَا وَالَّذِي لَا إِلَهَ غَيْرُهُ مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ";
nasai.urdu = "حضرت عبدالرحمٰن بن یزید بیان کرتے ہیں کہ میں نے حضرت ابن مسعود رضی اللہ عنہ کو دیکھا،انھوں نے وادی کے پیٹ سے جمرۂ عقبہ کو رمی کی،پھر فرمایا: قسم اس ذات کی جس کے سوا کوئی معبود نہیں! یہ اس شخصیت کے رمی کرنے کی جگہ ہے جن پر سورہ بقرہ اتاری گئی۔";
nasai.hukam = "حسن";
nasai.description = ``;