var nasai = {};
nasai.arabic = "أَخْبَرَنِي يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ قَالَ قَالَ مُجَاهِدٌ قَالَ سَعْدٌ رَجَعْنَا فِي الْحَجَّةِ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَعْضُنَا يَقُولُ رَمَيْتُ بِسَبْعِ حَصَيَاتٍ وَبَعْضُنَا يَقُولُ رَمَيْتُ بِسِتٍّ فَلَمْ يَعِبْ بَعْضُهُمْ عَلَى بَعْضٍ";
nasai.urdu = "حضرت سعد رضی اللہ عنہ سے مروی ہے کہ ہم حجۃ الوداع میں نبیﷺ کے ساتھ لوٹے تو ہم میں سے کچھ لوگ کہہ رہے تھے: ہم نے سات کنکریاں ماری ہیں اور بعض کہہ رہے تھے: ہم نے چھ کنکریاں ماری ہیں،تاہم کسی نے ایک دوسرے پر عیب نہیں لگایا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف لانقطاعہ<br>مجاہد لم یدرک سعد بن أبي وقاص رضي اللہ عنہ`;
nasai.anwaar = [344,1];