var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَبَا مِجْلَزٍ يَقُولُ سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ شَيْءٍ مِنْ أَمْرِ الْجِمَارِ فَقَالَ مَا أَدْرِي رَمَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسِتٍّ أَوْ بِسَبْعٍ";
nasai.urdu = "حضرت ابو مجلز بیان کرتے ہیں کہ میںنے حضرت بن عباس رضی اللہ عنہ سے جمروں کے بارے میں پوچھا تو وہ فرمانے لگے: میں نہیں جانتا کہ رسول اللہﷺ نے انھیں سات سات کنکریاں ماریں یا چھ چھ۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;