var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ الْكُوفِيُّ قَالَ حَدَّثَنَا حَفْصٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَخِيهِ الْفَضْلِ بْنِ عَبَّاسٍ قَالَ كُنْتُ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ فَرَمَاهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ";
nasai.urdu = "حضرت فضل بن عباس رضی اللہ عنہ سے مروی ہے کہ میں نبیﷺ کے پیچھے سواری پر بیٹھا ہوا تھا۔آپ لبیک کہتے رہے حتی کہ آپ نے جمرۂ عقبہ کو رمی شروع کر دی۔آپ نے اسے سات کنکریاں ماریں۔ہر کنکری کے ساتھ اللہ اکبر کہتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;