var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ خُصَيْفٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عبَّاسٍ قَالَ قَالَ الْفَضْلُ بْنُ عَبَّاسٍ كُنْتُ رِدْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا زِلْتُ أَسْمَعُهُ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ فَلَمَّا رَمَى قَطَعَ التَّلْبِيَةَ";
nasai.urdu = "حضرت فضل بن عباس رضی اللہ عنہ سے منقول ہے کہ میں رسول اللہﷺ کے پیچھے سواری پر بیٹھا ہوا تھا۔میں آپ کو مسلسل لبیک پکارتے سنتا رہا حتی کہ آپ نے جمرہ عقبہ کو رمی شروع کی۔جب رمی شروع کی تو لبیک کہنا بند کر دیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;