var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا حُسَيْنٌ قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ قَالَ حَدَّثَنَا خُصَيْفٌ عَنْ مُجَاهِدٍ وَعَامِرٌ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ الْفَضْلَ أَخْبَرَهُ أَنَّهُ كَانَ رَدِيفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَّهُ لَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ";
nasai.urdu = "حضرت فضل رضی اللہ عنہ نے خبر دی کہ میں رسول اللہﷺ کے پیچھے سواری پر بیٹھا تھا۔آپ لبیک فرماتے رہے حتی کہ آپ نے جمرہ عقبہ کو رمی شروع کی۔";
nasai.hukam = "حسن";
nasai.description = ``;