var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ عَنْ عَلِيِّ بْنِ مَعْبَدٍ قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ الْعَبَّاسِ أَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ";
nasai.urdu = "حضرت فضل بن عباس رضی اللہ عنہ سے روایت ہے کہ میں نبیﷺ کے پیچھے سواری پر بیٹھا تھا۔آپ لبیک پکارتے رہے حتی کہ آپ نے جمرہ عقبہ کو رمی کی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;