var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَا حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَاهِدُوا الْمُشْرِكِينَ بِأَمْوَالِكُمْ وَأَيْدِيكُمْ وَأَلْسِنَتِكُمْ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’تم مشرکین کے ساتھ اپنے مالوں‘ ہاتھوں اور اپنی زبانوں کے ساتھ جہاد کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;