var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنَا سَلَمَةُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا وُهَيْبٌ يَعْنِي ابْنَ الْوَرْدِ قَالَ أَخْبَرَنِي عُمَرُ بْنُ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ وَلَمْ يَغْزُ وَلَمْ يُحَدِّثْ نَفْسَهُ بِغَزْوٍ مَاتَ عَلَى شُعْبَةِ نِفَاقٍ";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’جوشخص اس حال میں فوت ہوا کہ وہ کبھی جہاد کو نہیں گیا‘ نہ کبھی خواہش کی‘ تو وہ نفاق کے ایک شعبے پر مرا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;