var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مِهْرَانَ يُحَدِّثُ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلَا يَبْزُقْ بَيْنَ يَدَيْهِ وَلَا عَنْ يَمِينِهِ وَلَكِنْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ وَإِلَّا فَبَزَقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا فِي ثَوْبِهِ وَدَلَكَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب تم میں سے کوئی آدمی نماز پڑھ رہا ہو تو وہ اپنے آگے اور دائیں نہ تھوکے بلکہ اپنے بائیں یا پاؤں کے نیچے تھوکے۔‘‘ ورنہ نبی ﷺ نے تو اس طرح اپنے کپڑے میں تھوک کر کپڑے کو آپس میں مل لیا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;