var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُفْيَانَ وَشُعْبَةَ قَالَا حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ أَبِي الْعَبَّاسِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُهُ فِي الْجِهَادِ فَقَالَ أَحَيٌّ وَالِدَاكَ قَالَ نَعَمْ قَالَ فَفِيهِمَا فَجَاهِدْ";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی رسول اللہﷺ کے پاس آیا۔وہ آپ سے جہاد کی اجازت طلب کرتا تھا۔آپﷺ نے فرمایا:’’تیرے والدین زندہ ہیں؟‘‘ اس نے کہا: جی ہاں۔آپ نے فرمایا: ’’پھر تو ان کی خدمت کر۔یہی جہاد ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;