var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ قَالَ حَدَّثَنَا مِسْعَرٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ لَا يَبْكِي أَحَدٌ مِنْ خَشْيَةِ اللَّهِ فَتَطْعَمَهُ النَّارُ حَتَّى يُرَدَّ اللَّبَنُ فِي الضَّرْعِ وَلَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي مَنْخَرَيْ مُسْلِمٍ أَبَدًا";
nasai.urdu = "حضرت ابوہریرہ ؓ فرماتے ہیں کہ جو شخص اللہ تعالیٰ کے ڈر سے روتا ہے‘ اسے آگ نہیں لگے گی‘ حتیٰ کہ (دوہا ہوا) دودھ دوبارہ پستان میں چلا جائے۔اور یہ نہیں ہوسکتا کہ کسی مسلمان کے نتھنوں میں اللہ کے راستے میں (جہاد کرتے ہوئے زمین اسے اڑانے والا) غبار اور جہنم کا دھواں دونوں جمع ہوجائیں";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;