var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ الْمُبَارَكِ عَنْ الْمَسْعُودِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَلِجُ النَّارَ رَجُلٌ بَكَى مِنْ خَشْيَةِ اللَّهِ تَعَالَى حَتَّى يَعُودَ اللَّبَنُ فِي الضَّرْعِ وَلَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ نَارِ جَهَنَّمَ";
nasai.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے کہ نبیﷺنے فرمایا: ’’وہ شخص آگ میںنہیں جائے گا جو اللہ کے ڈر سے روپڑا حتیٰ کہ (دوہا ہوا) دودھ پستان میں واپس چلا جائے۔اور دوران جہاد میں پڑنے والے غبار اور جہنم کا دھواں اکٹھے نہیں ہوسکتے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;