var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعَانِ فِي النَّارِ مُسْلِمٌ قَتَلَ كَافِرًا ثُمَّ سَدَّدَ وَقَارَبَ وَلَا يَجْتَمِعَانِ فِي جَوْفِ مُؤْمِنٍ غُبَارٌ فِي سَبِيلِ اللَّهِ وَفَيْحُ جَهَنَّمَ وَلَا يَجْتَمِعَانِ فِي قَلْبِ عَبْدٍ الْإِيمَانُ وَالْحَسَدُ";
nasai.urdu = "حضرت ابوہریرہؓ سے منقول ہے کہ رسول اللہﷺنے فرمایا: ’’اللہ کے راستے میں اڑنے والا غبار اور جہنم کا دھواں کسی مومن کے پیٹ میں کبھی جمع نہیں ہوں گے۔اسی طرح بخل اور ایمان کبھی بھی کسی انسان کے دل میں جمع نہیں ہوں گے۔";
nasai.hukam = "حسن";
nasai.description = ``;