var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ الْقَعْقَاعِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي جَوْفِ عَبْدٍ أَبَدًا وَلَا يَجْتَمِعُ الشُّحُّ وَالْإِيمَانُ فِي قَلْبِ عَبْدٍ أَبَدًا";
nasai.urdu = "حضرت ابوہرہرہؓ سے مروی ہے کہ نبیﷺ نے فرمایا: اللہ کے راستے میں اڑنے والا غبار اور جہنم کا دھواں کسی ایک آدمی کے چہرے میں کبھی جمع نہیں ہوں گے۔اور بخل اور ایمان بھی کسی انسان کے دل میں جمع نہیں ہوتے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;