var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا مَنْصُورُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ الْهَادِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ الْقَعْقَاعِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي جَوْفِ عَبْدٍ وَلَا يَجْتَمِعُ الشُّحُّ وَالْإِيمَانُ فِي جَوْفِ عَبْدٍ";
nasai.urdu = "حضرت ابوہریرہ ؓ بیان کرتے ہیں کہ رسول اللہﷺ نے فرمایا: ’’اللہ کے راستے میں اڑنے والا غبار اور جہنم کا دھواں اور کسی مسلمان کے نتھوں میں جمع نہیں ہوں گے اور بخل اور ایمان کسی مسلمان آدمی کے دل میں جمع نہیں ہوتے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;