var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَرْعَرَةُ بْنُ الْبِرِنْدِ وَابْنُ أَبِي عَدِيٍّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ حُصَيْنِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ وَدُخَانُ جَهَنَّمَ فِي مَنْخَرَيْ مُسْلِمٍ أَبَدًا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبیﷺ نے فرمایا: ’’اللہ کے راستے میں پڑنے والا غبار اورجہنم کا دھواں کسی مسلمان کے نتھوں میں کبھی بھی جمع نہیں ہوں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;