var nasai = {};
nasai.arabic = "أَخْبَرَنِي شُعَيْبُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ حُصَيْنِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي مَنْخَرَيْ مُسْلِمٍ وَلَا يَجْتَمِعُ شُحٌّ وَإِيمَانٌ فِي قَلْبِ رَجُلٍ مُسْلِمٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے فرمایا: ’’اللہ کے راستے میں اڑنے والا غبار اور جہنم کا دھواں اور کسی مسلمان کے نتھوں میں جمع نہیں ہوں گے اور بخل اور ایمان کسی مسلمان آدمی کے دل میں جمع نہیں ہوتے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;