var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ أَبِي الْعَلَاءِ بْنِ اللَّجْلَاجِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ لَا يَجْمَعُ اللَّهُ عَزَّ وَجَلَّ غُبَارًا فِي سَبِيلِ اللَّهِ وَدُخَانَ جَهَنَّمَ فِي جَوْفِ امْرِئٍ مُسْلِمٍ وَلَا يَجْمَعُ اللَّهُ فِي قَلْبِ امْرِئٍ مُسْلِمٍ الْإِيمَانَ بِاللَّهِ وَالشُّحَّ جَمِيعًا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ اللہ تعالیٰ اپنے راستے کا غبار اور جہنم کا دھواں کسی مسلمان کے پیٹ میں جمع نہیں فرمائے گا۔اسی طرح اللہ تعالیٰ کسی مسلمان آدمی کے دل میں ایمان اور کنجوسی کو جمع نہیں کرے فرمائے گا۔";
nasai.hukam = "حسن";
nasai.description = ``;