var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُرَيْحٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ شُمَيْرٍ الرُّعَيْنِيَّ يَقُولُ سَمِعْتُ أَبَا عَلِيٍّ التُّجِيبِيَّ أَنَّهُ سَمِعَ أَبَا رَيْحَانَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حُرِّمَتْ عَيْنٌ عَلَى النَّارِ سَهِرَتْ فِي سَبِيلِ اللَّهِ";
nasai.urdu = "حضرت ابوریحانہؓ سے منقول ہے کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’وہ آنکھ آگ پر حرام کردی گئی ہے جو الہ کے راستے (جہاد) میں بیدار رہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;