var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ سُفْيَانَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغَدْوَةُ وَالرَّوْحَةُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ أَفْضَلُ مِنْ الدُّنْيَا وَمَا فِيهَا";
nasai.urdu = "حضرت سہل بن سعدؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’اللہ کے راستے میں ایک دن صبح یا شام کے وقت جانا دنیا اور اس کی ہر چیز سے افضل ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;