var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ حَدَّثَنِي شُرَحْبِيلُ بْنُ شَرِيكٍ الْمَعَافِرِيُّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ وَغَرَبَتْ";
nasai.urdu = "حضرت ابوایوب انصاریؓ سے منقول ہے کہ روسول اللہﷺ نے فرمایا: ’ایک دن صبح یا شام کے وقت اللہ تعالیٰ کے راستے میں جانا (دنیا کی) ہر اس چیز سے بہتر ہے جس پر سورج طلوع یا غروب ہوتاہے";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;