var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ عَنْ أَبِيهِ قَالَ سَمِعْتُ سُهَيْلَ بْنَ أَبِي صَالِحٍ قَالَ سَمِعْتُ أَبِي يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفْدُ اللَّهِ عَزَّ وَجَلَّ ثَلَاثَةٌ الْغَازِي وَالْحَاجُّ وَالْمُعْتَمِرُ";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’تین شخص اللہ تعالیٰ کے خصوصی مہمان ہیں: جنگ کو جانے والا‘ حج کو جانے والا اور عمرے کو جانے والا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;