var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَثَلُ الْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَاللَّهُ أَعْلَمُ بِمَنْ يُجَاهِدُ فِي سَبِيلِهِ كَمَثَلِ الصَّائِمِ الْقَائِمِ الْخَاشِعِ الرَّاكِعِ السَّاجِدِ";
nasai.urdu = "حضرت ابوہریرہؓ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’اللہ تعالیٰ کے راستے میں جہاد کرنے والے کی مثال،اور اللہ تعالیٰ ہی خوب جانتا ہے کہ کون اللہ کے راستے میں جہاد کرتا ہے‘ اس شخص کی طرح ہے جو مسلسل صیام وقیام کرتا رہے اور خشوع وخضوع کے ساتھ رکوع وسجدہ کرتا رہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;