var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ قَالَ أَخْبَرَنِي عُرْوَةُ عَنْ أَبِي مُرَاوِحٍ عَنْ أَبِي ذَرٍّ أَنَّهُ سَأَلَ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْعَمَلِ خَيْرٌ قَالَ إِيمَانٌ بِاللَّهِ وَجِهَادٌ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت ابوذرؓ سے روایت ہے کہ میں نے اللہ کے نبیﷺسے پوچھا کہ کون سا عمل بہتر ہے؟ آپaنے فرمایا: ’’اللہ پر ایمان لانا اور اللہ عزوجل کے راستے میں جہاد کرنا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;