var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ إِيمَانٌ بِاللَّهِ قَالَ ثُمَّ مَاذَا قَالَ الْجِهَادُ فِي سَبِيلِ اللَّهِ قَالَ ثُمَّ مَاذَا قَالَ حَجٌّ مَبْرُورٌ";
nasai.urdu = "حضرت ابوہریرہ ؓ بیان کرتے ہیں کہ ایک آدمی نے رسول اللہﷺ سے پوچھا: کون ساعمل افضل ہے؟ فرمایا: ’’اللہ تعالیٰ پر ایمان لانا۔‘‘ اس نے عرض کیا: پھر کون سا؟ آپa نے فرمایا: ’’اللہ کے راستے میں جہاد کرنا۔‘‘ اس نے عرض کیا کہ پھر کون سا؟ آپ نے فرمایا: ’’اللہ کی بارگاہ میں مقبول حج۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;