var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ نَاجِيَةَ بْنِ خُفَافٍ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ أَجْنَبْتُ وَأَنَا فِي الْإِبِلِ فَلَمْ أَجِدْ مَاءً فَتَمَعَّكْتُ فِي التُّرَابِ تَمَعُّكَ الدَّابَّةِ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ بِذَلِكَ فَقَالَ إِنَّمَا كَانَ يَجْزِيكَ مِنْ ذَلِكَ التَّيَمُّمُ";
nasai.urdu = "حضرت عمار بن یاسر رضی اللہ عنہ بیان کرتے ہیں کہ ایک دفعہ میں اونٹوں میں تھا کہ جنبی ہوگیا۔مجھے پانی نہ ملا تو مٹی میں اچھی طرح لوٹ پوٹ ہوا جیسے جانور کرتا ہے،پھر میں رسول اللہ ﷺ کے پاس آیا تو آپ کو یہ بات بتائی۔آپ نے فرمایا: ’’تجھے اس (جنابت) سے تیمم کافی تھا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;