var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ جَبَلَةَ بْنِ عَطِيَّةَ عَنْ يَحْيَى بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَزَا فِي سَبِيلِ اللَّهِ وَلَمْ يَنْوِ إِلَّا عِقَالًا فَلَهُ مَا نَوَى";
nasai.urdu = "حضرت عبادہ بن صامتؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص اللہ کے راستے میں جہاد کرنے گیا لیکن اس کی نیت صرف دنیوی مال حاصل کرنا تھا تو اسے ا سکی نیت کے مطابق ملے گا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;