var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ جَبَلَةَ بْنِ عَطِيَّةَ عَنْ يَحْيَى بْنِ الْوَلِيدِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ غَزَا وَهُوَ لَا يُرِيدُ إِلَّا عِقَالًا فَلَهُ مَا نَوَى";
nasai.urdu = "حضرت عبادہ بن صامتؓ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص اونٹ کا گھٹنا باندھنے والی رسی حاصل کرنے کے لیے جہاد کرے گا تو اسے اس کی نیت کے مطابق ہی ملے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;