var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ عَنْ الْوَلِيدِ عَنْ ابْنِ جَابِرٍ عَنْ أَبِي سَلَّامٍ الْأَسْوَدِ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يُدْخِلُ ثَلَاثَةَ نَفَرٍ الْجَنَّةَ بِالسَّهْمِ الْوَاحِدِ صَانِعَهُ يَحْتَسِبُ فِي صُنْعِهِ الْخَيْرَ وَالرَّامِيَ بِهِ وَمُنَبِّلَهُ";
nasai.urdu = "حضرت عقبہ بن عامرؓ سے منقول ہے کہ نبیﷺ نے فرمایا: ’’اللہ تعالیٰ ایک تیر کی وجہ سے تین اشخاص کو جنت میں داخل فرمائے گا: بنانے والا‘ جو اسے بناتے وقت نیکی کا ذہن رکھتا ہے‘ تیر پھینکنے ولا اور تیر پکڑنے والا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;