var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُكْلَمُ أَحَدٌ فِي سَبِيلِ اللَّهِ وَاللَّهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِي سَبِيلِهِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَجُرْحُهُ يَثْعَبُ دَمًا اللَّوْنُ لَوْنُ دَمٍ وَالرِّيحُ رِيحُ الْمِسْكِ";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ کے راستے میں زخمی ہوتا ہے… اور اللہ تعالیٰ ہی بہتر جانتا ہے کہ کون اللہ تعالیٰ کی راہ میں زخمی ہوتا ہے … تووہ قیامت کے دن اس حالت میں آئے گا کہ اس کے زخم سے خون تیزی سے بہہ رہا ہوگا۔رنگ تو خون کا ہوگا مگر خوشبو کستوری کی ہوگی۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;