var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمِّلُوهُمْ بِدِمَائِهِمْ فَإِنَّهُ لَيْسَ كَلْمٌ يُكْلَمُ فِي اللَّهِ إِلَّا أَتَى يَوْمَ الْقِيَامَةِ جُرْحُهُ يَدْمَى لَوْنُهُ لَوْنُ دَمٍ وَرِيحُهُ رِيحُ الْمِسْكِ";
nasai.urdu = "حضرت عبداللہ بن ثعلبہ رضی اللہ عنہ سے روایت ہے کہ رسول ا للہﷺ نے (شہدائے احد کے بارے میں) فرمایا تھا: ’’انہیں ان کے خون (آلودہ جسم اور کپڑوں) سمیت ڈھانپ کر دفن کرو کیونکہ جو زخم بھی اللہ تعالیٰ کے راستے میں لگتا ہے‘ وہ قیامت کے دن اس حالت میں ہوگا کہ اس سے خون بہہ رہا ہوگا۔رنگ تو خون کا ہوگا مگر خوشبو کستوری کی ہوگی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;