var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو قَالَ سَمِعْتُ جَابِرًا يَقُولُ قَالَ رَجُلٌ يَوْمَ أُحُدٍ أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ فَأَيْنَ أَنَا قَالَ فِي الْجَنَّةِ فَأَلْقَى تَمَرَاتٍ فِي يَدِهِ ثُمَّ قَاتَلَ حَتَّى قُتِلَ";
nasai.urdu = "حضرت جابرؓ فرماتے ہیں کہ جنگ احد کے دن ایک آدمی نے رسول اللہﷺ سے کہا کہ آپ مجھے بتائیں‘ اگر میں اللہ تعالیٰ کے راستے میں مارا جاؤں تو میں کہاں جاؤں گا؟ (آپ نے) فرمایا: ’’جنت میں۔‘‘ اس نے اپنے ہاتھ میں پکڑی ہوئی کھجوریں (جنہیں وہ کھارہا تھا) پھینک دیں اور (کافروں سے) لڑنے لگا حتیٰ کہ وہ شہید ہوگیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;