var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشَّهِيدُ لَا يَجِدُ مَسَّ الْقَتْلِ إِلَّا كَمَا يَجِدُ أَحَدُكُمْ الْقَرْصَةَ يُقْرَصُهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’شہید شہادت کے وقت تکلیف محسوس نہیں کرتا مگر اتنی جو تم میں سے کوئی شخص کسی کے چٹکی کاٹنے سے محسوس کرتا ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ترمذی (1668) ابن ماجہ (2802)`;
nasai.anwaar = [345,1];