var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ أَنَّ سَهْلَ بْنَ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَأَلَ اللَّهَ عَزَّ وَجَلَّ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ";
nasai.urdu = "حضرت سہل بن حنیف رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص سچے دل کے ساتھ اللہ تعالیٰ سے شہادت مانگے گا‘ اللہ تعالیٰ اسے شہداء کے مرتبے تک پہنچائے گا اگر چہ وہ اپنے بستر پر فوت ہو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;