var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَعْجَبُ مِنْ رَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا صَاحِبَهُ وَقَالَ مَرَّةً أُخْرَى لَيَضْحَكُ مِنْ رَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا صَاحِبَهُ ثُمَّ يَدْخُلَانِ الْجَنَّةَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’اللہ تعالیٰ دوآدمیوں سے تعجب کرتا ہے اور راوی نے دوسری بار کہا: ہنستا ہے کہ ان میں سے ایک دوسرے کو قتل کرتا ہے‘ پھر دونوں جنت میں داخل ہوجاتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;