var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ زُهْرَةَ بْنِ مَعْبَدٍ قَالَ حَدَّثَنِي أَبُو صَالِحٍ مَوْلَى عُثْمَانَ قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ مِنْ الْمَنَازِلِ";
nasai.urdu = "حضرت عثمان بن عفانؓ فرماتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’اللہ تعالیٰ کے راسے میں ایک دن سرحد پر تیار ہو کر بیٹھنا (نیکی کے) دوسرے مقامات میں ہزار دن بیٹھنے سے افضل ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;