var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو مَعْنٍ قَالَ حَدَّثَنَا زُهْرَةُ بْنُ مَعْبَدٍ عَنْ أَبِي صَالِحٍ مَوْلَى عُثْمَانَ قَالَ قَالَ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَوْمٌ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ";
nasai.urdu = "حضرت عثمان بن عفان رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’جہاد میں ایک دن صرف کرنا (نیکی کے) دوسرے کاموں میں ہزار دن لگانے سے بہتر ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;