var nasai = {};
nasai.arabic = "حَدَّثَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا هُشَيْمٌ قَالَ حَدَّثَنَا سَيَّارٌ أَبُو الْحَكَمِ عَنْ جَبْرِ بْنِ عَبِيدَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ وَعَدَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ الْهِنْدِ فَإِنْ أَدْرَكْتُهَا أُنْفِقْ فِيهَا نَفْسِي وَمَالِي وَإِنْ قُتِلْتُ كُنْتُ أَفْضَلَ الشُّهَدَاءِ وَإِنْ رَجَعْتُ فَأَنَا أَبُو هُرَيْرَةَ الْمُحَرَّرُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے ہمیں ہندوستان پر حملے کی پیش گوئی فرمائی۔اگر میں نے یہ موقع پالیا تو میں اس میں اپنا جان ومال خرچ کروں گا‘ پھر اگر میں اس میں شہید ہوگیا تو میں افضل شہید ہوں گا اور اگر زندہ واپس آگیا تو (آگ سے) آزاد ابوہریرہ ہوںگا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>جبر بن عبیدہ: لم یوثقہ غیر ابن حبان وقال الذہبي: بخبر منکر،لا یعرف من ذا؟ (میزان الإعتدال: 1/ 388)`;
nasai.anwaar = [345,1];