var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَعْقُوبُ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يُقَاتِلَ الْمُسْلِمُونَ التُّرْكَ قَوْمًا وُجُوهُهُمْ كَالْمَجَانِّ الْمُطْرَقَةِ يَلْبَسُونَ الشَّعَرَ وَيَمْشُونَ فِي الشَّعَرِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’قیامت قائم نہیں ہوگی حتیٰ کہ مسلمان ترکوں سے لڑائی لڑیں گے۔وہ ایسے لوگ ہوں گے جن کے چہرے چمڑا چڑھائی ہوئی ڈھالوں کی طرح ہوں گے۔وہ بالوں کے کپڑے پہنیں گے اور بالوں والے جوتے پہنیں گے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;