var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ قَالَ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِيهِ عَنْ مِسْعَرٍ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ أَبِيهِ أَنَّهُ ظَنَّ أَنَّ لَهُ فَضْلًا عَلَى مَنْ دُونَهُ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا يَنْصُرُ اللَّهُ هَذِهِ الْأُمَّةَ بِضَعِيفِهَا بِدَعْوَتِهِمْ وَصَلَاتِهِمْ وَإِخْلَاصِهِمْ";
nasai.urdu = "حضرت مصعب بن سعد سے روایت ہے کہ میرے والد محترم (حضرت سعدبن ابی وقاص رضی اللہ عنہ) نے سمجھا کہ شاید مجھے دوسرے صحابہ پر فضیلت حاصل ہے۔نبیﷺ نے فرمایا: ’’اللہ تعالیٰ کمزور لوگوں کی دعاؤں‘ نمازوں اور اخلاص کی وجہ سے اس امت کی مدد فرماتا ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;