var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ خَالِدٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ فَقَدْ غَزَا وَمَنْ خَلَفَهُ فِي أَهْلِهِ بِخَيْرٍ فَقَدْ غَزَا";
nasai.urdu = "حضرت زید بن خالد رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو آدمی جہاد فی سبیل اللہ کے لیے کسی غازی کو سامان مہیا کرے‘ اس نے بھی جہاد میں حصہ لیا۔اور جو کسی غازی کی عدم موجودگی میں اس کے اہل وعیال کی ضرورت مہیا کرے‘ اس نے بھی جہاد کیا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;