var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ قَالَ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَهَّزَ غَازِيًا فَقَدْ غَزَا وَمَنْ خَلَفَ غَازِيًا فِي أَهْلِهِ بِخَيْرٍ فَقَدْ غَزَا";
nasai.urdu = "حضرت زید بن خالد جہنی رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی مجاہد فی سبیل اللہ کو سامان جنگ وسفر مہیا کرے‘ اس نے بھی جہاد کیا اور جو شخص غازی کی عدم موجودگی میں اس کے اہل وعیال سے حسن سلوک کرے تو اس نے بھی جہاد میں حصہ لیا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;