var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ الرُّكَيْنِ الْفَزَارِيِّ عَنْ أَبِيهِ عَنْ يُسَيْرِ ابْنِ عَمِيلَةَ عَنْ خُرَيْمِ بْنِ فَاتِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ كُتِبَتْ لَهُ بِسَبْعِ مِائَةِ ضِعْفٍ";
nasai.urdu = "حضرت خریم بن فاتک رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جوشخص اللہ تعالیٰ کے راستے میں کوئی چیز خرچ کرے‘ اس کے لیے ا سے سات سو گنا تک لکھا جاتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;