var nasai = {};
nasai.arabic = "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا عَمْرٍو الشَّيْبَانِيَّ عَنْ أَبِي مَسْعُودٍ أَنَّ رَجُلًا تَصَدَّقَ بِنَاقَةٍ مَخْطُومَةٍ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَأْتِيَنَّ يَوْمَ الْقِيَامَةِ بِسَبْعِ مِائَةِ نَاقَةٍ مَخْطُومَةٍ";
nasai.urdu = "حضرت ابومسعود رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے اللہ کے راستے میں مہار والی ایک اونٹنی صدقہ کی تو رسول اللہﷺ نے فرمایا: ’’قیامت کے دن یہ شخص مہار والی سات اونٹنیاں لے کر آئے گا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;