var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو مُحَمَّدٍ مُوسَى بْنُ مُحَمَّدٍ هُوَ الشَّامِيُّ قَالَ حَدَّثَنَا مَيْمُونُ بْنُ الْأَصْبَغِ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَ بِقَتْلِ الْحَيَّاتِ وَقَالَ مَنْ خَافَ ثَأْرَهُنَّ فَلَيْسَ مِنَّا";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے سانپ قتل کرنے کا حکم دیا اور فرمایا: ’’جو شخص ان کے انتقام اور بدلے سے ڈرتا ہے‘ وہ ہم میں سے نہیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (5249)`;
nasai.anwaar = [345,1];