var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ يَزِيدَ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ أَنَّ أَنَسًا حَدَّثَهُمْ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي اللَّيْلَةِ الْوَاحِدَةِ وَلَهُ يَوْمَئِذٍ تِسْعُ نِسْوَةٍ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ نبیﷺ ایک رات میں اپنی سب عورتوں کے پاس گھوم آتے تھے جب کہ ان دنوں آپ کی نو بیویاں تھیں۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;