var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو هِشَامٍ وَهُوَ الْمُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ قَالَتْ مَا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَحَلَّ اللَّهُ لَهُ أَنْ يَتَزَوَّجَ مِنْ النِّسَاءِ مَا شَاءَ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ جب رسول اللہﷺ اللہ تعالیٰ کو پیارے ہوئے تو اس سے پہلے آپ کو رخصت دے دی گئی تھی کہ آپ جس عورت سے چاہیں‘ نکاح فرمائیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;