var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مَعْشَرَ الشَّبَابِ مَنْ اسْتَطَاعَ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ وَسَاقَ الْحَدِيثَ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے ہم سے فرمایا: ’’اے نوجوان لوگو! تم م میں سے جو شحص نکاح کی طاقت رکھے‘ وہ شادی کرلے۔‘‘ اور (راوی نے) پوری حدیث بیان کی۔";
nasai.hukam = "حسن";
nasai.description = ``;