var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ لَقَدْ رَدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عُثْمَانَ التَّبَتُّلَ وَلَوْ أَذِنَ لَهُ لَاخْتَصَيْنَا";
nasai.urdu = "حضرت سعد بن ابی وقاص رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے حضرت عثمان بن مظعون رضی اللہ عنہ کو ترک نکاح کی اجازت نہ دی۔اگر آپ انہیں اجازت دیتے تو ہم خصی ہوجاتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;