var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ حَقٌّ عَلَى اللَّهِ عَزَّ وَجَلَّ عَوْنُهُمْ الْمُكَاتَبُ الَّذِي يُرِيدُ الْأَدَاءَ وَالنَّاكِحُ الَّذِي يُرِيدُ الْعَفَافَ وَالْمُجَاهِدُ فِي سَبِيلِ اللَّهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’تین شخص ایسے ہیں کہ اللہ تعالیٰ نے ان کی مدد کرنے کا ذمہ لے رکھا ہے: وہ غلام جو اپنی آزادی کا معاہدہ کرے اور اس کی نیت رقم ادا کرنے کی ہو۔اور وہ شخص جو گناہ سے بچنے (پاکبازی) کی نیت سے نکاح کرے۔اور جو شخص اللہ تعالیٰ کے راستے میں جہاد کرے۔";
nasai.hukam = "حسن";
nasai.description = ``;