var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو عَنْ جَابِرٍ قَالَ تَزَوَّجْتُ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَتَزَوَّجْتَ يَا جَابِرُ قُلْتُ نَعَمْ قَالَ بِكْرًا أَمْ ثَيِّبًا فَقُلْتُ ثَيِّبًا قَالَ فَهَلَّا بِكْرًا تُلَاعِبُهَا وَتُلَاعِبُكَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے شادی کی تو نبیﷺ کی خدمت میں حاضر ہوا۔آپ نے فرمایا: ’’جابر! شادی کی ہے؟‘‘ میں نے کہا: ہاں۔آپ نے فرمایا: ’’کنواری سے یا بیوہ سے؟‘‘ میں نے کہا: بیوہ سے۔آپ نے فرمایا: ’’کنواری سے کیوں نہ شادی کی۔تو اس سے دل لگی کرتا‘ وہ تجھ سے دل لگی کرتی۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;