var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ قَالَ حَدَّثَنَا سُفْيَانُ وَهُوَ ابْنُ حَبِيبٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ لَقِيَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا جَابِرُ هَلْ أَصَبْتَ امْرَأَةً بَعْدِي قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ قَالَ أَبِكْرًا أَمْ أَيِّمًا قُلْتُ أَيِّمًا قَالَ فَهَلَّا بِكْرًا تُلَاعِبُكَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ مجھے ملے اور کہنے لگے: ’’جابر! تو نے میرے بعد (میری عدم موجوگی میں) شادی کرلی ہے؟‘‘ میں نے کہا: جی ہاں‘ اے اللہ کے رسول! آپ نے فرمایا: ’’کنواری سے شادی کی ہے یا بیوہ سے‘‘ میں نے کہا: بیوہ سے۔آپ نے فرمایا: ’’کنواری سے کیوں نہ شادی کی۔وہ تجھ سے جی بھر کر پیار کرتی۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;