var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ خَطَبَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا فَاطِمَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا صَغِيرَةٌ فَخَطَبَهَا عَلِيٌّ فَزَوَّجَهَا مِنْهُ";
nasai.urdu = "حضرت بریدہ رضی اللہ عنہ سے روایت ہے کہ حضرت ابوبکر اور حضرت عمر رضی اللہ عنہ نے حضرت فاطمہ رضی اللہ عنہ کو نکاح کا پیغام بھیجا۔رسول اللہﷺ نے فرمایا: ’’وہ (تمہارے مقابلے میں) چھوٹی ہے۔‘‘ پھر حضرت علی رضی اللہ عنہ نے پیغام بھیجا تو آپ نے ان سے فاطمہ کا نکاح کردیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;