var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو تُمَيْلَةَ عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَابَ أَهْلِ الدُّنْيَا الَّذِي يَذْهَبُونَ إِلَيْهِ الْمَالُ";
nasai.urdu = "حضرت بریدہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’دنیا والوں کے نزدیک حسب صرف مال کا نام ہے جس کا وہ خیال رکھتے ہیں۔(رشتہ داری وغیرہ کے وقت)۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;