var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مَخْلَدٌ عَنْ سُفْيَانَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَمْرِو بْنِ بُجْدَانَ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّعِيدُ الطَّيِّبُ وَضُوءُ الْمُسْلِمِ وَإِنْ لَمْ يَجِدْ الْمَاءَ عَشْرَ سِنِينَ";
nasai.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’پاک مٹی مسلمان کے لیے ذریعۂ طہارت ہے،خواہ دس سال پانی نہ ملے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;