var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُنْكَحُ النِّسَاءُ لِأَرْبَعَةٍ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’عورتوں سے چاروجوہات کی بنا پر نکاح کیا جاتا ہے: مال کی بنا پر‘ حسب ونسب کی بنا پر‘ خوب صورتی کی بنا پر۔تو دین والی کو حاصل کر‘ تیرے ہات خاک آلودہ ہوں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;