var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قِيلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ النِّسَاءِ خَيْرٌ قَالَ الَّتِي تَسُرُّهُ إِذَا نَظَرَ وَتُطِيعُهُ إِذَا أَمَرَ وَلَا تُخَالِفُهُ فِي نَفْسِهَا وَمَالِهَا بِمَا يَكْرَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے‘ رسول اللہﷺ سے پوچھا گیا: کون سی عورت بہتر ہے؟ آپ نے فرمایاء ’’وہ عورت کہ جب خاوند اسے دیکھے تو وہ اسے خوش کردے۔اور جب اسے کوئی حکم دے تو وہ اس کی اطاعت کرے اور اپنے نفس اور مال میں اس کی مخالفت نہ کرے جسے وہ ناپسند کرتا ہو۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;