var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَنْبَأَنَا النَّضْرُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسٍ قَالُوا يَا رَسُولَ اللَّهِ أَلَا تَتَزَوَّجُ مِنْ نِسَاءِ الْأَنْصَارِ قَالَ إِنَّ فِيهِمْ لَغَيْرَةً شَدِيدَةً";
nasai.urdu = "حضرت انسؓ سے مروی ہے کہ لوگوں نے کہا اے اللہ کے رسول!آپ انصاری عورتوں میں سے کسی کے ساتھ شادی نہیں فرمائیں گے؟آپ نے فرمایا:ان میں غیرت بہت ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;