var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ خَطَبَ رَجُلٌ امْرَأَةً مِنْ الْأَنْصَارِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ نَظَرْتَ إِلَيْهَا قَالَ لَا فَأَمَرَهُ أَنْ يَنْظُرَ إِلَيْهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ایک آدمی نے ایک انصاری عورت کو شادی کا پیغام بھیجا۔رسول ا للہﷺ نے فرمایا: ’’تو نے اسے دیکھا ہے؟‘‘ اس نے کہا: نہیں۔آپ نے فرمایا ’’(پہلے) اسے دیکھ لے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;