var nasai = {};
nasai.arabic = "أَخْبَرَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَخْطُبْ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَنْكِحَ أَوْ يَتْرُكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبیﷺ نے فرمایا: ’’تم میں سے کوئی شخص اپنے بھائی کے پیغام نکاح پر اپنا پیغام نہ بھیجے حتیٰ کہ وہ نکاح کرلے یا پیغام چھوڑ دے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;