var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ سَمِعْتُ نَافِعًا يُحَدِّثُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ الرَّجُلِ حَتَّى يَتْرُكَ الْخَاطِبُ قَبْلَهُ أَوْ يَأْذَنَ لَهُ الْخَاطِبُ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ فرماتے تھے: رسول اللہﷺ نے منع فرمایا کہ تم میں سے کوئی شخص کسی دوسرے کے سودے پر سودا کرے یا اس کے پیغام نکاح پر پیغام بھیجے‘ حتی کہ پہلے پیغام بھیجنے والا ارادہ ترک کردے یا دوسرے کو اجازت دے دے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;