var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا أَرَادَ أَنْ يَتَزَوَّجَ امْرَأَةً فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْظُرْ إِلَيْهَا فَإِنَّ فِي أَعْيُنِ الْأَنْصَارِ شَيْئًا";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ ایک آدمی نے ایک (انصاری) عورت سے شادی کرنے کا ارادہ کیا تو نبیﷺ سے نکاح کی پیش کش کرنے کا بیان کا ارادہ کیا تو نبیﷺ نے فرمایا: ’’اسے دیکھ لینا‘ کیونکہ انصار کی آنکھوں میں خرابی ہوتی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;