var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنِي مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ الْعَطَّارُ أَبُو عَبْدِ الصَّمَدِ قَالَ سَمِعْتُ ثَابِتًا الْبُنَانِيَّ يَقُولُ كُنْتُ عِنْدَ أَنَسِ بْنِ مَالِكٍ وَعِنْدَهُ ابْنَةٌ لَهُ فَقَالَ جَاءَتْ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَرَضَتْ عَلَيْهِ نَفْسَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ أَلَكَ فِيَّ حَاجَةٌ";
nasai.urdu = "حضرت ثابت بنانی سے روایت ہے کہ میں حضرت انس بن مالک رضی اللہ عنہ کے پاس تھا جبکہ ان کی ایک بیٹی تھی ان کے پاس موجود تھی۔حضرت انس رضی اللہ عنہ نے فرمایا: ایک عورت رسول اللہﷺ کے پاس حاضر ہوئی اور اس نے آپ کو نکاح کی پیش کش کی اور کہا: اے اللہ کے رسول! کیا آپ مجھ سے نکاح کی ضرورت ہے؟";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;