var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مَرْحُومٌ قَالَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍ أَنَّ امْرَأَةً عَرَضَتْ نَفْسَهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَحِكَتْ ابْنَةُ أَنَسٍ فَقَالَتْ مَا كَانَ أَقَلَّ حَيَاءَهَا فَقَالَ أَنَسٌ هِيَ خَيْرٌ مِنْكِ عَرَضَتْ نَفْسَهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے منقول ہے کہ ایک عورت نے نبیﷺ کو نکاح کی پیش کش کی۔(یہ سن کر) حضرت انس رضی اللہ عنہ کی ایک بیٹی ہنسنے لگی اور کہا: وہ عورت کس قدر کم حیا والی تھی۔حضرت انس رضی اللہ عنہ فرمانے لگے: وہ تجھ سے زیادہ بہتر تھی کہ اس نے نبیﷺ کو نکاح کی پیش کش کی۔";
nasai.hukam = "حسن";
nasai.description = ``;