var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى الصُّوفِيُّ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا عِيسَى بْنُ طَهْمَانَ أَبُو بَكْرٍ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَتْ زَيْنَبُ بِنْتُ جَحْشٍ تَفْخَرُ عَلَى نِسَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَنْكَحَنِي مِنْ السَّمَاءِ وَفِيهَا نَزَلَتْ آيَةُ الْحِجَابِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے مروی ہے کہ حضرت زینب بنت حجشؓ نبیﷺ کی دوسری ازواج مطہرات پر فخر کیا کرتی تھیں کہ اللہ تعالیٰ نے میرا نکاح آسمانوں پر فرمایا‘ نیز ان کے بارے میں پردے والی آیت اتری۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;