var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سُفْيَانَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ بَعْضَ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَتْ مِنْ الْجَنَابَةِ فَتَوَضَّأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِفَضْلِهَا فَذَكَرَتْ ذَلِكَ لَهُ فَقَالَ إِنَّ الْمَاءَ لَا يُنَجِّسُهُ شَيْءٌ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے منقول ہے،نبی ﷺ کی کسی زوجۂ مطہرہ نے غسل جنابت کیا۔نبی ﷺ نے ان کے بچے ہوئے پانی سے وضو کرنا چاہا،تو انھوں نے یہ بات آپ کو بتائی۔آپ نے فرمایا: ’’تحقیق پانی کو کوئی چیز پلید نہیں کرتی۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (68) ترمذی (65) ابن ماجہ (370)`;
nasai.anwaar = [322,1];