var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَأَحْمَدُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ تَزَوَّجَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ بِنْتُ تِسْعٍ وَمَاتَ عَنْهَا وَهِيَ بِنْتُ ثَمَانِيَ عَشْرَةَ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ رسول اللہﷺ نے اس سے شادی فرمائی تو وہ نو سال کی تھیں۔آپﷺ فوت ہوئیہ تو وہ اٹھارہ سال کی تھیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;