var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺنے فرمایا: ’’بیوہ عورت اپنے نکاح کے بارے میں اپنے ولی سے زیادہ اختیار رکھتی ہے اور کنواری لڑکی سے بھی اس کے نکاح کے بارے میں اجازت لی جائے۔اور اس کی اجازت اس کا خاموش رہنا (انکار نہ کرنا) ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;