var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ الرِّبَاطِيُّ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي صَالِحُ بْنُ كَيْسَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ بْنِ عَبَّاسِ بْنِ رَبِيعَةَ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَيِّمُ أَوْلَى بِأَمْرِهَا وَالْيَتِيمَةُ تُسْتَأْمَرُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺنے فرمایا: ’’بیوہ اپنے معاملہ میں زیادہ اختیار رکھتی ہے۔اور کنواری لڑکی سے بھی اس کی ذات کے متعلق مشورہ کیا جائے گا‘ البتہ اس کی خاموشی اس کی اجازت (کی دلیل) ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;