var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ لِلْوَلِيِّ مَعَ الثَّيِّبِ أَمْرٌ وَالْيَتِيمَةُ تُسْتَأْمَرُ فَصَمْتُهَا إِقْرَارُهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ کا بیان ہے کہ نبیﷺ نے فرمایا: ’’بیوہ کے مقابلے میں ولی کو اختیار نہیں اور نابالغ یا کنواری سے بھی مشورہ کرلیا جائے۔اگر وہ خاموش رہے تو یہ اس کی طرف سے اقرار اور اجازت ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;