var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الثَّيِّبُ أَحَقُّ بِنَفْسِهَا وَالْبِكْرُ يَسْتَأْمِرُهَا أَبُوهَا وَإِذْنُهَا صُمَاتُهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’بیوہ عورت اپنے (نکاح کے) بارے میں زیادہ اختیار رکھتی ہے۔اور کنواری لڑکی سے بھی اس کا باپ اجازت حاصل کرے۔اور اس کی خاموشی اجازت ہی ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;