var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ قَالَ حَدَّثَنَا يَحْيَى أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْذَنَ وَلَا تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْمَرَ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ إِذْنُهَا قَالَ إِذْنُهَا أَنْ تَسْكُتَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’بیوہ کا نکاح نہ کیا جائے حتیٰ کہ اس سے اجازت حاصل کرلی جائے۔اور کنواری لڑکی کا بھی نکاح نہ کیا جائے حتیٰ کہ اس سے مشورہ کرلیا جائے۔‘‘ صحابہ نے پوچھا: اے اللہ کے رسول! اس کی اجازت کیسے معلوم ہوگی؟ آپ نے فرمایا: ’’اس کی اجازت یہ ہے کہ وہ خاموش رہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;