var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ يُحَدِّثُ عَنْ ذَكْوَانَ أَبِي عَمْرٍو عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اسْتَأْمِرُوا النِّسَاءَ فِي أَبْضَاعِهِنَّ قِيلَ فَإِنَّ الْبِكْرَ تَسْتَحِي وَتَسْكُتُ قَالَ هُوَ إِذْنُهَا";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’عورتوں سے ان کے نکاح کے بارے میں مشورہ کرلیا کرو۔‘‘ کہا گیا کہ کنواری لڑکی تو شرمائے گی اور چپ رہے گی۔آپ نے فرمایا: ’’یہی اس کی اجازت ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;