var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسْتَأْمَرُ الْيَتِيمَةُ فِي نَفْسِهَا فَإِنْ سَكَتَتْ فَهُوَ إِذْنُهَا وَإِنْ أَبَتْ فَلَا جَوَازَ عَلَيْهَا";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’یتیم بچی سے اس کے نکاح کے بارے میں مشورہ کیا جائے۔اگر وہ چپ رہے تو یہی اس کی اجازت ہے۔اگر وہ انکار کردے تو اس پر زبردستی نہیں کی جاسکتی۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;