var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سَوَاءٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ وَيَعْلَى بْنُ حَكِيمٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ تَزَوَّجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَيْمُونَةَ بِنْتَ الْحَارِثِ وَهُوَ مُحْرِمٌ وَفِي حَدِيثِ يَعْلَى بِسَرِفَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے حضرت میمونہ بنت حارثؓ سے احرام کی حالت میں‘ حضرت یعلیٰ کی روایت کی رُو سے مقام سرف‘ میں نکاح فرمایا۔";
nasai.hukam = "صحیح";
nasai.description = ``;