var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْحَجَّاجِ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَكَحَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ جَعَلَتْ أَمْرَهَا إِلَى الْعَبَّاسِ فَأَنْكَحَهَا إِيَّاهُ";
nasai.urdu = "حضرت ابن عباسؓ سے روایت ہہے کہ نبیﷺ نے حضرت میمونہؓ سے احرام کی حالت میں نکاح فرمایا۔حضرت میمونہ نے اپنا وکیل حضرت عباس رضی اللہ عنہ کو مقرر فرمایا تھا‘ لہٰذا انہوں نے آپ سے ان کا نکاح کردیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;