var nasai = {};
nasai.arabic = "حَدَّثَنَا أَبُو الْأَشْعَثِ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ مَطَرٍ وَيَعْلَى بْنُ حَكِيمٍ عَنْ نُبَيْهِ بْنِ وَهْبٍ عَنْ أَبَانَ بْنِ عُثْمَانَ أَنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ حَدَّثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَنْكِحُ الْمُحْرِمُ وَلَا يُنْكِحُ وَلَا يَخْطُبُ";
nasai.urdu = "حضرت عثمان بن عفان رضی اللہ عنہ نے بیان فرمایا ہے کہ نبیﷺ نے فرمایا: ’’محرم اپنا نکاح کرے نہ کسی کا کرائے اور نہ نکاح کا پیغام بھیجے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;