var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْعَزِيزِ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ تَشَهَّدَ رَجُلَانِ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُهُمَا مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشِدَ وَمَنْ يَعْصِهِمَا فَقَدْ غَوَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَ الْخَطِيبُ أَنْتَ";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ بیان کرتے ہیں کہ دو آدمیوں نے نبیﷺ کی موجودگی میں خطبہ دیا۔ان میں سے ایک نے کہا: جو اللہ اور اس کے رسول کی اطاعت کرے گا‘ وہ ہدایت یافتہ ہوگا۔او جوان دونوں کی نافرمانی کرے گا‘ وہ گمراہ ہوگا۔رسول اللہﷺ نے فرمایا: ’’تو برا خطیب ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;