var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ يُوَفَّى بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺنے فرمایا: ’’جو شرط پوری کرنا سب سے زیادہ ضروری ہے‘ وہ ہے جس کے ساتھ تم عورتوں کو اپنے لیے حلال کرتے ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;