var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ تَمِيمٍ قَالَ سَمِعْتُ حَجَّاجًا يَقُولُ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَنَّ أَبَا الْخَيْرِ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ يُوَفَّى بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’جس شرط کو پورا کرنا سب سے زیادہ ضروری ہے‘ وہ ہے جس کے ساتھ تم عورتوں کو اپنے لیے حلال کرتے ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;