var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَاءِ وَمَا يَنُوبُهُ مِنْ الدَّوَابِّ وَالسِّبَاعِ فَقَالَ إِذَا كَانَ الْمَاءُ قُلَّتَيْنِ لَمْ يَحْمِلْ الْخَبَثَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے مروی ہے کہ اللہ کے رسول ﷺ سے اس پانی کے بارے میں پوچھا گیا جس پر جانور (اور خصوصاً) درندے (پینے کے لیے) آتے جاتے رہتے ہیں؟ آپ نےفرمایا: ’’جب پانی دو مٹکے ہو تو وہ پلید نہیں ہوتا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;