var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَلَا بَيْنَ الْمَرْأَةِ وَخَالَتِهَا";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’کسی عورت اور اس کی پھوپھی یا کسی عورت اور س کی خالہ سے (بیک وقت) نکاح نہ کیاجائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;