var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَعْقُوبَ بْنِ عَبْدِ الوَهَّابِ بْنِ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ بْنِ الْعَوَّامِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ عَنْ يُونُسَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي قُبَيْصَةُ بْنُ ذُؤَيْبٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَالْمَرْأَةِ وَخَالَتِهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے منع فرمایا کہ ایک عورت اور اس کی پھوپھی یا ایک عورت اور اس کی خالہ سے بیک وقت نکاح کیا جائے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;