var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ أَنَّ جَعْفَرَ بْنَ رَبِيعَةَ حَدَّثَهُ عَنْ عِرَاكِ بْنِ مَالِكٍ وَعَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ خَالَتِهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے منع فرمایا کہ کسی عورت سے اس کی پھوپھی یا خالہ کے نکاح پر نکاح کیا جائے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;