var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ حَدَّثَنَا اللَّيْثُ قَالَ أَخْبَرَنِي أَيُّوبُ بْنُ مُوسَى عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الْمَلِكِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا عَلَى خَالَتِهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’کسی عورت سے اس کی پھوپھی یا اس کی خالہ کے نکاح پر نکاح نہ کیاجائے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;