var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا عَلَى خَالَتِهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’کسی عورت سے اس کی پھوپھی یا خالہ کے ساتھ نکاح ہوتے ہوئے نکاح نہ کیا جائے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;