var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْمُعْتَمِرُ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا وَالْعَمَّةُ عَلَى بِنْتِ أَخِيهَا";
nasai.urdu = "حضرت ابوہریرہـ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے منع فرمایا کہ کسی عورت سے ا س کی پھوپھی کے ن کاح پر نکاح کیا جائے یا پھوپھی سے اس کی بھتیجی کے نکاح پر نکاح کیا جائے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;