var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي عَاصِمٌ قَالَ قَرَأْتُ عَلَى الشَّعْبِيِّ كِتَابًا فِيهِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا عَلَى خَالَتِهَا قَالَ سَمِعْتُ هَذَا مِنْ جَابِرٍ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے‘ نبیﷺ نے فرمایا: ’’کسی عورت سے س کی پھوپھی یا اس کی خالہ کے ساتھ نکاح کی موجودگی میںنکاح نہ کیا جائے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;