var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ أَعْرَابِيًّا بَالَ فِي الْمَسْجِدِ فَقَامَ إِلَيْهِ بَعْضُ الْقَوْمِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُزْرِمُوهُ فَلَمَّا فَرَغَ دَعَا بِدَلْوٍ مِنْ مَاءٍ فَصَبَّهُ عَلَيْهِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،وہ بیان کرتے ہیں کہ ایک اعرابی نے مسجد میں پیشاب کرنا شروع کر دیا۔کچھ لوگ اس کی جانب اٹھے تو آپ نے فرمایا: ’’اس کا پیشاب نہ روکو۔‘‘ جب وہ فارغ ہوگیا تو آپ نے پانی کا ایک ڈول منگوایا اور پیشاب پر بہا دیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;