var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ عَنْ ابْنِ الْمُبَارَكِ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا وَخَالَتِهَا";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بن عبداللہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے منع فرمایا کہ کسی عورت سے اس کی پھوپھی یا خالہ کے نکاح پر نکاح کیاجائے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;