var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ أَنْبَأَنَا مَالِكٌ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا حَرَّمَتْهُ الْوِلَادَةُ حَرَّمَهُ الرَّضَاعُ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’جورشتے پیدائشی نسب کی وجہ سے حرام ہیں‘ رضاعت کی وجہ سے بھی حرام ہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;