var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عِرَاكٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا أَخْبَرَتْهُ أَنَّ عَمَّهَا مِنْ الرَّضَاعَةِ يُسَمَّى أَفْلَحَ اسْتَأْذَنَ عَلَيْهَا فَحَجَبَتْهُ فَأُخْبِرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا تَحْتَجِبِي مِنْهُ فَإِنَّهُ يَحْرُمُ مِنْ الرَّضَاعِ مَا يَحْرُمُ مِنْ النَّسَبِ";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے کہ ان کی رضاعی چچا جس کا نام افلح تھا‘ نے ان ہاں آنے کی اجازت طلب کی تو انہوں نے اس سے پردہ کیا۔پھر رسول اللہﷺ کو بتلایا گیا تو آپ نے فرمایا: ’’عائشہ! اس سے پردہ نہ کرو کیونکہ رضاعت کی بنا پر وہ سب رشتے حرام ہوجاتے ہیں جو نسب کی بنا پر حرام ہوتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;