var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ عَمْرَةَ قَالَتْ سَمِعْتُ عَائِشَةَ تَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْرُمُ مِنْ الرَّضَاعِ مَا يَحْرُمُ مِنْ الْوِلَادَةِ";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’رضاعت کی وجہ سے وہ سب رشتے (نکاح کے لیے) حرام ہوجاتے ہیں جو پیدائشی نسب کی وجہ سے حرام ہوتے ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;