var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ ذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنْتُ حَمْزَةَ فَقَالَ إِنَّهَا ابْنَةُ أَخِي مِنْ الرَّضَاعَةِ قَالَ شُعْبَةُ هَذَا سَمِعَهُ قَتَادَةُ مِنْ جَابِرِ بْنِ زَيْدٍ";
nasai.urdu = "حضرت ابن عاس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺسے حضرت حمزہ رضی اللہ عنہ کی بیٹی (سے نکاح کرنے) کا ذکر کیا گیا تو آپ نے فرمایا: ’’بلاشبہ وہ میرے رضاعی بھائی کی بیٹی ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;