var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرِيدَ عَلَى بِنْتِ حَمْزَةَ فَقَالَ إِنَّهَا ابْنَةُ أَخِي مِنْ الرَّضَاعَةِ وَإِنَّهُ يَحْرُمُ مِنْ الرَّضَاعِ مَا يَحْرُمُ مِنْ النَّسَبِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ سے حضرت حمزہ رضی اللہ عنہ کی بیٹی کے ساتھ نکاح کرنے کا مطالبہ کیا گیا تو آپ نے فرمایا: ’’بلاشبہ وہ میرے رضاعی بھائی کی بیٹی ہے اور یقینا رضاعت کی بنا پر وہ سب رشتے حرام ہوجاتے ہیں جو نسب کی بنا پر حرام ہوتے ہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;