var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ وَأَيُّوبُ عَنْ صَالِحٍ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ عَنْ أُمِّ الْفَضْلِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الرَّضَاعِ فَقَالَ لَا تُحَرِّمُ الْإِمْلَاجَةُ وَلَا الْإِمْلَاجَتَانِ وَقَالَ قَتَادَةُ الْمَصَّةُ وَالْمَصَّتَانِ";
nasai.urdu = "حضرت ام الفضلؓ سے روایت ہے کہ نبیﷺ سے رضاعت کے بارے میں پوچھا گیا کہ آپ نے فرمایا: ’’ایک وہ گھونٹ یا ایک دو دفعہ چوسنا حرمت کو ثابت ن ہیں کرتا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;