var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ قَالَتْ جَاءَ عَمِّي أَبُو الْجَعْدِ مِنْ الرَّضَاعَةِ فَرَدَدْتُهُ قَالَ وَقَالَ هِشَامٌ هُوَ أَبُو الْقُعَيْسِ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْذَنِي لَهُ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ میرا رضاعی چچا ابوالجعد مجھے ملنے آیا مگر میں نے اسے گھر میں داخل نہ ہونے دیا۔اور ہشام نے کہا: وہ ابوالقعیس تھا۔رسول اللہﷺ گھر میں تشریف لائے تو میں نے آپ کو سارا واقعہ بتلایا۔آپ نے فرمایا: ’’اسے گھر میں آنے کی اجازت دو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;