var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرٍو وَهُوَ ابْنُ الْحَارِثِ عَنْ بُكَيْرٍ أَنَّ أَبَا السَّائِبِ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’تم میں سے کوئی آدمی جب کہ وہ جنبی ہو،ٹھہرے پانی میں نہ نہائے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;