var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى أَبُو الْوَزِيرِ قَالَ سَمِعْتُ ابْنَ وَهْبٍ قَالَ أَخْبَرَنِي سُلَيْمَانُ عَنْ يَحْيَى وَرَبِيعَةُ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةَ أَبِي حُذَيْفَةَ أَنْ تُرْضِعَ سَالِمًا مَوْلَى أَبِي حُذَيْفَةَ حَتَّى تَذْهَبَ غَيْرَةُ أَبِي حُذَيْفَةَ فَأَرْضَعَتْهُ وَهُوَ رَجُلٌ قَالَ رَبِيعَةُ فَكَانَتْ رُخْصَةً لِسَالِمٍ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ نبیﷺ نے حضرت ابو حذیفہؓ کی بیوی کو حکم دیا تھا کہ وہ سالم مولیٰ ابوحذیفہ کو دودھ پلادے تاکہ ابوحذیفہ کی غیرت (اس کے آنے جانے پر) نہ بھڑکے۔انہوں نے اسے دودھ پلادیا‘ حالانکہ وہ پورا مرد تھا۔ربیعہ راوی نے کہا: یہ (رخصت) حضرت سالم کے لیے تھی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;