var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ وَإِسْحَقُ بْنُ مَنْصُورٍ عَنْ عَبْدِ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ جُدَامَةَ بِنْتَ وَهْبٍ حَدَّثَتْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنْ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ فَارِسَ وَالرُّومَ يَصْنَعُهُ وَقَالَ إِسْحَقُ يَصْنَعُونَهُ فَلَا يَضُرُّ أَوْلَادَهُمْ";
nasai.urdu = "حضرت جدامہ بنت وہبؓ کا بیان ہے کہ رسول اللہﷺ نے فرمایا: ’’میرا ارادہ تھا کہ میں لوگوں کو مدت رضاعت میں جماع کرنے سے روک دوں لیکن مجھے پتہ چلا کہ فارسی اور رومی یہ کام کرتے ہیں اور اس سے ان کے (دودھ پیتے) بچوں کو کوئی نقصان نہیں ہوتا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;