var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ قَالَ وَحَدَّثَنِي أَبِي عَنْ حَجَّاجِ بْنِ حَجَّاجٍ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرَّضَاعِ قَالَ غُرَّةُ عَبْدٍ أَوْ أَمَةٍ";
nasai.urdu = "حضرت حجاج رضی اللہ عنہ سے روایت ہے کہ میں نے عرض کیا: اے اللہ کے رسول! کون سی چیز رضاعت کا حق ادا کرسکتی ہے؟ آپ نے فرمایا: ’’ایک غلام یا لونڈی (رضاعی والدہ کو دے دو)۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;