var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ عَنْ السُّدِّيِّ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ الْبَرَاءِ قَالَ لَقِيتُ خَالِي وَمَعَهُ الرَّايَةُ فَقُلْتُ أَيْنَ تُرِيدُ قَالَ أَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَجُلٍ تَزَوَّجَ امْرَأَةَ أَبِيهِ مِنْ بَعْدِهِ أَنْ أَضْرِبَ عُنُقَهُ أَوْ أَقْتُلَهُ";
nasai.urdu = "حضرت براء رضی اللہ عنہ سے مروی ہے کہ اپنے ماموں کو ملا جب کہ ان کے پاس ایک جھنڈا تھا۔میں نے کہا: کہاں کا ارادہ ہے؟ انہوں نے مجھے فرمایا: مجھے رسول اللہﷺ نے ایک آدمی کی طرف بھیجا ہے جس نے اپنے والد کی وفات کے بعد اس کی منکوحہ بیوی سے نکاح کرلیا تھا‘ کہ میں اس کی گردن اتاردوں‘ یا اسے قتل کردوں۔";
nasai.hukam = "حسن";
nasai.description = ``;