var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا بِشْرٌ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا جَلَبَ وَلَا جَنَبَ وَلَا شِغَارَ فِي الْإِسْلَامِ وَمَنْ انْتَهَبَ نُهْبَةً فَلَيْسَ مِنَّا";
nasai.urdu = "حضرت عمرابن بن حصیب رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’اسلام میں جَلَب‘ جَنَب اور شِغار جائز نہیں۔اور جو شخص لوٹ مار کرے‘ وہ ہم میں سے نہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;