var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْفَزَارِيِّ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا جَلَبَ وَلَا جَنَبَ وَلَا شِغَارَ فِي الْإِسْلَامِ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ فَاحِشٌ وَالصَّوَابُ حَدِيثُ بِشْرٍ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’اسلام میں جلب‘ جنب اور شغار نہیں۔\nابو عبدالرحمٰن (امام نسائی رحمہ اللہ) بیان کرتے ہیں کہ یہ شدید غلطی ہے۔صحیح روایت بشر کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;