var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ مَالِكٌ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشِّغَارِ وَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ الرَّجُلَ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ ابْنَتَهُ وَلَيْسَ بَيْنَهُمَا صَدَاقٌ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے نکاح شغار سے منع فرمایا ہے۔اور نکاح شغار یہ ہے کہ ایک شخص دوسرے شحص سے اپنی بیٹی کا نکاح کرید اس شرط پر کہ وہ بھی اپنی بیٹی کا نکاح اس سے کردے گا اور ان دونوں نکاحوں میں کوئی مہر نہ ہو۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;