var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ وَنَقِّ قَلْبِي مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انھوں نے فرمایا: اللہ کے رسول ﷺ فرمایا کرتے تھے: ’’اے اللہ! میری غلطیاں برف اور اولوں کے پانی سے دھو دے۔اور میرے دل کو غلطیوں سے اس طرح پاک صاف فرما دے جس طرح تو نے سفید کپڑے کو میل کچیل سے پاک صاف رکھا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;