var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَا حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الشِّغَارِ قَالَ عُبَيْدُ اللَّهِ وَالشِّغَارُ كَانَ الرَّجُلُ يُزَوِّجُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ أُخْتَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے شغار سے منع فرمایا: راوی عبیداللہ نے کہا: شغار یہ ہے کہ آدمی اپنی بیٹی کا نکاح دے اس شرط پر کہ دوسرا اسے اپنی بہن کا نکاح دے گا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;