var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ وَعَبْدُ الْعَزِيزِ يَعْنِي ابْنَ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ ح وَأَنْبَأَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ وَشُعَيْبٌ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ وَجَعَلَهُ صَدَاقَهَا";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے حضرت صفیہd کو آزاد فرمایا اور ان کی آزادی ہی کو ان کا مہر قراردیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;