var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا سُفْيَانُ ح وَأَنْبَأَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ يُونُسَ عَنْ ابْنِ الْحَبْحَابِ عَنْ أَنَسٍ أَعْتَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا مَهْرَهَا وَاللَّفْظُ لِمُحَمَّدٍ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے حضرت صفیہؓ کو آزاد (فرما کر ان سے نکاح) فرمایا اور ان کی آزادی کو ان کامہر قراردیا۔یہ لفظ محمد (بن رافع) کے ہیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;