var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ قَالَ سَأَلْتُ عَائِشَةَ عَنْ ذَلِكَ فَقَالَتْ فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى اثْنَتَيْ عَشْرَةَ أُوقِيَّةً وَنَشٍّ وَذَلِكَ خَمْسُ مِائَةِ دِرْهَمٍ";
nasai.urdu = "حضرت ابوسلمہ بیان کرتے ہیں کہ میں نے حضرت عائشہؓ سے مہر کے بارے میں پوچھا تو انہوں نے فرمایا: رسول اللہﷺ نے ساڑھے بارہ اوقیے پر نکاح کیے اور پانچ سودرہم بنتے ہیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;