var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ قَالَ سَمِعْتُ أَنَسًا يَقُولُ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيَّ بَشَاشَةُ الْعُرْسِ فَقُلْتُ تَزَوَّجْتُ امْرَأَةً مِنْ الْأَنْصَارِ قَالَ كَمْ أَصْدَقْتَهَا قَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ";
nasai.urdu = "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ بیان کرتے ہیں کہ ایک دفعہ رسول اللہﷺ نے مجھے دیکھا تو مجھ پر شادی کی خوشی کے آثار تھے۔(آپ نے پوچھا تو) میںنے کہا: میں نے ایک انصاری عورت سے شادی کرلی ہے۔آپ نے فرمایا: ’’مہر کتنا دیا؟‘‘ میں نے کہا: سونے کا نواۃ۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;