var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ أَبِي رَزِينٍ وَأَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَلَغَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيُرِقْهُ ثُمَّ لِيَغْسِلْهُ سَبْعَ مَرَّاتٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،وہ بیان کرتے ہیں کہ اللہ کے رسول ﷺ نے فرمایا: ’’جب تم میں سے کسی کے برتن میں کتا منہ ڈال کر پیے تو اسے چاہیے کہ مشروب کو گرا دے اور برتن کو سات دفعہ دھوئے۔";
nasai.hukam = "صحیح";
nasai.description = ``;