var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ خَالِدِ بْنِ عُرْفُطَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَأْتِي جَارِيَةَ امْرَأَتِهِ قَالَ إِنْ كَانَتْ أَحَلَّتْهَا لَهُ جَلَدْتُهُ مِائَةً وَإِنْ لَمْ تَكُنْ أَحَلَّتْهَا لَهُ رَجَمْتُهُ";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے اس آدمی کے بارے میں جو اپنی بیوی کی لونڈی سے جماع کرتا تھا‘ فرمایا: ’’اگر اس (کی بیوی) نے اپنی لو نڈی کو اس کے لیے حلال کیا تھا تو میں اسے کوڑے ماروں گا اور اگر اس نے لونڈی کو اس کے لیے حلال نہیں کیا تھا تو میں اسے رجم کردوں گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;