var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا عَارِمٌ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي رَجُلٍ وَقَعَ بِجَارِيَةِ امْرَأَتِهِ إِنْ كَانَتْ أَحَلَّتْهَا لَهُ فَأَجْلِدْهُ مِائَةً وَإِنْ لَمْ تَكُنْ أَحَلَّتْهَا لَهُ فَأَرْجُمْهُ";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے ایک آدمی کے بارے میں جس نے اپنی بیوی کی لونڈی سے جماع کرلیا تھا‘ فرمایا: ’’اگر تو اس کی بیوی نے لونڈی کو اس کے لیے حلال کیا تھا تو میں اسے کوڑے مارں گا اور اگر اس نے اسے حلال نہیں کیا تھا تو میں اسے رجم کروں گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;