var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ الْحَسَنِ وَعَبْدِ اللَّهِ ابْنَيْ مُحَمَّدٍ عَنْ أَبِيهِمَا أَنَّ عَلِيًّا بَلَغَهُ أَنَّ رَجُلًا لَا يَرَى بِالْمُتْعَةِ بَأْسًا فَقَالَ إِنَّكَ تَائِهٌ إِنَّهُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهَا وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ يَوْمَ خَيْبَرَ";
nasai.urdu = "محمد ابن حنیفہ رحمہ اللہ سے راویت ہے کہ حضرت علی رضی اللہ عنہ کو یہ بات پہنچی کہ ایک آدمی متعہ میں کوئی حرج نہیں سمجھتا۔آپ اسے فرمانے لگے: تو تو راہِ راست سے بھٹکا ہوا ہے۔رسول اللہﷺ نے خیبر (کی جنگ) کے دن متعہ اور گھریوں گدھوں کے گوشت سے روک دیا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;