var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ وَالْحَسَنِ ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے غزوئہ خیبر کے دن عورتوں کے ساتھ نکاح متعہ اور اجنسان کے پاس رہنے والے گدھوں کا گوشت کھانے سے منع فرمایا ہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;