var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ عَنْ شُعْبَةَ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ مُطَرِّفًا عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ وَرَخَّصَ فِي كَلْبِ الصَّيْدِ وَالْغَنَمِ وَقَالَ إِذَا وَلَغَ الْكَلْبُ فِي الْإِنَاءِ فَاغْسِلُوهُ سَبْعَ مَرَّاتٍ وَعَفِّرُوهُ الثَّامِنَةَ بِالتُّرَابِ";
nasai.urdu = "حضرت عبداللہ بن مغفل رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے کتوں کو قتل کرنے کا حکم دیا اور شکار اور بکریوں کی حفاظت کے لیے کتا رکھنے کی اجازت دی اور فرمایا: ’’جب کتا برتن میں منہ ڈال دے تو اسے سات دفعہ دھوو اور آٹھویں دفعہ اسے مٹی سے مانجو۔";
nasai.hukam = "صحیح";
nasai.description = ``;