var nasai = {};
nasai.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا خَالِدٌ عَنْ أَشْعَثَ عَنْ الْحَسَنِ قَالَ تَزَوَّجَ عَقِيلُ بْنُ أَبِي طَالِبٍ امْرَأَةً مِنْ بَنِي جَثْمٍ فَقِيلَ لَهُ بِالرِّفَاءِ وَالْبَنِينَ قَالَ قُولُوا كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَارَكَ اللَّهُ فِيكُمْ وَبَارَكَ لَكُمْ";
nasai.urdu = "حضرت حسن بصری بیان کرتے ہیں کہ حضرت عقیل بن ابی طالب نے بنو جشم کی اییک عورت سے شادی کی تو انہیں مبارک باد یوں دی گئی: ’’تم محبت وپیار سے رہو اور تمہں بیٹے ملیں۔‘‘ حضرت حسن نے فرمایا: اس کی بجائے اس طرح کہو جیسے رسول اللہﷺ فرمایا کرتے تھے:] بَارَکَ اللہُ فِیْکُمْ وَبَارَکَ لَکُم[’’اللہ تعالیٰ تم میں اور تمہارے لیے برکت فرمائے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (1906)<br>الحسن البصري مدلس وعنعن۔<br>وللحدیث شواھد ضعیفۃ۔<br>وحدیث أبي داود (الأصل: 2130) یغني عنہ۔`;
nasai.anwaar = [346,1];