var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى عَبْدِ الرَّحْمَنِ أَثَرَ صُفْرَةٍ فَقَالَ مَا هَذَا قَالَ تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ فَقَالَ بَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺنے حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ کے جسم پر صفرہ (خوشبو) کا نشان دیکھا تو فرمایا: ’’یہ کیا ہے؟‘‘ انہوں نے کہا: میں نے ایک عورت سے سونے کا سکہ نواۃ مہر مقرر کرکے شادی کی ہے۔آپ نے فرمایا: ’’اللہ تعالیٰ تیرے لیے (اس نکاح میں) برکت فرمائے۔ولیمہ ضرور کرنا‘ چاہے ایک بکری کے ساتھ ہی ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;