var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ عَنْ عَبْدَةَ عَنْ سَعِيدٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ لَمَّا تَزَوَّجَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا شَيْئًا قَالَ مَا عِنْدِي قَالَ فَأَيْنَ دِرْعُكَ الْحُطَمِيَّةُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ جب حضرت علی رضی اللہ عنہ نے حضرت فاطمہ رضی اللہ عنہ سے شادی کی تو رسول اللہﷺ نے فرمایا: ’’اسے کچھ دو۔‘‘ انہوں نے کہا: میرے پاس تو کچھ نہیں۔آپ نے فرمایا: ’’تیری حطمی زرہ کہا ں ہے؟‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;