var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَوَّالٍ وَأُدْخِلْتُ عَلَيْهِ فِي شَوَّالٍ فَأَيُّ نِسَائِهِ كَانَ أَحْظَى عِنْدَهُ مِنِّي";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہ فرماتی ہیں کہ رسول اللہﷺ نے مجھ سے شوال میں نکاح فرمایا اور شوال میں ہی آپ کے ہاں میری رخصتی ہوئی۔(بتاؤ!) پھر آپ کی بیویوں میں سے کون آپ کے ہاں مجھ سے بڑھ کر محبت سے بہرہور ہوئی؟";
nasai.hukam = "حسن";
nasai.description = ``;