var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سِتٍّ وَدَخَلَ عَلَيَّ وَأَنَا بِنْتُ تِسْعِ سِنِينَ وَكُنْتُ أَلْعَبُ بِالْبَنَاتِ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ رسول اللہﷺ نے مجھ سے نکاح فرمایا تو میں چھ سال کی تھی اور مجھے اپنے گھر آباد فرمایا تو میں نو سال کی تھی اور گڑیوں سے کھیلا کرتی تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;