var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سَعْدِ بْنِ الْحَكَمِ بْنِ أَبِي مَرْيَمَ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ قَالَ أَخْبَرَنِي عُمَارَةُ بْنُ غَزِيَّةَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ بِنْتُ سِتِّ سِنِينَ وَبَنَى بِهَا وَهِيَ بِنْتُ تِسْعٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہ فرماتی ہیں کہ رسول اللہﷺ نے مجھ سے نکاح فرمایا تو میں چھ سال کی تھی اور مجھے اپنے گھر بسایا تو میں نو سال کی تھی۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;