var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ يَحْيَى عَنْ حُمَيْدٍ أَنَّهُ سَمِعَ أَنَسًا يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ عَلَى صَفِيَّةَ بِنْتِ حُيَيِّ بْنِ أَخْطَبَ بِطَرِيقِ خَيْبَرَ ثَلَاثَةَ أَيَّامٍ حِينَ عَرَّسَ بِهَا ثُمَّ كَانَتْ فِيمَنْ ضُرِبَ عَلَيْهَا الْحِجَابُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ خیبر کے راستے میں حضرت صفیہ بنت حیی بن اخطب کے ساتھ تین دن (خصوصی طور پر) ٹھہرے جب آپ نے انہیں اپنے گھر بسایا‘ پھر حضرت صفیہ رضی اللہ عنہ ان عورتوں میں شامل تھیںجنہیں پردے میں رکھا جاتا تھا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;