var nasai = {};
nasai.arabic = "أَخْبَرَنَا نَصِيرُ بْنُ الْفَرَجِ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ زَائِدَةَ قَالَ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ جَهَّزَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاطِمَةَ فِي خَمِيلٍ وَقِرْبَةٍ وَوِسَادَةٍ حَشْوُهَا إِذْخِرٌ";
nasai.urdu = "حضرت علی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے (اپنی پیاری بیٹی) فاطمہ رضی اللہ عنہ کو ایک چادر‘ ایک مشکیزہ اور ایک سرہانہ جس میں اذخر کی گھاس بھری ہوئی تھی‘ (رخصتی کے موقع پر) ساتھ دیے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;