var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ يَقُولُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِرَاشٌ لِلرَّجُلِ وَفِرَاشٌ لِأَهْلِهِ وَالثَّالِثُ لِلضَّيْفِ وَالرَّابِعُ لِلشَّيْطَانِ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’ایک بستر آدمی کے لیے‘ دوسرا اس کی بیوی کے لیے‘ تیسرا مہمان کے لیے اور چھوتھا شیطان کے لیے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;