var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ تَزَوَّجْتَ قُلْتُ نَعَمْ قَالَ هَلْ اتَّخَذْتُمْ أَنْمَاطًا قُلْتُ وَأَنَّى لَنَا أَنْمَاطٌ قَالَ إِنَّهَا سَتَكُونُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے مجھ سے فرمایا: ’’تو نے شادی کی ہے؟‘‘ میں نے عرض کیا: جی ہاں۔فرمایا: ’’کیا تمہارے پاس قالین ہیں؟‘‘ میں نے کہا: ہمارے پاس قالین کہاں؟ آپ نے فرمایا: ’’یقینا عن قریب تمہارے پاس قالین ہوں گے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;