var nasai = {};
nasai.arabic = "حَدَّثَنِي الشَّيْخُ الْإِمَامُ أَبُو عَبْدِ الرَّحْمَنِ النَّسَائِيُّ قَالَ أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى الْقُوْمَسِيُّ قَالَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا سَلَّامٌ أَبُو الْمُنْذِرِ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُبِّبَ إِلَيَّ مِنْ الدُّنْيَا النِّسَاءُ وَالطِّيبُ وَجُعِلَ قُرَّةُ عَيْنِي فِي الصَّلَاةِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’دنیوی چیزوں میں سے بیوی اور خوشبو مجھے بہت پسند ہیں۔اور میری آنکھوں کی ٹھنڈک نماز میں رکھ دی گئی ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;