var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ مُسْلِمٍ الطُّوسِيُّ قَالَ حَدَّثَنَا سَيَّارٌ قَالَ حَدَّثَنَا جَعْفَرٌ قَالَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُبِّبَ إِلَيَّ النِّسَاءُ وَالطِّيبُ وَجُعِلَتْ قُرَّةُ عَيْنِي فِي الصَّلَاةِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’(دنیوی چیزوں میں) مجھے بیوی اور خوشبو بہت پسند ہیں لیکن میری آنکھوں کی ٹھنڈک نماز میں مضمر ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;