var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ لَمْ يَكُنْ شَيْءٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ النِّسَاءِ مِنْ الْخَيْلِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ بیویوں کے بعد رسول اللہﷺ کو کوئی چیز گھوڑوں سے بڑھ کر پسند نہیں تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>حدیث الآتی (3594)`;
nasai.anwaar = [346,1];