var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ مُرَّةَ الْجُهَنِيِّ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ";
nasai.urdu = "حضرت ابوموسیٰـ رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’عائشہؓ کی فضیلت تمام عورتوں پر ایسے ہے جیسے ترید کی فضیلت دوسرے کھانوں پر۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;