var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ أَحَدُكُمْ فِي جُحْرٍ قَالُوا لِقَتَادَةَ وَمَا يُكْرَهُ مِنْ الْبَوْلِ فِي الْجُحْرِ قَالَ يُقَالُ إِنَّهَا مَسَاكِنُ الْجِنِّ";
nasai.urdu = "حضرت عبداللہ بن سرجس رضی اللہ عنہ سے روایت ہے،اللہ کے نبی ﷺ نے فرمایا: ’’تم میں سے کوئی شخص بل (زمینی سوراخ) میں پیشاب نہ کرے۔‘‘ شاگردوں نے قتادہ سے پوچھا کہ بل میں پیشاب کرنا کیوں منع ہے؟ تو انھوں نے کہا: کہا جاتا ہے کہ سوراخ جنوں کی رہائش گاہیں ہیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (29)`;
nasai.anwaar = [321,1];