var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وَلَغَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ أُولَاهُنَّ بِالتُّرَابِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب کتا کسی کے برتن سے پی جائے تو وہ اسے سات دفعہ دھوئے۔ان میں سے پہلی دفعہ مٹی کے ساتھ (دھوئے)۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;