var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِر الطَّعَامِ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’دوسری عورتوں پر عائشہؓ کی فضیلت ایسے ہے جیسے دوسرے کھانوں پر ثرید کو فضیلت حاصل ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;