var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَقَ الصَّغَانِيُّ قَالَ حَدَّثَنَا شَاذَانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أُمَّ سَلَمَةَ لَا تُؤْذِينِي فِي عَائِشَةَ فَإِنَّهُ وَاللَّهِ مَا أَتَانِي الْوَحْيُ فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ إِلَّا هِيَ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’اے ام سلمہ! مجھے عائشہ کی بابت تکلیف نہ دے۔اللہ کی قسم! اس کے علاوہ تم میں سے کسی کے لحاف میں مجھے وحی نہیں آئی۔‘‘";
nasai.hukam = "إسنادہ صحیح، صحیح بخاری";
nasai.description = ``;