var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ يَبْتَغُونَ بِذَلِكَ مَرْضَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ لوگ قصداً اپنے تحفے عائشہؓ کی باری کے دن بھیجا کرتے تھے۔اس سے ان کا مقصود رسول اللہﷺ کی خوشی اور رضا مندی کا حصول تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;