var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدَةَ عَنْ هِشَامٍ عَنْ صَالِحِ بْنِ رَبِيعَةَ بْنِ هُدَيْرٍ عَنْ عَائِشَةَ قَالَتْ أَوْحَى اللَّهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ فَقُمْتُ فَأَجَفْتُ الْبَابَ بَيْنِي وَبَيْنَهُ فَلَمَّا رُفِّهَ عَنْهُ قَالَ لِي يَا عَائِشَةُ إِنَّ جِبْرِيلَ يُقْرِئُكِ السَّلَامَ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ ایک دفعہ اللہ تعالیٰ نے نبیﷺکی طرف وحی نازل فرمائی۔میں بھی آپ کے ساتھ تھی۔میں اٹھ گئی اور درمیان والا دروازہ بندکردیا۔جب آپ سے وحی کی شدت دور ہوئی تو آپ نے فرمایا: ’اے عائشہ! جبریل تجھے سلام کہہ رہے ہیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>صالح بن ربیعۃ بن ھدیر: لم یوثقہ غیر ابن حبان۔`;
nasai.anwaar = [346,1];