var nasai = {};
nasai.arabic = "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا إِنَّ جِبْرِيلَ يَقْرَأُ عَلَيْكِ السَّلَامَ قَالَتْ وَعَلَيْهِ السَّلَامُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ تَرَى مَا لَا نَرَى";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ نبیﷺ نے مجھے فرمایا: ’’جبریل علیہ السلام تجھے سلام کہہ رہے ہیں۔‘‘ میں نے جواباً کہا: (و علیہ السلام ورحمۃ اللہ وبرکاتہ) ’’ان پر بھی سلامتی‘ رحمتیں اور برکتیں ہوں۔‘‘ آپ وہ کچھ دیکھتے ہیں کہ ہم نہیں دیکھتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;