var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ قَالَ أَنْبَأَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَائِشَةُ هَذَا جِبْرِيلُ وَهُوَ يَقْرَأُ عَلَيْكِ السَّلَامَ مِثْلَهُ سَوَاءٌ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا الصَّوَابُ وَالَّذِي قَبْلَهُ خَطَأٌ";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’عائشہ! یہ جبریل ہیں اور تجھے سلام کہہ رہے ہیں۔‘‘ مذکورہ بالا روایت کی طرح۔\nابوعبدالرحمٰن (امام نسائی رحمہ اللہ) نے فرمایا: یہ روایت صحیح ہے۔اس سے پہلی روایت خطا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;