var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كُنْتُ أَتَعَرَّقُ الْعَرْقَ فَيَضَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاهُ حَيْثُ وَضَعْتُهُ وَأَنَا حَائِضٌ وَكُنْتُ أَشْرَبُ مِنْ الْإِنَاءِ فَيَضَعُ فَاهُ حَيْثُ وَضَعْتُ وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،فرماتی ہیں: بسا اوقات میں ایک ہڈی سے گوشت نوچتی تو رسول اللہ ﷺ اپنا دہن مبارک وہیں رکھتے جہاں میں نے رکھا تھا،حالانکہ میں حیض کی حالت میں ہوتی تھی۔اسی طرح میں برتن سے پانی پیتی تو آپ اپنا منہ مبارک وہیں رکھتے جہاں میں نے اپنا منہ رکھا تھا،حالانکہ میں حیض کی حالت میں ہوتی تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;