var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ قَالَ سَمِعْتُ مُجَاهِدًا يُحَدِّثُهُ عَنْ ابْنِ عَبَّاسٍ فِي قَوْلِهِ عَزَّ وَجَلَّ يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمْ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ قَالَ ابْنُ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُ قُبُلِ عِدَّتِهِنَّ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے منقول ہے کہ اللہ تعالیٰ کا فرمان: یٰآَیُّھَاالنَّبِیُّ اِذَا طَلَّقْتُمْ النِّسَائَ فَطَلَّقْتُمُوْھُنَّ لِعِدَّتِھِنَّ… میں لِعِدَّتِھِنَّ… سے مراد قُبُلِ عِدَّتِھِنَّ ہے‘ یعنی عدت کے آغاز میں (طلاق دو)۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;