var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ طَلَاقُ السُّنَّةِ أَنْ يُطَلِّقَهَا طَاهِرًا فِي غَيْرِ جِمَاعٍ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ طلاق سنت یہ ہے کہ عورت کو طہر کی حالت میں بغیر جماع کے (ایک) طلاق دے دے۔";
nasai.hukam = "ضعیف";
nasai.description = `۔3424] إسناد ضعیف<br>ابن ماجہ (2020،2021)<br>أبو إسحاق عنعن۔`;
nasai.anwaar = [347,1];