var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى طَلْحَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ لِيُطَلِّقْهَا وَهِيَ طَاهِرٌ أَوْ حَامِلٌ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ انہوں نے اپنی بیوی کو حیض کی حالت میں طلاق دے دی تھی۔یہ بات نبیﷺ کے سامنے ذکر ہوئی تو آپ نے فرمایا: ’’اسے کہو کہ اس سے رجوع کرے‘ پھر طہر یا حمل کی حالت میں اسے طلاق دے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;