var nasai = {};
nasai.arabic = "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا أَبُو بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَرَدَّهَا عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى طَلَّقَهَا وَهِيَ طَاهِرٌ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے منقول ہے کہ انہوں نے اپنی بیوی کو حیض کی حالت میں طلاق دے دی تھی۔رسول اللہﷺ نے ان کی بیوی کو ان کی طرف لوٹا دیا حتیٰ کہ انہوں نے اسے طہر کی حالت میں طلاق دی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;