var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ عَنْ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُطَلَّقَةُ ثَلَاثًا لَيْسَ لَهَا سُكْنَى وَلَا نَفَقَةٌ";
nasai.urdu = "حضرت فاطمہ بنت قیس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’جس عورت کو تین طلاقیں ہوچکی ہوں اسے دوران عدت میں خرچہ ورہائش نہیں ملیں گے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;