var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ الْأَحْوَلِ قَالَ سَمِعْتُ أَبَا حَاجِبٍ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَاسْمُهُ سَوَادَةُ بْنُ عَاصِمٍ عَنْ الْحَكَمِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ وُضُوءِ الْمَرْأَةِ";
nasai.urdu = "حضرت حکم بن عمرو رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے منع فرمایا کہ مرد،عورت کے وضو (یا غسل) سے بچے ہوئے پانی کے ساتھ وضو کرے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;