var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ سُفْيَانَ عَنْ أَبِي قَيْسٍ عَنْ هُزَيْلٍ عَنْ عَبْدِ اللَّهِ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَاشِمَةَ وَالْمُوتَشِمَةَ وَالْوَاصِلَةَ وَالْمَوْصُولَةَ وَآكِلَ الرِّبَا وَمُوكِلَهُ وَالْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے جسم میں رنگ بھرنے والی‘ بھروانے والی‘ زائد بال ملانے والی اور جسے زائد بال لگائے جائیں‘ سود کھانے والے اور کھلانے والے‘ حلالہ کرنے والے اور جس کے لیے حلالہ کیا جائے‘ ان سب پر لعنت فرمائی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;