var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَطِيَّةَ الْقُرَظِيِّ قَالَ كُنْتُ يَوْمَ حُكْمِ سَعْدٍ فِي بَنِي قُرَيْظَةَ غُلَامًا فَشَكُّوا فِيَّ فَلَمْ يَجِدُونِي أَنْبَتُّ فَاسْتُبْقِيتُ فَهَا أَنَا ذَا بَيْنَ أَظْهُرِكُمْ";
nasai.urdu = "حضرت عطیہ قرظی سے مروی ہے کہ جن دنوں حضرت سعد رضی اللہ عنہ نے بنوقریضہ کے بارے میں فیصلہ سنایا‘ میں بچہ تھا۔انہیں میرے بارے میں شک ہوا (کہ بالغ ہے یا نابالغ) لیکن جب مجھے دیکھا تو میرے شرم گاہ کے بال نہیں اجگے تھے تو مجھے چھوڑ دیا گیا۔دیکھ لو اب میں تمہارے درمیان موجود ہوں۔";
nasai.hukam = "صحیح";
nasai.description = ``;