var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَضَهُ يَوْمَ أُحُدٍ وَهُوَ ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً فَلَمْ يُجِزْهُ وَعَرَضَهُ يَوْمَ الْخَنْدَقِ وَهُوَ ابْنُ خَمْسَ عَشْرَةَ سَنَةً فَأَجَازَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے غزوئہ احد کے موقع پر میرا جائزہ لیا۔میں اس وقت چودہ سال کا تھا۔آپ نے مجھے جنگ میں شرکت کی اجازت نہ دی‘ پھر غزوہ خندق کے موقع پر جائز لیا تو میں پندرہ سال کا ہوچکا تھا۔آپ نے مجھے اجازت دے دی۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;