var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَبْدُ الرَّحْمَنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَعَالَى تَجَاوَزَ عَنْ أُمَّتِي كُلَّ شَيْءٍ حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَكَلَّمْ بِهِ أَوْ تَعْمَلْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے‘ رسول اللہﷺ نے فرمایا: ’’اللہ تعالیٰ نے میری امت کو وہ باتیں معاف فرمادی ہیں جو وہ اپنے دل میں کرتے ہیں‘ جب تک وہ زبان پر نہ لائیں یا ان پر عمل نہ کریں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;