var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ مِسْعَرٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ تَجَاوَزَ لِأُمَّتِي مَا وَسْوَسَتْ بِهِ وَحَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَعْمَلْ أَوْ تَتَكَلَّمْ بِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’اللہ تعالیٰ نے میری امت کو وسوسے اور دلی خیالات معاف کردیے ہیں جب تک وہ ان پر عمل نہ کریں یا زبان پر نہ لائیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;