var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ شَيْبَانَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَعَالَى تَجَاوَزَ لِأُمَّتِي عَمَّا حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَكَلَّمْ أَوْ تَعْمَلْ بِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’اللہ تعالیٰ نے میری امت کو دلی وساوس اور وقتی خیالات معاف فرمادیے ہیں جب تک وہ ان کو زبان پر نہ لائیں یا ان پر عمل نہ کریں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;