var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنِي شُعَيْبٌ قَالَ حَدَّثَنِي أَبُو الزِّنَادِ مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الْأَعْرَجُ مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ انْظُرُوا كَيْفَ يَصْرِفُ اللَّهُ عَنِّي شَتْمَ قُرَيْشٍ وَلَعْنَهُمْ إِنَّهُمْ يَشْتِمُونَ مُذَمَّمًا وَيَلْعَنُونَ مُذَمَّمًا وَأَنَا مُحَمَّدٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے فرمایا: ’’دیکھو! اللہ تعالیٰ قریش کے گالی گلوچ اور لعن طعن کو مجھ سے کیسے دور رکھتا ہے؟ وہ مذمم کو برا کہتے ہیں اور مذمم کو لعنت کرتے ہیں جب کہ میں تو محمد ہوں۔‘‘ (ﷺ)";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;