var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ الْكُوفِيُّ قَالَ حَدَّثَنَا عَبْدَةُ يَعْنِي ابْنَ سُلَيْمَانَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ بِمُدٍّ وَيَغْتَسِلُ بِنَحْوِ الصَّاعِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے منقول ہے،فرماتی ہیں کہ بے شک رسول اللہ ﷺ ایک مد کے ساتھ وضو کر لیا کرتے تھے اور تقریباً ایک صاع کے ساتھ غسل فرما لیا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;