var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ قَدْ خَيَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءَهُ أَفَكَانَ طَلَاقًا";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ رسول اللہﷺ نے اپنی ازواج مطہرات کو طلاق کا اختیار دیا تھا تو کیا یہ طلاق بن گیا؟ (جب کہ انہوں نے آپ کو اختیار کیا تھا)۔";
nasai.hukam = "حسن";
nasai.description = ``;