var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الضَّعِيفُ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ خَيَّرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَرْنَاهُ فَلَمْ يَعُدَّهَا عَلَيْنَا شَيْئًا";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ ہمیں رسول اللہﷺ نے طلاق لینے کا اختیار دیا تھا۔ہم سب نے (طلاق کے بجائے) آپ کو پسند کیا۔چنانچہ آپ نے اس عمل کو ہمارے خلاف طلاق شمار نہیں فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;