var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا ابْنُ مَوْهَبٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَ كَانَ لِعَائِشَةَ غُلَامٌ وَجَارِيَةٌ قَالَتْ فَأَرَدْتُ أَنْ أُعْتِقَهُمَا فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ابْدَئِي بِالْغُلَامِ قَبْلَ الْجَارِيَةِ";
nasai.urdu = "حضرت قاسم بن محمد سے مروی ہے کہ حضرت عائشہؓ کے پاس ایک غلام اور ایک لونڈی تھے (جو آپس میں میاں بیوی تھے)۔حضرت عائشہؓ کہتی ہیں: میں نے انہیں آزاد کرنے کا ارادہ کیا۔میں نے یہ بات رسول اللہﷺ سے ذکر کی تو آپ نے فرمایا: ’’غلام کو آزاد کرنا‘ لونڈی کو بعد میں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;