var nasai = {};
nasai.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُقْبَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَاعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْعَجْلَانِيِّ وَامْرَأَتِهِ وَكَانَتْ حُبْلَى";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے (عویمر) عجلانی اور ا س کی بیوی کے درمیان لعان کروایا جب کہ وہ (بیوی) حاملہ تھی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;