var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ رَجُلًا حِينَ أَمَرَ الْمُتَلَاعِنَيْنِ أَنْ يَتَلَاعَنَا أَنْ يَضَعَ يَدَهُ عِنْدَ الْخَامِسَةِ عَلَى فِيهِ وَقَالَ إِنَّهَا مُوجِبَةٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے جب لعان کرنے والوں کو لعان کا حکم دیا تو ایک آدمی سے فرمایا کہ پانچویں قسم کے وقت اس کے منہ پر ہاتھ رکھ دینا اور فرمایا: ’’یہ (عذاب کو) واجب کردے گی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;