var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ لَمْ يُفَرِّقْ الْمُصْعَبُ بَيْنَ الْمُتَلَاعِنَيْنِ قَالَ سَعِيدٌ فَذَكَرْتُ ذَلِكَ لِابْنِ عُمَرَ فَقَالَ فَرَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَخَوَيْ بَنِي الْعَجْلَانِ";
nasai.urdu = "حضرت سعید بن جبیر بیان کرتے ہیں کہ حضرت مصعب نے لعان کرنے والوں میں تفریق نہ کی۔میں نے یہ بات حضرت ابن عمر رضی اللہ عنہ سے ذکر کی تو انہوں نے فرمایا: رسول اللہﷺ سے ذکر کی تو انہوں نے فرمایا: رسول اللہﷺ نے تو بن عجلان کے لعان کرنے والے خاوند بیوی میں تفریق کردی تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;