var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا سَهْلُ بْنُ هَاشِمٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَقْبَلَتْ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،فرماتی ہیں: نبی ﷺ نے فرمایا: ’’جب حیض کا خون آنے لگے تو نماز چھوڑ دو اورجب رک جائے تو غسل کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;