var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ قَالَ أَبُو عَبْد الرَّحْمَنِ وَلَا أَحْسَبُ هَذَا عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَاللَّهُ تَعَالَى أَعْلَمُ";
nasai.urdu = "حضرت عبدالرحمٰن بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺنے فرمایا: ’’بچہ گھر والے کا ہوتاہے اور زانی کے لیے پتھر ہیں (یا محرومی ہے)۔‘‘\nابو عبدالرحمٰن (امام نسائی رحمہ اللہ) بیان کرتے ہیںکہ یہ روایت حضرت عبداللہ بن مسعود سے نہیں آتی۔(کسی راوی کی غلطی ہے)۔واللہ اعلم۔";
nasai.hukam = "صحیح";
nasai.description = ``;