var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ اسْتَفْتَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ فَقَالَ إِنَّ ذَلِكَ عِرْقٌ فَاغْتَسِلِي ثُمَّ صَلِّي فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلَاةٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،فرماتی ہیں: ام حبیبہ بنت جحش رضی اللہ عنہا نے رسول اللہ ﷺ سے مسئلہ پوچھا: اے اللہ کے رسول! تحقیق مجھے استحاضے کا خون آتا ہے،تو آپ نے فرمایا: ’’یہ ایک رگ ہے،لہٰذا حیض ختم ہونے کے بعد غسل کرکے نماز پڑھا کرو۔‘‘ تو وہ ہر نماز کے لیے غسل کیا کرتی تھیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;