var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ شَاهِينٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ عَنْ رَجُلٍ مِنْ حَضْرَمَوْتَ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِيًّا عَلَى الْيَمَنِ فَأُتِيَ بِغُلَامٍ تَنَازَعَ فِيهِ ثَلَاثَةٌ وَسَاقَ الْحَدِيثَ خَالَفَهُمْ سَلَمَةُ بْنُ كُهَيْلٍ";
nasai.urdu = "حضرت زید بن ارقم رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے حضرت علی رضی اللہ عنہ کو یمن پر حاکم بنا کر بھیجا۔ان کے پاس ایک بچہ لایا گیا جس میں تین آدمیوں کا تنازعہ تھا۔اور مذکورہ بالا کی مانند ساری حدیث بیان کی۔\nسلمہ بن کہیل نے ان کی مخالفت کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;