var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ شُعْبَةَ قَالَ حَدَّثَنِي حُمَيْدُ بْنُ نَافِعٍ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ قَالَتْ أُمُّ حَبِيبَةَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ تَحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثَةِ أَيَّامٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا";
nasai.urdu = "حضرت ام حبیبہؓ فرماتی ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’جو عورت اللہ تعالیٰ اور آخرت پر ایمان رکھتی ہو‘ اس کے لیے جائز نہیں کہ وہ کسی میت پر تین دن سے زائد سوگ کرے‘ البتہ خاوند پر چار ماہ دس دن سوگ کرے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;