var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا السَّهْمِيُّ يَعْنِي عَبْدَ اللَّهِ بْنَ بَكْرٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ أُمُّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ";
nasai.urdu = "نبیﷺ کی زوجئہ محترمہ حضرت ام سلمہؓ نبیﷺ سے سابقہ حدیث کی طرح ہی روایت بیان فرماتی ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;