var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لِمُحَمَّدٍ قَالَا أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ أَنَّ سُبَيْعَةَ الْأَسْلَمِيَّةَ نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَجَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنَتْ أَنْ تَنْكِحَ فَأَذِنَ لَهَا فَنَكَحَتْ";
nasai.urdu = "حضرت مسور بن مخرمہ رضی اللہ عنہ سے روایت ہے کہ سبیعہ اسلمیہ کا اس کے خاوند کی وفات سے چند راتیں بعد بچہ پیدا ہوگیا‘ پھر وہ رسول اللہﷺ کے پاس آئی اور نکاح کی اجازت طلب کی۔چنانچہ آپ نے اسے اجازت دے دی اور اس نے نکاح کرلیا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;