var nasai = {};
nasai.arabic = "أَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ قَالَ أَخْبَرَنِي عَنْ نَافِعٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ سَأَلَتْ امْرَأَةٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ إِنِّي أُسْتَحَاضُ فَلَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ قَالَ لَا وَلَكِنْ دَعِي قَدْرَ تِلْكَ الْأَيَّامِ وَاللَّيَالِي الَّتِي كُنْتِ تَحِيضِينَ فِيهَا ثُمَّ اغْتَسِلِي وَاسْتَثْفِرِي وَصَلِّي";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا سے مروی ہے،فرماتی ہیں کہ ایک عورت نے بنی ﷺ سے پوچھا: تحقیق مجھے خون آتا رہتا ہے،اس لیے میں کبھی پاک نہیں ہوتی،تو کیا میں مستقل نماز چھوڑ دوں؟ آپ نے فرمایا: ’’نہیں،بلکہ تم صرف اتنے دن رات نماز چھوڑو جن دنوں میں تمھیں حیض آیا کرتا تھا،پھر غسل کرکے لنگوٹ باندھ لو اور نماز شروع کر دو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (209)`;
nasai.anwaar = [323,1];