var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ كُرَيْبٍ عَنْ أُمِّ سَلَمَةَ وَمُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ كُرَيْبٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ وَضَعَتْ سُبَيْعَةُ بَعْدَ وَفَاةِ زَوْجِهَا بِأَيَّامٍ فَأَمَرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَزَوَّجَ";
nasai.urdu = "حضرت ام سلمہؓ فرماتی ہیں کہ سبیعہ نے اپنے خاوند کی وفات سے چند دن بعد نچہ جن دیا تھا۔تو رسول اللہﷺ نے اسے آگے نکاح کرنے کی اجازت دے دی۔";
nasai.hukam = "حسن";
nasai.description = ``;