var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا الْحَسَنُ وَهُوَ ابْنُ أَعْيَنَ قَالَ حَدَّثَنَا زُهَيْرٌ ح و أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ الْأَسْوَدِ وَمَسْرُوقٌ وَعَبِيدَةُ عَنْ عَبْدِ اللَّهِ أَنَّ سُورَةَ النِّسَاءِ الْقُصْرَى نَزَلَتْ بَعْدَ الْبَقَرَةِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ چھوٹی سورئہ نساء (سورئہ طلاق) سورئہ بقرہ کے بعد نازل ہوئی۔";
nasai.hukam = "صحیح";
nasai.description = ``;