var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تَحِدُّ عَلَى مَيِّتٍ أَكْثَرَ مِنْ ثَلَاثٍ إِلَّا عَلَى زَوْجِهَا";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے‘ رسول اللہﷺ نے فرمایا: ’’کسی عورت کے لیے جائز نہیں کہ وہ کسی میت پر تین دن سے زیادہ سوگ کرے‘ البتہ وہ خاوند پر (وہ چار ماہ دس دن تک سوگ کرے گی)۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;