var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ قَالَ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تَحِدَّ فَوْقَ ثَلَاثَةِ أَيَّامٍ إِلَّا عَلَى زَوْجٍ";
nasai.urdu = "حضرت عائشہؓ سے منقول ہے کہ نبیﷺ نے فرمایا: ’’جوعورت اللہ تعالیٰ پر اور یوم آخرت پر ایمان رکھتی ہے‘ اس کے لیے جائز نہیں کہ وہ خاوند کے علاوہ کسی میت پر تین دن سے زیادہ سوگ کرے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;