var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا وَرْقَاءُ عَنْ ابْنِ أَبِي نَجِيحٍ قَالَ عَطَاءٌ عَنْ ابْنِ عَبَّاسٍ نَسَخَتْ هَذِهِ الْآيَةُ عِدَّتَهَا فِي أَهْلِهَا فَتَعْتَدُّ حَيْثُ شَاءَتْ وَهُوَ قَوْلُ اللَّهِ عَزَّ وَجَلَّ غَيْرَ إِخْرَاجٍ(البقرۃ:240)";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ اس آیت نے عورت کے لیے خاوند کے گھر عدت گزارنے کو منسوخ کردیا ہے۔اب وہ جہاں چاہے عدت گزارسکتی ہے۔اس آیت سے مراد ہے اللہ تعالیٰ کا فرمان غَیْرَ اِخْرَاجْ‘ یعنی عورتوں کو دورانِ عدت میں گھروں سے نکالا نہ جائے‘ وہ خود علی جائیں تو کوئی حرج نہیں۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;