var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا عَاصِمٌ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تَحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ وَلَا تَكْتَحِلُ وَلَا تَخْتَضِبُ وَلَا تَلْبَسُ ثَوْبًا مَصْبُوغًا";
nasai.urdu = "حضرت ام عطیہؓ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’جو عورت اللہ تعالیٰ پر اور آخرت پر ایمان رکھتی ہے‘ اس کے لیے جائز نہیں کہ وہ خاوند کے علاوہ کسی میت پر تین دن سے زیادہ سوگ کرے۔(دوران سوگ) وہ (بیوہ عورت) سرمہ نہ لگائے‘ مہندی نہ لگائے اور بنائی کے بعد رنگا ہوا کپڑا نہ پہنے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;