var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ هُوَ الدُّورِيُّ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ عَنْ زَائِدَةَ عَنْ هِشَامٍ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ رَخَّصَ لِلْمُتَوَفَّى عَنْهَا عِنْدَ طُهْرِهَا فِي الْقُسْطِ وَالْأَظْفَارِ";
nasai.urdu = "حضرت ام عطیہؓ سے روایت ہے کہ نبیﷺ نے اس عورت کو جس کا خاوند فوت ہوگیاہو‘ طہر کے وقت قسط اور اظفار خوشبو استعمال کرنے کی اجازت دی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;