var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا حَفْصٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ فَاطِمَةَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ زَوْجِي طَلَّقَنِي ثَلَاثًا وَأَخَافُ أَنْ يُقْتَحَمَ عَلَيَّ فَأَمَرَهَا فَتَحَوَّلَتْ";
nasai.urdu = "حضرت فاطمہ بنت قیسؓ سے منقول ہے‘ کہتی ہیں کہ میں نے کہا: اے اللہ کے رسول! میرے خاوند نے مجھے تین طلاقیں دے دی ہیں (یعنی الگ الگ) مجھے خطرہ ہے کہ کوئی چور چکا دیوار نہ پھلانگ آئے‘ لہٰذا آپ نے مجھے اجازت دے دی اور میں خاوند کے گھر سے منتقل ہوگئی۔";
nasai.hukam = "حسن";
nasai.description = ``;