var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ طُلِّقَتْ خَالَتُهُ فَأَرَادَتْ أَنْ تَخْرُجَ إِلَى نَخْلٍ لَهَا فَلَقِيَتْ رَجُلًا فَنَهَاهَا فَجَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اخْرُجِي فَجُدِّي نَخْلَكِ لَعَلَّكِ أَنْ تَصَدَّقِي وَتَفْعَلِي مَعْرُوفًا";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ میری خالہ کو میری طلاق ہوگئی۔انہوں نے اپنے نخلستان میں جانا چاہا۔ایک آدمی انہیں ملا تو اس نے انہیں روک دیا۔وہ رسول اللہﷺ کی خدمت میں حاضر ہوئیں تو آپ نے فرمایا: ’’تو جا کر اپنی کھجوروں کا پھل توڑ سکتی ہے؟ ہوسکتا ہے تو اس سے صدقہ کرے یا کوئی اور نیک کام کرے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;