var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى مَرْوَزِيٌّ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَنْظَلَةُ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَاجَعَهَا";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ انہوں نے اپنی بیوی کو حیض کی حالت میں طلاق دے دی تھی۔چنانچہ رسول اللہﷺ نے انہیں رجوع کا حکم دیا‘لہٰذا انہوں نے رجوع کر لیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;