var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ أَنْبَأَنَا يَحْيَى بْنُ آدَمَ ح وَأَنْبَأَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سَهْلُ بْنُ مُحَمَّدٍ أَبُو سَعِيدٍ قَالَ نُبِّئْتُ عَنْ يَحْيَى بْنِ زَكَرِيَّا عَنْ صَالِحِ بْنِ صَالِحٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ عَمْرٌو إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ طَلَّقَ حَفْصَةَ ثُمَّ رَاجَعَهَا وَاللَّهُ أَعْلَمُ";
nasai.urdu = "حضرت عمر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے حفصہ کو طلاق دے دی تھی‘ پھر آپ نے رجوع فرمالیا تھا۔واللہ اعلم۔";
nasai.hukam = "صحیح";
nasai.description = ``;