var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ حَفْصٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ لَمْ يَكُنْ شَيْءٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ النِّسَاءِ مِنْ الْخَيْلِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ کو بیویوں کے بعد کوئی چیز گھوڑوں سے بڑھ کر محبوب نہیں تھی";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (3393)<br>قتادۃ عنعن۔`;
nasai.anwaar = [348,1];