var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ ح وَأَنْبَأَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ الشِّكَالَ مِنْ الْخَيْلِ وَاللَّفْظُ لِإِسْمَعِيلَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبیﷺ گھوڑے میں شکال کو پسند نہیں فرماتے تھے۔\nالفاظ اسماعیل بن مسعود کے ہیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;