var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ مَنْصُورٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشُّؤْمُ فِي ثَلَاثَةٍ الْمَرْأَةِ وَالْفَرَسِ وَالدَّارِ";
nasai.urdu = "حضرت سالم کے والد محترم (حضرت عبداللہ بن عمر رضی اللہ عنہ) سے روایت ہے کہ نبیﷺ نے فرمایا: ’’تین چیزوں میں نحوست ہوسکتی ہے: عورت ‘ گھوڑا اور گھر۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;