var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مَالِكٌ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ حَمْزَةَ وَسَالِمٍ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشُّؤْمُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے‘ رسول اللہﷺ نے فرمایا: ’’گھر‘ عورت اور گھوڑے میں نحوست ممکن ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;