var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الْأَشْعَثِ بْنِ عَبْدِ الْمَلِكِ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ أَحَدُكُمْ فِي مُسْتَحَمِّهِ فَإِنَّ عَامَّةَ الْوَسْوَاسِ مِنْهُ";
nasai.urdu = "حضرت عبداللہ بن مغفل رضی اللہ عنہ سےروایت ہے،نبی ﷺ نے فرمایا: ’’تم میں سے کوئی اپنے غسل کی جگہ میں پیشاب نہ کرے کیونکہ عموماً وسوسے اسی سے پیدا ہوتے ہیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (27) ترمذی (21) ابن ماجہ (304)`;
nasai.anwaar = [321,1];