var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ أَنَسًا ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي أَبُو التَّيَّاحِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَرَكَةُ فِي نَوَاصِي الْخَيْلِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘ رسول اللہﷺ نے فرمایا: ’’گھوڑوں کی پیشانیوں میں برکت رکھ دی گئی ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;