var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا يُونُسُ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ جَرِيرٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتِلُ نَاصِيَةَ فَرَسٍ بَيْنَ أُصْبُعَيْهِ وَيَقُولُ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْغَنِيمَةُ";
nasai.urdu = "حضرت جریر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو دیکھا کہ آپ اپنے گھوڑے کی پیشانی کے بال اور اپنی دوانگلیوں کے درمیان بٹ رہے تھے اور فرمارہے تھے: ’’گھوڑوں کی پیشانیوں میں قیامت تک کے لیے خبر رکھ دی گئی ہے‘ یعنی ثواب اور غنیمت۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;