var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَابَقَ بَيْنَ الْخَيْلِ يُرْسِلُهَا مِنْ الْحَفْيَاءِ وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضْمَرْ وَكَانَ أَمَدُهَا مِنْ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ رسول اللہﷺ نے گھوڑوں میں دوڑ کروائی۔آپ نے ان کو حفیا سے ثنیۃ الۃداع تک دوڑایا۔اور جن گھوڑوں کودوڑکے لیے تیار نہیں کیا گیا تھا‘ان کے درمیان ثنیۃ الوداع سے مسجد بنو زریق تک دوڑ کروائی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;