var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا سَبَقَ إِلَّا فِي نَصْلٍ أَوْ حَافِرٍ أَوْ خُفٍّ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’تیر اندازی‘ گھوڑ دوڑ اور اونٹ دوڑ کے علاوہ کسی مقابلے میں انعام (مقرر کرنا یا حاصل کرنا) درست نہیں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;