var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عُبَيْدِ اللَّهِ الْمَخْزُومِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا سَبَقَ إِلَّا فِي نَصْلٍ أَوْ خُفٍّ أَوْ حَافِرٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’تیر اندازی‘ گھوڑ دوڑ اور اونٹ دوڑ کے علاوہ کسی چیز میں انعام نہیں رکھا جاسکتا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;