var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ أَبِي جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ مَوْلَى الْجُنْدَعِيِّينَ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ لَا يَحِلُّ سَبَقٌ إِلَّا عَلَى خُفٍّ أَوْ حَافِرٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ اونٹ دوڑ یا گھوڑ دوڑ کے علاوہ کسی مقابلے میں انعام مقرر کرنا حلال اور جائز نہیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;