var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي الْحَكَمِ مَوْلًى لِبَنِي لَيْثٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا سَبَقَ إِلَّا فِي خُفٍّ أَوْ حَافِرٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ نبیﷺ نے فرمایا: ’’اونٹنوں اور گھوڑوں کے علاوہ دیگر جانوروں میں دوڑ کا انعامی مقابلہ نہیں کروایا جاسکتا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;