var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا حُمَيْدٌ قَالَ حَدَّثَنَا الْحَسَنُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا جَلَبَ وَلَا جَنَبَ وَلَا شِغَارَ فِي الْإِسْلَامِ وَمَنْ انْتَهَبَ نُهْبَةً فَلَيْسَ مِنَّا";
nasai.urdu = "حضرت عمران بن حصینؓسے راویت ہے کہ نبیﷺ نے فرمایا: ’’اسلام میں جلب‘ جنب اور نکاح شغار کی کوئی گنجائش نہیں۔اور جو شخص ڈاکاڈالے‘ وہ ہم میں سے نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;