var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ قَالَ سَمِعْتُ عَمْرَو بْنَ الْحَارِثِ يَقُولُ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا بَغْلَتَهُ الْبَيْضَاءَ وَسِلَاحَهُ وَأَرْضًا تَرَكَهَا صَدَقَةً";
nasai.urdu = "حضرت عمرو بن حارث بیان کرتے ہیں کہ رسول اللہﷺ اپنی وفات کے وقت کوئی چیز چھوڑ کر نہیں گئے‘ علاوہ آپ کے سفید خچر‘ اسلحہ اور زمین کے جنہیںآپ نے وقف قراردے دیا تھا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;