var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِيهِ قَالَ سَمِعْتُ عَمْرَو بْنَ الْحَارِثِ يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَرَكَ إِلَّا بَغْلَتَهُ الشَّهْبَاءَ وَسِلَاحَهُ وَأَرْضًا تَرَكَهَا صَدَقَةً";
nasai.urdu = "حضرت عمروبن حارثؓ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو دیکھا کہ آپ نے (اپنی وفات کے وقت) اپنے خچر‘ اسلحہ اور زمین کے علاوہ کچھ ترکہ نہیں چھوڑا اور انہیں بھی آپ (اپنی زندگی) میں صدقہ ووقف قراردے چکے تھے۔(ﷺ)";
nasai.hukam = "حسن";
nasai.description = ``;