var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ عُمَرُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْمِائَةَ سَهْمٍ الَّتِي لِي بِخَيْبَرَ لَمْ أُصِبْ مَالًا قَطُّ أَعْجَبَ إِلَيَّ مِنْهَا قَدْ أَرَدْتُ أَنْ أَتَصَدَّقَ بِهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْبِسْ أَصْلَهَا وَسَبِّلْ ثَمَرَتَهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ حضرت عمر رضی اللہ عنہ نے نبی اکرمﷺ سے کہا کہ وہ سو حصے میں مجھے خیبر میں ملے ہیں‘ میں نے کبھی بھی ان سے زیادہ عمدہ مال حاصل نہیں کیا۔میرا ارادہ ہے کہ وہ صدقہ کردوں۔نبی اکرمﷺ نے فرمایا: ’’اصل زمین وقف کردو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;