var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مُصَفَّى بْنِ بَهْلُولٍ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ سَعِيدِ بْنِ سَالِمٍ الْمَكِّيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَرْضٍ لِي بِثَمْغٍ قَالَ احْبِسْ أَصْلَهَا وَسَبِّلْ ثَمَرَتَهَا";
nasai.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا: میں نے رسول اللہﷺ سے تمغ مقام پر اپنی زمین کے بارے میں مشورہ کیا تو آپ نے فرمایا: ’’اصل زمین وقف کردو اور اس کا پھل صدقہ کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;