var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السَّلَمِيِّ قَالَ لَمَّا حُصِرَ عُثْمَانُ فِي دَارِهِ اجْتَمَعَ النَّاسُ حَوْلَ دَارِهِ قَالَ فَأَشْرَفَ عَلَيْهِمْ وَسَاقَ الْحَدِيثَ";
nasai.urdu = "حضرت ابوعبدالرحمٰن سلمی سے روایت ہے کہ جب حضرت عثمان رضی اللہ عنہ کو ان کے گھر میں محصور کردیا گیا تو لوگ ان کے گھر کے باہر جمع ہوگئے۔آپ نے دیوار سے انکی طرف سے جھانکا۔(پھر راوی نے سابقہ حدیث بیان کی) (تفصیل کے لیے دیکھیے‘ حدیث: ۳۱۸۴)";
nasai.hukam = "صحیح";
nasai.description = ``;