var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا الْفُضَيْلُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصَى فِيهِ أَنْ يَبِيتَ لَيْلَتَيْنِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جومسلمان اپنی کسی چیز کے بارے میں وصیت کرنا چاہتا ہے‘ اس کے لیے دوراتیں بھی بغیر وصیت کے گزارنا جائز نہیں بلکہ وصیت اس کے پاس لکھی ہوئی موجود ہونی چاہیے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;