var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصَى فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے ک رسول اللہﷺنے فرمایا: ’’کسی مسلمان شخص کے لیے‘ جس کے پاس کوئی چیز ہے جس میںوہ وصیت کرنا چاہتا ہے‘ یہ مناسب نہیں کہ وہ دوراتیں بھی گزارے مگر اس حال میں کہ اس کے پاس ا س کی وصیت تحریری صورت میں موجود ہونی چاہیے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;