var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى بْنِ الْوَزِيرِ بْنِ سُلَيْمَانَ قَالَ سَمِعْتُ ابْنَ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ وَعَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصَى فِيهِ فَيَبِيتُ ثَلَاثَ لَيَالٍ إِلَّا وَوَصِيَّتُهُ عِنْدَهُ مَكْتُوبَةٌ";
nasai.urdu = "حضرت سالم بن عبداللہ اپنے والد محترم سے بیان کرتے ہیں کہ رسول اللہﷺ نے فرمایا: ’’جس مسلمان شخص کے پاس کوئی چیز ہو جس میں وہ وصیت کرنا چاہتا ہے‘ اس کے لیے جائز نہیں کہ وہ تین راتیں بھی گزارے مگر اس حال میں کہ اس کی وصیت اس کے پاس لکھی ہونی چاہیے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;