var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ قَالَ حَدَّثَنَا طَلْحَةُ قَالَ سَأَلْتُ ابْنَ أَبِي أَوْفَى أَوْصَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قُلْتُ كَيْفَ كَتَبَ عَلَى الْمُسْلِمِينَ الْوَصِيَّةَ قَالَ أَوْصَى بِكِتَابِ اللَّهِ";
nasai.urdu = "حضرت طلحہ بیان کرتے ہیں کہ میں نے حضرت عبداللہ بن ابی اوفیٰ سے پوچھا: کیا رسول اللہﷺنے کوئی وصیت فرمائی تھی؟ انہوں نے فرمایا: نہیں۔میں نے کہا: پھر مسلمانوں پر وصیت کرنا کیوں ضروری قراردیا گیا ہے؟ انہوں نے فرمایا کہ آپ نے کتاب اللہ پر عمل کرنے کی وصیت فرمائی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;