var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا مُفَضَّلٌ عَنْ الْأَعْمَشِ وَأَنْبَأَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَأَحْمَدُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِينَارًا وَلَا دِرْهَمًا وَلَا شَاةً وَلَا بَعِيرًا وَلَا أَوْصَى بِشَيْءٍ";
nasai.urdu = "حضرت عائشہؓ سے راویت ہے کہ انہوں نے فرمایا کہ رسول اللہﷺ نے (وفات کے وقت) کوئی دینار،درہم،بکری‘ اونٹ نہیں چھوڑے اور نہ آپ نے (مال یا خلافت سے متعلق) کوئی وصیت فرمائی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;