var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا مُصْعَبٌ حَدَّثَنَا دَاوُدُ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرْهَمًا وَلَا دِينَارًا وَلَا شَاةً وَلَا بَعِيرًا وَمَا أَوْصَى";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے‘ انہوں نے فرمایا کہ رسول اللہﷺ نے (وفات کے وقت) کوئی دینار،درہم،بکری،اونٹ نہیں چھوڑے اور نہ آپ نے (مال یا خلافت سے متعلق) کوئی وصیت فرمائی۔";
nasai.hukam = "حسن";
nasai.description = ``;