var nasai = {};
nasai.arabic = "أَخْبَرَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ الْهُذَيْلِ وَأَحْمَدُ بْنُ يُوسُفَ قَالَا حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرْهَمًا وَلَا دِينَارًا وَلَا شَاةً وَلَا بَعِيرًا وَلَا أَوْصَى لَمْ يَذْكُرْ جَعْفَرٌ دِينَارًا وَلَا دِرْهَمًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہ فرماتی ہیں کہ رسول اللہﷺ نے کوئی درہم،کوئی دینار،کوئی بکری یا کوئی اونٹ نہیں چھوڑا‘ اور نہ آپ نے کوئی وصیت ہی فرمائی۔\n(روائی حدیث) جعفر بن محمد نے (روایت بیان کرتے ہوئے) دینار اور درہم کا ذکر نہیں کیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;