var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا مِسْعَرٌ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنِي بَعْضُ آلِ سَعْدٍ قَالَ مَرِضَ سَعْدٌ فَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أُوصِي بِمَالِي كُلِّهِ قَالَ لَا وَسَاقَ الْحَدِيثَ";
nasai.urdu = "حضرت سعد رضی اللہ عنہ کی آل میں سے کسی نے بیان کیا کہ حضرت سعد بیمار ہوگئے۔رسول اللہﷺ تشریف لائے تو حضرت سعد نے عرض کیا: اے اللہ کے رسول! میں اپنے سارے مال (کو صدقہ کرنے) کی وصیت کردوں؟ آپ نے فرمایا: ’’نہیں۔‘‘ پھر (راوی نے سابقہ) حدیث بیان کی۔";
nasai.hukam = "صحیح";
nasai.description = ``;