var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ سَعْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَادَهُ فِي مَرَضِهِ فَقَالَ يَا رَسُولَ اللَّهِ أُوصِي بِمَالِي كُلِّهِ قَالَ لَا قَالَ فَالشَّطْرَ قَالَ لَا قَالَ فَالثُّلُثَ قَالَ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ";
nasai.urdu = "حضرت سعد رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ تشریف لائے۔میں نے کہا: اے اللہ کے رسول! میں اپنے سارے مال کی وصیت کردوں؟ آپ نے فرمایا: ’’نہیں۔‘‘ میں نے کہا: نصف؟ آپ نے فرمایا: ’’نہیں۔‘‘ میں نے کہا: تہائی؟ آپ نے فرمایا: ’’تہائی! تہائی بھی بہت ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;