var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ لَوْ غَضَّ النَّاسُ إِلَى الرُّبُعِ لِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ اگر لوگ تہائی سے کم کرے چوتھائی تک (وصیت کریں تو بہتر ہے کیونکہ رسول اللہﷺ نے فرمایا تھا: ’’تہائی بھی زیادہ ہی ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;