var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غُنْمٍ عَنْ عَمْرِو بْنِ خَارِجَةَ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ وَلَا وَصِيَّةَ لِوَارِثٍ";
nasai.urdu = "حضرت عمروبن خارجہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے خطبہ ارشاد فرمایا اور کہا: ’’اللہ تعالیٰ نے ہر حق والے کو اس کاحق دے دیا ہے‘ لہٰذا اب وارث کے لیے وصیت نہیں کی جاسکتی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;