var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَتَادَةَ عَنْ عَمْرِو بْنِ خَارِجَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ اسْمُهُ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ وَلَا وَصِيَّةَ لِوَارِثٍ";
nasai.urdu = "حضرت عمروبن خارجہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’اللہ عزوجل نے ہر حق والے کو اس کا حق دے دیا ہے‘ لہٰذا کسی وارث کے بارے میں (کمی یا بیشی کی) وصیت نہیں کی جاسکتی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;