var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَجُلًا قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أُمِّي افْتُلِتَتْ نَفْسُهَا وَإِنَّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ أَفَأَتَصَدَّقُ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ فَتَصَدَّقَ عَنْهَا";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ ایک آدمی نے رسول اللہﷺ سے کہا: میری والدہ کی جان اچانکل نکل گئی۔اگر اسے بات چیت کا موقع ملتا تو ہو ضرور صدقہ کرتی۔کیا میں اب اس کی طرف سے صدقہ کرسکتا ہوں؟ رسول اللہﷺ نے فرمایا: ’’ہاں۔‘‘ چنانچہ اس شخص نے اپنی والدہ کی طرف سے صدقہ کیا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;