var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا الْعَلَاءُ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ مِنْ صَدَقَةٍ جَارِيَةٍ وَعِلْمٍ يُنْتَفَعُ بِهِ وَوَلَدٍ صَالِحٍ يَدْعُو لَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جب انسان مرجاتا ہے تو تین صورتوں کے علاوہ‘ اس کے سب عمل منقطع ہوجاتے ہیں۔(اور وہ یہ ہیں:) صدقہ جاریہ‘ وہ علم جس سے (بعد میں بھی) فائدہ اٹھایا جاتا رہے اور نیک اولاد جو اس کے لیے دعا کرتی رہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;