var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَبِي مَاتَ وَتَرَكَ مَالًا وَلَمْ يُوصِ فَهَلْ يُكَفِّرُ عَنْهُ أَنْ أَتَصَدَّقَ عَنْهُ قَالَ نَعَمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے نبی اکرمﷺ سے کہا: میرے والد محترم فوت ہوگئے ہیں۔وہ کافی مال چھوڑ گئے ہیں لیکن انہوں نے کوئی وصیت وغیرہ نہیں کی۔اگر میں ان کی طرف سے (اپنے طور پر) صدقہ کردوں تو کیا ان کی یہ غلطی معاف ہوجائے گی؟ آپ نے فرمایا: ’’ہاں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;