var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ سَعْدًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أُمِّي مَاتَتْ وَلَمْ تُوصِ أَفَأَتَصَدَّقُ عَنْهَا قَالَ نَعَمْ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ انہوں نے نبی اکرمﷺ سے اس نذر کے بارے میں پوچھاجو ان کی والدہ کے ذمے تھی اور وہ نذر پوری کرنے سے پہلے فوت ہوگئیں تھیں۔رسول اللہﷺ نے فرمایا: ’’تم یہ نذر اپنی والدہ کی طرف سے پوری کردو۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;