var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَقَ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّهُ تُوُفِّيَتْ أَفَيَنْفَعُهَا إِنْ تَصَدَّقْتُ عَنْهَا قَالَ نَعَمْ قَالَ فَإِنَّ لِي مَخْرَفًا فَأُشْهِدُكَ أَنِّي قَدْ تَصَدَّقْتُ بِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباسؓ سے روایت ہے کہ ایک آدمی نے کہا:اے اللہ کے رسول!میری والدہ فوت ہو گئی ہے-اگر میں اس کی جانب سے صدقہ کردوں تو کیا اسے فائدہ ہو گا؟ آپ نے فرمایا:ہاں-اس آدمی نے کہا:میرے پاس ایک باغ ہے-میں آپ کو گواہ بناتا ہوں کہ میں نے اس کی طرف سے صدقہ کر دیا ہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;