var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ سَعْدِ بْنِ عُبَادَةَ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ أَفَيُجْزِئُ عَنْهَا أَنْ أُعْتِقَ عَنْهَا قَالَ أَعْتِقْ عَنْ أُمِّكَ";
nasai.urdu = "حضرت سعد بن عبادہؓ سے مروی ہے کہ میں نبیﷺ کی خدمت میں حاضر ہوا اور عرض کیا:میری والدہ فوت ہو گئی ہے-ان کے ذمے ایک نذر تھی-اگر میں ان کی طرف سے غلام آزاد کر دوں تو کیا ان سے (نذر کی)ادائیگی ہو جائے گی؟ رسول اللہﷺ نے فرمایا:تم اپنی والدہ کی طرف سے غلام آزاد کر سکتے ہو-";
nasai.hukam = "صحیح";
nasai.description = ``;