var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحَمَدَ أَبُو يُوسُفَ الصَّيْدَلَانِيُّ عَنْ عِيسَى وَهُوَ ابْنُ يُونُسَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ أَخْبَرَهُ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ سَعْدِ بْنِ عُبَادَةَ أَنَّهُ اسْتَفْتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت سعد بن عبادہ ؓ سے روایت ہے کہ انھوں نے نبی اکرم ﷺ سے اس نذر کےبارے میں سوال کیا جو ان کی والدہ کے ذمے تھی-اور وہ اسے پورا کرنے سے پہلے فوت ہو گئی تھیں-رسول اللہ ﷺ نے فرمایا:تم یہ نذر اس کی طرف سے پوری کر دو-";
nasai.hukam = "حسن";
nasai.description = ``;