var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ صَدَقَةَ الْحِمْصِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ أَخْبَرَهُ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ سَعْدِ بْنِ عُبَادَةَ أَنَّهُ اسْتَفْتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَمَاتَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا";
nasai.urdu = "حصرن سعد بن عبادہ رضی اللہ عنہ سے مروی ہے کہ انہوں نے نبی اکرمﷺ سے اس نذر کے بارے میں پوچھاجو ان کی والدہ کے ذمے تھی اور وہ نذر پوری کرنے سے پہلے فوت ہوگئیں تھیں۔رسول اللہﷺ نے فرمایا: ’’تم یہ نذر اپنی والدہ کی طرف سے پوری کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;