var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ قَالَ أَخْبَرَنِي أَبِي قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ أَخْبَرَنِي الزُّهْرِيُّ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ عَنْ ابْنِ عَبَّاسٍ قَالَ اسْتَفْتَى سَعْدٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا کہ حضرت سعد رضی اللہ عنہ نے رسول اللہﷺ سے اس نذر کے بارے میں پوچھا جو ان کی والدہ کے ذمے تھی اور وہ اسے پورا کرنے سے پہلے فوت ہوگئی تھی۔رسول ا للہﷺ نے فرمایا: ’’تم اس کی طرف سے ادا کردو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;