var nasai = {};
nasai.arabic = "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ حضرت سعد بن عبادہ رضی اللہ عنہ نے نبی اکرمﷺ سے اس کی نذر کے بارے میں پوچھا جو ان کی والدہ کے ذمے تھی لیکن ہو اسے پورا کرنے سے پہلے فوت ہوگئی تھی۔آپ نے فرمایا: ’’اس کی طرف سے تم اسے پورا کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;