var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ سَعْدٍ أَنَّهُ قَالَ مَاتَتْ أُمِّي وَعَلَيْهَا نَذْرٌ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَنِي أَنْ أَقْضِيَهُ عَنْهَا";
nasai.urdu = "حضرت سعد رضی اللہ عنہ سے روایت ہے میری والدہ محترمہ فوت ہوگئیں‘ جبکہ ان کے ذمے ایک نذر تھی۔میں نے نبی اکرمﷺ سے پوچھا تو آپ نے مجھے وہ نذر ان کی طرف سے ادا کرنے کا حکم دیا۔";
nasai.hukam = "حسن";
nasai.description = ``;