var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ اسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ الْأَنْصَارِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ نے فرمایا کہ حضرت سعد بن عبادہ انصاری رضی اللہ عنہ نے رسول اللہﷺ سے اس نذر کے بارے میں پوچھا جو ان کی والدہ محترمہ کے ذمے تھی لیکن وہ اس کی ادائیگی سے پہلے ہی فوت ہوگئی تھیں۔رسول اللہﷺ نے فرمایا: ’’تم اس کی طرف سے ادا کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;