var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ عَنْ عَبْدَةَ عَنْ هِشَامٍ هُوَ ابْنُ عُرْوَةَ عَنْ بَكْرِ بْنِ وَائِلٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ جَاءَ سَعْدُ بْنُ عُبَادَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ وَلَمْ تَقْضِهِ قَالَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا کہ حضرت سعد بن عبادہ رضی اللہ عنہ نبیﷺکے پاس حاضر ہوئے اور عرض کیا: میری والدہ محترمہ فوت ہوگئی ہیں۔ان کے ذمے ایک نذر تھی جسے وہ پورا نہ کرسکیں۔آپ نے فرمایا: ’’اس کی طرف سے تم پوری کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;