var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ عَنْ وَكِيعٍ عَنْ هِشَامٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ سَقْيُ الْمَاءِ";
nasai.urdu = "حضرت سعد بن عبادہ رضی اللہ عنہ سے راویت ہے‘ انہوں نے فرمایا کہ میں نے عرض کیا: اے اللہ کے رسول! کون سا صدقہ افضل ہے؟ آپ نے فرمایا: ’’پانی پلانا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1679) ابن ماجہ (3684)<br>منقطع،سعید بن المسیب لم یدرک سعد بن عبادۃ رضي اللہ عنہ۔<br>ولبعض الحدیث شاھد تقدم (الأصل: 3680)`;
nasai.anwaar = [348,1];