var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ وَقَبِيصَةُ قَالَا أَنْبَأَنَا سُفْيَانُ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ مَرَّ رَجُلٌ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ السَّلَامَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سےروایت ہے کہ ایک آدمی نبی ﷺ کے پاس سے گزرا جب کہ آپ پیشاب کر رہے تھے،چنانچہ اس نے آپ کو سلام کہا،مگر آپ نے اسے سلام کا جواب نہیں دیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;