var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ قَالَ حَدَّثَنِي الْحَكَمُ عَنْ عَبْدِ الْحَمِيدِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما نبی ﷺ سے اس شخص کے بارے میں روایت بیان کرتے ہیں جو حیض کی حالت میں اپنی بیوی سے جماع کرتا ہے کہ وہ ایک دینار یا نصف دینار صدقہ کرے۔";
nasai.hukam = "صحیح";
nasai.description = ``;