var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ أَبَاهُ نَحَلَهُ نُحْلًا فَقَالَتْ لَهُ أُمُّهُ أَشْهِدْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَا نَحَلْتَ ابْنِي فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَكَرِهَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَشْهَدَ لَهُ";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہ سے مروی ہے کہ میرے والد نے مجھے ایک (غلام کا) عطیہ دیا۔میری والدہ ان سے کہنے لگیں: میرے بیٹے کے عطیے پر رسول اللہﷺ کو گواہ بنالیں۔میرے والد رسول اللہﷺ کے پاس حاضر ہوئے اور پوری بات آپ سے ذکر کی۔نبی اکرمﷺ نے اس پر گواہ بننا پسند نہیں فرمایا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;