var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدٍ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنْ عُرْوَةَ عَنْ بَشِيرٍ أَنَّهُ نَحَلَ ابْنَهُ غُلَامًا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرَادَ أَنْ يُشْهِدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَكُلَّ وَلَدِكَ نَحَلْتَهُ مِثْلَ ذَا قَالَ لَا قَالَ فَارْدُدْهُ";
nasai.urdu = "حضرت بشیر بن سعد رضی اللہ عنہ سے روایت ہے کہ انہوں نے اپنے ایک بیٹے کو غلام تحفے میں دیا۔پھر وہ نبی اکرمﷺ کے پاس آئے کہ نبیﷺ کو اس تحفے پر گواہ بنالیں۔آپ نے فرمایا: ’’کیا تم نے پوری اولاد کو ایسے تحفے دیے ہیں؟ انہوں نے کہا: نہیں۔آپ نے فرمایا‘ پھر اسے بھی واپس کر۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;