var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا حِبَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ بَشِيرًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا نَبِيَّ اللَّهِ نَحَلْتُ النُّعْمَانَ نِحْلَةً قَالَ أَعْطَيْتَ لِإِخْوَتِهِ قَالَ لَا قَالَ فَارْدُدْهُ";
nasai.urdu = "حضرت عروہ رحمہ اللہ سے راویت ہے کہ حضرت بشیر رضی اللہ عنہ نبی اکرمﷺ کے پاس حاضر ہوئے اور عرض کیا: اے اللہ کے نبی! میں نے نعمان کو ایک تحفہ دیا ہے۔آپ نے فرمایا: ’’اس کے بھائیوں کو بھی دیا ہے؟‘‘ انہوں نے کہا: نہیں۔آپ نے فرمایا: ’’پھر اسے بھی واپس کر۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;