var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا دَاوُدُ عَنْ الشَّعْبِيِّ عَنْ النُّعْمَانِ قَالَ انْطَلَقَ بِهِ أَبُوهُ يَحْمِلُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اشْهَدْ أَنِّي قَدْ نَحَلْتُ النُّعْمَانَ مِنْ مَالِي كَذَا وَكَذَا قَالَ كُلَّ بَنِيكَ نَحَلْتَ مِثْلَ الَّذِي نَحَلْتَ النُّعْمَانَ";
nasai.urdu = "حضرت نعمان رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا کہ مجھے میرے والد محترم اٹھا کر نبی اکرمﷺ کی خدمت عالیہ میں لے گئے اور عرض کیا: آپ گواہ ہو جائیے کہ میں نے نعمان کو اپنے مال سے اتنا تحفہ دیا ہے۔آپ نے فرمایا:’’کیا تم نے اپنے ہر بیٹے کو اس طرح کا تحفہ دیا جیسے نعمان کو دیاہے؟‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;