var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ فِطْرٍ عَنْ مُسْلِمِ بْنِ صُبَيْحٍ قَالَ سَمِعْتُ النُّعْمَانَ يَقُولُ وَهُوَ يَخْطُبُ انْطَلَقَ بِي أَبِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشْهِدُهُ عَلَى عَطِيَّةٍ أَعْطَانِيهَا فَقَالَ هَلْ لَكَ بَنُونَ سِوَاهُ قَالَ نَعَمْ قَالَ سَوِّ بَيْنَهُمْ";
nasai.urdu = "حضرت نعمان رضی اللہ عنہ خطبے میں فرمارہے تھے: مجھے میرے والد محترم رسول اللہﷺ کی خدمت میں لے گئے۔وہ آپ کو اس عطیے پر گواہ بنانا چاہتے تھے جو انہوں نے مجھے دیا تھا۔آپ نے فرمایا: ’’کیا اس کے علاوہ بھی تیرتے بیٹے ہیں؟‘‘ وہ کہنے لگے: جی ہاں۔آپ نے فرمایا: ’’پھر ان میں برابری کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;