var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ سُفْيَانَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ حَاجِبِ بْنِ الْمُفَضَّلِ بْنِ الْمُهَلَّبِ عَنْ أَبِيهِ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ يَخْطُبُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْدِلُوا بَيْنَ أَبْنَائِكُمْ اعْدِلُوا بَيْنَ أَبْنَائِكُمْ";
nasai.urdu = "حضرت مفضل بن مہلب سے روایت ہے کہ میں نے حضرت نعمان بن بشیر رضی اللہ عنہ کو خطبے کے دوران میں فرماتے سنا کہ رسول اللہﷺ نے فرمایا: ’’اپنے بیٹوں کے درمیان انصاف کرو۔اپنے بیٹوں کے درمیان عدل کرو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;