var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرْجِعُ أَحَدٌ فِي هِبَتِهِ إِلَّا وَالِدٌ مِنْ وَلَدِهِ وَالْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ";
nasai.urdu = "حضرت عمروبن شعیب کے پردادا محترم سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’کوئی شخص ہبہ کرکے واپس نہیں لے سکتا مگر والد اپنی اولاد سے واپس لے سکتا ہے۔اور ہبہ کرکے واپس لینے والا اس کتے کی طرح ہے جو قے کرکے پھر چاٹتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;