var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ جَابِرِ بْنِ صُبْحٍ قَالَ سَمِعْتُ خِلَاسًا يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيتُ فِي الشِّعَارِ الْوَاحِدِ وَأَنَا طَامِثٌ حَائِضٌ فَإِنْ أَصَابَهُ مِنِّي شَيْءٌ غَسَلَ مَكَانَهُ لَمْ يَعْدُهُ ثُمَّ صَلَّى فِيهِ ثُمَّ يَعُودُ فَإِنْ أَصَابَهُ مِنِّي شَيْءٌ فَعَلَ مِثْلَ ذَلِكَ غَسَلَ مَكَانَهُ لَمْ يَعْدُهُ وَصَلَّى فِيهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں اور اللہ کے رسول ﷺ رات کو ایک چادر میں سوتے تھے،حالانکہ میں حیض کی حالت میں ہوتی تھی۔اگر آپ کو مجھ سے کچھ (خون وغیرہ) لگ جاتا تو آپ اس جگہ کو دھو لیتے،اس سے زائد نہ دھوتے،پھر اس میں نماز پڑھ لیتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;