var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخَلَنْجِيُّ الْمَقْدِسِيُّ قَالَ حَدَّثَنَا أَبُو سَعِيدٍ وَهُوَ مَوْلَى بَنِي هَاشِمٍ عَنْ وُهَيْبٍ قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’ہبہ کرکے واپس لینے والا کتے کی طرح ہے جو قے کرتا ہے‘ پھر اپنی قے چاٹنے لگتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;