var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا عُمَرُ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ حُسَيْنٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الَّذِي يَرْجِعُ فِي صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَرْجِعُ فِي قَيْئِهِ فَيَأْكُلُهُ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص صدقہ (یا تحفہ) دے کر واپس لتا ہے‘ وہ کتے کی طرح ہے جو اپنی قے میں لوٹ جاتا ہے‘ یعنی اسے کھالیتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;