var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو الْأَشْعَثِ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ";
nasai.urdu = "حضرت ابن عباسؓ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’ہمیں بری مثال کا مصداق نہیں بننا چاہیے۔تحفہ دے کر واپس لینے والا اپنی قے چاٹنے والے (کتے) کی طرح ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;