var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو خَالِدٍ وَهُوَ سُلَيْمَانُ بْنُ حَيَّانَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لَنَا مَثَلُ السَّوْءِ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’ہمیں بری مثال کا مصداق نہیں بننا چاہیے۔تحفہ دے کر واپس لینے والا اپنی قے چاٹنے والے (کتے) کی طرح ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;