var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لَنَا مَثَلُ السَّوْءِ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’ہم پر بری مثال صادق نہیں آنی چاہیے۔ہبہ کرکے رجوع کرنے والا کتے کی طرح ہے جو اپنی قے چاٹتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;