var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَنْ تَشُدَّ إِزَارَهَا ثُمَّ يُبَاشِرُهَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ جب ہم (ازواج مطہرات) میں سے کوئی حیض والی حالت میں ہوتی تو رسول اللہ ﷺ اسے حکم دیتے کہ وہ اپنا ازار باندھ لے،پھر آپ اس کے ساتھ لیٹ جاتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;