var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ قَالَ حَدَّثَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لَنَا مَثَلُ السَّوْءِ الرَّاجِعُ فِي هِبَتِهِ كَالْكَلْبِ فِي قَيْئِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے ‘ انہوں نے فرمایا کہ رسول اللہﷺ نے فرمایا: ’’بری مثال ہمارے لیے مناسب نہیں۔ہبہ واپس لینے والے کی مثال کتے اور ا س کی قے جیسی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;