var nasai = {};
nasai.arabic = "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا إِسْحَقُ قَالَ حَدَّثَنَا الْمَخْزُومِيُّ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’تحفہ دے کر واپس لینے والا کتے کی طرح ہے جو قے کرتا ہے‘ پھر اس قے کو چاٹنا شروع کردیتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;