var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ قَالَ حَدَّثَنَا حِبَّانُ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ حَنْظَلَةَ أَنَّهُ سَمِعَ طَاوُسًا يَقُولُ أَخْبَرَنَا بَعْضُ مَنْ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَثَلُ الَّذِي يَهَبُ فَيَرْجِعُ فِي هِبَتِهِ كَمَثَلِ الْكَلْبِ يَأْكُلُ فَيَقِيءُ ثُمَّ يَأْكُلُ قَيْئَهُ";
nasai.urdu = "حضرت طاوس رحمہ اللہ بیان کرتے ہیں کہ ہمیں ایسی شخصیت نے بتایا جنہوں نے رسول اللہﷺ کی زیارت فرمائی کہ رسول اللہﷺ نے فرمایا: ’’جو شخص ہبہ کرکے رجوع کرتا ہے‘ اس کی مثال اس کتے جیسی ہے جو کھاتا ہے‘ پھر قے کرتا ہے‘ پھر اپنی قے چاٹتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;