var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ طَاوُسٍ لَعَلَّهُ عَنْ ابْنِ عَبَّاسٍ قَالَ لَا رُقْبَى فَمَنْ أُرْقِبَ شَيْئًا فَهُوَ سَبِيلُ الْمِيرَاثِ";
nasai.urdu = "شاید حضرت ابن عباس رضی اللہ عنہ سے مروی ہے‘ انہوں نے فرمایا: رقبیٰ واپس نہیں آئے گا‘ چنانچہ جو شخص کسی کو کوئی چیز رقبیٰ دے گا تو وہ چیز اس شخص کی میراث بن جائے گی۔";
nasai.hukam = "حسن";
nasai.description = ``;