var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنِي زَيْدٌ عَنْ أَبِي الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُرْقِبُوا أَمْوَالَكُمْ فَمَنْ أَرْقَبَ شَيْئًا فَهُوَ لِمَنْ أُرْقِبَهُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’اپنے مال رقبیٰ کی صورت میں نہ دو (کیونکہ وہ واپس نہیں ملیں گے) لیکن اگر کسی شخص نے کوئی چیز رقبیٰ کے طور پر دی تو وہ اسی کی رہے گی جس کو اس نے دی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;