var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَتْ إِحْدَانَا إِذَا حَاضَتْ أَمَرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَتَّزِرَ ثُمَّ يُبَاشِرُهَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ ہم (ازواج مطہرات) میں سے کسی کو حیض آنے لگتا تو رسول اللہ ﷺ اسے حکم دیتے کہ وہ ازار باندھ لے،پھر پ اس کے ساتھ لیٹ جاتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;