var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ حَجَّاجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعُمْرَى جَائِزَةٌ لِمَنْ أُعْمِرَهَا وَالرُّقْبَى جَائِزَةٌ لِمَنْ أُرْقِبَهَا وَالْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’عمریٰ اسی شخص کے لیے مستقل ہوجائے گا جسے دیا گیا۔اور رقبیٰ بھی مستقلاً اسی شخص کو ملے گا جسے دیا گیا۔اور ہبہ کو واپس لینے والا یعنی قے چاٹنے والے کی طرح ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;