var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَعْلَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَا تَحِلُّ الرُّقْبَى وَلَا الْعُمْرَى فَمَنْ أُعْمِرَ شَيْئًا فَهُوَ لَهُ وَمَنْ أُرْقِبَ شَيْئًا فَهُوَ لَهُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے‘ انہوں نے فرمایا: رقبیٰ اور عمریٰ حلال نہیں۔جسے کوئی چیز بطور عمریٰ دی گئی‘ وہ اسی کی رہے گی اور جس شخص کو کوئی چیز بطور رقبیٰ دی گئی‘ وہ بھی اسی کی رہے گی۔";
nasai.hukam = "حسن";
nasai.description = ``;