var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ أَبِي الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَا تَصْلُحُ الْعُمْرَى وَلَا الرُّقْبَى فَمَنْ أَعْمَرَ شَيْئًا أَوْ أَرْقَبَهُ فَإِنَّهُ لِمَنْ أُعْمِرَهُ وَأُرْقِبَهُ حَيَاتَهُ وَمَوْتَهُ أَرْسَلَهُ حَنْظَلَةُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ عمریٰ اور رقبیٰ درست نہیں۔جس شخص کو عمریٰ دیا گیا ہو رقبیٰ دیا گیا ہو‘ وہ اسی کے پاس رہے گا جسے عمریٰ یا رقبیٰ دیا گیا۔اس کی زندگی میں بھی اور مرنے کے بعد بھی۔(یعنی اس کے ورثاء کو منتقل ہوجائے گا)۔\nاس حدیث کو حنظلہ بن ابی سفیان جمحی نے مرسل بیان کیا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;