var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ حَنْظَلَةَ أَنَّهُ سَمِعَ طَاوُسًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحِلُّ الرُّقْبَى فَمَنْ أُرْقِبَ رُقْبَى فَهُوَ سَبِيلُ الْمِيرَاثِ";
nasai.urdu = "حضرت طاوس رحمہ اللہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’رقبیٰ حلال نہیں۔جس شخص کو رقبیٰ دیا جائے گا تو اس میں وراثت جاری ہوگی (اور وہ واپس نہیں آئے گا)۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;