var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ عَيَّاشٍ وَهُوَ أَبُو بَكْرٍ عَنْ صَدَقَةَ بْنِ سَعِيدٍ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا حَدَّثَنَا جُمَيْعُ بْنُ عُمَيْرٍ قَالَ دَخَلْتُ عَلَى عَائِشَةَ مَعَ أُمِّي وَخَالَتِي فَسَأَلَتَاهَا كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ إِذَا حَاضَتْ إِحْدَاكُنَّ قَالَتْ كَانَ يَأْمُرُنَا إِذَا حَاضَتْ إِحْدَانَا أَنْ تَتَّزِرَ بِإِزَارٍ وَاسِعٍ ثُمَّ يَلْتَزِمُ صَدْرَهَا وَثَدْيَيْهَا";
nasai.urdu = "حضرت جمیعع بن عمیر نے کہا کہ میں اپنی والدہ اور خالہ کے ساتھ حضرت عائشہ رضی اللہ عنہا کے پاس گیا۔ہم نے ان سے پوچھا کہ جب ازواج مطہرات میں سے کسی کو حیض آنے لگتا تو نبی ﷺ کیا کرتے تھے؟ انھوں نے فرمایا: جب ہم میں سے کسی کو حیض آنے لگتا،تو آپ اسے حکم دیتے کہ ایک وسیع ازار باندھے،پھر اس کا سینہ اور پستان اپنے جسم سے لگا لیتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>جمیع بن عمیر: ضعیف۔`;
nasai.anwaar = [323,1];