var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ بْنِ إِبْرَاهِيمَ قَالَ أَخْبَرَنِي أَبِي أَنَّهُ عَرَضَ عَلَيَّ مَعْقَلٌ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ حُجْرٍ الْمَدَرِيِّ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْمَرَ شَيْئًا فَهُوَ لِمُعْمَرِهِ مَحْيَاهُ وَمَمَاتَهُ وَلَا تُرْقِبُوا فَمَنْ أَرْقَبَ شَيْئًا فَهُوَ لِسَبِيلِهِ";
nasai.urdu = "حضرت زید بن ثابت رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’جس شخص نے کوئی چیز بطور عمریٰ دی تو ہو اس کی ہوگی جس کو دی گئی۔زندگی میں بھی اور مرنے کے بعد بھی۔اور رقبیٰ نہ دیا کرو۔جس شخص کو کوئی چیز بطور رقبیٰ دی گئی تو اپنے راستے ہی پر جائے گی‘ (یعنی جسے دی گئی اسی کی ہوجائے گی‘ واپس نہیں آئے گی)۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;