var nasai = {};
nasai.arabic = "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ طَاوُسٍ عَنْ الْحَجُورِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعُمْرَى جَائِزَةٌ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’عمریٰ نافذ ہوجائے گا (واپس نہیں آئے گا)۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;