var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الْكَرِيمِ عَنْ عَطَاءٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعُمْرَى وَالرُّقْبَى قُلْتُ وَمَا الرُّقْبَى قَالَ يَقُولُ الرَّجُلُ لِلرَّجُلِ هِيَ لَكَ حَيَاتَكَ فَإِنْ فَعَلْتُمْ فَهُوَ جَائِزَةٌ";
nasai.urdu = "حضرت عطاء سے روایت ہے کہ رسول اللہﷺ نے عمریٰـ اور رقبیـ سے منع فرمایا ہے۔میں نے کہا: رقبیٰ کیا ہوتا ہے؟ انہوں نے فرمایا: کوئی شخص دوسرے شخص سے کہے: یہ چیز تیری زندگی تک تیرے لیے ہے۔ویسے اگر تم عمریٰ یا رقبیٰ کرو گے تو وہ نافذ ہوجائیں گے۔";
nasai.hukam = "صحیح";
nasai.description = ``;