var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ وَاللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ حَبِيبٍ مَوْلَى عُرْوَةَ عَنْ بُدَيَّةَ وَكَانَ اللَّيْثُ يَقُولُ نَدَبَةَ مَوْلَاةِ مَيْمُونَةَ عَنْ مَيْمُونَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَاشِرُ الْمَرْأَةَ مِنْ نِسَائِهِ وَهِيَ حَائِضٌ إِذَا كَانَ عَلَيْهَا إِزَارٌ يَبْلُغُ أَنْصَافَ الْفَخِذَيْنِ وَالرُّكْبَتَيْنِ فِي حَدِيثِ اللَّيْثِ تَحْتَجِزُ بِهِ";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ اپنی بیویوں میں سے کسی بیوی کے ساتھ لیٹ جایا کرتے تھے جب کہ اسے حیض آ رہا ہوتا تھا اور اس پر آدھی رانوں تک یا گھٹنوں تک کپڑا ہوتا۔لیث کی حدیث میں ہے کہ وہ اس کپڑے سے اپنے جسم کو ڈھانپے ہوتی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (288)`;
nasai.anwaar = [323,1];