var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُعْطِيَ شَيْئًا حَيَاتَهُ فَهُوَ لَهُ حَيَاتَهُ وَمَوْتَهُ";
nasai.urdu = "حضرت عطاءرحمہ اللہ سے مروی ہے کہ رسول اللہﷺنے فرمایا: ’’جس آدمی کو کوئی چیز زندگی بھر کے لیے دی گئی‘ وہ اسی کی ہے۔زندگی میں بھی اور موت کے بعد بھی (یعنی اصل شخص کی موت کے بعد اس کے ورثاء کی ہوگی)۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;