var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ سُفْيَانَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُرْقِبُوا وَلَا تُعْمِرُوا فَمَنْ أُرْقِبَ أَوْ أُعْمِرَ شَيْئًا فَهُوَ لَوَرَثَتِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ رسول ا للہﷺ نے فرمایا: ’’رقبیٰ اور عمریٰ نہ دو۔جس شخص کو کوئی چیز بطور عمریٰ یا رقبیٰ دی گئی‘ وہ (اس کی وفات کے بعد) اس کے ورثاء کی ہوگی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;