var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ أَنْبَأَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عُمْرَى وَلَا رُقْبَى فَمَنْ أُعْمِرَ شَيْئًا أَوْ أُرْقِبَهُ فَهُوَ لَهُ حَيَاتَهُ وَمَمَاتَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’عمریٰ اور رقبیٰ نہیں لوٹیں گے‘ لہٰذا جس شخص کو کوئی چیز بطور عمریٰ یا رقبیٰ دی گئی‘ وہ اسی کی ہے۔زندگی میں بھی‘ مرنے کے بعد بھی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;