var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ ابْنِ عُمَرَ وَلَمْ يَسْمَعْهُ مِنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عُمْرَى وَلَا رُقْبَى فَمَنْ أُعْمِرَ شَيْئًا أَوْ أُرْقِبَهُ فَهُوَ لَهُ حَيَاتَهُ وَمَمَاتَهُ قَالَ عَطَاءٌ هُوَ لِلْآخَرِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’عمریٰ اور رقبیٰ مناسب نہیں۔جس شخص کو کوئی چیز بطور عمریٰ یا رقبیٰ دی گئی‘ وہ اسی کی ہے۔زندگی میں بھی اور مرنے کے بنعد بھی۔‘‘ عطاء کہتے ہیں کہ یہ دوسرے شخص (جسے عمریٰ یا رقبیٰ کے طور پر کوئی چیز دی گئی ہے اس) کے لیے ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;