var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا وَكِيعٌ عَنْ يَزِيدَ بْنِ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّقْبَى وَقَالَ مَنْ أُرْقِبَ رُقْبَى فَهُوَ لَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے رقبیٰ سے منع فرمایا ہے‘ نیز فرمایا: ’’جس شخص کو کوئی چیز بطور رقبیٰ دی گئی‘ وہ اسی کی رہے گی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;