var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُعْمِرَ شَيْئًا فَهُوَ لَهُ حَيَاتَهُ وَمَمَاتَهُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’جس آدمی کو کوئی چیز بطور عمریٰ دی گئی وہ زندگی اور موت ہر حال میں اسی کی رہے گی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;