var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ صُدْرَانَ عَنْ بِشْرِ بْنِ الْمُفَضَّلِ قَالَ حَدَّثَنَا الْحَجَّاجُ الصَّوَّافُ عَنْ أَبِي الزُّبَيْرِ قَالَ حَدَّثَنَا جَابِرٌ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مَعْشَرَ الْأَنْصَارِ أَمْسِكُوا عَلَيْكُمْ يَعْنِي أَمْوَالَكُمْ لَا تُعْمِرُوهَا فَإِنَّهُ مَنْ أَعْمَرَ شَيْئًا فَإِنَّهُ لِمَنْ أُعْمِرَهُ حَيَاتَهُ وَمَمَاتَهُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’اے جماعت انصار! اپنے مال اپنے پاس رکھو۔انہیں بطور عمریٰ نہ دو کیونکہ جو شخص کوئی چیز بطور عمریٰ دے گا (وہ اسے واپس نہیں ملے گی بلکہ) وہ اسی شخص کی رہے گی جسے دی گئی۔زندگی میں بھی اور مرنے کے بعد بھی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;