var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ هِشَامٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَمْسِكُوا عَلَيْكُمْ أَمْوَالَكُمْ وَلَا تُعْمِرُوهَا فَمَنْ أُعْمِرَ شَيْئًا حَيَاتَهُ فَهُوَ لَهُ حَيَاتَهُ وَبَعْدَ مَوْتِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’اپنے مال اپنے پاس رکھو اور انہیں بطور عمریٰ نہ کیونکہ جس شخص کو کوئی چیز عمر بھر کے لیے دی گئی‘ وہ اسی کی رہے گی۔زندگی میں بھی اور مرنے کے بعد بھی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;