var nasai = {};
nasai.arabic = "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا عُمَرُ عَنْ الْأَوْزَاعِيِّ حَدَّثَنَا ابْنُ شِهَابٍ قَالَ و أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ أَنْبَأَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُعْمِرَ عُمْرَى فَهِيَ لَهُ وَلِعَقِبِهِ يَرِثُهَا مَنْ يَرِثُهُ مِنْ عَقِبِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے‘ انہوں نے کہا کہ رسول اللہﷺ نے فرمایا: ’’جس شخص کو کوئی چیز بطور عمریٰ دی گئی‘ وہ اسی کی ہے اور (اس کی وفات کے بعد) اس کی اولاد کی۔جو بھی اس کے لواحقین میں سے اس کاوارث بنے گا‘ وہ اس کا مالک ہوگا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;