var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ مُسَاوِرٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا أَبُو عَمْرٍو عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعُمْرَى لِمَنْ أُعْمِرَهَا هِيَ لَهُ وَلِعَقِبِهِ يَرِثُهَا مَنْ يَرِثُهُ مِنْ عَقِبِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’عمریٰ اسی کا ہے جسے دیا گیا‘ (ا س کی زندگی میں۔) اور (اس کی وفات کے بعد) اس کی اولاد کا ہے۔اولاد میں سے جو اس کا وارث بنے گا‘ وہ عمریٰ کا وارث بھی بنے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;