var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ الْبَعْلَبَكِّيُّ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ وَأَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعُمْرَى لِمَنْ أُعْمِرَهَا هِيَ لَهُ وَلِعَقِبِهِ يَرِثُهَا مَنْ يَرِثُهُ مِنْ عَقِبِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’عمریٰ اسی کا رہے گا جسے دیا گیا۔وہ (زندگی میں تو) اس کا ہے اور (اس کی وفات کے بعد) ا س کی اولاد کا ہے۔اس کی اولاد میں سے جو بھی اس کا وارث بنے گا‘ وہ اس کا بھی وارث ہوگا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;