var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ الدِّمَشْقِيُّ عَنْ أَبِي عُمَرَ الصَّنْعَانِيِّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا رَجُلٍ أَعْمَرَ رَجُلًا عُمْرَى لَهُ وَلِعَقِبِهِ فَهِيَ لَهُ وَلِمَنْ يَرِثُهُ مِنْ عَقِبِهِ مَوْرُوثَةٌ";
nasai.urdu = "حضرت عبداللہ بن زبیر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی دوسرے شخص کو کوئی چیز اس کے لیے اور اس کی اولاد کے لیے بطور عمریٰ دے دے تو وہ اس کے لیے اور اس کی اولاد کے لیے ہوگی۔اس میں وراثت چلے گی۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;