var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَعْمَرَ رَجُلًا عُمْرَى لَهُ وَلِعَقِبِهِ فَقَدْ قَطَعَ قَوْلُهُ حَقَّهُ وَهِيَ لِمَنْ أُعْمِرَ وَلِعَقِبِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے راویت ہے کہ میں نے رسول اللہﷺ کو فرماتے سنا ہے: ’’جو شخص کسی کو کوئی چیز اس کے لیے اور اس کی اولاد کے لیے بطور عمریٰ دے تو اس کی اس بات نے اس کا حق اس چیز سے حتم کردیا۔اب وہ اسی کی ہوگی جسے دی گئی اور بعد میں اس کی اولاد کو ملے گی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;