var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا رَجُلٍ أُعْمِرَ عُمْرَى لَهُ وَلِعَقِبِهِ فَإِنَّهَا لِلَّذِي يُعْطَاهَا لَا تَرْجِعُ إِلَى الَّذِي أَعْطَاهَا لِأَنَّهُ أَعْطَى عَطَاءً وَقَعَتْ فِيهِ الْمَوَارِيثُ";
nasai.urdu = "حضرت جابرؓ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’جس شخص کو کوئی چیز اس کے لیے اور اس کی اولاد کے لیے بطور عمریٰ دی گئی‘ وہ اسی کے پاس رہے گی جسے دی گئی۔دینے والے کے پاس واپس نہیں جائے گی کیونکہ اس نے ایسا عطیہ دیا ہے جس میں وراثت واقع ہوچکی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;