var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ الْأَعْمَشِ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ فَاهُ عَلَى الْمَوْضِعِ الَّذِي أَشْرَبُ مِنْهُ وَيَشْرَبُ مِنْ فَضْلِ شَرَابِي وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کے رسول ﷺ اپنا منہ مبارک اس جگہ رکھتے جہاں سے میں نے پیا تھا اور میرے بچے ہوئے پانی سے پیتے تھے،حالانکہ میں حیض کی حالت میں ہوتی تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;