var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ سَمِعْتُ جَابِرًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعُمْرَى لِمَنْ وُهِبَتْ لَهُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’عمریٰ اسی کے پاس رہے گا جسے دیا گیا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;