var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عِيسَى وَعَبْدَةُ بْنُ سُلَيْمَانَ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أُعْمِرَ شَيْئًا فَهُوَ لَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’عمریٰ (مروجہ شکل میں) درست نہیں۔اب جسے کوئی چیز بطور عمریٰ دی گئی‘ وہ اسی کے پاس رہے گی (واپس نہیں جائے گی)۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;