var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ح و أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ وَهُوَ ابْنُ أَبِي هِنْدٍ وَحَبِيبٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجُوزُ لِامْرَأَةٍ هِبَةٌ فِي مَالِهَا إِذَا مَلَكَ زَوْجُهَا عِصْمَتَهَا اللَّفْظُ لِمُحَمَّدٍ";
nasai.urdu = "حضرت عمروبن شعیب کے پردادا محترم سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’کسی عورت کے لیے جائز نہیں کہ وہ اپنے مال میں سے ہبہ کرے کیونکہ اسکا خاوند اس کی عصمت کا مالک ہے۔‘‘ الفاظ محمد بن معمر کے ہیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;