var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مِسْعَرٍ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ عَائِشَةَ تَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَاوِلُنِي الْإِنَاءَ فَأَشْرَبُ مِنْهُ وَأَنَا حَائِضٌ ثُمَّ أُعْطِيهِ فَيَتَحَرَّى مَوْضِعَ فَمِي فَيَضَعُهُ عَلَى فِيهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ مجھے برتن پکڑاتے،میں اس سے پانی پیتی تھی جب کہ میں حیض کی حالت میں ہوتی تھی،پھر میں برتن آپ کو دے دیتی تو آپ میرے منہ کی جگہ کا قصد کرتے اور اس پر اپنا منہ رکھتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;