var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقَدْ هَمَمْتُ أَنْ لَا أَقْبَلَ هَدِيَّةً إِلَّا مِنْ قُرَشِيٍّ أَوْ أَنْصَارِيٍّ أَوْ ثَقَفِيٍّ أَوْ دَوْسِيٍّ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’میں نے فیصلہ کیا ہے کہ میں کسی قریشی‘ انصاری‘ ثقفی یا دوسی شخص کے علاوہ سے تحفہ قبول نہیں کروں گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;