var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَحْمٍ فَقَالَ مَا هَذَا فَقِيلَ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ کے پاس گوشت لایا گیا۔آپ نے پوچھا: ’’یہ کیسا ہے؟‘‘ عرض کی گئی کہ یہ گوشت بریرہ پر صدقہ کیا گیا تھا (اور اس نے اس میں سے کچھ نہیں بھیجا ہے)۔آپ نے فرمایا: ’’یہ اس کے لیے صدقہ تھا‘ ہمارے لیے تحفہ اور ہدیہ ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;