var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ الرُّهَاوِيُّ وَمُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ قَالَ كَانَتْ يَمِينٌ يَحْلِفُ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَمُقَلِّبِ الْقُلُوبِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا: رسول اللہﷺ (عموماً) یوں قسم کھایا کرتے تھے: ’’قسم اس ذات کی جو دلوں کو پھیرنے والی ہے! بات ایسے نہیں۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;