var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ أَبُو يَعْلَى قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ عَنْ عَبَّادِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ كَانَتْ يَمِينُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّتِي يَحْلِفُ بِهَا لَا وَمُصَرِّفِ الْقُلُوبِ";
nasai.urdu = "حضرت سالم کے والد محترم (حضرت عبداللہ بن عمر رضی اللہ عنہ) نے فرمایا: رسول اللہﷺ کی قسم،جو آپ عموماً اٹھایا کرتے تھے‘ یہ تھی: مجھے قسم ہے اس ذات کی جو دلوں کو پھیرنے والی ہے! معاملہ ایسے نہیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (2092)<br>الزھري عنعن۔<br>والحدیث السابق (الأصل: 3792) یغني عنہ۔`;
nasai.anwaar = [349,1];