var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ جَعْفَرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ حَالِفًا فَلَا يَحْلِفْ إِلَّا بِاللَّهِ وَكَانَتْ قُرَيْشٌ تَحْلِفُ بِآبَائِهَا فَقَالَ لَا تَحْلِفُوا بِآبَائِكُمْ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص قسم کھانا چاہے وہ اللہ تعالیٰ کے سوا کسی کی قسم نہ کھائے۔‘‘ قریش اپنے آباؤ اجداد کی قسمیں کھایا کرتے تھے‘ لہٰذا آپ نے فرمایا: ’اپنے آباؤاجداد کی قسمیں نہ کھایا کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;