var nasai = {};
nasai.arabic = "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ قَالَ حَدَّثَنِي رَجُلٌ مِنْ بَنِي غِفَارٍ فِي مَجْلِسِ سَالِمِ بْنِ عَبْدِ اللَّهِ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ سَمِعْتُ عَبْدَ اللَّهِ يَعْنِي ابْنَ عُمَرَ وَهُوَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’بلاشبہ اللہ تعالیٰ تمہیں منع فرماتا ہے کہ تم اپنے آباؤاجداد کی قسمیں کھاؤ۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;