var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلَا آثِرًا";
nasai.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’اللہ تعالیٰ تمہیںآباؤ اجداد کی قسم کھانے سے منع فرماتا ہے۔‘‘ حضرت عمر رضی اللہ عنہ نے فرمایا: اللہ کی قسم! اس کے بعد میں نے کبھی ایسی قسم نہیں کھائی۔نہ اپنے طور پر‘ نہ کسی سے نقل کرتے ہوئے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;