var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ قَالَ أَنْبَأَنَا مُحَمَّدٌ وَهُوَ ابْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّهُ أَخْبَرَهُ عَنْ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلَا آثِرًا";
nasai.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’بلاشبہ اللہ تعالیٰ تمہیں آباؤاجداد کی قسمیں کھانے سے روکتا ہے۔‘‘ حضرت عمر رضی اللہ عنہ نے فرمایا: اللہ کی قسم! میں نے اس کے بعد کبھی آباؤاجداد کی قسم نہیں کھائی۔نہ اپنے طور پر‘ نہ کسی سے نقل کرتے ہوئے۔";
nasai.hukam = "حسن";
nasai.description = ``;