var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ قَالَ أَنْبَأَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ حُضَيْنٍ أَبِي سَاسَانَ عَنْ الْمُهَاجِرِ بْنِ قُنْفُذٍ أَنَّهُ سَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَلَمْ يَرُدَّ عَلَيْهِ حَتَّى تَوَضَّأَ فَلَمَّا تَوَضَّأَ رَدَّ عَلَيْهِ";
nasai.urdu = "حضرت مہاجر بن قنفذ رضی اللہ عنہ سے روایت ہے کہ انھوں نے نبی ﷺ کو سلام کہا جب کہ آپ پیشاب کر رہ تھے،تو آپ نے سلام کا جواب نہ دیا حتی کہ وضو کرنے لگے اور جب وضو مکمل کیا تو سلام کا جواب دیا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (17) ابن ماجہ (350)`;
nasai.anwaar = [321,1];