var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا عَوْفٌ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحْلِفُوا بِآبَائِكُمْ وَلَا بِأُمَّهَاتِكُمْ وَلَا بِالْأَنْدَادِ وَلَا تَحْلِفُوا إِلَّا بِاللَّهِ وَلَا تَحْلِفُوا إِلَّا وَأَنْتُمْ صَادِقُونَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے‘ وہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا: ’’نہ تم آباؤاجداد کی قسم کھاؤ‘ نہ ماؤں کی اور نہ بتوں کی‘ بلکہ صرف اللہ کی قسم کھاؤ اور صرف اسی وقت کھاؤ جب تم سچے ہو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;