var nasai = {};
nasai.arabic = "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا أَبُو عَمْرٍو عَنْ يَحْيَى أَنَّهُ حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو قِلَابَةَ قَالَ حَدَّثَنِي ثَابِتُ بْنُ الضَّحَّاكِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ بِمِلَّةٍ سِوَى الْإِسْلَامِ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ عُذِّبَ بِهِ فِي الْآخِرَةِ";
nasai.urdu = "حضرت ثابت بن صحاک رضی اللہ عنہ کا بیان ہے کہ رسول اللہﷺ نے فرمایا: ’’جس شخص نے جھوٹا ہونے کے باوجود کسی اور دین کی قسم کھائی تو وہ اسی طرح ہے جس طرح اس نے کہا۔اور جو شخص اپنے آپ کو کسی چیز سے قتل کرڈالے‘ اسے آخرت میں اسی چیز کے ساتھ عذاب دیا جائے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;