var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ إِنِّي بَرِيءٌ مِنْ الْإِسْلَامِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا لَمْ يَعُدْ إِلَى الْإِسْلَامِ سَالِمًا";
nasai.urdu = "حضرت بریدہ رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کہے: (اگر میں نے فلاں کام کیا ہو تو) میں اسلام سے لاتعلق ہوں۔اگر وہ جھوٹا ہے تو پھر وہ واقعتا اسلام سے لاتعلق ہے۔اور اگر وہ سچا ہے تو پھر بھی وہ صحیح سالم اسلام کی طرف نہیں لوٹے گا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;