var nasai = {};
nasai.arabic = "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ مِنْكُمْ فَقَالَ بِاللَّاتِ فَلْيَقُلْ لَا إِلَهَ إِلَّا اللَّهُ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ فَلْيَتَصَدَّقْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’تم میں سے جو شخص لات کی قسم کھائے‘ وہ کہے: لا الہ الا اللہ (اللہ تعالیٰ کے سوا کوئی معبود نہیں) اور جو شخص اپنے ساتھی سے کہے: آؤمیں تم سے جوا کھیلوں تو اسے صدقہ کرنا چاہیے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;