var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَأْسُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حِجْرِ إِحْدَانَا وَهِيَ حَائِضٌ وَهُوَ يَقْرَأُ الْقُرْآنَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺکا سر مبارک ہم (ازواج مطہرات) میں سے کسی کی گود میں ہوتا تھا جب کہ وہ حیض کی حالت میں ہوتی تھی اور آپ قرآن پڑھتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;