var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ عَنْ أَبِي السَّلِيلِ عَنْ زَهْدَمٍ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا عَلَى الْأَرْضِ يَمِينٌ أَحْلِفُ عَلَيْهَا فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلَّا أَتَيْتُهُ";
nasai.urdu = "حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’میںاس زمین کی جس چیز پر بھی قسم کھالوں‘ پھر اس کے علاوہ کسی اور چیز کو بہتر دیکھوں تو میں وہ بہتر کام کروں گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;