var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ قَالَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَأْتِ الَّذِي هُوَ خَيْرٌ";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا محترم رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی چیز پر قسم کھائے‘ پھر اس کی بجائے کوئی اور چیز بہتر سمجھے تو اپنی قسم کا کفارہ دے دے اور بہتر کام کرلے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;