var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا حَلَفَ أَحَدُكُمْ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَنْظُرْ الَّذِي هُوَ خَيْرٌ فَلْيَأْتِهِ";
nasai.urdu = "حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ رسول اللہﷺ سے روایت کرتے ہیں‘ آپ نے فرمایا: ’’جب تم میں سے کوئی کام کی قسم کھائے‘ پھر کوئی اور کام اس سے بہتر سمجھے تو اسے چاہیے کہ وہ اپنی قسم کا کفارہ دے اور جسے وہ بہتر سمجھ رہا ہے اس کام کو عمل میں لائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;