var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَكَفِّرْ عَنْ يَمِينِكَ ثُمَّ ائْتِ الَّذِي هُوَ خَيْرٌ";
nasai.urdu = "حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ نے بیان فرمایا کہ رسول اللہﷺ نے (مجھ سے) فرمایا: ’’جب تو کسی کام کی قسم کھائے (اور پھر کوئی اور کام بہتر سمجھے) تو (پہلے) اپنی قسم کا کفارہ دے دے اور بہتر کام کرلے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;