var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ عَنْ عَبْدِ الْأَعْلَى وَذَكَرَ كَلِمَةً مَعْنَاهَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌ";
nasai.urdu = "حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ سے منقول ہے کہ نبی اکرمﷺ نے فرمایا: ’’جب تو کسی کام کی قسم کھالے‘ پھر تو کوئی اور کام زیادہ اچھا سمجھے تو اپنی قسم کا کفارہ دے دے اور جو کام زیادہ اچھا ہے‘ وہ کرلے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;