var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی چیز پر قسم کھالے‘ پھر کسی دوسری چیز کو اس سے بہتر خیال کرے تو بہتر چیز پر عمل کرے اور اپنی قسم کا کفارہ دے دے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;