var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَدَعْ يَمِينَهُ وَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْهَا";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کوئی کام کرنے کی قسم کھائے‘ پھر کسی اور کام کو اس سے بہتر خیال کرے تو اپنی قسم کو چھوڑدے اور وہ کام کرے جو بہتر ہو‘ البتہ کفارہ دے دے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;