var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ مُعَاذَةَ الْعَدَوِيَّةِ قَالَتْ سَأَلَتْ امْرَأَةٌ عَائِشَةَ أَتَقْضِي الْحَائِضُ الصَّلَاةَ فَقَالَتْ أَحَرُورِيَّةٌ أَنْتِ قَدْ كُنَّا نَحِيضُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا نَقْضِي وَلَا نُؤْمَرُ بِقَضَاءٍ";
nasai.urdu = "حضرت معاذہ عدویہ سے روایت ہے کہ ایک عورت نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ حیض والی عورت حیض کے دنوں کی نماز کی قضا ادا کرے؟ حضرت عائشہ رضی اللہ عنہا نے فرمایا: کیا تو خارجی عورت ہے؟ ہمیں اللہ کے رسول ﷺ کی موجودگی میں حیض آتا تھا۔ہم تو نماز کی قضا ادا نہیں کرتی تھیں اور نہ ہمیں قضا کی ادائیگی کا حکم دیا جاتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;