var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ وَيُونُسُ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا آلَيْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ";
nasai.urdu = "حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے مجھ سے فرمایا: ’’جب تو کسی کام کی قسم کھالے‘ پھر کوئی اور کام اس سے بہتر سمجھے تو بہتر کام کرلے اور اپنی قسم کا کفارہ دے دے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;