var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ قَالَ يَعْنِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ مِنْهَا وَكَفِّرْ عَنْ يَمِينِكَ";
nasai.urdu = "حضرت ابوعبدالرحمٰن بن سمرہ رضی اللہ عنہ سے روایت ہے‘ انہوں نے کہا کہ رسول اللہﷺ نے (مجھ سے) فرمایا: ’’جب تو کسی کام کو کرنے کی قسم کھالے‘ پھر تو اس کی بجائے کوئی اور کام اس سے بہتر سمجھے تو جو کام بہتر ہے وہ کر لے اور اپنی قسم کا کفارہ ادا کردے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;