var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ فِي حَدِيثِهِ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ الْحَسَنِ الْبَصْرِيِّ قَالَ عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ";
nasai.urdu = "حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے مجھ سے فرمایا: ’’جب تو کوئی کام کرنے کی قسم کھالے‘ پھر تو کوئی اور کام اس سے بہتر سمجھے تو جو بہتر ہے اسے عمل میں لے آ اور اپنی قسم کا کفارہ دے دے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;