var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ قَالَ أَخْبَرَنِي عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ وَلَا يَمِينَ فِيمَا لَا تَمْلِكُ وَلَا فِي مَعْصِيَةٍ وَلَا قَطِيعَةِ رَحِمٍ";
nasai.urdu = "حضرت عمروبن شعیب کے پردارا محترم (حضرت عبداللہ بن عمرو رضی اللہ عنہ) سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو چیز ملکیت میں نہیں‘ اس میں نہ نذر مانی جاسکتی ہے‘ نہ قسم کھائی جاسکتی ہے۔اور (اسی طرح اللہ تعالیٰ کی) نافرمانی اور قطع رحمی کی نذر اور قسم بھی معتبر نہیں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;