var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ فَاسْتَثْنَى فَإِنْ شَاءَ مَضَى وَإِنْ شَاءَ تَرَكَ غَيْرَ حَنِثٍ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو شخص قسم کھاتے وقت ان شاء اللہ کہہ دے‘ وہ چاہے وہ قسم کو پورا کرے اور چاہے تو چھوڑ دے۔اسے کوئی گناہ نہیں ہوگا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;