var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا طَلْحَةُ بْنُ نَافِعٍ عَنْ جَابِرٍ قَالَ دَخَلْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتَهُ فَإِذَا فِلَقٌ وَخَلٌّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلْ فَنِعْمَ الْإِدَامُ الْخَلُّ";
nasai.urdu = "حضرت جابرؓ سے روایت ہے انہوں نے فرمایا:میں نبی اکرم ﷺ کے ساتھ آپ کے گھر میں داخل ہوا تو آپ کو روٹی کے ٹکڑے اور سرکہ پیش کیے گئے۔آپ نے مجھے فرمایا:کھاؤ سرکہ بہترین سالن ہے‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;