var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَزِيدَ ابْنِ كَيْسَانَ قَالَ حَدَّثَنِي أَبُو حَازِمٍ قَالَ قَالَ أَبُو هُرَيْرَةَ بَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ إِذْ قَالَ يَا عَائِشَةُ نَاوِلِينِي الثَّوْبَ فَقَالَتْ إِنِّي لَا أُصَلِّي فَقَالَ إِنَّهُ لَيْسَ فِي يَدِكِ فَنَاوَلَتْهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک دفعہ رسول اللہ ﷺ مسجد میں تھے کہ آپ نے فرمایا: ’’عائشہ! مجھے کپڑاا پکڑاؤ۔‘‘ انھوں نے کہا: میں ان دنوں نماز نہیں پڑھتی۔آپ نے فرمای: ’’وہ (تیرا حیض) تیرے ہاتھ میں تو نہیں۔‘‘ چنانچہ انھوں نے کپڑا پکڑا دیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;