var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُغِيرَةَ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَ أَتَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي السُّوقِ فَقَالَ إِنَّ هَذِهِ السُّوقَ يُخَالِطُهَا اللَّغْوُ وَالْكَذِبُ فَشُوبُوهَا بِالصَّدَقَةِ";
nasai.urdu = "حضرت قیس بن ابی غرزہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی اکرمﷺ ہمارے پاس تشریف لائے جبکہ ہم بازار میں (تجارت کررہے) تھے۔آپ نے فرمایا: ’’اس بازار میں فضول باتوں اور جھوٹ کی آمیزش ہوتی رہتی ہے‘ لہٰذا صدقہ کرتے رہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;