var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مَنْصُورٌ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّذْرِ وَقَالَ إِنَّهُ لَا يَأْتِي بِخَيْرٍ إِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ الْبَخِيلِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے نذر ماننے سے منع کیا اور فرمایا: ’’اس کا کوئی فائدہ نہیں‘ البتہ اس کے ساتھ بخیل آدمی سے کچھ مال نکل آتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;