var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّذْرِ وَقَالَ إِنَّهُ لَا يَرُدُّ شَيْئًا إِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ الشَّحِيحِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا کہ رسول اللہﷺ نے نذر ماننے سے منع کیا اور فرمایا: ’’نذر کسی تقدیر کو رد نہیں کرتی‘ البتہ اس طریقے سے کنجوس آدمی سے کچھ نہ کچھ مال نکالا جاتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;