var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّذْرُ لَا يُقَدِّمُ شَيْئًا وَلَا يُؤَخِّرُهُ إِنَّمَا هُوَ شَيْءٌ يُسْتَخْرَجُ بِهِ مِنْ الشَّحِيحِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’نذر کسی چیز کوآگے پیچھے نہیں کرتی‘ البتہ یہ ایسی چیز ہے جس کے ساتھ کنجوس آدمی سے کچھ نہ کچھ مال نکالا جاتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;