var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَأْتِي النَّذْرُ عَلَى ابْنِ آدَمَ شَيْئًا لَمْ أُقَدِّرْهُ عَلَيْهِ وَلَكِنَّهُ شَيْءٌ اسْتُخْرِجَ بِهِ مِنْ الْبَخِيلِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’(اللہ تعالیٰ نے فرمایا:) نذر انسان کے لیے کوئی ایسی چیز نہیں لاتی جو میں نے اس کے لیے مقدر نہ کی ہو‘ البتہ اس کے ذریعے سے بخیل شخص سے کچھ مال نکالا جاتا ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;