var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْذِرُوا فَإِنَّ النَّذْرَ لَا يُغْنِي مِنْ الْقَدَرِ شَيْئًا وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ الْبَخِيلِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے راویت ہے کہ نبی اکرمﷺ نے فرمایا: ’’نذر نہ مانا کرو کیونکہ نذر تقدیر کو رد نہیں کرسکتی۔اس کے ساتھ تو بخیل سے کچھ مال نکالا جاتا ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;