var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص اللہ تعالیٰ کی کسی اطاعت کی نذر مانے تو اسے چاہیے کہ وہ اللہ تعالیٰ کی اطاعت کرے اور جو شخص اللہ تعالیٰ کی کسی نافرمانی کی نذر مانے تو وہ اللہ تعالیٰ کی نافرمانی نہ کرے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;