var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنِي طَلْحَةُ بْنُ عَبْدِ الْمَلِكِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ";
nasai.urdu = "حضرت عائشہؓ فرماتی ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’جو شخص اللہ تعالیٰ کی اطاعت کی نذر مانے وہ اطاعت کرے‘ اور جو شخص اللہ تعالیٰ کی نافرمانی کی نذر مانے تو وہ ہرگز نافرمانی نہ کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;