var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ‘ انہوں نے فرمایا: ’’میں نے رسول اللہﷺ کو فرماتے سنا: ’’جو شخص اللہ تعالیٰ کی اطاعت کی نذر مانے تو اسے چاہیے کہ وہ اللہ تعالیٰ کی اطاعت کرے اور جو شخص اللہ تعالیٰ کی نافرمانی کی نذر مانے تو وہ اس کی نافرمانی (بالکل) نہ کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;