var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي سُلَيْمَانُ الْأَحْوَلُ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ يَقُودُ رَجُلًا فِي قَرَنٍ فَتَنَاوَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَطَعَهُ قَالَ إِنَّهُ نَذْرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ ایک آدمی کے پاس سے گزر ے جو ایک دوسرے آدمی کو رسی باندھ کر کھینچ رہا تھا۔آپ نے وہ رسی پکڑ کر کاٹ دی۔وہ کہنے لگا: میں نے یہ نذر مانی تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;