var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي أَيُّوبُ قَالَ حَدَّثَنَا أَبُو قِلَابَةَ عَنْ عَمِّهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ";
nasai.urdu = "حضرت عمران بن حصی رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’اللہ تعالیٰ کی نافرمانی اور انسان کی غیر مملوکہ چیز میں نذر ماننا غیر معتبر ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;