var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ وَقَالَ عَمْرٌو إِنَّ عُبَيْدَ اللَّهِ بْنَ زَحْرٍ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ أَنَّ عُقْبَةَ بْنَ عَامِرٍ أَخْبَرَهُ أَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أُخْتٍ لَهُ نَذَرَتْ أَنْ تَمْشِيَ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْهَا فَلْتَخْتَمِرْ وَلْتَرْكَبْ وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ نے بتایا کہ میں نے نبی اکرمﷺ سے اپنی ایک بہن کے بارے میں پوچھا جس نے نذر مانی تھی کہ وہ ننگے پاؤں‘ ننگے سر اور پیدل جائے گی۔نبی اکرمﷺ نے فرمایا: ’’اسے کہو کہ سرڈھانپے اور سوار ہوجائے اور تین دن کے روزے رکھ لے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3293) ترمذی (1544) ابن ماجہ (2134)`;
nasai.anwaar = [349,1];