var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ تُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ حضرت سعد بن عبادہ رضی اللہ عنہ نے سول اللہﷺ نے سے ایک نذر کے بارے میں پوچھا جو ان کی والدہ کے ذمے تھی لیکن وہ اس کی ادائیگی سے پہلے فوت ہوگئی تھی۔آپ نے فرمایا: ’’تم اس کی طرف سے ادا کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;