var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ اسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے‘ کہ انہوں نے فرمایا: حضرت سعد بن عبادہ رضی اللہ عنہ نے رسول اللہﷺ سے ایک نذر کے بارے میں پوچھا جو ان کی والدہ کے ذمے تھی مگر وہ اس کی ادائیگی سے پہلے فوت ہوگئی تھی۔رسول اللہﷺ نے فرمایا: ’’تم اس کی طرف سے ادا کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;