var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ مَنْبُوذٍ عَنْ أُمِّهِ أَنَّ مَيْمُونَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ رَأْسَهُ فِي حِجْرِ إِحْدَانَا فَيَتْلُو الْقُرْآنَ وَهِيَ حَائِضٌ وَتَقُومُ إِحْدَانَا بِخُمْرَتِهِ إِلَى الْمَسْجِدِ فَتَبْسُطُهَا وَهِيَ حَائِضٌ";
nasai.urdu = "ام المومنین حضرت میمونہ رضی اللہ عنہا سے روایت ہے،فرماتی ہیں: رسول اللہ ﷺ اپنا سر مبارک ہم میں سے کسی کی گود میں رکھ کر قرآن مجید تلاوت فرماتے،حالانکہ و حیض کی حالت میں ہوتی تھی۔اسی طرح ہم میں سے کوئی آپ ﷺ کی چٹائی لے جاکر مسجد میں بچھاتی تھی،حالانکہ وہ حیض کی حالت میں ہوتی تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;