var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ وَهَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ عَنْ عَبْدَةَ عَنْ هِشَامٍ وَهُوَ ابْنُ عُرْوَةَ عَنْ بَكْرِ بْنِ وَائِلٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ جَاءَ سَعْدُ بْنُ عُبَادَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ فَلَمْ تَقْضِهِ قَالَ اقْضِهِ عَنْهَا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا: حضرت سعد بن عبادہ رضی اللہ عنہ نبی اکرمﷺ کی خدمت میں حاضر ہوئے اور کہا: میری والدہ فوت ہوگئی ہے۔اس کے ذمے ایک نذر تھی جسے وہ ادا نہیں کرسکتی تھی۔آپ نے فرمایا: ’’تم اس کی طرف سے ادا کردو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;