var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مُوسَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ أَنَّهُ كَانَ عَلَيْهِ لَيْلَةٌ نَذَرَ فِي الْجَاهِلِيَّةِ يَعْتَكِفُهَا فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ أَنْ يَعْتَكِفَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ اپنے والد عمر رضی اللہ عنہ سے روایت کرتے ہیں کہ ان کے ذمے جاہلیت میں ایک رات اعتکاف بیٹھنے کی نذر تھی۔انہوں نے رسول اللہﷺ سے پوچھا تو آپ نے انہیں (ایک رات) اعتکاف بیٹھنے کا حکم دیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;