var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ عَلَى عُمَرَ نَذْرٌ فِي اعْتِكَافِ لَيْلَةٍ فِي الْمَسْجِدِ الْحَرَامِ فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَمَرَهُ أَنْ يَعْتَكِفَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا کہ حضرت عمر رضی اللہ عنہ کے ذمے (دور جاہلیت میں) ایک رات مسجد حرام میں اعتکاف بیٹھنے کی نذر تھی۔انہوں نے رسول اللہﷺ سے اس کے متعلق پوچھا تو آپ نے انہیں اعتکاف بیٹھنے کا حکم دیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;