var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ عُمَرَ كَانَ جَعَلَ عَلَيْهِ يَوْمًا يَعْتَكِفُهُ فِي الْجَاهِلِيَّةِ فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَمَرَهُ أَنْ يَعْتَكِفَهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ حضرت عمر رضی اللہ عنہ نے دور جاہلیت میں ایک دن اعتکاف بیٹھنے کی نذر مانی تھی۔(مسلمان ہونے کے بعد) انہوں نے رسول اللہﷺ سے اس بارے میں پوچھا تو آپ نے انہیں اعتکاف بیٹھنے کا حکم دیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;