var nasai = {};
nasai.arabic = "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ تُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حَائِضٌ وَهُوَ مُعْتَكِفٌ فَيُنَاوِلُهَا رَأْسَهُ وَهِيَ فِي حُجْرَتِهَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ وہ حیض کی حالت میں رسول اللہ ﷺ کے سر کو کنگھی کر دیا کرتی تھیں جب کہ آپ معتکف ہوتے تھے۔آپ انھیں اپنا سر پکڑا دیتے تھے اور وہ اپنے حجرے ہی میں ہوتی تھیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;