var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ إِنْ شَاءَ اللَّهُ فَهُوَ بِالْخِيَارِ إِنْ شَاءَ أَمْضَى وَإِنْ شَاءَ تَرَكَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جس شخص نے کسی چیز پر قسم کھائی اور ساتھ ہی ان شاء اللہ کہہ دیا تو اسے اختیار ہے۔چاہے تو اسے پورا کرے‘ چاہے پورا نہ کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;