var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ";
nasai.urdu = "حضرت عائشہؓ سے مروی ہے کہ رسول اللہ نے فرمایا: ’’اللہ کی نافرمانی والی نذر پوری نہیں کرنی چاہیے۔ایسی نذر کا کفارہ قسم کے کفارے کی طرح ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;