var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’معصیت والی نذر پوری نہ کی جائے (بلکہ اس کا کفارہ دیا جائے) اور اس کا کفارہ قسم والا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;