var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو صَفْوَانَ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ قَالَ أَبُو عَبْد الرَّحْمَنِ وَقَدْ قِيلَ أَنَّ الزُّهْرِيَّ لَمْ يَسْمَعْ هَذَا مِنْ أَبِي سَلَمَةَ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’معصیت کی نذر معتبر نہیں اور اس کا کفارہ قسم کے کفارے کی طرح ہے۔‘‘\nامام ابو عبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ کہا گیا ہے کہ امام زہری نے حضرت ابو سلمہ سے یہ روایت نہیں سنی۔";
nasai.hukam = "صحیح";
nasai.description = ``;