var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ مُوسَى الْفَرَوِيُّ قَالَ حَدَّثَنَا أَبُو ضَمْرَةَ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ الْيَمِينِ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’گناہ کی نذر پوری نہیں کرنی چاہیے (بلکہ اس میں کفارہ ہے) اور اس کا کفارہ قسم والا ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;