var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنِي سُفْيَانُ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُدْنِي إِلَيَّ رَأْسَهُ وَهُوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،فرماتی ہیں: آپ اعتکاف کی حالت میں اپنا سر میرے قریب فرما دیتے تھے،میں اس کو دھو ڈالتی تھی،حالانکہ میں حیض سے ہوتی تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;