var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ ابْنِ الْمُبَارَكِ وَهُوَ عَلِيٌّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ عَنْ أَبِيهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’گناہ کی نذر معتبر نہیں اور اس کا کفارہ قسم کے کفارے کے برابر ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;