var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ أَبِي عَمْرٍو وَهُوَ الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ عَنْ أَبِيهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ يَمِينٍ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’معصیت کی نذر معتبر نہیں اور اس کا کفارہ قسم والا کفارہ ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;