var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ قَالَ حَدَّثَنَا مَعْمَرُ بْنُ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ بِشْرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدٍ الْحَنْظَلِيِّ عَنْ أَبِيهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ قَالَ أَبُو عَبْد الرَّحْمَنِ مُحَمَّدُ بْنُ الزُّبَيْرِ ضَعِيفٌ لَا يَقُومُ بِمِثْلِهِ حُجَّةٌ وَقَدْ اخْتُلِفَ عَلَيْهِ فِي هَذَا الْحَدِيثِ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’غصے میں آکر مانی ہوئی نذر معتبر نہیں اور اس کا کفارہ قسم کے کفارے کی طرح ہے۔‘‘\nامام ابوعبدالرحمٰن (نسائی) رحمہ اللہ فرماتے ہیں: (راوئی حدیث) محمد بن زبیر ضعیف ہے‘ ایسا شخص حجت نہیں ہوتا‘ ویسے بھی اس حدیث میں اس پر اختلاف کیا گیا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>محمد بن الزبیر: متروک (تقریب: 5885)<br>ولم أجد لحدیثہ شاہدًا قویًا۔`;
nasai.anwaar = [349,1];