var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ عِمْرَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’غصے کی حالت میں نذر معتبر نہیں اور اس کا کفارہ کفارئہ قسم ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>محمد بن الزبیر: متروک (تقریب: 5885)<br>ولم أجد لحدیثہ شاہدًا قویًا۔`;
nasai.anwaar = [349,1];