var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ أَنْبَأَنَا حَمَّادٌ عَنْ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عِمْرَانَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ وَقِيلَ إِنَّ الزُّبَيْرَ لَمْ يَسْمَعْ هَذَا الْحَدِيثَ مِنْ عِمْرَانَ بْنِ حُصَيْنٍ";
nasai.urdu = "حضرت عمران رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’غصے کی حالت میں نذر درست نہیں‘ البتہ اس کا کفارہ قسم والا ہے۔‘‘ کہا گیا ہے کہ زبیر نے یہ حدیث حضرت عمران بن حصین رضی اللہ عنہ سے نہیں سنی۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>محمد بن الزبیر: متروک (تقریب: 5885)<br>ولم أجد لحدیثہ شاہدًا قویًا۔`;
nasai.anwaar = [349,1];