var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ قَالَ أَخْبَرَنِي أَبِي أَنَّ رَجُلًا حَدَّثَهُ أَنَّهُ سَأَلَ عِمْرَانَ بْنَ حُصَيْنٍ عَنْ رَجُلٍ نَذَرَ نَذْرًا لَا يَشْهَدُ الصَّلَاةَ فِي مَسْجِدِ قَوْمِهِ فَقَالَ عِمْرَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ";
nasai.urdu = "ایک آدمی نے حضرت عمران بن حصین رضی اللہ عنہ سے اس شخص کے بارے میں پوچھا جس نے نذر مان لی تھی کہ میں اپنی قوم کی مسجد میں نماز پڑھنے نہیں جاؤں گا۔حضرت عمران نے فرمایا: میں رسول اللہﷺ کو فرماتے سنا ہے: ’’غصے کی حالت میں نذر معتبر نہیں‘ البتہ اس کا کفارہ قسم ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>محمد بن الزبیر: متروک (تقریب: 5885)<br>ولم أجد لحدیثہ شاہدًا قویًا۔`;
nasai.anwaar = [349,1];