var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَلَا غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ اليَمِينٍ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’غصے اور نافرمانی کی نذر معتبر نہیں اور اس کا کفارہ قسم کے کفارے جیسا ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>محمد بن الزبیر: متروک (تقریب: 5885)<br>ولم أجد لحدیثہ شاہدًا قویًا۔`;
nasai.anwaar = [349,1];