var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو سُلَيْمٍ وَهُوَ عُبَيْدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو بَكْرٍ النَّهْشَلِيُّ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي الْمَعْصِيَةِ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ خَالَفَهُ مَنْصُورُ بْنُ زَاذَانَ فِي لَفْظِهِ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’نافرمانی والی نذر درست نہیں اور اس کا کفارہ قسم کے کفارے جیسا ہے۔‘‘\nالفاظ حدیث میں منصور بن زاذان نے محمد بن زبیر کی مخالفت کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;