var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْفُضَيْلُ وَهُوَ ابْنُ عِيَاضٍ عَنْ الْأَعْمَشِ عَنْ تَمِيمِ بْنِ سَلَمَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخْرِجُ رَأْسَهُ مِنْ الْمَسْجِدِ وَهُوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ اعتکاف کی حالت میں اپنا سر مبارک مسجد سے (حجرے میں) نکال دیتے تھے اورمیں باوجود حیض کی حالت کے آپ کا سر مبارک دھو دیا کرتی تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;