var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ لِابْنِ آدَمَ فِيمَا لَا يَمْلِكُ وَلَا فِي مَعْصِيَةِ اللَّهِ عَزَّ وَجَلَّ خَالَفَهُ عَلِيُّ بْنُ زَيْدٍ فَرَوَاهُ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے مروی ہے کہ نبی اکرمﷺ نے فرمایا: ’’انسان اس چیز میں نذر نہیں مان سکتا جس کا وہ مالک نہیں اور نہ اللہ تعالیٰ کی نافرمانی کی نذر مان سکتا ہے۔‘‘\nعلی بن زید نے منصور بن زاذان کی مخالفت کی ہے‘ اس نے یہ روایت بواسطئہ حسن‘ حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ سے بیان کی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;