var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي أَيُّوبُ قَالَ حَدَّثَنَا أَبُو قِلَابَةَ عَنْ عَمِّهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’نافرمانی کی نذر پور نہ کی جائے اور نہ اس چیز کی جس کا وہ انسان مالک نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;