var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ حُمَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ رَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُهَادَى بَيْنَ رَجُلَيْنِ فَقَالَ مَا هَذَا قَالُوا نَذَرَ أَنْ يَمْشِيَ إِلَى بَيْتِ اللَّهِ قَالَ إِنَّ اللَّهَ غَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ مُرْهُ فَلْيَرْكَبْ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا کہ نبی اکرمﷺ نے ایک آدمی کو دیکھا ہے جسے دو شخصوں کے سہارے چلایا جارہا تھا۔آپ نے فرمایا: ’’ایسے کیوں؟‘‘ لوگوں نے کہا: حضور! اس نے نذر مانی ہے کہ بیت اللہ تک چل کر جائے گا۔فرمایا: ’’اللہ تعالیٰ کو کیا ضرورت کہ یہ شخص اپنے آپ کو عذاب میں ڈالے؟ اسے کہو سوار ہوجائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;