var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْخٍ يُهَادَى بَيْنَ اثْنَيْنِ فَقَالَ مَا بَالُ هَذَا قَالُوا نَذَرَ أَنْ يَمْشِيَ قَالَ إِنَّ اللَّهَ غَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ مُرْهُ فَلْيَرْكَبْ فَأَمَرَهُ أَنْ يَرْكَبَ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے‘ انہوں نے فرمایا: رسول اللہﷺ ایک برزرگ آدمی کے پاس سے گزرے جسے دو آدمی سہارا دے کر چلا رہے تھے۔فرمایا: ’’اسے کیا ہوا؟‘‘ لوگوں نے کہا: اس نے پیدل چلنے کی نذر مانی ہے۔آپ نے فرمایا: ’’اللہ تعالیٰ کو کوئی ضرورت نہیں کہ یہ اپنے آپ کو عذاب میں ڈالے۔اسے کہو سوار ہوجائے۔‘‘ تو مخاطب نے اسے سوار ہونے کو کہا۔";
nasai.hukam = "حسن";
nasai.description = ``;