var nasai = {};
nasai.arabic = "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدْ اسْتَثْنَى";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے فرمایا: ’’جس نے قسم کھاتے وقت ان شاء اللہ کہا‘ وہ قسم پوری کرنے سے مستثنیٰ ہوگیا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;