var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ أَبِي سَعِيدٍ قَالَ إِذَا اسْتَأْجَرْتَ أَجِيرًا فَأَعْلِمْهُ أَجْرَهُ";
nasai.urdu = "حضرت ابوسعید رضی اللہ عنہ نے فرمایا: جب تو کسی مزدور سے مزدوری کرانا چاہے (کسی شخص کو نوکر اور ملازم رکھے) تو اسے اس کی اجرت صاف بتادے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>إبراہیم النخعي لم یسمع من أبي سعید الخدري رضي اللہ عنہ کما في تحفۃ الأشراف (3/ 326)`;
nasai.anwaar = [349,1];