var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عُثْمَانَ بْنِ سَنَّةَ الْخُزَاعِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَسْتَطِيبَ أَحَدُكُمْ بِعَظْمٍ أَوْ رَوْثٍ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے منع فرمایا کہ کوئی شخص ہڈی یا لید سے صفائی کرے۔";
nasai.hukam = "صحیح";
nasai.description = ``;