var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ خَالِدٍ وَهُوَ ابْنُ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ عَنْ مُجَاهِدٍ قَالَ حَدَّثَ رَافِعُ بْنُ خَدِيجٍ قَالَ خَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَانَا عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا فَقَالَ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ يَمْنَحْهَا أَوْ يَذَرْهَا";
nasai.urdu = "حضرت رافع بن خدیج رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ ہمارے پاس تشریف لائے اور ہمیں ایسے کام سے منع فرمادیا جو ہمارے لیے نفع مند تھا۔آپ نے فرمایا: ’’جس شخص کے پاس زمین ہو‘ وہ اسے خود کاشت کرے یا کسی بھائی کو بطور عطیہ (کاشت کے لیے) دے دے‘ یا پھر پڑی رہنے دے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;