var nasai = {};
nasai.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ عَجَزَ أَنْ يَزْرَعَهَا فَلْيَمْنَحْهَا أَخَاهُ الْمُسْلِمَ وَلَا يُزْرِعْهَا إِيَّاهُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جس شخص کے پاس (فالتو) زمین ہو‘ وہ اسے خود کاشت کرے۔اگر وہ خود کاشت نہ کرسکتا ہو تو اپنے مسلمان بھائی کو بطور وقتی عطیہ کے دے دے۔بٹائی یا ٹھیکے پر نہ دے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;