var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ وَلَا يُكْرِيهَا تَابَعَهُ عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الْأَوْزَاعِيُّ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جس شخص کے پاس زمین ہو‘ وہ اسے خود کاشت کرے یا اپنے کسی بھائی کو وقتی طور پر بطور عطیہ دے دے لیکن اسے کرایہ (بٹائی یا ٹھیکے) پر نہ دے۔‘‘\nاس حدیث کو (عن عطاء عن جابر سے) بیان کرنے میں عبدالرحمٰن بن عمرواوزاعی نے عبدالملک بن ابی سلیمان کی متابعت کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;