var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ مُحَمَّدٍ وَهُوَ أَبُو عُمَيْرِ بْنُ النَّحَّاسِ وَعِيسَى بْنُ يُونُسَ هُوَ الْفَاخُورِيُّ قَالَا حَدَّثَنَا ضَمْرَةُ عَنْ ابْنِ شَوْذَبٍ عَنْ مَطَرٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا وَلَا يُؤَاجِرْهَا";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے ہمیں خطبہ ارشاد فرمایا اور کہا: ’’جس شخص کے پاس (فالتو) زمین ہو‘ وہ اسے خود کاشت کرے یا کسی کو بلامعاوضہ کاشت کے لیے دے دے۔اسے کرایہ پر نہ دے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;