var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ يُونُسَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ مَطَرٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ رَفَعَهُ نَهَى عَنْ كِرَاءِ الْأَرْضِ وَافَقَهُ عَبْدُ الْمَلِكِ بْنُ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ عَلَى النَّهْيِ عَنْ كِرَاءِ الْأَرْضِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مرفوعاً روایت ہے کہ (رسول اللہﷺ نے) زمین کو کرایہ پر دینے سے منع فرمایا ہے۔زمین کرائے یا ٹھیکے پر دینے کی ممانعت کے مسئلے میں عبدالملک بن عبدالعزیز بن جریج نے مطر بن طہمان کی موافقت کی ہے۔واللہ اعلم۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;