var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْمُفَضَّلُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ وَأَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَبَيْعِ الثَّمَرِ حَتَّى يُطْعَمَ إِلَّا الْعَرَايَا تَابَعَهُ يُونُسُ بْنُ عُبَيْدٍ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے مخابرہ‘ مزابنہ‘ محاقلہ اور کچے پھلوں کی بیع سے منع فرمایا ہے مگر عرایا کی بیع ہوسکتی ہے۔\nیونس بن عبید نے ابن جریج کی متابعت کی ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;