var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى قَالَ سَأَلَ عَطَاءٌ سُلَيْمَانَ بْنَ مُوسَى قَالَ حَدَّثَ جَابِرٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلَا يُكْرِيهَا أَخَاهُ وَقَدْ رَوَى النَّهْيَ عَنْ الْمُحَاقَلَةِ يَزِيدُ بْنُ نُعَيْمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ";
nasai.urdu = "حضرت جابر بیان کرتے ہیں کہ رسول اللہﷺ نے فرمایا: ’’جس شخص کے پاس (فالتو) زمین ہو‘ وہ اسے خود کاشت کرے یا اپنے کسی بھائی کو بلامعاوضہ کاشت کے لیے دے دے لیکن اسے کرایہ پر نہ دے۔‘‘\nمحاقلہ سے ممانعت (کی حدیث) یزید بن نعیم نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;