var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ قَالَ حَدَّثَنَا أَبُو تَوْبَةَ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحَقْلِ وَهِيَ الْمُزَابَنَةُ خَالَفَهُ هِشَامٌ وَرَوَاهُ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے منقول ہے کہ نبی اکرمﷺ نے حقل سے منع فرمایا ہے اور اس سے مراد مزابنہ ہے۔\nہشام بن ابی عبداللہ نے معاویہ بن سلام کی مخالفت کی ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;