var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ خَالَفَهُمَا مُحَمَّدُ بْنُ عَمْرٍو فَقَالَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے محاقلہ اور مزابنہ سے منع فرمایا۔\nمحمد بن عمرولیثی نے یحییٰ بن ابوکثیر اور عمر بن ابوواسط کی مخالفت کی ہے۔اور اسے ابوسلمہ کے واسطے سے ابوسعید سے روایت کیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;