var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ آدَمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ خَالَفَهُمْ الْأَسْوَدُ بْنُ الْعَلَاءِ فَقَالَ عَنْ أَبِي سَلَمَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے راویت ہے کہ رسول اللہﷺ نے محاقلہ اور مزابنہ سے منع فرمایا۔\nٖاسود بن علاء نے ان (تینوں‘ یعنی محمد بن عمرو‘ بن ابوسلمہ اور یحییٰ بن ابوکثیر) کی مخالفت کی ہے۔اور (اس نے اپنی سند میں) کہا ہے: عن ابی سلمۃ‘ عن رافع ابن خدیج۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;