var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حُمْرَانَ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ الْأَسْوَدِ بْنِ الْعَلَاءِ عَنْ أَبِي سَلَمَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ رَوَاهُ الْقَاسِمُ بْنُ مُحَمَّدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ";
nasai.urdu = "حضرت رافع بن حدیج رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے محاقلہ اور مزابنہ سے منع فرمایا۔\nیہ روایت قاسم بن محمد نے بھی حضرت رافع بن خدیج سے بیان کی ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;