var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ مُرَّةَ قَالَ سَأَلْتُ الْقَاسِمَ عَنْ الْمُزَارَعَةِ فَحَدَّثَ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ قَالَ أَبُو عَبْد الرَّحْمَنِ مَرَّةً أُخْرَى";
nasai.urdu = "عثمان بن مرہ نے کہا کہ میں نے قاسم (بن محمد) سے مزارعت (مضاربت) کے متعلق پوچھا تو انہوں نے حضرت رافع بن خدیج رضی اللہ عنہ سے بیان کیا کہ رسول اللہﷺ نے محاقرہ اور مزابنہ سے منع فرمایا ہے۔\nامام ابوعبدالرحمٰن (نسائی) رحمہ اللہ نے ایک دوسری بار یوں فرمایا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;