var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ قَالَ أَبُو عَاصِمٍ عَنْ عُثْمَانَ بْنِ مُرَّةَ قَالَ سَأَلْتُ الْقَاسِمَ عَنْ كِرَاءِ الْأَرْضِ فَقَالَ قَالَ رَافِعُ بْنُ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ وَاخْتُلِفَ عَلَى سَعِيدِ بْنِ الْمُسَيَّبِ فِيهِ";
nasai.urdu = "حضرت عثمان بن مرہ نے کہا کہ میںنے حضرت قاسم سے زمین کرائے پر دینے کے بارے میں پوچھا تو انہوں نے فرمایا: حضرت رافع بن خدیج رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے زمین کو کرائے (بٹائی یا ٹھیکے) پر دینے سے منع فرمایا ہے۔\nاس حدیث میں سعید بن مسیب پر اختلاف کیا گیا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;