var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ فِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ مُرْهَا أَنْ تَغْتَسِلَ وَتُهِلَّ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے حضرت اسماء بنت عمیس رضی اللہ عنہا کی حدیث کے بارے میں روایت ہے،جب انھیں ذوالحلیفہ (مدینہ والوں کے احرام باندھنے کی جگہ) میں بچہ پیدا ہوا تھا،کہ اللہ کے رسول ﷺ نے حضرت ابوبکر صدیق رضی اللہ عنہ سے فرمایا: ’’اسے کہو کہ وہ غسل کرے اور احرام باندھے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;