var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ أَنْبَأَنَا إِسْرَائِيلُ عَنْ طَارِقٍ عَنْ سَعِيدٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ قَالَ سَعِيدٌ فَذَكَرَهُ نَحْوَهُ رَوَاهُ سُفْيَانُ الثَّوْرِيُّ عَنْ طَارِقٍ";
nasai.urdu = "حضرت سعید بن مسیب بیان کرتے ہیں کہ رسول اللہﷺ نے محاقلہ سے منع فرمایاہے۔سعید نے کہا… اور آگے اس (سعید) نے اسی (مذکورہ روایت) کی طرح ذکرکیا (یعنی انما یزرع ثلاثۃ)\nسفیان ثوری نے بھی طارق سے یہ حدیث راویت کی ہے (جس طرح کہ اسرائیل نے طارق سے روایت کی ہے)۔";
nasai.hukam = "حسن";
nasai.description = ``;