var nasai = {};
nasai.arabic = "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَرَوَاهُ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ ابْنِ لَبِيبَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ فَقَالَ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ";
nasai.urdu = "حضرت سعید بن مسیب رحمہ اللہ سے مروی ہے کہ رسول اللہﷺ نے محاقلہ اور مزابنہ سے منع فرمایا ہے۔\nمحمد بن عبدالرحمٰن بن لبیبہ نے اسے سعید بن مسیب سے روایت کیا اور انہوں نے کہا کہ یہ سعد بن ابی وقاص رضی اللہ عنہ سے مروی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;