var nasai = {};
nasai.arabic = "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ قَالَ كَتَبَ إِلَيَّ يَعْلَى بْنُ حَكِيمٍ إِنِّي سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ كُنَّا نُحَاقِلُ الْأَرْضَ نُكْرِيهَا بِالثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى رَوَاهُ سَعِيدٌ عَنْ يَعْلَى بْنِ حَكِيمٍ";
nasai.urdu = "ایوب بیان کرتے ہیں کہ یعلی بن حکیم نے مجھے لکھا ہے کہ میں نے سلیمان بن یسار سے سنا‘ وہ حضرت رافع بن خدیج سے حدیث بیان کرتے تھے کہ حضرت رافع بن خدیج رضی اللہ عنہ نے فرمایا: ہم اپنی فالتو زمینیں پیداوار کی تہائی یا چوتھائی یا معین غلے کے عوض بٹائی پر دیا کرتے تھے۔\nسعید نے یہ روایت یعلی بن حکیم سے بیان کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;