var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ عَبْدِ الْوَارِثِ عَنْ حُسَيْنٍ يَعْنِي الْمُعَلِّمَ عَنْ ابْنِ بُرَيْدَةَ عَنْ سَمُرَةَ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُمِّ كَعْبٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ فِي وَسَطِهَ";
nasai.urdu = "حضرت سمرہ رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: میں نے رسول اللہ ﷺ کے ساتھ ام کعب رضی اللہ عنہا کا جنازہ پڑھا جو کہ بچے کی پیدائش کے موقع پر فوت ہو گئی تھیں۔اللہ کے رسول ﷺ جنازے کے دوران میں ان کے درمیان کھڑے ہوئے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;