var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَكَانَتْ تَكُونُ فِي حَجْرِهَا أَنَّ امْرَأَةً اسْتَفْتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ فَقَالَ حُتِّيهِ وَاقْرُصِيهِ وَانْضَحِيهِ وَصَلِّي فِيهِ";
nasai.urdu = "حضرت اسماء بنت ابی بکر رضی اللہ عنہا سے روایت ہے کہ ایک عورت نے نبی ﷺ سے حیض کے خون کے بارے میں پوچھا جو کپڑے کو لگ جائے؟ تو آپ نے فرمایا: ’’اس کو (کسی چیز سے) کھرچ دو اور پانی ڈال کر ناخنوں سے ملو اور پھر دھو کر اس میں نماز پڑھ لو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;