var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا جُوَيْرِيَةُ عَنْ نَافِعٍ أَنَّ رَافِعَ بْنَ خَدِيجٍ حَدَّثَ عَبْدَ اللَّهِ بْنَ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْمَزَارِعِ";
nasai.urdu = "حضرت نافع سے منقول ہے کہ حضرت رافع بن خدیج رضی اللہ عنہ نے حضرت عبداللہ بن عمر رضی اللہ عنہ کو بیان فرمایا کہ رسول اللہﷺ نے زمینیں کرائے پر دینے سے منع فرمایا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;