var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ عَبْدِ الْوَهَّابِ قَالَ حَدَّثَنَا هِشَامٌ عَنْ مُحَمَّدٍ وَنَافِعٍ أَخْبَرَاهُ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ رَوَاهُ ابْنُ عُمَرَ عَنْ رَافِعِ بْنِ خَدِيجٍ وَاخْتُلِفَ عَلَى عَمْرِو بْنِ دِينَارٍ";
nasai.urdu = "حضرت رافع بن خدیج رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے زمین کرائے پر دینے سے منع فرمایا ہے۔\nاس حدیث کو حضرت عبداللہ بن عمر رضی اللہ عنہ نے حضرت رافع بن خدیج رضی اللہ عنہ سے روایت کیا ہے۔(اور عبداللہ بن عمر سے عمرو بن دینار بیان کرتے ہیں) تو عمرو بن دینار پر اختلاف کیا گیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;