var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ كُنَّا نُخَابِرُ وَلَا نَرَى بِذَلِكَ بَأْسًا حَتَّى زَعَمَ رَافِعُ بْنُ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ";
nasai.urdu = "حضرت عمروبن زید نے کہا: میں نے حضرت ابن عمر رضی اللہ عنہ کو فرماتے سنا کہ ہم زمین بٹائی پر دیا کرتے تھے اور اس میں کوئی حرج نہیں سمجھتے تھے حتیٰ کہ رافع بن خدیج نے کہا کہ رسول اللہﷺ نے بٹائی سے منع فرمایا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;