var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو الْمِقْدَامِ ثَابِتٌ الْحَدَّادُ عَنْ عَدِيِّ بْنِ دِينَارٍ قَالَ سَمِعْتُ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضَةِ يُصِيبُ الثَّوْبَ قَالَ حُكِّيهِ بِضِلَعٍ وَاغْسِلِيهِ بِمَاءٍ وَسِدْرٍ";
nasai.urdu = "حضرت ام قیس بنت محصن رضی اللہ عنہا سے روایت ہے کہ انھوں نے رسول اللہ ﷺ سے حیض کے خون کے بارے میں پوچھا جو کپڑے کو لگ جائے؟ تو آپ نے فرمایا: ’’اسے کسی لکڑی (یا ہڈی وغیرہ) سے کھرچ دو اور پانی اور بیری کےپتوں سے دھو دو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;