var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ كُنَّا لَا نَرَى بِالْخِبْرِ بَأْسًا حَتَّى كَانَ عَامَ الْأَوَّلِ فَزَعَمَ رَافِعٌ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ خَالَفَهُ عَارِمٌ فَقَالَ عَنْ حَمَّادٍ عَنْ عَمْرٍو عَنْ جَابِرٍ";
nasai.urdu = "حضرت عمرو بن دینار سے منقول ہے کہ میں نے حضرت ابن عمر رضی اللہ عنہ کو فرماتے سنا کہ ہم بٹائی میں کوئی حرج نہیں سمجھتے تھے حتیٰ کہ (یزید یا حضرت ابن زبیر کی خلافت کا) پہلا سال ہوا تو رافع کہنے لگے کہ نبی اکرمﷺ نے اس سے منع فرمایا ہے۔\nعارم نے اس (یحییٰ بن حبیب) کی مخالفت کی ہے اور کہا ہے: عن حماد‘ عن عمرو‘ عن جابر۔";
nasai.hukam = "حسن";
nasai.description = ``;