var nasai = {};
nasai.arabic = "قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ يُونُسَ قَالَ حَدَّثَنَا عَارِمٌ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ تَابَعَهُ مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے راویت ہے کہ نبی اکرمﷺ نے زمین کرایہ پر دینے سے منع فرمایا ہے۔\nمحمد بن مسلم طائفی نے اس (حماد بن زید) کی متابعت کی ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;