var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا سُرَيْجٌ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرٍ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُخَابَرَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةِ جَمَعَ سُفْيَانُ بْنُ عُيَيْنَةَ الْحَدِيثَيْنِ فَقَالَ عَنْ ابْنِ عُمَرَ وَجَابِرٍ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے مجھے مخابرہ‘ محاقلہ اور مزابنہ سے منع فرمایا۔\nسفیان بن عینیہ نے (دونوں صحابہ کی) دو حدیثوں کو جمع کردیا ہے اور کہا ہ: ’’عن ابن عمر‘ وجابر۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;