var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ لَيْثٍ قَالَ حَدَّثَنِي بُكَيْرُ بْنُ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ أُسَيْدِ بْنِ رَافِعِ بْنِ خَدِيجٍ أَنَّ أَخَا رَافِعٍ قَالَ لِقَوْمِهِ قَدْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْيَوْمَ عَنْ شَيْءٍ كَانَ لَكُمْ رَافِقًا وَأَمْرُهُ طَاعَةٌ وَخَيْرٌ نَهَى عَنْ الْحَقْلِ";
nasai.urdu = "(حضرت رافع بن خدیج رضی اللہ عنہ کے بیٹے) اسید سے راویت ہے کہ (والد محترم) رافع کے بھائی نے اپنی قوم سے کہا کہ رسول اللہﷺ نے آج ایک ایسی چیز سے روک دیا ہے جو تمہارے لیے مفید تھی۔ویسے آپ کے حکم ہی کی اطاعت کی جائے گی اور وہی سب سے بہتر ہے۔آپ نے زمین بٹائی پر دینے سے روک دیا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;