var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ اللَّيْثِ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ قَالَ سَمِعْتُ أُسَيْدَ بْنَ رَافِعِ بْنِ خَدِيجٍ الْأَنْصَارِيَّ يَذْكُرُ أَنَّهُمْ مَنَعُوا الْمُحَاقَلَةَ وَهِيَ أَرْضٌ تُزْرَعُ عَلَى بَعْضِ مَا فِيهَا رَوَاهُ عِيسَى بْنُ سَهْلِ بْنِ رَافِعٍ";
nasai.urdu = "حضرت عبدالرحمٰن بن ہرمز نے کہا: میں نے اسید بن رافع بن حدیج انصاری کو یہ ذکر کرتے سنا کہ ان کو محاقلہ سے روک دیا گیا تھا۔اور محاقلہ سے مراد یہ ہے کہ زمین اپنی پیداوار کے کچھ حصے کے عوض کاشت کے لیے دے دی جائے۔\nیہ روایت عیسیٰ بن سہل بن رافع نے بیان کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;