var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ أَنَّ أَبَا السَّائِبِ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘تم میں سے کوئی شخص جنابت کی حالت میں ٹھہرے پانی کے اندر غسل نہ کرے۔’’";
nasai.hukam = "صحیح";
nasai.description = ``;