var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْمَلُوهَا مِنْ أَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرَ مَا يَخْرُجُ مِنْهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے خیبر کے یہودیوں کو خیبر کی کھجوریں (درخت) اور زمین اس شرط پر سپرد کردی تھیں کہ وہ اپنے مال سے ان درختوں اور زمین میں کام کریں گے اور رسول اللہﷺ کو کل پیداوار کانصف (بطور مالک زمین) ملے گا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;