var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ قَالَ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْمَلُوهَا بِأَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرَ ثَمَرَتِهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ نبی اکرمﷺ نے خیبر کے یہودیوں کو خیبر کی زمین اور کھجوروں کے درخت اس شرط پر دیے تھے کہ وہ اپنے مالوں کے ساتھ ان میں کام کریں گے اور رسول اللہﷺ کو (بحیثیت مالک ہونے کے) اس زمین کا نصف پھل ملے گا۔";
nasai.hukam = "حسن";
nasai.description = ``;