var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُ كَانَتْ الْمَزَارِعُ تُكْرَى عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَنَّ لِرَبِّ الْأَرْضِ مَا عَلَى رَبِيعِ السَّاقِي مِنْ الزَّرْعِ وَطَائِفَةً مِنْ التِّبْنِ لَا أَدْرِي كَمْ هُوَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ فرمایا کرتے تھے کہ رسول اللہﷺ کے دور مبارک میںزمینیں کرائے پر دی جاتی تھیں۔اس شرط پر کہ پانی کے نالوں کے قریب اگنے والی فصل اور کچھ معین توڑی‘ نہ معلوم وہ کتنی ہوتی تھی‘ مالک زمین کو ملے گی (اور باقی مزارع کو)۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;