var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ مَعْمَرًا عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ قَالَ قَالَ سَعِيدُ بْنُ جُبَيْرٍ قَالَ ابْنُ عَبَّاسٍ إِنَّ خَيْرَ مَا أَنْتُمْ صَانِعُونَ أَنْ يُؤَاجِرَ أَحَدُكُمْ أَرْضَهُ بِالذَّهَبِ وَالْوَرِقِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ بہترین طریق کار یہ ہے کہ تم میں سے کوئی شخص اپنی (زائد) زمین سونے چاندی (رقم) کے عوض ٹھیکے پر دے دے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;