var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَ اشْتَرَكْتُ أَنَا وَعَمَّارٌ وَسَعْدٌ يَوْمَ بَدْرٍ فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ وَلَمْ أَجِئْ أَنَا وَلَا عَمَّارٌ بِشَيْءٍ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ بدر کے دن میں‘ عمار اور سعد شریک بن گئے۔سعد دوقیدی لائے‘ جبکہ میں اور عمار کوئی قیدی نہ لاسکے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3388) ابن ماجہ (2288) الحدیث الآتی (4701)`;
nasai.anwaar = [350,1];