var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا حِبَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ الرَّجُلُ فِي الْمَاءِ الدَّائِمِ ثُمَّ يَغْتَسِلُ مِنْهُ أَوْ يَتَوَضَّأُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سےروایت ہے،نبی ﷺ سے نے فرمایا:‘‘کوئی شخص ٹھہرے پانی میں پیشاب نہ کرے کہ پھر اسے اس سے غسل یا وضو کرنا پڑے۔’’";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;