var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ صَالِحٍ الْبَغْدَادِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي ابْنُ عَجْلَانَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُبَالَ فِي الْمَاءِ الدَّائِمِ ثُمَّ يُغْتَسَلَ فِيهِ مِنْ الْجَنَابَةِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے منع فرمایا کہ ٹھہرے پانی میں پیشاب کیا جائے کہ پھر اس سے جنابت کی وجہ سے نہانا پڑے۔";
nasai.hukam = "صحیح";
nasai.description = ``;