var nasai = {};
nasai.arabic = "قَالَ عُبَيْدُ اللَّهِ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ سِمَاكٍ،عَنْ النُّعْمَانِ بْنِ سَالِمٍ،عَنْ رَجُلٍ حَدَّثَهُ قَالَ: دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي قُبَّةٍ فِي مَسْجِدِ الْمَدِينَةِ،وَقَالَ فِيهِ: «إِنَّهُ أُوحِيَ إِلَيَّ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ» نَحْوَهُ";
nasai.urdu = "حضرت نعمان بن سالم ایک صحابی سے بیان کرتے ہیں کہ انہوں نے فرمایا: رسول اللہﷺ ہمارے پاس تشریف لائے اور فرمانے لگے،جبکہ ہم مدینہ منورہ کی مسجد کے قبہ میں تھے: ’’مجھے وحی کی گئی ہے کہ میں لوگوں سے لڑائی کروں حتی کہ وہ لا الہ الا اللہ کہہ دیں۔‘‘ باقی روایت سابقہ روایت کی طرح ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;