var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ أَعْيَنَ قَالَ: حَدَّثَنَا زُهَيْرٌ قَالَ: حَدَّثَنَا سِمَاكٌ،عَنْ النُّعْمَانِ بْنِ سَالِمٍ: قَالَ سَمِعْتُ أَوْسًا يَقُولُ: دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي قُبَّةٍ وَسَاقَ الْحَدِيثَ";
nasai.urdu = "حضرت نعمان بن سالم سے روایت ہے کہ میں نے حضرت اوس رضی اللہ تعالٰی عنہ کو فرماتے سنا کہ رسول اللہﷺ ہمارے پاس تشریف لائے،جبکہ ہم اس وقت مسجد کے قبہ میں تھے۔پھر سابقہ حدیث پوری بیان کی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;