var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،عَنْ عَبْدِ الرَّحْمَنِ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ الْأَعْمَشِ،عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُقْتَلُ نَفْسٌ ظُلْمًا إِلَّا كَانَ عَلَى ابْنِ آدَمَ الْأَوَّلِ كِفْلٌ مِنْ دَمِهَا،وَذَلِكَ أَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ»";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو بھی شخص ناحق مارا جاتا ہے اس کے قتل کا بوجھ حضرت آدم کے بیٹے،(قابیل) جو سب سے پہلا قاتل تھا،پر بھی ہو گا کیونکہ اس نے سب سے پہلے قتل کو جاری کیا تھا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;