var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ الْبَصْرِيُّ قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ شُعْبَةَ،عَنْ يَعْلَى بْنِ عَطَاءٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَزَوَالُ الدُّنْيَا أَهْوَنُ عِنْدَ اللَّهِ مِنْ قَتْلِ رَجُلٍ مُسْلِمٍ»";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے مروی ہے کہ نبیٔ اکرمﷺ نے فرمایا: ’’دنیا کا تباہ ہو جانا اللہ تعالیٰ کے نزدیک ایک مسلمان شخص کے (ناحق) قتل کے مقابلے میں بہت معمولی ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;