var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْحَاقَ الْمَرْوَزِيُّ،ثِقَةٌ،حَدَّثَنِي خَالِدُ بْنُ خِدَاشٍ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،عَنْ بَشِيرِ بْنِ الْمُهَاجِرِ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ،عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَتْلُ الْمُؤْمِنِ أَعْظَمُ عِنْدَ اللَّهِ مِنْ زَوَالِ الدُّنْيَا»";
nasai.urdu = "حضرت بریدہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’مومن کا قتل اللہ تعالیٰ کے نزدیک پوری دنیا کی تباہی سے بڑھ کر ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;