var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَرِيعُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ الْخَصِيُّ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الْأَزْرَقُ،عَنْ شَرِيكٍ،عَنْ عَاصِمٍ،عَنْ أَبِي وَائِلٍ،عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ مَا يُحَاسَبُ بِهِ الْعَبْدُ الصَّلَاةُ،وَأَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ فِي الدِّمَاءِ»";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’آدمی سے سب سے پہلے جس چیز کا حساب لیا جائے گا،وہ نماز ہے اور لوگوں کے درمیان سب سے پہلے فیصلہ قتل کے بارے میں ہو گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;