var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى،عَنْ خَالِدٍ،حَدَّثَنَا شُعْبَةُ،عَنْ سُلَيْمَانَ قَالَ: سَمِعْتُ أَبَا وَائِلٍ،يُحَدِّثُ عَنْ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَوَّلُ مَا يُحْكَمُ بَيْنَ النَّاسِ فِي الدِّمَاءِ»";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ تعالٰی عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’سب سے پہلے لوگوںڈ میں قتل وغیرہ کے فیصلے کیے جائیں گے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;