var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ،عَنْ عَمْرِو بْنِ شُرَحْبِيلَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ مَا يُقْضَى فِيهِ بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ»";
nasai.urdu = "حضرت عمرو بن شرحبیل رضی اللہ تعالٰی عنہ سے رویات ہے کہ رسول اللہﷺ نے فرمای: ’’قیامت کے دن سب سے پہلے لوگوں کے درمیان قتل وغیرہ کے فیصلے کیے جائیں گے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;