var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ عَطَاءٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَدْخُلْ الْحَمَّامَ إِلَّا بِمِئْزَرٍ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،نبی نے فرمایا: ’’جوشخص اللہ تعالیٰ اور یوم آخرت پر ایمان رکھتا ہے وہ ازار کے بغیر حمام میں داخل نہ ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;