var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ قَالَ: حَدَّثَنَا حُسَيْنٌ قَالَ: حَدَّثَنَا زُهَيْرٌ قَالَ: حَدَّثَنَا أَبُو إِسْحَاقَ،عَنْ عَمْرِو بْنِ غَالِبٍ قَالَ: قَالَتْ عَائِشَةُ: يَا عَمَّارُ،أَمَا إِنَّكَ تَعْلَمُ أَنَّهُ لَا يَحِلُّ دَمُ امْرِئٍ إِلَّا ثَلَاثَةٌ: النَّفْسُ بِالنَّفْسِ،أَوْ رَجُلٌ زَنَى بَعْدَ مَا أُحْصِنَ،وَسَاقَ الْحَدِيثَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ اے عمار! کیا تو نہیں جانتا کہ تین اشخاص کے علاوہ کسی مسلمان کا خون بہانا حلال نہیں: جان کے بدلے جان،یا (اس آدمی کو رجم کیا جائے گا) جس نے شادی شدہ ہونے کے بعد زنا کیا۔پھر راوی نے پوری حدیث بیان کی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن۔<br>وحدیث أبي داود (الأصل: 4353) و سندہ صحیح والنسائي الآتي (الأصل: 4053) یغني عنہ۔`;
nasai.anwaar = [350,2];