var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا يَحْيَى قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: حَدَّثَنَا زِيَادُ بْنُ عِلَاقَةَ،عَنْ عَرْفَجَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «سَتَكُونُ بَعْدِي هَنَاتٌ،وَهَنَاتٌ،فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ أُمَّةِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَهُمْ جَمْعٌ فَاضْرِبُوهُ بِالسَّيْفِ»";
nasai.urdu = "حضرت عرفجہ رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’میرے بعد بہت سی خرابیاں اور فساد ہوں گے۔جو شخص امت محمدﷺ میں پھوٹ ڈالنا چاہے جبکہ امت (ایک شخص پر) متفق ہو تو اسے تلوار سے مار دو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;