var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ: حَدَّثَنَا جَرِيرٌ،عَنْ زَيْدِ بْنِ عَطَاءِ بْنِ السَّائِبِ،عَنْ زِيَادِ بْنِ عِلَاقَةَ،عَنْ أُسَامَةَ بْنِ شَرِيكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا رَجُلٍ خَرَجَ يُفَرِّقُ بَيْنَ أُمَّتِي،فَاضْرِبُوا عُنُقَهُ»";
nasai.urdu = "حضرت اسامہ بن شریک رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص میری امت میں پھوٹ ڈالنے کے لیے نکلے،اس کی گردن اڑا دو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;