var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَزِيدَ عَنْ رُقْبَةَ عَنْ مَجْزَأَةَ الْأَسْلَمِيِّ عَنْ ابْنِ أَبِي أَوْفَى قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ اللَّهُمَّ طَهِّرْنِي مِنْ الذُّنُوبِ كَمَا يُطَهَّرُ الثَّوْبُ الْأَبْيَضُ مِنْ الدَّنَسِ";
nasai.urdu = "حضرت ابن ابی اوفیٰ رضی اللہ عنہ بیان کرتے ہیں،نبی ﷺ یہ دعا کیا کرتے تھے: [اللھم طھرنی بالثلج والبرد۔۔۔من الدنس] ’’اے اللہ! مجھے برف،اولوں اور ٹھنڈے پانی سے پاک کردے۔اے اللہ! مجھے گناہوں سے اس طرح پاک کردے جس طرح سفید میل کچیل سے پاک کیا جاتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;