var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ: حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ: حَدَّثَنِي أَبُو قِلَابَةَ،عَنْ أَنَسٍ قَالَ: قَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةُ نَفَرٍ مِنْ عُكْلٍ،فَذَكَرَ نَحْوَهُ إِلَى قَوْلِهِ: لَمْ يَحْسِمْهُمْ وَقَالَ: قَتَلُوا الرَّاعِيَ";
nasai.urdu = "حضرت انس رضی اللہ تعالٰی عنہ سے مروی ہے کو عکل قبیلے کے آٹھ آدمی رسول اللہﷺ کے پاس آئے۔اس کے بعد راوی نے سابقہ حدیث کی طرح حدیث کی۔آخر میں ہے: آپ نے ان کے زخموں کا خون بند نہ کیا۔راوی نے یہ بھی کہا کہ انہوں نے چرواہے کو قتل کر دیا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;