var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخَلَنْجِيُّ قَالَ: حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: «أَغَارَ قَوْمٌ عَلَى لِقَاحِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَهُمْ فَقَطَّعَ أَيْدِيَهُمْ،وَأَرْجُلَهُمْ،وَسَمَلَ أَعْيُنَهُمْ»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ کچھ لوگوں نے رسول اللہﷺ کی دودھ والی اونٹنیوں کو لوٹ لیا تھا۔آپ نے ان کو گرفتار کیا،پھر سختی کے ساتھ ان کے ہاتھ پائوں کاٹ دیے اور ان کی آنکھوں کو پھوڑ دیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;