var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ: أَخْبَرَنِي ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ،عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ،عَنْ أَبِي الزِّنَادِ،عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «وَنَزَلَتْ فِيهِمْ آيَةُ الْمُحَارَبَةِ»";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ نے بھی یہ روایت رسول اللہﷺ سے نقل فرمائی ہے۔اس میں یہ لفظ بھی ہیں کہ ان کے بارے میں محاربہ والی آیت اتری۔";
nasai.hukam = "حسن";
nasai.description = ``;