var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ: أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي اللَّيْثُ،عَنْ ابْنِ عَجْلَانَ،عَنْ أَبِي الزِّنَادِ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَطَّعَ الَّذِينَ سَرَقُوا لِقَاحَهُ،وَسَمَلَ أَعْيُنَهُمْ بِالنَّارِ،عَاتَبَهُ اللَّهُ فِي ذَلِكَ،فَأَنْزَلَ اللَّهُ تَعَالَى»: إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ [المائدة: 33] الْآيَةَ كُلَّهَا";
nasai.urdu = "حضرت ابو الزناد سے روایت ہے کہ جب رسول اللہﷺ نے ان لوگوں کے ہاتھ کاٹے جنہوں نے آپ کی دودھ والی اونٹنیاں چرائی تھیں اور ان کی آنکھیں آگ (پر گرم کی ہوئی سلائیوں) کے ساتھ پھوڑ دیں تو اللہ تعالیٰ نے اس بارے میں آپ پر اظہار ناراضی فرمایا اور یہ پوری آیت اتری: اِنَّمَا جَزٰٓؤُا الَّذِیْنَ یُحَارِبُوْنَ اللہَ وَ رَسُوْلَہٗ";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4370)<br>السند مرسل وابن عجلان عنعن۔`;
nasai.anwaar = [351,1];