var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْفَضْلُ بْنُ سَهْلٍ الْأَعْرَجُ قَالَ: حَدَّثَنَا يَحْيَى بْنُ غَيْلَانَ،ثِقَةٌ مَأْمُونٌ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،عَنْ أَنَسٍ قَالَ: «إِنَّمَا سَمَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَعْيُنَ أُولَئِكَ،لِأَنَّهُمْ سَمَلُوا أَعْيُنَ الرُّعَاةِ»";
nasai.urdu = "حضرت انس رضی اللہ تعالٰی عنہ سے مروی ہے کہ نبی اکرمﷺ نے ان کی آنکھیں اس لیے پھوڑی تھیں کہ انہوں نے چرواہوں کو آنکھیں پھوڑی تھیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;