var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا حَجَّاجٌ،عَنْ ابْنِ جُرَيْجٍ قَالَ: أَخْبَرَنِي مَعْمَرٌ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ أَنَسٍ،«أَنَّ رَجُلًا قَتَلَ جَارِيَةً مِنَ الْأَنْصَارِ عَلَى حُلِيٍّ لَهَا،ثُمَّ أَلْقَاهَا فِي قَلِيبٍ،وَرَضَخَ رَأْسَهَا بِالْحِجَارَةِ فَأَمَرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُرْجَمَ حَتَّى يَمُوتَ»";
nasai.urdu = "حضرت انس رضی اللہ تعالٰی عنہ سے روایت ہے کہ ایک آدمی نے انصار کی ایک لڑکی کو اس کے زیورات کی خاطر قتل کر دیا،پھر اسے پرانے کنویں میں پھینک دیا۔(دراصل) اس نے اس کا سر پتھر سے کچل دیا تھا۔نبی اکرمﷺ نے حکم دیا کہ اسے پتھر کے ساتھ کچلا جائے حتی کہ وہ مر جائے۔";
nasai.hukam = "حسن";
nasai.description = ``;