var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا أَبُو دَاوُدَ قَالَ: أَنْبَأَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَبَقَ الْعَبْدُ لَمْ تُقْبَلْ لَهُ صَلَاةٌ حَتَّى يَرْجِعَ إِلَى مَوَالِيهِ»";
nasai.urdu = "حضرت جریر رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جب غلام بلا اجازت بھاگ جائے تو اس کی نماز قبول نہیں ہوتی حتی کہ وہ اپنے مالکوں کے پاس واپس لوٹ آئے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;