var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ،عَنْ جَرِيرٍ،عَنْ مُغِيرَةَ،عَنْ الشَّعْبِيِّ قَالَ: كَانَ جَرِيرٌ يُحَدِّثُ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا أَبَقَ الْعَبْدُ لَمْ تُقْبَلْ لَهُ صَلَاةٌ،وَإِنْ مَاتَ مَاتَ كَافِرًا،وَأَبَقَ غُلَامٌ لِجَرِيرٍ فَأَخَذَهُ فَضَرَبَ عُنُقَهُ";
nasai.urdu = "حضرت جریر رضی اللہ تعالٰی عنہ نبی اکرمﷺ سے بیان فرماتے ہیں کہ (آپ نے فرمای:) ’’جب کوئی غلام اپنے مالک سے بھاگ جائے تو اس کی نماز قبول نہیں ہوتی۔اگر وہ مر جائے تو کفر کی حالت میں مرے گا۔‘‘ حضرت جریر کا ایک غلام بھاگ گیا تھا۔وہ ان کی گرفت میں آیا زتو انہوں نے اس کی گردن اتار دی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>مغیرۃ بن مقسم مدلس وعنعن۔`;
nasai.anwaar = [351,1];