var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ: أَنْبَأَنَا إِسْرَائِيلُ،عَنْ مُغِيرَةَ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ،قَالَ: «إِذَا أَبَقَ الْعَبْدُ إِلَى أَرْضِ الشِّرْكِ،فَلَا ذِمَّةَ لَهُ»";
nasai.urdu = "حضرت جریر بن عبداللہ رضی اللہ تعالٰی عنہ سے مروی ہے کہ جب کوئی غلام بھاگ کر مشرکین (اور کفار) کے علاقے میں چلا جائے تو اس کے لیی مسلمانوں کی امان اور پناہ نہیں رہتی (یعنی اسے قتل کیا جا سکتا ہے)۔";
nasai.hukam = "حسن";
nasai.description = ``;