var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي إِسْحَاقَ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَبَقَ الْعَبْدُ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ»";
nasai.urdu = "حضرت جریر رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جب غلام بھاگ کر مشرکین کے علاقے میں چلا جائے تو اس کا خون بہانا جائز ہو جاتا ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `[4057۔4061] إسنادہ ضعیف<br>ابو داود (4360)`;
nasai.anwaar = [351,1];