var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ: حَدَّثَنَا قَاسِمٌ قَالَ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ أَبِي إِسْحَاقَ،عَنْ جَرِيرٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَبَقَ الْعَبْدُ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ»";
nasai.urdu = "حضرت جریر رضی اللہ تعالٰی عنہ سے منقول ہے کہ نبی اکرمﷺ نے فرمایا: ’’جب کوئی غلام بھاگ کر کفار کے علاقے میں چلا جائے تو اس کا خون بہانا حلال ہو جاتا ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `[4057۔4061] إسنادہ ضعیف<br>ابو داود (4360)`;
nasai.anwaar = [351,1];