var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاقَ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرٍ قَالَ: «أَيُّمَا عَبْدٍ أَبَقَ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ»";
nasai.urdu = "حضرت جریر رضی اللہ تعالٰی عنہ سے مروی ہے کہ جو غلام بھاگ کر کافروں کے علاقے میں چلا جائے اس کا خون حلال ہو جاتا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `[4057۔4061] إسنادہ ضعیف<br>ابو داود (4360)`;
nasai.anwaar = [351,1];