var nasai = {};
nasai.arabic = "أَخْبَرَنِي صَفْوَانُ بْنُ عَمْرٍو قَالَ: حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ قَالَ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ أَبِي إِسْحَاقَ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرٍ قَالَ: «أَيُّمَا عَبْدٍ أَبَقَ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ»";
nasai.urdu = "حضرت جریر رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ جو غلام بھاگ کر مشرکوں کے علاقے میں چلا جائے،اس کا خون بہانا جائز ہو جاتا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `[4057۔4061] إسنادہ ضعیف<br>ابو داود (4360)`;
nasai.anwaar = [351,1];