var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُؤَمَّلُ بْنُ إِهَابٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَخْبَرَنِي ابْنُ جُرَيْجٍ،عَنْ أَبِي النَّضْرِ،عَنْ بُسْرِ بْنِ سَعِيدٍ،عَنْ عُثْمَانَ بْنِ عَفَّانَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِثَلَاثٍ: أَنْ يَزْنِيَ بَعْدَ مَا أُحْصِنَ،أَوْ يَقْتُلَ إِنْسَانًا فَيُقْتَلَ،أَوْ يَكْفُرَ بَعْدَ إِسْلَامِهِ فَيُقْتَلَ";
nasai.urdu = "حضرت عثمان بن عفان رضی اللہ تعالٰی عنہ سے مروی ہے کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’تین جرائم کے بغیر کسی مسلمان کا خون بہانا جائز نہیں: وہ شادی شدہ ہونے کے بعد زنا کرے یا کسی انسان کو قتل کرے تو اسے قتل کیا جائے گا۔یا مسلمان ہونے کے بعد کافر بن جائے تو اسے بھی قتل کیا جائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;