var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ: أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ: أَنْبَأَنَا إِسْمَاعِيلُ،عَنْ مَعْمَرٍ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’جو مسلمان اپنا دین بدل لے،اسے قتل کر دو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;