var nasai = {};
nasai.arabic = "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ بْنِ زُرَارَةَ قَالَ: حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ قَالَ: حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمای: ’’جو مسلمان اپنا دین بدل لے،اسے قتل کر دو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;