var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ سِتِّيرٌ فَإِذَا أَرَادَ أَحَدُكُمْ أَنْ يَغْتَسِلَ فَلْيَتَوَارَ بِشَيْءٍ";
nasai.urdu = "حضرت یعلی ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’یقیناً اللہ تعالیٰ بہت پردے والا ہے۔جب تم میں سے کوئی غسل کرنے کا ارادہ کرے تو کسی چیز کی اوٹ میں چھپ جائے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;