var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ تَوْبَةَ الْعَنْبَرِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ قُدَامَةَ بْنِ عَنَزَةَ،عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَ: أَغْلَظَ رَجُلٌ لِأَبِي بَكْرٍ الصِّدِّيقِ،فَقُلْتُ: أَقْتُلُهُ،فَانْتَهَرَنِي وَقَالَ: «لَيْسَ هَذَا لِأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
nasai.urdu = "حضرت ابو برزہ اسلمی رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ ایک آدمی نے حضرت ابوبکر صدیق رضی اللہ تعالٰی عنہ کے بارے میں کوئی بکواس بکا۔میں نے کہا: میں اسے قتل کر دوں؟ انہوں نے مجھے ڈانٹا اور فرمایا: رسول اللہﷺ کے بعد یہ کسی کا حق نہیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;