var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،عَنْ يَحْيَى بْنِ حَمَّادٍ قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ سُلَيْمَانَ،عَنْ عَمْرِو بْنِ مُرَّةَ،عَنْ أَبِي الْبَخْتَرِيِّ،عَنْ أَبِي بَرْزَةَ قَالَ: تَغَيَّظَ أَبُو بَكْرٍ عَلَى رَجُلٍ،فَقَالَ: لَوْ أَمَرْتَنِي لَفَعَلْتُ؟ قَالَ: «أَمَا وَاللَّهِ مَا كَانَتْ لِبَشَرٍ بَعْدَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
nasai.urdu = "حضرت ابوبرزہ رضی اللہ تعالٰی عنہ سے مروی ہے کہ حضرت ابوبکر رضی اللہ تعالٰی عنہ کسی آدمی پر بہت ناراض ہوئے۔میں نے کہا: اگر آپ مجھے حکم دیں تو میں کر گزروں (اسے قتل کر دوں)۔انہوں نے فرمایا: اللہ کی قسم! حضرت محمدﷺ کے بعد کسی انسان کو یہ حق حاصل نہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;