var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبِيدَةُ عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ قَالَتْ وَضَعْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاءً قَالَتْ فَسَتَرْتُهُ فَذَكَرَتْ الْغُسْلَ قَالَتْ ثُمَّ أَتَيْتُهُ بِخِرْقَةٍ فَلَمْ يُرِدْهَا";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہا (ام المومنین) فرماتی ہیں کہ میں نے اللہ کے رسول ﷺ کے (غسل کے) لیے پانی رکھا،پھر میں نے آپ کو پردہ کیا۔چنانچہ آپ نے غسل فرمایا،پھر میں آپ کے پاس (جسم کی صفائی کے لیے) ایک کپڑا لائی۔آپ نے اس کی ضرورت محسوس نہ کی۔";
nasai.hukam = "صحیح";
nasai.description = ``;