var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا أَبُو دَاوُدَ قَالَ: حَدَّثَنَا عَبَّادُ بْنُ مَيْسَرَةَ الْمَنْقَرِيُّ،عَنْ الْحَسَنِ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «مَنْ عَقَدَ عُقْدَةً،ثُمَّ نَفَثَ فِيهَا فَقَدْ سَحَرَ،وَمَنْ سَحَرَ فَقَدْ أَشْرَكَ،وَمَنْ تَعَلَّقَ شَيْئًا وُكِلَ إِلَيْهِ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جس نے گرہ باندھی اور اس میں (پڑھ کر) پھونکا،اس نے جادو کیا۔اور جس نے دجادو کیا،اس نے شرک کیا اور جس شخص نے کوئی (شرکیہ) چیز گلے میں لٹکائی،اسے اسی کے سپرد کیا جائے گا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>الحسن عنعن۔<br>ولبعض الحدیث شواہد۔`;
nasai.anwaar = [351,1];