var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا خَالِدٌ قَالَ: حَدَّثَنَا حَاتِمٌ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ قَاتَلَ دُونَ مَالِهِ فَقُتِلَ فَهُوَ شَهِيدٌ»";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’جو اپنے مال کو (ڈاکوؤں وغیرہ سے) بچانے کے لیے لڑائی کرے او مارا جائے تو وہ شہید ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;