var nasai = {};
nasai.arabic = "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ النَّيْسَابُورِيُّ قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ قَالَ: حَدَّثَنَا سَعِيدٌ قَالَ: أَنْبَأَنَا أَبُو الْأَسْوَدِ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ عِكْرِمَةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ دُونَ مَالِهِ مَظْلُومًا فَلَهُ الْجَنَّةُ»";
nasai.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جو اپنے مال کی حفاظت میں مظلوم مارا جائے،اس کے لیے جنت ہے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;