var nasai = {};
nasai.arabic = "أَخْبَرَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ الْهُذَيْلِ قَالَ: حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ قَالَ: حَدَّثَنَا سُعَيْرُ بْنُ الْخِمْسِ،عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ،عَنْ عِكْرِمَةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ»";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص اپنے مال کی حفاظت کرتا ہوا مارا جائے،وہ شہید ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;