var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا سُفْيَانُ قَالَ: حَدَّثَنِي عَبْدُ اللَّهِ بْنُ حَسَنٍ،عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ،أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو يُحَدِّثُ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أُرِيدَ مَالُهُ بِغَيْرِ حَقٍّ فَقَاتَلَ فَقُتِلَ فَهُوَ شَهِيدٌ» هَذَا خَطَأٌ وَالصَّوَابُ حَدِيثُ سُعَيْرِ بْنِ الْخِمْسِ";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ بیان فرماتے ہیں کہ نبیٔ اکرمﷺ نے فرمایا: ’’جس شخص کا مال ناحق چھیننے کی کوشش کی جائے اور وہ لڑتا ہوا مارا جائے تو وہ شہید ہو گا۔‘‘\n(امام نسائی رحمہ اللہ نے فرمایا:) یہ (روایت) غلط ہے۔سعیر بن خمس کی (اس سے پہلی) روایت درست ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;