var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ طَلْحَةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ»";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص اپنے مال کی حفاظت کرتا ہوا مارا جائے،وہ شہید ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;