var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ،وَقُتَيْبَةُ،وَاللَّفْظُ لِإِسْحَاقَ،قَالَا: أَنْبَأَنَا سُفْيَانُ،عَنْ الزُّهْرِيِّ،عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ،عَنْ سَعِيدِ بْنِ زَيْدٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ»مختصر";
nasai.urdu = "حضرت سعید بن زید رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو شخص اپنے مال کی حفات کرتا ہوا مارا جائے،وہ شہید ہے۔‘‘ یہ (حدیث) مختصر ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;