var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَلْقَمَةَ،عَنْ أَبِي جَعْفَرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قُتِلَ دُونَ مَظْلَمَتِهِ فَهُوَ شَهِيدٌ» قَالَ أَبُو عَبْدِ الرَّحْمَنِ: «حَدِيثُ الْمُؤَمَّلِ خَطَأٌ،وَالصَّوَابُ حَدِيثُ عَبْدِ الرَّحْمَنِ»";
nasai.urdu = "حضرت ابو جعفر سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی ظالم کے مقابلے میں مارا جائے،وہ شہید ہے۔‘‘\nامام ابو عبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ مؤمل کی (سابقہ) حدیث غلط ہے جبکہ عبدالرحمٰن کی (یہی) حدیث درست ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;