var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنْ أَبِيهِ،عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدٍ،عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ،عَنْ سَعِيدِ بْنِ زَيْدٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَاتَلَ دُونَ مَالِهِ فَقُتِلَ فَهُوَ شَهِيدٌ،وَمَنْ قَاتَلَ دُونَ دَمِهِ فَهُوَ شَهِيدٌ،وَمَنْ قَاتَلَ دُونَ أَهْلِهِ فَهُوَ شَهِيدٌ»";
nasai.urdu = "حضرت سعید بن زید رضی اللہ تعالٰی عنہ سے منقول ہے کہ نبیٔ اکرمﷺ نے فرمایا: ’’جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے،وہ شہید ہے اور جو اپنی جان بچاتے ہوئے مارا جائے،وہ بھی شہید ہے او جو شخص اپنے گھر والوں کے دفاع میں مارا جائے،وہ بھی شہید ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;