var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ فِي الْإِنَاءِ وَهُوَ الْفَرَقُ وَكُنْتُ أَغْتَسِلُ أَنَا وَهُوَ مِنْ إِنَاءٍ وَاحِدٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کے رسول ﷺ ایک فرق (برتن) سے غسل فرمایا کرتے تھے،نیز میں اور آپ ایک ہی برتن سے غسل کرلیا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;