var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ قَالَ: حَدَّثَنَا عَبْثَرٌ،عَنْ مُطَرِّفٍ،عَنْ سَوَادَةَ بْنِ أَبِي الْجَعْدِ،عَنْ أَبِي جَعْفَرٍ قَالَ: كُنْتُ جَالِسًا عِنْدَ سُوَيْدِ بْنِ مُقَرِّنٍ فَقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قُتِلَ دُونَ مَظْلَمَتِهِ فَهُوَ شَهِيدٌ»";
nasai.urdu = "حضرت ابو جعفر رحمہ اللہ بیان کرتے ہیں کہ میں حضرت سوید بن مقرن رضی اللہ تعالٰی عنہ کے پاس بیٹھا تھا۔انہوں نے کہا کہ رسول اللہﷺ نے فرمایا: ’’جو شخص اپنے حق کی خاطر (لڑتا ہوا) مارا جائے،وہ شہید ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;