var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ: أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى قَالَ: حَدَّثَنَا مَعْمَرٌ،عَنْ ابْنِ طَاوُسٍ،عَنْ أَبِيهِ،عَنْ ابْنِ الزُّبَيْرِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَهَرَ سَيْفَهُ ثُمَّ وَضَعَهُ فَدَمُهُ هَدَرٌ»";
nasai.urdu = "حضرت ابن زبیر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص توار میان سے نکال کر لوگوں پر چلانی شروع کر دے،اس کا خون ضائع ہے۔‘‘ (اس کا قتل جائز ہے۔اس کی کوئی دیت ہو گی نہ قصاص۔)";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;