var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ: أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي مَالِكٌ،وَعَبْدُ اللَّهِ بْنُ عُمَرَ،وَأُسَامَةُ بْنُ زَيْدٍ،وَيُونُسُ بْنُ يَزِيدَ،أَنَّ نَافِعًا،أَخْبَرَهُمْ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا»";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ نبیٔ اکرمﷺ نے فرمایا: ’’جو شخص ہم (مسلمانوں) پر ہتھیار اٹھائے،وہ ہم میں سے نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;