var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ: أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ: حَدَّثَنَا مَعْمَرٌ،عَنْ أَبِي إِسْحَاقَ،عَنْ عُمَرَ بْنِ سَعْدٍ قَالَ: حَدَّثَنَا سَعْدُ بْنُ أَبِي وَقَّاصٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قِتَالُ الْمُسْلِمِ كُفْرٌ،وَسِبَابُهُ فُسُوقٌ»";
nasai.urdu = "حضرت سعد بن ابو وقاص رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’مسلمان سے لڑنا کفر اور اسے گالی دینا فسق (کبیرہ گناہ) ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;