var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ هِشَامٍ ح و أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ وَأَنَا مِنْ إِنَاءٍ وَاحِدٍ نَغْتَرِفُ مِنْهُ جَمِيعًا وَقَالَ سُوَيْدٌ قَالَتْ كُنْتُ أَنَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ اللہ کے رسول ﷺ اور میں ایک یہ برتن سے غسل کیا کرتے تھے۔ہم اکٹھے پانی کے چلو لیتے تھے۔حضرت سوید نے اپنی حدیث میں کہا: [کنت انا]";
nasai.hukam = "صحیح";
nasai.description = ``;