var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ شُعْبَةَ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ قَالَ: «سِبَابُ الْمُسْلِمِ فِسْقٌ،وَقِتَالُهُ كُفْرٌ» فَقَالَ لَهُ أَبَانُ: يَا أَبَا إِسْحَاقَ،أَمَا سَمِعْتَهُ إِلَّا مِنْ أَبِي الْأَحْوَصِ؟ قَالَ: بَلْ،سَمِعْتُهُ مِنَ الْأَسْوَدِ وَهُبَيْرَةَ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ تعالٰی عنہ نے فرمایا: مسلمان کو گالی دینا فسق (کبیرہ گناہ) ہے اور اس سے لڑنا کفر ہے۔ابان نے (ابو اسحاق سے) پوچھا: ابو اسحاق! آپ نے یہ حدیث صرف ابو الاحوص سے سنی ہے؟ انہوں نے کہا: (نہیں) بلکہ اسود اور ہبیرہ سے بھی میں نے یہ حدیث سنی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;