var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ: حَدَّثَنَا أَبِي قَالَ: سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ عُمَيْرٍ يُحَدِّثُهُ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِيهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «سِبَابُ الْمُسْلِمِ فُسُوقٌ،وَقِتَالُهُ كُفْرٌ»";
nasai.urdu = "حضرت عبداللہ رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’مسلمان کو گالی دینا فسق ہے اور اس سے لڑائی کرنا کفر ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;