var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ زُبَيْدٍ،عَنْ أَبِي وَائِلٍ،عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سِبَابُ الْمُسْلِمِ فُسُوقٌ،وَقِتَالُهُ كُفْرٌ» قُلْتُ لِأَبِي وَائِلٍ سَمِعْتَهُ مِنْ عَبْدِ اللَّهِ قَالَ: «نَعَمْ»";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’مسلمان کا گالی دینا فسق اور اس کا (دوسرے مسلمانوں سے) لڑائی کرنا کفر ہے۔‘‘ زبید کہتے ہیں: میں نے ابو وائل سے پوچھا: کیا آپ نے اس حدیث کو عبداللہ بن مسعود رضی اللہ تعالٰی عنہ سے سنا ہے؟ انہوں نے فرمایا: ہاں! (سنا ہے)۔";
nasai.hukam = "حسن";
nasai.description = ``;