var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا أَبُو دَاوُدَ،عَنْ شُعْبَةَ قَالَ: أَخْبَرَنِي مَنْصُورٌ،قَالَ: سَمِعْتُ رِبْعِيًّا يُحَدِّثُ،عَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَشَارَ الْمُسْلِمُ عَلَى أَخِيهِ الْمُسْلِمِ بِالسِّلَاحِ فَهُمَا عَلَى جُرُفِ جَهَنَّمَ،فَإِذَا قَتَلَهُ خَرَّا جَمِيعًا فِيهَا»";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جب کوئی مسلمان اپنے بھائی کی طرف اسلحے کے ساتھ اشارہ کرے (ایک مسلمان دوسرے پر ہتھیار اٹھا لے اور دوسرا بھی اٹھا لے) تو وہ دونوں جہنم کے کنارے پر ہوتے ہیں۔اور جب ایک،دوسرے کو قتل کر دے تو دونوں اکٹھے جہنم میں گر پڑتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;