var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا يَعْلَى قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ مَنْصُورٍ،عَنْ رِبْعِيٍّ،عَنْ أَبِي بَكْرَةَ قَالَ: «إِذَا حَمَلَ الرَّجُلَانِ الْمُسْلِمَانِ السِّلَاحَ أَحَدُهُمَا عَلَى الْآخَرِ،فَهُمَا عَلَى جُرُفِ جَهَنَّمَ،فَإِذَا قَتَلَ أَحَدُهُمَا الْآخَرَ فَهُمَا فِي النَّارِ»";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ تعالٰی عنہ سے مروی ہے کہ جب دو مسلمان ایک دوسرے پر اسلحے کے ساتھ حملہ کریں،وہ دونوں جہنم کے کنارے پر ہوتے ہیں۔پھر جب ان میں سے کوئی ایک،دوسرے کو قتل کر دیتا ہے تو دونوں آگ میں جاتے ہیں۔(قاتل تو مسلمان کو قتل کرنے کی وجہ سے اور مقتول اس لیے کہ اس کی نیت بھی مسلمان کو قتل کرنے ہی کی تھی۔)";
nasai.hukam = "حسن";
nasai.description = ``;