var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا الْخَلِيلُ بْنُ عُمَرَ بْنِ إِبْرَاهِيمَ قَالَ: حَدَّثَنِي أَبِي قَالَ: حَدَّثَنِي قَتَادَةُ،عَنْ الْحَسَنِ،عَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا،فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ،فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ»";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ تعالٰی عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’جب دو مسلمان تلواریں لے کر مقابلہ کرنے لگیں،پھر ان میں سے ایک دوسرے کو قتل کر دے تو قاتل اور مقتول دونوں آگ میں جائیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;