var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ،عَنْ حَمَّادٍ،عَنْ أَيُّوبَ،وَيُونُسَ،وَالْعَلَاءِ بْنِ زِيَادٍ،عَنْ الْحَسَنِ،عَنْ الْأَحْنَفِ بْنِ قَيْسٍ،عَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا،فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ،فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ»";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جب دو مسلمان تلواریں لے کر ایک دوسرے سے لڑنے لگیں،پھر ان میں سے ایک دوسرے کو مار دے تو قاتل اور مقتول دونوں آگ میں جائیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;