var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ لَقَدْ رَأَيْتُنِي أُنَازِعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِنَاءَ أَغْتَسِلُ أَنَا وَهُوَ مِنْهُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں،مجھے اچھی طرح یاد ہے کہ میں اللہ کے رسول ﷺ سے برتن کے سلسلے میں چھینا جھپٹی کرتی تھی،ہم دونوں اس سے غسل کررہے ہوتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;