var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ وَاقِدِ بْنِ مُحَمَّدِ بْنِ زَيْدٍ،أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُ،عَنْ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَرْجِعُوا بَعْدِي كُفَّارًا،يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی گردنیں کاٹنے لگو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;