var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ: حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ قَالَ: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ الْأَعْمَشِ،عَنْ مُسْلِمٍ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَرْجِعُوا بَعْدِي كُفَّارًا،يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ،وَلَا يُؤْخَذُ الرَّجُلُ بِجَرِيرَةِ أَبِيهِ،وَلَا بِجَرِيرَةِ أَخِيهِ»";
nasai.urdu = "حضرت عبداللہ رضی اللہ تعالٰی عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی گردنیں اتارنے لگو۔کسی آدمی کو اس کے باپ یا بھائی کے جرم میں نہیں پکڑا جا سکتا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;