var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ الْأَعْمَشِ،عَنْ مُسْلِمٍ،عَنْ مَسْرُوقٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا أُلْفِيَنَّكُمْ تَرْجِعُونَ بَعْدِي كُفَّارًا،يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ،لَا يُؤْخَذُ الرَّجُلُ بِجَرِيرَةِ أَبِيهِ،وَلَا بِجَرِيرَةِ أَخِيهِ» هَذَا الصَّوَابُ";
nasai.urdu = "حضرت مسروق سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’میں تمہیں اس حال میں نہ پائوں کہ تم میرے بعد کافر بن جائو اور ایک دوسرے کی گردنیں کاٹو۔کسی شخص کو اس کے باپ یا بھائی کے جرم میں گرفتار نہ کیا جائے گا۔‘‘\nیہ (مرسل روایت،موصول کی نسبت) درست ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;