var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عُبَيْدَةَ بْنُ أَبِي السَّفَرِ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ،عَنْ قَيْسٍ قَالَ: بَلَغَنِي أَنَّ جَرِيرَ بْنَ عَبْدِ اللَّهِ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اسْتَنْصِتِ النَّاسَ» ثُمَّ قَالَ: «لَا أُلْفِيَنَّكُمْ بَعْدَ مَا أَرَى تَرْجِعُونَ بَعْدِي كُفَّارًا،يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ»";
nasai.urdu = "حضرت جریر بن عبداللہ بجلی رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے مجھ سے فرمایا: ’’لوگوں کو چپ کرائو۔‘‘ پھر آپ نے فرمایا: ’’(اے لوگو!) تمہیں مسلمان دیکھنے کے بعد میں تمہیں اس حال میں نہ پائوں کہ تم میرے بعد کافر بن جائو اور ایک دوسرے کی گردنیں کاٹنے لگو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;