var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ: حَدَّثَنَا مَحْبُوبٌ قَالَ: أَنْبَأَنَا أَبُو إِسْحَاقَ،عَنْ مُطَرِّفٍ قَالَ: سُئِلَ الشَّعْبِيُّ،عَنْ سَهْمِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَصَفِيِّهِ،فَقَالَ: «أَمَّا سَهْمُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَكَسَهْمِ رَجُلٍ مِنَ الْمُسْلِمِينَ،وَأَمَّا سَهْمُ الصَّفِيِّ فَغُرَّةٌ تُخْتَارُ مِنْ أَيِّ شَيْءٍ شَاءَ»";
nasai.urdu = "حضرت مطرف سے منقول ہے کہ حضرت شعبی سے نبیٔ اکرمﷺ کے حصے اور آپ کے صَفِیّ (خاص حصے) کے بارے میں پوچھا گیا تو انہوں نے کہا: نبیﷺ کا (عام) حصہ تو ایک عام مسلمان آدمی کے حصے کے برابر تھا،البتہ صفی (خصوصی حصے) کے بارے میں آپ کو اختیار تھا کہ جو بھی پسندیدہ اور نفیس چیز آپ پسند فرماتے،لے سکتے تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2991)`;
nasai.anwaar = [352,1];