var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ: أَنْبَأَنَا اللَّيْثُ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ،عَنْ أَبِيهِ،أَنَّ عُبَادَةَ بْنَ الصَّامِتِ قَالَ: بَايَعْنَا رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْعُسْرِ وَالْيُسْرِ،وَذَكَرَ مِثْلَهُ";
nasai.urdu = "حضرت عبادہ بن صامتؓ بیان کرتے ہیں کہ ہم نے رسول اﷲﷺ سے بیعت کی کہ ہر آسانی اور تنگی میں آپ کی بات سنیںگے اور اطاعت کریں گے۔اور باقی روایت حسب سابق ذکر کی۔";
nasai.hukam = "صحیح";
nasai.description = ``;