var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا يَعْقُوبُ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَلَيْكَ بِالطَّاعَةِ فِي مَنْشَطِكَ وَمَكْرَهِكَ،وَعُسْرِكَ وَيُسْرِكَ،وَأَثَرَةٍ عَلَيْكَ»";
nasai.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ رسول اﷲﷺ نے فرمایا:’’(اے ابوہریرہ!) تو اپنی پسند و ناپسند اور ہر تنگی وآسانی میں امیر کی اطاعت پر کار بند رہنا اگرچہ تجھ پر دوسروں کو ترجیح دی جائے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;