var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا ابْنُ عُلَيَّةَ،عَنْ يُونُسَ،عَنْ عَمْرِو بْنِ سَعِيدٍ،عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ،قَالَ جَرِيرٌ: «بَايَعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ،وَأَنْ أَنْصَحَ لِكُلِّ مُسْلِمٍ»";
nasai.urdu = "حضرت جریرؓ نے فرمایا:میں نے رسول اﷲﷺ کی اس بات پر بیعت کی کہ آپ کی بات سنوں گا اور مانوں گا اور ہر مسلمان سے خیر خواہی کروں گا۔";
nasai.hukam = "صحیح";
nasai.description = ``;