var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ قَالَ: قُلْتُ لِسَلَمَةَ بْنِ الْأَكْوَعِ،عَلَى أَيِّ شَيْءٍ بَايَعْتُمُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ؟ قَالَ: «عَلَى الْمَوْتِ»";
nasai.urdu = "حضرت یزیدبن ابی عبید سے منقول ہے کہ میں نے حضرت سلمہ بن اکوعؓ سے پوچھا کہ حدیبیہ کے دن تم (یعنی صحابہ)نے کس بات پر بنی اکرمﷺ سے بیعت کی تھی؟انھوں نے فرمایا:موت پر۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;