var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ عَطَاءِ بْنِ السَّائِبِ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي جِئْتُ أُبَايِعُكَ عَلَى الْهِجْرَةِ،وَلَقَدْ تَرَكْتُ أَبَوَيَّ يَبْكِيَانِ قَالَ: «ارْجِعْ إِلَيْهِمَا فَأَضْحِكْهُمَا كَمَا أَبْكَيْتَهُمَا»";
nasai.urdu = "حضرت عبداﷲ بن عمروؓسے روایت ہے کہ ایک آدمی نبی اکرمﷺ کے پاس حاضر ہوااور کہنے لگا کہ میں آپ سے ہجرت پر بیعت کرنے آیا ہوں جبکہ میں اپنے ماں باپ کو روتا چھوڑ آیا ہوں۔آپ نے فرمایا:’’ان کے پاس واپس جااور جیسے تو نے انھیں رلایا ہے اسی طرح انھیں ہنسا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;