var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ،عَنْ مُحَمَّدٍ وَهُوَ ابْنُ عِيسَى بْنِ سُمَيْعٍ قَالَ: حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ،عَنْ كَثِيرِ بْنِ مُرَّةَ،أَنَّ أَبَا فَاطِمَةَ حَدَّثَهُ،أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ،حَدِّثْنِي بِعَمَلٍ أَسْتَقِيمُ عَلَيْهِ وَأَعْمَلُهُ،قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكَ بِالْهِجْرَةِ،فَإِنَّهُ لَا مِثْلَ لَهَا»";
nasai.urdu = "حضرت ابو فاطمہ ؓ سے منقول ہے کہ انھوں نے کہا:اے اﷲ کے رسول!مجھے کوئی ایسا کام بتایئے جس پر میں قائم رہوں اور اسے جاری رکھوں۔آپ نے فرمایا:’’ہجرت کر۔(اس وقت تیرے حق میں) اس کے برابر کوئی اور کام نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;