var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ،عَنْ أَبِيهِ،عَنْ جَدِّهِ قَالَ: حَدَّثَنِي عُقَيْلٌ،عَنْ ابْنِ شِهَابٍ،عَنْ عَمْرِو بْنِ عَبْدِ الرَّحْمَنِ بْنِ أُمَيَّةَ،أَنَّ أَبَاهُ أَخْبَرَهُ،أَنَّ يَعْلَى قَالَ: جِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِأَبِي يَوْمَ الْفَتْحِ،فَقُلْتُ: يَا رَسُولَ اللَّهِ،بَايِعْ أَبِي عَلَى الْهِجْرَةِ،قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أُبَايِعُهُ عَلَى الْجِهَادِ» وَقَدِ انْقَطَعَتِ الْهِجْرَةُ";
nasai.urdu = "حضرت یعلیٰؓ بیان کرتے ہیں کہ میں کے پاس حاضر ہوا اورمیں نے کہا:اے اﷲ کے رسول! میرے والد سے ہجرت کی بیعت لے لیجیے۔رسول اﷲﷺ نے فرمایا:’’میں ان سے جہاد کی بیعت لیتا ہوں۔ہجرت تو اب ختم ہو چکی ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (4165)`;
nasai.anwaar = [352,1];