var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ سُفْيَانَ قَالَ: حَدَّثَنِي مَنْصُورٌ،عَنْ مُجَاهِدٍ،عَنْ طَاوُسٍ،عَنْ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ: «لَا هِجْرَةَ،وَلَكِنْ جِهَادٌ وَنِيَّةٌ،فَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا»";
nasai.urdu = "حضرت ابن عباسؓ سے روایت ہے کہ بیعت سے متعلق احکام ومسائل رسول اﷲﷺ نے فتح مکہ کے دن فرمایا:‘‘ اب (مکہ سے) ہجرت کرنے کی ضرورت نہیں‘ البتہ جہاد کرو اور نیت رکھو۔جب تم سے جہاد کے لیے گھروں سے نکلنے کو کہا جائے تو نکلنے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;