var nasai = {};
nasai.arabic = "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ قَالَ: حَدَّثَنَا غُنْدَرٌ،عَنْ شُعْبَةَ،عَنْ سُلَيْمَانَ،عَنْ أَبِي وَائِلٍ،عَنْ جَرِيرٍ قَالَ: «بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى إِقَامِ الصَّلَاةِ،وَإِيتَاءِ الزَّكَاةِ،وَالنُّصْحِ لِكُلِّ مُسْلِمٍ،وَعَلَى فِرَاقِ الْمُشْرِكِ»";
nasai.urdu = "حضرت جریر رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ میں نے رسول اﷲﷺ کی بیعت کی نماز قائم کرنے،زکاۃ ادا کرنے،ہر مسلمان کی خیر خواہی کرنے اور مشرکین سے علیحدہ رہنے پر۔";
nasai.hukam = "صحیح";
nasai.description = ``;