var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ: حَدَّثَنَا هُشَيْمٌ،عَنْ يَعْلَى بْنِ عَطَاءٍ،عَنْ رَجُلٍ مِنْ آلِ الشَّرِيدِ يُقَالُ لَهُ عَمْرٌو،عَنْ أَبِيهِ قَالَ: كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ،فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «ارْجِعْ فَقَدْ بَايَعْتُكَ»";
nasai.urdu = "آل شرید کے ایک شخص عمرو کے والد سے بیعت سے متعلق احکام ومسائل روایت ہے کہ بنو ثقیف کے وفد میں ایک کوڑھی شخص بھی آیا تھا۔بنی اکرمﷺ نے اسے پیغام بھیجا: ’’واپس چلے جاؤ (میرے پاس آنے کی ضرورت نہیں) میں نے تیری بیعت قبول کرلی ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;