var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ: حَدَّثَنَا عُمَرُ بْنُ يُونُسَ،عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ،عَنْ الْهِرْمَاسِ بْنِ زِيَادٍ قَالَ: مَدَدْتُ يَدِي إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا غُلَامٌ لِيُبَايِعَنِي: «فَلَمْ يُبَايِعْنِي»";
nasai.urdu = "حضرت ہر ماس بن زیاد رضی اللہ تعالٰی عنہ سے روایت ہے کہ میں نے (بیعت کے لیے) اپنا ہاتھ نبی اکرمﷺ کی طرف بڑھایا جبکہ میں اس وقت (نابالغ) بچہ تھا۔آپﷺ نے مجھ سے بیعت نہیں لی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;