var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ،عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ،أَنَّهُ دَخَلَ عَلَى الْحَجَّاجِ فَقَالَ: يَا ابْنَ الْأَكْوَعِ،ارْتَدَدْتَ عَلَى عَقِبَيْكَ،-وَذَكَرَ كَلِمَةً مَعْنَاهَا وَبَدَوْتَ-قَالَ: لَا،وَلَكِنَّ «رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَذِنَ لِي فِي الْبُدُوِّ»";
nasai.urdu = "حضرت سلمہ بن اکوع رضی اللہ تعالٰی عنہ جحاج کے پاس تشریف لے گئے۔اس نے کہا: اے ابن اکوع! تم مرتد ہوگئے ہو اور ایک کلمہ کہا جس کے معنی تھے کہ(مدینہ چھوڑ کر) بادیہ میں رہنے لگے ہو؟ انھوں نے فرمایا: نہیں بلکہ رسول اﷲﷺ نے مجھے(اپنے بعد) بادیہ میں رہنے کی اجازت دی تھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;