var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،ح وأَخْبَرَنِي عَلِيُّ بْنُ حُجْرٍ،عَنْ إِسْمَاعِيلَ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ ابْنِ عُمَرَ قَالَ: كُنَّا نُبَايِعُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ ثُمَّ يَقُولُ: «فِيمَا اسْتَطَعْتَ» وَقَالَ عَلِيٌّ: فِيمَا اسْتَطَعْتُمْ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہا بیان کرتے ہین کہ ہم رسول اﷲﷺ کی بیعت کیا کرتے تھے کہ آپ کی بات سنیں گے اور اطاعت کریں گے۔اﷲ کے رسولﷺ فرماتے کہ اپنی طاقت کے مطابق۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;