var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا حَجَّاجٌ،عَنْ ابْنِ جُرَيْجٍ قَالَ: أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ ابْنِ عُمَرَ قَالَ: كُنَّا حِينَ نُبَايِعُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا: «فِيمَا اسْتَطَعْتُمْ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہا سے مروی ہے،وہ بیان کرے ہیں کہ جب ہم سمع وطاعت پر رسول اﷲﷺ کی بیعت کرتے تو آپ ہمیں فرماتے تھے کہ تمھاری طاقت کے مطابق۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;