var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا هُشَيْمٌ قَالَ: حَدَّثَنَا سَيَّارٌ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ: بَايَعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ،فَلَقَّنَنِي «فِيمَا اسْتَطَعْتَ،وَالنُّصْحِ لِكُلِّ مُسْلِمٍ»";
nasai.urdu = "حضرت جریرین عبد اﷲ رضی اللہ تعالٰی عنہ نے فرمایا: میں نے سمع اور اطاعت پر رسول اﷲ کی بیعت کی تو آپ نے مجھے (یہ کہنے کی) تلقین فرمائی: ’’اپنی طاعت کے مطابق اور ہر مسلمان سے خیر خواہی کروں گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;