var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ قَالَتْ: بَايَعْنَا رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ،فَقَالَ لَنَا: «فِيمَا اسْتَطَعْتُنَّ،وَأَطَقْتُنَّ»";
nasai.urdu = "حضرت امیمہ بنت رقیقہ رضی اللہ عنہا فرماتی ہیں کہ ہم چند عورتوں نے رسول اﷲﷺ کی بیعت کی۔آپ نے ہمیں فرمایا: ’’تمھاری استطاعت اور طاقت کے مطابق (یہ بیعت تم پر لاگو ہوگی)۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;