var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا خَالِدٌ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ يَحْيَى بْنِ حُصَيْنٍ قَالَ: سَمِعْتُ جَدَّتِي تَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي حَجَّةِ الْوَدَاعِ: «وَلَوِ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ يَقُودُكُمْ بِكِتَابِ اللَّهِ فَاسْمَعُوا لَهُ وَأَطِيعُوا»";
nasai.urdu = "حضرت یحییٰ بن حصین سے روایت ہے کہ میں نے اپنی دادی سے سنا،وہ فرماتی تھیں: میں نے رسول اﷲﷺ کو حجۃ الوداع میں فرماتے سنا:ن ’’اگر تم پر ایک حبشی غلام امیر بنادیا جائے جو تمھیں اﷲ تعالیٰ کی کتاب (شریعت اسلامیہ) کے مطابق چلائے تو تم اس کی بات سنو اور اطاعت کرو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;