var nasai = {};
nasai.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ: أَنْبَأَنَا عَبْدُ الرَّحْمَنِ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ عَطَاءِ بْنِ يَزِيدَ،عَنْ تَمِيمٍ الدَّارِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الدِّينُ النَّصِيحَةُ» قَالُوا: لِمَنْ يَا رَسُولَ اللَّهِ؟ قَالَ: «لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ،وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ»";
nasai.urdu = "حضرت تمیم داری سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’دین تو ہے ہی اخلاص کا نام۔‘‘ صحابہ نے عرض کی: اے اللہ کے رسول! کس کے ساتھ اخلاص؟ آپ نے فرمایا: ’’اللہ تعالیٰ کے ساتھ،اس کی کتاب کے ساتھ،اس کے رسول کے ساتھ اور مسلمانوں کے حکام کے ساتھ اور عام مسلمانوں کے ساتھ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;