var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ الْأَشْعَثِ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي طُهُورِهِ وَتَنَعُّلِهِ وَتَرَجُّلِهِ وَقَالَ بِوَاسِطٍ فِي شَأْنِهِ كُلِّهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی ﷺ جہاں تک ممکن ہوتا اپنے وضو اور غسل فرماتے،جوتا پہننے،کنگھی کرنے میں دائیں طرف کو پسند فرماتے تھے۔(شعبہ نے کہا کہ میرے استاد اشعث نے کئی بار یہ حدیث بیان کی) اس نے واسط (شہر) میں (یہ حدیث بیان کی تو) کہا: (آپ ﷺ کو) تمام امور میں (دائیں جانب سے ابتدا کرنا پسند تھا)۔";
nasai.hukam = "صحیح";
nasai.description = ``;