var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَى الْمَرْءِ الْمُسْلِمِ السَّمْعُ وَالطَّاعَةُ فِيمَا أَحَبَّ وَكَرِهَ إِلَّا أَنْ يُؤْمَرَ بِمَعْصِيَةٍ،فَإِذَا أُمِرَ بِمَعْصِيَةٍ،فَلَا سَمْعَ وَلَا طَاعَةَ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’مسلمان شخص پر ضروری ہے کہ وہ امیر کی بات سنے اور اس کی اطاعت کرے،خواہ پسند کرتا ہو یا نہ۔الا یہ کہ اسے (اللہ اور اس کے رسول کی) نافرمانی اور گناہ والا حکم دیا جائے۔ایسی صورت میں نہ وہ امیر کی بات سنے،نہ اس کی اطاعت کرے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;