var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ،عَنْ سُفْيَانَ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنْ طَارِقِ بْنِ شِهَابٍ،أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَدْ وَضَعَ رِجْلَهُ فِي الْغَرْزِ،أَيُّ الْجِهَادِ أَفْضَلُ؟ قَالَ: «كَلِمَةُ حَقٍّ عِنْدَ سُلْطَانٍ جَائِرٍ»";
nasai.urdu = "حضرت طارق بن شہاب رضی اللہ تعالٰی عنہ سے روایت ہے کہ ایک آدمی نے نبیٔ اکرمﷺ سے پوچھا،جبکہ آپﷺ اپنا پائو مبارک رکاب میں رکھ چکے تھے: کون سا جہاد افضل ہے؟ آپ نے فرمایا: ’’ظالم بادشاہ کے سامنے حق بات کہنا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;