var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ،عَنْ ابْنِ الْمُبَارَكِ،عَنْ ابْنِ أَبِي ذِئْبٍ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّكُمْ سَتَحْرِصُونَ عَلَى الْإِمَارَةِ،وَإِنَّهَا سَتَكُونُ نَدَامَةً وَحَسْرَةً فَنِعْمَتِ الْمُرْضِعَةُ،وَبِئْسَتِ الْفَاطِمَةُ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبیٔ اکرم رضی اللہ عنہم نے فرمایا: ’’عن قریب تم لوگ امارت (اقتدار و سرداری) کی حرص کرو گے اور بلاشبہ یہ (قیامت کے دن) ندامت و شرمندگی اور حسرت و افسوس (کا سبب) ہو گی۔یہ دودھ پلاتے اچھی لگتی ہے مگر دودھ چھڑاتے ہوئے بری محسوس ہوتی ہے۔‘‘ (اس کی ابتدا اچھی معلوم ہوتی ہے لیکن انجام برا ہو گا۔)";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;