var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا عَفَّانُ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ: حَدَّثَنَا أَيُّوبُ،وَحَبِيبٌ،وَيُونُسُ،وَقَتَادَةُ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فِي الْغُلَامِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا،وَأَمِيطُوا عَنْهُ الْأَذَى»";
nasai.urdu = "حضرت سلمان بن عامر ضبی رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’بچے کی طرف سے عقیقہ ہونا چاہیے،لہٰذا جانور ذبح کرو اور بچے سے میل کچیل دور کرو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;