var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا عَفَّانُ قَالَ: حَدَّثَنَا حَمَّادٌ،عَنْ قَيْسِ بْنِ سَعْدٍ،عَنْ عَطَاءٍ،وَطَاوُسٍ،وَمُجَاهِدٍ،عَنْ أُمِّ كُرْزٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فِي الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ،وَفِي الْجَارِيَةِ شَاةٌ»";
nasai.urdu = "حضرت ام کرز رضی اللہ عنہا بیان کرتی ہیں کہ عقیقے سے متعلق احکام ومسائل رسول اﷲﷺ نے فرمایا: ’’لڑکے کی طرف سے دوکامل بکرے ذبح کیے جائیں اور لڑکی کی طرف سے ایک۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;