var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا سُفْيَانُ قَالَ: قَالَ عَمْرٌو عَنْ عَطَاءٍ،عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ،عَنْ أُمِّ كُرْزٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَنِ الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ،وَعَنِ الْجَارِيَةِ شَاةٌ»";
nasai.urdu = "حضرت ام کرز رضی اللہ عنہا سے منقول ہے کہ رسول اﷲﷺ نے فرمایا: ’’لڑکے کی طرف سے دو کامل بکرے ذبح کیے جائیں اور لڑکی کی طرف سے ایک۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;