var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عُبَيْدِ اللَّهِ وَهُوَ ابْنُ أَبِي يَزِيدَ،عَنْ سِبَاعِ بْنِ ثَابِتٍ،عَنْ أُمِّ كُرْزٍ قَالَتْ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحُدَيْبِيَةِ أَسْأَلُهُ عَنْ لُحُومِ الْهَدْيِ،فَسَمِعْتُهُ يَقُولُ: «عَلَى الْغُلَامِ شَاتَانِ،وَعَلَى الْجَارِيَةِ شَاةٌ،لَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا»";
nasai.urdu = "حضرت ام کرز رضی اللہ عنہا فرماتی ہیں کہ میں نبی اکرمﷺ کے پاس (حدیبیہ میں) حاضر ہوئی تاکہ آپ سے قربانی کے گوشت کے بارے میں پوچھوں۔میں آپ کو فرماتے سنا: ’’لڑکے کی طرف سے دو بکریاں اور عقیقے سے متعلق احکام ومسائل لڑکی کی طرف سے ایک بکری ذبح کرنا لازم ہے۔کوئی حرج نہیں‘ مذکر ہوں یا مئونث۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;