var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا يَحْيَى قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ: حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ،عَنْ سِبَاعِ بْنِ ثَابِتٍ،عَنْ أُمِّ كُرْزٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَنِ الْغُلَامِ شَاتَانِ،وَعَنِ الْجَارِيَةِ شَاةٌ لَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا»";
nasai.urdu = "حضرت ام کرز رضی اللہ عنہا سے روایت ہے کہ رسول اﷲﷺنے فرمایا: ’’لڑکے کی طرف سے دو بکریاں اور لڑکی کی طرف سے ایک بکری (عقیقہ میں) ذبح کی جائے۔وہ (عقیقے کے جانور) نر ہوں یا مادہ (بکرے ہوں یا بکریاں) کوئی حرج نہیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;