var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ قَالَ: حَدَّثَنِي أَبِي قَالَ: حَدَّثَنِي إِبْرَاهِيمُ هُوَ ابْنُ طَهْمَانَ،عَنْ الْحَجَّاجِ بْنِ الْحَجَّاجِ،عَنْ قَتَادَةَ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ قَالَ: «عَقَّ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْحَسَنِ وَالْحُسَيْنِ رَضِيَ اللَّهُ عَنْهُمَا بِكَبْشَيْنِ كَبْشَيْنِ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہا سے مروی ہے کہ رسول اﷲﷺ نے حضرت حسن اور حضرت حسین رضی اللہ عنہا کی طرف سے دو ددو مینڈھے عقیقے میں ذبح فرمائے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن وحدیث أبي داود (2841 وسندہ صحیح) یغني عنہ۔`;
nasai.anwaar = [352,1];