var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا: حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ،عَنْ سَعِيدٍ،أَنْبَأَنَا قَتَادَةُ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ غُلَامٍ رَهِينٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ رَأْسُهُ وَيُسَمَّى»";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اﷲﷺ نے فرمایا: ’’ہر بچہ اپنے عقیقے کے عوض گر وی ہوتاہے۔ساتویں دن اس کی طرف سے جانور ذبح کیا جائے،سر منڈویا جائے اور اس کا نام رکھاجائے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;