var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ،عَنْ حَبِيبِ بْنِ الشَّهِيدِ قَالَ لِي مُحَمَّدُ بْنُ سِيرِينَ: سَلِ الْحَسَنَ مِمَّنْ سَمِعَ حَدِيثَهُ فِي الْعَقِيقَةِ،فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ: سَمِعْتُهُ مِنْ سَمُرَةَ";
nasai.urdu = "حضرت حبیب بن شہید بیان کرتے ہیں کہ مجھے محمد بن سیرین نے کہا کہ حضرت حسن بصری سے پوچھو،انھوں سے عقیقے کے بارے میں یہ حدیث کس سنی ہے؟ میں ان سے پوچھا تو انھوں نے فرمایا: میں نے یہ روایت حضرت سمرہ(بن جندب) رضی اللہ تعالٰی عنہ سے سنی ہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;