var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا أَبُو دَاوُدَ قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: حَدَّثْتُ أَبَا إِسْحَاقَ،عَنْ مَعْمَرٍ،وَسُفْيَانَ،عَنْ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ قَالَ أَحَدُهُمَا: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْفَرَعِ،وَالْعَتِيرَةِ» وَقَالَ الْآخَرُ: «لَا فَرَعَ،وَلَا عَتِيرَةَ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اﷲﷺ نے فرع اور عتیرہ سے منع فرمایا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;