var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ: حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ مُعَاذٍ قَالَ: حَدَّثَنَا ابْنُ عَوْنٍ قَالَ: حَدَّثَنَا أَبُو رَمْلَةَ قَالَ: أَنْبَأَنَا مِخْنَفُ بْنُ سُلَيْمٍ قَالَ: بَيْنَا نَحْنُ وُقُوفٌ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَقَالَ: «يَا أَيُّهَا النَّاسُ،إِنَّ عَلَى أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أَضْحَاةً،وَعَتِيرَةً» قَالَ مُعَاذٌ: «كَانَ ابْنُ عَوْنٍ يَعْتِرُ أَبْصَرَتْهُ عَيْنِي فِي رَجَبٍ»";
nasai.urdu = "حضرت مخنف بن سلیم رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ ہم نبی اکرمﷺ کے ساتھ عرففہ میں وقوت کررہے تھے کہ آپ نے فرمایا: ’’اے لوگو‘‘ ہر گھر والوں پر ایک سال بعد قربانی بھی ہے اور عتیرہ بھی۔‘‘ (روی حدیث) معاذ کہتے ہیں کہ میری آنکھوں نے دیکھا کہ(عبداﷲ) ابن عون رجب میں عتیرہ (جانور) ذبح کرتے تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2788) ترمذی (1518) ابن ماجہ (3125)`;
nasai.anwaar = [353,1];