var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ ابْنِ عَوْنٍ قَالَ: حَدَّثَنَا جَمِيلٌ،عَنْ أَبِي الْمَلِيحِ،عَنْ نُبَيْشَةَ قَالَ: ذُكِرَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: كُنَّا نَعْتِرُ فِي الْجَاهِلِيَّةِ،قَالَ: «اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَيِّ شَهْرٍ مَا كَانَ،وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا»";
nasai.urdu = "حضرت نبیشہ رضی اللہ تعالٰی عنہ سے مروی ہے کہ نبی اکرمﷺ کے پاس ذکر کیا گیا کہ ہم زمانہ جاہلیت میں (ماہ رجب میں) جانور ذبح کیا کرتے تھے۔آپ نے فرمایا: ’’اﷲ تعالیٰ کے نام پر ذبح کروجس مہینے میں بھی اﷲ تعالیٰ کے لیے نیکی کرو۔اور (غریبوں کو) کھانا کھلایا کرو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;