var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ عَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اغْتَسَلَ مِنْ الْجَنَابَةِ دَعَا بِشَيْءٍ نَحْوِ الْحِلَابِ فَأَخَذَ بِكَفِّهِ بَدَأَ بِشِقِّ رَأْسِهِ الْأَيْمَنِ ثُمَّ الْأَيْسَرِ ثُمَّ أَخَذَ بِكَفَّيْهِ فَقَالَ بِهِمَا عَلَى رَأْسِهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انھوں نے فرمایا: اللہ کے رسول ﷺ جب غسل جنابت فرماتے تو اونٹنی کے دودھ والے برتن جیسا کوئی برتن منگواتے۔پھر اپنی ہتھیلی میں پانی لیتے،پہلے سر کی دائیں جانب ڈال لیتے،پھر بائیں جانب،پھر دونوں ہاتھوں میں پانی لیتے اور اپنے سر پر ڈالتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;