var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الْقَطَّانُ الرَّقِّيُّ قَالَ: حَدَّثَنَا حَجَّاجٌ قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ قَالَ: أَخْبَرَنِي عَطَاءٌ،مُنْذُ حِينٍ عَنْ ابْنِ عَبَّاسٍ،أَخْبَرَتْنِي مَيْمُونَةُ،أَنَّ شَاةً مَاتَتْ،فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَّا دَفَعْتُمْ إِهَابَهَا فَاسْتَمْتَعْتُمْ بِهِ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہا نے کہا: مجھے حضرت میمونہ رضی اللہ عنہا نے بتلایا کہ ایک بکری مرگئی تو نبیﷺ نے فرمایا: ’’تم نے اس کی کھال کو رنگ کیوں نہیں لیا کہ اس نے فائدہ اٹھاتے؟‘‘";
nasai.hukam = "حسن";
nasai.description = ``;