var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ،عَنْ سُفْيَانَ،عَنْ عَمْرٍو،عَنْ عَطَاءٍ قَالَ: سَمِعْتُ ابْنَ عَبَّاسٍ قَالَ: مَرَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ لِمَيْمُونَةَ مَيِّتَةٍ فَقَالَ: «أَلَّا أَخَذْتُمْ إِهَابَهَا فَدَبَغْتُمْ فَانْتَفَعْتُمْ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہا نے فرمایا: نبیﷺ کا گزر حضرت میمونہ رضی اللہ عنہا کی مردار بکری کے پاس سے ہوا تو آپ نے فرمایا: ’’تم نے اس کی کھال لے کر اسے رنگ کیوں نہیں لیا کہ اس فائدہ اٹھاتے؟‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;