var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ قَالَ: أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى،عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ،عَنْ الشَّعْبِيِّ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ،عَنْ سَوْدَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: مَاتَتْ شَاةٌ لَنَا «فَدَبَغْنَا مَسْكَهَا،فَمَا زِلْنَا نَنْبِذُ فِيهَا حَتَّى صَارَتْ شَنًّا»";
nasai.urdu = "نبی اکرمﷺ کی زوجہ مطہرہ حضرت سودہ رضی اللہ عنہا نے بیان کیا کہ ہماری ایک بکری مر گئی تو ہم نے اس کی کھال کو رنگ لیا،پھر ہم اس میں نبیذ بناتے رہے حتی کہ وہ مشک بن گئی۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;