var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ: حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ جَوْنِ بْنِ قَتَادَةَ،عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ،أَنَّ نَبِيَّ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ دَعَا بِمَاءٍ مِنْ عِنْدِ امْرَأَةٍ،قَالَتْ: مَا عِنْدِي إِلَّا فِي قِرْبَةٍ لِي مَيْتَةٍ،قَالَ: «أَلَيْسَ قَدْ دَبَغْتِهَا؟» قَالَتْ: بَلَى،قَالَ: «فَإِنَّ دِبَاغَهَا ذَكَاتُهَا»";
nasai.urdu = "حضرت سلمہ بن محبق رضی اللہ تعالٰی عنہ سیف روایت ہے کہ اﷲ تعالیٰ کے نبیﷺ نے غزوہ تبوک (کے سفر) میں ایک عورت کے پاس سے پانی منگوایا۔وہ کہنے لگی: میرے پاس پانی تو مگر مردار کے چمڑے سے بنے ہوئے مشکیزے میں ہے۔آپ نے فرمایا: ’’تو نے اسے دباغت نہیں دی تھی؟‘‘اس نے کہا: کی! دباغت تو دی تھی۔آپ نے فرمایا: ’’تو دباغت (رنگنے) سے چمڑا پاک ہو جاتا ہے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4125)`;
nasai.anwaar = [353,1];