var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ النَّيْسَابُورِيُّ قَالَ: حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ الْأَعْمَشِ،عَنْ عُمَارَةَ بْنِ عُمَيْرٍ،عَنْ الْأَسْوَدِ،عَنْ عَائِشَةَ قَالَتْ: سُئِلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ جُلُودِ الْمَيْتَةِ فَقَالَ: «دِبَاغُهَا طَهُورُهَا»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی اکرم سے مردار کے کچے چمڑے کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’دباغت (رنگنے) سے پاک ہو جاتا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;