var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ يَحْيَى عَنْ شُعْبَةَ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ ح وَأَنْبَأَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ صُرَدٍ يُحَدِّثُ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذُكِرَ عِنْدَهُ الْغُسْلُ فَقَالَ أَمَّا أَنَا فَأُفْرِغُ عَلَى رَأْسِي ثَلَاثًا لَفْظُ سُوَيْدٍ";
nasai.urdu = "حضرت جبیر بن مطعم رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ کے پاس غسل کا ذکر ہوا تو آپ نے فرمایا: ’’میں تو اپنے سر پر تین دفعہ پانی ڈالتا ہوں۔‘‘ یہ سوید کے لفظ ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;