var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ: حَدَّثَنَا عَمِّي قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ الْأَسْوَدِ،عَنْ عَائِشَةَ قَالَتْ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ جُلُودِ الْمَيْتَةِ،فَقَالَ: «دِبَاغُهَا ذَكَاتُهَا»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اﷲﷺ سے مردار کے چمڑے کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’دباغت چمڑے کو پاک کر دیتی ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;