var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ الْحَكَمِ،عَنْ ابْنِ أَبِي لَيْلَى،عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ،قَالَ: قُرِئَ عَلَيْنَا كِتَابُ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَأَنَا غُلَامٌ شَابٌّ: «أَنْ لَا تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ،وَلَا عَصَبٍ»";
nasai.urdu = "حضرت عبد اﷲ بن عکیم سے مروی ہے کہ میں اس وقت جوان لڑکا تھا جب ہمیں رسول اﷲﷺ کا خط پڑھ کر سنایا گیا کہ’’تم مردار کے چمڑے اور پٹھے سے فائدہ نہ اٹھاؤ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;