var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ: حَدَّثَنَا جَرِيرٌ،عَنْ مَنْصُورٍ،عَنْ الْحَكَمِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى،عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ قَالَ: كَتَبَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنْ لَا تَسْتَمْتِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ،وَلَا عَصَبٍ»";
nasai.urdu = "حضرت عبداﷲ بن عکیم سے روایت ہے کہ رسول اﷲﷺ نے ہمیں یہ تحریر لکھ کر بھیجی: ’’تم مردار کے چمڑے اور پٹھے سے فائدہ نہ اٹھاؤ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;