var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ: أَنْبَأَنَا بِشْرُ بْنُ عُمَرَ قَالَ: حَدَّثَنَا مَالِكٌ،ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ،عَنْ ابْنِ الْقَاسِمِ قَالَ: حَدَّثَنِي مَالِكٌ،عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ،عَنْ أُمِّهِ،عَنْ عَائِشَةَ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے منقول ہے کہ رسول اﷲﷺ نے حکم دیا کہ جب مردار کے چمڑے کو رنگ جائے تو اس سے فائدہ اٹھایا جاسکتا ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = `مشکوۃ المصابیح: 507
أم محمد بن عبد الرحمٰن بن ثوبان: وثقھا ابن حبان و ابن عبد البر و یعقوب بن سفیان الفارسي (المعرفۃ والتاریخ 349/1۔ 350، 425) فالسند حسن`;