var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ: حَدَّثَنَا بَقِيَّةُ،عَنْ بَحِيرٍ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنْ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْحَرِيرِ،وَالذَّهَبِ،وَمَيَاثِرِ النُّمُورِ»";
nasai.urdu = "حضرت مقدام بن معد یکرب رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اﷲﷺ نے (مردوں کو) ریشم،سونے اور چیتوں کے چمڑے سے بنے ہوئے گدیلوں کے استعمال سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;