var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ: حَدَّثَنَا بَقِيَّةُ،عَنْ بَحِيرٍ،عَنْ خَالِدٍ قَالَ: وَفَدَ الْمِقْدَامُ بْنُ مَعْدِيكَرِبَ عَلَى مُعَاوِيَةَ فَقَالَ لَهُ: أَنْشُدُكَ بِاللَّهِ،هَلْ تَعْلَمُ «أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبُوسِ جُلُودِ السِّبَاعِ،وَالرُّكُوبِ عَلَيْهَا» قَالَ: نَعَمْ";
nasai.urdu = "حضرت خالد سے روایت ہے کہ حضرت مقدام بن معد یکرب رضی اللہ تعالٰی عنہ حضرت معاویہ رضی اللہ تعالٰی عنہ کے پاس آئے اور کہنے لگے: میں آپ سے اﷲ تعالیٰ کا واسطہ دے کرپوچھتا ہوں،کیا آپ جانتے ہیں کہ رسول اﷲﷺ نے درندوں کے چمڑے پہننے اور ان پر سوار ہونے سے منع فرمایا ہے؟ انھوں نے فرمایا: جی ہاں۔";
nasai.hukam = "حسن";
nasai.description = ``;