var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ ابْنِ عَبَّاسٍ،عَنْ مَيْمُونَةَ،أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ،فَمَاتَتْ،فَسُئِلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَلْقُوهَا وَمَا حَوْلَهَا وَكُلُوهُ»";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہا سے روایت ہے کہ ایک چوہیا گھی میں گری اور مرگئی۔نبی اکرمﷺ سے (اس کے متعلق) سوال کیا گیا تو آپ نے فرمایا: ’’چوہیا اور اس کے ارد گرد گھی کو پھینک دو اور باقی کھا لو۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;