var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،وَمُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ،عَنْ عَبْدِ الرَّحْمَنِ،عَنْ مَالِكٍ،عَنْ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ ابْنِ عَبَّاسٍ،عَنْ مَيْمُونَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ فَأْرَةٍ وَقَعَتْ فِي سَمْنٍ جَامِدٍ،فَقَالَ: «خُذُوهَا وَمَا حَوْلَهَا فَأَلْقُوهُ»";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہا سے منقول ہے کہ نبی اکرمﷺ سے پوچھا گیا کہ جمے ہوئے گھی میں چوہا گرگیا ہے۔(اسے کیا کیا جائے؟) آپ نے فرمایا: ’’چوہے اور اس کے ارد گرد کے گھی کو نکال پھینکو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;