var nasai = {};
nasai.arabic = "أَخْبَرَنَا خُشَيْشُ بْنُ أَصْرَمَ قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ بُوذُوَيْهِ،أَنَّ مَعْمَرًا ذَكَرَهُ،عَنْ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ ابْنِ عَبَّاسٍ،عَنْ مَيْمُونَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سُئِلَ عَنِ الْفَأْرَةِ تَقَعُ فِي السَّمْنِ،فَقَالَ: «إِنْ كَانَ جَامِدًا فَأَلْقُوهَا وَمَا حَوْلَهَا،وَإِنْ كَانَ مَائِعًا فَلَا تَقْرَبُوهُ»";
nasai.urdu = "حضرت میمونہ رضی اللہ عنہا سے مروی ہے کہ نبی اکرمﷺ سے پوچھا گیا: چوہا گھی میں گر جائے تو (کیا کیا جائے؟) آپ نے فرمایا: ’’اگر (گھی) جما ہوا ہو تو چوہا اور اس کے ارد گرد والا گھی باہر پھینک دو۔(اور باقی کو استعمال کر لو) لیکن اگر وہ پگھلا ہوا ہے تو اس کے قریب بھی نہ جاؤ۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3843)`;
nasai.anwaar = [353,1];