var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا يَحْيَى قَالَ: حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ: حَدَّثَنِي سَعِيدُ بْنُ خَالِدٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَمْقُلْهُ»";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبیٔ اکرمﷺ نے فرمایا: ’’جب کسی کے (کھانے پینے کے) برتن میں مکھی گر جائے تو اسے ڈبو کر نکال دیا جائے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;