var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ اغْتَسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ فَغَسَلَ فَرْجَهُ وَدَلَكَ يَدَهُ بِالْأَرْضِ أَوْ الْحَائِطِ ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ ثُمَّ أَفَاضَ عَلَى رَأْسِهِ وَسَائِرِ جَسَدِهِ";
nasai.urdu = "نبی ﷺ کی زوجہ محترمہ حضرت میمونہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ نے غسل جنابت فرمایا،چنانچہ آپ نے اپنی شرم گاہ کو دھویا اور اپنا ہاتھ زمین یا دیوار پر ملا،پھر نماز والا وضو فرمایا،پھر اپنے سر اور باقی جسم پر پانی بہایا۔";
nasai.hukam = "صحیح";
nasai.description = ``;