var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي يُونُسُ قَالَ: قَالَ ابْنُ شِهَابٍ،حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ،عَنْ أَبِيهِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَافِعًا صَوْتَهُ،«يَأْمُرُ بِقَتْلِ الْكِلَابِ،فَكَانَتِ الْكِلَابُ تُقْتَلُ،إِلَّا كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ»";
nasai.urdu = "حضرت عبد اﷲ عمر رضی اللہ عنہا بیان فرماتے ہیں کہ میں نے رسول اﷲﷺ کو بلند آواز کے ساتھ کتوں کے قتل کا حکم دیتے سنا،پھر کتے مارے جاتے تھے مگر شکاری یا جانوروں (اور کھیتوں) کی حفاظت کی خاطر رکھے ہوئے کتوں کو قتل نہیں کیا جاتا تھا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;