var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ: حَدَّثَنَا يُونُسُ،عَنْ الْحَسَنِ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنَ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الْأَسْوَدَ الْبَهِيمَ،وَأَيُّمَا قَوْمٍ اتَّخَذُوا كَلْبًا لَيْسَ بِكَلْبِ حَرْثٍ،أَوْ صَيْدٍ،أَوْ مَاشِيَةٍ،فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ»";
nasai.urdu = "حضرت عبداللہ بن مغفل ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’اگر یہ بات نہ ہوتی کہ کتے بھی ایک مخلوق ہیں تو میں ان سب کے قتل کا حکم دیتا۔اب تم خالص سیاہ کتے کو قتل کرو۔جو لوگ بھی ایسا کتا رکھیں جو نہ تو کھیتی یا جانوروں کی حفاظت کے لیے ہو اور نہ شکار کے لیے تو ان کی نیکیوں سے ہر روز ایک قیراط کی کمی ہوتی رہے گی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2845) ترمذی (1486،1489) ابن ماجہ (2305)`;
nasai.anwaar = [353,1];