var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدٌ،ويَحْيَى بْنُ سَعِيدٍ قَالَا: حَدَّثَنَا شُعْبَةُ،عَنْ عَليِّ بْنِ مُدْرِكٍ،عَنْ أَبِي زُرْعَةَ،عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ،عَنْ أَبِيهِ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمَلَائِكَةُ لَا تَدْخُلُ بَيْتًا فِيهِ صُورَةٌ،وَلَا كَلْبٌ،وَلَا جُنُبٌ»";
nasai.urdu = "حضرت علی بن ابی طالب رضی اللہ تعالٰی عنہ سے روادیت ہے کہ نبی اکرمﷺ نے فرمایا:’’فرشتے اس گھر میں داخل نہیں ہوتے جس میں تصویر یا کتا یا جنبی ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;