var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،وإِسْحَاقُ بْنُ مَنْصُورٍ،عَنْ سُفْيَانَ،عَنْ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ ابْنِ عَبَّاسٍ،عَنْ أَبِي طَلْحَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ،وَلَا صُورَةٌ»";
nasai.urdu = "حضرت ابو طلحہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’فرشتے اس گھر میں داخل نہیں ہوتے جس میں کتایا تصویر ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;