var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرِ بْنِ سُوَيْدٍ قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ الْمُبَارَكِ،عَنْ حَنْظَلَةَ قَالَ: سَمِعْتُ سَالِمًا يُحَدِّثُ،عَنْ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَنَى كَلْبًا نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ إِلَّا ضَارِيًا أَوْ صَاحِبَ مَاشِيَةٍ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہا سے وایت ہے کہ رسول اللہﷺ نے فرمایا:’’جو شخص کتا رکھے،اس کے ثواب سے ہر روز دو قیراط کم کیے جائیں گے،الا یہ کہ وہ شکاری ہو یا جانوروں کی حفاظت کے لیے رکھا گیا ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;