var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،أَنَّهُ سَمِعَهُ يَقُولُ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَمْسَكَ كَلْبًا إِلَّا كَلْبًا ضَارِيًا أَوْ كَلْبَ مَاشِيَةٍ،نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہا سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’جو شخص شکار یا جانوروں کے لیے کتے کے علاوہ کتا رکھے تو اس کے ثواب سے ہر روز دو قیراط کم جائیں گے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;