var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ،عَنْ سُفْيَانَ قَالَ: حَدَّثَنَا الزُّهْرِيُّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَنَى كَلْبًا إِلَّا كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»";
nasai.urdu = "حضرت سالم سے والد متحرم(حضرت ابن عمر رضی اللہ عنہا) سے منقول سے کہ نبی اکرمﷺ نے فرمایا:’’جس شخص نے شکار یا جانوروں(اور کھیتی) کے کتے کے علاوہ کتا رکھا،اس کے ثواب سے ہر روز وہ قیراط کم کیے جائیں گے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;