var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا يَحْيَى،وابْنُ أَبِي عَدِيٍّ،ومُحَمَّدُ بْنُ جَعْفَرٍ،عَنْ عَوْفٍ،عَنْ الْحَسَنِ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ أَوْ زَرْعٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ»";
nasai.urdu = "حضرت عبد اللہ بن مغفل رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’جس شخص نے کتا رکھا جو نہ شکاری ہو اور نہ جانوروں یا کھیتی کی حفاظت کے لیے ہو تو اس کے ثواب سے ہر روز ایک قیراط کی کمی ہوتی رہے گی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;