var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ: أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ: حَدَّثَنَا مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ صَيْدٍ أَوْ زَرْعٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’جس شخص نے شکار یا کھیتی یا جانوروں کے کتے کے علاوہ کوئی کتار رکھا،اس کے اعمال صالحہ سے ہر روز ایک قیراط کی کمی ہوتی رہے گی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;