var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي يُونُسُ قَالَ: أَنْبَأَنَا ابْنُ شِهَابٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَنَى كَلْبًا لَيْسَ بِكَلْبِ صَيْدٍ،وَلَا مَاشِيَةٍ،وَلَا أَرْضٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ قِيرَاطَانِ كُلَّ يَوْمٍ»";
nasai.urdu = "حضرت ابو ہر یرہ رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا:’’جس شخص نے جانوروں کی حفاظت یا شکار کرنے والے کتے کے علاوہ کتا رکھا،اس کے نیک اعمال سے ہر روز ایک قیراط کی کمی کی جائے گی۔‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;