var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ ابْنِ شِهَابٍ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ،أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ عُقْبَةَ قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ،وَمَهْرِ الْبَغِيِّ،وَحُلْوَانِ الْكَاهِنِ»";
nasai.urdu = "حضرت ابو مسعود عقبہ رضی اللہ تعالٰی عنہ نے فرمایا: رسول اللہﷺ نے کتے کی قیمت،زانیہ کی اجرت اور کاہن کی شیر ینی(نذرو نیاز) سے منع فرمایا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;