var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَنْبَأَنَا مَعْرُوفُ بْنُ سُوَيْدٍ الْجُذَامِيُّ،أَنَّ عَلِيَّ بْنَ رَبَاحٍ اللَّخْمِيَّ،حَدَّثَهُ،أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ ثَمَنُ الْكَلْبِ،وَلَا حُلْوَانُ الْكَاهِنِ،وَلَا مَهْرُ الْبَغِيِّ»";
nasai.urdu = "حضرت ابوہر یرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:’’کتے کی قیمت،کاہن کی نذرو نیاز اور زانیہ کی اجرت حلال نہیں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;