var nasai = {};
nasai.arabic = "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ،عَنْ يَحْيَى،عَنْ مُحَمَّدِ بْنِ يُوسُفَ،عَنْ السَّائِبِ بْنِ يَزِيدَ،عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ،وَثَمَنُ الْكَلْبِ،وَكَسْبُ الْحَجَّامِ»";
nasai.urdu = "حضرت رافع بن خدیج رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا:’’زانیہ کی اجرت،کتے کی قیمت اور جحام کی کمائی بہت بری کمائی ہے،‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;