var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا حَسَنٌ عَنْ أَبِي إِسْحَقَ ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَوَضَّأُ بَعْدَ الْغُسْلِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ غسل کے بعد وضو نہیں فرماتے تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (253)`;
nasai.anwaar = [323,1];