var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى،وإِسْمَاعِيلُ بْنُ مَسْعُودٍ قَالَا: حَدَّثَنَا خَالِدٌ،عَنْ شُعْبَةَ،عَنْ أَبِي بِشْرٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنْ عَدِيِّ بْنِ حَاتِمٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا رَأَيْتَ سَهْمَكَ فِيهِ،وَلَمْ تَرَ فِيهِ أَثَرًا غَيْرَهُ،وَعَلِمْتَ أَنَّهُ قَتَلَهُ فَكُلْ»";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’جب تو اپنا تیر اس میں لگا ہوا پہچان لے اور کوئی دوسرا نشان اس میں نہ ہو اور تجھے یقین ہو کہ تیرے تیرہی نے اسے قتل کیا ہے تو تو اسے کھا سکتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;