var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا خَالِدٌ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ،أَرْمِي الصَّيْدَ،فَأَطْلُبُ أَثَرَهُ بَعْدَ لَيْلَةٍ،قَالَ: «إِذَا وَجَدْتَ فِيهِ سَهْمَكَ،وَلَمْ يَأْكُلْ مِنْهُ سَبُعٌ فَكُلْ»";
nasai.urdu = "حضرت عد بن حاتم رضی اللہ تعالٰی عنہ نے فرمایا کہ میں عرض کی: اے اللہ کے رسول! میں شکار کو تیر مارتا ہوں،پھر اس کا کھوج لگاتے ہوئے ایک رات کے بعد اسے پاتا ہوں(تو کیا کروں؟) آپ نے فرمایا:’’جب تو اس میں اپنا تیر پہچان لے۔تو اسے کھا سکتا ہے بشر طیکہ کسی درندے نے اس میں سے کچھ نہ کھایا ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;