var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ خَالِدٍ الْخَلَّالُ قَالَ: حَدَّثَنَا مَعْنٌ قَالَ: أَنْبَأَنَا مُعَاوِيَةُ-وَهُوَ ابْنُ صَالِحٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ،عَنْ أَبِيهِ،عَنْ أَبِي ثَعْلَبَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «فِي الَّذِي يُدْرِكُ صَيْدَهُ بَعْدَ ثَلَاثٍ فَلْيَأْكُلْهُ إِلَّا أَنْ يُنْتِنَ»";
nasai.urdu = "حضرت ابو ثعلبہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:’’جو شخص اپنے شکار کو تین دن بعد بھی پالے تو اسے کھا سکتا ہے الا یہ کہ وہ بدبودار ہوجائے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;