var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ بِشْرٍ وَهُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ قَالَ قَالَتْ عَائِشَةُ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَطُوفُ عَلَى نِسَائِهِ ثُمَّ يُصْبِحُ مُحْرِمًا يَنْضَخُ طِيبًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں اللہ کے رسول ﷺ کو خوشبو لگاتی تھی،پھر آپ اپنی سب بیویوں کے پاس جاتے،پھر (غسل کرکے) احرام باندھتے اور آپ سے خوشبو کی مہک آرہی ہوتی تھی۔";
nasai.hukam = "صحیح";
nasai.description = ``;