var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ،عَنْ الشَّعْبِيِّ قَالَ: سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ قَالَ: سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمِعْرَاضِ فَقَالَ: «إِذَا أَصَابَ بِحَدِّهِ فَكُلْ،وَإِذَا أَصَابَ بِعَرْضِهِ فَقُتِلَ،فَإِنَّهُ وَقِيذٌ فَلَا تَأْكُلْ»";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ تعالٰی عنہ نے فرمایا کہ میں نے رسول اللہﷺ سے معراض تیر کے بارے میں پوچھا تو آپ نے فرمایا:’’جب وہ جانور کو نوک کے بل لگے تو اسے کھا سکتا ہے اور جب وہ عرض کے بل لگے اور جانور کو قتل کر دے تو وہ چوٹ سے مرا ہے۔اسے مت کھا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;