var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّرَّاعُ،قَالَ: حَدَّثَنَا أَبُو مُحْصَنٍ،قَالَ: حَدَّثَنَا حُصَيْنٌ،عَنْ الشَّعْبِيِّ،عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ: سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ،فَقَالَ: «إِذَا أَصَابَ بِحَدِّهِ فَكُلْ،وَإِذَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ»";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ تعالٰی عنہ سے روایت ہے کہ میں نے رسول اللہﷺ سے معراض کے شکار کے بارے میں پوچھا تو آپ نے فرمایا:’’جب وہ نوک کے بل لگے تو شکار کھا لے اور جب عرض کے بل لگے تو مت کھا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;