var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ: أَنْبَأَنَا عِيسَى بْنُ يُونُسَ،وَغَيْرُهُ،عَنْ زَكَرِيَّا،عَنْ الشَّعْبِيِّ،عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ: سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ،فَقَالَ: «مَا أَصَبْتَ بِحَدِّهِ فَكُلْ،وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ»";
nasai.urdu = "حضرت عدی بن حاتم رضی اللہ تعالٰی عنہ سے منقول ہے کہ میں رسول اللہﷺ سے معراض کے شکار بارے میں پوچھا تو آپ نے فرمایا:’’جس جانور کو تو اس کی نوک سے شکار کرے،اسے تو کھالے اور جس جانور کو وہ عرض کے بل لگے،وہ چوٹ سے مرنے والا جانور ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;