var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا خَالِدٌ،عَنْ شُعْبَةَ،عَنْ هِشَامٍ وَهُوَ ابْنُ زَيْدٍ،قَالَ: سَمِعْتُ أَنَسًا يَقُولُ: أَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ،فَأَخَذْتُهَا،فَجِئْتُ بِهَا إِلَى أَبِي طَلْحَةَ،فَذَبَحَهَا فَبَعَثَنِي بِفَخِذَيْهَا وَوَرِكَيْهَا إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«فَقَبِلَهُ»";
nasai.urdu = "حضرت انس رضی اللہ تعالٰی عنہ سے مروی ہے کہ مقام مرالظہران میں ہم ایک خرگوش کے پیچھے بھاگے۔میں نے اسے پکڑ لیا اور اسے لے کر ابو طلحہ رضی اللہ تعالٰی عنہ کے پاس آیا۔انھوں نے اسے ذبح کیا،پھر اس کی چاروں ٹانگیں مجھے دے کر رسول اللہﷺ کی خدمت میں بھیجا۔آپ نے انھیں قبول فرما لیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;