var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا حَفْصٌ،عَنْ عَاصِمٍ،وَدَاوُدَ،عَنْ الشَّعْبِيِّ،عَنْ ابْنِ صَفْوَانَ قَالَ: أَصَبْتُ أَرْنَبَيْنِ فَلَمْ أَجِدْ مَا أُذَكِّيهِمَا بِهِ فَذَكَّيْتُهُمَا بِمَرْوَةٍ،فَسَأَلْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ «فَأَمَرَنِي بِأَكْلِهِمَا»";
nasai.urdu = "حضرت ابن صفوان رضی اللہ تعالٰی عنہ سے روایت ہے کہ میں نے دو خرگوش شکار کیے لیکن مجھے کوئی ایسی چیز نہ مل سکی جس سے میں انھیں ذبح کر سکتا تو میں نے انھیں ایک تیز دھار پتھر سے ذبح کر دیا،پھر میں نے نبی اکرمﷺ سے اس بارے میں پوچھا تو آپ نے مجھے ان کے کھانے کا حکم دیا۔(کھانے کی اجازت دی)۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;