var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ سُئِلَ عَنْ الضَّبِّ فَقَالَ لَا آكُلُهُ وَلَا أُحَرِّمُهُ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ منبر پر تشریف فرما تھے کہ آپ سے سانڈے کے بارے میں پوچھا گیا۔آپ نے فرمایا ’’میں نہ تو اسے کھاتا ہوں نہ حرام کہتا ہوں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;