var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ يُحَدِّثُ عَنْ ثَابِتِ بْنِ وَدِيعَةَ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِضَبٍّ فَجَعَلَ يَنْظُرُ إِلَيْهِ وَيُقَلِّبُهُ وَقَالَ إِنَّ أُمَّةً مُسِخَتْ لَا يُدْرَى مَا فَعَلَتْ وَإِنِّي لَا أَدْرِي لَعَلَّ هَذَا مِنْهَا";
nasai.urdu = "حضرت ثابت بن ودیعہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی رسول اللہ ﷺ کے پاس ایک سانڈا لے کر آیا۔آپ اسے الٹ پلٹ کر دیکھنے لگے،پھر فرمایا: ’’ایک قوم کی شکلیں بگاڑ دی گئی تھیں،معلوم نہیں اس کا کیا بنا؟ مجھے معلوم نہیں،شاید یہ بھی انھی میں سے ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;