var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ عَنْ ثَابِتِ ابْنِ وَدِيعَةَ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِضَبٍّ فَقَالَ إِنَّ أُمَّةً مُسِخَتْ وَاللَّهُ أَعْلَمُ";
nasai.urdu = "حضرت ثابت بن ودیعہ رضی اللہ عنہ سے منقول ہے کہ ایک آدمی نبی اکرم ﷺ کے پاس ضب لے کر آیا۔آپ نے فرمایا: ’’ایک امت کو مسخ کر دیا گیا تھا،(یہ ان میں سے نہ ہو)۔واللہ اعلم";
nasai.hukam = "صحیح";
nasai.description = ``;