var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِي ثَعْلَبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحِلُّ النُّهْبَى وَلَا يَحِلُّ مِنْ السِّبَاعِ كُلُّ ذِي نَابٍ وَلَا تَحِلُّ الْمُجَثَّمَةُ";
nasai.urdu = "حضرت ابو ثعلبہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ڈاکا ڈالنا حلال نہیں اور کوئی کچلی والا درندہ بھی حلال نہیں۔اور باندھ کر نشانوں سے مارا ہوا جانور بھی حلال نہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;