var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ وَأَحْمَدُ بْنُ عَبْدَةَ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو وَهُوَ ابْنُ دِينَارٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ جَابِرٍ قَالَ نَهَى وَذَكَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ وَأَذِنَ فِي الْخَيْلِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے خیبر کے دن گدھوں کے گوشت سے منع فرمایا اور گھوڑوں کا گوشت کھانے کی اجازت دی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;