var nasai = {};
nasai.arabic = "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ ثَوْرِ بْنِ يَزِيدَ عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ خَالِدِ بْنِ الْوَلِيدِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لُحُومِ الْخَيْلِ وَالْبِغَالِ وَالْحَمِيرِ وَكُلِّ ذِي نَابٍ مِنْ السِّبَاعِ";
nasai.urdu = "حضرت خالد بن ولید رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے گھوڑے،خچر،گدھے اور کچلی والے درندے کا گوشت کھانے سے منع فرما دیا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3790) وانظر الحدیث الآتی (4336)`;
nasai.anwaar = [353,1];