var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ الْحَسَنِ بْنِ مُحَمَّدٍ وَعَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِمَا قَالَ قَالَ عَلِيٌّ لِابْنِ عَبَّاسٍ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ نِكَاحِ الْمُتْعَةِ وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ يَوْمَ خَيْبَرَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ نے حضرت ابن عباسؓ سے فرمایا: نبی اکرم ﷺ نے غزوئہ خیبر کے دن نکاح متعہ اور گھریلو گدھوں کے گوشت سے منع فرما دیا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;