var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ وَمَالِكٌ وَأُسَامَةُ عَنْ ابْنِ شِهَابٍ عَنْ الْحَسَنِ وَعَبْدِ اللَّهِ ابْنَيْ مُحَمَّدٍ عَنْ أَبِيهِمَا عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ";
nasai.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ نے فرمایا: رسول اللہ ﷺ نے خیبر کے دن عورتوں کے ساتھ نکاح متعہ کرنے اور گھریلو گدھوں کا گوشت کھانے سے روک دیا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;