var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحُمُرِ الْأَهْلِيَّةِ يَوْمَ خَيْبَرَ";
nasai.urdu = "حضرت ابن عمرؓ سے منقول ہے کہ رسول اللہ ﷺ نے خیبر کے دن گھریلو گدھوں سے منع فرما دیا تھا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;