var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ نَضِيجًا وَنِيئًا";
nasai.urdu = "حضرت براء رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے خیبر کے دن گھریلو گدھوں کے گوشت سے روک دیا تھا۔بھنا ہوا یا کچا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;