var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ عَنْ بَقِيَّةَ قَالَ حَدَّثَنِي الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ";
nasai.urdu = "حضرت ابو ثعلبہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے ہر کچلی والے درندے اور گھریلو گدھوں کا گوشت کھانے سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;