var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْمُفَضَّلُ هُوَ ابْنُ فَضَالَةَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَكَلْنَا يَوْمَ خَيْبَرَ لُحُومَ الْخَيْلِ وَالْوَحْشِ وَنَهَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحِمَارِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ نے فرمایا: ہم نے خیبر کے دن گھوڑوں اور جنگلی گدھوں کا گوشت کھایا،البتہ نبی اکرم ﷺ نے ہمیں گدھے کا گوشت کھانے سے منع فرما دیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;