var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ بِشْرٍ هُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ خَيْبَرَ عَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ وَعَنْ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ";
nasai.urdu = "حضرت ابن عباسؓ سے روایت ہے کہ اللہ کے نبی ﷺ نے خیبر کے دن پنجے کے ساتھ شکار کرنے والے پرندے اور کچلی والے درندے کا گوشت کھانے سے منع فرمایا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3805) ابن ماجہ (3234)`;
nasai.anwaar = [353,2];