var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا مَالِكٌ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ سَعِيدِ بْنِ سَلَمَةَ عَنْ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَاءِ الْبَحْرِ هُوَ الطَّهُورُ مَاؤُهُ الْحَلَالُ مَيْتَتُهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے سمندر کے پانی کے بارے میں فرمایا: ’’سمندر کا پانی طاہر ومطہر ہے اور اس کا جانور بلا ذبح حلال ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;