var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ خَالِدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ أَنَّ طَبِيبًا ذَكَرَ ضِفْدَعًا فِي دَوَاءٍ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهِ";
nasai.urdu = "حضرت عبدالرحمٰن بن عثمان رضی اللہ عنہ سے منقول ہے کہ ایک طبیب نے رسول اللہ ﷺ کے سامنے کسی دوائی میں مینڈک ڈالنے کا ذکر کیا۔رسول اللہ ﷺ نے مینڈک کے قتل سے منع فرما دیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;