var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ وَهُوَ ابْنُ حَبِيبٍ عَنْ شُعْبَةَ عَنْ أَبِي يَعْفُورَ سَمِعَ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍ فَكُنَّا نَأْكُلُ الْجَرَادَ";
nasai.urdu = "حضرت عبداللہ بن ابی اوفیٰ رضی اللہ عنہ نے فرمایا ہم سات جنگوں میں رسول اللہ ﷺ کے ساتھ گئے۔ہم (آپ کے ساتھ رہتے ہوئے) ٹڈیاں کھایا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;