var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ سُفْيَانَ وَهُوَ ابْنُ عُيَيْنَةَ عَنْ أَبِي يَعْفُورَ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى عَنْ قَتْلِ الْجَرَادِ فَقَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّ غَزَوَاتٍ نَأْكُلُ الْجَرَادَ";
nasai.urdu = "حضرت ابو یعفور نے کہا کہ میں نے حضرت عبداللہ بن ابی اوفی رضی اللہ عنہ سے ٹڈی کو قتل کرنے کے بارے میں پوچھا تو انھوں نے فرمایا: میں چھ جنگوں میں رسول اللہ ﷺ کے ساتھ حاضر ہوا۔ہم ٹڈیاں کھایا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;