var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ قَالَ حَدَّثَنَا النَّضْرُ وَهُوَ ابْنُ شُمَيْلٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ ابْنِ مُسْلِمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ رَأَى هِلَالَ ذِي الْحِجَّةِ فَأَرَادَ أَنْ يُضَحِّيَ فَلَا يَأْخُذْ مِنْ شَعْرِهِ وَلَا مِنْ أَظْفَارِهِ حَتَّى يُضَحِّيَ";
nasai.urdu = "حضرت ام سلمہ ؓ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا: ’’جو شخص ذوالحجہ کا چاند دیکھ لے اور وہ قربانی کرنے کا ارادہ رکھتا ہو تو وہ اپنے بال اور ناخن نہ کاٹے حتی کہ قربانی کر لے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;