var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ عُثْمَانَ الْأَحْلَافِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ مَنْ أَرَادَ أَنْ يُضَحِّيَ فَدَخَلَتْ أَيَّامُ الْعَشْرِ فَلَا يَأْخُذْ مِنْ شَعْرِهِ وَلَا أَظْفَارِهِ فَذَكَرْتُهُ لِعِكْرِمَةَ فَقَالَ أَلَا يَعْتَزِلُ النِّسَاءَ وَالطِّيبَ";
nasai.urdu = "حضرت سعید بن مسیب رحمہ اللہ سے مروی ہے کہ جو آدمی قربانی ذبح کرنے کا ارادہ رکھتا ہو اور ذوالحجہ شروع ہو جائے تو وہ اپنے بال اور ناخن نہ کاٹے۔میں نے عکرمہ سے اس کا ذکر کیا تو وہ کہنے لگے: کیا وہ عورت اور خوشبو سے بھی الگ نہ رہے؟";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>شریک القاضي عنعن۔`;
nasai.anwaar = [354,1];