var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَتْ الْعَشْرُ فَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ فَلَا يَمَسَّ مِنْ شَعْرِهِ وَلَا مِنْ بَشَرِهِ شَيْئًا";
nasai.urdu = "حضرت ام سلمہ ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب ذوالحجہ شروع ہو جائے تو جو شخص قربانی کا ارادہ رکھتا ہو،تو وہ اپنے بال یا جسم کا کوئی اور حصہ (مثلاً ناخن وغیرہ) نہ کاٹے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;