var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا عَبِيدَةُ قَالَ حَدَّثَنَا سُلَيْمَانُ الْأَعْمَشُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ كُنْتُ رَجُلًا مَذَّاءً فَأَمَرْتُ رَجُلًا فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ فِيهِ الْوُضُوءُ";
nasai.urdu = "حضرت علی رضی اللہ عنہ بیان کرتے ہیں کہ میں بہت مذی والا آدمی تھا۔میں نے ایک آدمی سے کہا تو اس نے نبی ﷺ سےپوچھا،چنانچہ آپ نے فرمایا: ’’اس میں وضو ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;