var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ عُثْمَانَ النُّفَيْلِيُّ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عِيسَى قَالَ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ يَوْمَ الْأَضْحَى بِالْمَدِينَةِ قَالَ وَقَدْ كَانَ إِذَا لَمْ يَنْحَرْ يَذْبَحُ بِالْمُصَلَّى";
nasai.urdu = "حضرت عبداللہ بن عمرؓ سے مروی ہے کہ رسول اللہ ﷺ نے عیدالاضحی کے دن مدینہ منورہ میں اونٹ نحر فرمایا۔اور اگر (کسی سال) اونٹ نحر نہ فرماتے تو قربانی کو عید گاہ میں ذبح فرماتے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;