var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدِ الرَّحِيمِ وَهُوَ ابْنُ سُلَيْمَانَ عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ أَبِي إِسْحَقَ عَنْ شُرَيْحِ بْنِ النُّعْمَانِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ وَأَنْ لَا نُضَحِّيَ بِمُقَابَلَةٍ وَلَا مُدَابَرَةٍ وَلَا بَتْرَاءَ وَلَا خَرْقَاءَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے ہمیں حکم دیا کہ ہم (قربانی والے جانور کے) آنکھ اور کان کو غور سے دیکھیں اور ہم کوئی ایسا جانور ذبح نہ کریں جس کا کان آگے سے کٹا ہو یا پیچھے سے کٹا ہوا ہو یا دم کٹی ہوئی ہو یا کان میں سوراخ ہو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2804) ترمذی (1498) ابن ماجہ (3142)`;
nasai.anwaar = [354,1];