var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ أَعْيَنَ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ شُرَيْحِ بْنِ النُّعْمَانِ قَالَ أَبُو إِسْحَقَ وَكَانَ رَجُلَ صِدْقٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ وَأَنْ لَا نُضَحِّيَ بِعَوْرَاءَ وَلَا مُقَابَلَةٍ وَلَا مُدَابَرَةٍ وَلَا شَرْقَاءَ وَلَا خَرْقَاءَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے ہمیں حکم دیا کہ ہم (قربانی والے جانور کے) آنکھ اور کان کو اچھی طرح دیکھیں۔اور ہم کوئی ایسا جانور ذبح نہ کریں جو کانا ہو یا اس کا کان آگے یا پیچھے سے کٹا ہوا ہو،یا وہ درمیان سے چرا ہوا ہو یا اس میں سوراخ ہو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2804) ترمذی (1498) ابن ماجہ (3142)`;
nasai.anwaar = [354,1];