var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ نَاصِحٍ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ شُرَيْحِ بْنِ النُّعْمَانِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُضَحِّيَ بِمُقَابَلَةٍ أَوْ مُدَابَرَةٍ أَوْ شَرْقَاءَ أَوْ خَرْقَاءَ أَوْ جَدْعَاءَ";
nasai.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے منع فرمایا کہ ایسا جانور قربانی میں ذبح کیا جائے جس کا کان آگے یا پیچھے سے کٹا یا چرا ہوا ہو یا اس میں سوراخ ہو۔یا اس کا کوئی عضو کٹا ہوا ہو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2804) ترمذی (1498) ابن ماجہ (3142)`;
nasai.anwaar = [354,1];