var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ قَالَ حَدَّثَنِي زِيَادُ بْنُ خَيْثَمَةَ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ شُرَيْحِ بْنِ النُّعْمَانِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُضَحَّى بِمُقَابَلَةٍ وَلَا مُدَابَرَةٍ وَلَا شَرْقَاءَ وَلَا خَرْقَاءَ وَلَا عَوْرَاءَ";
nasai.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ایسا جانور قربانی میں ذبح نہ کیا جائے جس کا کان آگے یا پیچھے سے کٹا ہوا ہو یا چرا ہوا ہو،یا اس میں سوراخ ہو یا وہ آنکھ سے کانا ہو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2804) ترمذی (1498) ابن ماجہ (3142)`;
nasai.anwaar = [354,1];