var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ أَنَّ سَلَمَةَ وَهُوَ ابْنُ كُهَيْلٍ أَخْبَرَهُ قَالَ سَمِعْتُ حُجَيَّةَ بْنَ عَدِيٍّ يَقُولُ سَمِعْتُ عَلِيًّا يَقُولُ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ فرماتے تھے کہ رسول اللہ ﷺ نے ہمیں حکم دیا کہ قربانی کے جانور کے کان اور آنکھ غور سے یکھیں(کہ ان میں کسی قسم کی کوئی خرابی نہ ہو)۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;