var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفَيَانَ وَهُوَ ابْنُ حَبِيبٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ جُرَيِّ بْنِ كُلَيْبٍ قَالَ سَمِعْتُ عَلِيًّا يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُضَحَّى بِأَعْضَبِ الْقَرْنِ فَذَكَرْتُ ذَلِكَ لِسَعِيدِ بْنِ الْمُسَيَّبِ قَالَ نَعَمْ إِلَّا عَضَبَ النِّصْفِ وَأَكْثَرَ مِنْ ذَلِكَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ نے فرمایا: رسول اللہ ﷺ نے ٹوٹے ہوئے سینگ والے جانور کی قربانی سے منع فرمایا ہے۔ییہ بات حضرت سعید بن مسیب سے ذکر کی گئی تو انھوں نے فرمایا: اس سے مراد وہ جانور ہے جس کا نصف یا نصف زیادہ سینگ ٹوٹا ہوا ہو۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;