var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا الْحَسَنُ وَهُوَ ابْنُ أَعْيَنَ وَأَبُو جَعْفَرٍ يَعْنِي النُّفَيْلِيَّ قَالَا حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَذْبَحُوا إِلَّا مُسِنَّةً إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنْ الضَّأْنِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’تم قربانی میں صرف مسنہ جانور ہی ذبح کر والا یہ تمھیں مسنہ ملنا مشکل ہو تو پھر تم بھیڑ کا جذعہ ذبح کر سکتے ہو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;