var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا يُقَسِّمُهَا عَلَى صَحَابَتِهِ فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ضَحِّ بِهِ أَنْتَ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اسے کچھد بکریاں دیں کہ صحابہ میں تقسیم کر دے۔آخر میں ایک جذعہ(بکری کا ایک سالہ بچہ،یعنی میمنا) بچ گیا۔انھوں نے رسول اللہ ﷺ سے ذکر کیا تو آپ نے فرمایا:’’چلو! تم اس کی قربانی کردو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;