var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ وَهُوَ الْقَنَّادُ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنِي بَعْجَةُ بْنُ عَبْدِ اللَّهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَّمَ بَيْنَ أَصْحَابِهِ ضَحَايَا فَصَارَتْ لِي جَذَعَةٌ فَقُلْتُ يَا رَسُولَ اللَّهِ صَارَتْ لِي جَذَعَةٌ فَقَالَ ضَحِّ بِهَا";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے اپنے صحابہ میں قربانی کے جانور تقسیم فرمائے۔میرے لیے ایک جذعہ رہ گیا۔میں نے عرض کی: اے اے اللہ کے رسول! میرے لیے جذعہ بچا ہے۔آپ نے فرمایا:’’تو وہی قربان کر دے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;