var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ بَعْجَةَ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ قَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَصْحَابِهِ أَضَاحِيَّ فَأَصَابَنِي جَذَعَةٌ فَقُلْتُ يَا رَسُولَ اللَّهِ أَصَابَتْنِي جَذَعَةٌ فَقَالَ ضَحِّ بِهَا";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اپنے صحابہ میں قربانی جانور تقسیم فرمائیْ مجھے ایک جذعہ ملا۔میں نے عرض کی: اللہ کے رسول! مجھے جذعہ ملا ہے۔آپ نے فرمایا:’’تو یہی ذبح کر دے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;