var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ رَجُلٍ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ الْأَضْحَى بِيَوْمَيْنِ نُعْطِي الْجَذَعَتَيْنِ بِالثَّنِيَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْجَذَعَةَ تُجْزِئُ مَا تُجْزِئُ مِنْهُ الثَّنِيَّةُ";
nasai.urdu = "ایک صحابی رضی اللہ عنہ سے روایت ہے کہ ہم عیدالاضحی سے دو دن قبل نبی اکرم ﷺ کے ساتھ تھے۔ہم دو دانتے کے عوض دو دو جذعے دیتے تھے۔رسول اللہ ﷺ نے فرمایا:’’دو دانتے کی جگہ جذعہ بھی کفایت کر سکتا ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;