var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ ضَحَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ذَبَحَهُمَا بِيَدِهِ وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے کہ نبی اکرم ﷺ نے دو چتکبرے،سینگوں والے مینڈھے قربان کیے۔آپ نے ان کو اپنے سے ذبح فرمایا۔بسم اللہ پڑھی اور اللہ اکبر کہا اور اپنا پاؤں ان کی گردن کے پہلو پر رکھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;