var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أَضْحًى وَانْكَفَأَ إِلَى كَبْشَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا مُخْتَصَرٌ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ نے فرمایا: رسول اللہ ﷺ نے عید الاضحی کے دن خطبہ ارشاد فرمایا،پھر دو سیاہ و سفید مینڈھوں کی طرف بڑھے اور ان کو ذبح فرمایا۔((یہ روایت) مختصر ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;