var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ فِي حَدِيثِهِ عَنْ يَزِيدَ بْنِ زُرَيْعٍ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَ ثُمَّ انْصَرَفَ كَأَنَّهُ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ إِلَى كَبْشَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا وَإِلَى جُذَيْعَةٍ مِنْ الْغَنَمِ فَقَسَمَهَا بَيْنَنَا";
nasai.urdu = "حضرت ابو بکرہ رضی اللہ عنہ بیان کرتے ہیں کہ پھر نبی اکرم ﷺ قربانی والے دن دو سیاہ و سفید مینڈھوں کی طرف متوجہ ہوئے اور انھیں ذبح فرمایا،نیز آپ نے کچھ بکریاں صحابہ میں تقسیم فرمائیں(تاکہ وہ بھی قربانی کر سکیں)۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;