var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو سَعِيدٍ الْأَشَجُّ قَالَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ قَالَ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ يَمْشِي فِي سَوَادٍ وَيَأْكُلُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ";
nasai.urdu = "حضرت ابو سعید رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہ ﷺ نے ایک نر،سینگوں والا مینڈھا قربان فرمایا جس کی ٹانگیں سیاہ تھیں،منہ اور پیٹ بھی سیاہ تھا اور آنکھیں بھی سیاہ تھیں۔(باقی سفید تھا۔)";
nasai.hukam = "ضعیف";
nasai.description = `سندہ ضعیف<br>ابو داود (2796) ترمذی (1496) ابن ماجہ (3128)`;
nasai.anwaar = [354,1];