var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ غَزْوَانَ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنٍ يَعْنِي ابْنَ وَاقِدٍ عَنْ عِلْبَاءَ بْنِ أَحْمَرَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَحَضَرَ النَّحْرُ فَاشْتَرَكْنَا فِي الْبَعِيرِ عَنْ عَشْرَةٍ وَالْبَقَرَةِ عَنْ سَبْعَةٍ";
nasai.urdu = "حضرت ابن عباس ؓ بیان کرتے ہیں کہ ہم ایک سفر میں رسو ل اللہ ﷺ کے ساتھ تھے۔قربانیوں کا وقت ا ٓگیا تو اہم اونٹ میں دس اور گائے میں سات افراد شریک ہوئے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;