var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ مُسْلِمِ بْنِ قُرْطٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا ذَهَبَ أَحَدُكُمْ إِلَى الْغَائِطِ فَلْيَذْهَبْ مَعَهُ بِثَلَاثَةِ أَحْجَارٍ فَلْيَسْتَطِبْ بِهَا فَإِنَّهَا تَجْزِي عَنْهُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی قضائے حاجت کو جائے تو اپنے ساتھ تین ڈھیلے لے جائے اور ان سے صفائی کرے،وہ اسے کافی ہوں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;