var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ لَيْثِ بْنِ سَعْدٍ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ أَرْسَلَ عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ الْمِقْدَادَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُ عَنْ الرَّجُلِ يَجِدُ الْمَذْيَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْسِلُ ذَكَرَهُ ثُمَّ لِيَتَوَضَّأْ";
nasai.urdu = "حضرت سلیمان بن یسار سے روایت ہے کہ حضرت علی ابن ابی طالب رضی اللہ عنہ نے حضرت مقداد رضی اللہ عنہ کو رسول اللہ ﷺ کے پاس بھیجا کہ وہ آپ سے اس آدمی کے بارے میں پوچھیں جو مذی پاتا ہے۔رسول اللہ ﷺ نے فرمایا: ’’وہ اپنا ذکر (عضو خاص) دھولے،پھر وضو کرے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;