var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا حَاضِرُ بْنُ الْمُهَاجِرِ الْبَاهِلِيُّ قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ يُحَدِّثُ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّ ذِئْبًا نَيَّبَ فِي شَاةٍ فَذَبَحُوهَا بِالْمَرْوَةِ فَرَخَّصَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَكْلِهَا";
nasai.urdu = "حضرت زید بن ثابت ؓ سے روایت ہے کہ ایک بھیڑ یے نے ایک بکری میں دانت گاڑ دیے۔لوگوں نے (اس کو چھڑانے کے بعد) اسے ایک تیز دھار پتھر سے ذبح کردیا۔تو بنی اکرم ﷺ نے اس کے کھانے کی اجازت دی۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;