var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُمَرَ بْنِ سَعِيدٍ عَنْ أَبِيهِ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلْ إِلَّا بِسِنٍّ أَوْ ظُفُرٍ";
nasai.urdu = "حضرت رافع بن خدیج رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’جو چیز خون بہادے اور اللہ کا نام لیا گیا ہو تو(وہ ذبیحہ) کھا لے مگر دانت اور ناخن کا ذبح نہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;