var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ أَحْمَدَ الْعَسْقَلَانِيُّ عَسْقَلَانُ بَلْخٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنِي سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ حَدَّثَهُ عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْ نَحَرْنَا فَرَسًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلْنَاهُ";
nasai.urdu = "حضرت اسماء بنت ابو بکر ؓ سے روایت ہے کہ ہم نے رسول اللہ ﷺ کے دور مبارک میں گھوڑا نحر کیا،پھر اسے کھایا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;