var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي الْعُشَرَاءِ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَمَا تَكُونُ الذَّكَاةُ إِلَّا فِي الْحَلْقِ وَاللَّبَّةِ قَالَ لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَكَ";
nasai.urdu = "حضرت ابو العشراء کے والد محترم بیان کرتے ہیں کہ میں نے عرض کی: اے اللہ کے رسول! کیا ذبح صرف حلق اور سینے کے گڑھے ہی میں ہو سکتا ہے؟ آپ نے فرمایا: ’’اگر تو اس کے ران میں نیزہ یا برچھی وغیرہ مار دے تو بھی کفایت کر جائے گا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (2825) ترمذی (1481) ابن ماجہ (3184)`;
nasai.anwaar = [354,1];