var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ نَاصِحٍ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ شُعْبَةَ عَنْ قَتَادَةَ قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُضَحِّي بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ وَكَانَ يُسَمِّي وَيُكَبِّرُ وَلَقَدْ رَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ وَاضِعًا رِجْلَهُ عَلَى صِفَاحِهِمَا";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ نے فرمایا: رسول اللہ ﷺ دو سیاہ و سفید،سینگوں والے مینڈھے ذبح کرتے تھے۔آپ بسم اللہ و اللہ اکبر پڑھتے تھے۔میں نے آپ کو اپنے دست مبارک سے انہیں ذبح کرتے دیکھا۔آپ نے اپنا پائوں مبارک ان کے پہلو پر رکھا ہوا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;