var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ عَنْ الْحَسَنِ يَعْنِي ابْنَ صَالِحٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ لَقَدْ رَأَيْتُهُ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْبَحُهُمَا بِيَدِهِ وَاضِعًا عَلَى صِفَاحِهِمَا قَدَمَهُ يُسَمِّي وَيُكَبِّرُ كَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کترے ہیں کہ میں نے نبی اکرم ﷺ کو دیکھا کہ آپ دو سیاہ و سفید،سینگوں والے مینڈھوں کو بسم اللہ و اللہ اکبر پڑھتے ہوئے اپنے دست مبارک سے ذبح فرما رہے تھے اور اپنا قدم مبارک ان کے پہلو پر رکھا ہوا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;