var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ قَالَ حَدَّثَنَا قَتَادَةُ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَّى بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ يَطَؤُ عَلَى صِفَاحِهِمَا وَيَذْبَحُهُمَا وَيُسَمِّي وَيُكَبِّرُ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی اکرم ﷺ نے سینگوں والے سیاہ و سفید دو مینڈھے بسم اللہ و اللہ اکبر پڑھتے ہوئے قربان فرمائے جبکہ آپ نے ان کے پہلو پر پائوں مبارک رکھا ہوا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;