var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ بَعْضَ بُدْنِهِ بِيَدِهِ وَنَحَرَ بَعْضَهَا غَيْرُهُ";
nasai.urdu = "حضرت جابر بن عبداللہؓ سے روایت ہے کہ رسول اللہ ﷺ نے اپنی قربانی کے کچھ اونٹ خود نحر فرمائے اور کچھ اونٹ کسی اور نے نحر کیے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;