var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ قَالَتْ نَحَرْنَا فَرَسًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلْنَاهُ وَقَالَ قُتَيْبَةُ فِي حَدِيثِهِ فَأَكَلْنَا لَحْمَهُ خَالَفَهُ عَبْدَةُ بْنُ سُلَيْمَانَ";
nasai.urdu = "حضرت اسماء ؓ فرماتی ہیں کہ ہم نے رسول اللہ ﷺ کے دور میں گھوڑا نحر کیا اور پھر اس کا گوشت کھایا۔\nقتیبہ (استاد) نے کہا: فَأَکَلْنَا لَحْمَہٗ پھر ہم نے اس کا گوشت کھایا۔عبدہ بن سلیمان نے اس کی مخالفت کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;