var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا دَاوُدُ عَنْ عَمْرٍو عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَقُمْتُ عَنْ يَسَارِهِ فَجَعَلَنِي عَنْ يَمِينِهِ فَصَلَّى ثُمَّ اضْطَجَعَ وَرَقَدَ فَجَاءَهُ الْمُؤَذِّنُ فَصَلَّى وَلَمْ يَتَوَضَّأْ مُخْتَصَرٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ ایک رات میں نے نبی ﷺ کے ساتھ نماز پڑھی۔میں آپ کے بائیں جانب کھڑا ہوا تو آپ نے مجھے اپنی دائیں جانب کھڑا کردیا،پھر نماز پڑھتے رہے،پھر لیٹ کر سوگئے۔مؤذن آپ کے پاس آیا۔آپ نے نماز پڑھی اور وضو نہیں فرمایا۔یہ روایت مختصر ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;