var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا عُبَيْدٍ أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلَاثٍ";
nasai.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے تمہیں تین دن سے زائد اپنی قربانیوں کے گوشت کھانے سے منع فرما دیا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;