var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثٍ ثُمَّ قَالَ كُلُوا وَتَزَوَّدُوا وَادَّخِرُوا";
nasai.urdu = "حضرت جابر بن عبداللہؓ بیان کرتے ہیں کہ رسول اللہ ﷺ نے تین دن سے زائد قربانی کا گوشت کھانے سے منع فرمایا تھا،پھر آپ نے فرمایا: ’’اب کھائو۔سفر میں بھی ساتھ لے جائو اور ذخیرہ بھی کرو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;