var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ عَنْ أَبِيهِ قَالَ سَأَلْتُ عَائِشَةَ عَنْ لُحُومِ الْأَضَاحِيِّ قَالَتْ كُنَّا نَخْبَأُ الْكُرَاعَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا ثُمَّ يَأْكُلُهُ";
nasai.urdu = "حضرت عابس نے کہا کہ میں نے حضرت عائشہ ؓ سے قربانی کے گوشت کے بارے میں پوچھا۔انہوں نے فرمایا: ہم ایک ایک ماہ تک قربانی کے پائے رسول اللہ ﷺ کے لیے رکھ چھوڑتے تھے۔اور آپ کھا لیا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;