var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ عَوْنٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ إِمْسَاكِ الْأُضْحِيَّةِ فَوْقَ ثَلَاثَةِ أَيَّامٍ ثُمَّ قَالَ كُلُوا وَأَطْعِمُوا";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے پہلے تین دن سے زائد قربانی کا گوشت رکھنے سے منع فرما دیا تھا،پھر آپ نے فرمایا: ’’(جب تک چاہو) کھائو اور (فقراء و مساکین کو بھی) کھلاؤ۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;