var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَعَسَ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيَنْصَرِفْ وَلْيَرْقُدْ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کسی کو نماز میں اونگھ آئے تو وہ نماز چھوڑ دے اور سو جائے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;