var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ مُغِيرَةَ قَالَ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُغَفَّلٍ قَالَ دُلِّيَ جِرَابٌ مِنْ شَحْمٍ يَوْمَ خَيْبَرَ فَالْتَزَمْتُهُ قُلْتُ لَا أُعْطِي أَحَدًا مِنْهُ شَيْئًا فَالْتَفَتُّ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَبَسَّمُ";
nasai.urdu = "حضرت عبداللہ بن مغفل رضی اللہ عنہ بیان کرتے ہیں کہ خیبر کے دن چربی کا ایک تھیلا (قلعہ سے) باہر پھینکا گیا۔میں اس سے چمٹ گیا۔میں نے (اپنے آپ سے) کہا: میں اس سے کسی کو کچھ نہیں دوں گا۔اچانک میں مڑا تو رسول اللہ ﷺ (مجھے دیکھ سن کر) مسکرا رہے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;