var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ نَاسًا مِنْ الْأَعْرَابِ كَانُوا يَأْتُونَا بِلَحْمٍ وَلَا نَدْرِي أَذَكَرُوا اسْمَ اللَّهِ عَلَيْهِ أَمْ لَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْكُرُوا اسْمَ اللَّهِ عَزَّ وَجَلَّ عَلَيْهِ وَكُلُوا";
nasai.urdu = "حضرت عائشہ ؓ سے روایت ہے کہ کچھ اعرابی لوگ ہمارے پاس گوشت لاتے تھے اور ہمیں معلوم نہیں ہوتا تھا انہوں نے (ذبح کرتے وقت) اللہ تعالیٰ کا نام لیا ہے یا نہیں۔رسول اللہ ﷺ نے فرمایا: ’’تم اللہ تعالیٰ کا نام لے کر کھا لیا کرو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;