var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ هِشَامِ بْنِ زَيْدٍ قَالَ دَخَلْتُ مَعَ أَنَسٍ عَلَى الْحَكَمِ يَعْنِي ابْنَ أَيُّوبَ فَإِذَا أُنَاسٌ يَرْمُونَ دَجَاجَةً فِي دَارِ الْأَمِيرِ فَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُصْبَرَ الْبَهَائِمُ";
nasai.urdu = "حضرت ہشام بن زید سے منقول ہے کہ میں حضرت انس رضی اللہ عنہ کے ساتھ حکم بن ایوب کے پاس گیا تو کچھ لوگ امیر کے گھر میں ایک مرغی کو نشانہ بنا کر تیر مار رہے تھے۔حضرت انس رضی اللہ عنہ نے فرمایا: رسول اللہ ﷺ ن ے منع فرمایا ہے کہ جانوروں کو باندھ کر نشانہ بنایا جائے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;