var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ زُنْبُورٍ الْمَكِّيُّ قَالَ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ عَنْ يَزِيدَ وَهُوَ ابْنُ الْهَادِ عَنْ مُعَاوِيَةَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُنَاسٍ وَهُمْ يَرْمُونَ كَبْشًا بِالنَّبْلِ فَكَرِهَ ذَلِكَ وَقَالَ لَا تَمْثُلُوا بِالْبَهَائِمِ";
nasai.urdu = "حضرت عبداللہ بن جعفر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کچھ لوگوں کے پاس سے گزرے جو ایک مینڈھے کو نشانہ بنا کر تیر مار رہے تھے۔آپ نے اس کو سخت ناپسند کیا اور فرمایا: ’’جانوروں کا مثلہ نہ کرو۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;