var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي الْمِنْهَالُ بْنُ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَعَنَ اللَّهُ مَنْ مَثَّلَ بِالْحَيَوَانِ";
nasai.urdu = "حضرت ابن عمرؓ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’الہل تعایٰ اس شخص پر لعنت فرمائے جو کسی جاندار کا مثلہ کرے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;