var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ صُهَيْبٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو يَرْفَعُهُ قَالَ مَنْ قَتَلَ عُصْفُورًا فَمَا فَوْقَهَا بِغَيْرِ حَقِّهَا سَأَلَ اللَّهُ عَزَّ وَجَلَّ عَنْهَا يَوْمَ الْقِيَامَةِ قِيلَ يَا رَسُولَ اللَّهِ فَمَا حَقُّهَا قَالَ حَقُّهَا أَنْ تَذْبَحَهَا فَتَأْكُلَهَا وَلَا تَقْطَعْ رَأْسَهَا فَيُرْمَى بِهَا";
nasai.urdu = "حضرت عبداللہ بن عمروؓ سے مرفوعاً روایت ہے کہ آپ(ﷺ) نے فرمایا: ’’جس شخص نے چڑیا یا اس سے بڑے کسی جانور کو ناحق قتل کیا،اللہ تعالیٰ قیامت کے دن اس سے اس کے متعلق پوچھے گا۔‘‘ پوچھا گیا: اللہ کے رسول! اس کا حق کیا ہے؟ آپ نے فرمایا: اس کا حق یہ ہے کہ اسے ذبح کر کے کھائے۔اس کا سر کاٹ کر پھینک نہ دے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;