var nasai = {};
nasai.arabic = "أَخْبَرَنِي عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي سَهْلُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ عَنْ ابْنِ طَاوُسٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ أَبِيهِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ مَرَّةً عَنْ أَبِيهِ وَقَالَ مَرَّةً عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَعَنْ الْجَلَّالَةِ وَعَنْ رُكُوبِهَا وَعَنْ أَكْلِ لَحْمِهَا";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا محترم (حضرت عبداللہ بن عمروؓ) سے روایت ہے کہ رسول اللہ ﷺ نے خیبر (کی جنگ) کے دن گھریلو (پالتو) گدھوں کے گوشت سے،نیز گندگی کھانے والے جانوروں کے گوشت اور سواری سے منع فرمایا تھا";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;