var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُجَثَّمَةِ وَلَبَنِ الْجَلَّالَةِ وَالشُّرْبِ مِنْ فِي السِّقَاءِ";
nasai.urdu = "حضرت ابن عباسؓ سے روایت ہے کہ رسول اللہ ﷺ نے مجثمہ،گندگی کھانے والے جانور کے دودھ اور مشکیزے کے منہ سے صاس کے منہ سے،منہ لگا کر) پانی پینے سے منع فرمایا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;