var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ عَمَّةٍ لَهُ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَوْلَادَكُمْ مِنْ أَطْيَبِ كَسْبِكُمْ فَكُلُوا مِنْ كَسْبِ أَوْلَادِكُمْ";
nasai.urdu = "حضرت عائشہ ؓ سے منقول ہے کہ نبی اکرم ﷺ نے فرمایا: ’’تمہاری اولاد تمہاری ببہترین کمائی ہے،لہٰذا تم اپنی اولاد کی کمائی کھا سکتے ہو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;