var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى قَالَ أَنْبَأَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَوَلَدُهُ مِنْ كَسْبِهِ";
nasai.urdu = "حضرت عائشہ ؓ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’آدمی کی بہترین خوراک وہ ہے جو وہ اپنی محنت سے کما کر کھائے۔اور اس کی اولاد بھی اس کی کمائی ہی ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;