var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ عُمَرَ بْنِ سَعِيدٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَإِنَّ وَلَدَهُ مِنْ كَسْبِهِ";
nasai.urdu = "حضرت عائشہ ؓ بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’انسان کی پاکیزہ ترین خوراک وہ ہے جو وہ اپنی کمائی سے کھائے۔اور اس کی اولاد ببھی اس کی کمائی ہی ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;