var nasai = {};
nasai.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِي عَلَى النَّاسِ زَمَانٌ مَا يُبَالِي الرَّجُلُ مِنْ أَيْنَ أَصَابَ الْمَالَ مِنْ حَلَالٍ أَوْ حَرَامٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’لوگوں پر ایک ایسا وقت آئے گا کہ آدمی پروا نہیں کرے گا کہ مال کہاں سے آ رہا ہے؟ حلال (طریقے) سے یا حرام سے؟‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;