var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ عَنْ شُعْبَةَ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ بُسْرَةَ بِنْتِ صَفْوَانَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَفْضَى أَحَدُكُمْ بِيَدِهِ إِلَى فَرْجِهِ فَلْيَتَوَضَّأْ";
nasai.urdu = "حضرت بسرہ بنت صفوان رضی اللہ عنہا سے منقول ہے،نبی ﷺ نے فرمایا: ’’جب تم میں سے کوئی اپنا ہاتھ اپنی شرم گاہ کو لگائے تو وضو کرے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;