var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ سَعِيدِ بْنِ أَبِي خَيْرَةَ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَأْتِي عَلَى النَّاسِ زَمَانٌ يَأْكُلُونَ الرِّبَا فَمَنْ لَمْ يَأْكُلْهُ أَصَابَهُ مِنْ غُبَارِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’لوگوں پر ایسا وقت آئے گا کہ عموماً لوگ سود خور ہوں گے۔جو شخص براہ راست سود خور نہ ہو گا،اسے سود کا غبار تو ضرور پہنچے گا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3331) ابن ماجہ (2278)`;
nasai.anwaar = [354,1];