var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنِي أَبِي عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ عَمْرِو بْنِ تَغْلِبَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَفْشُوَ الْمَالُ وَيَكْثُرَ وَتَفْشُوَ التِّجَارَةُ وَيَظْهَرَ الْعِلْمُ وَيَبِيعَ الرَّجُلُ الْبَيْعَ فَيَقُولَ لَا حَتَّى أَسْتَأْمِرَ تَاجِرَ بَنِي فُلَانٍ وَيُلْتَمَسَ فِي الْحَيِّ الْعَظِيمِ الْكَاتِبُ فَلَا يُوجَدُ";
nasai.urdu = "حضرت عمرو بن تغلب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’بے شک یہ بھی قیامت کی نشانیاں ہیں کہ مال عام اور بہت زیادہ ہو جائے گا۔تجارت پھیل جائے گی۔علم (دیکھنے میں) عام ہو گا (مگر) آدمی کوئی سودا کرے گا تو کہے گا: میں سودا پکا نہیں کرتا حتی کہ میں فلاں قبیلے کے تاجر سے مشورہ کر لوں۔اور ایک بہت بڑے قبیلے میں کاتب تلاش کیا جائے گا تو نہیں ملے گا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>الحسن البصري و یونس بن عبید عنعنا۔`;
nasai.anwaar = [354,1];