var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ أَخْبَرَنِي الْوَلِيدُ يَعْنِي ابْنَ كَثِيرٍ عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِي قَتَادَةَ الْأَنْصَارِيِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِيَّاكُمْ وَكَثْرَةَ الْحَلِفِ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ";
nasai.urdu = "حضرت ابو قتادہ انصاری رضی اللہ عنہ سے مروی ہے کہ انہوں نے رسول اللہ ﷺ کو فرماتے سنا: ’’سودا کرتے وقت زیادہ قسمیں نہ کھایا کرو کیونکہ (جھوٹی) قسم سے سامان تو بک جاتا ہے مگر برکت اٹھ جاتی ہے‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;