var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحَلِفُ مَنْفَقَةٌ لِلسِّلْعَةِ مَمْحَقَةٌ لِلْكَسْبِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا: ’’قسم اٹھانے سے سامان تو فروخت ہو جاتا ہے مگر کمائی (کی برکت) ختم ہو جاتی ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;