var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ مَرْوَانَ بْنِ الْحَكَمِ أَنَّهُ قَالَ الْوُضُوءُ مِنْ مَسِّ الذَّكَرِ فَقَالَ مَرْوَانُ أَخْبَرَتْنِيهِ بُسْرَةُ بِنْتُ صَفْوَانَ فَأَرْسَلَ عُرْوَةُ قَالَتْ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يُتَوَضَّأُ مِنْهُ فَقَالَ مِنْ مَسِّ الذَّكَرِ";
nasai.urdu = "حضرت عروہ بن زبیر سے روایت ہے کہ مروان بن حکم نے کہا: عضو مخصوص چھونے سے وضو واجب ہوجاتا ہے۔مروان نے کہا: مجھے یہ بات بسرہ بنت صفوان رضی اللہ عنہا نے بتائی۔عروہ نے ان (بسرہ) کو پیغام بھیجا تو انھوں نے فرمایا: ایک دفعہ اللہ کے رسول ﷺ نے ان چیزوں کا ذکر فرمایا جن سے وضو واجب ہوتا ہے،تو آپ نے فرمایا: ’’عضو کو چھونے سے بھی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;