var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَفْتَرِقَا إِلَّا بَيْعَ الْخِيَارِ";
nasai.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’خرید و فروخت کرنے والے دو اشخاص میں سے ہر ایک کو اختیار ہوتا ہے کہ وہ جدا ہونے سے قبل سودا واپس کرے،البتہ بیع خیار میں ایسے نہیں ہوتا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;