var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا أَوْ يَكُونَ خِيَارًا";
nasai.urdu = "حضرت ابن عمرؓ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’خرید و فروخت کرنے والے دو اشخاص جب تک جدا نہ ہوں،واپسی کا اختیار رکھتے ہیں الا یہ کہ بیع خیار ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;