var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيٍّ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا مُحْرِزٌ بُنُ الْوَضَّاحُ عَنْ إِسْمَعِيلَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا إِلَّا أَنْ يَكُونَ الْبَيْعُ كَانَ عَنْ خِيَارٍ فَإِنْ كَانَ الْبَيْعُ عَنْ خِيَارٍ فَقَدْ وَجَبَ الْبَيْعُ";
nasai.urdu = "حضرت ابن عمرؓ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’دو سودا کرنے والے جب تک جدا نہ ہوں،واپسی کا اختایر رکھتے ہیں الا یہ کہ وہ سودا خیار والا ہو۔اگر وسدے میں اختیار ختم کر دیا گیا ہو تو بیع پکی ہو گئی۔(اب واپسی کا اختیار نہیں رہے گا،خواہ مجلس قائم بھی ہو)۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;