var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ قَالَ أَمْلَى عَلَيَّ نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَبَايَعَ الْبَيِّعَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مِنْ بَيْعِهِ مَا لَمْ يَفْتَرِقَا أَوْ يَكُونَ بَيْعُهُمَا عَنْ خِيَارٍ فَإِنْ كَانَ عَنْ خِيَارٍ فَقَدْ وَجَبَ الْبَيْعُ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب دو شخص سودا کریں تو ان میں سے ہر ایک کو اپنی بیع کی واپسی کے بارے میں ایک دوسرے کے جدا ہونے تک اختیار حاصل ہے۔یا ان کی بیع میں اختیار ختم کر دیا گیا ہو۔اگر ایسی بات ہے تو بیع پکی ہو گئی۔(اب واپسی نہیں ہو گی)۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;