var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا أَوْ يَقُولَ أَحَدُهُمَا لِلْآخَرِ اخْتَرْ";
nasai.urdu = "حضرت ابن عمرؓ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’سودا کرنے والے دو شخص واپسی کا اختیار رکھتے ہیں جب تک وہ ایک دوسرے سے جدا نہ ہوں،یا پھر ان میں سے ایک دوسرے کو بیع کے دوران ہی میں کہہ دے کہ اب پسند کر لو۔(بعد میں واپسی نہیں ہو گی۔ایسی صورت میں اختیار نہیں رہے گا)۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;