var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَفْتَرِقَا أَوْ يَكُونَ بَيْعَ خِيَارٍ وَرُبَّمَا قَالَ نَافِعٌ أَوْ يَقُولَ أَحَدُهُمَا لِلْآخَرِ اخْتَرْ";
nasai.urdu = "حضرت ابن عمرؓ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’بیع کرنے والے دو افراد ایک دوسرے سے جدا ہونے تک بیع کی واپسی کا اختیار رکھتے ہیں الا یہ کہ وہ بیع خیار ہو‘‘ اور کبھی نافع نے کہا (آپ نے فرمایا تھا): ’’یا ان میں سے ایک دوسرے کو (بیع کرتے وقت) کہہ دے: اب پسند کر لے (بعد میں واپسی نہیں ہو گی)۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;