var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَفْتَرِقَا أَوْ يَكُونَ بَيْعَ خِيَارٍ وَرُبَّمَا قَالَ نَافِعٌ أَوْ يَقُولَ أَحَدُهُمَا لِلْآخَرِ اخْتَرْ";
nasai.urdu = "حضرت ابن عمرؓ سے بیان ہے کہ رسول اللہ ﷺ نے فرمایا: ’’سودا کرنے والے دو شخص ایک دوسرے سے جدا ہونے تک سودے کی واپسی کا اختیار رکھتے ہیں الا یہ کہ وہ اختیار والا سودا ہو۔‘‘ اور کبھی نافع نے کہا (آپ نے فرمایا تھا): ’’یا (سودا کرتے وقت) ایک نے دوسرے سے کہہ دیا ہو: ابھی پسند کر لے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;