var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ حَدَّثَنَا نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَبَايِعَانِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ";
nasai.urdu = "حضرت ابن عمرؓ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’دو سودا کرنے والے جب تک ایک دوسرے سے جدا نہیں ہو جاتے،ان کا سودا پکا نہیں ہوتا الا یہ کہ وہ سودا کرتے وقت اختیار ختم کر لیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;