var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ: أَخْبَرَنِي أَبِي،عَنْ بُسْرَةَ بِنْتِ صَفْوَانَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ مَسَّ ذَكَرَهُ فَلَا يُصَلِّي حَتَّى يَتَوَضَّأَ» قَالَ أَبُو عَبْدِ الرَّحْمَنِ: هِشَامُ بْنُ عُرْوَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ هَذَا الْحَدِيث";
nasai.urdu = "حضرت بسرہ بنت صفوان رضی اللہ عنہا سے منقول ہے کہ نبی ﷺ نے فرمایا: ’’جو آدمی اپنے عضو کو ہاتھ لگائے تو وہ وضو کیے بغیر نماز نہ پڑھے۔‘‘ امام ابوعبدالرحمٰن (نسائی) رحمہ اللہ بیان کرتے ہیں کہ ہشام بن عروہ نے یہ حدیث اپنے باپ (حضرت عروہ) سے نہیں سنی۔";
nasai.hukam = "صحیح";
nasai.description = ``;