var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’سودا کرنے والے دو اشخاص میں سے ہر ایک کے لیے سودا پکا نہیں ہوتا حتی کہ وہ جدا ہو جائیں مگر اختیار والا سودا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;