var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ عَنْ ابْنِ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ بَيِّعَيْنِ فَلَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ";
nasai.urdu = "حضرت عبداللہ بن عمرؓ سے مروی ہے کہ انہوں نے رسول اللہ ﷺ کو فرماتے سنا: ’’سودا کرنے والے دو اشخاص کے درمیان بیع مستقل نہیں ہوتی حتی کہ وہ الگ الگ ہو جائیں علاوہ اختیار والی بیع کے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;