var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ";
nasai.urdu = "حضرت ابن عمرؓ کا فرمان ہے کہ رسول اللہ ﷺ نے فرمایا: ’’بیع کرنے والے دو افراد کے درمیان بیع پکی نہیں ہوتی حتی کہ وہ الگ الگ ہو جائیں علاوہ بیع خیار کے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;