var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرٍ قَالَ حَدَّثَنَا أَبِي عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ";
nasai.urdu = "حضرت ابن عمرؓ نے فرمایا کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’سودا کرنے والے دو افراد کے درمیان سودا مستقل نہیں ہوتا حتی کہ ایک دوسرے سے الگ ہو جائیں مگر خیار والی بیع (کا حکم الگ ہے)۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;