var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ عَنْ بَهْزِ بْنِ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَيِّعَيْنِ فَلَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ہر دو سودا کرنے والوں کے درمیان سودا پکا نہیں ہوتا حتی کہ ایک دوسرے سے الگ ہو جائیں مگر خیار والی بیع (کا حکم الگ ہے)۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;