var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونَ بَيْعُهُمَا عَنْ خِيَارٍ";
nasai.urdu = "حضرت ابن عمرؓ سے مروی ہے کہ نبی اکرم ﷺ نے فرمایا: ’’سودا کرنے والے دو شخص جب تک جدا نہ ہوں،سودے کی واپسی کا اختیار رکھتے ہیں الا یہ کہ وہ بیع خیار والی ہو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;