var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَتَفَرَّقَا أَوْ يَأْخُذَ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ الْبَيْعِ مَا هَوِيَ وَيَتَخَايَرَانِ ثَلَاثَ مَرَّاتٍ";
nasai.urdu = "حضرت مسرہ رضی اللہ عنہ سے منقول ہے کہ اللہ کے نبی ﷺ نے فرمایا: ’’سودا کرنے والیے دو شخص ایک دوسرے سے جدا ہونے تک سودے کی واپسی کا اختیار رکھتے ہیں،یا پھر ان میں سے ہر ایک اپنی پسند کی بیع کرے۔اور وہ دونوں تین دفعہ ایک دوسرے کو اختیار دے دیں۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن۔<br>وحدیث ابن ماجہ (2183) یغني عنہ۔`;
nasai.anwaar = [354,1];