var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَيَأْخُذْ أَحَدُهُمَا مَا رَضِيَ مِنْ صَاحِبِهِ أَوْ هَوِيَ";
nasai.urdu = "حضرت سمرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’سودا کرنے والے دو شخص ایک دوسرے سے جدا ہونے تک بیع کی واپسی کا اختیار رکھتے ہیں۔یا ان میں سے کوئی اپنے ساتھی سے اس کی حتمی رضامندی معلوم کر لے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن۔<br>وحدیث ابن ماجہ (2183) یغني عنہ۔`;
nasai.anwaar = [354,1];