var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا إِلَّا أَنْ يَكُونَ صَفْقَةَ خِيَارٍ وَلَا يَحِلُّ لَهُ أَنْ يُفَارِقَ صَاحِبَهُ خَشْيَةَ أَنْ يَسْتَقِيلَهُ";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا محترم (حضرت عبداللہ بن عمروؓ) سے منقول ہے کہ نبی اکرم ﷺ نے فرمایا: ’’سودا کرنے والے دونوں شخص (بائع اور مشتری) جدا ہونے تک سودے کی واپسی کا اختیار رکھتے ہیں الا یہ کہ وہ سودے کے دوران میں اختیار ختم کر چکے ہوں۔اور کسی ایک فریق کو اجازت نہیں کہ وہ سودے کی واپسی کے ڈر سے اپنے ساتھی سے جدا ہو جائے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;