var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ رَجُلًا ذَكَرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يُخْدَعُ فِي الْبَيْعِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بِعْتَ فَقُلْ لَا خِلَابَةَ فَكَانَ الرَّجُلُ إِذَا بَاعَ يَقُولُ لَا خِلَابَةَ";
nasai.urdu = "حضرت ابن عمرؓ سے منقول ہے کہ ایک آدمی نے رسول اللہ ﷺ سے ذکر کیا کہ (اکثر و بیشتر) اس کے ساتھ سودے میں دھوکا اور فریب کیا جاتا ہے۔رسول اللہ ﷺ نے فرمایا: ’’جب تو سودا کرنے لگے تو کہہ دیا کر: دھوکا نہیں چلے گا۔‘‘ پھر وہ آدمی جب بھی سودا کرتا تو کہہ دیا کرتا تھا کہ دھوکا نہیں چلے گا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;