var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو كَثِيرٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَاعَ أَحَدُكُمْ الشَّاةَ أَوْ اللَّقْحَةَ فَلَا يُحَفِّلْهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی شخص بکری یا دودھ والی اونٹنی بیچنے کا ارادہ رکھتا ہو تو وہ اس کا دودھ دوہنا بند نہ کرے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;