var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ قَالَ حَدَّثَنِي دَاوُدُ بْنُ قَيْسٍ عَنْ ابْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى مُصَرَّاةً فَإِنْ رَضِيَهَا إِذَا حَلَبَهَا فَلْيُمْسِكْهَا وَإِنْ كَرِهَهَا فَلْيَرُدَّهَا وَمَعَهَا صَاعٌ مِنْ تَمْرٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جس شخص نے ایسا جانور خریدا جس کا دودھ روکا گیا تھا تو (اس دھوکے کا پتا چل جانے پر) وہ (خریدار) چاہے تو اسے رکھ لے،چاہے واپس کر دے (لیکن واپسی کی صورت میں) اس کے ساتھ کھجوروں کا ایک صاع بھی دینا ہو گا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;