var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ مُحَفَّلَةً أَوْ مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ إِنْ شَاءَ أَنْ يُمْسِكَهَا أَمْسَكَهَا وَإِنْ شَاءَ أَنْ يَرُدَّهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ لَا سَمْرَاءَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ابو القاسم ﷺ نے فرمایا: ’’جس شخص نے ایسا جانور خریدا جس کا دودھ تھنوں میں جمع کیا گیا تھا،اسے تین دن تک اختیار رہتا ہے،چاہے تو رکھ لے،چاہے واپس کر دے اور ساتھ کھجوروں کا ایک صاع دے دے۔گندم کا نہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;