var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ أَحْمِلُ أَنَا وَغُلَامٌ مَعِي نَحْوِي إِدَاوَةً مِنْ مَاءٍ فَيَسْتَنْجِي بِالْمَاءِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب بیت الخلا میں داخل ہوتے تو میں اور میرے ساتھ مجھ جیسا کوئی اور لڑکا پانی کا برتن اٹھاتا،آپ اس پانی سے استنجا کرتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;