var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبِيعُ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’کوئی شہری سی دیہاتی کا سامان نہ بیچے بلکہ لوگوں کو خود بیچنے دو تاکہ اللہ تعالیٰ ان کو ایک دوسرے سے رزق عطا فرمائے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;