var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَلَقَّوْا الرُّكْبَانَ لِلْبَيْعِ وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلَا تَنَاجَشُوا وَلَا يَبِيعُ حَاضِرٌ لِبَادٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’تم سودے کرنے کے لیے تجارتی قافلوں کو منڈی سے باہر جا کر نہ ملو۔اور کوئی شخص دوسرے کے سودے پر سودا نہ کرے۔اور ناجائز بھائو نہ بڑھائو۔اور شہری دیہاتی کا مال نہ بیچے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;