var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعْيَنَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ كَثِيرِ بْنِ فَرْقَدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ النَّجْشِ وَالتَّلَقِّي وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ";
nasai.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے بھائو بڑھانے،تجارتی قافلوں کو آگے جا کر ملنے اور شہری کو دیہاتی کا مال بیچنے سے منع فرمایا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;