var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَلَقَّى الرُّكْبَانُ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ قُلْتُ لِابْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لَا يَكُونُ لَهُ سِمْسَارٌ";
nasai.urdu = "حضرت ابن عباسؓ بیان کرتے ہیں کہ رسول اللہ ﷺ نے منع فرمایا کہ کوئی تاجر منڈی اور بازار سے باہر ہی تجارتی قافلے کو ملے یا کوئی شہری کسی دیہاتی کا مال بیچے۔(راویٔ حدیث جنابِ طائوس نے کہا کہ) میں نے حضرت ابن عباسؓ سے پوچھا: شہری کو دیہاتی کا مال بیچنے سے روکنے کا کیا مطلب ہے؟ انہوں نے فرمایا: وہ اس کا دلال نہ بنے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;