var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَنْبَأَنَا هِشَامُ بْنُ حَسَّانَ الْقُرْدُوسِيُّ أَنَّهُ سَمِعَ ابْنَ سِيرِينَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَلَقَّوْا الْجَلْبَ فَمَنْ تَلَقَّاهُ فَاشْتَرَى مِنْهُ فَإِذَا أَتَى سَيِّدُهُ السُّوقَ فَهُوَ بِالْخِيَارِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کا فرمان ہے: ’’تجارتی قافلوں کو منڈی سے باہر جا کر نہ ملو۔اگر کوئی تاجر منڈی سے باہر جا کر ملے گا اور قافلے سے کوئی چیز خریدے گا تو جب قافلہ بازار میں پہنچے گا،مالک کو اختیار ہو گا کہ وہ سودا واپس کر لے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;