var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ حَتَّى يَبْتَاعَ أَوْ يَذَرَ";
nasai.urdu = "حضرت ابن عمرؓ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’کوئی شخص اپنے بھائی کی بیع پر بیع نہ کرے حتی کہ وہ خرید لے یا چھوڑ دے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;