var nasai = {};
nasai.arabic = "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ حَاضِرٌ لِبَادٍ وَلَا تَنَاجَشُوا وَلَا يَزِيدُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا تَسْأَلْ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَسْتَكْفِئَ بِهِ مَا فِي صَحْفَتِهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا: ’’کوئی شہری کسی دیہاتی کا مال نہ بیچے۔بھائو نہ بڑھائو۔کوئی شخص اپنے بھائی کے طے شدہ سودے پر اضافے کا لالچ نہ دے اور کوئی عورت اپنی سوکن کی طلاق کا مطالبہ نہ کرے تاکہ اس کے برتن کو انڈیل دے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;