var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا الْمُعْتَمِرُ وَعِيسَى بْنُ يُونُسَ قَالَا حَدَّثَنَا الْأَخْضَرُ بْنُ عَجْلَانَ عَنْ أَبِي بَكْرٍ الْحَنَفِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَاعَ قَدَحًا وَحِلْسًا فِيمَنْ يَزِيدُ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ ن ایک پیالہ اور ایک ٹاٹ نیلامی کے ذریعے سے بیچا تھا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;