var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ نے فرمایا: رسول اللہ ﷺ نے ملامسہ اور منابذہ قسم کی بیوع سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;