var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ قَالَ بَلَغَنِي عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسَتَيْنِ وَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ عَنْ الْمُنَابَذَةِ وَالْمُلَامَسَةِ وَهِيَ بُيُوعٌ كَانُوا يَتَبَايَعُونَ بِهَا فِي الْجَاهِلِيَّةِ";
nasai.urdu = "حضرت سالم کے والد محترم (حضرت عبداللہ بن عمرؓ) نے فرمایا: رسول اللہ ﷺ نے دو قسم کے لباس سے منع فرمایا۔او رسول اللہ ﷺ نے ہمیں دو قسم کے سودوں سے منع فرمایا: ملامسہ اور منابذہ۔اور یہ چند سودے تھے جو دور جاہلیت میں لوگ کیا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;