var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَأَنْ يُبَاعَ الثَّمَرُ حَتَّى يَبْدُوَ صَلَاحُهُ وَأَنْ لَا يُبَاعَ إِلَّا بِالدَّنَانِيرِ وَالدَّرَاهِمِ وَرَخَّصَ فِي الْعَرَايَا";
nasai.urdu = "حضرت جابر بن عبد اللہؓ سے مروی ہے کہ نبی اکرم ﷺ نے مخابرہ،مزابنہ اور محاقلہ سے منع فرمایا۔اور اس بات سے کہ پھلوں کو ان کی صلاحیت ظاہر ہونے سے پہلے فروخت کیا جائے یا تازہ پھل کو خشک پھل کے عوض بیچا جائے بلکہ ان کو دینار درہم (روپے پیسے) کے عوض بیچا جائے،البتہ آپ نھے عطیہ کے درختوں میں اس بیع کی اجازت عطا فرمائی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;