var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْمُفَضَّلُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ وَأَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَبَيْعِ الثَّمَرِ حَتَّى يُطْعَمَ إِلَّا الْعَرَايَا";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے مخابرہ،محاقلہ اور پکنے سے پہلے پھل بیچنے سے منع فرمایا ہے،البتہ عطیہ کے درختوں میں مزابنہ کی اجازت عطا فرمائی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;