var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ قَالَ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ أَنَّهُ سَمِعَ ابْنَ جُرَيْجٍ يُحَدِّثُ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَاعَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلَا يَأْخُذْ مِنْ أَخِيهِ وَذَكَرَ شَيْئًا عَلَى مَا يَأْكُلُ أَحَدُكُمْ مَالَ أَخِيهِ الْمُسْلِمِ";
nasai.urdu = "حضرت جابر بن اللہ ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جو شخص پھل بیچے،پھر اس کو کوئی آفت پہنچ جائے اور وہ ضائع ہو جائے تو وہ اپنے بھائی سے اس کی قیمت نہ لے۔‘‘ اور آپ نے الفظ فرمایا،وہ کس بنا پر اپنے مسلمان بھائی کا مال کھائے گا؟";
nasai.hukam = "حسن";
nasai.description = ``;