var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ و قَالَ ابْنُ عُمَرَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا";
nasai.urdu = "حضرت سالم کے والد محترم (حضرت عبد اللہ بن عمر ؓ) سے روایت ہے کہ نبی اکرم ﷺ نے خشک کھجوروں کے بدلے درخت پر لگی ہوئی کھجوروں کے سودے سے منع فرمایا ہے۔حضرت عبد اللہ بن عمر ؓ نے فرمایا: مجھے حضرت زیدبن ثابت رضی اللہ عنہ نے بیان فرمایا کہ رسول اللہ ﷺ نے عطیے کے درختوں میں اس سودے کی رخصت دی ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;