var nasai = {};
nasai.arabic = "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ أَنْ يُبَاعَ مَا فِي رُءُوسِ النَّخْلِ بِتَمْرٍ بِكَيْلٍ مُسَمًّى إِنْ زَادَ لِي وَإِنْ نَقَصَ فَعَلَيَّ";
nasai.urdu = "حضرت ابن عمر ؓ سے روایت ہے کہ رسول اللہ ﷺ نے مزابنہ سے منع فرمایا۔اور مزابنہ یہ ہے کہ درخت پر لگا ہوا پھل (کھجور) معین وزن (یا ماپ) کی خشک کھجوروں کے بدلے بیچا جائے کہ اگر کھجور کا پھل زیادہ ہوا تو اس کا فائدہ بھی مجھے ہے اور اگر پھل کم ہوا تو اس کا نقصان بھی مجھے ہو گا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;