var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلًا وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلًا";
nasai.urdu = "حضرت ابن عمر ؓ سے منقول ہے کہ رسول اللہ ﷺ نے مزابنہ سے منع فرمایا ہے۔اور مزابنہ ہے کہ تازہ کھجوریں (درخت پر گلی ہوئیں) تولی ماپی ہوئی خشک کھجوروں کے بدلے اور درخت پر لگے ہوئے انگور ماپے ہوئے منقی کے بدلے بیچے جائیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;