var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ طَارِقٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ";
nasai.urdu = "حضرت رافع خدیج رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے کھیت میں اگی ہوئی فصل کی بیع خشک غلے سے اور درخت پر لگے ہوئے پھل کی بیع خشک پھل کے ساتھ کرنے سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;