var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا تُبَاعُ بِخِرْصِهَا";
nasai.urdu = "حضرت زید بن ثابت رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے رخصت عطا فرمائی کہ عطیہ کے درختوں کا پھل اندازا ان کے برابر خشک کھجوروں کے عوض بیچایا خریدا جا سکتا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;