var nasai = {};
nasai.arabic = "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ بِخِرْصِهَا تَمْرًا";
nasai.urdu = "حضرت زید بن ثابت رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے عطیہ کے درخت کے پھل کے بارے میں رخصت عطا فرمائی کہ اسے اندازا پھل کے برابر خشک کھجوروں کے عوض بیچا جا سکتا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;