var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ سَالِمًا أَخْبَرَهُ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ إِنَّ زَيْدَ بْنَ ثَابِتٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا بِالرُّطَبِ وَبِالتَّمْرِ وَلَمْ يُرَخِّصْ فِي غَيْرِ ذَلِكَ";
nasai.urdu = "حضرت زید بن ثابت رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے اجازت عطا فرمائی کہ عطیہ کے درختوں کا پھل خشک یا تازہ کھجوروں کے عوض بیچا جا سکتا ہے،البتہ آپ نے اس علاوہ (اس کی عام) اجازت نہیں دی۔";
nasai.hukam = "حسن";
nasai.description = ``;