var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ أَنَّ رَافِعَ بْنَ خَدِيجٍ وَسَهْلَ بْنَ أَبِي حَثْمَةَ حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ بَيْعُ الثَّمَرِ بِالتَّمْرِ إِلَّا لِأَصْحَابِ الْعَرَايَا فَإِنَّهُ أَذِنَ لَهُمْ";
nasai.urdu = "حضرت رافع بن خدیج اور حضرت سہل بن ؓ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مزابنہ سے منع فرمایا،یعنی درخت پر لگی ہوئی کھجوروں کا سودا خشک کھجوروں سے کیا جائے،البتہ آپ نے عطیہ والے درختوں کے مالکوں کو (پانچ و سق تک) اس بیع کی اجازت دی۔";
nasai.hukam = "حسن";
nasai.description = ``;