var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ قَالُوا رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا";
nasai.urdu = "حضرت بشیر بن یسار نے بہت سے صحابہ کرام رضی اللہ عنہم سے بیان کیا کہ انھوں نے فرمایا: رسول اللہ ﷺ نے عطیہ کے درختوں کے پھل کو اندازا ان کے برابر خشک کھجوروں کے عوض فروخت کرنے کی اجازت دی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;