var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ عَنْ زَيْدِ بْنِ أَبِي عَيَّاشٍ عَنْ سَعْدٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّمْرِ بِالرُّطَبِ فَقَالَ لِمَنْ حَوْلَهُ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ قَالُوا نَعَمْ فَنَهَى عَنْهُ";
nasai.urdu = "حضرت سعد رضی اللہ عنہ بیان کرتے ہیں کہ خریدنے یا بیچنے کے بارے میں پوچھا گیا تو آپ نے اپنے ارد گرد بیٹھے ہوئے حاضرین سے فرمایا: ’’انھوں نے کہا: ہاں پھر آپ نے ایسے سودے سے منع فرما دیا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;