var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ الْفِرْيَابِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ زَيْدٍ عَنْ سَعْدِ بْنِ مَالِكٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّطَبِ بِالتَّمْرِ فَقَالَ أَيَنْقُصُ إِذَا يَبِسَ قَالُوا نَعَمْ فَنَهَى عَنْهُ";
nasai.urdu = "حضرت سعد بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ سے خشک کھجوروں کے عوض تازہ کھجوریں خرید نے بیچنے کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’کیا تازہ کھجوریں خشک ہو کر کم ہو جاتی ہیں؟‘‘ جی ہاں،پھر آپ نے اس سودے سے منع فرما دیا۔";
nasai.hukam = "حسن";
nasai.description = ``;