var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الصُّبْرَةِ مِنْ التَّمْرِ لَا يُعْلَمُ مَكِيلُهَا بِالْكَيْلِ الْمُسَمَّى مِنْ التَّمْرِ";
nasai.urdu = "حضرت جابر بن اللہ ؓ سے مروی ہے کہ رسول اللہ ﷺ نے منع فرمایا کہ کھجوروں کے اس ڈھیر کا سواد،جس کا وزن معلوم نہ ہو،مقررہ وزن کی کھجوروں کے ساتھ کیا جائے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;