var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُبَاعُ الصُّبْرَةُ مِنْ الطَّعَامِ بِالصُّبْرَةِ مِنْ الطَّعَامِ وَلَا الصُّبْرَةُ مِنْ الطَّعَامِ بِالْكَيْلِ الْمُسَمَّى مِنْ الطَّعَامِ";
nasai.urdu = "حضرت جابر بن عبد اللہ ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’غلے کا ایک ڈھیر دوسرے ڈھیر کے عوض یا مین وزن کے غلے کے عوض خریدا بیچا نہ جائے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;