var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُزَابَنَةِ أَنْ يَبِيعَ ثَمَرَ حَائِطِهِ وَإِنْ كَانَ نَخْلًا بِتَمْرٍ كَيْلًا وَإِنْ كَانَ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلًا وَإِنْ كَانَ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ نَهَى عَنْ ذَلِكَ كُلِّهِ";
nasai.urdu = "حضرت ابن عمر ؓ سے مروی ہے کہ رسول اللہ ﷺ نے مزابنہ سے منع فرمایا ہے۔وہ یہ ہے کہ (کوئی شخص) اپنے باغ کا پھل (مثلاََ) تازہ کھجوریں خشک تولی ہوئی کھجوروں کے عوض بیچے۔اسی طرح انگوروں کو تولے ہوئے منقیٰ کے عوض بیچے اور اگر کھیتی ہو تو اسے معین غلے کے عوض بیچے۔آپ نے ان تمام صورتوں سے منع فرما دیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;