var nasai = {};
nasai.arabic = "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَعَنْ بَيْعِ الثَّمَرِ قَبْلَ أَنْ يُطْعَمَ وَعَنْ بَيْعِ ذَلِكَ إِلَّا بِالدَّنَانِيرِ وَالدَّرَاهِمِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے مخابرہ،مزابنہ اور محاقلہ سے منع فرمایا۔اور پھل کھانے کے قابل ہونے سے پہلے اس کی بیع سے بھی روکا۔مزابنہ اور محاقلہ کی بجائے ان کو الگ الگ دینار اور در ہم (روپے پیسے) سے خریدا بیچا جائے۔";
nasai.hukam = "حسن";
nasai.description = ``;