var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ النَّخْلَةِ حَتَّى تَزْهُوَ وَعَنْ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ";
nasai.urdu = "حضرت ابن عمر ؓ سے روایت ہے کہ رسول اللہ ﷺ نے منع فرمایا کہ درخت کے پھل کی بیع کی جائے حتی کہ وہ رنگ بدل جائے۔اور سٹے کی بیع کی جائے کہ وہ سفید ہو جائے اور آفت سے محفوظ ہو جائے۔آپ نے بیچنے والے کو بھی روکا اور خرید نے والے کو بھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;