var nasai = {};
nasai.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي صَالِحٍ أَنَّ رَجُلًا مَنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّا لَا نَجِدُ الصَّيْحَانِيَّ وَلَا الْعِذْقَ بِجَمْعِ التَّمْرِ حَتَّى نَزِيدَهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعْهُ بِالْوَرِقِ ثُمَّ اشْتَرِ بِهِ";
nasai.urdu = "نبی اکرم ﷺ کے ایک صحابی سے منقول ہے،انھوں نے کہا: اے اللہ کے رسول! ہمیں صیحانی اور عذق کھجوریں ردی اور ملی جلی کھجوروں کے برابر نہیں مل سکتیں جب تک کہ ہم زیادہ نہ دیں۔رسول اللہ ﷺ نے فرمایا: ’’اپنی ردی کھجوریں چاندی (رقم) کے عوض بیچ اور پھر اس (رقم) کے ساتھ (عمدہ کھجوریں) خرید۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سلیمان الأعمش وحبیب بن أبي ثابت عنعنا۔<br>و حدیث البخاري (2201۔2202) ومسلم (1593) یغني عنہ۔`;
nasai.anwaar = [355,1];