var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ عَنْ يَحْيَى وَهُوَ ابْنُ حَمْزَةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى قَالَ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ حَدَّثَنِي أَبُو سَعِيدٍ قَالَ كُنَّا نَبِيعُ تَمْرَ الْجَمْعِ صَاعَيْنِ بِصَاعٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَاعَيْ تَمْرٍ بِصَاعٍ وَلَا صَاعَيْ حِنْطَةٍ بِصَاعٍ وَلَا دِرْهَمَيْنِ بِدِرْهَمٍ";
nasai.urdu = "حضرت ابو سعید رضی اللہ عنہ بیان کرتے ہیں کہ ہم ردی کھجوروں کے دو صاع دے کر ایک صاع عمدہ کھجور لے لیا کرتے تھے۔نبی اکرم ﷺ نے فرمایا: ’’دو صاع کھجور کا سودا ایک صاع کے بدلے نہیں ہو سکتا۔نہ دو در ہم کو ایک در ہم کے بدلے فروخت کیا جا سکتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;