var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالْوَرِقِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلَّا هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلَّا هَاءَ وَهَاءَ";
nasai.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’سونے کا سودا چاندی کے ساتھ سود ہے الا یہ کہ نقد سود نہیں۔گندم کا سودا گندم کے ساتھ سود ہے الا یہ کہ نقد ہو۔اور جو کا سودا جو کے ساتھ سود ہے الا یہ کہ سودا نقد ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;