var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّمْرُ بِالتَّمْرِ وَالْحِنْطَةُ بِالْحِنْطَةِ وَالشَّعِيرُ بِالشَّعِيرِ وَالْمِلْحُ بِالْمِلْحِ يَدًا بِيَدٍ فَمَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى إِلَّا مَا اخْتَلَفَتْ أَلْوَانُهُ";
nasai.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’کھجور کا سودا کھجور کے ساتھ،گندم کا گندم کے ساتھ،جو کا جو کے ساتھ اور نمک کا نمک کے ساتھ سودا نقد (اور برابر) ہونا چاہیے۔جو زیادہ دے یا زیادہ لے،اس نے سود کا لین دین کیا۔الا یہ کہ جنسیں بدل جائیں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;