var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى وَعَبْدُ الرَّحْمَنِ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ فُرِضَتْ الصَّلَاةُ عَلَى لِسَانِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی ﷺ کی زبانی حضر کی نماز چاررکعت،سفر کی نماز دورکعت اور خوف کی نماز ایک رکعت فرض کی گئی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;