var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ عَنْ مُجَاهِدٍ قَالَ قَالَ عُمَرُ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لَا فَضْلَ بَيْنَهُمَا هَذَا عَهْدُ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْنَا";
nasai.urdu = "حضرت عمر رضی اللہ عنہ نے فرمایا: دینار کا سودا دینار سے ہو یا درہم کا درہم سے تو کمی بیشی جائز نہیں ہو سکتی۔ہمارے پیارے نبی مکرم ﷺ کی طرف سے ہمیں یہ تاکید ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;