var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ مِثْلًا بِمِثْلٍ وَالْفِضَّةُ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ مِثْلًا بِمِثْلٍ فَمَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’سونا سونے کے بدلے میں تول کر برابر دیا جائے اور چاندی چاندی کے بدلے تول کر برابر دی جائے۔جو شخص زیادہ دے یا زیادہ لے،اس نے سود کا لین دین کیا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;