var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلَّا مِثْلًا بِمِثْلٍ وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلَا تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلَّا مِثْلًا بِمِثْلٍ وَلَا تَبِيعُوا مِنْهَا شَيْئًا غَائِبًا بِنَاجِزٍ";
nasai.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’سونا سونے کے بدلے نہ بیچو مگر برابر۔کسی ایک کو دوسرے سے زیادہ نہ کرو۔اور چاندی چاندی کے بدلے نہ بیچو مگر برابر اور ان میں سے کسی غائب کا نقد سے سودا نہ کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;