var nasai = {};
nasai.arabic = "حَدَّثَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّ مُعَاوِيَةَ بَاعَ سِقَايَةً مِنْ ذَهَبٍ أَوْ وَرِقٍ بِأَكْثَرَ مِنْ وَزْنِهَا فَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ مِثْلِ هَذَا إِلَّا مِثْلًا بِمِثْلٍ";
nasai.urdu = "حضرت عطاء بن یسار سے منقول ہے کہ حضرت معاویہ رضی اللہ عنہ نے سونے یا چاندی کا ایک برتن اس کے وزن سے زیادہ سونے یا چاندی کے عوض خریدا۔حضرت ابوالدردائ رضی اللہ عنہ نے فرمایا: میں نے رسول اللہ ﷺ کو اس جیسے سودے سے منع فرماتے سنا الا یہ کہ دونوں کا وزن برابر ہو۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;