var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ عَنْ حَنَشٍ الصَّنْعَانِيِّ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَ أَصَبْتُ يَوْمَ خَيْبَرَ قِلَادَةً فِيهَا ذَهَبٌ وَخَرَزٌ فَأَرَدْتُ أَنْ أَبِيعَهَا فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ افْصِلْ بَعْضَهَا مِنْ بَعْضٍ ثُمَّ بِعْهَا";
nasai.urdu = "حضرت فضالہ بن عبید رضی اللہ عنہ سے مروی ہے کہ جنگ خیبر کے دن مجھے ایک ایسا ہار ملا جس میں سونے کے علاوہ موتی اور منکے بھی تھے۔میں نے اسے بیچنے کا ارادہ کیا۔یہ بات نبی اکرم ﷺ سے ذکر کی گئی تو آپ نے فرمایا: ’’اس کے اجزا الگ الگ کر کے بیچ۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;