var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ ابْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَ كُنْتُ أَبِيعُ الذَّهَبَ بِالْفِضَّةِ أَوْ الْفِضَّةَ بِالذَّهَبِ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ بِذَلِكَ فَقَالَ إِذَا بَايَعْتَ صَاحِبَكَ فَلَا تُفَارِقْهُ وَبَيْنَكَ وَبَيْنَهُ لَبْسٌ";
nasai.urdu = "حضرت ابن عمرؓ بیان کرتے ہیں کہ میں سونے کا چاندی کے ساتھ اور چاندی کا سونے کے ساتھ سودا کیا کرتا تھا۔میں رسول اللہ ﷺ کی خدمت میں حاضر ہوا اور آپ کو یہ بات بتلائی تو آپ نے فرمایا: ’’جب تو اپنے ساتھی سے (اس قسم کا) سودا کرے تو اس سے ایسی حالت میں جدا نہ ہو کہ تیرے اور اس کے درمیان کوئی شبہات والی چیز باقی ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;