var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مُحَارِبُ بْنُ دِثَارٍ عَنْ جَابِرٍ قَالَ لَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ دَعَا بِمِيزَانٍ فَوَزَنَ لِي وَزَادَنِي";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ جب نبی اکرم ﷺ مدینہ منورہ تشریف لائے تو آپ نے ترازو منگوایا۔مجھے (اونٹ کی قیمت) تول کر دی اور کچھ زیادہ دی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;