var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ سِمَاكٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ قَالَ جَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ بَزًّا مِنْ هَجَرَ فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ بِمِنًى وَوَزَّانٌ يَزِنُ بِالْأَجْرِ فَاشْتَرَى مِنَّا سَرَاوِيلَ فَقَالَ لِلْوَزَّانِ زِنْ وَأَرْجِحْ";
nasai.urdu = "حضرت سوید بن قیس رضی اللہ عنہ بیان کرتے ہیں کہ میں اور مخرمہ عبدی علاقہ ہجر سے (بیچنے کے لیے) کپڑے لائے۔رسول اللہ ﷺ مقام منیٰ میں ہمارے پاس تشریف لائے اور ایک تولنے والا اجرت پر تول رہا تھا۔آپ نے ہم سے ایک شلوار خریدی،پھر تولنے والے سے فرمایا: ’’(قیمت) تول اور جھکا کر دے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;