var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ أَبَا صَفْوَانَ قَالَ بِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَأَرْجَحَ لِي";
nasai.urdu = "حضرت ابوصفوان رضی اللہ عنہ بیان کرتے ہیں کہ میں نے ہجرت سے پہلے رسول اللہ ﷺ کو ایک شلوار بیچی۔آپ نے مجھے قیمت تولتے وقت جھکا کر (زیادہ) دی۔";
nasai.hukam = "حسن";
nasai.description = ``;