var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جو آدمی غلہ (غذائی جنس) خریدے،وہ کسی کو فروخت نہ کرے حتی کہ اسے (پورا پورا) اپنے قبضے میں لے لے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;