var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ مُعَاذَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ مُرْنَ أَزْوَاجَكُنَّ أَنْ يَسْتَطِيبُوا بِالْمَاءِ فَإِنِّي أَسْتَحْيِيهِمْ مِنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُهُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا نے عورتوں سے فرمایا: اپنے خاوندوں سے کہو کہ وہ پانی سے صفائی کیا کریں۔مجھے یہ بات کہتے ہوئے ان سے شرم آتی ہے۔بے شک رسول اللہ ﷺ پانی سے صفائی کیا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;