var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِيعُهُ حَتَّى يَقْبِضَهُ قَالَ ابْنُ عَبَّاسٍ فَأَحْسَبُ أَنَّ كُلَّ شَيْءٍ بِمَنْزِلَةِ الطَّعَامِ";
nasai.urdu = "حضرت ابن عباسؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جو شخص غلہ خریدے،وہ اسے فروخت نہ کرے حتی کہ اسے قبضے میں لے۔‘‘ حضرت ابن عباسؓ نے فرمایا: میرا خیال ہے کہ ہر چیز کا حکم غلے کی طرح ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;