var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجِ بْنِ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ صَفْوَانَ بْنِ مَوْهَبٍ أَنَّهُ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ صَيْفِيٍّ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبِعْ طَعَامًا حَتَّى تَشْتَرِيَهُ وَتَسْتَوْفِيَهُ";
nasai.urdu = "حضرت حکیم بن حزام رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’کوئی غلہ نہ بیچ حتی کہ تو اسے خرید کر قبضے میں کر لے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;