var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ حِزَامِ بْنِ حَكِيمٍ قَالَ قَالَ حَكِيمُ بْنُ حِزَامٍ ابْتَعْتُ طَعَامًا مِنْ طَعَامِ الصَّدَقَةِ فَرَبِحْتُ فِيهِ قَبْلَ أَنْ أَقْبِضَهُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ لَا تَبِعْهُ حَتَّى تَقْبِضَهُ";
nasai.urdu = "حضرت حکیم بن حزام رضی اللہ عنہ بیان کرتے ہیں کہ میں صدقے کے غلے میں سے کچھ غلہ خریدا۔قبضے میں لینے سے پہلے ہی مجھے اس میں منافع ملنے لگا۔میں رسول اللہ ﷺ کے پاس حاضر ہوا اور آپ سے یہ بات عرض کی۔آپ نے فرمایا: ’’قبضے میں لینے سے پہلے نہ بیچ۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;