var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ الْمُنْذِرِ بْنِ عُبَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَبِيعَ أَحَدٌ طَعَامًا اشْتَرَاهُ بِكَيْلٍ حَتَّى يَسْتَوْفِيَهُ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ نبی اکرم ﷺ نے منع فرمایا کہ کوئی شخص ماپ کر خریدے ہوئے غلے کو قبضے میں لینے سے پہلے بیچے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3495)`;
nasai.anwaar = [355,1];