var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنْ الْمَكَانِ الَّذِي ابْتَعْنَا فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ";
nasai.urdu = "حضرت عبداللہ بن عمرؓ نے فرمایا کہ رسول اللہ ﷺ کے مبارک زمانے میں ہم غلہ خریدتے تھے تو آپ ہمارے پاس اس شخص کو بھیجتے تھے جو ہمیں حکم دیتا تھا کہ اسے آگے بیچنے سے پہلے اس جگہ سے کسی اور جگہ منتقل کیا جائے جہاں پر خریدا گیا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;