var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّهُمْ كَانُوا يَبْتَاعُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَعْلَى السُّوقِ جُزَافًا فَنَهَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعُوهُ فِي مَكَانِهِ حَتَّى يَنْقُلُوهُ";
nasai.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے کہ ہم رسول اللہ ﷺ کے دور میں بازار کے آخر میں غلہ بغیر ماپے خریدا کرتے تھے۔رسول اللہ ﷺ نے اس کو اسی جگہ بیچنے سے منع فرما دیا حتی کہ اسے منتقل کر لیں۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;