var nasai = {};
nasai.arabic = "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّاسَ يُضْرَبُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَرَوْا الطَّعَامَ جُزَافًا أَنْ يَبِيعُوهُ حَتَّى يُؤْوُوهُ إِلَى رِحَالِهِمْ";
nasai.urdu = "حضرت سالم کے والد محترم (حضرت عبداللہ بن عمرؓ) نے فرمایا: میں نے رسول اللہ ﷺ کے مبارک دور میں دیکھا کہ جو لوگ ماپے بغیر غلہ خرید کر وہیں بیچ یتے تھے،ان کو (سرکاری عمال کی طرف سے) سزا دی جاتی تھی حتی کہ وہ اسے اپنی دکانوں پر لے جائیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;