var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ مَشَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخُبْزِ شَعِيرٍ وَإِهَالَةٍ سَنِخَةٍ قَالَ وَلَقَدْ رَهَنَ دِرْعًا لَهُ عِنْدَ يَهُودِيٍّ بِالْمَدِينَةِ وَأَخَذَ مِنْهُ شَعِيرًا لِأَهْلِهِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ وہ رسول اللہ ﷺ کے پاس جوکی روٹی اور باسی چربی لے کر گئے۔آپ کی حالت یہ تھی کہ آپ نے مدینہ منورہ میں ایک یہودی کے پاس اپنی زرہ گروی رکھی ہوئی تھی کیونکہ آپ نے اپنے گھر والوں کے لیے اس سے کچھ جو لیے تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;