var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَحُمَيْدُ بْنُ مَسْعَدَةَ عَنْ يَزِيدَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ سَلَفٌ وَبَيْعٌ وَلَا شَرْطَانِ فِي بَيْعٍ وَلَا بَيْعُ مَا لَيْسَ عِنْدَكَ";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا محترم (حضرت عبد اللہ بن عمرو ؓ) سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ایک دوسرے سے مشروط) قرض اور بیع جائز نہیں۔اور بیع میں دو شرطیں جائز نہیں اور جو چیز تیرے پاس نہیں،اس کی بیع بھی جائز نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;