var nasai = {};
nasai.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا أَبُو بِشْرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ يَأْتِينِي الرَّجُلُ فَيَسْأَلُنِي الْبَيْعَ لَيْسَ عِنْدِي أَبِيعُهُ مِنْهُ ثُمَّ أَبْتَاعُهُ لَهُ مِنْ السُّوقِ قَالَ لَا تَبِعْ مَا لَيْسَ عِنْدَكَ";
nasai.urdu = "حضرت حکیم بن حزام رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی اکرم ﷺ سے پوچھا: اے اللہ کے رسول! میرے پاس ایک آدمی آتا ہے اور مجھ سے ایسی چیز بیچنے کا مطالبہ کرتا ہے جو میرے پاس نہیں ہوتی۔میں اس سے اس کا سودا کر لیتا ہوں،پھر میں اسے بازار سے خرید کر لا دیتا ہوں۔آپ نے فرمایا: ’’جو چیز تیرے پاس نہیں،اس کا سودا نہ کر۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;