var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ أَبِي الْمِنْهَالِ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ قَالَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي التَّمْرِ السَّنَتَيْنِ وَالثَّلَاثَ فَنَهَاهُمْ وَقَالَ مَنْ أَسْلَفَ سَلَفًا فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ";
nasai.urdu = "حضرت ابن عباس ؓ بیان کرتے ہیں کہ رسول اللہ ﷺ مدینہ منورہ تشریف لائے اور وہ (لوگ) دو دو،تین تین سال کے لیے کھجوروں میں بیع سلف کیا کرتے تھے۔آپ نے ان کو روک دیا فرمایا: ’’جو شخص بیع سلف کرے تو وہ معین ماپ یا معین وزن میں معین مدت تک کے لیے کرے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;