var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ،عَنْ خَالِدٍ،عَنْ حُسَيْنٍ الْمُعَلِّمِ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ سَلَفٍ وَبَيْعٍ،وَشَرْطَيْنِ فِي بَيْعٍ،وَرِبْحِ مَا لَمْ يُضْمَنْ»";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا محترم (حضرت عبد اللہ بن عمرو رضی اللہ عنہ) سے روایت ہے کہ رسول اللہﷺ نے قرض کی شرط پر بیع،ایک سودے میں دو سودوں اور غیر مقبوضہ چیز کے منافع سے منع فرمایا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;