var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ: حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ: حَدَّثَنَا أَيُّوبُ قَالَ: حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ قَالَ: حَدَّثَنِي أَبِي،عَنْ أَبِيهِ،حَتَّى ذَكَرَ عَبْدَ اللَّهِ بْنَ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ سَلَفٌ وَبَيْعٌ،وَلَا شَرْطَانِ فِي بَيْعٍ،وَلَا رِبْحُ مَا لَمْ يُضْمَنْ»";
nasai.urdu = "حضرت عبد اللہ بن عمرو رضی اللہ عنہا سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’قرض کی شرط پر بیع،ایک بیع میں دو شرطیں اور غیر مقبوضہ چیز کا منافع حلال نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;