var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ،وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالُوا: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو قَالَ: حَدَّثَنَا أَبُو سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ»";
nasai.urdu = "حضرت ابو ہریرہ رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے ایک سودے میں دو سودوں سے منع فرمایا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;