var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ: حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ قَالَ: حَدَّثَنَا يُونُسُ،عَنْ عَطَاءٍ،عَنْ جَابِرٍ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْمُحَاقَلَةِ،وَالْمُزَابَنَةِ،وَالْمُخَابَرَةِ،وَعَنِ الثُّنْيَا إِلَّا أَنْ تُعْلَمَ»";
nasai.urdu = "حضرت جابر رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے محاقلہ،مزابنہ،مخابرہ اور سودے میں استثنا سے منع فرمایا ہے الا یہ کہ وہ استثنا معلوم ہو۔";
nasai.hukam = "حسن";
nasai.description = ``;