var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ،عَنْ أَيُّوبَ،وَأَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ: حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ: أَنْبَأَنَا أَيُّوبُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُحَاقَلَةِ،الْمُزَابَنَةِ،وَالْمُخَابَرَةِ،وَالْمُعَاوَمَةِ،وَالثُّنْيَا،وَرَخَّصَ فِي الْعَرَايَا»";
nasai.urdu = "حضرت جابر رضی اللہ تعالٰی عنہ سے مروی ہے کہ رسول اللہﷺ محاقلہ،مزابنہ،مخابرہ،معاومہ اور بیع میں استثنا سے منع فرمایا،البتہ عطیے کے درختوں میں مزابنہ (موجود پھل کی بیع خشک پھل کے ساتھ) کی رخصت دی ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;