var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا امْرِئٍ أَبَّرَ نَخْلًا،ثُمَّ بَاعَ أَصْلَهَا فَلِلَّذِي أَبَّرَ ثَمَرُ النَّخْلِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو شخص کھجور کے درختوں کو پیوند لگائے،پھروہ درخت بیچ دے تو ان کا پھل پیوند لگانے والے کو ملے گا،الا یہ کہ خریدنے والا شرط لگائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;