var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ: أَنْبَأَنَا سُفْيَانُ،عَنْ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ ابْتَاعَ نَخْلًا بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلْبَائِعِ،إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ،وَمَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ»";
nasai.urdu = "حضرت سالم کے والد محترم (حضرت عبد اللہ بن عمر رضی اللہ عنہ) سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو شخص پیوند لگانے کے بعد درخت بیچے تو اس کا پھل بیچنے والے کو ملے گا الا یہ کہ خرید نے والا شرط لگالے۔اسی طرح جو شخص ایسا غلام فروخت کرے جس کے پاس مال ہو تو اس کا مالہ بیچنے والے کو ملے گا مگر یہ کہ خرید نے والا لگالے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;