var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ قَالَ: حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ قَالَ: حَدَّثَنَا أَبِي،عَنْ أَبِي عُمَيْسٍ قَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ الْأَشْعَثِ،عَنْ أَبِيهِ،عَنْ جَدِّهِ قَالَ عَبْدُ اللَّهِ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِذَا اخْتَلَفَ الْبَيِّعَانِ،وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ فَهُوَ مَا يَقُولُ: رَبُّ السِّلْعَةِ أَوْ يَتْرُكَا";
nasai.urdu = "۴۶۵۲-حضرت عبد اللہ (بن مسعود رضی اللہ تعالٰی عنہ) بیان کرتے ہیں کہ میں رسول اللہﷺ کو فرماتے سنا: ’’جب خریدنے اور بیچنے والے کا (قیمت وغیرہ میں) اختلاف ہو جائے اور ان میں سے کسی پاس ثبوت نہ ہو تو معتبر بات وہ ہو گی جو سامان کا مالک کہے یا وہ سودا ختم کر دیں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;