var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ الْأَسْوَدِ،عَنْ عَائِشَةَ قَالَتْ: «اشْتَرَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ،وَأَعْطَاهُ دِرْعًا لَهُ رَهْنًا»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہﷺ نے ایک یہودی سے ادھار غلہ خریدا تھا اور بطور ضمانت اپنی زرہ اس کو گروی میں دی تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;