var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ،عَنْ هِشَامٍ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ قَالَ: «تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلَاثِينَ صَاعًا مِنْ شَعِيرٍ لِأَهْلِهِ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ اللہ کو پیارے ہوئے تو آپ کی زرہ ایک یہودی کے پاس گروی رکھی ہوئی تھی کیونکہ آپ نے اس سے اپنے اہل و عیال کے لیے تیس صاع غلہ (جو) ادھار لیے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;