var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ،وَاللَّفْظُ لَهُ،قَالَا: حَدَّثَنَا سُفْيَانُ،عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ: سَمِعْتُ أَبَا الْمِنْهَالِ يَقُولُ: سَمِعْتُ إِيَاسَ بْنَ عُمَرَ،وَقَالَ مَرَّةً: ابْنَ عَبْدٍ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَنْهَى عَنْ بَيْعِ الْمَاءِ»،قَالَ قُتَيْبَةُ: «لَمْ أَفْقَهْ عَنْهُ بَعْضَ حُرُوفِ أَبِي الْمِنْهَالِ كَمَا أَرَدْتُ»";
nasai.urdu = "حضرت ایاس بن عمر رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو پانی کی فروخت سے منع فرماتے سنا۔استادقتیبہ نے کہا کہ میں اس (استاد سفیان بن عیینہ) سے ابو منہال کے بعض حراف اس طرح نہیں سمجھ سکا جس طرح میں چاہتا تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;