var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا دَاوُدُ،عَنْ عَمْرٍو،عَنْ أَبِي الْمِنْهَالِ،عَنْ إِيَاسٍ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِ»،وَبَاعَ قَيِّمُ الْوَهَطِ فَضْلَ مَاءِ الْوَهَطِ فَكَرِهَهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو";
nasai.urdu = "حضرت ایاس سے روایت ہے کہ رسول اللہﷺ نے زائد پانی بیچنے سے منع فرمایا ہے۔(حضرت عمر و بن عاص رضی اللہ تعالٰی عنہ کی زمین) وہط کے ناظم نے وہط کا زائد پانی بیچا تو حضرت عبد اللہ بن عمر و رضی اللہ عنہ نے اسے ناپسند فرمایا۔";
nasai.hukam = "صحیح";
nasai.description = ``;