var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ،عَنْ حَجَّاجٍ قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ،أَنَّ أَبَا الْمِنْهَالِ،أَخْبَرَهُ،أَنَّ إِيَاسَ بْنَ عَبْدٍ صَاحِبَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا فَضْلَ الْمَاءِ فَإِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِ»";
nasai.urdu = "صحابی رسول حضرت ایاس بن عبد رضی اللہ تعالٰی عنہ بیان کرتے ہیں زائد پانی نہ بیچو کیونکہ نبی اکرمﷺ نے فالتو پانی بیچنے سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;