var nasai = {};
nasai.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ مَنْصُورٍ،عَنْ أَبِي الضُّحَى،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ قَالَتْ: «لَمَّا نَزَلَتْ آيَاتُ الرِّبَا قَامَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ،فَتَلَاهُنَّ عَلَى النَّاسِ،ثُمَّ حَرَّمَ التِّجَارَةَ فِي الْخَمْرِ»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہ فرماتی ہیں کہ جب سود کی (حرمت کی) آیاتر اتریں تو رسول اللہﷺ منبر پر تشریف فرما ہوئے اور یہ آیات لوگوں کو پڑھ کر سنائیں،پھر آپ نے شراب کی تجارت کو بھی حرام قرار دیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;