var nasai = {};
nasai.arabic = "حَدَّثَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ عُقْبَةَ بْنَ عَمْرٍو قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ";
nasai.urdu = "حضرت ابو مسعود عقبہ بن عمرہ رضی اللہ تعالٰی عنہ سے مروی ہے کہ رسول اللہﷺ نے کتے کی قیمت،زاینہ کی اجرت اور (غیب کی خبریں بتانے والے) کاہن کی شیرینی اور کمائی (نذر و نیاز) سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;