var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ،قَالَ: أَنْبَأَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ،وَالسِّنَّوْرِ،إِلَّا كَلْبِ صَيْدٍ»،قَالَ أَبُو عَبْدِ الرَّحْمَنِ: «هَذَا مُنْكَرٌ»";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے کتے اور بلی کی قیمت سے منع فرمایا،البتہ شکاری کتے کو مستثنیٰ فرمایا۔\nابوعبدالرحمٰن (امام نسائی رحمہ اللہ) فرماتے ہیں کہ یہ حدیث منکر ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (4300)`;
nasai.anwaar = [355,1];