var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ،عَنْ حَجَّاجٍ قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ: سَمِعَ جَابِرًا يَقُولُ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ ضِرَابِ الْجَمَلِ،وَعَنْ بَيْعِ الْمَاءِ،وَبَيْعِ الْأَرْضِ لِلْحَرْثِ،يَبِيعُ الرَّجُلُ أَرْضَهُ وَمَاءَهُ،فَعَنْ ذَلِكَ نَهَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
nasai.urdu = "حضرت جابر رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے اونٹ کی جفتی،(زائد) پانی اور کاشت کاری کے لیے زمین کی فروخت سے منع فرمایا کہ ایک آدمی اپنی زمین اور اس کا پانی کسی کو بیچ دے۔نبی اکرمﷺ نے اس سے منع فرمایا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;