var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ،عَنْ عَلِيِّ بْنِ الْحَكَمِ،ح وَأَنْبَأَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ،عَنْ عَلِيِّ بْنِ الْحَكَمِ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ عَسْبِ الْفَحْلِ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے نر کی جفتی کی اجرت سے منع فرمایا ہے";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;