var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،عَنْ مُحَمَّدٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ الْمُغِيرَةِ قَالَ: سَمِعْتُ ابْنَ أَبِي نُعْمٍ قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْحَجَّامِ،وَعَنْ ثَمَنِ الْكَلْبِ،وَعَنْ عَسْبِ الْفَحْلِ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے سنگی لگانے والے کی کمائی،کتے کی فروخت اور نر کی جفتی کی اجرت سے منع فرمایا ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;