var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ يَحْيَى،عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ،عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا امْرِئٍ أَفْلَسَ ثُمَّ وَجَدَ رَجُلٌ عِنْدَهُ سِلْعَتَهُ بِعَيْنِهَا،فَهُوَ أَوْلَى بِهِ مِنْ غَيْرِهِ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص مفلس قرار دیا جائے،پھر کوئی شخص اپنا سامان اس کے پاس بعینہٖ پا لے تو وہ اس سامان کا دوسروں سے زیادہ حق دار ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;