var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ،قَالَ: حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ،قَالَ: حَدَّثَنَا هُشَيْمٌ،عَنْ مُوسَى بْنِ السَّائِبِ،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ،قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الرَّجُلُ أَحَقُّ بِعَيْنِ مَالِهِ إِذَا وَجَدَهُ وَيَتْبَعُ الْبَائِعُ مَنْ بَاعَهُ»";
nasai.urdu = "حضرت سمرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’آدمی اپنے عین (اصل) مال کا زیادہ حق دار ہے جب (اور جہاں) بھی اسے پا لے۔خریدنے والا خود بیچنے والے کا پیچھا کرے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (3531)`;
nasai.anwaar = [355,1];