var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،قَالَ: حَدَّثَنَا غُنْدَرٌ،عَنْ شُعْبَةَ،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلْأَوَّلِ مِنْهُمَا وَمَنْ،بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا»";
nasai.urdu = "حضرت سمرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جس عورت کا نکاح دو ولی (الگ الگ) جگہ کر دیں،وہ اس خاوند کی ہوگی جس سے پہلے نکاح ہوا۔اور اگر کسی شخص نے ایک چیز دو آدمیوں کو (الگ الگ) بیچ دی تو وہ چیز اس کو ملے گی جس کو پہلے بیچی گئی ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;