var nasai = {};
nasai.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ،عَنْ سُفْيَانَ،عَنْ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: اسْتَقْرَضَ مِنِّي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ أَلْفًا،فَجَاءَهُ مَالٌ فَدَفَعَهُ إِلَيَّ،وَقَالَ: «بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ،إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالْأَدَاءُ»";
nasai.urdu = "حضرت عبداللہ بن ابو ربیعہ رضی اللہ تعالٰی عنہ نے فرمایا کہ نبی اکرمﷺ نے مجھ سے چالیس ہزار (درہم) قرض لیے،پھر آپ کے پاس کہیں سے مال آیا۔آپ نے میرا قرض میرے سپرد کیا اور فرمایا: ’’اللہ تعالیٰ تیرے اہل ومال میں برکت فرمائے۔قرض کا بدلہ تعریف اور ادائیگی ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;