var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي الزِّنَادِ،عَنْ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ،وَالظُّلْمُ مَطْلُ الْغَنِيِّ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جب تم میں سے کسی (قرض خواہ) کو کسی مال دار شخص کے پیچھے لگایا جائے تو اسے پیچھے لگ جانا چاہیے۔(اگر اسے کسی مال دار شخص سے اپنا قرض وصول کرنے کی پیش کش کی جائے تو وہ یہ پیش کش قبول کر لے)۔ظلم یہ ہے کہ مالدار شخص ٹال مٹول (ادائیگی میں تاخیر) کرے۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;