var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ،قَالَ: حَدَّثَنَا ابْنُ الْمُبَارَكِ،عَنْ وَبْرِ بنِ أَبِي دُلَيْلَةَ،عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ،عَنْ عَمْرِو بْنِ الشَّرِيدِ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ»";
nasai.urdu = "حضرت شرید رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’ادائیگی کی گنجائش رکھنے والا شخص ادائیگی میں ٹال مٹول کرے تو اس کی بے عزتی کی جا سکتی ہے اور اسے سزا بھی دی جا سکتی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;