var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا وَكِيعٌ،قَالَ: حَدَّثَنَا وَبْرُ بْنُ أَبِي دُلَيْلَةَ الطَّائِفِيُّ،عَنْ مُحَمَّدِ بْنِ مَيْمُونِ ابْنِ مُسَيْكَةَ وَأَثْنَى عَلَيْهِ خَيْرًا،عَنْ عَمْرِو بْنِ الشَّرِيدِ،عَنْ أَبِيهِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ»";
nasai.urdu = "حضرت شرید رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’مالدار شخص (ادائیگی میں حیلے بہانے کرے تو اس کی بے عزتی کرنا اور اسے سزا دینا جائز اور حلال ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;