var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،وَالْحَارِثُ بْنُ مِسْكِينٍ،قِرَاءَةً عَلَيْهِ،وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ،عَنْ ابْنِ الْقَاسِمِ،قَالَ: حَدَّثَنِي مَالِكٌ،عَنْ أَبِي الزِّنَادِ،عَنْ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَطْلُ الْغَنِيِّ ظُلْمٌ،وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’صاحب استطاعت شخص کا ادائیگی سے ٹال مٹول کرنا ظلم ہے۔اور جب کسی (قرض خواہ) کو کسی مالدار شخص کے سپرد کیا جائے تو اسے چاہیے کہ وہ ادائیگی کے لیے اس سے رجوع کرے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;