var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ أَنْبَأَنَا هِشَامٌ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا شَرِبَ أَحَدُكُمْ فَلَا يَتَنَفَّسْ فِي إِنَائِهِ وَإِذَا أَتَى الْخَلَاءَ فَلَا يَمَسَّ ذَكَرَهُ بِيَمِينِهِ وَلَا يَتَمَسَّحْ بِيَمِينِهِ";
nasai.urdu = "حضرت ابو قتادہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی پیے تو برتن میں (پیتے ہوئے) سانس نہ لے اور جب قضائے حاجت کرے تو دائیں ہاتھ سے اپنی شرم گاہ نہ چھوئے اور نہ دائیں ہاتھ سے استنجا ہی کرے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;