var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ الْمُنْكَدِرِ وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ سَمِعَا أَنَسًا قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَبِذِي الْحُلَيْفَةِ الْعَصْرَ رَكْعَتَيْنِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی ﷺ کے ساتھ ظہر کی نماز مدینہ منورہ میں چار رکعت پڑھی اور عصر کی نماز ذوالحلیفہ میں دورکعت پڑھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;