var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَقَ،عَنْ إِسْمَعِيلَ ابْنِ عُلَيَّةَ،عَنْ يُونُسَ،عَنْ عَطَاءِ بْنِ فَرُّوخَ،عَنْ عُثْمَانَ بْنِ عَفَّانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَدْخَلَ اللَّهُ عَزَّ وَجَلَّ رَجُلًا كَانَ سَهْلًا مُشْتَرِيًا،وَبَائِعًا،وَقَاضِيًا،وَمُقْتَضِيًا الْجَنَّةَ»";
nasai.urdu = "حضرت عثمان بن عفان رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’اللہ تعالیٰ نے ایک آدمی کو اس بنا پر جنت میں داخل کر دیا کہ وہ خریدتے،بیچتے،ادا کرتے اور طلب کرتے وقت نرم رویہ رکھتا تھا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;