var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،قَالَ: حَدَّثَنِي أَبُو إِسْحَقَ،عَنْ أَبِي عُبَيْدَةَ،عَنْ عَبْدِ اللَّهِ قَالَ: «اشْتَرَكْتُ أَنَا وَعَمَّارٌ،وَسَعْدٌ يَوْمَ بَدْرٍ،فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ،وَلَمْ أَجِئْ أَنَا وَعَمَّارٌ بِشَيْءٍ»";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ میں عمار اور سعد بدر کے دن شریک بنے۔حضرت سعد رضی اللہ تعالٰی عنہ دو قیدی لائے۔میں اور عمار کچھ نہ لائے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (3969)`;
nasai.anwaar = [355,1];