var nasai = {};
nasai.arabic = "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ،قَالَ: أَنْبَأَنَا عَبْدُ الرَّزَّاقِ،قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ أُتِمَّ مَا بَقِيَ فِي مَالِهِ،إِنْ كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ»";
nasai.urdu = "حضرت سالم کے والد محترم (حضرت عبداللہ بن عمر رضی اللہ تعالٰی عنہ) سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو شخص کسی غلام میں اپنا حصہ آزاد کر دے تو باقی حصے کی آزادی بھی اس کے مال سے ہوگی بشرطیکہ اس کے پاس اتنا مال ہو جو اس غلام کی قیمت کے برابر ہو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;