var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ،قَالَ: حَدَّثَنَا أَيُّوبُ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ،وَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ بِقِيمَةِ الْعَبْدِ فَهُوَ عَتِيقٌ مِنْ مَالِهِ»";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی غلام میں اپنا حصہ آزاد کر دے اور اس کے پاس اتنا مال ہو جو اس غلام کے باقی حصے کی قیمت بن سکے تو وہ غلام (پورے کا پورا) اس کے مال سے آزاد ہوگا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;