var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّكُمْ كَانَتْ لَهُ أَرْضٌ أَوْ نَخْلٌ،فَلَا يَبِعْهَا حَتَّى يَعْرِضَهَا عَلَى شَرِيكِهِ»";
nasai.urdu = "حضرت جابر رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’۔تم میں سے جس شخص کے پاس زمین یا کھجوروں کے درخت ہوں تو وہ انھیں نہ بیچے حتی کہ اپنے شریک پر پیش کرے (اپنے شریک کو خریدنے کی پیش کش کرے)۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;