var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا عِيسَى بْنُ يُونُسَ،قَالَ: حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ عَمْرِو بْنِ الشَّرِيدِ،عَنْ أَبِيهِ،أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ،أَرْضِي لَيْسَ لِأَحَدٍ فِيهَا شَرِكَةٌ،وَلَا قِسْمَةٌ إِلَّا الْجُوَارَ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْجَارُ أَحَقُّ بِسَقَبِهِ»";
nasai.urdu = "حضرت شرید رضی اللہ تعالٰی عنہ سے روایت ہے کہ ایک آدمی نے کہا: اے اللہ کے رسول! میری زمین میں کوئی شخص شریک نہیں،نہ کسی کا حصہ ہے،البتہ پڑوس ہے۔رسول اللہﷺ نے فرمایا: ’’پڑوسی بھی قرب کی وجہ سے حق دار ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;