var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِلَالُ بْنُ بِشْرٍ قَالَ: حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى،عَنْ مَعْمَرٍ،عَنْ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الشُّفْعَةُ فِي كُلِّ مَالٍ لَمْ يُقْسَمْ،فَإِذَا وَقَعَتِ الْحُدُودُ،وَعُرِفَتِ الطُّرُقُ فَلَا شُفْعَةَ»";
nasai.urdu = "حضرت ابو سلمہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’’شفعہ ہر اس مال میں ہے جو تقسیم نہ ہوا ہو۔جب الگ الگ حد بندی ہو جائے اور راستے بھی الگ الگ ہو جائیں تو شفعہ باقی نہیں رہتا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;