var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْهَاجِرَةِ قَالَ ابْنُ الْمُثَنَّى إِلَى الْبَطْحَاءِ فَتَوَضَّأَ وَصَلَّى الظُّهْرَ رَكْعَتَيْنِ وَالْعَصْرَ رَكْعَتَيْنِ وَبَيْنَ يَدَيْهِ عَنَزَةٌ";
nasai.urdu = "حضرت ابوجحیفہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ دوپہر کے وقت۔۔۔ابن مثنی نے کہا: بطحاء (مکہ میں مقبرہ معلاۃ سے صفامروہ کی طرف جانے والے راستے) کی طرف۔۔۔نکلے۔آپ نے وضو فرمایا،پھر ظہروعصر دودورکعت پڑھیں اور آپ کے آگے ایک چھوٹا نیزہ گاڑا گیا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;