var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ،وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى،قَالَ: أَنْبَأَنَا ابْنُ وَهْبٍ،قَالَ: أَخْبَرَنِي يُونُسُ،عَنْ ابْنِ شِهَابٍ،قَالَ: أَحْمَدُ بْنُ عَمْرٍو قَالَ: أَخْبَرَنِي أَبُو سَلَمَةَ،وَسُلَيْمَانُ بْنُ يَسَارٍ،عَنْ رَجُلٍ،مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَنْصَارِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَقَرَّ الْقَسَامَةَ عَلَى مَا كَانَتْ عَلَيْهِ فِي الْجَاهِلِيَّةِ»";
nasai.urdu = "رسول اللہﷺ کے ایک انصاری صحابی رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے قسامت کو برقرار رکھا ہے جیسے کہ وہ جاہلیت میں رائج تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;