var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ،قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ ابْنِ الْمُسَيَّبِ قَالَ: «كَانَتِ الْقَسَامَةُ فِي الْجَاهِلِيَّةِ،ثُمَّ أَقَرَّهَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْأَنْصَارِيِّ الَّذِي وُجِدَ مَقْتُولًا فِي جُبِّ الْيَهُودِ» فَقَالَتِ الْأَنْصَارُ: الْيَهُودُ قَتَلُوا صَاحِبَنَا";
nasai.urdu = "حضرت ابن مسیب رحمہ اللہ بیان کرتے ہیں کہ قسامت جاہلیت میں تھی،پھر رسول اللہﷺ نے اسے ایک انصاری کے بارے میں برقرار رکھا جو یہودیوں کے ایک کنویں میں مقتول پائے گئے تھے۔انصار نے دعویٰ کر دیا تھا کہ یہودیوں نے ہمارے آدمی کو قتل کیا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;