var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا مِسْعَرٌ وَابْنُ أَبِي خَالِدٍ وَالْبَخْتَرِيُّ بْنُ أَبِي الْبَخْتَرِيِّ كُلُّهُمْ سَمِعُوهُ مِنْ أَبِي بَكْرِ بْنِ عُمَارَةَ بْنِ رُوَيْبَةَ الثَّقَفِيِّ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَنْ يَلِجَ النَّارَ مَنْ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا";
nasai.urdu = "حضرت عمارہ بن رویبہ ثقفی رضی اللہ عنہ سے مروی ہے،انھوں نے کہا: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’وہ آدمی ہرگز آگ میں داخل نہ ہوگا جس نے سورج طلوع اور غروب ہونے سے قبل کی نمازیں (فجر اور عصر) ادا کیں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;