var nasai = {};
nasai.arabic = "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ،قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،عَنْ شُعْبَةَ،عَنْ سُلَيْمَانَ،قَالَ: سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُرَّةَ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ،النَّفْسُ بِالنَّفْسِ،وَالثَّيِّبُ الزَّانِي،وَالتَّارِكُ دِينَهُ الْمُفَارِقُ»";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’کسی مسلمان آدمی کا خون بہانا جائز نہیں،البتہ تین جرموں میں اسے قتل کیا جا سکتا ہے: اس نے کسی کو مار دیا ہو تو اسے اس کے بدلے میں قتل کیا جائے گا یا شادی شدک شخص زنا کرے یا جو شخص دین اسلام چھوڑ کر مسلمانوں کی جماعت سے الگ ہو جائے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;