var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ قَالَ: حَدَّثَنَا أَبِي قَالَ: حَدَّثَنَا أَبُو يُونُسَ،عَنْ سِمَاكِ بْنِ حَرْبٍ أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ حَدَّثَهُ،أَنَّ أَبَاهُ حَدَّثَهُ قَالَ: إِنِّي لَقَاعِدٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ نَحْوَهُ";
nasai.urdu = "وائل رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ میں رسول اللہﷺ کے پاس بیٹھا تھا کہ ایک آدمی ایک دوسرے شخص کو کھینچتا ہوا لایا۔باقی روایت مذکورہ روایت کے اہم معنی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;