var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي قَتَادَةُ عَنْ أَبِي حَسَّانَ عَنْ عَبِيدَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شَغَلُونَا عَنْ الصَّلَاةِ الْوُسْطَى حَتَّى غَرَبَتْ الشَّمْسُ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے منقول ہے،نبی ﷺ نےفرمایا: ’’(کافروں نے) ہمیں صلاۃ وسطیٰ سے مصروف رکھا حتیٰ کہ سورج غروب ہوگیا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;