var nasai = {};
nasai.arabic = "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا خَالِدٌ،قَالَ: حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ،وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ»";
nasai.urdu = "حضرت سمرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو شخص اپنے غلام کو قتل کرے گا،ہم اسے قتل کر دیں گے اور جو اپنے غلام کے ناک کان کاٹے گا،ہم اس کے ناک کان کاٹ دیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;