var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ،وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ»";
nasai.urdu = "حضرت سمرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی کریمﷺ نے فرمایا: ’’جو شخص اپنے غلام کو قتل کرے گا،ہم اسے قتل کریں گے اور جو شخص اپنے غلام کی ناک کان کاٹے گا،ہم اس کی ناک کان کاٹ دیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;