var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: أَنْبَأَنَا عَبْدَةُ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،رَضِيَ اللَّهُ عَنْهُ: «أَنَّ يَهُودِيًّا قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا،فَأَقَادَهُ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَا»";
nasai.urdu = "حضرت انس رضی اللہ تعالٰی عنہ سے روایت ہے کہ ایک یہودی نے ایک لڑکی کو اس کی بالیاں اتارنے کی خاطر قتل کر دیا۔رسول اللہﷺ نے اس یہودی کو اس لڑکی کے عوض قتل کر دیا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;