var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنِي يَحْيَى عَنْ هِشَامٍ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ قَالَ حَدَّثَنِي أَبُو الْمَلِيحِ قَالَ كُنَّا مَعَ بُرَيْدَةَ فِي يَوْمٍ ذِي غَيْمٍ فَقَالَ بَكِّرُوا بِالصَّلَاةِ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ صَلَاةَ الْعَصْرِ فَقَدْ حَبِطَ عَمَلُهُ";
nasai.urdu = "ابوملیح بیان کرتے ہیں کہ ہم ایک ابرآلود دن میں حضرت بریدہ رضی اللہ عنہ کے ساتھ تھے تو انھوں نے کہا: نماز (عصر) جلدی پڑھ لو کیونکہ اللہ کے رسول ﷺ نے فرمایا: ’’جس نے عصر کی نماز چھوڑ دی اس کا عمل ضائع ہوگیا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;