var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا خَالِدٌ،عَنْ عُيَيْنَةَ،قَالَ: أَخْبَرَنِي أَبِي قَالَ: قَالَ أَبُو بَكْرَةَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ»";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی ذمی کو ناحق قتل کرے،اللہ تعالیٰ نے اس پر جنت حرام فرما دی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;