var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ،قَالَ: حَدَّثَنَا إِسْمَعِيلُ،عَنْ يُونُسَ،عَنْ الْحَكَمِ بْنِ الْأَعْرَجِ،عَنْ الْأَشْعَثِ بْنِ ثُرْمُلَةَ،عَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ نَفْسًا مُعَاهِدَةً بِغَيْرِ حِلِّهَا،حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ أَنْ يَشُمَّ رِيحَهَا»";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جس شخص نے کسی ذمی کو ناحق قتل کیا،اللہ تعالیٰ نے اس پر جنت تو ایک طرف اس کی خوشبو سونگھنا تک حرام کر دیا ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;