var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ،قَالَ: حَدَّثَنَا النَّضْرُ،قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ هِلَالِ بْنِ يَسَافٍ،عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ،عَنْ رَجُلٍ،مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَتَلَ رَجُلًا مِنْ أَهْلِ الذِّمَّةِ لَمْ يَجِدْ رِيحَ الْجَنَّةِ،وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ عَامًا»";
nasai.urdu = "نبی کریمﷺکے ایک صحابی سے منقول ہے کہ نبی کریمﷺ نے فرمایا: ’’جو شخص کسی ذمی کو قتل کرے گا وہ جنت کی خوشبو بھی نہیں پائے گا حالانکہ اس کی خوشبو ستر سال کے فاصلے سے آتی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;