var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ دُحَيْمٌ قَالَ: حَدَّثَنَا مَرْوَانُ،قَالَ: حَدَّثَنَا الْحَسَنُ وَهُوَ ابْنُ عَمْرٍو عَنْ مُجَاهِدٍ،عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ قَتِيلًا مِنْ أَهْلِ الذِّمَّةِ،لَمْ يَجِدْ رِيحَ الْجَنَّةِ،وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا»";
nasai.urdu = "حضرت عبداللہ بن عمروبن رضی اللہ عنہ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: ’۔جس شخص نے کسی ذمی کو قتل کیا،وہ جنت کی خوشبو تک نہیں پا سکے گا جبکہ اس کی خوشبو تو چالیس سال کے فاصلے سے محسوس ہوتی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;