var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: أَنْبَأَنَا أَبُو خَالِدٍ سُلَيْمَانُ بْنُ حَيَّانَ قَالَ: حَدَّثَنَا حُمَيْدٌ،عَنْ أَنَسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْقِصَاصِ فِي السِّنِّ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كِتَابُ اللَّهِ الْقِصَاصُ»";
nasai.urdu = "حضرت انس رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے دانت میں قصاص کا حکم جاری فرمایا اور رسول اللہﷺ نے فرمایا: ’’اللہ کا حکم قصاص ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;