var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ،وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ»";
nasai.urdu = "حضرت سمرہ رضی اللہ تعالٰی عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص اپنے غلام کو قتل کرے گا،ہم اسے قتل کر دیں گے اور جو کوئی اپنے غلام کی ناک یا کان کاٹ دے،ہم اس کی ناک کان کاٹ دیں گے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;