var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،وَمُحَمَّدُ بْنُ بَشَّارٍ،قَالَا: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ،قَالَ: حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ،أَنَّ نَبِيَّ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ خَصَى عَبْدَهُ خَصَيْنَاهُ،وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ»،«وَاللَّفْظُ لِابْنِ بَشَّارٍ»";
nasai.urdu = "حضرت سمرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ اللہ کے نبیﷺ نے فرمایا: ’’جو شخص اپنے غلام کو خصی کرے،ہم اسے خصی کر دیں گے اور جو اپنے غلام کی ناک کان کاٹے گا،ہم اس کی ناک کان کاٹیں گے۔‘‘\nیہ الفاظ ابن بشار کے ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;