var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ،قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ،عَنْ شُعْبَةَ،عَنْ قَتَادَةَ،عَنْ زُرَارَةَ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،أَنَّ يَعْلَى قَالَ: فِي الَّذِي عَضَّ فَنَدَرَتْ ثَنِيَّتُهُ،إِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا دِيَةَ لَكَ»";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے مروی ہے کہ حضرت یعلی رضی اللہ تعالٰی عنہ نے اس آدمی کے بارے میں جس نے دوسرے کو کاٹا تھا جس سے اس کا دانت گر گیا تھا،فرمایا کہ نبی اکرمﷺ نے (اس جیسے مقدمے میں) فرمایا تھا: ’’جاؤ تجھے کوئی دیت نہیں ملے گی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;