var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ بْنِ عَبْدِ الْجَبَّارِ،عَنْ سُفْيَانَ،عَنْ عَمْرٍو،عَنْ عَطَاءٍ،عَنْ صَفْوَانَ بْنِ يَعْلَى،عَنْ أَبِيهِ: «أَنَّ رَجُلًا عَضَّ يَدَ رَجُلٍ،فَانْتُزِعَتْ ثَنِيَّتُهُ،فَأَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَهْدَرَهَا»";
nasai.urdu = "حضرت یعلی رضی اللہ تعالٰی عنہ سے روایت ہے کہ ایک آدمی نے دوسرے آدمی کے بازو پر کاٹ کھایا جس سے اس کا سامنے والا دانت اکھڑ گیا۔وہ آپ کے پاس (دیت لینے کے لیے) آیا تو آپ نے اسے رائیگاں قرار دیا۔(اس کا کوئی معاوضہ نہیں دلوایا)۔";
nasai.hukam = "صحیح";
nasai.description = ``;