var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْجَبَّارِ مَرَّةً أُخْرَى،عَنْ سُفْيَانَ،عَنْ عَمْرٍو،عَنْ عَطَاءٍ،عَنْ صَفْوَانَ بْنِ يَعْلَى،عَنْ يَعْلَى،وَابْنُ جُرَيْجٍ،عَنْ عَطَاءٍ،عَنْ صَفْوَانَ بْنِ يَعْلَى،عَنْ يَعْلَى: أَنَّهُ اسْتَأْجَرَ أَجِيرًا فَقَاتَلَ رَجُلًا،فَعَضَّ يَدَهُ،فَانْتُزِعَتْ ثَنِيَّتُهُ،فَخَاصَمَهُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: «أَيَدَعُهَا يَقْضَمُهَا كَقَضْمِ الْفَحْلِ؟»";
nasai.urdu = "حضرت یعلی رضی اللہ تعالٰی عنہ سے منقول ہے کہ انھوں نے ایک شخص کو نوکر رکھا۔وہ کسی آدمی سے لڑ پڑا اور اس کا ہاتھ کاٹ کھایا۔ساتھ ہی دانت بھی اکھڑ گیا۔وہ یہ مقدمہ نبیﷺ کی عدالت میں لے گیا۔آپ نے فرمایا: ’’کیا وہ اپنا ہاتھ (تیرے منہ میں) چھوڑ دیتا کہ تو اسے اونٹ کی طرح چباتا رہتا؟‘‘";
nasai.hukam = "حسن";
nasai.description = ``;