var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ فِي حَدِيثِ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ،عَنْ شُعْبَةَ،عَنْ قَتَادَةَ،عَنْ عَطَاءٍ،عَنْ ابْنِ يَعْلَى،عَنْ أَبِيهِ،بِمِثْلِ الَّذِي عَضَّ،فَنَدَرَتْ ثَنِيَّتُهُ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا دِيَةَ لَكَ»";
nasai.urdu = "حضرت یعلی رضی اللہ تعالٰی عنہ سے اس شخص کے بارے میں جس نے ساتھ کو کاٹ کھایا تھا اور اس کا دانت اکھڑ گیا تھا،سابقہ روایت کی طرح بیان ہے کہ نبی اکرمﷺ نے فرمایا تھا: ’’تجھے کوئی دیت نہیں ملے گی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;