var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: أَنْبَأَنَا عَبْدُ الرَّحْمَنِ،قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيُّ،عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ،عَنْ أَنَسٍ قَالَ: «أُتِيَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي قِصَاصٍ فَأَمَرَ فِيهِ بِالْعَفْوِ»";
nasai.urdu = "حضرت انس رضی اللہ تعالٰی عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہﷺ کے پاس قصاص کا ایک مقدمہ آیا تو آپ نے معاف کرنے کا مشورہ دیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;