var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ،قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،وَبَهْزُ بْنُ أَسَدٍ،وَعَفَّانُ بْنُ مُسْلِمٍ،قَالُوا: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ الْمُزَنِيُّ،قَالَ: حَدَّثَنَا عَطَاءُ بْنُ أَبِي مَيْمُونَةَ،وَلَا أَعْلَمُهُ إِلَّا عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: «مَا أُتِيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي شَيْءٍ فِيهِ قِصَاصٌ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ»";
nasai.urdu = "حضرت انس بن مالک رضی اللہ تعالٰی عنہ سے روایت ہے،انھوں نے فرمایا: جب بھی نبی اکرمﷺ کے پاس قصاص کا کوئی مقدمہ آیا آپ نے معافی کا مشورہ دیا۔";
nasai.hukam = "حسن";
nasai.description = ``;