var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدَ،قَالَ: أَخْبَرَنِي أَبِي قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،قَالَ: حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ،قَالَ: حَدَّثَنِي أَبُو سَلَمَةَ،قَالَ: حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ،إِمَّا أَنْ يُقَادَ وَإِمَّا أَنْ يُفْدَى»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جس شخص کا رشتہ دار مارا جائے،اسے دو میں سے بہتر چیز کا اختیار ہے: قصاص لے یا دیت۔";
nasai.hukam = "حسن";
nasai.description = ``;