var nasai = {};
nasai.arabic = "أَخْبَرَنَاإِبْرَاهِيمَ بْنِ مُحَمَّدٍ،قَالَ: أَنْبَأَنَا ابْنُ عَائِذٍ،قَالَ: حَدَّثَنَا يَحْيَى هُوَ ابْنُ حَمْزَةَ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،قَالَ: حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ،قَالَ: حَدَّثَنِي أَبُو سَلَمَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ لَهُ قَتِيلٌ» مُرْسَلٌ";
nasai.urdu = "حضرت ابو سلمہ بیان کرتے ہیں کہ رسول اللہﷺ نے فرمایا: ’’جس شخص کا رشتہ دار مارا جائے۔‘‘ یہ روایت مرسل ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;