var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا الْوَلِيدُ،عَنْ الْأَوْزَاعِيِّ،قَالَ: حَدَّثَنِي حِصْنٌ،قَالَ: حَدَّثَنِي أَبُو سَلَمَةَ،ح وَأَنْبَأَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ،قَالَ: حَدَّثَنَا الْوَلِيدُ،قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،قَالَ: حَدَّثَنِي حِصْنٌ،أَنَّهُ سَمِعَ أَبَا سَلَمَةَ يُحَدِّثُ،عَنْ عَائِشَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَعَلَى الْمُقْتَتِلِينَ أَنْ يَنْحَجِزُوا الْأَوَّلَ فَالْأَوَّلَ،وَإِنْ كَانَتِ امْرَأَةٌ»";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’(قصاص کے لیے) لڑنے والوں کے لیے مناسب ہے کہ وہ قصاص سے رک جائیں۔(جلدی نہ کریں)۔وارثوں میں معاف کرنے کا حق اسے ہے جو ان میں سے زیادہ قریبی ہو،خواہ وہ عورت ہو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4538)`;
nasai.anwaar = [357,1];