var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ،قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ،قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ أَيُّوبَ السَّخْتِيَانِيِّ،عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قَتِيلُ الْخَطَإِ شِبْهِ الْعَمْدِ بِالسَّوْطِ أَوِ الْعَصَا،مِائَةٌ مِنَ الْإِبِلِ أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلَادُهَا»";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے مروی ہے کہ نبی اکرمﷺ نے فرمایا: ’’جو غلطی سے مارا جائے شبہ عمد کی صورت میں،یعنی کوڑے اور ڈنڈے وغیرہ سے،اس کی دیت ایک سو اونٹ ہیں جن میں سے چالیس حاملہ اونٹنیاں ہوں گی۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;