var nasai = {};
nasai.arabic = "أَخْبَرَنِي يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ،قَالَ: أَنْبَأَنَا حَمَّادٌ،عَنْ خَالِدٍ يَعْنِي الْحَذَّاءَ،عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ،عَنْ عُقْبَةَ بْنِ أَوْسٍ،عَنْ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَا وَإِنَّ قَتِيلَ الْخَطَإِ شِبْهِ الْعَمْدِ مَا كَانَ بِالسَّوْطِ وَالْعَصَا،مِائَةٌ مِنَ الْإِبِلِ أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا»";
nasai.urdu = "حضرت عبداللہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’آگاہ رہو! جو شخص شبہ عمد والی صورت میں غلطی سے مارا جائے،مثلاً: کوڑے اور ڈنڈے وغیرہ سے،اس کی دیت سو اونٹ ہے جن میں سے چالیس اونٹنیاں حاملہ ہوں گی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;