var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ،عَنْ ابْنِ أَبِي عَدِيٍّ،عَنْ خَالِدٍ،عَنْ الْقَاسِمِ،عَنْ عُقْبَةَ بْنِ أَوْسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَا إِنَّ قَتِيلَ الْخَطَإِ قَتِيلَ السَّوْطِ وَالْعَصَا،فِيهِ مِائَةٌ مِنَ الْإِبِلِ مُغَلَّظَةٌ،أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلَادُهَا»";
nasai.urdu = "حضرت عقبہ بن اوس سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کوڑے یا ڈنڈے سونٹے کے ساتھ غلطی سے مارا جائے،اس کی دیت مغلظہ،یعنی سخت ہوگی،سو اونٹ جن میں سے چالیس اونٹنیاں حاملہ ہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;