var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ عَنْ يِحْيَى بْنِ أَبِى كَثِيرٍ عَنْ ابْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَنَفَّسَ فِي الْإِنَاءِ وَأَنْ يَمَسَّ ذَكَرَهُ بِيَمِينِهِ وَأَنْ يَسْتَطِيبَ بِيَمِينِهِ";
nasai.urdu = "حضرت ابو قتادہ رضی اللہ عنہ سےروایت ہے،نبی ﷺ نے منع فرمایا کہ کوئی شخص برتن میں سانس لے،اپنی شرم گاہ کو دائیں ہاتھ سے چھوئے یا دائیں ہاتھ سے صفائی (استنجا) کرے۔";
nasai.hukam = "صحیح";
nasai.description = ``;