var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ،قَالَ: أَنْبَأَنَا يَزِيدُ،عَنْ خَالِدٍ،عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ،عَنْ يَعْقُوبَ بْنِ أَوْسٍ: أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ قَالَ: «أَلَا وَإِنَّ قَتِيلَ الْخَطَإِ الْعَمْدِ قَتِيلَ السَّوْطِ وَالْعَصَا،مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا»";
nasai.urdu = "نبی کریمﷺ کے ایک صحابی سے روایت ہے کہ نبی اکرمﷺ فتح مکہ کے سال مکہ مکرمہ میں داخل ہوئے تو فرمایا: ’۔خبردار! جو شخص شبہ عمد کی صورت میں کوڑے یا سونٹے کے ساتھ غلطی سے قتل ہو جائے،اس کی دیت میں سے چالیس اونٹنیاں ایسی ہوں جن کے پیٹ میں بچے ہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;