var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،قَالَ: حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ،قَالَ: حَدَّثَنَا حُمَيْدٌ،عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْخَطَأُ شِبْهُ الْعَمْدِ-يَعْنِي بِالْعَصَا وَالسَّوْطِ-مِائَةٌ مِنَ الْإِبِلِ،مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا»";
nasai.urdu = "حضرت قاسم بن ربیعہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’قتل خطا شبہ عمد کی صورت میں،یعنی جو کوڑے یا سونٹے کے ساتھ ہو،اس میں دیت سو اونٹ ہے جن میں سے چالیس اونٹنیاں حاملہ ہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;