var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ،قَالَ: حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ،عَنْ حَجَّاجٍ،عَنْ زَيْدِ بْنِ جُبَيْرٍ،عَنْ خِشْفِ بْنِ مَالِكٍ قَالَ: سَمِعْتُ ابْنَ مَسْعُودٍ يَقُولُ: «قَضَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دِيَةَ الْخَطَإِ عِشْرِينَ بِنْتَ مَخَاضٍ،وَعِشْرِينَ ابْنَ مَخَاضٍ ذُكُورًا،وَعِشْرِينَ بِنْتَ لَبُونٍ،وَعِشْرِينَ جَذَعَةً،وَعِشْرِينَ حِقَّةً»";
nasai.urdu = "حضرت ابن مسعود رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ رسول اللہﷺ نے قتل خطا کی دیت کے بارے میں فیصلہ فرمایا کہ ان میں بیس بنت مخاص (ایک سالہ اونٹنی) بیس ابن مخاض (ایک سالہ مذکر) بیس بنت لبون (دو سالہ اونٹنی) بیس جذعے (چار سالہ اونٹنی) اور بیس حقے (تیس سالہ اونٹنی) ہوں گے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4545) ترمذی (1386) ابن ماجہ (2631)`;
nasai.anwaar = [357,1];