var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ،قَالَ: حَدَّثَنَا ضَمْرَةُ،عَنْ إِسْمَعِيلَ بْنِ عَيَّاشٍ،عَنْ ابْنِ جُرَيْجٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ: قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَقْلُ الْمَرْأَةِ مِثْلُ عَقْلِ الرَّجُلِ حَتَّى يَبْلُغَ الثُّلُثَ مِنْ دِيَتِهَا»";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا (حضرت عبداللہ بن عمرو رضی اللہ عنہ) سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’عورت کی دیت مرد کے برابر ہے حتیٰ کہ تہائی کو پہنچ جائے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن جریج مکي حجازي وعنعن وھو مدلس۔<br>وإسماعیل بن عیاش الشامي ضعیف عن غیر أھل بلدہ أي عن غیر الشامیین (الفتح المبین: 68/ 3 ص 87)<br>والحدیث الآتي (الأصل: 4810) یغني عنہ۔`;
nasai.anwaar = [357,1];