var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ حَدَّثَنِي عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ عِرَاكِ بْنِ مَالِكٍ قَالَ سَمِعْتُ نَوْفَلَ بْنَ مُعَاوِيَةَ يَقُولُ صَلَاةٌ مَنْ فَاتَتْهُ فَكَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ قَالَ ابْنُ عُمَرَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ صَلَاةُ الْعَصْرِ";
nasai.urdu = "عراک بن مالک نے کہا کہ میں نے نوفل بن معاویہ رضی اللہ عنہ کو فرماتے سنا: ایک نماز ایسی ہے کہ جس سے وہ رہ جائے گویا اس کے اہل و مال لوٹ لیے گئے۔حضرت ابن عمر رضی اللہ عنہما نے کہا: رسول اللہ ﷺ نے فرمایا: ’’وہ عصر کی نماز ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;