var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ،عَنْ مُحَمَّدِ بْنِ رَاشِدٍ،عَنْ سُلَيْمَانَ بْنِ مُوسَى،وَذَكَرَ كَلِمَةً مَعْنَاهَا عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ: قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَقْلُ أَهْلِ الذِّمَّةِ نِصْفُ عَقْلِ الْمُسْلِمِينَ وَهُمُ الْيَهُودُ وَالنَّصَارَى»";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’ذمی کی دیت مسلمان سے نصف ہے۔ذمی سے مراد یہود ونصاریٰ ہیں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;