var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ،قَالَ: أَنْبَأَنَا ابْنُ وَهْبٍ،قَالَ: أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَقْلُ الْكَافِرِ نِصْفُ عَقْلِ الْمُؤْمِنِ»";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’کافر کی دیت مومن کی دیت سے نصف ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;