var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،قَالَ: حَدَّثَنَا وَكِيعٌ،قَالَ: حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ،عَنْ يَحْيَى،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ: قَالَ: «قَضَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمُكَاتَبِ يُقْتَلُ بِدِيَةِ الْحُرِّ عَلَى قَدْرِ مَا أَدَّى»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہﷺ نے مکاتب کے بارے میں،جسے قتل کر دیا جائے،فیصلہ فرمایا کہ جس قدر وہ مکاتبت ادا کر چکا ہے،اتنی آزاد کی دیت دی جائے گی۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4581)`;
nasai.anwaar = [357,1];