var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ،قَالَ: حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الطَّائِفِيُّ،قَالَ: حَدَّثَنَا مُعَاوِيَةُ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ: «أَنَّ نَبِيَّ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الْمُكَاتَبِ أَنْ يُودَى بِقَدْرِ مَا عَتَقَ مِنْهُ دِيَةَ الْحُرِّ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ اللہ کے نبیﷺ نے مکاتب کے بارے میں فیصلہ فرمایا کہ (اگر وہ قتل کر دیا جائے تو) جس قدر وہ آزاد ہو چکا ہے،اتنی دیت آزاد کی دی جائے گی۔";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف<br>انظر الحدیث السابق (4812)`;
nasai.anwaar = [357,1];