var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا يَعْلَى،عَنْ الْحَجَّاجِ الصَّوَّافِ،عَنْ يَحْيَى،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ قَالَ: «قَضَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمُكَاتَبِ يُودَى بِقَدْرِ مَا أَدَّى مِنْ مُكَاتَبَتِهِ دِيَةَ الْحُرِّ،وَمَا بَقِيَ دِيَةَ الْعَبْدِ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہﷺ نے مکاتب کے بارے میں فیصلہ فرمایا کہ مکاتب غلام جس قدر مال مکاتبت ادا کر چکا ہے،اس کی اتنی دیت آزاد کے حساب سے دی جائے گی اور باقی غلام کے لحاظ سے۔";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف<br>انظر الحدیثین السابقین (4812،4813)`;
nasai.anwaar = [357,1];