var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ النَّقَّاشِ،قَالَ: حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ،قَالَ: أَنْبَأَنَا حَمَّادٌ،عَنْ قَتَادَةَ،عَنْ خِلَاسٍ،عَنْ عَلِيٍّ،وَعَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُكَاتَبُ يَعْتِقُ بِقَدْرِ مَا أَدَّى،وَيُقَامُ عَلَيْهِ الْحَدُّ بِقَدْرِ مَا عَتَقَ مِنْهُ،وَيَرِثُ بِقَدْرِ مَا عَتَقَ مِنْهُ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’مکتابت اتنا آزاد ہے جس قدر وہ مکاتبت ادا کر چکا ہے اور وہ جس قدر آزاد ہے،اتنی اس پر حد لگائی جائے گی اور جس قدر وہ آزاد ہے،اتنا وہ وارث بنے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;