var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ،قَالَ: حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ،قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ،وَعَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ: «أَنَّ مُكَاتَبًا قُتِلَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ أَنْ يُودَى مَا أَدَّى دِيَةَ الْحُرِّ،وَمَالًا دِيَةَ الْمَمْلُوكِ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ کے دور مبارک میں ایک مکاتب کو قتل کر دیا گیا تو آپ نے حکم دیا کہ جس قدر وہ مال مکاتبت ادا کر چکا ہے،اتنے حصے کی دیت آزاد کے حسا ب سے دی جائے اور باقی کی غلام کے لحاظ سے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;