var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ،قَالَ: حَدَّثَنَا يَزِيدُ،قَالَ: أَنْبَأَنَا كَهْمَسٌ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ أَنَّهُ رَأَى رَجُلًا يَخْذِفُ فَقَالَ: لَا تَخْذِفْ،فَإِنَّ نَبِيَّ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَى عَنِ الْخَذْفِ أَوْ يَكْرَهُ الْخَذْفَ شَكَّ كَهْمَسٌ";
nasai.urdu = "حضرت عبداللہ بن مغفل رضی اللہ تعالٰی عنہ نے ایک آدمی کو خذف کرتے دیکھا تو فرمایا: خذف نہ کر کیونکہ نبی اکرمﷺ نے خذف سے منع فرمایا ہے یا آپ اسے ناپسند فرماتے تھے۔کَھْمَس کو شک ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;