var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا حَمَّادٌ،عَنْ عَمْرٍو،عَنْ طَاوُسٍ،أَنَّ عُمَرَ اسْتَشَارَ النَّاسَ فِي الْجَنِينِ،فَقَالَ حَمَلُ بْنُ مَالِكٍ: «قَضَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنِينِ غُرَّةً» قَالَ طَاوُسٌ: «إِنَّ الْفَرَسَ غُرَّةٌ»";
nasai.urdu = "حضرت طاؤس سے روایت ہے کہ حضرت عمر رضی اللہ تعالٰی عنہ نے پیٹ کے بچے کی دیت کے بارے میں لوگوں سے مشورہ کیا تو حضرت حمل بن مالک رضی اللہ تعالٰی عنہ نے فرمایا کہ رسول اللہﷺ نے پیٹ کے بچے کی دیت غرہ مقرر فرمائی ہے۔حضرت طاؤس نے کہا کہ گھوڑا بھی غرہ ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;