var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ،قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ،قَالَ: أَخْبَرَنِي مَالِكٌ،عَنْ ابْنِ شِهَابٍ،عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي هُرَيْرَةَ: أَنَّ امْرَأَتَيْنِ مِنْ هُذَيْلٍ فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَمَتْ إِحْدَاهُمَا الْأُخْرَى،فَطَرَحَتْ جَنِينَهَا،فَقَضَى فِيهِ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ رسول اللہﷺ کے دور مبارک میں قبیلہ ہذیل کی دو عورتوں میں سے ایک نے دوسری کو پتھر دے مارا اور اس کا حمل گرا دیا تو رسول اللہﷺ نے اس کی دیت غرہ مقرر کی،یعنی ایک غلام یا لونڈی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;