var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ،قَالَ: حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ،عَنْ ابْنِ جُرَيْجٍ،قَالَ: أَخْبَرَنِي أَبُو الزُّبَيْرِ،أَنَّهُ سَمِعَ جَابِرًا يَقُولُ: «كَتَبَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ بَطْنٍ عُقُولَةً،وَلَا يَحِلُّ لِمَوْلًى أَنْ يَتَوَلَّى مُسْلِمًا بِغَيْرِ إِذْنِهِ»";
nasai.urdu = "حضرت جابر رضی اللہ تعالٰی عنہ سے روایت ہے،انھوں نے فرمایا: رسول اللہﷺ نے یہ تحریر لکھوائی کہ ہر قبیلے کو اپنے لوگوں پر عائد شدہ دیتیں دینی ہوں گی،نیز کسی آزاد شدہ غلام کے لیے جائز نہیں کہ وہ اپنے مولیٰ کی اجازت کے بغیر کسی اور مسلمان کو مولیٰ بنا لے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;