var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ،قَالَ: حَدَّثَنَا سُفْيَانُ،قَالَ: حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ،عَنْ إِيَادِ بْنِ لَقِيطٍ،عَنْ أَبِي رِمْثَةَ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَعَ أَبِي فَقَالَ: «مَنْ هَذَا مَعَكَ؟» قَالَ: ابْنِي،أَشْهَدُ بِهِ،قَالَ: «أَمَا إِنَّكَ لَا تَجْنِي عَلَيْهِ،وَلَا يَجْنِي عَلَيْكَ»";
nasai.urdu = "حضرت ابو رمثہ رضی اللہ تعالٰی عنہ سے روایت ہے،انھوں نے فرمایا: میں نبی اکرمﷺ کے پاس اپنے والد کے ساتھ حاضر ہوا۔آپ نے (میرے والد سے) فرمایا: ’’یہ تیرے ساتھ کون ہے؟‘‘ انھوں نے کہا: میں گواہی دیتا ہوں،یہ میرا بیٹا ہے۔آپ نے فرمایا: ’’خبردار! تیرے جرم کا یہ ذمہ دار نہیں اور تو اس کے جرم کا ذمہ دار نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;