var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي الْحَكَمُ قَالَ صَلَّى بِنَا سَعِيدُ بْنُ جُبَيْرٍ بِجَمْعٍ الْمَغْرِبَ ثَلَاثًا بِإِقَامَةٍ ثُمَّ سَلَّمَ ثُمَّ صَلَّى الْعِشَاءَ رَكْعَتَيْنِ ثُمَّ ذَكَرَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ فَعَلَ ذَلِكَ وَذَكَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ ذَلِكَ";
nasai.urdu = "حضرت حکم سے روایت ہے،انھوں نے کہا: جناب سعید بن جبیر نے ہمیں مزدلفہ میں مغرب کی نماز اقامت کے ساتھ تین رکعت پڑھائی،پھر سلام پھیرا،پھر عشاء کی نماز دو رکعتیں پڑھائیں اور کہا: حضرت عبداللہ بن عمر رضی اللہ عنہما نے ایسے کیا۔اور انھوں (ابن عمر) نے بیان کیا کہ رسول اللہ ﷺ نے ایسے ہی کیا تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;