var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ،قَالَ: حَدَّثَنَا حَفْصُ بْنُ عَبْدِ الرَّحْمَنِ،قَالَ: حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ،عَنْ مَطَرٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْأَسْنَانُ سَوَاءٌ خَمْسًا خَمْسًا»";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’سب دانت (دیت میں) بورابر ہیں۔‘‘ یعنی ہر ایک میں پانچ پانچ اونٹ";
nasai.hukam = "حسن";
nasai.description = ``;