var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ صَلَّى بِجَمْعٍ فَأَقَامَ فَصَلَّى الْمَغْرِبَ ثَلَاثًا ثُمَّ صَلَّى الْعِشَاءَ رَكْعَتَيْنِ ثُمَّ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ فِي هَذَا الْمَكَانِ";
nasai.urdu = "جناب سعید بن جبیر نے کہا: میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما کو دیکھا،آپ نے مزدلفہ میں اقامت کہی اور مغرب کی نماز تین رکعت پڑھی،پھر عشاء کی نماز دورکعت پڑھی،پھر فرمایا: میں نے رسول اللہ ﷺ کو اس جگہ اسی طرح کرتے دیکھا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;