var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ،قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ: أَنَّهُ لَمَّا وُجِدَ الْكِتَابُ الَّذِي عِنْدَ آلِ عَمْرِو بْنِ حَزْمٍ الَّذِي ذَكَرُوا،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَتَبَ لَهُمْ وَجَدُوا فِيهِ: «وَفِيمَا هُنَالِكَ مِنَ الْأَصَابِعِ عَشْرًا عَشْرًا»";
nasai.urdu = "حضرت سعید بن مسیب سے روایت ہے کہ جب میں نے وہ دستاویز دیکھی جو عمرو بن حزم رضی اللہ تعالٰی عنہ کی اولاد کے پاس تھی اور جس کے بارے میں ان کا دعویٰ تھا کہ رسول اللہﷺ نے یہ تحریر خود لکھوا کر ان کو دی،اس میں یہ بھی لکھا تھا کہ انگلیوں کی دیت دس دس اونٹ ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;