var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،قَالَ: حَدَّثَنَا شُعْبَةُ،قَالَ: حَدَّثَنِي قَتَادَةُ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَذِهِ وَهَذِهِ سَوَاءٌ» يَعْنِي الْخِنْصَرَ وَالْإِبْهَامَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’یہ اور یہ برابر ہیں۔‘‘ یعنی انگوٹھا اور چھنگلی۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;