var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْهَيْثَمِ،قَالَ: حَدَّثَنَا حَجَّاجٌ،قَالَ: حَدَّثَنَا هَمَّامٌ،قَالَ: حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ،وَابْنُ جُرَيْجٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي خُطْبَتِهِ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ: «الْأَصَابِعُ سَوَاءٌ»";
nasai.urdu = "حضرت عمرو بن شعیب اپنے باپ سے،وہ (شعیب) اپنے دادا سے بیان کرتے ہیں کہ نبی اکرمﷺ نے اپنے خطبے میں فرمایا جب کہ آپ نے کعبہ کے ساتھ اپنی پشت کی ٹیک لگا رکھی تھی: ’’تمام انگلیاں (دیت کے لحاظ سے) برابر ہیں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;