var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ،قَالَ: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،قَالَ: حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،أَنَّ أَبَاهُ حَدَّثَهُ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: لَمَّا افْتَتَحَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَالَ فِي خُطْبَتِهِ: «وَفِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ»";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: جب رسول اللہﷺ نے مکہ مکرمہ فتح کیا تو اپنے خطبے میں ارشاد فرمایا: ’’ہڈی کو ننگا کر دینے والے زخموں میں دیت پانچ پانچ اونٹ ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;