var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،قَالَ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ،قَالَ: حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ النَّضْرِ بْنِ أَنَسٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اطَّلَعَ فِي بَيْتِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَفَقَئُوا عَيْنَهُ،فَلَا دِيَةَ لَهُ،وَلَا قِصَاصَ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: جو شخص کسی کے گھر میں بغیر اجازت لیے جھانکنے لگے اور وہ اس کی آنکھ پھوڑ دیں تو اس کو دیت ملے گی نہ قصاص۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;