var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي الزِّنَادِ،عَنْ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ أَنَّ امْرَأً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ فَفَقَأْتَ عَيْنَهُ،مَا كَانَ عَلَيْكَ حَرَجٌ» وَقَالَ مَرَّةً أُخْرَى: «جُنَاحٌ»";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ تعالٰی عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’اگر کوئی شخص تجھے بغیر اجازت جھانکنے لگے اور تو کنکری وغیرہ مار کر اس کی آنکھ پھوڑ دے تو تجھ پر کوئی تاوان وگناہ عائد نہیں ہوگا";
nasai.hukam = "متفق علیہ";
nasai.description = ``;