var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ،قَالَ: أَنْبَأَنَا ابْنُ شُمَيْلٍ،قَالَ: حَدَّثَنَا شُعْبَةُ،قَالَ: أَنْبَأَنَا فِرَاسٌ،قَالَ: سَمِعْتُ الشَّعْبِيَّ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْكَبَائِرُ: الْإِشْرَاكُ بِاللَّهِ،وَعُقُوقُ الْوَالِدَيْنِ،وَقَتْلُ النَّفْسِ،وَالْيَمِينُ الْغَمُوسُ";
nasai.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’بڑے بڑے گناہ یہ ہیں: اللہ تعالیٰ کے ساتھ شریک ٹھہرانا،ماں باپ کی نافرمانی کرنا،کسی بے گناہ جان کو قتل کرنا اور جھوٹی قسم کھانا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;