var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ،قَالَ: حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ،عَنْ الْفُضَيْلِ بْنِ غَزْوَانَ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزْنِي الْعَبْدُ حِينَ يَزْنِي،وَهُوَ مُؤْمِنٌ،وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا،وَهُوَ مُؤْمِنٌ،وَلَا يَسْرِقُ وَهُوَ مُؤْمِنٌ،وَلَا يَقْتُلُ وَهُوَ مُؤْمِنٌ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’۔جب کوئی بندہ زنا کرتا ہے تو وہ مومن نہیں رہتا۔جب کوئی شراب پیتا ہے تو شراب پیتے وقت مومن نہیں رہتا۔جب کوئی چوری کرتا ہے تو مومن نہیں رہتا اور قتل کرتا ہے تو بھی مومن نہیں رہتا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;