var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرَّمِيُّ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ ح وَأَنْبَأَنَا أَحْمَدُ بْنُ حَرْبٍ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ اللَّهُ السَّارِقَ يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ";
nasai.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ چور پر لعنت کرے وہ انڈا چرلیتا ہے تو اس کا ہاتھ کاٹ دیا جاتا ہے۔رسی چرا لیتا ہے تو اس کا ہاتھ کاٹ دیا جاتا ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;