var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ أَخْبَرَنِي ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ نَاسًا فِي تُهْمَةٍ";
nasai.urdu = "حضرت بہز بن حکیم اپنے باپ سے وہ (بہز) ان کے دادا (حضرت معاویہ بن حیدہ قشیریؓ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے کچھ لوگوں کو ایک الزام میں قید کردیا تھا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;