var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ إِسْمَعِيلَ قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ عُمَارَةَ بْنِ رُوَيْبَةَ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَلِجُ النَّارَ أَحَدٌ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ أَنْ تَغْرُبَ";
nasai.urdu = "حضرت عمارہ بن رویبہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’وہ شخص آگ میں نہیں جائے گا جس نے طلوع شمس اور غروبِ شمس سے پہلے نمازیں پڑھیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;