var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ ثُمَّ خَلَّى سَبِيلَهُ";
nasai.urdu = "حضرت بہز بن حکیم کے دادا (حضرت معاویہ بن حیدہ قشیریؓ) سے روایت ہے کہ رسول اللہ ﷺ نے ایک آدمی کو کسی الزام میں قید کردیا تھا،پھر (الزام ثابت نہ ہونے پر) اسے چھوڑ دیا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;