var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ أَنَّ رَجُلًا سَرَقَ ثَوْبًا فَأُتِيَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ هُوَ لَهُ قَالَ فَهَلَّا قَبْلَ الْآنَ";
nasai.urdu = "حضرت عطاء بن ابو رباح سے روایت ہے کہ ایک آدمی نے کپڑا چرالیا۔اسے پکڑ کر رسول اللہ ﷺ کے پاس لایا گیا۔آپ نے اس کا ہاتھ کاٹنے کا حکم دے دیا۔(کپڑے والے) آدمی نے کہا: اے اللہ کے رسول! یہ کپڑا اس کو معاف ہے۔آپ نے فرمایا: ’’اس وقت سے پہلے کیوں نہ (معاف) کیا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;