var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ الْبَرَاءِ قَالَ صَلَّيْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا أَوْ سَبْعَةَ عَشَرَ شَهْرًا شَكَّ سُفْيَانُ وَصُرِفَ إِلَى الْقِبْلَةِ";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہما سے منقول ہے،انھوں نے فرمایا: ہم نے رسول اللہ ﷺ کے ساتھ بیت المقدس کی طرف (منہ کرکے) سولہ (۱۶) یا سترہ(۱۷) مہینے نمازپڑھی،پھر آپ کو موجودہ قبلے (بیت اللہ) کی طرف پھیر دیا گیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;