var nasai = {};
nasai.arabic = "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ سَمِعْتُ ابْنَ جُرَيْجٍ يُحَدِّثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَافَوْا الْحُدُودَ فِيمَا بَيْنَكُمْ فَمَا بَلَغَنِي مِنْ حَدٍّ فَقَدْ وَجَبَ";
nasai.urdu = "حضرت عبداللہ بن عمرو ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تک بات تم میں ہے،تم حدود معاف کرسکتے ہو لیکن اگر کوئی حد والا مقدمہ مجھ تک پہنچ گیا تو (میرے لیے) حد لگانا واجب اور لازم ہو جائے گا۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (4889)`;
nasai.anwaar = [358,1];