var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ امْرَأَةً مَخْزُومِيَّةً كَانَتْ تَسْتَعِيرُ الْمَتَاعَ فَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ ایک مخزومی عروت لوگوں سے گھریلو ساما ن استعمال کے لیے لیا کرتی تھی پھر بعد میں مکر جاتی تھی۔نبی ﷺ نے اس کا ہاتھ کاٹ دینے کا حکم دیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;