var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ كَانَتْ امْرَأَةٌ مَخْزُومِيَّةٌ تَسْتَعِيرُ مَتَاعًا عَلَى أَلْسِنَةِ جَارَاتِهَا وَتَجْحَدُهُ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: ایک مخزومی عورت اپنی پروسنوں کی معرفت چیزیں ادھار لے لیا کرتی تھی،پھر بعد میں مکر جایا کرتی تھی۔رسول اللہ ﷺ نے اس کا ہاتھ کاٹ دینے کا حکم فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;