var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ امْرَأَةً مِنْ بَنِي مَخْزُومٍ اسْتَعَارَتْ حُلِيًّا عَلَى لِسَانِ أُنَاسٍ فَجَحَدَتْهَا فَأَمَرَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُطِعَتْ";
nasai.urdu = "حضرت سعید بن مسیب سے مروی ہے کہ بنو مخزوم کی ایک عورت نے دوسرے لوگوں کے واسطے سے زیور استعمال کے لیے لیا،بعد میں مکر گئی تو رسول اللہ ﷺ کے حکم سے اس کا ہاتھ کاٹ دیا گیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;