var nasai = {};
nasai.arabic = "أَخْبَرَنَا رِزْقُ اللَّهِ بْنُ مُوسَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ فَقَطَعَهُ قَالُوا مَا كُنَّا نُرِيدُ أَنْ يَبْلُغَ مِنْهُ هَذَا قَالَ لَوْ كَانَتْ فَاطِمَةَ لَقَطَعْتُهَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: نبی اکرمﷺ کے پاس ایک چور لایا گیا۔آپ نے اس کا ہاتھ کاٹ دیا۔لوگ کہنے لگے: ہمیں یہ خیال نہ تھا کہ آپ اس کو اس حد تک سزا دیں گے۔آپ نے فرمایا: ’’اگر (اس کے بجائے) فاطمہ ہوتی تو میں اس کا بھی ہاتھ کاٹ دیتا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;