var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عِيسَى بْنِ يَزِيدَ قَالَ حَدَّثَنِي جَرِيرُ بْنُ يَزِيدَ أَنَّهُ سَمِعَ أَبَا زُرْعَةَ بْنَ عَمْرِو بْنِ جَرِيرٍ يُحَدِّثُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدٌّ يُعْمَلُ فِي الْأَرْضِ خَيْرٌ لِأَهْلِ الْأَرْضِ مِنْ أَنْ يُمْطَرُوا ثَلَاثِينَ صَبَاحًا";
nasai.urdu = "حضرت ابوہرہ ؓ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’زمین میں ایک حد کا لگایا جانا زمین پر رہنے والوں کے لیے اس بات سے بہتر ہے کہ ان پر تیس دن بارش برسے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (2538)<br>جریر بن یزید: ضعیف،کما فی التقریب (917)۔<br>وللحدیث شواہد ضعیفۃ عند ابن حبان (1507 موارد) وغیرہ۔`;
nasai.anwaar = [358,1];