var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ جَرِيرِ بْنِ يَزِيدَ عَنْ أَبِي زُرْعَةَ قَالَ قَالَ أَبُو هُرَيْرَةَ إِقَامَةُ حَدٍّ بِأَرْضٍ خَيْرٌ لِأَهْلِهَا مِنْ مَطَرِ أَرْبَعِينَ لَيْلَةً";
nasai.urdu = "حضرت ابوہریرہؓ نے فرمایا: زمین میں ایک حد نافذ کردینا زمین پر بسنے والوں کے لیے چالیس دن کی بارش سے بھی زیادہ مفید ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (2538)`;
nasai.anwaar = [358,1];