var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ زُغْبَةُ وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَبِّحُ عَلَى الرَّاحِلَةِ قِبَلَ أَيِّ وَجْهٍ تَتَوَجَّهُ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لَا يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے،انھوں نے فرمایا: رسول اللہ ﷺ اپنی سواری پر نفل نماز پڑھتے تھے،سواری کا منہ جس طرف بھی ہوتا۔اسی طرح وتر بھی سواری پر پڑھتے تھے۔مگر فرض نماز سواری پر نہیں پڑھتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;