var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ قَالَ حَدَّثَنَا حَنْظَلَةُ قَالَ سَمِعْتُ نَافِعًا قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ قِيمَتُهُ خَمْسَةُ دَرَاهِمَ كَذَا قَالَ";
nasai.urdu = "حضرت عبداللہ بن عمررضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے ایک ڈھال کی چوری پر ہاتھ کاٹ دیا تھا جس کی قیمت پانچ درہم تھی۔(امام صاحب  نے فرمایا:) راوی نے اسی طرح بیان کیا ہے۔(اسے غلطی لگی ہے۔)";
nasai.hukam = "ضعیف";
nasai.description = `شاذ<br>انظر الحدیث الآتي (الأصل: 4911) وصحیح مسلم (6 /1686) وھو المحفوظ۔`;
nasai.anwaar = [358,1];