var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنَا حَنْظَلَةُ أَنَّ نَافِعًا حَدَّثَهُمْ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا الصَّوَابُ";
nasai.urdu = "حضرت عبداللہ بن عمررضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے ایک ڈھال کی چوری پر ہاتھ کاٹ دیا تھا جس کی قیمت تین درہم تھی۔\nابو عبدالرحمٰن (امام نسائی رحمہ اللہ) بیان کرتے ہیں کہ یہ روایت درست ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;