var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ أَنَّ نَافِعًا حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ يَدَ سَارِقٍ سَرَقَ تُرْسًا مِنْ صُفَّةِ النِّسَاءِ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ";
nasai.urdu = "حضرت عبداللہ بن عمررضی اللہ عنہما بیان کرتے ہیں کہ نبی اکرمﷺ نے ایک چور کا ہاتھ کاٹ دیا تھا جس نے عورتوں والے چھپر سے ایک ڈھال چرائی تھی جس کی قیمت تین درہم تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;