var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ سُفْيَانَ عَنْ أَيُّوبَ وَإِسْمَعِيلُ بْنُ أُمَيَّةَ وَعَبْدُ اللَّهِ وَمُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي مِجَنٍّ قِيمَتُهُ ثَلَاثَةُ دَرَاهِمَ";
nasai.urdu = "حضرت ابن عمررضی اللہ عنہما سے روایت ہے کہ نبی اکرمﷺ نے ایک ڈھال کی چوری پر ہاتھ کاٹ دیا تھا جس کی قیمت تین درہم تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;