var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ قَالَ حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ قَالَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي مِجَنٍّ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ";
nasai.urdu = "حضرت انس بن مالک ؓ سے مروی ہے کہ رسول اکرمﷺ نے ایک ڈھال چرانے پر ہاتھ کاٹ دیا تھا۔\nابو عبدالرحمٰن (امام نسائی رحمہ اللہ) نے فرمایا: یہ غلط ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;