var nasai = {};
nasai.arabic = "أَنْبَأَنَا هَارُونُ بْنُ سَعِيدٍ قَالَ حَدَّثَنِي خَالِدُ بْنُ نِزَارٍ قَالَ حَدَّثَنَا الْقَاسِمُ بْنُ مَبْرُورٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُقْطَعُ الْيَدُ إِلَّا فِي ثَمَنِ الْمِجَنِّ ثُلُثِ دِينَارٍ أَوْ نِصْفِ دِينَارٍ فَصَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’(چور کا) ہاتھ نہیں کاٹا جائے گا مگر ایک ڈھال کی قیمت میں (یعنی) تہائی دینار یا نصف دینار یا اس سے زائد میں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;