var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى عَنْ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى دَابَّتِهِ وَهُوَ مُقْبِلٌ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ وَفِيهِ أُنْزِلَتْ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ(البقرہ:15)";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے منقول ہے،انھوں نے فرمایا: رسول اللہ ﷺ مکہ سے مدینہ آتے ہوئے سواری پر نماز پڑھتے تھے اور اسی کے بارے میں یہ آیت اتری: (فاینما تولوا فثم وجہ اللہ) ’’تم جدھر بھی منہ کرو ادھر ہی اللہ تعالیٰ کا چہرہ ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;