var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ قَالَتْ عَمْرَةُ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُقْطَعُ يَدُ السَّارِقِ فِي رُبْعِ دِينَارٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’چور کا ہاتھ چوتھائی دینار کی چوری پر کاٹ دیا جائے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;