var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَقُتَيْبَةُ بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُتَيْبَةُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْطَعُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: رسول اللہ ﷺ چوتھائی دینار یا اس سے زائد کی چوری میں (چور کا ہاتھ) کاٹ دیا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;