var nasai = {};
nasai.arabic = "أَخْبَرَنِي يَزِيدُ بْنُ مُحَمَّدِ بْنِ فُضَيْلٍ قَالَ أَنْبَأَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ يَدُ السَّارِقِ فِي رُبْعِ دِينَارٍ فَصَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی اکرمﷺ نے فرمایا: ’’چور کا ہاتھ چوتھائی دینار یا اس سے زائد کی چوری میں کاٹا جائے گا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;