var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى رَاحِلَتِهِ فِي السَّفَرِ حَيْثُمَا تَوَجَّهَتْ بِهِ قَالَ مَالِكٌ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ سفر میں اپنی سواری پر (نفل) نماز پڑھا کرتے تھے،جدھر بھی اس کا منہ ہوتا۔(راویٔ حدیث) مالک رحمہ اللہ بیان کرتے ہیں کہ عبداللہ بن دینار نے کہا: ابن عمر رضی اللہ عنہما بھی ایسے ہی کیا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;