var nasai = {};
nasai.arabic = "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ مَا طَالَ عَلَيَّ وَلَا نَسِيتُ الْقَطْعُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا نے فرمایا: زیادہ عرصہ نہیں گزرا اور نہ میں بھولی ہوں کہ ہاتھ کاٹنے کا حکم چوتھائی دینار یا اس سے زائد کی چوری پر لاگو ہوتا تھا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;