var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو صَالِحٍ مُحَمَّدُ بْنُ زُنْبُورٍ قَالَ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُقْطَعُ السَّارِقُ إِلَّا فِي رُبْعِ دِينَارٍ فَصَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ انہوں نے رسول اللہ ﷺ کو فرماتے سنا: ’’چور کا ہاتھ چوتھائی دینار یا اس سے زائد کی چوری کے بغیر نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;