var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الرِّجَالِ عَنْ أَبِيهِ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقْطَعُ يَدُ السَّارِقِ فِي ثَمَنِ الْمِجَنِّ وَثَمَنُ الْمِجَنِّ رُبْعُ دِينَارٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا: ’’چور کا ہاتھ ڈھال کی قیمت کے برابر چوری پر کاٹ دیا جائے گا (اس وقت) ڈھال کی قیمت چوتھائی دینار تھی۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;