var nasai = {};
nasai.arabic = "أَخْبَرَنِي يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْطَعُ الْيَدَ فِي رُبْعِ دِينَارٍ فَصَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہانے فرمایا: رسول اللہ ﷺ چوتھائی دینار یا اس سے زائد کی چوری میں (چور کا) ہاتھ کاٹا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;