var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقْطَعُ الْيَدُ إِلَّا فِي رُبْعِ دِينَارٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا: ’’چوتھائی دینار سے کم کی چوری میں ہاتھ نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;