var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ إِسْمَعِيلَ الطَّبَرَانِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بَحْرٍ أَبُو عَلِيٍّ قَالَ حَدَّثَنَا مُبَارَكُ بْنُ سَعِيدٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي عِكْرِمَةُ أَنَّ امْرَأَةً أَخْبَرَتْهُ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ أَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ الْيَدُ فِي الْمِجَنِّ";
nasai.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا نے بیان فرمایا کہ رسول اللہ ﷺ کا فرمان ہے: ’’ڈھال کی چوری میں ہاتھ کاٹا جائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;