var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ بَيْنَمَا النَّاسُ بِقُبَاءَ فِي صَلَاةِ الصُّبْحِ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّامِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے،انھوں نے فرمایا: لوگ قباء میں صبح کی نماز میں تھے کہ ایک آنے والے شخص نے کہا کہ اللہ کے رسول ﷺ پر آج رات نیا حکم اترا ہے اور آپ کو کعبے کی طرف منہ کرنے کا حکم دیا گیا ہے،لہٰذا کعبے کی طرف منہ کرو۔ان کے چہرے شام کی طرف تھے،چنانچہ وہ کعبے کی طرف گھوم گئے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;