var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي مَخْرَمَةُ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْطَعُ يَدُ السَّارِقِ إِلَّا فِي رُبْعِ دِينَارٍ فَصَاعِدًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ انہوں نے رسول اللہ ﷺ کو فرماتے سنا: ’’چور کا ہاتھ چوتھائی دینار یا اس سے زائد کی چوری کے علاوہ (کم میں) نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;