var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا قُدَامَةُ بْنُ مُحَمَّدٍ قَالَ أَنْبَأَنَا مَخْرَمَةُ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُثْمَانَ بْنَ أَبِي الْوَلِيدِ مَوْلَى الْأَخْنَسِيِّينَ يَقُولُ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ يَقُولُ كَانَتْ عَائِشَةُ تُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْطَعُ الْيَدُ إِلَّا فِي الْمِجَنِّ أَوْ ثَمَنِهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا بیان فرماتی تھیں کہ نبی اکرمﷺ نے فرمایا: ’’ڈھال یا اس کی قیمت سے کم کی چوری میں ہاتھ نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;