var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ الدَّانَاجِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ لَا تُقْطَعُ الْخَمْسُ إِلَّا فِي الْخَمْسِ قَالَ هَمَّامٌ فَلَقِيتُ عَبْدَ اللَّهِ الدَّانَاجَ فَحَدَّثَنِي عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ لَا تُقْطَعُ الْخَمْسُ إِلَّا فِي الْخَمْسِ";
nasai.urdu = "حضرت سلیمان بن یسار رحمہ اللہ نے فرمایا: پانچ (انگلیاں) نہیں کاٹی جائیں گی مگر پانچ (درہم کی چوری) میں۔ہمام نے کہا کہ میں عبداللہ داناج کو ملا تو انہوں نے مجھے سلیمان بن یسار رحمہ اللہ سے حدث بیان کی کہ انہوں نے کہا: پانچ نہیں کاٹی جائیں گی مگر پانچ میں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;