var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عِيسَى عَنْ الشَّعْبِيِّ عَنْ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي قِيمَةِ خَمْسَةِ دَرَاهِمَ";
nasai.urdu = "حضرت عبداللہ بن مسعودؓ سے روایت ہے کہ نبی اکرمﷺ نے پانچ درہم قیمت رکھنے والی چیز (کی چوری) میں ہاتھ کاٹا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>فیہ علتان: الإنقطاع وعنعنۃ سفیان الثوري۔`;
nasai.anwaar = [359,1];