var nasai = {};
nasai.arabic = "و أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا مُعَاوِيَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ عَطَاءٍ عَنْ أَيْمَنَ قَالَ لَمْ يَقْطَعْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّارِقَ إِلَّا فِي ثَمَنِ الْمِجَنِّ وَثَمَنُ الْمِجَنِّ يَوْمَئِذٍ دِينَارٌ";
nasai.urdu = "حضرت ایمن سے روایت ہے کہ نبی اکرمﷺ نے چور کا ہاتھ ڈھال کی قیمت سے کم میں نہیں کاٹا۔اور ڈھال کی قیمت ان دنوں ایک دینار (دس درہم) ہوتی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف لإرسالہ<br>قال ابن حبان فی الثقات (4/ 47): ’’أیمن بن عبید الحبشي۔۔۔۔۔ومن زعم أن لہ صحبۃ فقد وھم،حدیثہ فی القطع مرسل‘‘۔`;
nasai.anwaar = [359,1];