var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أَيْمَنَ قَالَ لَمْ تَكُنْ تُقْطَعُ الْيَدُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا فِي ثَمَنِ الْمِجَنِّ وَقِيمَتُهُ يَوْمَئِذٍ دِينَارٌ";
nasai.urdu = "حضرت ایمن سے روایت ہے کہ رسول اللہ ﷺ کے دور مبارک میں ڈھال کی قیمت سے کم چیز کی چوری پر ہاتھ نہیں کاٹا جاتا تھا۔اور ڈھال کی قیمت ان دنوں ایک دینار تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف لإرسالہ<br>قال ابن حبان فی الثقات (4/ 47): ’’أیمن بن عبید الحبشي۔۔۔۔۔ومن زعم أن لہ صحبۃ فقد وھم،حدیثہ فی القطع مرسل‘‘۔`;
nasai.anwaar = [359,1];