var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو الْأَزْهَرِ النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ أَيْمَنَ قَالَ لَمْ تُقْطَعْ الْيَدُ فِي زَمَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا فِي ثَمَنِ الْمِجَنِّ وَقِيمَةُ الْمِجَنِّ يَوْمَئِذٍ دِينَارٌ";
nasai.urdu = "حضرت ایمن سے منقول ہے کہ رسول اللہ ﷺ کے زمانہ مبارک میں ڈھال کی قیمت سے کم میں ہاتھ نہیں کاٹا گیا۔اور ڈھال کی قیمت ان دنوں ایک دینار تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف لإرسالہ<br>قال ابن حبان فی الثقات (4/ 47): ’’أیمن بن عبید الحبشي۔۔۔۔۔ومن زعم أن لہ صحبۃ فقد وھم،حدیثہ فی القطع مرسل‘‘۔`;
nasai.anwaar = [359,1];