var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ عَلِيِّ بْنِ صَالِحٍ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ وَعَطَاءٍ عَنْ أَيْمَنَ قَالَ لَمْ تُقْطَعْ الْيَدُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا فِي ثَمَنِ الْمِجَنِّ وَثَمَنُهُ يَوْمَئِذٍ دِينَارٌ";
nasai.urdu = "حضرت ایمن سے مروی ہے کہ رسول اللہ ﷺ کے عہد مسعود میں ڈھال کی قیمت سے کم میں ہاتھ نہیں کاٹا گیا۔اور اس کی قیمت ان دنوں ایک دینار تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف لإرسالہ<br>قال ابن حبان فی الثقات (4/ 47): ’’أیمن بن عبید الحبشي۔۔۔۔۔ومن زعم أن لہ صحبۃ فقد وھم،حدیثہ فی القطع مرسل‘‘۔`;
nasai.anwaar = [359,1];