var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ قَالَ أَنْبَأَنَا الْحَسَنُ بْنُ حَيٍّ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ عَطَاءٍ وَمُجَاهِدٍ عَنْ أَيْمَنَ قَالَ يُقْطَعُ السَّارِقُ فِي ثَمَنِ الْمِجَنِّ وَكَانَ ثَمَنُ الْمِجَنِّ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِينَارًا أَوْ عَشْرَةَ دَرَاهِمَ";
nasai.urdu = "حضرت ایمن نے فرمایا: چور کا ہاتھ ڈھال کی قیمت کے برابر چوری میں کاٹا جائے گا۔اور ڈھال کی قیمت کے برابر چوری میں کاٹا جائے گا۔اور ڈھال کی قیمت رسول اللہﷺ کے دور مبارک میں ایک دینار یا دس درہم تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف لإرسالہ<br>قال ابن حبان فی الثقات (4/ 47): ’’أیمن بن عبید الحبشي۔۔۔۔۔ومن زعم أن لہ صحبۃ فقد وھم،حدیثہ فی القطع مرسل‘‘۔`;
nasai.anwaar = [359,1];