var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ مَنْصُورٍ عَنْ عَطَاءٍ وَمُجَاهِدٍ عَنْ أَيْمَنَ ابْنِ أُمِّ أَيْمَنَ يَرْفَعُهُ قَالَ لَا تُقْطَعُ الْيَدُ إِلَّا فِي ثَمَنِ الْمِجَنِّ وَثَمَنُهُ يَوْمَئِذٍ دِينَارٌ";
nasai.urdu = "حضرت عطاء اور مجاہد سے روایت ہے کہ حضرت ایمن بن ام ایمن نے مرفوعا (رسول اللہ ﷺ کا فرمان) بیان فرمایا کہ چور کا ہاتھ ڈھال کی قیمت سے کم میں نہیں کاٹا جائے گا۔اور ڈھال کی قیمت ان دنوں ایک دینار تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف لإرسالہ<br>قال ابن حبان فی الثقات (4/ 47): ’’أیمن بن عبید الحبشي۔۔۔۔۔ومن زعم أن لہ صحبۃ فقد وھم،حدیثہ فی القطع مرسل‘‘۔`;
nasai.anwaar = [359,1];