var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ مِثْلَهُ كَانَ ثَمَنُ الْمِجَنِّ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَوَّمُ عَشْرَةَ دَرَاهِمَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے کہ ڈھال کی قیمت رسول اللہ ﷺ کے دور مبارک میں دس درہم لگائی جاتی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>محمد بن إسحاق بن یسار مدلس وعنعن۔<br>والحدیث السابق (الأصل: 4953) وسندہ حسن یغني عنہ۔`;
nasai.anwaar = [359,1];