var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ عَبْدِ الْمَلِكِ الْعَوْصِيَّ عَنْ الْحَسَنِ وَهُوَ ابْنُ صَالِحٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ";
nasai.urdu = "حضرت رافع بن خدیج ؓ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’پھل اور گری (کھجور کے مغز) میں ہاتھ نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;