var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ الْقَطَّانَ يَقُولُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ";
nasai.urdu = "حضرت رافع بن خدیج ؓ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’پھل اور گابھے (گودے) میں ہاتھ نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;