var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ هُوَ ابْنُ أَبِي رَجَاءٍ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ";
nasai.urdu = "حضرت رافع بن خدیجؓ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا: ’’پھل اور گابھے (کی چوری) میں ہاتھ نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;