var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ أَنَّ رَافِعَ بْنَ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ وَالْكَثَرُ الْجُمَّارُ";
nasai.urdu = "حضرت رافع بن خدیجؓ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’پھل اور گابھے (کی چوری) میں ہاتھ نہیں کاٹا جائے گا۔‘‘ اور گھابھا کھجور کے مغز کو کہتے ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;