var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَبِي مَيْمُونٍ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ قَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ أَبُو مَيْمُونٍ لَا أَعْرِفُهُ";
nasai.urdu = "حضرت رافع بن خدیجؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’پھل اور گابھے (گودے) میں ہاتھ نہیں کاٹا جائے گا۔‘‘\nابو عبدالرحمٰن (امام نسائی رحمہ اللہ) بیان کرتے ہیں کہ یہ غلط ہے۔ابو میمون کو میں نہیں پہچانتا۔";
nasai.hukam = "حسن";
nasai.description = ``;