var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ رَجُلٍ مِنْ قَوْمِهِ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ";
nasai.urdu = "حضرت رافع بن خدیجؓ نے فرمایا: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’پھل اور گابھے میں ہاتھ نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;