var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا بِشْرٌ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّ رَجُلًا مِنْ قَوْمِهِ حَدَّثَهُ عَنْ عَمٍّ لَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ";
nasai.urdu = "حضرت رافع بن خدیجؓ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’پھل اور گابھے (کی چوری) میں ہاتھ نہیں کاٹا جائے گا۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;