var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَلِيٍّ عَنْ مَخْلَدٍ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى خَائِنٍ وَلَا مُنْتَهِبٍ وَلَا مُخْتَلِسٍ قَطْعٌ لَمْ يَسْمَعْهُ سُفْيَانُ مِنْ أَبِي الزُّبَيْرِ";
nasai.urdu = "حضرت جابر ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’خیانت کرنے والے،لوٹنے والے اور جھپٹ کر چھین لینے والے کا ہاتھ نہیں کاٹا جائے گا۔‘‘\nسفیان (ثوری) نے ابو الزبیر سے نہیں سنا۔";
nasai.hukam = "صحیح";
nasai.description = ``;