var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى خَائِنٍ وَلَا مُنْتَهِبٍ وَلَا مُخْتَلِسٍ قَطْعٌ وَلَمْ يَسْمَعْهُ أَيْضًا ابْنُ جُرَيْجٍ مِنْ أَبِي الزُّبَيْرِ";
nasai.urdu = "حضرت جابر ؓ سےروایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’خیانت کرنے والے،لوٹ ڈالنے والے اور جھپٹنے والے کا ہاتھ نہیں کاٹا جائے گا۔،،\nابن جریج نے بھی ابو لزبیر سے نہیں سنا۔";
nasai.hukam = "صحیح";
nasai.description = ``;