var nasai = {};
nasai.arabic = "أَخْبَرَنَا خَالِدُ بْنُ رَوْحٍ الدِّمَشْقِيُّ قَالَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ خَالِدِ بْنِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ حَدَّثَنَا شَبَابَةُ عَنْ الْمُغِيرَةِ بْنِ مُسْلِمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى مُخْتَلِسٍ وَلَا مُنْتَهِبٍ وَلَا خَائِنٍ قَطْعٌ";
nasai.urdu = "حضرت جابر ؓ سے روایت ہے کہ رسول اللہ ﷺ نےفرمایا:’’جھپٹ مار کر چھپنٹے والے،لوٹ ڈالنے والے (ڈاکو) اورخیانت کرنے والے کا ہاتھ نہیں کاٹا جائے گا۔،،";
nasai.hukam = "صحیح";
nasai.description = ``;