var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ وَهْبٍ عَنْ خَبَّابٍ قَالَ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّ الرَّمْضَاءِ فَلَمْ يُشْكِنَا قِيلَ لِأَبِي إِسْحَقَ فِي تَعْجِيلِهَا قَالَ نَعَمْ";
nasai.urdu = "حضرت خباب رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: ہم نے رسول اللہ ﷺ سے زمین کے گرم ہونے کا شکوہ کیا لیکن آپ نے ہماری شکایت دور نہ کی۔ابواسحاق سے کہا گیا: (صحابہ کرام رضی اللہ عنہم کا شکوہ) نماز جلدی پڑھنے کے بارے میں تھا؟ انھوں نے کہا: ہاں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;