var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنِي بَقِيَّةُ قَالَ حَدَّثَنِي نَافِعُ بْنُ يَزِيدَ قَالَ حَدَّثَنِي حَيْوَةُ بْنُ شُرَيْحٍ عَنْ عَيَّاشِ بْنِ عَبَّاسٍ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ قَالَ سَمِعْتُ بُسْرَ بْنَ أَبِي أَرْطَاةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْطَعُ الْأَيْدِي فِي السَّفَرِ";
nasai.urdu = "حضرت بسر بن ابی ارطاۃ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتےسنا:’’سفر میں چور کے ہاتھ نہ کا ٹے جائیں۔،،";
nasai.hukam = "صحیح";
nasai.description = ``;