var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ مُدْرِكٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عُمَرَ وَهُوَ ابْنُ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَرَقَ الْعَبْدُ فَبِعْهُ وَلَوْ بِنَشٍّ قَالَ أَبُو عَبْد الرَّحْمَنِ عُمَرُ بْنُ أَبِي سَلَمَةَ لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ";
nasai.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:’’جب کوئی غلام چوری کر لے تو اسے بیچ دو اگر چہ نصف قیمت پر بکے۔،،\nابو عبدالرحمٰن (امام نسائی)رحمہ اللہ بیان کرتے ہیں کہ (حدیث کا روای) عمر بن ابو سلمہ حدیث میں قوی نہیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;