var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَطِيَّةَ أَنَّهُ أَخْبَرَهُ قَالَ كُنْتُ فِي سَبْيِ قُرَيْظَةَ وَكَانَ يُنْظَرُ فَمَنْ خَرَجَ شِعْرَتُهُ قُتِلَ وَمَنْ لَمْ تَخْرُجْ اسْتُحْيِيَ وَلَمْ يُقْتَلْ";
nasai.urdu = "حضرت عطیہ ؓ سے روایت ہے،انھوں نے کہا کہ میں بنو قریظہ کے قید یوں میں شامل تھا۔(فیصلے کے مطابق)دیکھا جاتا تھا کہ جس قیدی کے زیر ناف بال اگے ہوتےتھے،اس قتل کردیا جاتا تھا اور جسکے زیر ناف بال نہیں اگے ہوتے تھے،اسے زندہ چھوڑ دیا جاتا تھا اور قتل نہیں کیا جاتا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;