var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ أَبِي بَكْرِ بْنِ عَلِيٍّ عَنْ الْحَجَّاجِ عَنْ مَكْحُولٍ عَنْ ابْنِ مُحَيْرِيزٍ قَالَ سَأَلْتُ فَضَالَةَ بْنَ عُبَيْدٍ عَنْ تَعْلِيقِ يَدِ السَّارِقِ فِي عُنُقِهِ قَالَ سُنَّةٌ قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ سَارِقٍ وَعَلَّقَ يَدَهُ فِي عُنُقِهِ";
nasai.urdu = "حضرت ابن محیریز سے روایت ہے،انھوں نے کہا کہ میں نے حضرت فضالہ بن عبید ؓ سے چور کا ہاتھ اسکی گردن میں لٹکانے کے بارے میں پوچھا تو انھوں نے فرمایا (یہ) سنت ہے۔رسول اللہ ﷺ نے ایک چور کاہاتھ کاٹ کر اس کی گردن میں لٹکا دیا تھا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4411) ترمذی (1447) ابن ماجہ (2587)`;
nasai.anwaar = [359,1];