var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا حَسَّانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ عَنْ يُونُسَ بْنِ يَزِيدَ قَالَ سَمِعْتُ سَعْدَ بْنَ إِبْرَاهِيمَ يُحَدِّثُ عَنْ الْمِسْوَرِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُغَرَّمُ صَاحِبُ سَرِقَةٍ إِذَا أُقِيمَ عَلَيْهِ الْحَدُّ قَالَ أَبُو عَبْد الرَّحْمَنِ وَهَذَا مُرْسَلٌ وَلَيْسَ بِثَابِتٍ";
nasai.urdu = "حضرت عبد الرحمٰن بن عوف ؓسےروایت ہے کہ رسول اللہ ﷺنے فرمایا:’’جب چور پرحد نافذ کر دی جائے تواس پر چور ی کاتاوان نہ ڈالا جائے گا۔،،\nابو عبدالرحمٰن (امام نسائی رح) نے کہا:یہ (حدیث) مرسل ہے اور ثابت نہیں ہے";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>السند منقطع کما قال البیہقي رحمہ اﷲ (السنن الکبریٰ: 8/ 277)`;
nasai.anwaar = [359,1];