var nasai = {};
nasai.arabic = "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ أَحْمَدُ بْنُ شُعَيْبٍ مِنْ لَفْظِهِ قَالَ أَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ الْإِيمَانُ بِاللَّهِ وَرَسُولِهِ";
nasai.urdu = "حضرت ابو ہریرہ ؓسے روایت ہے کہ رسول اللہ ﷺ سے پوچھا گیا:کون سا عمل افضل ہے؟ آپ نے فرمایا:’’اللہ عزوجل اور اس کے رسول پر ایمان لانا،،";
nasai.hukam = "متفق علیہ";
nasai.description = ``;