var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ عَنْ عَلِيٍّ الْأَزْدِيِّ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ فَقَالَ إِيمَانٌ لَا شَكَّ فِيهِ وَجِهَادٌ لَا غُلُولَ فِيهِ وَحَجَّةٌ مَبْرُورَةٌ";
nasai.urdu = "حضرت عبد اللہ بن حبشی خثعمی ؓ سے روایت ہے کہ نبی اکر م ﷺ سے پوچھا گیا:کون سا عمل افضل ہے؟ آپ نے فرمایا:’’ایسا ایمان جس میں ذرہ بھر شک نہ ہو،وہ جہاد جس میں کسی قسم کی خیانت نہ ہو اور نیک وپاک حج۔";
nasai.hukam = "حسن";
nasai.description = ``;