var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ قَالَ حَدَّثَنِي حَمْزَةُ الْعَائِذِيُّ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَزَلَ مَنْزِلًا لَمْ يَرْتَحِلْ مِنْهُ حَتَّى يُصَلِّيَ الظُّهْرَ فَقَالَ رَجُلٌ وَإِنْ كَانَتْ بِنِصْفِ النَّهَارِ قَالَ وَإِنْ كَانَتْ بِنِصْفِ النَّهَارِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ اللہ کے رسول ﷺ جب کسی منزل میں اترتے تھے تو ظہر کی نماز پڑھنے سے پہلے وہاں سے کوچ نہ فرماتے تھے۔ایک آدمی نے کہا: اگرچہ سورج سر پر ہوتا؟ فرمایا: اگرچہ سورج سر پر ہوتا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;