var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ بِشْرِ بْنِ سُحَيْمٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يُنَادِيَ أَيَّامَ التَّشْرِيقِ أَنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مُؤْمِنٌ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ";
nasai.urdu = "حضرت بشربن سحیم ؓسے روایت ہے کہ رسول اللہ ﷺ نے انہیں ایام تشریق میں یہ اعلان کرنے کا حکم دیا کہ جنت میں صرف مومن ہی داخل ہو گا،نیز یہ دن کھانے پینے کے ہیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;