var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ إِسْمَعِيلَ عَنْ عَامِرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ";
nasai.urdu = "۔حضرت عبد اللہ بن عمروؓ بیان کرتے ہیں کہ میں نےرسول اللہ ﷺ کوفرماتے سنا:’’اصل مسلمان وہ ہے جس کی زبان اور ہاتھ سے دوسرے مسلمان محفوظ ہوں اور اصل مہاجر وہ ہے جوا ن چیزوں کو چھوڑ دے جن سے اللہ تعالیٰ نے منع فرمایاہے۔،،";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;