var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى عَنْ يَزِيدَ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَتِيقٍ قَالَ حَدَّثَنِي أَبِي قَالَ سَمِعْتُ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السِّوَاكُ مَطْهَرَةٌ لِلْفَمِ مَرْضَاةٌ لِلرَّبِّ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’مسواک منہ کی صفائی و پاکیزگی اور رب تعالیٰ کی رضا مندی کا ذریعہ ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = `مشکوۃ المصابیح: 381`;