var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنْ إِبْرَاهِيمَ بْنِ جَرِيرٍ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَلَمَّا اسْتَنْجَى دَلَكَ يَدَهُ بِالْأَرْضِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سےروایت ہے کہ نبی ﷺ نے وضو فرمایا،(اس سے پہلے) جب اسنجے سے فارغ ہوئے تو ہاتھ زمین پر ملا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;