var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ دِينَارٍ أَبُو خَلْدَةَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الْحَرُّ أَبْرَدَ بِالصَّلَاةِ وَإِذَا كَانَ الْبَرْدُ عَجَّلَ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ جب گرمی ہوتی تو رسول اللہ ﷺ نماز ظہر کو ٹھنڈی کرکے پڑھتے تھے اور جب سردی ہوتی تو جلدی پڑھتے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;