var nasai = {};
nasai.arabic = "أَخْبَرَنَا حَفْصُ بْنُ عُمَرَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَنْصُورِ بْنِ سَعْدٍ عَنْ مَيْمُونِ بْنِ سِيَاهٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى صَلَاتَنَا وَاسْتَقْبَلَ قِبْلَتَنَا وَأَكَلَ ذَبِيحَتَنَا فَذَلِكُمْ الْمُسْلِمُ";
nasai.urdu = "حضرت انس ؓ سے روایت کہ رسول اللہ ﷺ نے فرمایا: ’’جو شخص ہماری طرح نماز پڑھے اور ہمارے قبلے کی طرف منہ کرے اور ہمار ذبح کیا ہوا جانور کھائے،وہ مسلمان ہے۔،،";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;