var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْإِسْلَامِ خَيْرٌ قَالَ تُطْعِمُ الطَّعَامَ وَتَقْرَأُ السَّلَامَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ";
nasai.urdu = "حضرت عبد اللہ بن عمر ؓ سے روایت ہے کہ ایک آدمی نے رسول اللہ ﷺ سے پوچھا کون سا اسلام بہتر ہے؟آپ نے فرمایا:’’تو کھانا کھلائے اور ہر ایک کو سلام کہے،خواہ پہچا نتا ہو یا نہ پہچانتا ہو۔،،";
nasai.hukam = "متفق علیہ";
nasai.description = ``;