var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ بِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِيمَانُ بِضْعٌ وَسَبْعُونَ شُعْبَةً وَالْحَيَاءُ شُعْبَةٌ مِنْ الْإِيمَانِ";
nasai.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:’’ایمان کی ستر سے زائد شاخیں ہیں اور حیا بھی ایمان کی ایک اہم شاخ ہے۔،،";
nasai.hukam = "متفق علیہ";
nasai.description = ``;