var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ سُفْيَانَ قَالَ و حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِيمَانُ بِضْعٌ وَسَبْعُونَ شُعْبَةً أَفْضَلُهَا لَا إِلَهَ إِلَّا اللَّهُ وَأَوْضَعُهَا إِمَاطَةُ الْأَذَى عَنْ الطَّرِيقِ وَالْحَيَاءُ شُعْبَةٌ مِنْ الْإِيمَانِ";
nasai.urdu = "حضرت ابو ہریرہ ؓسے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’ایمان کی ستر سے زائد شاخین ہیں۔ان میں سے افضل کلمہ تو حید (ورسالت)کی ادائیگی ہ۔اور ان میں سے کم مرتبہ راستے سے تکلیف دہ چیز کو دور کرنا ہے۔اور حیا بھی ایمان کی ایک (اہم)شاخ ہے۔،،";
nasai.hukam = "حسن";
nasai.description = ``;