var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ وَعَمْرُو بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي عَمَّارٍ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُلِئَ عَمَّارٌ إِيمَانًا إِلَى مُشَاشِهِ";
nasai.urdu = "نبی اکرم ﷺ کے ایک صحابی سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’عمار (﷜) کناروں تک ایمان سے لبالب بھرا ہو اہے۔،،";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>الأعمش عنعن وھومدلس۔<br>وانظر سنن ابن ماجہ (147 بتحقیقی)۔`;
nasai.anwaar = [359,1];