var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ قَالَ قَالَ أَبُو سَعِيدٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ رَأَى مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الْإِيمَانِ";
nasai.urdu = "حضرت ابو سعید ﷜ بیان کرتے ہیں کہ میں نے رسو ل اللہ ﷺکو فرماتے سنا: ’’جو شخص براکام ہوتا دیکھے،وہ اسے اپنے ہاتھ سے ختم کردے اور اگر طاقت نہ ہو تو زبان کے ساتھ روکے اور اگراس کی بھی طاقت نہ رکھتا ہوتو اپنے دل سے برا جانے۔اور یہ (آخری درجہ) کمزور ترین ایمان ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;