var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنَا أَبُو الزِّنَادِ مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ مِمَّا ذُكِرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ بِهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَلَدِهِ وَوَالِدِهِ";
nasai.urdu = "حضرت ابو ہریرہ﷜ نے بیان فرمایا کہ رسول اللہ ﷺ کا ارشاد گرامی ہے:’’قسم اس ذا ت کی جس کے ہاتھ میں میری جان ہے!تم میں سے کوئی شخص مومن نہیں ہوسکتا جب تک اس کے نزدیک اس کی اولاد اور والدین سےبڑھ کر محبوب نہ بن جاؤں۔،،";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;