var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى قَالَ أَنْبَأَنَا الْأَعْمَشُ عَنْ عَدِيٍّ عَنْ زِرٍّ قَالَ قَالَ عَلِيٌّ إِنَّهُ لَعَهْدُ النَّبِيِّ الْأُمِّيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيَّ أَنَّهُ لَا يُحِبُّكَ إِلَّا مُؤْمِنٌ وَلَا يَبْغُضُكَ إِلَّا مُنَافِقٌ";
nasai.urdu = "حضرت زر(بن حبیش) سے روایت ہے کہ حضرت علی ﷜ نےفرمایا:نبی امی ﷺمجھے ارشاد فرمایا کرتے تھے کہ تجھ سے مومن ہی محبت کرےگااور تجھ سےمنافق ہی بغض رکھے گا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;