var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا الْمُعَافَى قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا مَنْصُورُ بْنُ الْمُعْتَمِرِ عَنْ أَبِي وَائِلٍ قَالَ قَالَ عَبْدُ اللَّهِ ثَلَاثٌ مَنْ كُنَّ فِيهِ فَهُوَ مُنَافِقٌ إِذَا حَدَّثَ كَذَبَ وَإِذَا اؤْتُمِنَ خَانَ وَإِذَا وَعَدَ أَخْلَفَ فَمَنْ كَانَتْ فِيهِ وَاحِدَةٌ مِنْهُنَّ لَمْ تَزَلْ فِيهِ خَصْلَةٌ مِنْ النِّفَاقِ حَتَّى يَتْرُكَهَا";
nasai.urdu = "حضرت عبداللہ بن مسعود ﷜ سےفرمایا تین عادتیں جس میں پائی جائیں،وہ منافق ہوگا: جب بات کر ے،جھوٹ بولے۔جب اس کے پاس امانت رکھی جائے تو خیانت کرے اور جب وعدہ کرے،خلاف ورزی کرے۔جس شخص میں ان میں سے کوئی ایک عادت پائی جائے۔اس میں نفاق کی خصلت رہے گی حتی ٰ کہ اسے چھوڑ دے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;