var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ نَافِعٍ قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ عَنْ مَعْنِ بْنِ مُحَمَّدٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذَا الدِّينَ يُسْرٌ وَلَنْ يُشَادَّ الدِّينَ أَحَدٌ إِلَّا غَلَبَهُ فَسَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا وَيَسِّرُوا وَاسْتَعِينُوا بِالْغَدْوَةِ وَالرَّوْحَةِ وَشَيْءٍ مِنْ الدَّلْجَةِ";
nasai.urdu = "حضرت ابو ہریرہ سے روایت ہےکہ رسول اللہ ﷺ نے فرمایا:’’دین آسان ہے۔جو شخص دین کو سخت بنائے گا،دین اس پر غالب آجائے گا،لہذا تم اپنے اعمال درست رکھو،میا نہ روی اختیار کرو،خوش رہو۔لوگوں پر آسانی کرو،کچھ سفر پہلے پہر کر لیا کر،کچھ پچھلے پہر اور کچھ آخررات کو۔،،";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;