var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْأَذْرَمِيُّ قَالَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ سَعْدِ بْنِ طَارِقٍ عَنْ كَثِيرِ بْنِ مُدْرِكٍ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ كَانَ قَدْرُ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فِي الصَّيْفِ ثَلَاثَةَ أَقْدَامٍ إِلَى خَمْسَةِ أَقْدَامٍ وَفِي الشِّتَاءِ خَمْسَةَ أَقْدَامٍ إِلَى سَبْعَةِ أَقْدَامٍ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے منقول ہے،انھوں نے فرمایا: رسول اللہ ﷺ کی ظہر کی نماز گرمیوں میں تین سے پانچ قدم کے بقدر (سائے میں) اور سردیوں میں پانچ سے سات قدم کے بقدر (سائے میں) ہوتی تھی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;