var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَعْقُوبُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ الْمُنَافِقِ كَمَثَلِ الشَّاةِ الْعَائِرَةِ بَيْنَ الْغَنَمَيْنِ تَعِيرُ فِي هَذِهِ مَرَّةً وَفِي هَذِهِ مَرَّةً لَا تَدْرِي أَيَّهَا تَتْبَعُ";
nasai.urdu = "حضرت ابن عمر ٖؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’منافق کی مثال اس بکری کی طرح ہے جو بکر ے کی طلب میں دور یوڑوں کے درمیان ہتی ہے۔کبھی اس ریوڑ میں جاتی ہے،کبھی اس ریوڑ میں اس کو تسلی نہں ہوتی کہ کس ریوڑ کے ساتھ رہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;