var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ قَالَ سَمِعْتُ طَلْقًا يَذْكُرُ عَشْرَةً مِنْ الْفِطْرَةِ السِّوَاكَ وَقَصَّ الشَّارِبِ وَتَقْلِيمَ الْأَظْفَارِ وَغَسْلَ الْبَرَاجِمِ وَحَلْقَ الْعَانَةِ وَالِاسْتِنْشَاقَ وَأَنَا شَكَكْتُ فِي الْمَضْمَضَةِ";
nasai.urdu = "سلیمان تیمی سے روایت ہے کہ میں نے حضرت طلق بن حبیب کو فرماتے سنا،دس چیزیں فطری ہیں:مسواک کرنا،مونچھیں حضرت کاٹنا،ناخن تراشنا،انگلیوں کے پوروں اور جوڑوں کو اچھی طرح دھونا،زیر ناف بال مونڈنا،ناک کی صفائی کرنا،کلی کے بارے میں مجھے شک ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;