var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ بِشْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الْفِطْرَةِ الْخِتَانُ وَحَلْقُ الْعَانَةِ وَنَتْفُ الضَّبْعِ وَتَقْلِيمُ الظُّفْرِ وَتَقْصِيرُ الشَّارِبِ وَقَفَهُ مَالِكٌ";
nasai.urdu = "حضرت ابوہریرہ﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: پانچ چیزیں فطری ہیں: ختنہ کرنا،شرمگاہ کے بال مونڈنا،بغلوں کے بال اکھیڑنا،ناخن تراشنا اور مونچھیں چھوٹی کرنا۔\nامام مالک ﷫ نے اس (روایت) کو موقوف بیان کیا ہے(جیسا کہ اگلی روایت میں آ رہا ہے)";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;