var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ يُوسُفَ بْنَ صُهَيْبٍ يُحَدِّثُ عَنْ حَبِيبِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ لَمْ يَأْخُذْ شَارِبَهُ فَلَيْسَ مِنَّا";
nasai.urdu = "حضرت زید بن ارقم﷜ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: جو شخص اپنی مونچھیں نہ کاٹے،وہ ہم میں سے نہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;