var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا حَلَقَ بَعْضَ رَأْسِهِ وَتَرَكَ بَعْضًا فَنَهَى عَنْ ذَلِكَ وَقَالَ احْلِقُوهُ كُلَّهُ أَوْ اتْرُكُوهُ كُلَّهُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبئ اکرم ﷺ نے ایک بچہ دیکھ جس کا کچھ سر مونڈا ہوا تھا اور کچھ چھوڑ دیا گیا تھا۔آپ نے اس سے منع فرمایا اور فرمایا: سارا سر منڈاؤ یا سارا رہنے دو";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;