var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ سُفْيَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَزَعِ قَالَ أَبُو عَبْد الرَّحْمَنِ حَدِيثُ يَحْيَى بْنِ سَعِيدٍ وَمُحَمَّدِ بْنِ بِشْرٍ أَوْلَى بِالصَّوَابِ";
nasai.urdu = "حضرت ابن عمرؓ سے مروی ہے کہ رسول اللہﷺ نے قزع سے منع فرمایا ہے۔\nابوعبدالرحمٰن (امام نسائی﷫) نے کہا کہ یحیٰ بن سعید(القطان) اور محمد بن بشر کی روایت (اس مذکورہ روایت سے) زیادہ درست اور صحیح ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;