var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسٍ قَالَ كَانَ شَعْرُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَعْرًا رَجْلًا لَيْسَ بِالْجَعْدِ وَلَا بِالسَّبْطِ بَيْنَ أُذُنَيْهِ وَعَاتِقِهِ";
nasai.urdu = "حضرت انس ﷜ سےر وایت ہے،انہوں نے فرمایا: نبئ اکرمﷺ کے سر کے بال لہردار تھے۔نہ گھنگھریالے نہ بالکل سیدھے۔(اور عموماً) کانوں اور کندھے کے درمیان رہتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;