var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ دَاوُدَ الْأَوْدِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ قَالَ لَقِيتُ رَجُلًا صَحِبَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا صَحِبَهُ أَبُو هُرَيْرَةَ أَرْبَعَ سِنِينَ قَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَمْتَشِطَ أَحَدُنَا كُلَّ يَوْمٍ";
nasai.urdu = "حضرت حمید بن عبدالرحمٰن حمیری سے روایت ہے کہ میں ایک بزرگ کو ملا نبئ اکرم ﷺ کی خدمت اقدس میں اسی طرح رہے تھے جس طرح حضرت ابوہریرہ﷜ چار سال آپ کی خدمت اقدس میں رہے۔انہوں نے فرمایا: رسول اللہﷺ نے ہمیں ہرروز کنگھی کرنے سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;