var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ مُحَمَّدِ بْنِ بِشْرٍ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ التَّيَامُنَ يَأْخُذُ بِيَمِينِهِ وَيُعْطِي بِيَمِينِهِ وَيُحِبُّ التَّيَمُّنَ فِي جَمِيعِ أُمُورِهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ دائیں طرف اختیار کرنے کو پسند فرماتے تھے۔اپنے دائیں ہاتھ سے لیتے،دائیں ہاتھ سے دیتے بلکہ تمام معاملات میں دائیں طرف کو ترجیح دیتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;