var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ قَالَ حَدَّثَنَا الْمُعَافَى عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ مَا رَأَيْتُ أَحَدًا أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجُمَّتُهُ تَضْرِبُ مَنْكِبَيْهِ";
nasai.urdu = "حضرت براء﷜ نے فرمایا: میں نے کسی شخص کو سرخ حلہ پہنے ہوئے رسول اللہﷺ سے زیادہ خوب صورت نہیں دیکھا جب کہ آپ کے سر مبارک کے لمبے لمبے بال کندھوں سے ٹکراتے تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;