var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِيهِ قَالَ حَدَّثَنِي الْبَرَاءُ قَالَ مَا رَأَيْتُ رَجُلًا أَحْسَنَ فِي حُلَّةٍ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَرَأَيْتُ لَهُ لِمَّةً تَضْرِبُ قَرِيبًا مِنْ مَنْكِبَيْهِ";
nasai.urdu = "حضرت براء ﷜ نے فرمایا: میں نے کسی شخص کو سرخ حلہ پہنے ہوئے رسول اللہﷺ سے بڑھ کر خوب صورت نہیں دیکھا،نیز میں نے دیکھا کہ آپ کی زلفیں کندھوں کے قریب لہرایا کرتی تھیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;