var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِي جُمَّةٌ قَالَ ذُبَابٌ وَظَنَنْتُ أَنَّهُ يَعْنِينِي فَانْطَلَقْتُ فَأَخَذْتُ مِنْ شَعْرِي فَقَالَ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ";
nasai.urdu = "حضرت وائل بن حجر ﷜ بیان کرتے ہیں کہ میں نبئ اکرمﷺ کے پا حاضر ہوا تو میرے لمبے لمبے بال تھے۔آپ نے فرمایا: (یہ) منحوس چیز ہے۔میں نے سمجھا کہ آپ مجھے کہہ رہے ہیں۔میں اٹھا اور اپنے بال کاٹ کر پھر حاضر ہوا تو آپ نے فرمایا: میں نے تجھے نہیں کہا تھا۔ویسے یہ زیادہ اچھی حالت ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;