var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ وَإِسْحَقُ بْنُ عَبْدِ اللَّهِ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ ثُمَّ يَذْهَبُ الذَّاهِبُ إِلَى قُبَاءٍ فَقَالَ أَحَدُهُمَا فَيَأْتِيهِمْ وَهُمْ يُصَلُّونَ وَقَالَ الْآخَرُ وَالشَّمْسُ مُرْتَفِعَةٌ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ عصر کی نماز ادا فرماتے،پھر جانے والا قباء تک جاتا۔(زہری اور اسحاق میں سے) ایک نے کہا: وہ ان کے پاس پہنچتا تو ابھی وہ نماز عصر پڑھ رہے ہوتے تھے۔اور دوسرے نے کہا: اور سورج ابھی اونچا ہوتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;