var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ قَالَ أَبُو سَلَمَةَ إِنَّ أَبَا هُرَيْرَةَ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْيَهُودُ وَالنَّصَارَى لَا تَصْبُغُ فَخَالِفُوهُمْ";
nasai.urdu = "حضرت ابوہریرہ﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: یہودی اور عیسائی سفید بالوں کو نہیں رنگتے،لہذا تم ان کی مخالفت کرو۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;