var nasai = {};
nasai.arabic = "أَخْبَرَنِي الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْيَهُودَ وَالنَّصَارَى لَا تَصْبُغُ فَخَالِفُوا عَلَيْهِمْ فَاصْبُغُوا";
nasai.urdu = "حضرت ابوہریرہ﷜ سے مروی ہے کہ رسول اللہﷺ نے فرمایا: یہودی اور عیسائی بال نہیں رنگتے۔تم ان کی مخالفت کرو اوربال رنگو۔";
nasai.hukam = "حسن";
nasai.description = ``;