var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ سُلَيْمَانَ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْيَهُودَ وَالنَّصَارَى لَا تَصْبُغُ فَخَالِفُوهُمْ";
nasai.urdu = "حضرت ابوہریرہ﷜ بیان کرتے ہیں کہ نبئ اکرمﷺ نے فرمایا: یہودی اور عیسائی بال نہیں رنگتے۔تم ان کی مخالفت کرو۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;