var nasai = {};
nasai.arabic = "أَخْبَرَنِي عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ جَنَابٍ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا الشَّيْبَ وَلَا تَشَبَّهُوا بِالْيَهُودِ";
nasai.urdu = "حضرت ابن عمررضی اللہ عنہما سےروایت ہے کہ رسول اللہﷺ نے فرمایا: سفید بالوں کو رنگ سے بدل لیا کرو اور یہودیوں سے مشابہت نہ کرو۔";
nasai.hukam = "صحیح";
nasai.description = ``;