var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَخْلَدِ بْنِ الْحُسَيْنِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كُنَاسَةَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ الزُّبَيْرِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا الشَّيْبَ وَلَا تَشَبَّهُوا بِالْيَهُودِ وَكِلَاهُمَا غَيْرُ مَحْفُوظٍ";
nasai.urdu = "حضرت زبیر﷜ سےروایت ہے کہ رسول اللہﷺ نے فرمایا: سفید بالوں کو رنگ لیا کرو اور یہودیوں کی مشابہت اختیار نہ کرو۔یہ دونوں روایتیں غیر محفوظ ہیں۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;