var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عُبَيْدِ اللَّهِ الْحَلَبِيُّ عَنْ عُبَيْدِ اللَّهِ وَهُوَ ابْنُ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَفَعَهُ أَنَّهُ قَالَ قَوْمٌ يَخْضِبُونَ بِهَذَا السَّوَادِ آخِرَ الزَّمَانِ كَحَوَاصِلِ الْحَمَامِ لَا يَرِيحُونَ رَائِحَةَ الْجَنَّةِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مرفوعاً روایت ہے کہ آخری زمانے میں ایسے لوگ ہوں گے جو سیاہ رنگ سے اپنے بال رنگیں گے جیسے کبوتروں کے سینے ہوتےہیں۔وہ جنت کی خوشبو بھی نہیں پائیں گے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;