var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثَّغَامَةِ بَيَاضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا هَذَا بِشَيْءٍ وَاجْتَنِبُوا السَّوَادَ";
nasai.urdu = "حضرت جابر ﷜ سے روایت ہے،انہوں نے فرمایا کہ حضرت ابوقحافہ﷜ کو فتح مکہ کے دن لایا گیا تو ان کے سر اور ڈاڑھی کے بال ثغامہ پودے(کے پھل اور پھول) کی طرح بالکل سفید تھے۔رسول اللہ ﷺ نے فرمایا: ان کو کسی رنگ سے بدل دو مگر سیاہ رنگ سے پرہیز کرنا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;