var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ حَيَّةٌ وَيَذْهَبُ الذَّاهِبُ إِلَى الْعَوَالِي وَالشَّمْسُ مُرْتَفِعَةٌ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ عصر کی نماز ادا فرماتے تھے جب کہ سورج کافی بلند اور تیز ہوتا تھا۔آپ کے ساتھ نماز پڑھنے والا عوالی کو جاتا تو سورج ابھی اونچا ہوتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;