var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى قَالَ حَدَّثَنَا بِهِ أَبِي عَنْ غَيْلَانَ عَنْ أَبِي إِسْحَقَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْضَلُ مَا غَيَّرْتُمْ بِهِ الشَّمَطَ الْحِنَّاءُ وَالْكَتَمُ";
nasai.urdu = "حضرت ابوذر﷜ سے روایت ہے کہ نبئ اکرمﷺ نے فرمایا: ’بہترین وہ چیز جس کے ساتھ تم سفید بالوں کو رنگو،مہندی اور وسمہ ہے";
nasai.hukam = "صحیح";
nasai.description = ``;