var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ الْأَجْلَحِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِي الْأَسْوَدِ الدِّيْلِيِّ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ";
nasai.urdu = "حضرت ابوذر سے روایت ہے کہ رسول اللہﷺ نےفرمایا: ’ بہترین وہ چیز جس سے تم سے سفید بالوں کا رنگ بدلو،مہندی اور وسمے کا آمیزہ ہے۔‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;