var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَشْعَثَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عِيسَى قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنِي ابْنُ أَبِي لَيْلَى عَنْ الْأَجْلَحِ فَلَقِيتُ الْأَجْلَحَ فَحَدَّثَنِي عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِي الْأَسْوَدِ الدِّيْلِيِّ عَنْ أَبِي ذَرٍّ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مِنْ أَحْسَنِ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءَ وَالْكَتَمَ";
nasai.urdu = "حضرت ابوذر﷜ بیان کرتے ہیں کہ میں نے نبئ اکرمﷺ کو فرماتے سنا:’ سب سے اچھی چیز جس کے ساتھ تم سفید بالوں کو رنگ دار کرو،مہندی اور وسمے کا مرکب ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;