var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ الْأَجْلَحِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِي الْأَسْوَدِ الدِّيْلِيِّ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ خَالَفَهُ الْجُرَيْرِيُّ وَكَهْمَسٌ";
nasai.urdu = "حضرت ابوذر ﷜ سےروایت ہے کہ رسول اللہﷺ نے فرمایا: بہترین وہ جیز جس سے تم سفید بالوں کو رنگین کرو،مہندی اور وسمے کا مجموعہ ہے۔\nجریری اور کہمس نے(اس روایت کے بیان کرنے میں اجلح کی) مخالفت کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;