var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ";
nasai.urdu = "حضرت عبداللہ بن بریدہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’ سب سے اچھی جیز جس کے ساتھ تم سفید بالوں کا رنگ بدلو،مہندی اور وسمے کا آمیزہ ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;