var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ كَهْمَسًا يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ";
nasai.urdu = "حضرت عبداللہ بن بریدہ سے روایت ہے کہ مجھے یہ بات پہنچی ہے کہ رسول اللہﷺ نے فرمایا:’ بہترین وہ چیز جس کے ساتھ تم سفید بالوں کا رنگ تبدیل کرو،مہندی اور وسمے کا مرکب ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;