var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّهُ سَأَلَهُ هَلْ خَضَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمْ يَبْلُغْ ذَلِكَ إِنَّمَا كَانَ شَيْءٌ فِي صُدْغَيْهِ";
nasai.urdu = "حضرت قتادہ سے روایت ہے کہ میں نے حضرت انس سے پوچھا: کیا رسول اللہﷺ نے بالوں کو رنگا ہے؟ آپ نے فرمایا: اس کی نوبت ہی نہیں آئی تھی۔صرف آپ کی کنپٹیوں میں کچھ ہی بال سفید تھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;