var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا الْمُثَنَّى يَعْنِي ابْنَ سَعِيدٍ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ يَخْضِبُ إِنَّمَا كَانَ الشَّمَطُ عِنْدَ الْعَنْفَقَةِ يَسِيرًا وَفِي الصُّدْغَيْنِ يَسِيرًا وَفِي الرَّأْسِ يَسِيرًا";
nasai.urdu = "حضرت انس﷜ سے روایت ہے کہ رسول اللہﷺ اپنے بالوں کو نہیں رنگتے تھے۔آپ کے سفید بال تھوڑے سے ڈاڑھی بچہ میں تھے،کچھ کنپٹیوں میں تھے اور معمولی سے سرمبارک میں تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;