var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا أَبُو زَيْدٍ سَعِيدُ بْنُ الرَّبِيعِ قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ قَالَ سَمِعْتُ كَرِيمَةَ قَالَتْ سَمِعْتُ عَائِشَةَ سَأَلَتْهَا امْرَأَةٌ عَنْ الْخِضَابِ بِالْحِنَّاءِ قَالَتْ لَا بَأْسَ بِهِ وَلَكِنْ أَكْرَهُ هَذَا لِأَنَّ حِبِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ رِيحَهُ تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت کریمہ نے کہا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے ایک عورت کو مہندی لگانے کے بارے میں سوال کرتے ہوئے سنا۔حضرت عائشہ رضی اللہ عنہا نے فرمایا: کوئی حرج نہیں لیکن میں اسے ناپسندکرتی ہوں کیونکہ میرے محبوبﷺ اس کی بوکوناپسند فرماتے تھے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4164)`;
nasai.anwaar = [360,1];