var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ امْرَأَتِهِ فَاطِمَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ";
nasai.urdu = "حضرت اسماء بنت ابی بکر رضی اللہ عنہا سے منقول ہے کہ رسول اللہﷺ نے جعلی بال لگانے والی اور لگوانے والی پر لعنت فرمائی ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;