var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُوتَشِمَةَ أَرْسَلَهُ الْوَلِيدُ بْنُ أَبِي هِشَامٍ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہﷺ نے جعلی بال لگانے والی،لگوانے والی،رنگ بھر نےوالی اور بھروانے والی عورتوں پر لعنت فرمائی ہے۔\nولید بن ابوہشام نے اس روایت کو مرسل بیان کیا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;