var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ قَالَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ عَنْ الْوَلِيدِ بْنِ أَبِي هِشَامٍ عَنْ نَافِعٍ أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ";
nasai.urdu = "حضرت نافع سے روایت ہے کہ مجھے یہ بات پہنچی ہے کہ رسول اللہ ﷺ نے جعلی بال ملانے والی،ملوانے والی،گودنے والی(جسم کے مختلف حصوں میں چھید کررنگ بھرنے والی یا جسم پر نقش ونگار بنانے والی) اور گدوانے والی(جسم کے مختلف حصوں کو چھدوا کر ان میں رنگ بھروانے ولی یا جسم کے مختلف حصوں پر چھدوا کر نقش ونگار کرانے والی) عورت پر لعنت فرمائی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;