var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنَا مِسْكِينُ بْنُ بُكَيْرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ الْحَسَنِ بْنِ مُسْلِمٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہﷺ نے فرمایا: اللہ تعالی نے جعلی بال لگانے والی اور لگوانے والی عورت پر لعنت فرمائی ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;