var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَاشِمَاتِ وَالْمُوتَشِمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ";
nasai.urdu = "حضرت عبداللہ بن مسعود نے فرمایا کہ رسول اللہﷺ نے رنگ بھرنےوالی،بھروانے والی،بال اکھیڑنے والی اور دانتوں کو رگڑ رگڑ کر باریک کرنے والی عورتوں پر لعنت فرمائی ہے جو حسن کی خاطر(اللہ تعالی کی بنائی ہوئی صورت میں) بگاڑ پیدا کرتی ہیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;