var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُرَّةَ يُحَدِّثُ عَنْ الْحَارِثِ عَنْ عَبْدِ اللَّهِ قَالَ آكِلُ الرِّبَا وَمُوكِلُهُ وَكَاتِبُهُ إِذَا عَلِمُوا ذَلِكَ وَالْوَاشِمَةُ وَالْمَوْشُومَةُ لِلْحُسْنِ وَلَاوِي الصَّدَقَةِ وَالْمُرْتَدُّ أَعْرَابِيًّا بَعْدَ الْهِجْرَةِ مَلْعُونُونَ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْقِيَامَةِ";
nasai.urdu = "حضرت عبداللہ بن مسعود﷜ نے فرمایا: سود لینے والا،دینے والا،سود لکھنے والا بشرطیکہ وہ جانتے بوجھتے ہوں اور حسن کی خاطر رنگ بھرنے والی،بھروانے والی،زکاۃ سے انکار کرنے والا اور مہاجرین جانے کے بعد دوبارہ باد یہ کو لوٹ جانے والا،یہ سب اشخاص حضرت محمدﷺ کی زبانی قیامت کےدن ملعون ہوں گے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>حارث الأعور ضعیف۔<br>ولبعض الحدیث شواہد صحیحۃ۔`;
nasai.anwaar = [360,1];