var nasai = {};
nasai.arabic = "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا حُصَيْنٌ وَمُغِيرَةُ وَابْنُ عَوْنٍ عَنْ الشَّعْبِيِّ عَنْ الْحَارِثِ عَنْ عَلِيٍّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَكَاتِبَهُ وَمَانِعَ الصَّدَقَةِ وَكَانَ يَنْهَى عَنْ النَّوْحِ أَرْسَلَهُ ابْنُ عَوْنٍ وَعَطَاءُ بْنُ السَّائِبِ";
nasai.urdu = "حضرت علی﷜ سے روایت ہے کہ رسول اللہﷺ نے سود کھانے والے،کھلانے والے،لکھنے والے اور صدقہ (زکاۃ) سے انکار کرنے والے پر لعنت فرمائی ہے،نیز آپ نوحہ کرنے سے منع فرماتے تھے۔\nاس روایت کو ابن عون(نے حارث سے) اور عطاء بن سائب نے(شعبی سے) مرسل بیان کیا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>حارث الأعور ضعیف۔<br>ولبعض الحدیث شواہد صحیحۃ۔`;
nasai.anwaar = [360,1];