var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ الشَّعْبِيِّ عَنْ الْحَارِثِ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا وَمُوكِلَهُ وَشَاهِدَهُ وَكَاتِبَهُ وَالْوَاشِمَةَ وَالْمُوتَشِمَةَ قَالَ إِلَّا مِنْ دَاءٍ فَقَالَ نَعَمْ وَالْحَالُّ وَالْمُحَلَّلُ لَهُ وَمَانِعُ الصَّدَقَةِ وَكَانَ يَنْهَى عَنْ النَّوْحِ وَلَمْ يَقُلْ لَعَنَ";
nasai.urdu = "حضرت حارث سے منقول ہے کہ رسول اللہ ﷺ نے سود کھانے والے،کھلانے والے،اس پر گواہ بننےوالے،اس کو لکھنے والے،رنگ بھرنے والی،بھروانے والی الا یہ کہ کسی بیماری کی وجہ سے ہوحلالہ کرنے والے،حلالہ کروانے والے،زکاۃ کی ادائیگی سے انکار کرنے والے لوگوں پر لعنت فرمائی ہے۔اور آپ نوحہ سے منع فرماتے تھے،البتہ اس میں لعنت کا ذکر نہیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>حارث الأعور ضعیف۔<br>ولبعض الحدیث شواہد صحیحۃ۔`;
nasai.anwaar = [361,1];