var nasai = {};
nasai.arabic = "حَدَّثَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا خَلَفٌ يَعْنِي ابْنَ خَلِيفَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ الشَّعْبِيِّ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا وَمُوكِلَهُ وَشَاهِدَهُ وَكَاتِبَهُ وَالْوَاشِمَةَ وَالْمُوتَشِمَةَ وَنَهَى عَنْ النَّوْحِ وَلَمْ يَقُلْ لَعَنَ صَاحِبَ";
nasai.urdu = "حضرت شعبی بیان کرتے ہیں کہ رسول اللہﷺ نے سود کھانے والے،کھلانے والے،سود پر گواہ بننے والے،اس کی کتابت کرنے والے،رنگ بھرنے والی،بھروانے والی پر لعنت فرمائی ہے۔اور نوحہ سے منع فرمایا ہے۔اور(راوی نے) یہ نہیں کہا کہ نوحہ کرنے والا ملعون ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;