var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَلِيٍّ مُحَمَّدُ بْنُ يَحْيَى الْمَرْوَزِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ عَنْ أَبِي حَمْزَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ الْعُرْيَانِ بْنِ الْهَيْثَمِ عَنْ قَبِيصَةَ بْنِ جَابِرٍ عَنْ ابْنِ مَسْعُودٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْعَنُ الْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ وَالْمُوتَشِمَاتِ اللَّاتِي يُغَيِّرْنَ خَلْقَ اللَّهِ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت ابن مسعود نے فرمایا: میں نے رسول اللہﷺ سے سنا کہ آپ بال اکھیڑنے والی،بہ تکلف دانتوں کو کشادہ کرنے والی اور رنگ بھروانے والی عورتوں پر لعنت کرتے تھے جو اللہ عزوجل کی پیدا کردہ صورت میں بگاڑ پیدا کرتی ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;