var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ الْعُرْيَانِ بْنِ الْهَيْثَمِ عَنْ قَبِيصَةَ بْنِ جَابِرٍ عَنْ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْعَنُ الْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ وَالْمُوتَشِمَاتِ اللَّاتِي يُغَيِّرْنَ خَلْقَ اللَّهِ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت عبداللہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہﷺ سے بال اکھیڑنے والی،دانتوں کو بہ تکلف کشادہ کرنے والی اور رنگ بھروانے والی عورتوں پر لعنت کرتے سنا ہے جو اللہ عزوجل کی بنائی ہوئی صورت میں تبدیلی پیدا کرتی ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;