var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ قَالَ أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ عَنْ الْعُرْيَانِ بْنِ الْهَيْثَمِ عَنْ قَبِيصَةَ بْنِ جَابِرٍ عَنْ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَعَنَ اللَّهُ الْمُتَنَمِّصَاتِ وَالْمُوتَشِمَاتِ وَالْمُتَفَلِّجَاتِ اللَّاتِي يُغَيِّرْنَ خَلْقَ اللَّهِ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت عبداللہ سے روایت ہے کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’ اللہ تعالی نے بال اکھیڑنے والی‘ رنگ بھروانے والی اور دانتوں کو بہ تکلف کھلا کرنے والی عورتوں پر لعنت فرمائی ہے جو اللہ عزوجل کی بنائی ہوئی صورت کی تبدیل کرتی ہیں۔‘";
nasai.hukam = "حسن";
nasai.description = ``;