var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ حَيْوَةَ بْنِ شُرَيْحٍ قَالَ حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ عَنْ أَبِي الْحُصَيْنِ الْحِمْيَرِيِّ أَنَّهُ كَانَ هُوَ وَصَاحِبٌ لَهُ يَلْزَمَانِ أَبَا رَيْحَانَةَ يَتَعَلَّمَانِ مِنْهُ خَيْرًا قَالَ فَحَضَرَ صَاحِبِي يَوْمًا فَأَخْبَرَنِي صَاحِبِي أَنَّهُ سَمِعَ أَبَا رَيْحَانَةَ يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ الْوَشْرَ وَالْوَشْمَ وَالنَّتْفَ";
nasai.urdu = "حضرت ابوالحصین حمیری سے روایت ہے کہ میں اور میرا ایک ساتھی حضرت ابوریحانہ﷜ کے ساتھ ہر وقت رہتے تھے اور ان سے اچھی باتیں سیکھتے (علم حاصل کرتے) تھے۔ایک دن میرا ساتھی ان کے پاس گیا اور پھر اس نے مجھے بتایا کہ میں نے حضرت ابوریحانہ﷜ کو فرماتے سنا کہ رسول اللہﷺ نے دانتوں کو باریک کرنا،رنگ بھر نا اور بال اکھیڑنا حرام قرار دیا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (5094)`;
nasai.anwaar = [361,1];