var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْحُصَيْنِ الْحِمْيَرِيِّ عَنْ أَبِي رَيْحَانَةَ قَالَ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْوَشْرِ وَالْوَشْمِ";
nasai.urdu = "حضرت ابوریحانہ ﷜ نے فرمایا: ہمیں یہ بات پہنچی ہے کہ رسول اللہﷺ نے دانتوں کو باریک کرنے اور گودنے(جسم کو چھید کر نقش ونگار بنانے اور رنگ بھرنے) سے منع فرمایا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر حدیث السابق (5094)`;
nasai.anwaar = [361,1];