var nasai = {};
nasai.arabic = "حَدَّثَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْحُصَيْنِ الْحِمْيَرِيِّ عَنْ أَبِي رَيْحَانَةَ قَالَ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْوَشْرِ وَالْوَشْمِ";
nasai.urdu = "حضرت ابوریحانہ﷜ سے روایت ہے کہ ہمیں یہ بات پہنچی ہے کہ رسول اللہﷺ نے دانتوں کو باریک کرنے اور رنگ بھرنے سے منع فرمایا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر حدیث السابق (5094)`;
nasai.anwaar = [361,1];