var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا دَاوُدُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ خَيْرِ أَكْحَالِكُمُ الْإِثْمِدَ إِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ أَبُو عَبْد الرَّحْمَنِ عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ لَيِّنُ الْحَدِيثِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ نے فرمایا: تمہارے لیے بہترین سرمہ اثمد ہے۔یہ نظر کو تیز کرتا ہے اور (پلکوں کے) بال بڑھاتا ہے۔\nابوعبدالرحمٰنٰ (امام نسائی﷫) نے فرمایا: عبداللہ بن عثمان بن خثیم لین الحدیث ہے۔(مطلب یہ کہ اس کی حدیث ضعیف ہے۔)";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;