var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ سُئِلَ عَنْ شَيْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ إِذَا ادَّهَنَ رَأْسَهُ لَمْ يُرَ مِنْهُ وَإِذَا لَمْ يُدَّهَنْ رُئِيَ مِنْهُ";
nasai.urdu = "حضرت سماک سے روایت ہے کہ میرے سامنے حضرت جابر بن سمرہ﷜ سے نبئ اکرمﷺ کے سفید بالوں کے بارے میں پوچھا گیا۔انہوں نے فرمایا: جب آپ سرکو تیل لگالیتے تھے تو سفید بال نظر نہیں آتے تھے اور جب تیل نہیں لگاتے تھے تو نظر آتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;