var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا الْقَعْنَبِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ زَيْدٍ عَنْ أَبِيهِ أَنَّ ابْنَ عُمَرَ كَانَ يَصْبُغُ ثِيَابَهُ بِالزَّعْفَرَانِ فَقِيلَ لَهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْبُغُ";
nasai.urdu = "حضرت ابن عمررضی اللہ عنہما اپنے کپڑے زعفران سے نگا کرتے تھے۔ان سے پوچھا گیا تو انہوں نے فرمایا: رسول اللہﷺ بھی(اپنے کپڑوں کو) اس سے رنگتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;