var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عُبَيْدَةَ بْنُ أَبِي السَّفَرِ عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا بَكْرٌ الْمُزَلِّقُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَطَاءٍ الْهَاشِمِيُّ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ سَأَلْتُ عَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَطَيَّبُ قَالَتْ نَعَمْ بِذِكَارَةِ الطِّيبِ الْمِسْكِ وَالْعَنْبَرِ";
nasai.urdu = "حضرت محمد بن علی﷫ نے فرمایا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا۔کیا رسول اللہﷺ خوشبو لگایا کرتے تھے؟ انہوں نے فرمایا: ہاں،مردوں والی خوشبوئیں لگایا کرتے تھے،کستوری اور عنبر۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>عبداﷲ بن عطاء مدلس وعنعن۔`;
nasai.anwaar = [361,1];