var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ يَعْنِي الْحَفَرِيَّ عَنْ سُفْيَانَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ رَجُلٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ";
nasai.urdu = "حضرت ابوہریرہ﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: مردوں کی خوشبو وہ ہے جس کی خوشبو ظاہر ہو اور رنگ مخفی اور اور عورتوں کی خوشبو و ہ ہے جس کا رنگ نمایاں ہو لیکن خوشبو مخفی ہو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ترمذی (2787)`;
nasai.anwaar = [361,1];