var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ الرَّقِّيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ الْفِرْيَابِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ الطَّفَاوِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ";
nasai.urdu = "حضرت ابوہریرہ﷜ سے روایت ہے کہ نبئ اکرمﷺ نے فرمایا: مردوں کی زینت (یا خوشبو) وہ ہے جس کی خوشبو ظاہر ہو،رنگ مخفی ہو اور عورتوں کی زینت (یا خوشبو) وہ ہے جس کا رنگ نمایاں ہو،خوشبو مخفی ہو۔";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف<br>انظر الحدیث السابق (5120)`;
nasai.anwaar = [361,1];