var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا شَبَابَةُ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ خُلَيْدِ بْنِ جَعْفَرٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ امْرَأَةً مِنْ بَنِي إِسْرَائِيلَ اتَّخَذَتْ خَاتِمًا مِنْ ذَهَبٍ وَحَشَتْهُ مِسْكًا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ أَطْيَبُ الطِّيبِ";
nasai.urdu = "حضرت ابوسعید خدری﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: بے شک بنی اسرائیل کی ایک عورت نے سونے کی انگوٹھی بنائی اور اس میں کستوری بھری۔(پھر) رسول اللہﷺ نے فرمایا: یہ بہترین خوشبو ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;