var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عِمْرَانَ بْنِ ظَبْيَانَ عَنْ حُكَيْمِ بْنِ سَعْدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهِ رَدْعٌ مِنْ خَلُوقٍ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَانْهَكْهُ ثُمَّ أَتَاهُ فَقَالَ اذْهَبْ فَانْهَكْهُ ثُمَّ أَتَاهُ فَقَالَ اذْهَبْ فَانْهَكْهُ ثُمَّ لَا تَعُدْ";
nasai.urdu = "حضرت ابوہریرہ﷜ سے روایت ہے،انہوں نے فرمایا کہ ایک آدمی نبئ اکرمﷺ کے پاس آیا تو اس پر مخلوق کا نشان تھا۔نبئ اکرمﷺ نے اسے فرمایا: جاؤ،اسے اچھی طرح دھو کر آؤ۔وہ پھر ےآیا تو آپ نے فرمایا: پھر جاؤ،اچھی طرح دھو کر آؤ۔وہ پھر آیا تو آپ نے فرمایا: پھر جاؤ،اسے اچھی طرح دھو ڈالو اور دوبارہ نہ لگانا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>عمران بن ظبیان: ضعیف ورمي بالتشیع،تنا قض فیہ ابن حبان (تقریب: 5158) وضعفہ الجمہور۔`;
nasai.anwaar = [361,1];