var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ قَالَ سَمِعْتُ أَبَا حَفْصِ بْنَ عَمْرٍو وَقَالَ عَلَى إِثْرِهِ يُحَدِّثُ عَنْ يَعْلَى بْنِ مُرَّةَ أَنَّهُ مَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُتَخَلِّقٌ فَقَالَ لَهُ هَلْ لَكَ امْرَأَةٌ قُلْتُ لَا قَالَ فَاغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ لَا تَعُدْ";
nasai.urdu = "حضرت یعلیٰ بن مرہ ﷜ سے روایت ہے کہ وہ نبئ اکرمﷺ کےپاس سے گزرے جبکہ انہوں نے خلوق لگائی ہوئی تھی۔آپ نے فرمایا: کیا تیری بیوی ہے؟ میں نےکہا: نہیں۔آپ نے فرمایا: اس کو دھودے۔اچھی طرح دھودے۔اور پھر دوبارہ نہ لگانا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ترمذی (2816)`;
nasai.anwaar = [361,1];