var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءٍ قَالَ سَمِعْتُ أَبَا حَفْصِ بْنَ عَمْرٍو عَنْ يَعْلَى بْنِ مُرَّةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْصَرَ رَجُلًا مُتَخَلِّقًا قَالَ اذْهَبْ فَاغْسِلْهُ ثُمَّ اغْسِلْهُ وَلَا تَعُدْ";
nasai.urdu = "حضرت یعلیٰ بن مرہ﷜ سے روایت ہے کہ رسول اللہﷺ نے ایک آدمی کو دیکھا جس نے خلوق لگا رکھی تھی۔آپ نے فرمایا: جا،اس کو دھو،پھر دھو(اچھی طرح دھو) اور دوبارہ نہ لگانا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (5124)`;
nasai.anwaar = [361,1];