var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءٍ عَنْ ابْنِ عَمْرٍو عَنْ رَجُلٍ عَنْ يَعْلَى نَحْوَهُ خَالَفَهُ سُفْيَانُ رَوَاهُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَبْدِ اللَّهِ بْنِ حَفْصٍ عَنْ يَعْلَى";
nasai.urdu = "حضرت یعلیٰ﷜ سےاس قسم کی روایت منقول ہے۔’خالفہ سفیان‘ اس روایت میں سفیان بن عیینہ نے شعبہ کی مخالفت کی ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (5124)`;
nasai.anwaar = [361,1];