var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ يَعْقُوبَ الصَّبِيحِيُّ قَالَ حَدَّثَنَا ابْنُ مُوسَى يَعْنِي مُحَمَّدًا قَالَ أَخْبَرَنِي أَبِي عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَبْدِ اللَّهِ بْنِ حَفْصٍ عَنْ يَعْلَى قَالَ مَرَرْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مُتَخَلِّقٌ فَقَالَ أَيْ يَعْلَى هَلْ لَكَ امْرَأَةٌ قُلْتُ لَا قَالَ اذْهَبْ فَاغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ لَا تَعُدْ قَالَ فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ غَسَلْتُهُ ثُمَّ غَسَلْتُهُ ثُمَّ لَمْ أَعُدْ";
nasai.urdu = "حضرت یعلیٰ ﷜ نے فرمایا: میں رسول اللہﷺ کے پاس سے گزرا جبکہ میں خلوق لگا رکھی تھی۔آپ نے فرمایا: ’یعلیٰ! تیری بیوی ہے؟ میں نے کہا: نہیں،آپ نے فرمایا: اے دھودے،اچھی طرح دھودے۔باربار دھودے۔پھر دوبارہ نہ لگانا۔میں گیا اور اس کو دھودیا،اچھی طرح دھو دیا۔بار بار دھویا،پھر دوبارہ کبھی نہیں لگائی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (5124)`;
nasai.anwaar = [361,1];