var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ثَابِتٌ وَهُوَ ابْنُ عِمَارَةَ عَنْ غُنَيْمِ بْنِ قَيْسٍ عَنْ الْأَشْعَرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ اسْتَعْطَرَتْ فَمَرَّتْ عَلَى قَوْمٍ لِيَجِدُوا مِنْ رِيحِهَا فَهِيَ زَانِيَةٌ";
nasai.urdu = "حضرت ابوموسیٰ اشعری﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: جو بھی عورت خوشبو لگا کر لوگوں کے پاس سے گزرتی ہے تاکہ وہ اس کی خوشبو سونگھیں (اور اس کی طرف متوجہ ہوں) تو وہ بدکارہ (زانیہ) ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;