var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ الْهَاشِمِيُّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ قَالَ سَمِعْتُ صَفْوَانَ بْنَ سُلَيْمٍ وَلَمْ أَسْمَعْ مِنْ صَفْوَانَ غَيْرَهُ يُحَدِّثُ عَنْ رَجُلٍ ثِقَةٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَتْ الْمَرْأَةُ إِلَى الْمَسْجِدِ فَلْتَغْتَسِلْ مِنْ الطِّيبِ كَمَا تَغْتَسِلُ مِنْ الْجَنَابَةِ مُخْتَصَرٌ";
nasai.urdu = "حضرت ابوہریرہ﷜ سےروایت ہے کہ رسول اللہﷺ نے فرمایا: جب کوئی عورت مسجد کو جانے لگے (اور اس نے پہلے خوشبو لگارکھی ہو)تو وہ اچھی طرح غسل کرے،جیسے وہ غسل جنابت کرتی ہے۔،یہ روایت مختصر ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;