var nasai = {};
nasai.arabic = "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَهِدَتْ إِحْدَاكُنَّ صَلَاةَ الْعِشَاءِ فَلَا تَمَسَّ طِيبًا";
nasai.urdu = "حضرت عبداللہ بن مسعود ﷜ یک زوجۂ محترمہ حضرت زینب رضی اللہ عنہا سے روایت ہے کہ رسول اللہﷺ نے فرمایا: جب کسی عورت کا ارادہ عشاء کی نماز مسجد میں پڑھنے کا ہو تو وہ خوشبو نہ لگائے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;