var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ يَعْقُوبَ الْحِمْصِيُّ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْنَبَ الثَّقَفِيَّةِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيَّتُكُنَّ خَرَجَتْ إِلَى الْمَسْجِدِ فَلَا تَقْرَبَنَّ طِيبًا";
nasai.urdu = "حضرت زینب ثقفیہ رضی اللہ عنہا سے مروی ہے کہ اللہ کے نبیﷺ نے فرمایا: جو عورت مسجد کو جائے وہ خوشبونہ لگائے۔";
nasai.hukam = "حسن";
nasai.description = ``;