var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الْقُرَشِيِّ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ زَيْنَبَ الثَّقَفِيَّةِ امْرَأَةِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهَا أَنْ لَا تَمَسَّ الطِّيبَ إِذَا خَرَجَتْ إِلَى الْعِشَاءِ الْآخِرَةِ";
nasai.urdu = "حضرت زینب ثقفیہ رضی اللہ عنہا،جو حضرت عبداللہ (بن مسعود) کی زوجہ محترمہ تھیں،سے روایت ہے کہ رسول اللہﷺ نے اسے (زینب کو) حکم دیا تھا کہ جب وہ عشاء کی نماز پڑھنے مسجد میں آئے تو خوشبو نہ لگائے۔";
nasai.hukam = "حسن";
nasai.description = ``;