var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ قَالَ أَنْبَأَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ هِشَامٍ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْنَبَ الثَّقَفِيَّةِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا خَرَجَتْ الْمَرْأَةُ إِلَى الْعِشَاءِ الْآخِرَةِ فَلَا تَمَسَّ طِيبًا";
nasai.urdu = "حضرت زینب ثفقیہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہﷺ نے فرمایا: جب کوئی عورت عشاء کی نماز کے لیے (مسجد میں) آئے تو خوشبو نہ لگائے۔";
nasai.hukam = "حسن";
nasai.description = ``;