var nasai = {};
nasai.arabic = "أَخْبَرَنِي يُوسُفُ بْنُ سَعِيدٍ قَالَ بَلَغَنِي عَنْ حَجَّاجٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي زِيَادُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْنَبَ الثَّقَفِيَّةِ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَهِدَتْ إِحْدَاكُنَّ الصَّلَاةَ فَلَا تَمَسَّ طِيبًا قَالَ أَبُو عَبْد الرَّحْمَنِ وَهَذَا غَيْرُ مَحْفُوظٍ مِنْ حَدِيثِ الزُّهْرِيِّ";
nasai.urdu = "حضرت زینب ثقفیہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہﷺ نے فرمایا: جب تم میں سے کوئی عورت نماز پڑھنے (مسجد میں) آ ئے تو کسی بھی قسم کی خوشبو نہ لگائے۔\nابوعبدالرحمٰن (امام نسائی﷫) نے کہا کہ یہ مذکورہ حدیث،زہری کی حدیث(کے طور پر) غیر محفوظ (اور شاذ) ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;