var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَبُو طَاهِرٍ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي مَخْرَمَةُ عَنْ أَبِيهِ عَنْ نَافِعٍ قَالَ كَانَ ابْنُ عُمَرَ إِذَا اسْتَجْمَرَ اسْتَجْمَرَ بِالْأَلُوَّةِ غَيْرَ مُطَرَّاةٍ وَبِكَافُورٍ يَطْرَحُهُ مَعَ الْأَلُوَّةِ ثُمَّ قَالَ هَكَذَا كَانَ يَسْتَجْمِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت نافع سے روایت ہے کہ حضرت ابن عمررضی اللہ عنہما جب خوشبو لگاتے تو ’اگر‘ کی لکڑی سلگاتے اور اس میں کوئی دوسری خوشبو نہ ڈالتے۔البتہ کبھی ’ اگر‘ کے ساتھ کافور ڈال لیتے،پھر فرماتے کہ رسول اللہﷺ بھی اسی طرح خوشبو سلگایا کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;