var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا عُشَّانَةَ هُوَ الْمَعَافِرِيُّ حَدَّثَهُ أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ يُخْبِرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمْنَعُ أَهْلَهُ الْحِلْيَةَ وَالْحَرِيرَ وَيَقُولُ إِنْ كُنْتُمْ تُحِبُّونَ حِلْيَةَ الْجَنَّةِ وَحَرِيرَهَا فَلَا تَلْبَسُوهَا فِي الدُّنْيَا";
nasai.urdu = "حضرت عقبہ بن عامر﷜ فرماتے تھے کہ رسول اللہﷺ اپنی بیویوں کو زیورات اور ریشم سے روکتے تھے اور فرماتے تھے: اگر تم جنت کے زیورات اور ریشم پہننا چاہتے ہو تو ان کو دنیا میں نہ پہنو۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;