var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنْ امْرَأَتِهِ عَنْ أُخْتِ حُذَيْفَةَ قَالَتْ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مَعْشَرَ النِّسَاءِ أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ أَمَا إِنَّهُ لَيْسَ مِنْ امْرَأَةٍ تَحَلَّتْ ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِ";
nasai.urdu = "حضرت حذیفہ﷜ کی ہمیشرہ محترمہ فرماتی ہیں کہ رسول اللہﷺ نے ہمیں خطبہ دیتے ہوئے فرمایا: اے عورتوں کی جماعت! کیا تمہارے لیے یہ کافی نہیں کہ تم چاندی کے زیورات پہن لو؟ خبردار! جو بھی عورت سونے کے زیورات نمائش کےلیے پہنے گی،اسے اس کی بنا پر عذاب ہوگا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4237)`;
nasai.anwaar = [362,1];