var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ مَنْصُورًا يُحَدِّثُ عَنْ رِبْعِيٍّ عَنْ امْرَأَتِهِ عَنْ أُخْتِ حُذَيْفَةَ قَالَتْ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مَعْشَرَ النِّسَاءِ أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ أَمَا إِنَّهُ لَيْسَ مِنْكُنَّ امْرَأَةٌ تُحَلَّى ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِ";
nasai.urdu = "حضرت حذیفہ﷜ کی ہمشیرہ محترمہ سے روایت ہے کہ رسول اللہ ﷺ نے ہمیں خطاب فرمایا: اے عورتوں کی جماعت! کیا تمہارے لیےچاندی کے زیورات کافی نہیں؟ خبردار! جوعورت سونا نمائش کے لیے پہنے گی،اسےاسی سونے سے عذا ب دیا جائے گا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4237)`;
nasai.anwaar = [362,1];