var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي مَحْمُودُ بْنُ عَمْرٍو أَنَّ أَسْمَاءَ بِنْتَ يَزِيدَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ تَحَلَّتْ يَعْنِي بِقِلَادَةٍ مِنْ ذَهَبٍ جُعِلَ فِي عُنُقِهَا مِثْلُهَا مِنْ النَّارِ وَأَيُّمَا امْرَأَةٍ جَعَلَتْ فِي أُذُنِهَا خُرْصًا مِنْ ذَهَبٍ جَعَلَ اللَّهُ عَزَّ وَجَلَّ فِي أُذُنِهَا مِثْلَهُ خُرْصًا مِنْ النَّارِ يَوْمَ الْقِيَامَةِ";
nasai.urdu = "حضرت اسماء بنت یزید رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہﷺ نے فرمایا: جو عورت(نمائش کے لیے) سونے کا ہار پہنے گی،اللہ تعالی(قیامت کےدن) اس کی گردن میں آگ کا ہار ڈالے گا۔اور جو عورت (نمائش کےلیے) اپنے کانوں میں سونے کی بالیاں ڈالے گی،اللہ تعالی قیامت کے دن اس کے کان میں آگ کی بالیاں ڈالے گا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (4238)`;
nasai.anwaar = [362,1];