var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَّامٍ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ قَالَ جَاءَتْ بِنْتُ هُبَيْرَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي يَدِهَا فَتَخٌ مِنْ ذَهَبٍ أَيْ خَوَاتِيمُ ضِخَامٌ نَحْوَهُ";
nasai.urdu = "حضرت ثوبان ﷜ نے فرمایا: حضرت (فاطمہ) بنت ہبیرہ رضی اللہ عنہا رسول اللہﷺ کی خدمت میں حاضر ہوئیں تو ان کے ہاتھ میں سونے کی بڑی بڑی انگوٹھیاں تھیں۔باقی روایت حسب سابق ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;