var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي أَفْلَحَ الْهَمْدَانِيِّ عَنْ ابْنِ زُرَيْرٍ أَنَّهُ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ إِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ حَرِيرًا فَجَعَلَهُ فِي يَمِينِهِ وَأَخَذَ ذَهَبًا فَجَعَلَهُ فِي شِمَالِهِ ثُمَّ قَالَ إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمَّتِي";
nasai.urdu = "حضرت علی بن ابی طالب﷜ نے فرمایا کہ اللہ کے نبیﷺ نے ریشم اپنے دائیں ہاتھ میں پکڑا اور سونا اپنے بائیں ہاتھ میں،پھر فرمایا: یہ دونوں چیزیں (پہننا) میری امت کے مردوں پر حرام ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;