var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ ابْنِ أَبِي الصَّعْبَةِ عَنْ رَجُلٍ مَنْ هَمْدَانَ يُقَالُ لَهُ أَبُو صَالِحٍ عَنْ ابْنِ زُرَيْرٍ أَنَّهُ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ حَرِيرًا فَجَعَلَهُ فِي يَمِينِهِ وَأَخَذَ ذَهَبًا فَجَعَلَهُ فِي شِمَالِهِ ثُمَّ قَالَ إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمَّتِي";
nasai.urdu = "حضرت علی بن ابی طالب﷜ نے فرمایا: رسول اللہﷺ نےریشم اپنے دائیں ہاتھ میں لیا اور سونا بائیں ہاتھ میں،پھر فرمایا: یہ دونوں میری امت کے مردوں پر حرام ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;