var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ مَعْمَرًا عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ رَكْعَتَيْنِ مِنْ صَلَاةِ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ أَوْ رَكْعَةً مِنْ صَلَاةِ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جس نے عصر کی دورکعتیں سورج غروب ہونے سے پہلے پڑھ لیں یا صبح کی ایک رکعت سورج طلوع ہونے سے پہلے پڑھ لی تو اس نے نمازپالی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;