var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ الدِّرْهَمِيُّ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِي مُوسَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُحِلَّ الذَّهَبُ وَالْحَرِيرُ لِإِنَاثِ أُمَّتِي وَحُرِّمَ عَلَى ذُكُورِهَا";
nasai.urdu = "حضرت ابوموسیٰ ﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: سونا اور ریشم (پہننا) میری امت کی عورتوں کے لیے حلال کیا گیا ہے جبکہ مردوں پر حرام ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;