var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ عَنْ سُفْيَانَ بْنِ حَبِيبٍ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مُعَاوِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الْحَرِيرِ وَالذَّهَبِ إِلَّا مُقَطَّعًا خَالَفَهُ عَبْدُ الْوَهَّابِ رَوَاهُ عَنْ خَالِدٍ عَنْ مَيْمُونٍ عَنْ أَبِي قِلَابَةَ";
nasai.urdu = "حضرت معاویہ ﷜ سے روایت ہے کہ رسول اللہﷺ نے ریشم اور سونا پہننے سے منع فرمایا ہے مگر تھوڑا تھوڑا۔\nعبدالوہاب نے اس (سفیان بن حبیب) کی مخالفت کی ہے۔اس نے یہ روایت خالد،عن میمون عن ابی قلابۃ کی سند سے روایت کی ہے۔(اس نے ابو قلابہ اور خالد حذاء کےدرمیان میمون کا واسطہ بڑھادیا ہے۔) واللہ اعلم";
nasai.hukam = "صحیح";
nasai.description = ``;