var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ مَيْمُونٍ عَنْ أَبِي قِلَابَةَ عَنْ مُعَاوِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا وَعَنْ رُكُوبِ الْمَيَاثِرِ";
nasai.urdu = "حضرت معاویہ ﷜ سے مروی ہے کہ رسول اللہﷺ نے سونا پہننے سے منع فرمایا ہے الایہ کہ مختلف جگہوں پر قلیل مقدار میں ہو اور ریشمی گدیلوں پربیٹھنے سے بھی منع فرمایا۔";
nasai.hukam = "صحیح";
nasai.description = ``;