var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَبِي شَيْخٍ أَنَّهُ سَمِعَ مُعَاوِيَةَ وَعِنْدَهُ جَمْعٌ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَعْلَمُونَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا قَالُوا اللَّهُمَّ نَعَمْ";
nasai.urdu = "حضرت ابوالشیخ سے روایت ہے کہ انہوں نے حضرت معاویہ ﷜ کو فرماتے سنا جب کہ ان کے پاس بہت سے اصحاب محمدﷺ بیٹھے تھے: کیا تم جانتے ہوکہ نبی اللہﷺ نے سونا پہننے سے منع فرمایا ہے الایہ کہ وہ مختلف جگہوں پر تھوڑا تھوڑا ہو؟ انہوں نے کہا: اللہ کی قسم! ہاں۔";
nasai.hukam = "صحیح";
nasai.description = ``;