var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ مَعْمَرًا عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ رَكْعَةً مِنْ صَلَاةِ الْعَصْرِ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ أَوْ أَدْرَكَ رَكْعَةً مِنْ الْفَجْرِ قَبْلَ طُلُوعِ الشَّمْسِ فَقَدْ أَدْرَكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،نبی ﷺ نے فرمایا: ’’جو شخص سورج غروب ہونے سے قبل عصر کی نماز سے ایک رکعت پالے یا سورج طلوع ہونے سے قبل صبح کی ایک رکعت پالے تو یقیناً اس نے وہ نماز پالی۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;