var nasai = {};
nasai.arabic = "و أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ عَنْ عُقْبَةَ عَنْ الْأَوْزَاعِيِّ حَدَّثَنِي يَحْيَى قَالَ حَدَّثَنِي أَبُو إِسْحَقَ قَالَ حَدَّثَنِي أَبِي حِمَّانَ قَالَ حَجَّ مُعَاوِيَةُ فَدَعَا نَفَرًا مِنْ الْأَنْصَارِ فِي الْكَعْبَةِ فَقَالَ أَلَمْ تَسْمَعُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الذَّهَبِ قَالُوا نَعَمْ قَالَ وَأَنَا أَشْهَدُ";
nasai.urdu = "حضرت ابن حمان سے روایت ہے کہ حضرت معاویہ ﷜ حج کو گئے تو وہاں انہوں نے کعبہ میں انصار کی ایک جماعت کو بلایا اور فرمایا: کیا تم نے رسول اللہﷺ کو سونے کے استعمال سے منع فرماتے نہیں سنا؟ انہوں نے فرمایا: ہاں!(سنا ہے) حضرت معاویہ ﷜ نے فرمایا: میں بھی گواہی دیتا ہوں۔";
nasai.hukam = "حسن";
nasai.description = ``;