var nasai = {};
nasai.arabic = "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا عَلِيُّ بْنُ غُرَابٍ قَالَ حَدَّثَنَا بَيْهَسُ بْنُ فَهْدَانَ قَالَ أَنْبَأَنَا أَبُو شَيْخٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا قَالَ أَبُو عَبْد الرَّحْمَنِ حَدِيثُ النَّضْرِ أَشْبَهُ بِالصَّوَابِ وَاللَّهُ تَعَالَى أَعْلَمُ";
nasai.urdu = "حضرت ابن عمررضی اللہ عنہما نے فرمایا: رسول اللہﷺ نے سونے کے استعمال سے منع فرمایا الا یہ کہ وہ بکھرا ہوا ہو۔\nابوعبدالرحمٰن (امام نسائی﷫) نے کہا کہ نضر(ابن شمیل) کی حدیث زیادہ درست ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;