var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا سَلْمُ بْنُ زُرَيْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ طَرَفَةَ عَنْ جَدِّهِ عَرْفَجَةَ بْنِ أَسْعَدَ أَنَّهُ أُصِيبَ أَنْفُهُ يَوْمَ الْكُلَابِ فِي الْجَاهِلِيَّةِ فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَّخِذَ أَنْفًا مِنْ ذَهَب";
nasai.urdu = "حضرت عرفجہ بن اسعد﷜ سے روایت ہے کہ دور جاہلیت میں جنگ کلاب کے دن ان کی ناک کٹ گئی تھی تو انہوں نے چاندی کی ناک لگوالی لیکن (وہ خراب ہوگئی اور) اس سے بدبو آنے لگی تو نبئ اکرمﷺ نے فرمایا کہ وہ سونے کی ناک لگوالے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;