var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ أَبِي الْأَشْهَبِ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ طَرَفَةَ عَنْ عَرْفَجَةَ بْنِ أَسْعَدَ بْنِ كُرَيْبٍ قَالَ وَكَانَ جَدُّهُ قَالَ حَدَّثَنِي أَنَّهُ رَأَى جَدَّهُ أُصِيبَ أَنْفُهُ يَوْمَ الْكُلَابِ فِي الْجَاهِلِيَّةِ قَالَ فَاتَّخَذَ أَنْفًا مِنْ فِضَّةٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَّخِذَهُ مِنْ ذَهَبٍ";
nasai.urdu = "حضرت عبدالرحمٰن بن طرفہ نے اپنے دادا محترم حضرت عرفجہ بن اسعد ﷜ سے بیان کیا اورانہوں نے اپنے دادا محترم کو دیکھا تھا کہ جنگ کلاب کے دن ان کی ناک کٹ گئی تھی۔انہوں نے چاندی کی ناک لگوالی لیکن اس سے بدبو آنے لگی تو نبئ اکرم ﷺ نے انہیں فرمایا کہ سونے کی ناک لگوالو۔";
nasai.hukam = "حسن";
nasai.description = ``;