var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ أَبِي إِسْحَقَ عَنْ صَعْصَعَةَ بْنِ صُوحَانَ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ حَلْقَةِ الذَّهَبِ وَالْقَسِّيِّ وَالْمِيثَرَةِ وَالْجِعَةِ قَالَ أَبُو عَبْد الرَّحْمَنِ الَّذِي قَبْلَهُ أَشْبَهُ بِالصَّوَابِ";
nasai.urdu = "حضرت علی﷜ سے روایت ہے کہ رسو ل اللہﷺ نے مجھے سونے کی انگوٹھی،قسی کپڑوں‘ ریشمی گدیلے اور جعہ کےاستعمال سے منع فرمایا۔\nابوعبدالرحمٰن (امام نسائی﷫) نے کہا: اس (حدیث:5171) سے پہلی روایت(5170) زیادہ درست ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;