var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ دَاوُدَ الْمُنْكَدِرِيُّ قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ عَنْ إِبْرَاهِيمَ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا أَقُولُ نَهَاكُمْ عَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَعَنْ لُبْسِ الْمُفَدَّمِ وَالْمُعَصْفَرِ وَعَنْ الْقِرَاءَةِ رَاكِعًا";
nasai.urdu = "حضرت علی﷜ سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ نے مجھے سونے کی انگوٹھی پہننے اور قسی کپڑے کے لباس،سرخ اور کسم رنگ کے لباس اور رکوع کی حالت میں قراءت قرآن سے منع فرمایا ہے۔میں یہ نہیں کہتا کہ تم کو منع فرمایا۔(تفصیل سابقہ روایت میں ہے۔)";
nasai.hukam = "حسن";
nasai.description = ``;