var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ عَلِيًّا يَقُولُ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا أَقُولُ نَهَاكُمْ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ الْقَسِّيِّ وَالْمُعَصْفَرِ وَأَنْ لَا أَقْرَأَ وَأَنَا رَاكِعٌ";
nasai.urdu = "حضرت علی﷜ نے فرمایا: رسول اللہﷺ نے مجھے سونے کی انگوٹھی،قسی کپڑے اور کسم سے رنگے ہوئے کپڑے پہننے اور رکوع کی حالت میں قرآن مجید پڑھنے سے منع فرمایا ہے۔میں نہیں کہتا کہ تم کو منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;