var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ عَنْ مُحَمَّدِ بْنِ عِيسَى وَهُوَ ابْنُ الْقَاسِمِ بْنِ سُمَيْعٍ قَالَ حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ عَنْ نَافِعٍ عَنْ إِبْرَاهِيمَ مَوْلَى عَلِيٍّ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ الْمُعَصْفَرِ وَعَنْ لُبْسِ الْقَسِّيِّ وَعَنْ الْقِرَاءَةِ فِي الرُّكُوعِ";
nasai.urdu = "حضرت علی﷜ سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ نےمجھے سونے کی انگوٹھی،کسم سے رنگےہوئے کپڑے اور قسی کپڑے پہننے سے،نیز رکوع کی حالت میں قرآن کریم پڑھنے سے منع فرمایا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;