var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَجَّاجِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ حُنَيْنٍ مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَلِيًّا قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْقَسِّيِّ وَالْمُعَصْفَرِ وَعَنْ التَّخَتُّمِ بِالذَّهَبِ";
nasai.urdu = "حضرت علی ﷜ نے فرمایا: رسول اللہﷺ نے مجھے قسی کپڑے،کسم سے رنگے ہوئے کپڑے اور سونے کی انگوٹھی پہننے سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;