var nasai = {};
nasai.arabic = "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا حَرْبٌ وَهُوَ ابْنُ شَدَّادٍ عَنْ يَحْيَى قَالَ حَدَّثَنِي عَمْرُو بْنُ سَعِيدٍ الْفَدَكِيُّ أَنَّ نَافِعًا أَخْبَرَهُ قَالَ حَدَّثَنِي ابْنُ حُنَيْنٍ أَنَّ عَلِيًّا حَدَّثَهُ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثِيَابِ الْمُعَصْفَرِ وَعَنْ خَاتَمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَأَنْ أَقْرَأَ وَأَنَا رَاكِعٌ خَالَفَهُ اللَّيْثُ بْنُ سَعْدٍ";
nasai.urdu = "حضرت علی﷜ نے بیان فرمایا کہ رسول اللہﷺنے مجھے معصفر کپڑوں،سونے کی انگوٹھی اور قسی کپڑوں کے پہننے سے اور رکوع کی حالت میں قرآن مجید پڑھنے سے منع فرمایا۔\nلیث بن سعد نے اس(عمرو بن سعید) کی مخالفت کی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;