var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ بَعْضِ مَوَالِي الْعَبَّاسِ عَنْ عَلِيٍّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُعَصْفَرِ وَالثِّيَابِ الْقَسِّيَّةِ وَعَنْ أَنْ يَقْرَأَ وَهُوَ رَاكِعٌ";
nasai.urdu = "حضرت علی﷜ سے روایت ہے کہ رسول اللہﷺ نے کسم سے رنگے ہوئے اور قسی کپڑوں اور رکوع کی حالت میں قرآن مجید پڑھنے سے منع فرمایا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;