var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ أَشْعَثَ عَنْ مُحَمَّدٍ عَنْ عَبِيدَةَ عَنْ عَلِيٍّ قَالَ نَهَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَسِّيِّ وَالْحَرِيرِ وَخَاتَمِ الذَّهَبِ وَأَنْ أَقْرَأَ رَاكِعًا خَالَفَهُ هِشَامٌ وَلَمْ يَرْفَعْهُِ";
nasai.urdu = "حضرت علی﷜ نے فرمایا: نبئ اکرم ﷺ نے مجھے قسی کپڑوں،ریشم،سونے کی انگوٹھی اور دوران رکوع میں قراءت قرآن سے منع فرمایا ہے۔\nہشام نے اس (اشعث بن عبدالملک) کی مخالفت کی ہے اور اس نےاسے مرفوع بیان نہیں کیا۔";
nasai.hukam = "حسن";
nasai.description = ``;