var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ نَصْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَدِّهِ مُعَاذٍ أَنَّهُ طَافَ مَعَ مُعَاذِ ابْنِ عَفْرَاءَ فَلَمْ يُصَلِّ فَقُلْتُ أَلَا تُصَلِّي فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ بَعْدَ الْعَصْرِ حَتَّى تَغِيبَ الشَّمْسُ وَلَا بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ";
nasai.urdu = "حضرت معاذ سے روایت ہے کہ انھوں نے حضرت معاذ بن عفراء رضی اللہ عنہ کے ساتھ طواف کیا اور (دورکعت) نماز نہ پڑھی۔میں نے کہا: آپ (طواف کی دو رکعت) نماز نہیں پڑھیں گے؟ وہ فرمانے لگے: تحقیق رسول اللہ ﷺ نے فرمایا ہے: ’’عصر کے بعد (نفل) نماز نہ پڑھی جائے حتیٰ کہ سورج غروب ہوجائے اور صبح کے بعد بھی (نفل) نماز نہ پڑھی جائے حتیٰ کہ سورج طلوع ہوجائے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>نصر مجہول (التحریر :7117)۔<br>وفیہ علۃ أخری،انظر الإصابۃ (3/ 428 ت 8039)`;
nasai.anwaar = [324,1];