var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ الْبَصْرِيُّ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَبِي التَّيَّاحِ قَالَ حَدَّثَنَا حَفْصٌ اللَّيْثِيُّ قَالَ أَشْهَدُ عَلَى عِمْرَانَ أَنَّهُ حَدَّثَنَا قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْحَرِيرِ وَعَنْ التَّخَتُّمِ بِالذَّهَبِ وَعَنْ الشُّرْبِ فِي الْحَنَاتِمِ";
nasai.urdu = "حضرت حفص لیثی بیان کرتے ہیں کہ میں حضرت عمران(بن حصین) ﷜ کے بارے میں گواہی دیتا ہوں کہ انہوں نے ہمیں بیان فرمایا کہ رسول اللہﷺ نے ریشم پہننے،سونے کی انگوٹھی استعمال کرنے اور سبز مٹکوں کا نبیذ پینے سے منع فرمایا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;