var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو إِدْرِيسَ الْخَوْلَانِيُّ أَنَّ رَجُلًا مِمَّنْ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ خَاتِمًا مِنْ ذَهَبٍ نَحْوَهُ قَالَ أَبُو عَبْد الرَّحْمَنِ وَحَدِيثُ يُونُسَ أَوْلَى بِالصَّوَابِ مِنْ حَدِيثِ النُّعْمان";
nasai.urdu = "حضرت ابو ادریس خولانی نے بیان فرمایا کہ ایک آدمی جس نے نبئ اکرم ﷺ سے ملاقات کی ہے،نے سونے کی انگوٹھی پہنی۔(پھر راوی نے) سابقہ حدیث کی طرح بیان کیا۔\nابوعبدالرحمٰن (امام نسائی﷫) نے فرمایا: یونس کی حدیث نعمان کی حدیث سے زیادہ درست ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>السند مرسل`;
nasai.anwaar = [362,1];