var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْقُرَشِيُّ الدِّمَشْقِيُّ أَبُو عَبْدِ الْمَلِكِ قِرَاءَةً قَالَ حَدَّثَنَا ابْنُ عَائِذٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى رَجُلٍ خَاتَمًا مِنْ ذَهَبٍ نَحْوَهُ";
nasai.urdu = "حضرت ابو ادریس خولانی سے منقول ہے کہ رسول اللہﷺ نے ایک آدمی کو سونے کی انگوٹھی پہنے دیکھا۔(پھر راوی نے) حسب سابق پوری حدیث بیان کی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>السند مرسل`;
nasai.anwaar = [362,1];