var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ الْعُمَرِيُّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي يَدِ رَجُلٍ خَاتَمَ ذَهَبٍ فَضَرَبَ إِصْبَعَهُ بِقَضِيبٍ كَانَ مَعَهُ حَتَّى رَمَى بِهِ";
nasai.urdu = "حضرت ابو ادریس سے روایت ہے کہ نبئ اکرمﷺ نے ایک آدمی کے ہاتھ میں سونے کی انگوٹھی دیکھی تو آپ نے اپنی چھڑی اس کی انگلی پر ماری حتی کہ اس نے انگوٹھی اتار کر پھینک دی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>السند مرسل`;
nasai.anwaar = [362,2];