var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَبُو بَكْرٍ أَحْمَدُ بْنُ عَلِيٍّ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا الْوَرْكَانِيُّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلٌ قَالَ أَبُو عَبْد الرَّحْمَنِ وَالْمَرَاسِيلُ أَشْبَهُ بِالصَّوَابِ";
nasai.urdu = "حضرت ابن شہاب نے یہ روایت مرسلاً بیان کی ہے۔(صحابی کا واسطہ ذکر نہیں کیا۔)\nابو عبدالرحمٰن (امام نسائی﷫) نے کہا: مرسل روایتیں زیادہ ٹھیک اور درست ہیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>السند مرسل`;
nasai.anwaar = [363,1];