var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا مِنْ وَرِقٍ فَصُّهُ حَبَشِيٌّ وَنُقِشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ";
nasai.urdu = "حضرت انس ﷜ سے روایت ہے کہ نبئ اکرمﷺ نے چاندی کی انگوٹھی بنوائی۔اس کا نگینہ حبشی تھا اور اس میں’ محمد رسول اللہ‘ کے الفاظ کندہ تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;