var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ وَالْحُسَيْنُ بْنُ حُرَيْثٍ عَنْ أَبِي أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَاءِ وَمَا يَنُوبُهُ مِنْ الدَّوَابِّ وَالسِّبَاعِ فَقَالَ إِذَا كَانَ الْمَاءُ قُلَّتَيْنِ لَمْ يَحْمِلْ الْخَبَثَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سےروایت ہے کہ رسول اللہ ﷺ سےاس پانی کے بارے میں پوچھا گیا جس پر عام جانور اور درندے (پانی پینے اور نہانے کے لیے) آتے جاتے رہتے ہیں۔آپ نے فرمایا: ’’جب پانی دو مٹکے (یا اس سے زائد) ہو تو وہ (مذکورہ چیزوں سے) پلید نہیں ہوتا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;