var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبَّادُ بْنُ مُوسَى قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمُ فِضَّةٍ يَتَخَتَّمُ بِهِ فِي يَمِينِهِ فَصُّهُ حَبَشِيٌّ يَجْعَلُ فَصَّهُ مِمَّا يَلِي كَفَّهُ";
nasai.urdu = "حضرت انس بن مالک﷜ نے فرمایا: رسول اللہﷺ کے پاس چاندی کی انگوٹھی تھی جسے آپ اپنے دائیں ہاتھ میں پہنتے تھے۔اس کا نگینہ حبشہ کا بنا ہوا تھا اور آپ نگینہ ہتھیلی کی جانب رکھتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;