var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ الْحِمْصِيُّ وَكَانَ أَبُوهُ خَالِدٌ عَلَى قَضَاءِ حِمْصَ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سَلَمَةُ وَهُوَ ابْنُ عَبْدِ الْمَلِكِ الْعَوْصِيُّ عَنْ الْحَسَنِ وَهُوَ ابْنُ صَالِحِ بْنِ حَيٍّ عَنْ عَاصِمٍ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ خَاتَمُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ وَكَانَ فَصُّهُ مِنْهُ";
nasai.urdu = "حضرت انس بن مالک ﷜ نے فرمایا: رسو ل اللہﷺ کی انگوٹھی چاندی کی تھی اور نگینہ بھی اسی (چاندی) کا تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;