var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ أَبُو الْجَوْزَاءِ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ أَخَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْعِشَاءِ الْآخِرَةِ حَتَّى مَضَى شَطْرُ اللَّيْلِ ثُمَّ خَرَجَ فَصَلَّى بِنَا كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ خَاتَمِهِ فِي يَدِهِ مِنْ فِضَّةٍ";
nasai.urdu = "حضرت انس﷜سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ نے ایک بار عشاء کی نماز میں تاخیر فرمادی حتی کہ تقریباً نصف رات گزر گئی۔پھرآپ تشریف لائے اور ہمیں نماز پڑھائی۔مجھے اب بھی یوس محسوس ہوتا ہے کہ میں(عالم تصور میں) آپ کے دست مبارک میں آپ کی چاندی کی انگوٹھی کی چمک دیکھ رہا ہوں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;