var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ سُلَيْمَانَ هُوَ ابْنُ بِلَالٍ عَنْ شَرِيكٍ هُوَ ابْنُ أَبِي نَمِرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ قَالَ شَرِيكٌ وَأَخْبَرَنِي أَبُو سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْبَسُ خَاتَمَهُ فِي يَمِينِهِ";
nasai.urdu = "حضرت علی﷜ سے روایت ہے کہ نبئ اکرمﷺ اپنی انگوٹھی دائیں ہاتھ میں پہنا کرتا تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;