var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ أَبِي عَتَّابٍ سَهْلِ بْنِ حَمَّادٍ ح وَأَنْبَأَنَا أَبُو دَاوُدَ حَدَّثَنَا أَبُو عَتَّابٍ سَهْلِ بْنِ حَمَّادٍ قَالَ حَدَّثَنَا أَبُو مَكِينٍ قَالَ حَدَّثَنَا إِيَاسُ بْنُ الْحَارِثِ بْنِ الْمُعَيْقِيبِ عَنْ جَدِّهِ مُعَيْقِيبٍ أَنَّهُ قَالَ كَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيدًا مَلْوِيًّا عَلَيْهِ فِضَّةٌ قَالَ وَرُبَّمَا كَانَ فِي يَدِي فَكَانَ مُعَيْقِيبٌ عَلَى خَاتَمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت معیقیب﷜ نے فرمایا: نبئ اکرمﷺ کی انگوٹھی لوہے کی تھی جس پر چاندی کا خول چڑھایا گیا تھا۔اور بسا اوقات وہ میرے ہاتھ میں رہتی تھی۔(اور حضرت معیقیبت﷜ رسول اللہﷺ کی انگوٹھی مبارک کی حفاظت پر مامور تھے۔)";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;