var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ قَالَ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَنَسٍ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ اتَّخَذَ حَلْقَةً مِنْ فِضَّةٍ فَقَالَ مَنْ أَرَادَ أَنْ يَصُوغَ عَلَيْهِ فَلْيَفْعَلْ وَلَا تَنْقُشُوا عَلَى نَقْشِهِ";
nasai.urdu = "حضرت انس ﷜سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ (گھر سے) باہر تشریف لائے جبکہ آپ نے چاندی کی انگوٹھی پہن رکھی تھی۔آپ نے فرمایا: جو شخص اس کے مطابق انگوٹھی بنانا چاہے،بنالے لیکن اس کے نقش جیسا نقش نہ کروانا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;