var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى الْخُوَارِزْمِيُّ بِبَغْدَادَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا الْعَوَّامُ بْنُ حَوْشَبٍ عَنْ أَزْهَرَ بْنِ رَاشِدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَسْتَضِيئُوا بِنَارِ الْمُشْرِكِينَ وَلَا تَنْقُشُوا عَلَى خَوَاتِيمِكُمْ عَرَبِيًّا";
nasai.urdu = "حضرت انس بن مالک ﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: مشرکین کی آگ سے روشنی حاصل نہ کرو۔اور اپنی انگوٹھیوں پر عربی عبارت نقش نہ کرواؤ۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أزہر بن راشد: مجہول (تقریب: 304) وضعفہ ابن حبان وغیرہ۔`;
nasai.anwaar = [363,1];