var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِي بُرْدَةَ قَالَ قَالَ عَلِيٌّ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَلِيٌّ سَلْ اللَّهَ الْهُدَى وَالسَّدَادَ وَنَهَانِي أَنْ أَجْعَلَ الْخَاتَمَ فِي هَذِهِ وَهَذِهِ وَأَشَارَ يَعْنِي بِالسَّبَّابَةِ وَالْوُسْطَى";
nasai.urdu = "حضرت علی ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے مجھے فرمایا: ’’علی! اللہ تعالیٰ سے ہدایت اور میانہ روی مانگا کر۔‘‘ نیز آپ نے مجھے اس اور اس ‘ یعنی شہادت اور درمیانی انگلی میں انگوٹھی ڈالنے سے منع فرمایا۔";
nasai.hukam = "صحیح";
nasai.description = ``;