var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِي بُرْدَةَ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَاتَمِ فِي هَذِهِ وَهَذِهِ يَعْنِي السَّبَّابَةَ وَالْوُسْطَى وَاللَّفْظُ لِابْنِ الْمُثَنَّى";
nasai.urdu = "حضرت علی ﷜ نے فرمایا: رسول اللہ ﷺ نے مجھے اس اور اس یعنی انگشت شہادت اور درمیانی انگلی میں انگوٹھی ڈالنے سے منع فرمایا ہے۔یہ (استاد محمد) ابن المثنی کے لفظ ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;