var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ سَعِيدِ بْنِ عَامِرٍ عَنْ هَمَّامٍ عَنْ ابْنِ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلَاءَ نَزَعَ خَاتَمَهُ";
nasai.urdu = "حضرت انس ﷜ سے روایت ہے کہ رسول اللہ ﷺ جب بیت الخلاء میں ہوتے تو انگوٹھی اتار دیتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (29) ترمذی (1746) ابن ماجہ (303)`;
nasai.anwaar = [363,1];