var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا مِنْ ذَهَبٍ وَجَعَلَ فَصَّهُ مِمَّا يَلِي كَفَّهُ فَاتَّخَذَ النَّاسُ خَوَاتِيمَ فَطَرَحَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ لَا أَلْبَسُهُ أَبَدًا";
nasai.urdu = "حضرت ابن عمر ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے سونے کی انگوٹھی بنوائی اور اس کا نگینہ ہتھیلی کی طرف رکھا۔لوگوں نے بھی انگوٹھیاں بنوالیں۔پھر نبی اکرم ﷺ نے وہ انگوٹھی اتار پھینکی اور فرمایا: ’’میں اسے کبھی نہیں پہنوں گا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;