var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ الطُّرْسُوسِيُّ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ عَنْ أَبِي بَكْرِ بْنِ مُوسَى قَالَ كُنْتُ مَعَ سَالِمِ بْنِ عَبْدِ اللَّهِ فَحَدَّثَ سَالِمٌ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جُلْجُلٌ";
nasai.urdu = "حضرت سالم نے اپنے والد محترم سے نقل کیا کہ نبی اکرم ﷺ نے فرمایا: ’’فرشتے اس قافلے کے ساتھ نہیں جاتے جس میں گھنٹی ہو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;