var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدِ بْنِ مُسْلِمٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ بَابَيْهِ مَوْلَى آلِ نَوْفَلٍ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ جُلْجُلٌ وَلَا جَرَسٌ وَلَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جَرَسٌ";
nasai.urdu = "نبی اکرم ﷺ کی زوجہ محترمہ حضرت ام سلمہ ؓ نے فرمایا: میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا: ’’فرشتے اس گھر میں داخل نہیں ہوتے جس میں گھنگرو یا گھنٹی ہو۔اورفرشتے اس قافلے کے ساتھ نہیں جاتے جس میں گھنٹی ہو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;