var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِيهِ قَالَ كُنْتُ جَالِسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَآنِي رَثَّ الثِّيَابِ فَقَالَ أَلَكَ مَالٌ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ مِنْ كُلِّ الْمَالِ قَالَ فَإِذَا آتَاكَ اللَّهُ مَالًا فَلْيُرَ أَثَرُهُ عَلَيْكَ";
nasai.urdu = "حضرت ابو الاحوص اپنے والد سے بیان کرتے ہیں کہ میں رسو ل اللہ ﷺ کے پاس بیٹھا ہوا تھا آپ نے میرے بوسیدہ سے کپڑے دیکھے تو فرمایا: ’’کیاتیرے پاس مال ہے؟‘‘ مین نے کہا: جی،اے اللہ کے رسول! ہر قسم کامال ہے۔آپ نے فرمایا: ’’جب اللہ تعالیٰ نے تجھے مال دیا ہے تو تجھ پر اس کے اثرات نظرآنے چاہئیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;