var nasai = {};
nasai.arabic = "أَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ وَهُوَ ابْنُ سُلَيْمَانَ قَالَ سَمِعْتُ مَعْمَرًا عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الْفِطْرَةِ قَصُّ الشَّارِبِ وَنَتْفُ الْإِبْطِ وَتَقْلِيمُ الْأَظْفَارِ وَالِاسْتِحْدَادُ وَالْخِتَانُ";
nasai.urdu = "حضرت ابوہریرہ ﷜ سے روایت ہے کہ مجھے رسول اللہ ﷺ نے فرمایا: ’’پانچ چیزیں فطرت سے ہیں۔مونچھیں تراشنا،بغلوں کے بال کھیڑنا،ناخن تراشنا،زیر ناف بال مونڈنا اور ختنہ کروانا‘‘۔";
nasai.hukam = "حسن";
nasai.description = ``;