var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ عَنْ أُمَيَّةَ بْنِ خَالِدٍ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجِلًا مَرْبُوعًا عَرِيضَ مَا بَيْنَ الْمَنْكِبَيْنِ كَثَّ اللِّحْيَةِ تَعْلُوهُ حُمْرَةٌ جُمَّتُهُ إِلَى شَحْمَتَيْ أُذُنَيْهِ لَقَدْ رَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ مَا رَأَيْتُ أَحْسَنَ مِنْهُ";
nasai.urdu = "حضرت براء ﷜ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ درمیانے قد کے آدمی تھے۔کندھوں کا درمیانی فاصلہ زیادہ تھا۔ڈاڑھی گھنی تھی۔آپ کے سفید رنگ میں سرخی جھلکتی تھی۔آپ کے سر کےلمبے لمبے بال کانوں کی کونپلوں تک پہنچتےتھے۔میں نے آپ کو سرخ جوڑے میں دیکھا۔اللہ کی قسم! میں نے آپ سے بڑھ کرخوب صورت نہیں دیکھا";
nasai.hukam = "متفق علیہ";
nasai.description = ``;