var nasai = {};
nasai.arabic = "أَخْبَرَنَا حَاجِبُ بْنُ سُلَيْمَانَ عَنْ وَكِيعٍ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ مَا رَأَيْتُ مِنْ ذِي لِمَّةٍ أَحْسَنَ فِي حُلَّةٍ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَهُ شَعْرٌ يَضْرِبُ مَنْكِبَيْهِ";
nasai.urdu = "حضرت براء ﷜ نے فرمایا: میں نے کوئی لمبے لمبے بالوں والا سرخ حلہ پہنے ہوئے رسول اللہ ﷺ کی طرح خوبصورت نہیں دیکھا۔آپ کے بال کندھوں سے ٹکراتے تھے۔(آپ کی زلفیں کندھوں پر لہراتی تھیں)";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;