var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ أَنْبَأَنَا عِيسَى عَنْ الْأَوْزَاعِيِّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَ أَتَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى رَجُلًا ثَائِرَ الرَّأْسِ فَقَالَ أَمَا يَجِدُ هَذَا مَا يُسَكِّنُ بِهِ شَعْرَهُ";
nasai.urdu = "حضرت جابر بن عبد اللہ ﷜ نے فرمایا کہ نبی اکرم ﷺ ہمارے پاس تشریف لائے۔آپ نے ایک آدمی کو دیکھا جس کے سر کےبال بکھرے ہوئے تھے۔آپ نے (ناپسند کرتے ہوئے) فرمایا: ’’کیا اسے کوئی ایسی چیز نہیں ملتی جس سے اپنے بالوں کو سنوار سکے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;