var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيِّ بْنِ مُقَدَّمٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أَبِي قَتَادَةَ قَالَ كَانَتْ لَهُ جُمَّةٌ ضَخْمَةٌ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ أَنْ يُحْسِنَ إِلَيْهَا وَأَنْ يَتَرَجَّلَ كُلَّ يَوْمٍ";
nasai.urdu = "حضرت ابو قتادہ ﷜ نے فرمایا کہ ان کے لمبے لمبے بال تھے۔انہوں نے نبی اکرم ﷺ سے اس بارے میں پوچھا تو آپ نے انہیں حکم دیا کہ ان (بالوں) سے اچھا سلوک کرو اور ہر روز کنگھی کیا کرو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>محمد بن المنکدر لم یسمع من أبي قتادۃ رضي اللہ عنہ،انظر جامع التحصیل في أحکام المراسیل للحافظ خلیل بن کیکلدي العلائي (ص 270)`;
nasai.anwaar = [363,1];