var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنُ بُرَيْدَةَ أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ عُبَيْدٌ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَى عَنْ كَثِيرٍ مِنْ الْإِرْفَاهِ سُئِلَ ابْنُ بُرَيْدَةَ عَنْ الْإِرْفَاهِ قَالَ مِنْهُ التَّرَجُّلُ";
nasai.urdu = "حضرت عبد اللہ بن بریدہ سے روایت ہے کہ اصحاب نب ﷺ میں سے ایک صحابی جن کو عبیدہ کہا جاتا تھا کہ رسول اللہ ﷺ نے زیادہ نازنخرے سے منع فرمایا ہے۔حضرت بریدہ سے پوچھا گیا: ناز نخرے سے کیا مراد ہے؟ انہوں نے فرمایا: اسی میں سے (ہرروز) کنگھی کرنا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;