var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي الْأَشْعَثُ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ وَذَكَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُحِبُّ التَّيَامُنَ مَا اسْتَطَاعَ فِي طُهُورِهِ وَتَنَعُّلِهِ وَتَرَجُّلِهِ";
nasai.urdu = "حضرت عائشہ ﷜ فرماتی ہیں کہ رسول اللہ ﷺ ہر ممکن تک دائیں طرف سے ابتداء فرماتے تھے۔وضو میں،جوتا پہنتے وقت اور کنگھی فرماتے وقت۔";
nasai.hukam = "حسن";
nasai.description = ``;