var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ وَسُلَيْمَانَ بْنِ يَسَارٍ أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ يُخْبِرُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْيَهُودَ وَالنَّصَارَى لَا يَصْبُغُونَ فَخَالِفُوهُمْ";
nasai.urdu = "حضرت ابو ہریرہ ﷜ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا:’’یہودی اور عیسائی اپنے بالوں کو نہیں رنگتے۔تم ان کی مخالفت کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;