var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ قَالَ حَدَّثَنَا عَزْرَةُ وَهُوَ ابْنُ ثَابِتٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَبِي قُحَافَةَ وَرَأْسُهُ وَلِحْيَتُهُ كَأَنَّهُ ثَغَامَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا أَوْ اخْضِبُوا";
nasai.urdu = "حضرت جابر ﷜ نے فرمایا: نبی اکرمﷺ کے پاس حضرت ابو قحافہ ﷜ کولایا گیا۔ان کا سر اور ڈاڑھی ثغامہ کی طرح تھے۔نبی اکرمﷺ نے فرمایا: ’’ان کا رنگ بدلو) یا فرمایا) ان کو خضاب کرو۔";
nasai.hukam = "صحیح";
nasai.description = ``;