var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ حَدَّثَنَا أَبُو قُتَيْبَةَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عُبَيْدٍ قَالَ رَأَيْتُ ابْنَ عُمَرَ يُصَفِّرُ لِحْيَتَهُ فَقُلْتُ لَهُ فِي ذَلِكَ فَقَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَفِّرُ لِحْيَتَهُ";
nasai.urdu = "حضرت عبید بیان کرتے ہیں کہ میں نے حضرت ابن عمر ﷜ کودیکھا،وہ ڈاڑھی کو زرد کرتے تھے۔میں نے ان سے اس کے متعلق بات کی توانہوں نے فرمایا:میں نے نبی اکرم ﷺ کو دیکھا آپ اپنی ڈاڑھی مبارک کو زرد کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;