var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا عَمْرُو بْنُ مُحَمَّدٍ قَالَ أَنْبَأَنَا ابْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَيُصَفِّرُ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ";
nasai.urdu = "حضرت ابن عمر ﷜ نے فرمایا: نبی اکرم ﷺ سبتی جوتے پہنا کرتے تھے اور اپنی ڈاڑھی کوورس اور زعفران سے رنگتے تھے۔اور حضرت ابن عمر ﷜ بھی اسی طرح کیا کرتے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;