var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ قَدِمَ مُعَاوِيَةُ الْمَدِينَةَ فَخَطَبَنَا وَأَخَذَ كُبَّةً مِنْ شَعْرٍ قَالَ مَا كُنْتُ أَرَى أَحَدًا يَفْعَلُهُ إِلَّا الْيَهُودَ وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلَغَهُ فَسَمَّاهُ الزُّورَ";
nasai.urdu = "حضرت سعید بن مسیب سےر وایت ہے،انہوں نے فرمایا: حضرت معاویہ ﷜ مدینہ آئے تو ہم سے خطاب فرمایا۔انہوں نے بالوں کا ایک گچھا پکڑا اور فرمایا: میں نہیں سمجھتا کہ یہودیوں کے علاوہ اور کوئی شخص یہ کام کرتا ہو گا۔رسول اللہ ﷺ کے سامنے اس کا تذکرہ ہوا تو آپ نے اسے ’’زور‘‘ (جعل سازی) قرار دیا۔";
nasai.hukam = "حسن";
nasai.description = ``;