var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ مُعَاوِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الزُّورِ وَالزُّورُ الْمَرْأَةُ تَلُفُّ عَلَى رَأْسِهَا";
nasai.urdu = "حضرت معاویہ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے جعل سازی سے منع فرمایا۔اور جعل سازی یہ ہے کہ عورت اپنےسرپر (جعلی بال وغیرہ) لپیٹ لے۔";
nasai.hukam = "حسن";
nasai.description = ``;