var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ لَعَنَ اللَّهُ الْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ أَلَا أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عبد اللہ بن مسعود ﷜ نے فرمایا: اللہ تعالیٰ نے بال اکھیڑنے والی اور دانت کھلے کرنے والی عورتوں پرلعنت فرمائی ہے۔میں اس پر کیوں لعنت نہ کروں جس پر رسول ا للہ ﷺ نے لعنت فرمائی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;