var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ الْأَعْمَشَ يُحَدِّثُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَاشِمَاتِ وَالْمُتَفَلِّجَاتِ وَالْمُتَنَمِّصَاتِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت عبد اللہ بن مسعود ﷜ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے رنگ بھرنے والی،دانت کھلے کرنے والی اور بال اکھیڑنے والی عورتوں پر لعنت فرمائی ہے جو اللہ عزوجل کی پیدا کردہ شکل وصورت کو بدلتی ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;