var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ كَانَ عَبْدُ اللَّهِ يَقُولُ لَعَنَ اللَّهُ الْمُتَوَشِّمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ أَلَا أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عبد اللہ بن مسعود ﷜ نے فرمایاکرتے تھے:اللہ تعالیٰ نے رنگ بھروانے والی اور بہ تکلف بال اکھیڑنے والی،دانت کھلے کرنےوالی عورتوں پر لعنت فرمائی ہے۔میں اس پر کیوں نہ لعنت کروں جس پر رسول اللہ نے لعنت فرمائی ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;