var nasai = {};
nasai.arabic = "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا سَعِيدٌ قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي جَعْفَرٍ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ عُرِضَ عَلَيْهِ طِيبٌ فَلَا يَرُدَّهُ فَإِنَّهُ خَفِيفُ الْمَحْمَلِ طَيِّبُ الرَّائِحَةِ";
nasai.urdu = "حضرت ابو ہریرہ ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کسی کو خوشبو پیش کی جائے تو وہ اسے رد نہ کرے اس لیے کہ یہ اٹھانے میں ہلکی اورمہک میں پاکیزہ ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;