var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ ابْنِ عَجْلَانَ عَنْ بُكَيْرٍ ح وَأَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ قَالَ حَدَّثَنِي بُكَيْرُ بْنُ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَهِدَتْ إِحْدَاكُنَّ الْعِشَاءَ فَلَا تَمَسَّ طِيبًا";
nasai.urdu = "حضرت عبد اللہ بن مسعود ﷜ کی زوجہ محترمہ حضرت زینتؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی عورت عشاء کی نماز پڑھنے مسجد کو جائے تو کسی قسم کی خوشبو نہ لگائے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;