var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ هِشَامٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ أَخْبَرَتْنِي زَيْنَبُ الثَّقَفِيَّةُ امْرَأَةُ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا إِذَا خَرَجْتِ إِلَى الْعِشَاءِ فَلَا تَمَسِّ طِيبًا";
nasai.urdu = "حضرت عبد اللہ بن مسعود﷜ کی بیوی حضرت زینب ثقفیہ ؓ نے بتایا کہ رسول اللہ ﷺ نے مجھے فرمایا: ’’جب تو عشاء کی نماز پڑھنے مسجد میں جائے تو خوشبو وغیرہ نہ لگایا کر۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;