var nasai = {};
nasai.arabic = "و حَدَّثَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ أَبِي جَعْفَرٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْنَبَ الثَّقَفِيَّةِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيَّتُكُنَّ خَرَجَتْ إِلَى الْمَسْجِدِ فَلَا تَقْرَبَنَّ طِيبًا";
nasai.urdu = "حضرت زینب ثقفیہ ؓ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا: ’’تم میں سے عورت بھی مسجد کو جائے وہ خوشبو کے قریب بھی نہ جائے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;