var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ غَزْوَانَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ خُلَيْدِ بْنِ جَعْفَرٍ وَالْمُسْتَمِرُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ ذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً حَشَتْ خَاتَمَهَا بِالْمِسْكِ فَقَالَ وَهُوَ أَطْيَبُ الطِّيبِ";
nasai.urdu = "حضرت ابو سعید خدری ﷜بیان کرتے ہیں کہ نبی اکرم ﷺ نے ایک عورت کا ذکر فرمایا جس نے اپنی انگوٹھی کوکستوری سے بھر رکھا تھا۔پھرآپ نے فرمایا: ’’یہ سب سے اچھی اور پاکیزہ خوشبو ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;