var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى وَيَزِيدُ وَمُعْتَمِرٌ وَبِشْرُ بْنُ الْمُفَضَّلِ قَالُوا حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِي مُوسَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَحَلَّ لِإِنَاثِ أُمَّتِي الْحَرِيرَ وَالذَّهَبَ وَحَرَّمَهُ عَلَى ذُكُورِهَا";
nasai.urdu = "حضرت ابو موسیٰ ﷜ سےروایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’اللہ عزوجل نے ریشم اور سونا میری امت کی عورتون کے لیے حلال قرار فرمایا ہے اور مردوں کے لیے حرام ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;