var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ عَلِيٍّ قَالَ نَهَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَأَنْ أَقْرَأَ الْقُرْآنَ وَأَنَا رَاكِعٌ وَعَنْ الْقَسِّيِّ وَعَنْ الْمُعَصْفَرِ";
nasai.urdu = "حضرت علی ﷜ نے فرمایا: مجھے نبی اکرم ﷺ نے سونے کی انگوٹھی پہننے رکوع کی حالت میں قرآن پڑھنے قسی اورمعصفر کپڑے پہننے سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;