var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ عَنْ اللَّيْثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ عَلِيًّا يَقُولُ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ لُبُوسِ الْقَسِّيِّ وَالْمُعَصْفَرِ وَقِرَاءَةِ الْقُرْآنِ وَأَنَا رَاكِعٌ";
nasai.urdu = "حضرت علی﷜ نے فرمایا: رسول اللہ ﷺ نے مجھے سونے کی انگوٹھی قسی اور معصفر کے لباس پہننے اور رکوع کی حالت میں قرآن مجید پڑھنے سے روکا ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;