var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ حَدَّثَهُ عَنْ ابْنِ حُنَيْنٍ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَرْبَعٍ عَنْ لُبْسِ ثَوْبٍ مُعَصْفَرٍ وَعَنْ التَّخَتُّمِ بِخَاتَمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيَّةِ وَأَنْ أَقْرَأَ الْقُرْآنَ وَأَنَا رَاكِعٌ";
nasai.urdu = "حضرت علی ﷜ نے فرمایا: رسول اللہﷺ نے مجھے چار چیزوں سے منع فرمایا ہے: معصفر کپڑا پہننے سونے کی انگوٹھی پہننے قس بستی کے بنے ہوئے کپڑے پہنے اور رکوع کی حالت میں قرآن پڑھنے سے۔";
nasai.hukam = "حسن";
nasai.description = ``;