var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ الْحَجَّاجِ وَهُوَ ابْنُ الْحَجَّاجِ عَنْ قَتَادَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُبَيْدٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تَخَتُّمِ الذَّهَبِ";
nasai.urdu = "حضرت ابوہرہ سے روایت ہے کہ رسول اللہ ﷺ نے سونے کی انگوٹھی پہننے سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;