var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ أَنْبَأَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا مِنْ وَرِقٍ وَفَصُّهُ حَبَشِيٌّ وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ";
nasai.urdu = "۔حضرت انس ﷜ فرماتے ہیں کہ نبی اکرم ﷺ نے چاندی کی انگوٹھی بنوائی۔اس کا نگینہ حبشی انداز کا تھا اور اس پرب ’’محمد رسول اللہ‘‘ نقش کیا گیا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;