var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ بِشْرٍ وَهُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ أَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكْتُبَ إِلَى الرُّومِ فَقَالُوا إِنَّهُمْ لَا يَقْرَءُونَ كِتَابًا إِلَّا مَخْتُومًا فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ وَنُقِشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ";
nasai.urdu = "حضرت انس ﷜ نے فرمایا: رسول اللہ ﷺ نے رومیوں کے خط لکھنے کا ارادہ فرمایا۔لوگوں نے کہا: حضور! وہ لوگ مہر کے بغیر خط نہیں پڑھتے۔آپ نے چاندی کی مہر بنوالی۔مجھے یوں محسوس ہو رہا ہے کہ میں اب بھی اس کی چمک آپ کے دست مبارک میں دیکھ رہا ہوں۔اور آپ نے اس میں ’’محمدرسول اللہ‘‘ کے الفاظ کندہ کروائے۔";
nasai.hukam = "حسن";
nasai.description = ``;