var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا إِسْمَعِيلُ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ اصْطَنَعْنَا خَاتَمًا وَنَقَشْنَا عَلَيْهِ نَقْشًا فَلَا يَنْقُشْ عَلَيْهِ أَحَدٌ";
nasai.urdu = "حضرت انس ﷜سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ہم نےایک انگوٹھی بنوائی ہے اوراس پر ایک خاص نقش (محمد رسول اللہ) کندہ کروایا ہے لہذا کوئی شخص اس جیسا نقش نہ بنوائے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;