var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اصْطَنَعَ خَاتَمًا فَقَالَ إِنَّا قَدْ اتَّخَذْنَا خَاتَمًا وَنَقَشْنَا عَلَيْهِ نَقْشًا فَلَا يَنْقُشْ عَلَيْهِ أَحَدٌ وَإِنِّي لَأَرَى بَرِيقَهُ فِي خِنْصَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت انس ﷜ بیان کرتے ہیں کہ نبی اکرم ﷺ نے ا یک انگوٹھی بنوائی اور فرمایا: ’’ہم نے ایک انگوٹھی بنوائی ہے او رہم نے اس پر ایک عبارت کندہ کروائی ہے۔کوئی شخص اس کے مطابق عبارت کندہ نہ کروائے۔‘‘ اللہ کی قسم! میں (عالم تصورمیں اب بھی) اس انگوٹھی کی چمک رسول اللہ ﷺ کی چھنگلی میں دیکھ رہا ہوں۔";
nasai.hukam = "حسن";
nasai.description = ``;