var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ نَافِعٍ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا حَمَّادٌ قَالَ حَدَّثَنَا ثَابِتٌ أَنَّهُمْ سَأَلُوا أَنَسًا عَنْ خَاتَمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ مِنْ فِضَّةٍ وَرَفَعَ إِصْبَعَهُ الْيُسْرَى الْخِنْصَرَ";
nasai.urdu = "حضرت ثابت بیان کرتے ہیں کہ لوگوں نے حضرت انس ﷜ سے رسول اللہ ﷺ کی انگوٹھی کے بارے میں پوچھا تو انہوں نے فرمایا:مجھے یوں محسوس ہو رہا ہے میں آپ کی چاندی والی انگوٹھی کی چمک اب بھی دیکھ رہا ہوں۔(یہ کہتے ہوئے) انہوں نے اپنے بائیں ہاتھ کی چھوٹی انگلی کو اٹھایا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;