var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِي بُرْدَةَ قَالَ سَمِعْتُ عَلِيًّا يَقُولُ نَهَانِي نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَاتَمِ فِي السَّبَّابَةِ وَالْوُسْطَى";
nasai.urdu = "حضرت ابو ہریرہ﷜ سے روایت ہے کہ میں نے حضرت علی﷜ کو فرماتے سنا کہ نبی ﷺ نے مجھے انگشت شہادت اور درمیانی انگلی میں انگوٹھی ڈالنے سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;