var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ رَقَبَةَ عَنْ جَعْفَرِ بْنِ إِيَاسٍ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ أَنَا أَعْلَمُ النَّاسِ بِمِيقَاتِ هَذِهِ الصَّلَاةِ عِشَاءِ الْآخِرَةِ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهَا لِسُقُوطِ الْقَمَرِ لِثَالِثَةٍ";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہما سے منقول ہے،انھوں نے فرمایا: میں سب لوگوں سے زیادہ اس نماز،یعنی عشاء کے وقت کو جانتا ہوں۔رسول اللہ ﷺ یہ نماز تیسری رات کا چاند غروب ہونے پر پڑھتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;