var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا فَلَبِسَهُ قَالَ شَغَلَنِي هَذَا عَنْكُمْ مُنْذُ الْيَوْمَ إِلَيْهِ نَظْرَةٌ وَإِلَيْكُمْ نَظْرَةٌ ثُمَّ أَلْقَاهُ";
nasai.urdu = "حضرت ابن عباس﷜ سے روایت ہے کہ رسول اللہ ﷺ نے ا نگوٹھی بنوائی اور پہنی پھرفرمایا: ’’اس انگوٹھی نے مجھے تم سے مصروف کیے رکھا۔میں کبھی اس کو دیکھتا تھا کبھی تم کو۔‘‘ پھر آپ نے اسے اتار پھینکا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;