var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ قِرَاءَةً عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسٍ أَنَّهُ رَأَى فِي يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ وَرِقٍ يَوْمًا وَاحِدًا فَصَنَعُوهُ فَلَبِسُوهُ فَطَرَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَطَرَحَ النَّاسُ";
nasai.urdu = "حضرت انس ﷜ نے فرمایا: میں نے رسول اللہ ﷺ کے دست مبارک میں ایک چاندی کی انگوٹھی دیکھی۔لوگوں نے بھی انگوٹھیاں بنوالیں اور پہن لیں۔پھر نبی اکرم ﷺ نے اپنی انگوٹھی اتار پھینکی اور لوگوں نے بھی اتار پھینکیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;