var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَ رَأَيْتُ عَلَى زَيْنَبَ بِنْتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَمِيصَ حَرِيرٍ سِيَرَاءَ";
nasai.urdu = "حضرت انس ﷜ بیان کرتے ہیں کہ میں نے نبی اکرم ﷺ کی بیٹی حضرت زینب کو دھاری دار ریشمی قمیص پہنے ہوئے دیکھا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (3598)<br>الزہري عنعن۔<br>والمحفوظ ’’أم کلثوم‘‘ بدل زینب۔`;
nasai.anwaar = [363,1];