var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ بَشِيرِ بْنِ ثَابِتٍ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ وَاللَّهِ إِنِّي لَأَعْلَمُ النَّاسِ بِوَقْتِ هَذِهِ الصَّلَاةِ صَلَاةِ الْعِشَاءِ الْآخِرَةِ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهَا لِسُقُوطِ الْقَمَرِ لِثَالِثَةٍ";
nasai.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہ بیان کرتے ہیں کہ اللہ کی قسم! بلاشبہ میں اس نماز،یعنی عشاء آخرہ کے وقت کو سب لوگوں سے زیادہ جانتا ہوں۔اللہ کے رسول ﷺ یہ نماز تیسری رات کا چاند غروب ہونے پر پڑھتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;