var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ وَهُوَ عَلَى الْمِنْبَرِ يَخْطُبُ وَيَقُولُ قَالَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا فَلَنْ يَلْبَسَهُ فِي الْآخِرَةِ";
nasai.urdu = "حضرت ثابت نے فرمایا: میں نے حضر ت عبد اللہ بن زبیر ﷜ کو منبر پر دوران خطبہ فرماتے سنا کہ حضرت محمد مصطفےٰ ﷺ نے فرمایا:’’جس آدمی نے نے دنیا میں ریشم پہنا وہ آخرت مں ہرگز نہیں پہن سکے گا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;