var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ وَبِشْرِ بْنِ الْمُحْتَفِزِ عَنْ ابْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا يَلْبَسُ الْحَرِيرَ مَنْ لَا خَلَاقَ لَهُ";
nasai.urdu = "حضرت ابن عمر ﷜ سے روایت ہے کہ رسول اللہ ﷺ نےفرمایا: ’’ریشم تو وہ لوگ پہنتے یہں جن کا آخرت میں کوئی حصہ نہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;