var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ نَهَانَا عَنْ خَوَاتِيمِ الذَّهَبِ وَعَنْ آنِيَةِ الْفِضَّةِ وَعَنْ الْمَيَاثِرِ وَالْقَسِّيَّةِ وَالْإِسْتَبْرَقِ وَالدِّيبَاجِ وَالْحَرِيرِ";
nasai.urdu = "حضرت براء بن عازب ﷜ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں سات کاموں کا حکم دیا اور سات سے منع فرمایا۔آپ نے ہمیں سونے کی انگوٹھیوں،چاندی کے برتنوں،ریشمی گدیلوں،قسی کپڑوں،موٹے،باریک اور عام ریشم پہننے سےمنع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;