var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْخَصَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ بْنِ الْعَوَّامِ فِي قُمُصِ حَرِيرٍ مِنْ حِكَّةٍ كَانَتْ بِهِمَا";
nasai.urdu = "حضرت انس ﷜ سے روایت ہے کہ رسول اللہﷺ نے حضرت عبد الرحمن بن عوف اور حضرت زبیر بن عوام ﷜ کو خارش کی بنا پر ریشم کی قمیص پہننے کی اجازت دے دی تھی";
nasai.hukam = "متفق علیہ";
nasai.description = ``;