var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ حُلَّةٌ حَمْرَاءُ مُتَرَجِّلًا لَمْ أَرَ قَبْلَهُ وَلَا بَعْدَهُ أَحَدًا هُوَ أَجْمَلُ مِنْهُ";
nasai.urdu = "حضرت براء ﷜ بیان کرتے ہیں کہ میں نے نبی اکرم ﷺ کو سرخ حلہ پہننے ہوئے دیکھا۔آپ نے بالوں کو کنگھی کر رکھی تھی۔میں نے کوئی شخص آپ سے بڑھ کر خوب صورت نہیں دیکھا نہ آپ سے پہلے نہ آپ کے بعد۔";
nasai.hukam = "حسن";
nasai.description = ``;