var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ أَنَّ خَالِدَ بْنَ مَعْدَانَ أَخْبَرَهُ أَنَّ جُبَيْرَ بْنَ نُفَيْرٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو أَنَّهُ رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ ثَوْبَانِ مُعَصْفَرَانِ فَقَالَ هَذِهِ ثِيَابُ الْكُفَّارِ فَلَا تَلْبَسْهَا";
nasai.urdu = "حضرت عبد اللہ بن عمرو﷜ نے بتایا کہ رسول اللہﷺ نے انہیں معصفرکپڑے پہنے ہوئے دیکھا تو فرمایا: ’’یہ تو کافروں کالباس ہے۔تو نہ پہن۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;