var nasai = {};
nasai.arabic = "أَخْبَرَنِي حَاجِبُ بْنُ سُلَيْمَانَ عَنْ ابْنِ أَبِي رَوَّادٍ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ ثَوْبَانِ مُعَصْفَرَانِ فَغَضِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ اذْهَبْ فَاطْرَحْهُمَا عَنْكَ قَالَ أَيْنَ يَا رَسُولَ اللَّهِ قَالَ فِي النَّارِ";
nasai.urdu = "حضرت عبد اللہ بن عمر﷜ سے روایت ہے کہ وہ نبی اکرم ﷺ کی خدمت میں حاضر ہوئے جبکہ انہوں نےمعصفر کپڑے پہن رکھتے تھے۔نبی اکرمﷺ (دیکھ کر) ناراض ہوئے اور فرمایا:’’جا ان کو اتار پھینک۔‘‘ انہوں نے عرض کی: کہاں پھینکوں؟ فرمایا: آگ میں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;