var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَنَّ إِبْرَاهِيمَ بْنَ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ أَخْبَرَهُ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ عَلِيًّا يَقُولُ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ لُبُوسِ الْقَسِّيِّ وَالْمُعَصْفَرِ وَقِرَاءَةِ الْقُرْآنِ وَأَنَا رَاكِعٌ";
nasai.urdu = "حضرت علی ﷜ فرمایا کرتے تھے کہ رسول اللہﷺ نے مجھے سونے کی انگوٹھی قسی ارو معصفر کپڑے پہننے اور دوران رکوع (اورسجود) قرآن مجید پڑھنے سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;