var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ قَالَ أَنْبَأَنَا أَبُو نُوحٍ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ";
nasai.urdu = "حضرت ابو رمثہ ﷜ نے فرمایا: رسول اللہﷺ (ایک دفعہ گھر سے) باہر تشریف لائے جبکہ آپ نے دو سبز چادریں پہن رکھی تھیں۔";
nasai.hukam = "حسن";
nasai.description = ``;