var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى عَنْ إِسْمَعِيلَ قَالَ حَدَّثَنَا قَيْسٌ عَنْ خَبَّابِ بْنِ الْأَرَتِّ قَالَ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُتَوَسِّدٌ بُرْدَةً لَهُ فِي ظِلِّ الْكَعْبَةِ فَقُلْنَا أَلَا تَسْتَنْصِرُ لَنَا أَلَا تَدْعُو اللَّهَ لَنَا";
nasai.urdu = "حضرت خباب بن ارث﷜ نے فرمایا: ہم نے رسول اللہ سے (کفارکی طرف سے پہنچنےوالی تکالیف کی) شکایت کی۔آپ نے اس وقت کعبے کے سائے میں ایک سیاہ دھاری دار چادر کو تکیہ بنا کر لیٹے ہوئے تھے۔ہم نے کہا: آپ ہمارے لیے اللہ تعالیٰ سے مدد و نصرت طلب نہیں فرماتے؟ ہمارے لیے اللہ تعالیٰ سے دعا نہیں فرماتے";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;