var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ أَبِي عَرُوبَةَ يُحَدِّثُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَسُوا مِنْ ثِيَابِكُمْ الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ قَالَ يَحْيَى لَمْ أَكْتُبْهُ قُلْتُ لِمَ قَالَ اسْتَغْنَيْتُ بِحَدِيثِ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ سَمُرَةَ";
nasai.urdu = "حضرت سمرہ ﷜ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: ’’سفید کپڑے پہنا کرو۔وہ زیادہ پاکیزہ او رصاف ستھرے رہتے ہیں اور فوت شدگان کو بھی انہی میں کفناؤ۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `سندہ ضعیف<br>ترمذی (2810) ابن ماجہ (3567)<br>سعید بن أبي عروبۃ مدلس وعنعن۔`;
nasai.anwaar = [363,1];