var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكُمْ بِالْبَيَاضِ مِنْ الثِّيَابِ فَلْيَلْبَسْهَا أَحْيَاؤُكُمْ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ فَإِنَّهَا مِنْ خَيْرِ ثِيَابِكُمْ";
nasai.urdu = "حضرت سمرہ ﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’سفید کپڑے پہنا کرو۔زندہ لوگ بھی اسے پہنیں اور فوت شدگان کو بھی انہی میں کفن دو۔یہ بہترین کپڑے ہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;