var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِعَرَفَاتٍ فَقَالَ مَنْ لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ السَّرَاوِيلَ وَمَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ";
nasai.urdu = "حضرت ابن عباس ﷜ سے روایت ہے کہ میں نے نبی اکرم ﷺ کوعرفات میں فرماتےسنا: ’’جوشخص (احرام کی حالت میں) تہبند نہ پائے وہ شلوار پہن سکتا ہے اور جوشخص جوتے نہ پائے وہ موزے پہن سکتا ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;