var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ ح وَأَنْبَأَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرٌ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَرَّ ثَوْبَهُ أَوْ قَالَ إِنَّ الَّذِي يَجُرُّ ثَوْبَهُ مِنْ الْخُيَلَاءِ لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ";
nasai.urdu = "حضرت عبد اللہ بن عمر ﷜سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جوشخص تکبر کے ساتھ اپنا کپڑا زمین پر گھسیٹتا ہے قیامت کے دن اللہ اسے (نظر رحمت سے) نہیں دیکھے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;