var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَارِبٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ جَرَّ ثَوْبَهُ مِنْ مَخِيلَةٍ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يَنْظُرْ إِلَيْهِ يَوْمَ الْقِيَامَةِ";
nasai.urdu = "حضرت ابن عمر ﷜ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’جوشخص تکبر کے ساتھ اپنا کپڑا زمین پر گھسیٹے گا اللہ عزوجل قیامت کے دن اس کو (نظر رحمت سے) نہیں دیکھے گا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;