var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ الْأَعْمَشِ عَنْ أَبِي إِسْحَقَ عَنْ مُسْلِمِ بْنِ نُذَيْرٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَوْضِعُ الْإِزَارِ إِلَى أَنْصَافِ السَّاقَيْنِ وَالْعَضَلَةِ فَإِنْ أَبَيْتَ فَأَسْفَلَ فَإِنْ أَبَيْتَ فَمِنْ وَرَاءِ السَّاقِ وَلَا حَقَّ لِلْكَعْبَيْنِ فِي الْإِزَارِ وَاللَّفْظُ لِمُحَمَّدٍ";
nasai.urdu = "حضرت خذیفہ﷜ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’تہبند کی جگہ نصف پنڈلی ہے۔جہاں موٹا پٹھہ ہوتا ہے۔اگر تو وہاں تک نہیں چاہتا تو کچھ نیچا کر لے اور اگر وہاں بھی نہیں رکھنا چاہتا تو پنڈلی سے نیچے کر لے۔لیکن تہبند کا ٹخنوں کا کوئی حق نہیں۔‘‘\nیہ الفاظ استاد محمد (ابن قدامہ) کے ہیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;