var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنِي أَبُو يَعْقُوبَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَحْتَ الْكَعْبَيْنِ مِنْ الْإِزَارِ فَفِي النَّارِ";
nasai.urdu = "حضرت ابو ہریرہ﷜ سے روایت ہے کہ رسول اللہ نے فرمایا: ’’ازار ٹخنوں سے نیچا ہو تو اتنی جگہ آگ میں جلے گی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;