var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي سَعِيدٌ الْمَقْبُرِيُّ وَقَدْ كَانَ يُخْبِرُ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَسْفَلَ مِنْ الْكَعْبَيْنِ مِنْ الْإِزَارِ فَفِي النَّارِ";
nasai.urdu = "حضرت ابو ہریرہ﷜ سے منقول ہے کہ نبی اکرمﷺ نے فرمایا: ’’تہبند ٹخنوں سے نیچا ہو تو وہ جگہ آگ میں جائے گی۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;