var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ قَالَ حَدَّثَنِي جَدِّي قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَشْعَثَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يَنْظُرُ إِلَى مُسْبِلِ الْإِزَارِ";
nasai.urdu = "حضرت ابن عباس ﷜ سے روایت ہے کہ نبی اکرک ﷺ نے فرمایا:’’اللہ تعالیٰ تہبند لٹکانے والے کی طرف (نظر رحمت) نہیں دیکھے گا۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;