var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِسْبَالُ فِي الْإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مَنْ جَرَّ مِنْهَا شَيْئًا خُيَلَاءَ لَا يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ";
nasai.urdu = "حضرت ابن عمر﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:’’اسبال(لٹکانا) تہبند،قمیص او رپگڑی سب میں ہوتا ہے۔جوشخص ان میں سے کسی بھی چیز کو تکبر کے ساتھ زمین پر گھسیٹے گا اللہ تعالیٰ قیامت کے دن اس کی طرف (نظر رحمت سے) نہیں دیکھے گا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;