var nasai = {};
nasai.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ قَالَ أَخْبَرَنِي أَبِي قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ نَافِعٍ عَنْ أُمِّ سَلَمَةَ أَنَّهَا ذَكَرَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذُيُولَ النِّسَاءِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرْخِينَ شِبْرًا قَالَتْ أُمُّ سَلَمَةَ إِذًا يَنْكَشِفَ عَنْهَا قَالَ تُرْخِي ذِرَاعًا لَا تَزِيدُ عَلَيْهِ";
nasai.urdu = "حضرت ام سلمہ ؓ سے روایت ہے کہ انہوں نے رسو ل اللہﷺ کے سامنے عوتوں کے دامن کا مسئلہ ذکر کیا تو رسول اللہﷺ نےفرمایا:’’وہ ایک بالشت لٹکالین۔‘‘ حضرت ام سلمہ ؓ نے کہا: پھر ان کے پاؤں ننگے ہو گے۔آپ نے فرمایا:’’پھر ایک ہاتھ لٹکا لیں۔اس سے زیادہ نہ لٹکائیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;