var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ بْنِ عَبْدِ الْجَبَّارِ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَيُّوبُ بْنُ مُوسَى عَنْ نَافِعٍ عَنْ صَفِيَّةَ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا ذُكِرَ فِي الْإِزَارِ مَا ذُكِرَ قَالَتْ أُمُّ سَلَمَةَ فَكَيْفَ بِالنِّسَاءِ قَالَ يُرْخِينَ شِبْرًا قَالَتْ إِذًا تَبْدُوَ أَقْدَامُهُنَّ قَالَ فَذِرَاعًا لَا يَزِدْنَ عَلَيْهِ";
nasai.urdu = "حضرت ام سلمہ ؓ سے روایت ہے کہ جب نبی اکرمﷺ نے ازار کے بارے میں مسئلہ ذکر فرمایا تو حضرت ام سلمہ ؓ نے کہا: عورتیں کیا کریں؟ آپ نے فرمایا:’’ایک بالشت نیچا رکھ لیں۔‘‘ وہ کہنے لگیں:پھر تو ان کے پاؤں ننگے ہوں گے۔آپ نے فرمایا:’’پھر ایک ہاتھ نیچا کرلیں۔اس سے زائد نہ کریں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;