var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا النَّضْرُ قَالَ حَدَّثَنَا الْمُعْتَمِرُ وَهُوَ ابْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمْ تَجُرُّ الْمَرْأَةُ مِنْ ذَيْلِهَا قَالَ شِبْرًا قَالَتْ إِذًا يَنْكَشِفَ عَنْهَا قَالَ ذِرَاعٌ لَا تَزِيدُ عَلَيْهَا";
nasai.urdu = "حضرت ام سلمہ ؓ نے فرمایا: رسو ل اللہﷺ سے پوچھا گیا عورت اپنا دامن کس قدر نیچا کر سکتی ہے؟ آپ نے فرمایا: ’’ایک بالشت۔انہون نے کہا پھر تو اس کے پاؤں ننگے ہوں گے۔آپ نے فرمایا: ’’ایک ہاتھ نیچا کر لے اس سے زائد نہ کرے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;