var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ اشْتِمَالِ الصَّمَّاءِ وَأَنْ يَحْتَبِيَ فِي ثَوْبٍ وَاحِدٍ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَيْءٌ";
nasai.urdu = "حضرت ابو سعید﷜ نے فرمایا: رسول اللہﷺ نے اشتمال صماء اور ایک کپڑے میں اس طرح گوٹھ مارنے سے منع فرمایا ہے کہ اس کی شرم گاہ پر کچھ نہ رہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;