var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ اشْتِمَالِ الصَّمَّاءِ وَأَنْ يَحْتَبِيَ الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَيْءٌ";
nasai.urdu = "حضرت ابو سعید خدری﷜ نے فرمایا کہ رسول اللہﷺ نے اس طرح اشتمال صماء اور ایک کپڑے میں گوٹھ مارنے سے منع فرمایا ہے کہ اس کی شرم گاہ پر کوئی پردہ نہ رہے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;