var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُسَاوِرٍ الْوَرَّاقِ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِ قَالَ كَأَنِّي أَنْظُرُ السَّاعَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَهَا بَيْنَ كَتِفَيْهِ";
nasai.urdu = "حضرت عمرو بن امیہ﷜ نے فرمایا: مجھے ایسے محسوس ہوتا ہے کہ میں اب بھی رسول اللہﷺ کو منبر پر رونق افروز دیکھ رہا ہوں جبکہ آپ پر سیاہ پگڑی ہے اور آپ نے اس کا شملہ اپنے دونوں کندھوں کے درمیان لٹکا رکھا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;