var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِتَأْخِيرِ الْعِشَاءِ عِنْدَ كُلِّ صَلَاةٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اگر یہ خطرہ نہ ہوتا کہ میں اپنی امت کو مشقت میں ڈال دوں گا تو میں انھیں عشاء کی نماز مؤخر کرنے اور ہر نماز کے وقت مسواک کرنے کا حکم دیتا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;