var nasai = {};
nasai.arabic = "أَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَبِي طَلْحَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةُ تَمَاثِيلَ";
nasai.urdu = "حضرت ابو طلحہ﷜ بیان کرتے ہیں کہ میں نے رسول اللہﷺ کو فرماتے سنا: ’’فرشتے اس گھر میں داخل نہیں ہوتے جس میں کتا یا ذی روح کی تصویر ہو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;