var nasai = {};
nasai.arabic = "حَدَّثَنَا مَسْعُودُ بْنُ جُوَيْرِيَةَ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَلِيٍّ قَالَ صَنَعْتُ طَعَامًا فَدَعَوْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ فَدَخَلَ فَرَأَى سِتْرًا فِيهِ تَصَاوِيرُ فَخَرَجَ وَقَالَ إِنَّ الْمَلَائِكَةَ لَا تَدْخُلُ بَيْتًا فِيهِ تَصَاوِيرُ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے کھانا تیار کیا اور نبیٔ اکرم ﷺ کو کھانے پر بلایا۔آپ تشریف لائے تو آپ نے ایک پردہ دیکھا جس پر تصویر یں تھیں۔آپ واپس چلے گئے اور فرمایا: ’’جس گھر میں تصویریں ہوں،وہاں فرشتے داخل نہیں ہوتے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;