var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرْجَةً ثُمَّ دَخَلَ وَقَدْ عَلَّقْتُ قِرَامًا فِيهِ الْخَيْلُ أُولَاتُ الْأَجْنِحَةِ قَالَتْ فَلَمَّا رَآهُ قَالَ انْزِعِيهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا نے فرمایا: رسول اللہ ﷺ کچھ دیر کے لیے گھر سے باہر تشریف لے گئے۔پھرآپ تشریف لائے تو میں انے ایک پردہ لٹکا رکھا تھا جس میں پروں والے گھوڑوں کی تصویریں تھیں۔آپ نے دیکھا تو فرمایا: ’’اسے اتار دے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;