var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْ كَانَ فِي بَيْتِي ثَوْبٌ فِيهِ تَصَاوِيرُ فَجَعَلْتُهُ إِلَى سَهْوَةٍ فِي الْبَيْتِ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِلَيْهِ ثُمَّ قَالَ يَا عَائِشَةُ أَخِّرِيهِ عَنِّي فَنَزَعْتُهُ فَجَعَلْتُهُ وَسَائِدَ";
nasai.urdu = "حضرت عائشہ فرماتی ہیں کہ میرے گھر میں ایک کپڑا تھا جس میں تصویریں تھیں۔میں نے اسے گھر میں ایک طاق کے آگے لگا دیا۔رسول اللہﷺ اس طاق کی طرف نماز پڑھا کرتے تھے۔آپؐ نے دیکھا تو فرمایا: ’’عائشہ! اس کو مجھ سے دور ہٹادے۔‘‘ میں نے اسے اتار کر اس کے تکیے بنا لیے۔";
nasai.hukam = "حسن";
nasai.description = ``;