var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ وَقَدْ سَتَّرْتُ بِقِرَامٍ عَلَى سَهْوَةٍ لِي فِيهِ تَصَاوِيرُ فَنَزَعَهُ وَقَالَ أَشَدُّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُضَاهُونَ بِخَلْقِ اللَّهِ";
nasai.urdu = "حضرت عائشہ﷠ سے روایت ہے،انہوں فرمایا: رسول اللہﷺ ایک سفر سے واپس تشریف لائے جبکہ میں نے اپنے ایک طاق کو تصویروں والے پردے کے ساتھے چھپا رکھا تھا۔آپ نے اسے اتار پھینکا اور فرمایا: ’’قیامت کے دن سخت ترین عذاب ان لوگوں کو ہوگا جو اللہ تعالیٰ کی پیدا کردہ صورتوں جیسی صورتیں بناتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;