var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَوَّرَ صُورَةً عُذِّبَ حَتَّى يَنْفُخَ فِيهَا الرُّوحَ وَلَيْسَ بِنَافِخٍ فِيهَا";
nasai.urdu = "حضرت ابن عباس﷞ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص کسی (ذی روح) چیز کی صورت بنائے گا،اسے عذاب دیا جائے گا حتیٰ کہ وہ اس میں روح پھونکے جبکہ وہ روح نہیں پھونک سکے گا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;