var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ الَّذِينَ يَصْنَعُونَهَا يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ";
nasai.urdu = "حضرت ابن عمر﷞ سے روایت ہے کہ نبیٔ اکرمﷺ نے فرمایا: ’’ان تصویریں بنانے والوں کو قیامت کے دن عذاب دیا جائے گا۔انہیں کہا جائے گا۔جو تم نے تصویریں بنائی ہیں،ان میں زندگی بھی پیدا کرو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;