var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ وَيُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ";
nasai.urdu = "نبی ٔ اکرمﷺ کی روجۂ محترمہ حضرت عائشہ﷠ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’یقیناً ان صورتیں بنانے والوں کو قیام کے دن عذاب دیا جائے اور انہیں کہا جائے: جو بنایا ہے اس مٰں زندگی ڈالو۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;