var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا قَالَ حَدَّثَنَا حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ مُسْلِمِ بْنِ صُبَيْحٍ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَشَدِّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الْمُصَوِّرُونَ وَقَالَ أَحْمَدُ الْمُصَوِّرِينَ";
nasai.urdu = "حضرت عبد اللہ بن مسعود سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’بلاشبہ قیامت کے دن سب سے زیادہ عذاب ان لوگوں کو ہوگا جو (جاندارچیزوں کی)تصویریں بناتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;