var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ قَزْعَةَ عَنْ سُفْيَانَ بْنِ حَبِيبٍ وَمُعْتَمِرِ بْنِ سُلَيْمَانَ عَنْ أَشْعَثَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي فِي لُحُفِنَا قَالَ سُفْيَانُ مَلَاحِفِنَا";
nasai.urdu = "حضرت عائشہ نے فرمایا: رسول اللہﷺ ہمارے لحافوں میں نماز نہیں پڑھتے تھے۔\nسفیان نے (لحف کی بجائے ملاحف) کے الفاظ بیان کیے ہیں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;