var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا انْقَطَعَ شِسْعُ نَعْلِ أَحَدِكُمْ فَلَا يَمْشِ فِي نَعْلٍ وَاحِدَةٍ حَتَّى يُصْلِحَهَا";
nasai.urdu = "حضرت ابو ہریرہ﷜ سے روایت ہے کہ نبیٔ اکرمﷺ نے فرمایا: ’’جب کسی کے جوتے کا تسمہ ٹوٹ جائے تو وہ ایک جوتے میں نہ چلے حتیٰ کہ اسے ٹھیک کرلے۔";
nasai.hukam = "صحیح";
nasai.description = ``;