var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ قَالَ حَدَّثَنَا هَمَّامٌ وَجَرِيرٌ قَالَا حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ قَالَ كَانَ نَعْلُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ وَقَبِيعَةُ سَيْفِهِ فِضَّةٌ وَمَا بَيْنَ ذَلِكَ حِلَقُ فِضَّةٍ";
nasai.urdu = "حضرت انس﷜ نے فرمایا؛ رسول اللہﷺ کی تلوار کا نعل چاندی کا تھا۔اس کے دستے کے کنارے پر بھی چاندی لگی تھی اور درمیان میں بھی چاندی کے حلقےبنے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;