var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِي جُحَيْفَةَ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْبَطْحَاءِ وَهُوَ فِي قُبَّةٍ حَمْرَاءَ وَعِنْدَهُ أُنَاسٌ يَسِيرُ فَجَاءَهُ بِلَالٌ فَأَذَّنَ فَجَعَلَ يُتْبِعُ فَاهُ هَاهُنَا وَهَاهُنَا";
nasai.urdu = "حضرت ابو جحیفہ﷜ بیان کرتے ہیں کہ ہم نبیٔ اکرمﷺ کے ساتھ بطحاء مکہ میں تھے جبکہ آپ سرخ رنگ کے ایک خیمے میں تشریف فرماتھے اور اآپ کے پاس کچھ لوگ تھے آپ سفر شروع کرنا چاہتے تھے۔حضرت بلال آپ کے پاس آئے اور آذان دی۔وہ اپنا منہ ادھر ادھر کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;