var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ سُفْيَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرٍ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا اجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌ";
nasai.urdu = "حضرت ابو ہریرہ﷜ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جب کوئی حاکم فیصلہ کرتے وقت صحیح نتیجے تک پہنچنے کی کوشش کرے اور صحیح فیصلہ کر دے تو اس کو دگنا ثواب ملے گا اور اگر وہ کوشش کرے لیکن صحیح فیصلے تک نہ پہنچ سکے تو اس کے لیے اکہرا ثواب ہے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;