var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا يُحَدِّثُ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ جَاءَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا تَسْتَعْمِلُنِي كَمَا اسْتَعْمَلْتَ فُلَانًا قَالَ إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ";
nasai.urdu = "حضرت اسید بن حضیر﷜ سے منقول ہے کہ ایک انصاری رسول اللہﷺ کے پاس آیا اور کہا کیا آپ مجھے عامل مقرر نہیں فرمائیں گے جس طرح فلاں کو مقرر فرمایا ہے؟ آپ نے فرمایا: ’’میرے بعد تم محسوس کروگے کہ دوسروں کو تم پر ترجیح دی جارہی ہے،تو تم صبر کرنا حتیٰ کہ مجھے حوض پر ملو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;