var nasai = {};
nasai.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ عَنْ ابْنِ الْمُبَارَكِ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّكُمْ سَتَحْرِصُونَ عَلَى الْإِمَارَةِ وَإِنَّهَا سَتَكُونُ نَدَامَةً وَحَسْرَةً يَوْمَ الْقِيَامَةِ فَنِعْمَتِ الْمُرْضِعَةُ وَبِئْسَتِ الْفَاطِمَةُ";
nasai.urdu = "حضرت ابو ہریرہ﷜ سے روایت ہے کہ نبی ٔ اکرمﷺ نے فرمایا: ’’امارت کی خواہش کرو گے جبکہ یہ قیامت کے دن ندامت اور افسوس و حسرت (کا سبب) بن جائے گی۔یہ دودھ پلاتی رہے تو اچھی لگتی ہے۔دودھ چھڑادے تو بری لگتی ہے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;