var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ عَصَمَنِي اللَّهُ بِشَيْءٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا هَلَكَ كِسْرَى قَالَ مَنْ اسْتَخْلَفُوا قَالُوا بِنْتَهُ قَالَ لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمْ امْرَأَةً";
nasai.urdu = "حضرت ابو بکر﷜ سے روایت ہے،انہوں نے فرمایا: اللہ تعالیٰ نے مجھے ایک فرمان کی بدولت بچا لیا جو میں نے رسول اللہﷺ سے سنا تھا۔جب (شاہ ایران) کسریٰ مر گیا تو آپ نے پوچھا: ’’ان لوگوں (ایرانیوں) نے کسے جانشین بنایا ہے۔‘‘ لوگوں نے کہا: اس کی بیٹی کو آپ نے فرمایا: ’’وہ قوم ہر گز کامیاب نہیں ہوگی جنہوں نے اپنی حکومت ایک عورت کے سپرد کردی۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;