var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ زَكَرِيَّا بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الشَّعْثَاءِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَبِي شَيْخٌ كَبِيرٌ أَفَأَحُجُّ عَنْهُ قَالَ نَعَمْ أَرَأَيْتَ لَوْ كَانَ عَلَيْهِ دَيْنٌ فَقَضَيْتَهُ أَكَانَ يُجْزِئُ عَنْهُ";
nasai.urdu = "حضرت ابن عباس سے روایت ہے کہ ایک آدمی نے نبیٔ اکرمﷺ کے پاس آکر کہا: میرا باپ بہت بوڑھا ہے۔کیا میں اس کی طرف سے ح ج کر سکتا ہوں؟ آپ نے فرمایا: ’’ہاں۔تو بتا اگر اس کے ذمے قرض ہوتا اور تو ادا کر دیتا اسے کفایت نہ کرتا؟‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;