var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ هُوَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَغْلِبَنَّكُمْ الْأَعْرَابُ عَلَى اسْمِ صَلَاتِكُمْ هَذِهِ فَإِنَّهُمْ يُعْتِمُونَ عَلَى الْإِبِلِ وَإِنَّهَا الْعِشَاءُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’اعراب (بدوی لوگ) تمھاری اس نماز (عشاء) کے نام کے سلسلے میں تم پر غالب نہ آجائیںَ وہ اونٹوں کی وجہ سے اس نماز کو مؤخر کرتے ہیں۔بلاشبہ اس نماز کا نام عشاء ہے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;