var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُحَاضِرُ بْنُ الْمُوَرِّعِ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَعْتَقَ رَجُلٌ مِنْ الْأَنْصَارِ غُلَامًا لَهُ عَنْ دُبُرٍ وَكَانَ مُحْتَاجًا وَكَانَ عَلَيْهِ دَيْنٌ فَبَاعَهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَمَانِ مِائَةِ دِرْهَمٍ فَأَعْطَاهُ فَقَالَ اقْضِ دَيْنَكَ وَأَنْفِقْ عَلَى عِيَالِكَ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ نے فرمایا کہ ایک انصاری آدمی نے اپنا غلام مدبر کردیا جب کہ وہ خود محتاج تھا۔اس کے ذمے قرض بھی تھا۔رسول اللہﷺنے وہ غلام آٹھ سودرہم میں بیچ کر وہ رقم اس کو دے دی اور فرمایا:’’اپنا قرض اداکراوراپنے بال بچوں پرخرچ کر۔‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سلیمان الأعمش عنعن۔<br>والحدیث السابق (الأصل: 4658) یغني عنہ۔`;
nasai.anwaar = [364,1];