var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي ابْنُ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الْأَلَدُّ الْخَصِمُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنھا سے روایت ہے کہ رسول اللہﷺ نے فرمایا:اللہ تعالیٰ کے نزدیک سب سے ناپسندیدہ اور قابل نفرت شخص وہ ہے جو ضدی اور جھگڑالو ہے۔‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;