var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ أَبِي مُوسَى أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دَابَّةٍ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَقَضَى بِهَا بَيْنَهُمَا نِصْفَيْنِ";
nasai.urdu = "حضرت ابو موسیٰ ﷜ سے روایت ہے کہ دو آدمی نبی اکرمﷺ کے پاس ایک جانور کے بارے میں جھگڑتے ہوئے آئے۔دلیل کسی کے پاس بھی نہیں تھی۔آپ نے دونوں کو نصف نصف دے دیا۔";
nasai.hukam = "حسن";
nasai.description = ``;