var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُوسَى بْنُ حِزَامٍ التِّرْمِذِيُّ قَالَ أَنْبَأَنَا أَبُو أُسَامَةَ عَنْ سُفْيَانَ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُعَوِّذَتَيْنِ قَالَ عُقْبَةُ فَأَمَّنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهِمَا فِي صَلَاةِ الْغَدَاةِ";
nasai.urdu = "حضرت عقبہ بن عامر ﷜سے روایت ہے کہ انھوں نے رسول اللہﷺسے معوذتین کے بارے میں پوچھا۔عقبہ نے کہا کہ (آپ نے اس وقت تو کوئی جواب نہ دیا لیکن)پھر رسول اللہﷺنے ہمیں صبح کی نمازکی امامت کراتے ہوئے یہ دونوں سورتیں تلاوت فرمائیں۔";
nasai.hukam = "حسن";
nasai.description = ``;