var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ أَبِيهِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ حِينَ تَبَيَّنَ لَهُ الصُّبْحُ";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے صبح کی نماز پرھی جب صبح آپ کے لیے واضح ہوگئی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;