var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا قَيْسٌ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُنْزِلَ عَلَيَّ آيَاتٌ لَمْ يُرَ مِثْلُهُنَّ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ إِلَى آخِرِ السُّورَةِ وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ إِلَى آخِرِ السُّورَةِ";
nasai.urdu = "حضرت عقبہ بن عامر سے روایت ہے کہ بنئ اکرمﷺنے فرمایا:’’مجھ پر ایسی آیات اتاری گئی ہیں کہ (استعاذہ کے سلسلے میں)کوئی اور آیات ان جیسی نہیں (قل اعوذ برب الفلق)آخر سورت اور (قل اعوذ برب الناس)آخر تک۔‘";
nasai.hukam = "حسن";
nasai.description = ``;