var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَزِيدُ بْنُ سِنَانٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ أَبِي سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْهُذَيْلِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ أَرْبَعٍ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَدُعَاءٍ لَا يُسْمَعُ وَنَفْسٍ لَا تَشْبَعُ";
nasai.urdu = "حضرت عبد اللہ بن عمر سے منقول ہے۔کہ نبئ اکرم ﷺچار چیزوں سے اللہ تعالیٰ کی پناہ طلب فرمایا کرتے تھے:ایسے علم سے جو نفع نہ دے ‘ایسے دل سے جو اللہ تعالیٰ سے نہ ڈرے ‘ایسی دعا سے جو قبول نہ ہو اور ایسے نفس سے جو سیر نہ ہو۔";
nasai.hukam = "حسن";
nasai.description = ``;