var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ الْجُبْنِ وَالْبُخْلِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت عمر ﷜سے منقول ہے کہ نبئ اکرم ﷺبزدلی ‘بخل ‘سینے کے فتنے اور قبر کے عذاب سے بچنے کے لیے اللہ تعالیٰ کی پناہ طلب فرمایا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;