var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ زَكَرِيَّا عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ ابْنِ مَسْعُودٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ خَمْسٍ مِنْ الْبُخْلِ وَالْجُبْنِ وَسُوءِ الْعُمُرِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت ابن مسعود ﷜نے فرمایا کہ نبئ اکرم ﷺپانچ چیزوں سے اللہ تعالیٰ کی پناہ کیا کرتے تھے:بخل‘بزدلی‘بری عمر ‘سینے کے فتنے اور قبر کے عذاب سے۔";
nasai.hukam = "صحیح";
nasai.description = ``;