var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُعَاذِ بْنِ هِشَامٍ قَالَ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْهَرَمِ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ";
nasai.urdu = "حضرت انس﷜سے روایت ہے کہ رسول اللہ ﷺیوں دعا فرماتے تھے:’’اے اللہ!میں عجز ‘سستی ‘بخل ‘شدید بڑھاپے ‘قبر کے عذاب اور زندگی وموت کے فتنے سے تیری پناہ میں آتا ہوں۔‘";
nasai.hukam = "صحیح";
nasai.description = ``;