var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْمُنْذِرِ عَنْ ابْنِ فُضَيْلٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَوَاتٌ لَا يَدَعُهُنَّ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَغَلَبَةِ الرِّجَالِ";
nasai.urdu = "حضرت انس بن مالک﷜سے روایت ہے ‘انھوں نے فرمایا:کچھدعائیں ایسی ہیں جنھیں رسول اللہﷺکبھی نہیں چھوڑتے تھے۔آپ فرمایا کرتے تھے:’’اے اللہ!میں فکر‘غم‘عجز‘سستی‘بخل‘بزدلی اور اور لوگوں کے غلبے سے تیری پناہ میں آتا ہوں۔‘۔";
nasai.hukam = "صحیح";
nasai.description = ``;