var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا بِشْرٌ عَنْ حُمَيْدٍ قَالَ قَالَ أَنَسٌ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكَسَلِ وَالْهَرَمِ وَالْجُبْنِ وَالْبُخْلِ وَفِتْنَةِ الدَّجَّالِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت انس ﷜نے فرمایاکہ نبئ اکرم ﷺیہ دعا کیا کرتے تھے:’’اے اللہ میں بے جاسستی ‘شدید بڑھاپے ‘بزدلی‘بخل ‘دجال کے فتنے اور قبر کے عذاب سے تیری پناہ حاصل کرتا ہوں۔‘";
nasai.hukam = "صحیح";
nasai.description = ``;