var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ وَالْهَرَمِ وَالْبُخْلِ وَالْجُبْنِ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ";
nasai.urdu = "حضرت انس﷜سے روایت ہے کہ نبئ اکرم ﷺیوں فرمایا کرتے تھے ’’اے اللہ!میں نکمے پن ‘بے جا سستی‘شدید بڑھاپے‘کنجوسی اور بزدلی سے تیری پناہ میں آتا ہوں ‘نیز قبر کے عذاب اور زندگی اور موت کے فتنے سے تیری پناہ مانگتا ہوں‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;