var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ بْنُ وَكِيعِ بْنِ الْجَرَّاحِ قَالَ حَدَّثَنَا أَبِي عَنْ سَعْدِ بْنِ أَوْسٍ عَنْ بِلَالِ بْنِ يَحْيَى عَنْ شُتَيْرِ بْنِ شَكَلِ بْنِ حُمَيْدٍ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي دُعَاءً أَنْتَفِعُ بِهِ قَالَ قُلْ اللَّهُمَّ عَافِنِي مِنْ شَرِّ سَمْعِي وَبَصَرِي وَلِسَانِي وَقَلْبِي وَمِنْ شَرِّ مَنِيِّي يَعْنِي ذَكَرَهُ";
nasai.urdu = "حضرت شکل بن حمید سے روایت ہے انھوں نے کہا کہ کہ میں نے عرض کی:اے اللہ کے رسول!مجھے کوئی دعاسکھلائیے جس سے میں فائدہ اٹھا سکوں آپ نے فرمایا:’’کہہ:اے اللہ!مجھے میرے کان ‘آنکھ‘زبان ‘دل اور منی ‘یعنی شرم گا ہ کے شر سے محفوظ رکھ۔‘";
nasai.hukam = "حسن";
nasai.description = ``;