var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ خَالِدٍ قَالَ حَدَّثَنَا حُمَيْدٌ قَالَ سُئِلَ أَنَسٌ وَهُوَ ابْنُ مَالِكٍ عَنْ عَذَابِ الْقَبْرِ وَعَنْ الدَّجَّالِ قَالَ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكَسَلِ وَالْهَرَمِ وَالْجُبْنِ وَالْبُخْلِ وَفِتْنَةِ الدَّجَّالِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت انس بن مالک ﷜سے عذاب قبر اور دجال کے بارے میں پوچھا گیا تو انھوں نے کہا کہ اللہ کے نبئ ﷺفرمایا کرتے تھے:’’اے اللہ!میں کاہلی ‘شدید بڑھاپے ‘بزدلی ‘بخل ‘فتنہ دجال اور عذاب قبر سے (بچنے کے لیے)تیری پناہ حاصل کرتا ہوں۔‘";
nasai.hukam = "صحیح";
nasai.description = ``;