var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا عُمَرُ يَعْنِي ابْنَ عَبْدِ الْوَاحِدِ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي إِسْحَقُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ عِيَاضٍ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَوَّذُوا بِاللَّهِ مِنْ الْفَقْرِ وَمِنْ الْقِلَّةِ وَمِنْ الذِّلَّةِ وَأَنْ أَظْلِمَ أَوْ أُظْلَمَ";
nasai.urdu = "حضرت ابوھریرہ نے بیان کیا کہ رسول اللہﷺنے فرمایا:’’تم فقر ‘قلت ‘ذلت اور ظالم یا مظلوم بننے سے اللہ تعالیٰ کی پناہ مانگا کرو۔‘";
nasai.hukam = "حسن";
nasai.description = ``;