var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنِي مُوسَى بْنُ شَيْبَةَ عَنْ الْأَوْزَاعِيِّ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ عِيَاضٍ أَنَّ أَبَا هُرَيْرَةَ حَدَّثَهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَوَّذُوا بِاللَّهِ مِنْ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ وَأَنْ تَظْلِمَ أَوْ تُظْلَمَ";
nasai.urdu = "حضرت ابوھریرہ نے بیان فرمایا کہ رسول اللہﷺنے فرمایا:’’تم فقر‘قلت‘ذلت اور ظالم یا مظلوم بننے سے اللہ تعالیٰ کی پناہ حاصل کیا کرو۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;