var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ،عَنْ أَخِيهِ عَبَّادِ بْنِ أَبِي سَعِيدٍ،أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْأَرْبَعِ: مِنْ عِلْمٍ لَا يَنْفَعُ،وَمِنْ قَلْبٍ لَا يَخْشَعُ،وَمِنْ نَفْسٍ لَا تَشْبَعُ،وَمِنْ دُعَاءٍ لَا يُسْمَعُ";
nasai.urdu = "حضرت ابوھریرہ سے منقول ہے کہ رسول اللہ ﷺفرمایا کرتے تھے:’’اے اللہ!میں چار چیزوں سے تیری پناہ طلب کرتا ہوں: اس علم سے جو نفع نہ دے ‘اس دل سے جو اللہ تعالیٰ کے سامنے خشوع وخضوع نہ کرے ‘اس نفس سے سیر نہ ہو اور ایسی دعا سے جو قبول نہ ہو۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;