var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كُنَّ النِّسَاءُ يُصَلِّينَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ فَيَرْجِعْنَ فَمَا يَعْرِفُهُنَّ أَحَدٌ مِنْ الْغَلَسِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ عورتیں رسول اللہ ﷺ کے ساتھ صبح کی نماز اپنی چادروں میں لپٹ کر پڑھتی تھیں،پھر واپس جاتیں تو اندھیرے کی بنا پر کوئی انھیں پہچان نہیں سکتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;