var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ أَنْبَأَنَا ابْنُ إِدْرِيسَ عَنْ ابْنِ عَجْلَانَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْجُوعِ فَإِنَّهُ بِئْسَ الضَّجِيعُ وَأَعُوذُ بِكَ مِنْ الْخِيَانَةِ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ";
nasai.urdu = "حضرت ابوھریرہ﷜سے مروی ہے کہ رسول اللہﷺفرمایا کرتے تھے:’’اے اللہ!میں بھوک سے تیری پناہ چاہتا ہوں کیونکہ یہ بدترین ساتھی ہے۔اور خیانت سے بھی پناہ چاہتا ہوں کیونکہ یہ بد ترین خصلت ہے۔‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1547)`;
nasai.anwaar = [364,1];