var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا خَلَفٌ عَنْ حَفْصٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَذِهِ الدَّعَوَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَقَلْبٍ لَا يَخْشَعُ وَدُعَاءٍ لَا يُسْمَعُ وَنَفْسٍ لَا تَشْبَعُ ثُمَّ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ هَؤُلَاءِ الْأَرْبَعِ";
nasai.urdu = "حضرت انس﷜سے منقول ہے کہ نبئ اکرمﷺیہ دعائیں فرمایا کرتے تھے:’’اے اللہ!میں تیری پناہ میں آتا ہوں ایسے علم سے جو نفع نہ دے ‘ایسے دل سے جس میں (اللہ تعالیٰ کا)ڈر نہ ہو ‘ایسی دعا سے جو سنی نہ جائے (قبول نہ کی جائے۔)اور ایسے نفس سے سیر نہ ہو۔‘‘پھر فرماتے:’’اے اللہ!میں ان چاروں چیزوں سے تیری پناہ کا طالب ہوں۔‘";
nasai.hukam = "صحیح";
nasai.description = ``;