var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنَا ضُبَارَةُ عَنْ دُوَيْدِ بْنِ نَافِعٍ قَالَ قَالَ أَبُو صَالِحٍ قَالَ أَبُو هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الشِّقَاقِ وَالنِّفَاقِ وَسُوءِ الْأَخْلَاقِ";
nasai.urdu = "حضرت ابوھریرہ ﷜سے منقول ہے کہ رسول اللہ ﷺیہ دعا فرمایا کرتے تھے:’’اے اللہ!میں مخالفت و دشمنی ‘نفاق اور بد اخلاق سے تیری پناہ میں آتا ہوں۔‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1546)`;
nasai.anwaar = [364,1];