var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِيُّ قَالَ حَدَّثَنَا حَيْوَةُ عَنْ دَرَّاجٍ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَعُوذُ بِاللَّهِ مِنْ الْكُفْرِ وَالدَّيْنِ فَقَالَ رَجُلٌ تَعْدِلُ الدَّيْنَ بِالْكُفْرِ قَالَ نَعَمْ";
nasai.urdu = "حضرت ابوسعید ﷜سے منقول ہے کہ نبئ اکرم ﷺنے فرمایا:’’میں کفر اور کسی کے واجب الا داحق(کی حالت میں موت)سے اللہ تعالیٰ سے پناہ مانگتا ہوں۔‘‘ایک آدمی نے کہا:کیا آپ واجب الاداحق کو کفر کے برابر رکھ رہے ہیں؟آپ نے فرمایا:’’ہاں۔‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = `دراج أبو السمع صدوق وثقہ الجمہور وھو حسن الحدیث عن أبي الھیثم وعن غیرہ`;