var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنِي حُيَيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَغَلَبَةِ الْعَدُوِّ وَشَمَاتَةِ الْأَعْدَاءِ";
nasai.urdu = "حضرت عبد اللہ بن عمر و بن عاص ﷢ سے روایت ہے کہ رسول اللہﷺان کلمات کے ساتھ دعا فرمایا کرتے تھے:’’اے اللہ!میں قرض اور واجب الادا حق کے غلبے (اور بوجھ)‘دشمن کے غلبے اور دشمنوں کی دل آزار خوشی سے تیری پناہ چاہتا ہوں۔‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;