var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا الْقَاسِمُ وَهُوَ ابْنُ يَزِيدَ الْجَرْمِيُّ عَنْ عَبْدِ الْعَزِيزِ أَخْبَرَنِي عَمْرُو بْنُ أَبِي عَمْرٍو عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ";
nasai.urdu = "حضرت انس بن مالک ﷜سے روایت ہے کہ نبئ اکرم ﷺیوں فرمایا کرتے تھے:’’اے اللہ!میں فکرو غم ‘کاہلی اور بزدلی ‘کنجوسی‘قرض کے بوجھ اور لوگوں کے غلبے سے تیری پناہ چاہتا ہوں۔‘";
nasai.hukam = "حسن";
nasai.description = ``;