var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ فَضَالَةَ عَنْ عُبَيْدِ اللَّهِ قَالَ أَنْبَأَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ الْجُبْنِ وَالْبُخْلِ وَسُوءِ الْعُمُرِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت عمر ﷜سے روایت ہے کہ نبئ اکرمﷺبزدلی‘کنجوسی ‘بری عمر‘سینے اور دل کے فتنے اور عذاب قبر سے اللہ تعالیٰ کی پناہ طلب فرمایا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;