var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ هُوَ أَبُو دَاوُدَ الْمُصَاحِفِيُّ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ أَنْبَأَنَا يُونُسُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ خَمْسٍ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ وَسُوءِ الْعُمُرِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت عمر بن خطاب ﷜نے فرمایا کہ رسول اللہﷺپانچ چیزوں سے اللہ تعالیٰ کی پناہ طلب فرمایا کرتے تھے:’’اے اللہ!میں بزدلی‘کنجوسی ‘بری عمر‘سینے کے فتنے اور قبر کے عذاب سے تیری پناہ میں آتا ہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;