var nasai = {};
nasai.arabic = "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا حُسَيْنٌ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ حَدَّثَنِي أَصْحَابُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ الشُّحِّ وَالْجُبْنِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت عمر بن میمون نے کہا کہ مجھے بہت سے اصحاب رسول﷢ نے بیان فرمایا کہ رسول اللہﷺحرص‘کنجوسی ‘بزدلی ‘سینے کے فتنے اور عذاب قبر سے اللہ تعالیٰ کی پناہ مانگا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;