var nasai = {};
nasai.arabic = "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ وَكِيعٍ قَالَ حَدَّثَنَا أَبِي عَنْ سَعْدِ بْنِ أَبِي أَوْسٍ عَنْ بِلَالِ بْنِ يَحْيَى عَنْ شُتَيْرِ بْنِ شَكَلِ بْنِ حُمَيْدٍ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي دُعَاءً أَنْتَفِعُ بِهِ قَالَ قُلْ اللَّهُمَّ عَافِنِي مِنْ شَرِّ سَمْعِي وَبَصَرِي وَلِسَانِي وَقَلْبِي وَشَرِّ مَنِيِّي يَعْنِي ذَكَرَهُ";
nasai.urdu = "حضرت شکل بن حمید ﷜سے مروی ہے کہ میں نے کہا:اے اللہ کے رسول!مجھے کوئی دعا سکھائیے جس سے میں فائدہ حاصل کروں۔آپ نے فرمایا:’’کہہ:اے اللہ!مجھے میرے کانوں ‘آنکھوں ‘زبان‘دل اور منی‘یعنی شرم گاہ کے شر سے محفوظ رکھنا۔‘";
nasai.hukam = "حسن";
nasai.description = ``;