var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي سَالِمُ بْنُ غَيْلَانَ عَنْ دَرَّاجٍ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ فَقَالَ رَجُلٌ وَيَعْدِلَانِ قَالَ نَعَمْ";
nasai.urdu = "حضرت ابو سعید خدری ﷜سے روایت ہے کہ رسول اللہﷺ یوں دعا فرمایا کرتے تھے:’’اے اللہ!میں کفر اور فقر سے تیری پناہ میں آتا ہوں۔‘‘ ایک آدمی نے کہا:یہ دونوں برابر ہیں؟آپ نے فرمایا:’’ہاں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;