var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنِي ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي حُيَيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَغَلَبَةِ الْعَدُوِّ وَشَمَاتَةِ الْأَعْدَاءِ";
nasai.urdu = "حضرت عبداللہ بن عمر بن عاص سے روایت ہے کہ رسول اللہ ﷺان کلمات کے ساتھ دعا فرمایا کرتے تھے:’’اے اللہ!میں حقوق العباد کے غالب آنے ‘دشمن کے غالب آ جانے اور دشمنوں کی دل آزارخوشی سے تیری پناہ مانگتا ہوں۔‘";
nasai.hukam = "حسن";
nasai.description = ``;