var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ قَالَ حُيَيٌّ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَشَمَاتَةِ الْأَعْدَاءِ";
nasai.urdu = "حضرت عبداللہ بن عمرو ﷜سے روایت ہے کہ رسول اللہﷺ ن﷾ان کلمات کے ساتھ دعا فرمایا کرتے تھے:’’اے اللہ!میں واجب الادا حق (قرض وغیرہ)کے غلبے اور دشمنوں کی ناروا خوشی سے تیری پناہ مانگتا ہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;