var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ هَارُونَ بْنِ إِبْرَاهِيمَ عَنْ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَذِهِ الدَّعَوَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكَسَلِ وَالْهَرَمِ وَالْجُبْنِ وَالْعَجْزِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ";
nasai.urdu = "حضرت عثمان بن ابی العاص ﷜سے منقول ہے کہ نبیٔ اکرم ﷺیہ دعائیں مانگا کرتے تھے:’’اے اللہ!میں کاہلی‘شدید بڑھاپے ‘بزدلی ‘نکمے پن اور زندگی و موت کے فتنے سے تیری پناہ طلب کرتا ہوں۔‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;