var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَعِيذُ مِنْ سُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ وَدَرَكِ الشَّقَاءِ وَجَهْدِ الْبَلَاءِ";
nasai.urdu = "حضرت ابوھریرہ﷜ سے منقول ہے کہ بنئ اکرمﷺبری تقدیر ‘دشمنوں کی نارواخوشی‘بدبختی کی گرفت اور شدید مصیبت و آزمائش سے اللہ تعالیٰ کی پناہ مانگا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;