var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْجُنُونِ وَالْجُذَامِ وَالْبَرَصِ وَسَيِّئِ الْأَسْقَامِ";
nasai.urdu = "حضرت انس ﷜سے روایت ہے کہ نبئ اکرم ﷺیوں بھی دعا فرمایا کرتے تھے:’’اے اللہ!میں پا گل پن ‘کوڑھ‘پھلبہری او ر دوسری بری بیماریوں سے تیری پناہ چاہتا ہوں۔‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1554)`;
nasai.anwaar = [364,1];