var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَبَّادٌ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ عَيْنِ الْجَانِّ وَعَيْنِ الْإِنْسِ فَلَمَّا نَزَلَتْ الْمُعَوِّذَتَانِ أَخَذَ بِهِمَا وَتَرَكَ مَا سِوَى ذَلِكَ";
nasai.urdu = "حضرت ابوسعید ﷜سے روایت ہے ‘انھوں نے فرمایا:رسول اللہﷺجن وانس کی نظر بد سے بچاؤ کی دعا کیا کرتے تھے۔جب معوذتین (سورۂ فلق وناس)نازل ہوئیں تو آپ نے انھیں پڑھنا شروع کر دیااور دوسری پناہ والی دعائیں چھوڑ دیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ترمذی (2058) ابن ماجہ (3511)<br>سعید الجریري اختلط ولم أجد بأنہ حدث بہ قبل اختلاطہ۔`;
nasai.anwaar = [364,1];