var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ بِهَؤُلَاءِ الْكَلِمَاتِ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكَسَلِ وَالْهَرَمِ وَالْجُبْنِ وَالْبُخْلِ وَسُوءِ الْكِبَرِ وَفِتْنَةِ الدَّجَّالِ وَعَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت انس ﷜نے فرمایاکہ رسول اللہﷺان کلمات کے ساتھ اللہ تعالیٰ کی پناہ کیا کرتے تھے:’’اے اللہ!میں کاہلی ‘شدیدبڑھاپے ‘بزدلی‘ کنجوسی‘ ذلیل عمر ‘دجال کے فتنے اور قبر کے عذاب سے تیری پناہ میں آتا ہوں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;