var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ سَمِعْتُ أَنَسًا يَقُولُ جَاءَ أَعْرَابِيٌّ إِلَى الْمَسْجِدِ فَبَالَ فَصَاحَ بِهِ النَّاسُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتْرُكُوهُ فَتَرَكُوهُ حَتَّى بَالَ ثُمَّ أَمَرَ بِدَلْوٍ فَصُبَّ عَلَيْهِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک دیہاتی مسجد میں آیا اور پیشاب کرنے لگا۔لوگ اسے ڈانٹنے لگے تو رسول اللہ ﷺ نے فرمایا: ’’اسے کر لینے دو۔‘‘ لوگوں نے اسے کچھ نہ کہا حتی کہ وہ پیشاب سے فارغ ہوگیا،پھر آپ نے ایک ڈول پانی منگوایا اور اسے اس پر بہا دیا گیا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;