var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ قَالَ أَخْبَرَنَا أَبُو غَسَّانَ قَالَ حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ رِجَالٍ مِنْ قَوْمِهِ مِنْ الْأَنْصَارِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَسْفَرْتُمْ بِالْفَجْرِ فَإِنَّهُ أَعْظَمُ بِالْأَجْرِ";
nasai.urdu = "حضرت محمود بن لبید رضی اللہ عنہ نے اپنی قوم انصار کے کئی بزرگوں سے بیان کیا کہ اللہ کے رسول ﷺ نے فرمایا: ’’فجر کی نماز پڑھتے پڑھتے تم جس قدر بھی روشنی کرو گے،وہ تمھارے لیے ثواب میں اضافے کا ذریعہ ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;