var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَزْهَرُ بْنُ جَمِيلٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ قَالَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ وَالْحَوْرِ بَعْدَ الْكَوْرِ وَدَعْوَةِ الْمَظْلُومِ وَسُوءِ الْمَنْظَرِ فِي الْأَهْلِ وَالْمَالِ";
nasai.urdu = "حضرت عبداللہ بن سرجس رضی اللہ عنہ سےروایت ہے کہ رسول اللہ ﷺجب سفر کرتےتویوں دعافرماتے:’’اےاللہ! میں سفر کی مشکلات واپسی کی غمگینی وپریشانی نفع کےبعد نقصان مظلوم کی بددعا اوراہل ومال میں برا منظر دیکھنےسے تیری پناہ مانگتاہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;