var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ قَالَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ وَالْحَوْرِ بَعْدَ الْكَوْرِ وَدَعْوَةِ الْمَظْلُومِ وَسُوءِ الْمَنْظَرِ فِي الْأَهْلِ وَالْمَالِ وَالْوَلَدِ";
nasai.urdu = "حضرت عبداللہ بن سرجس رضی اللہ عنہ سےروایت ہے کہ رسول اللہ ﷺجب سفر کرتےتھےتویوں دعافرماتے:’’اےاللہ! میں سفر کی مشکلات واپسی کی غمگینی نفع کےبعد نقصان مظلوم کی بددعا اوراہل وعیال اورمال میں برا منظر دیکھنےسے تیری پناہ مانگتاہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;