var nasai = {};
nasai.arabic = "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ يَتَعَوَّذُ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ وَالْحَوْرِ بَعْدَ الْكَوْرِ وَدَعْوَةِ الْمَظْلُومِ وَسُوءِ الْمَنْظَرِ";
nasai.urdu = "حضرت عبداللہ بن سرجس رضی اللہ عنہ نے فرمایا: نبئ اکرم ﷺ جب سفر کرتےتوسفر کی مشکلات واپسی کی پریشانی نفع کے بعد نقصان مظلوم کی بدعا اوربرے منظرسے پناہ طلب فرماتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;