var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَوَّذُوا بِاللَّهِ مِنْ جَارِ السَّوْءِ فِي دَارِ الْمُقَامِ فَإِنَّ جَارَ الْبَادِيَةِ يَتَحَوَّلُ عَنْكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: مستقل رہائش میں برے پڑوسی سے پںاہ مانگنی چاہیے۔عارضی پڑوسی توجلد بدیر تجھ سے دور ہوجائے گا۔‘";
nasai.hukam = "حسن";
nasai.description = ``;