var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَعِيذُ بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الدَّجَّالِ قَالَ وَقَالَ إِنَّكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ نبئ اکرم ﷺ قبر کی عذاب اوردجال کےفتنے سے اللہ تعالی کی پناہ طلب کیا کرتے تھے نیز آپ نےفرمایا:’’قبروں میں بھی تمھاری آزمائش ہوگی۔‘";
nasai.hukam = "حسن";
nasai.description = ``;