var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَأَعُوذُ بِكَ مِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے ہ رسول اللہ ﷺ یہ دعا فرمایا کرتےتھے:’’!میں قبر کےعذاب سے بچنےکےلیے تیری پناہ میں آتا ہو ں۔میں آگ کےعذاب سے تیری پناہ مانگتاہوں۔میں زندگی اورموت کے فتنے سے تیری پںاہ چاہتا ہوں اورمسیح دجل کےفتنے سے تیری پناہ کاطالب ہوں۔‘";
nasai.hukam = "حسن";
nasai.description = ``;