var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي عُمَرَ عَنْ عُبَيْدِ بْنِ خَشْخَاشٍ عَنْ أَبِي ذَرٍّ قَالَ دَخَلْتُ الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ فَجِئْتُ فَجَلَسْتُ إِلَيْهِ فَقَالَ يَا أَبَا ذَرٍّ تَعَوَّذْ بِاللَّهِ مِنْ شَرِّ شَيَاطِينِ الْجِنِّ وَالْإِنْسِ قُلْتُ أَوَ لِلْإِنْسِ شَيَاطِينُ قَالَ نَعَمْ";
nasai.urdu = "حضرت ابوذررضی اللہ سے روایت ہے انھوں نے کہا کہ میں مسجد نبوی داخل ہوا۔رسول اللہ ﷺ بھی وہیں تشریف فرما تھے۔میں آکر آپ کےپاس بیٹھ گیا۔آپ نےفرمایا: ’’ابوذر!شیطان جنوں اورانسانوں سےاللہ تعالی کی پناہ مانگا کر۔‘‘میں نے عرض کی:انسانوں میں بھی شیطان ہوتےہیں؟آپ نے فرمایا:’’ہاں‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أبو عمر الدمشقي: ضعیف،وعبید بن خشخاش: لین (تقریب: 8265،4371)۔<br>وللحدیث شاہد ضعیف عند أحمد (5/ 265)۔`;
nasai.anwaar = [364,1];