var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ الْأَعْرَجُ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ سَجْدَةً مِنْ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَهَا وَمَنْ أَدْرَكَ سَجْدَةً مِنْ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جس شخص نے صبح کی نماز سے ایک رکعت سورج طلوع ہونے سے قبل پالی تو اس نے نماز پالی اور جس شخص نے عصر کی نماز سے ایک رکعت سورج غروب ہونے سے قبل پالی تو اس نے نماز پالی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;