var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ وَمَالِكٌ قَالَا حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُوذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبئ اکرم ﷺ نے فرمایا:’’قبر کےعذاب سے اللہ تعالی کی پناہ حاصل کیاکرو۔زندگی اورموت کے فتنےسے اللہ تعالی کی پناہ مانگا کرو۔مسیح دجال کےفتنے سے اللہ تعالی کی پناہ طلب کیاکرو۔‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;