var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ قَالَ سَمِعْتُ أَبَا عَلْقَمَةَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ خَمْسٍ يَقُولُ عُوذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ وَمِنْ عَذَابِ جَهَنَّمَ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ پانچ چیزوں سے پناہ مانگا کرتےتھے۔آپ فرماتے:’’تم قبر کےعذاب ‘جہنم کےعذاب ‘زندگی وموت کےفتنے اورمسیح دجال کےشرسے اللہ تعالی کی پناہ مانگا کرو۔‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;