var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ أَبِيهِ عَنْ أَبِي عَلْقَمَةَ حَدَّثَنِي أَبُو هُرَيْرَةَ مِنْ فِيهِ إِلَى فِيَّ قَالَ وَقَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعِيذُوا بِاللَّهِ مِنْ خَمْسٍ مِنْ عَذَابِ جَهَنَّمَ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَفِتْنَةِ الْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوعلقمہ نے کہاکہ مجھے حضرت ابوہریرہ رضی اللہ عنہ نے بالمشافہ بیان کیاکہ نبئ اکرم ﷺ نے فرمایا:’’پانچ چیزوں سے اللہ تعالی کی پناہ طلب کیا کرو:جہنم کےعذاب،قبرکےعذاب،زندگی وموت کےفتنے اورمسیح دجال کےفتنےسے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;