var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَيْمُونٍ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ طَاوُسَ عَنْ أَبِي هُرَيْرَةَ وَأَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُوذُوا بِاللَّهِ عَزَّ وَجَلَّ مِنْ عَذَابِ اللَّهِ عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوہریرہ سے روایت ہے کہ نبئ اکرم ﷺ نے فرمایا:’’اللہ کے عذاب سے (بچنے کےلیے)اللہ تعالی کی پںاہ حاصل کرو۔زندگی اورموت کےفتنے سے(بچنے کےلیے) اللہ تعالی کی پناہ طلب کرو عذاب قبر اورمسیح دجال کےفتنے سے اللہ تعالی کی پناہ مانگو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;