var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُوذُوا بِاللَّهِ مِنْ عَذَابِ اللَّهِ عُوذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبئ اکرم ﷺ نےفرمایا:’’اللہ تعالی کےعذاب سے اللہ تعالی کی پںاہ مانگو۔قبر کےعذاب سے اللہ تعالی کی پںاہ مانگو۔زندگی وموت کےفتنے سے اللہ تعالی کی پںاہ مانگو اورمسیج دجال کےفتنے سے اللہ تعالی کی پناہ مانگو۔‘";
nasai.hukam = "حسن";
nasai.description = ``;