var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا أَبُو عَامِرٍ الْعَقَدِيُّ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ عَذَابِ جَهَنَّمَ وَعَذَابِ الْقَبْرِ وَالْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا:رسول اللہ ﷺ عذاب جہنم،عذاب قبر اورمسیح دجال کےشرسے اللہ تعالی کی پںاہ طلب کیاکرتےتھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;