var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا أَبُو عَمْرٍو عَنْ يَحْيَى أَنَّهُ حَدَّثَهُ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ النَّارِ وَعَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا:’’آگ کےعذاب قبر کے عذاب زندگی اورموت کےفتنے اورمسیح دجال کے شرسے اللہ کی پںاہ حاصل کیاکرو۔‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;