var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ عَنْ سُفْيَانَ بْنِ سَعِيدٍ عَنْ أَبِي حَسَّانَ عَنْ جَسْرَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ رَبَّ جِبْرَائِيلَ وَمِيكَائِيلَ وَرَبَّ إِسْرَافِيلَ أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ الْقَبْرِ";
nasai.urdu = "حضرت عائشہ سے روایت ہے کہ رسول اللہ ﷺ نے(دعا کرتےہوئے)فرمایا:’’اے اللہ!جبریل ومیکائل کےرب! اسرافیل کےرب! میں آگ کی تپش اورقبر کےعذاب سےتیری پںاہ چاہتا ہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;