var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ اللَّهَ الْجَنَّةَ ثَلَاثَ مَرَّاتٍ قَالَتْ الْجَنَّةُ اللَّهُمَّ أَدْخِلْهُ الْجَنَّةَ وَمَنْ اسْتَجَارَ مِنْ النَّارِ ثَلَاثَ مَرَّاتٍ قَالَتْ النَّارُ اللَّهُمَّ أَجِرْهُ مِنْ النَّارِ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نےفرمایا:جوشخص اللہ تعالی سے تین مرتبہ جنت کاسوال کرےتوجنت کہتی ہے:اے اللہ اسے جنت میں داخل فرما: اورجوشخص تین دفعہ آگ سے پناہ مانگے توآگ خود کہتی ہے:یا اللہ!اس کو آگ سے بچا۔‘";
nasai.hukam = "صحیح";
nasai.description = ``;