var nasai = {};
nasai.arabic = "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي عَبْدَةُ قَالَ حَدَّثَنِي ابْنُ يَسَافٍ قَالَ سُئِلَتْ عَائِشَةُ مَا كَانَ أَكْثَرُ مَا كَانَ يَدْعُو بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ أَكْثَرُ دُعَائِهِ أَنْ يَقُولَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ بَعْدُ";
nasai.urdu = "حضرت ہلال بن یساف نے کہا کہ حضرت عائشہ رضی اللہ عنہا سے پوچھا گیا:نبئ اکرم ﷺ اکثر کون سی دعا کیاکرتےتھے؟انھوں نے فرمایا:آپ اکثر یہ دعا فرمایا کرتے:’’اے اللہ!میں تیری پناہ میں آتا ہوں اپنے ان کاموں کےشرسے جومیں کر چکا ہوں اوران کاموں کے شر سے جومیں نے ابھی نہیں کیے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;