var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ قَالَ سَأَلْتُ أُمَّ الْمُؤْمِنِينَ عَائِشَةَ عَمَّا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو قَالَتْ كَانَ يَقُولُ أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ";
nasai.urdu = "حضرت فروہ بن نوفل نے کہا کہ میں نے ام المومنین حضرت عائشہ رضی اللہ عنہا سے پوچھا:رسول اللہ ﷺکیادعا فرمایا کرتےتھے؟اںھوں نے کہا کہ آپ یوں دعا فرمایا کرتےتھے:’’(اے اللہ!) میں تیری پناہ میں آتا ہوں ان کاموں کےشر سے جومیں کر چکا ہوں اوران کاموں کےشر سے جومیں نے نہیں کیے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;