var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادٌ عَنْ أَبِي الْأَحْوَصِ عَنْ حُصَيْنٍ عَنْ هِلَالٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ";
nasai.urdu = "حضرت عائشہ سے روایت ہے انھوں نے کہا کہ رسول اللہ ﷺفرمایا کرتے تھے:’’اے اللہ!میں اپنے کردہ وناکردہ گناہوں کےشرسےتیری پںاہ حاصل کرتاہوں۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;