var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ حُصَيْنٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ قَالَ سَأَلْتُ عَائِشَةَ فَقُلْتُ حَدِّثِينِي بِشَيْءٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ";
nasai.urdu = "حضرت فروہ بن نوفل نے کہا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے عرض کی:مجھے وہ الفاظ بیان فرمائیے جن کے ساتھ رسول اللہ ﷺ دعا فرمایا کرتے تھے۔انھوں نے کہا: رسول اللہ ﷺ (یوں دعا)فرماتے تھے:’’اے اللہ!میں اپںے کردہ وناکردہ گناہوں کےشرسے تیری پناہ چاہتا ہوں۔";
nasai.hukam = "حسن";
nasai.description = ``;