var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ حُصَيْنٍ سَمِعْتُ هِلَالَ بْنَ يَسَافٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ قَالَ قُلْتُ لِعَائِشَةَ أَخْبِرِينِي بِدُعَاءٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِ قَالَتْ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ";
nasai.urdu = "حضرت فروہ بن نوفل سے منقول ہے کہ میں نے حضرت عائشہ رضی اللہ عنہا سے کہا کہ مجھے کوئی ایسی دعا بتلائیے جورسول اللہ ﷺفرمایا کرتے تھے۔انھوں نے کہا:آپ فرماتے تھے:اے اللہ! میں ان کاموں کے شرسے تیری پناہ میں آتا ہوں جو میں کر چکا ہوں اور ان کاموں کے شرسے بھی جو میں نے (ابھی تک) نہیں کیے۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;