var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْخَلِيلِ قَالَ حَدَّثَنَا مَرْوَانُ هُوَ ابْنُ مُعَاوِيَةَ عَنْ عَلِيِّ بْنِ عَبْدِ الْعَزِيزِ عَنْ عُبَادَةَ بْنِ مُسْلِمٍ الْفَزَارِيِّ عَنْ جُبَيْرِ بْنِ أَبِي سُلَيْمَانَ عَنْ ابْنِ عُمَرَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ فَذَكَرَ الدُّعَاءَ وَقَالَ فِي آخِرِهِ أَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي يَعْنِي بِذَلِكَ الْخَسْفَ";
nasai.urdu = "حضرت ابن عمررضی اللہ عنہا نے فرمایا کہ نبئ اکرم ﷺ نے فرمایا کرتےتھے:اےاللہ! پھر راوی نے دعا ذکر کی جس کے آخر میں یہ لفظ ہیں۔میں اس بات سے تیری پناہ میں آتا ہوں کہ مجھے نیچے سے اچانک ہلاک کر دیاجائے۔ان الفاظ سے آپ کامقصد دھنسائےجانے سے پناہ طلب کرنا تھا۔";
nasai.hukam = "حسن";
nasai.description = ``;