var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا يَحْيَى يَعْنِي ابْنَ يَحْيَى قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَخِيهِ عَبَّادِ بْنِ أَبِي سَعِيدٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دُعَاءٍ لَا يُسْمَعُ";
nasai.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ ﷺفرمایا کرتے تھے:اے اللہ!میں تیری پناہ چاہتا ہوں اس علم سے جونفع مند نہ ہو اس دل سے جس میں خشوع وخضوع نہ ہو اس نفس سے جوسیر نہ ہو اوراس دعا سے جو سنی نہ جائے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;