var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ قَالَ بِسْمِ اللَّهِ رَبِّ أَعُوذُ بِكَ مِنْ أَنْ أَزِلَّ أَوْ أَضِلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا سے مروی ہے کہ نبئ اکرم ﷺ جب گھر سے باہر تشریف لے جاتے توفرماتے:اللہ تعالی کے نام کی برکت سے اے میرے رب!میں تیری پناہ میں آتا ہوں اس بات سے کہ میں پھسل جاؤں (کوئی لغزش اورغلطی کروں)یا گمراہ ہوجاؤں یا میں کسی پرظلم کروں یا مجھ پرظلم کیا جائے یا میں کسی کے ساتھ نامناسب سلوک کروں یا مجھ سے نامناسب سلوک کیا جائے۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>تقدم (5488)`;
nasai.anwaar = [364,1];