var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْبَلَحِ وَالتَّمْرِ وَالزَّبِيبِ وَالتَّمْرِ";
nasai.urdu = "نبی اکرم ﷺ کے ایک صحابی سے روایت ہے کہ نبی اکرم ﷺ نے گدرہ اور خشک کھجور کی مشتر کہ نبیذ اور منقی او رکھجور کی مشتر کہ نبیذ سے منع فرمایاہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;