var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ مِنْ الصَّلَاةِ رَكْعَةً فَقَدْ أَدْرَكَهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جس نے نماز کی ایک رکعت پالی،اس نے نماز پالی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;