var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ وَالنَّقِيرِ وَأَنْ يُخْلَطَ الْبَلَحُ وَالزَّهْوُ";
nasai.urdu = "حضرت ابن عباس ؓ سے روایت ہے کہ رسول اللہ ﷺ نے کدو کے برتن،مٹکے،تارکول لگے ہوئے برتن اور کھجور کی جڑ سے بنائے گئے برتن (میں نبیذ بنانے)سے منع فرمایا ہے۔اسی طرح بلح اور زہو کھجور کو ملا کر نبیذ بنانے سے بھی منع فرمایا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;