var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدُّبَّاءِ وَالْمُزَفَّتِ وَزَادَ مَرَّةً أُخْرَى وَالنَّقِيرِ وَأَنْ يُخْلَطَ التَّمْرُ بِالزَّبِيبِ وَالزَّهْوُ بِالتَّمْرِ";
nasai.urdu = "حضرت ابن عباس ؓ سے روایت ہے کہ رسول اللہ ﷺ نے کدو کے برتن،تارکول لگے ہوئے برتن اور کھجور کی جڑ سے بنائے گئے برتن سے منع فرمایا،نیز کھجور کو منقی سے ملا کر پکنے کے قریب کھجور کو خشک کھجور سے ملا کر نبیذ بنانے سے بھی منع فرمایا";
nasai.hukam = "حسن";
nasai.description = ``;