var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ حَبِيبٍ عَنْ أَبِي أَرْطَاةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الزَّهْوِ وَالتَّمْرِ وَالزَّبِيبِ وَالتَّمْرِ";
nasai.urdu = "حضرت ابو سعید خدری ﷜ سے مروی ہے کہ رسول اللہ ﷺ نے پکنے کے قریب اور خشک کھجور،نیز منقی اور خشک کھجور کی مشترکہ نبیذ کے استعال سے منع فرمایا۔";
nasai.hukam = "صحیح";
nasai.description = ``;