var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَجْمَعُوا بَيْنَ التَّمْرِ وَالزَّبِيبِ وَلَا بَيْنَ الزَّهْوِ وَالرُّطَبِ";
nasai.urdu = "حضرت ابو قتادہ ﷜ سے روایت ہے کہ نبی اکر م ﷺ نے فرمایا:’’کھجور اور منقی اسی طرح پکنے کے قریب اور تازہ کھجور کو (نبیذ بنانے کے لیے)اکٹھا نہ کرو۔،،";
nasai.hukam = "صحیح";
nasai.description = ``;