var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا عَلِيٌّ وَهُوَ ابْنُ الْمُبَارَكِ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلَا تَنْبِذُوا الزَّبِيبَ وَالرُّطَبَ جَمِيعًا";
nasai.urdu = "حضرت ابو قتادہ ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’کچی اور تازہ کھجور کی مشتر کہ نبیذ نہ بناؤ۔اسی طرح منقی اور تازہ کھجور کی مشترکہ نبیذ نہ بناؤ۔،،";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;