var nasai = {};
nasai.arabic = "أَخْبَرَنِي يَزِيدُ بْنُ مُحَمَّدِ بْنِ عَبْدِ الصَّمَدِ قَالَ حَدَّثَنَا هِشَامٌ الْعَطَّارُ قَالَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ سَمَاعَةَ عَنْ مُوسَى بْنِ أَعْيَنَ عَنْ أَبِي عَمْرٍو الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ مِنْ الصَّلَاةِ رَكْعَةً فَقَدْ أَدْرَكَ الصَّلَاةَ";
nasai.urdu = "ضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،نبی ﷺ نے فرمایا: ’’جس نے نماز کی ایک رکعت پالی،اس نے نمازپالی۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;