var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ وَعَلِيُّ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحِيمِ عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَلِيطِ التَّمْرِ وَالزَّبِيبِ وَعَنْ التَّمْرِ وَالْبُسْرِ";
nasai.urdu = "حضرت ابن عباس ؓ سے روایت ہے کہ رسول اللہ ﷺ نے کھجور ومنقی او رخشک وگدر کھجور کی مشترکہ نبیذ سے منع فرمایاہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;