var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هِشَامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْبِذُوا الزَّهْوَ وَالرُّطَبَ وَلَا تَنْبِذُوا الرُّطَبَ وَالزَّبِيبَ جَمِيعًا";
nasai.urdu = "حضرت ابوقتادہ ﷜ سے روایت ہے کہ نبی اکر م ﷺ نے فرمایا:’’پکنے کے قریب اور تازہ کھجور کی مشترکہ نبیذ نہ بناؤ۔اور تازہ کھجور اور منقی کو ملا کر نبیذ نہ بناؤ۔،،";
nasai.hukam = "حسن";
nasai.description = ``;