var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يُنْبَذَ الزَّبِيبُ وَالْبُسْرُ جَمِيعًا وَنَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا";
nasai.urdu = "حضرت جابر ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے منقی اور گدر کھجور کو ملا کر نبیذ بنانے سے منع فرمایا۔اسی طرح گدر کھجور اور تازہ کھجور کو ملا کر نبیذ بنانے سے منع فرمایا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;