var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلَا الْبُسْرَ وَالزَّبِيبَ جَمِيعًا وَانْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ";
nasai.urdu = "حضرت ابو قتادہ ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’پکنے کے قریب اور پکی کھجوروں کو ملا کر نبیذ نہ بناؤ۔(اسی طرح)گدر کھجور اور منقی کو بھی نہ ملاؤ بلکہ ان میں سے ہر ایک الگ الگ نبیذ بناؤ۔";
nasai.hukam = "حسن";
nasai.description = ``;