var nasai = {};
nasai.arabic = "أَخْبَرَنِي شُعَيْبُ بْنُ شُعَيْبِ بْنِ إِسْحَقَ قَالَ حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ مِنْ الصَّلَاةِ رَكْعَةً فَقَدْ أَدْرَكَهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انھوں نے کہا: رسول اللہ ﷺ نے فرمایا: ’’جس نے نماز کی ایک رکعت پالی،اس نے نمازپالی۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;