var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ قَالَ حَدَّثَنَا يَحْيَى أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ حَدَّثَهُ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ خَلِيطِ الزَّهْوِ وَالتَّمْرِ وَخَلِيطِ الْبُسْرِ وَالتَّمْرِ وَقَالَ لِتَنْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَةٍ فِي الْأَسْقِيَةِ الَّتِي يُلَاثُ عَلَى أَفْوَاهِهَا";
nasai.urdu = "حضرت ابوقتادہ ﷜ سےمنقول ہے کہ نبی اکرمﷺ نے پکنے کے قریب اور خشک کھجور کی مشتر کہ نبیذ اور (اسی طرح)گدر اور خشک کھجور کی مشترکہ نبیذ سے منع کیا۔اور آپ نے فرمایا:’’ان میں سے ہر ایک کی الگ الگ نبیذ ان مشکیزوں میں بناؤ جن کا منہ باندھا جاتاہے۔،،";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;