var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ قَالَ حَدَّثَنَا أَبُو كَثِيرٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُخْلَطَ الْبُسْرُ وَالزَّبِيبُ وَالْبُسْرُ وَالتَّمْرُ وَقَالَ انْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَةٍ";
nasai.urdu = "حضرت ابو ہریرہ ﷜ فرماتے ہیں کہ رسو ل اللہ ﷺ نے منع فرمایا کہ (نبیذ بنانے کے لیے)گدر کھجور او رمنقی کو یا گدر او رخشک کھجور کو ملا یا جائے۔آپ نے فرمایا:’’ان میں سے ہر ایک کی الگ الگ نبیذ بناؤ۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;