var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي أَبُو كَثِيرٍ ح وَأَنْبَأَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ بْنِ حَبِيبٍ عَنْ الْأَوْزَاعِيِّ حَدَّثَنَا أَبُو كَثِيرٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَمْرُ مِنْ هَاتَيْنِ وَقَالَ سُوَيْدٌ فِي هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةُ وَالْعِنَبَةُ";
nasai.urdu = "حضرت ابوہریرہ ﷜ سےمنقول ہے کہ رسول اللہ ﷺ نے فرمایا:’’شراب ان دو درختوں (کے پھلوں)سے تیار ہوتی ہے: کھجور اور انگور۔،،";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;