var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا الْحَجَّاجُ الصَّوَّافُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو كَثِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةُ وَالْعِنَبَةُ";
nasai.urdu = "حضرت ابو ہریرہ ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’شراب (عموما) ان دو درختوں (یعنی)کھجور وانگور (کے پھلوں) سے تیار ہوتی ہے۔،،";
nasai.hukam = "حسن";
nasai.description = ``;