var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُوسَى بْنُ سُلَيْمَانَ بْنِ إِسْمَعِيلَ بْنِ الْقَاسِمِ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ يُونُسَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ رَكْعَةً مِنْ الْجُمُعَةِ أَوْ غَيْرِهَا فَقَدْ تَمَّتْ صَلَاتُهُ";
nasai.urdu = "حضرت سالم اپنے باپ (حضرت عبداللہ بن عمر رضی اللہ عنہما) سے بیان کرتے ہیں کہ نبی ﷺ نے فرمایا: ’’جس نے جمعہ یا کسی اور نماز کی ایک رکعت پالی تو اس کی نماز پوری ہوگئی۔‘‘";
nasai.hukam = "حسن";
nasai.description = ``;