var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ أَنْبَأَنَا ابْنُ إِدْرِيسَ عَنْ زَكَرِيَّا وَأَبِي حَيَّانَ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَمَّا بَعْدُ فَإِنَّ الْخَمْرَ نَزَلَ تَحْرِيمُهَا وَهِيَ مِنْ خَمْسَةٍ مِنْ الْعِنَبِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالْعَسَلِ";
nasai.urdu = "حضرت ابن عمر ؓ سے روایت ہے کہ میں نےحضرت عمر بن خطاب ﷜ کو رسول اللہ ﷺ کے منبر مبار ک پرفاتے سنا: حمد وصلاۃ کے بعد (یاد رکھوکہ) شراب کی حرمت نازل ہوئی تو وہ پانچ چیزوں سے تیار کی جاتی تھی:انگور سے،گندم سے،جو سے،کھجور سے اور شہدسے۔";
nasai.hukam = "حسن";
nasai.description = ``;