var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ مُسْكِرٍ حَرَامٌ وَكُلُّ مُسْكِرٍ خَمْرٌ قَالَ الْحُسَيْنُ قَالَ أَحْمَدُ وَهَذَا حَدِيثٌ صَحِيحٌ";
nasai.urdu = "حضرت ابن عمر ؓ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا:’’ہر نشہ آور چیز حرام ہے اور ہر نشہ آور چیز خمر ہے۔،،حسین بن منصور نے کہا:امام احمد ن﷫ نے فرمایا: یہ حدیث صحیح ہے۔";
nasai.hukam = "حسن";
nasai.description = ``;