var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ التِّرْمِذِيُّ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو بَكْرٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ رَكْعَةً مِنْ صَلَاةٍ مِنْ الصَّلَوَاتِ فَقَدْ أَدْرَكَهَا إِلَّا أَنَّهُ يَقْضِي مَا فَاتَهُ";
nasai.urdu = "حضرت سالم سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس شخص نے کسی بھی نماز کی ایک رکعت پالی،اس نے نماز پالی مگر جتنی نماز اس سے رہ گئی ہے،اسے پوری کرے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;