var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ عَنْ مُحَمَّدٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُنْبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ وَالنَّقِيرِ وَالْحَنْتَمِ وَكُلُّ مُسْكِرٍ حَرَامٌ";
nasai.urdu = "حضرت ابو ہریرہ ﷜ سے منقول ہے کہ رسول اللہ ﷺ نے کدو کے برتن،تارکول لگے ہوئے برتن،کھجور کی جڑ سے بنائے ہو ئے برتن اور مٹکے میں نبیذ بنانے سے منع فرمایا ہے۔اور ہر نشہر آور چیز حرام ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;