var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ زَبْرٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْبِذُوا فِي الدُّبَّاءِ وَلَا الْمُزَفَّتِ وَلَا النَّقِيرِ وَكُلُّ مُسْكِرٍ حَرَامٌ";
nasai.urdu = "حضرت عا ئشہ ؓ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:’’کدو کے برتن،تارکول لگے ہوئے برتن اور کھجور کی جڑ سےبنائے گئے برتن میں نبیذ نہ بناؤ۔اور ہر نشہ آور چیز حرام ہے۔،،";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;