var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ ح وَأَنْبَأَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْبِتْعِ فَقَالَ كُلُّ شَرَابٍ أَسْكَرَ حَرَامٌ اللَّفْظُ لِسُوَيْدٍ";
nasai.urdu = "حضرت عائشہ ؓ سے منقول ہے کہ رسول اللہ ﷺ سے شہد کی نبیذ کے بارے میں پوچھا گیا تو آپ نے فرمایا:’’جس مشروب میں نشہ پیدا ہوجائے وہ حرام ہے۔،،یہ الفاظ سوید کے ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;