var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْبِتْعِ فَقَالَ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ وَالْبِتْعُ مِنْ الْعَسَلِ";
nasai.urdu = "حضرت عائشہ ؓ سے مروی ہے کہ رسول اللہ ﷺ سے بتع (شہد کی شراب)کے بارے میں پوچھا گیا تو آپ نے فرمایا:’’جس مشروب میں بھی نشہ پیدا ہو جائے وہ حرام ہوجاتا ہے۔،،بتع (نبیذ ہے جو)شہد سے تیار کی جاتی تھی۔";
nasai.hukam = "حسن";
nasai.description = ``;