var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ عَنْ عَبْدِ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْبِتْعِ فَقَالَ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ وَالْبِتْعُ هُوَ نَبِيذُ الْعَسَلِ";
nasai.urdu = "حضرت عائشہ ؓ سے روایت ہے کہ نبی اکرم ﷺ سے بتع کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’ہرنشہ آور مشروب حرام ہے۔،،بتع شہد کی نبیذ کو کہتے ہیں۔";
nasai.hukam = "حسن";
nasai.description = ``;