var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْمَلِكِ بْنِ الطُّفَيْلِ الْجَزَرِيِّ قَالَ كَتَبَ إِلَيْنَا عُمَرُ بْنُ عَبْدِ الْعَزِيزِ لَا تَشْرَبُوا مِنْ الطِّلَاءِ حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى ثُلُثَهُ وَكُلُّ مُسْكِرٍ حَرَامٌ";
nasai.urdu = "حضرت عبد الملک بن طفیل جزری سے منقول ہے کہ حضرت عمر بن عبدا لعزیر ﷫ (خلیفہ راشد نے ہمیں لکھا کہ طلا ء نہ پیو حتی کہ دو تہائی خشک ہو کر ایک تہائی رہ جائے اور ہر نشہ آور چیز حرام ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث الآتی (5730)<br>عبدالملک بن الطفیل الجزري: مجہول (التحریر: 4188)`;
nasai.anwaar = [365,1];