var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ";
nasai.urdu = "حضرت عمر و بن شعیب کے پر دادا محترم (حضرت عبد اللہ بن عمر و ؓ ) سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا: ’’جس مشروب کا زیادہ پینا نشہ آور ہو،اس کو تھوڑا پینا بھی حرام ہے۔،،";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;