var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَخْلَدٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ الْحَكَمِ قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنْهَاكُمْ عَنْ قَلِيلِ مَا أَسْكَرَ كَثِيرُهُ";
nasai.urdu = "حضرت سعد ﷜ سے مروی ہےکہ نبی اکرم ﷺ نے فرمایا: ’’من تمھیں وہ چیز معمولی سی پینے سے بھی روکتاہوں جسے زیادہ پینےسے نشہ آتا ہے (اور کم پینے سے نشہ نہیں ہوتا)۔،،";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;