var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرٍ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ قَلِيلِ مَا أَسْكَرَ كَثِيرُهُ";
nasai.urdu = "حضرت سعد ﷜ سے روایت ہے کہ نبی اکرم ﷺ نے اس چیز کو تھوڑا پینے سے منع کیاہے جسے زیادہ پینا نشہ آور ہو۔";
nasai.hukam = "حسن";
nasai.description = ``;