var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ أَبِي إِسْحَقَ عَنْ صَعْصَعَةَ بْنِ صُوحَانَ عَنْ عَلِيٍّ كَرَّمَ اللَّهُ وَجْهَهُ قَالَ نَهَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ حَلْقَةِ الذَّهَبِ وَالْقَسِّيِّ وَالْمِيثَرَةِ وَالْجِعَةِ";
nasai.urdu = "حضرت علی ﷜ سے روایت ہے کہ نبی اکر م ﷺ نے مجھے سونے کی انگوٹھی،قسی (ریشمی)کپڑے،سرخ ریشمی گدیلے اور جو کی نبیذ سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;