var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ سُمَيْعٍ قَالَ حَدَّثَنِي مَالِكُ بْنُ عُمَيْرٍ قَالَ قَالَ صَعْصَعَةُ لِعَلِيِّ بْنِ أَبِي طَالِبٍ كَرَّمَ اللَّهُ وَجْهَهُ انْهَنَا يَا أَمِيرَ الْمُؤْمِنِينَ عَمَّا نَهَاكَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدُّبَّاءِ وَالْحَنْتَمِ";
nasai.urdu = "حضرت صعصہ نے حضرت علی بن ابی طالب ﷜ سے کہا: اے امیر المو منین! ہمیں اس چیز سے منع فرمائیے جس سے رسول اللہ ﷺ نے آپ کو روکا ہو۔انھو ں نے کہا:رسو ل اللہ ﷺ نے مجھے کدو کے برتن اور مٹکے (میں نبیذ وغیرہ بنانے)سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;