var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ طَاوُسٍ قَالَ قَالَ رَجُلٌ لِابْنِ عُمَرَ أَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ قَالَ نَعَمْ قَالَ طَاوُسٌ وَاللَّهِ إِنِّي سَمِعْتُهُ مِنْهُ";
nasai.urdu = "حضرت طاؤس سے روایت ہے کہ ایک آدمی نے حضرت ابن عمرؓ سے پوچھا: کہا رسول اللہ ﷺ نے مٹکے کی نبیذ سے منع فرمایا ہے؟ انھوں نے فرمایا:ہاں۔حضرت طاؤس نے کہا: اللہ کی قسم! میں نے یہ (الفاظ)ان (حضرت عبد اللہ بن عمر ؓ) سے سنے ہیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;