var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ يَزِيدَ بْنِ أَبِي الزَّرْقَاءِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ التَّيْمِيِّ وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ قَالَا سَمِعْنَا طَاوُسًا يَقُولُ جَاءَ رَجُلٌ إِلَى ابْنِ عُمَرَ قَالَ أَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ قَالَ نَعَمْ زَادَ إِبْرَاهِيمُ فِي حَدِيثِهِ وَالدُّبَّاءِ";
nasai.urdu = "حضرت طاؤس کہتے ہیں کہ ایک آدمی نے حضرت ابن عمر ؓ کے پاس آکر کہا،کیا رسول اللہ ﷺ نے مٹکے کی نبیذ سے منع فرمایا ہے؟ انھوں نے کہا:ہاں۔(ایک روای) ابراہیم بن میسرہ نے اپنی حدیث میں کدو کے برتن کا بھی ذکر کیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;