var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَعَنْ الصَّلَاةِ بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ نے عصر (کی نماز) کے بعد نماز پڑھنے سے روکا ہے حتیٰ کہ سورج غروب ہوجائے اور صبح (کی نماز) کے بعد بھی نماز سے روکا ہے حتیٰ کہ سورج طلوع ہوجائے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;