var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ قَالَ حَدَّثَنَا أُمَيَّةُ عَنْ شُعْبَةَ عَنْ جَبَلَةَ بْنِ سُحَيْمٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَنْتَمِ قُلْتُ مَا الْحَنْتَمُ قَالَ الْجَرُّ";
nasai.urdu = "حضرت ابن عمر ؓ سے روایت ہے کہ رسول اللہ ﷺ نے حنتم (میں نبیذ بنانے) سے منع فرمایا ہے۔(جبلہ بن سحیم نے کہا:) میں نے پوچھا کہ حنتم کیا ہوتا ہے؟ انھوں نے فرمایا:مٹی کا مٹکا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;