var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الشَّيْبَانِيِّ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ الْأَخْضَرِ قُلْتُ فَالْأَبْيَضُ قَالَ لَا أَدْرِي";
nasai.urdu = "حضرت ابن ابی اوفی ﷜ سے روایت ہے کہ رسو ل اللہ ﷺ نے سبز مٹکے کی نبیذ سے منع فرمایا ہے۔میں نے کہا:سفید مٹکا (جائز ہے؟)انھوں نے فرمایا:میں نہیں جانتا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;