var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي رَجَاءٍ قَالَ سَأَلْتُ الْحَسَنَ عَنْ نَبِيذِ الْجَرِّ أَحَرَامٌ هُوَ قَالَ حَرَامٌ قَدْ حَدَّثَنَا مَنْ لَمْ يَكْذِبْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ نَبِيذِ الْحَنْتَمِ وَالدُّبَّاءِ وَالْمُزَفَّتِ وَالنَّقِيرِ";
nasai.urdu = "حضرت ابو رجاء سے منقول ہے کہ میں نے حضرت حسن بصری سے مٹکے کی نبیذ کےبارےمیں پوچھا:کیا وہ حرام ہے؟ انھوں نے کہا کہ حرام ہے۔مجھے اس شخص نے بیان کیا جس نے جھوٹ نہیں بو لا کہ رسول اللہ ﷺ نے (روغنی)مٹکے،کدو کے برتن،تارکول لگے ہوئے مٹکے اور کھجور کی جڑ سے بنائے گئے برتن (میں نبیذ بنانے)سے منع فرمایاہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;