var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَحَمَّادٌ وَسُلَيْمَانُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدُّبَّاءِ وَالْمُزَفَّتِ";
nasai.urdu = "حضرت عا ئشہ ؓ سے روایت ہے،انھوں نےفرمایا: رسول اللہ ﷺ نے کدو کے برتن اور تارکول لگے ہوئے برتن (میں نبیذ بنانے) سے منع فرمایا ہے";
nasai.hukam = "متفق علیہ";
nasai.description = ``;