var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ الْمُثَنَّى بْنِ سَعِيدٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الشُّرْبِ فِي الْحَنْتَمِ وَالدُّبَّاءِ وَالنَّقِيرِ";
nasai.urdu = "حضرت ابو سعید خدری ﷜ سےروایت ہے کہ رسول اللہ ﷺ نے روغنی مٹکے،کدو کےبرتن اور کھجور کی جڑ سے بنائے گئے برتن میں بنائی گئی نبیذ پینے سے منع فرمایا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;