var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَوْنِ بْنِ صَالِحٍ الْبَارِقيِّ عَنْ زَيْنَبَ بِنْتِ نَصْرٍ وَجُمَيْلَةَ بِنْتِ عَبَّادٍ أَنَّهُمَا سَمِعَتَا عَائِشَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ شَرَابٍ صُنِعَ فِي دُبَّاءٍ أَوْ حَنْتَمٍ أَوْ مُزَفَّتٍ لَا يَكُونُ زَيْتًا أَوْ خَلًّا";
nasai.urdu = "حضرت عائشہ ؓ نے فرمایا کہ میں نےرسول اللہ ﷺ کو ایسا مشروب پینےسے منع فرماتے سناجو کدو کے برتن یا روغنی مٹکے یا تارکول لگے ہوئے برتن میں تیار کیا گیا ہے،علاوہ زیتون کے تیل اور سرکے۔";
nasai.hukam = "صحیح";
nasai.description = ``;