var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُرَيْشُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ أَنْبَأَنَا عَلِيُّ بْنُ الْحَسَنِ قَالَ أَنْبَأَنَا الْحُسَيْنُ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْمُزَفَّتِ";
nasai.urdu = "حضرت ابو ہریرہ ﷜ سے روایت ہے کہ رسول اللہ ﷺ نےکدو کے برتن،روغنی مٹکے،کھجور کی جڑ کےبرتن اور تارکول لگ برتن (میں نبیذ بنانے)سے منع فرمایا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;