var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ جُرَيْجٍ قِرَاءَةً قَالَ وَقَالَ أَبُو الزُّبَيْرِ سَمِعْتُ جَابِرًا يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرِّ وَالْمُزَفَّتِ وَالدُّبَّاءِ وَالنَّقِيرِ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَمْ يَجِدْ سِقَاءً يُنْبَذْ لَهُ فِيهِ نُبِذَ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ";
nasai.urdu = "حضرت جابر ﷜ نےفرمایا کہ رسو ل اللہ ﷺ نے تارکول لگے ہوئے مٹکے،کدو کےبرتن اور کھجور کی جڑ کےبرتن (میں نبیذ بنانے) سے منع فرمایاہے۔اور جب رسول اللہ ﷺ کو نبیذ بنانے کے لیے مشکزہ نہ ملتا تو پتھر کے کو نڈے میں آپ کے لیے نبیذ بنائی جاتی تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;