var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا إِسْحَقُ يَعْنِي الْأَزْرَقَ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْبَذُ لَهُ فِي سِقَاءٍ فَإِذَا لَمْ يَكُنْ لَهُ سِقَاءٌ نَنْبِذُ لَهُ فِي تَوْرِ بِرَامٍ قَالَ وَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ";
nasai.urdu = "حضرت جابر ؓ سے روایت ہے،انھو ں نے فرمایا کہ رسول اللہ ﷺ کے لیے چمڑے کے مشکیز ے میں نبیذ بنائی جاتی تھی اور جب مشکیز ہ میسر نہ ہوتا تو پتھر کے کو نڈے میں آپ کے لیے نبیذ بنائی جاتی۔اور رسول اللہ ﷺ نے کدو کےبرتن،کھجور کی جڑ کے برتن اور تاکولگے ہوئے مٹکے سے منع فرمایا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;