var nasai = {};
nasai.arabic = "أَخْبَرَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ بْنِ سَوَّارٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالنَّقِيرِ وَالْجَرِّ وَالْمُزَفَّتِ";
nasai.urdu = "حضرت جابر ﷜ سے روایت ہے کہ رسول اللہ ﷺ نے کدو کے برتن،کھجور کی جڑ کے برتن (روغنی)مٹکے اور تارکول لگے ہوئے برتن (میں نبیذ بنانے سے منع فرمایا۔";
nasai.hukam = "حسن";
nasai.description = ``;