var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَجَّاجِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْتُ نَهَيْتُكُمْ عَنْ الْأَوْعِيَةِ فَانْتَبِذُوا فِيمَا بَدَا لَكُمْ وَإِيَّاكُمْ وَكُلَّ مُسْكِرٍ";
nasai.urdu = "حضرت بریدہ ﷜ سےروایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’میں نے تمھیں بعض برتنوں (میں نبیذ بنانے)سے روکا تھا۔اب جس برتن میں چاہو،نبیذ بناؤ لیکن ہر نشہ آور چیز سے بچو۔،،";
nasai.hukam = "صحیح";
nasai.description = ``;