var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ وَأَبُو أَحْمَدَ الزُّبَيْرِيُّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ سَالِمٍ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا نَهَى عَنْ الظُّرُوفِ شَكَتْ الْأَنْصَارُ فَقَالَتْ يَا رَسُولَ اللَّهِ لَيْسَ لَنَا وِعَاءٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا إِذًا";
nasai.urdu = "حضرت جابر﷜ سے روایت ہے کہ جب رسول اللہﷺ نے بعض برتنوں کے استعمال سے روک دیا تو انصار نے دست بستہ عر ض کی: اے اللہ کے رسول! ہمارے پاس اور برتن (زیادہ تعداد میں) نہیں۔آپ نےفرمایا: ’’پھر کوئی حرج نہیں۔،،";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;