var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى عَنْ خَالِدٍ وَهُوَ ابْنُ الْحَارِثِ عَنْ شُعْبَةَ قَالَ سَمِعْتُ أَبَا بَكْرِ بْنَ حَفْصٍ يَقُولُ سَمِعْتُ ابْنَ مُحَيْرِيزٍ يُحَدِّثُ عَنْ رَجُلٍ مَنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَشْرَبُ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا";
nasai.urdu = "نبی اکرم ﷺ کے ایک صحابی ﷜ سےروایت ہے کہ نبی اکر م ﷺ نے فرمایا:’’میری امت کے کچھ لوگ شراب پیئں گے مگر اس کانام کچھ اور رکھ لیں گے۔،،";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;