var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ عَنْ ابْنِ عُمَرَ وَنَفَرٍ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ ثُمَّ إِنْ شَرِبَ فَاجْلِدُوهُ ثُمَّ إِنْ شَرِبَ فَاجْلِدُوهُ ثُمَّ إِنْ شَرِبَ فَاقْتُلُوهُ";
nasai.urdu = "حضرت ابن عمر ؓ اور صحابہ ؓ کی ایک جماعت سے روایت ہے کہ رسول اللہ ﷺ نےفرمایا ’’جو شخص شراب پیے،اسے کوڑے لگاؤ۔پھرشراب پیے تو پھر کوڑے لگاؤ۔پھر پی لے تو پھر کوڑے لگاؤ۔اور اگر (چوتھی دفعہ) پھر پی بیٹھے تو اسے قتل کر دو۔،،";
nasai.hukam = "صحیح";
nasai.description = ``;