var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا شَبَابَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِنْ سَكِرَ فَاجْلِدُوهُ ثُمَّ إِنْ سَكِرَ فَاجْلِدُوهُ ثُمَّ قَالَ فِي الرَّابِعَةِ فَاضْرِبُوا عُنُقَهُ";
nasai.urdu = "حضرت ابو ہریرہ ﷜ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب کوئی شخص نشہ کرے تو اسے کوڑے لگاؤ،پھر نشہ کرے تو پھر کوڑے لگاؤ،پھر نشہ کرے تو پھر بھی کوڑے لگاؤ۔اگر چوتھی دفعہ نشہ کرے تو اس کی گردن اتار دو۔،،";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;