var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى عَنْ ابْنِ فُضَيْلٍ عَنْ وَائِلِ بْنِ بَكْرٍ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ أَبِيهِ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ كَانَ يَقُولُ مَا أُبَالِي شَرِبْتُ الْخَمْرَ أَوْ عَبَدْتُ هَذِهِ السَّارِيَةَ مِنْ دُونِ اللَّهِ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت ابو موسیٰ ﷜ فرمایا کرتے تھے: مجھے کوئی پروا نہیں کہ میں شراب پیوں یا اللہ تعالیٰ کو چھوڑ کر اس ستوں کی عبادت کروں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;