var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّلَاةِ بَعْدَ الصُّبْحِ حَتَّى الطُّلُوعِ وَعَنْ الصَّلَاةِ بَعْدَ الْعَصْرِ حَتَّى الْغُرُوبِ";
nasai.urdu = "حضرت ابوسعیدخدری رضی اللہ عنہ سے روایت ہے،وہ فرماتےہیں: رسول اللہ ﷺ نے صبح کی نماز کے بعد نماز پڑھنے سے منع فرمایا ہے حتیٰ کہ سورج طلوع ہوجائے اور عصر کے بعد غروب شمس تک نماز سے منع فرمایا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;