var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ نُبَيْطٍ عَنْ جَابَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ مَنَّانٌ وَلَا عَاقٌّ وَلَا مُدْمِنُ خَمْرٍ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا احسان جتلانے والا ماں باپ کا نافرمان اور عادی شراب نوش جنت میں نہیں جائیں گے";
nasai.hukam = "حسن";
nasai.description = ``;