var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَتُبْ مِنْهَا لَمْ يَشْرَبْهَا فِي الْآخِرَةِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا جو شخص دنای میں شراب پیتا اور مرتے دم تک اس کا عادی رہا اس سے توبہ نہیں کی وہ آخرت میں جنتی شراب نہیں پی سکے گا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;