var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَشْرَبْهَا فِي الْآخِرَةِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا جو شخص دنیا میں شراب پیے اور موت تک پیتا رہے(توبہ نہ کرے) وہ آخرت میں جنتی شراب نہیں پیے گا۔";
nasai.hukam = "حسن";
nasai.description = ``;