var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا صَلَاةَ بَعْدَ الْفَجْرِ حَتَّى تَبْزُغَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،وہ فرماتے ہیں: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’فجر کی نماز کے بعد کوئی نماز نہیں حتیٰ کہ سورج صاف طلوع ہوجائے اور نہ عصر کے بعد نماز ہے حتیٰ کہ سورج غروب ہوجائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;