var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْمُزَفَّتِ خَالَفَهُ أَبُو عَوَانَةَ";
nasai.urdu = "حضرت بریدہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے کدو کے برتن روغنی مٹکے کھجور کی جڑ کے برتن اور تارکول لگے ہوئے برتن (میں نبیذ بنانے) سے منع فرمایا۔\nابو عوانہ نے اس(شریک راوی حدیث) کی مخالفت کی ہے";
nasai.hukam = "صحیح";
nasai.description = ``;