var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا إِبْرَاهِيمُ بْنُ حَجَّاجٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ عَنْ قِرْصَافَةَ امْرَأَةٍ مِنْهُمْ عَنْ عَائِشَةَ قَالَتْ اشْرَبُوا وَلَا تَسْكَرُوا قَالَ أَبُو عَبْد الرَّحْمَنِ وَهَذَا أَيْضًا غَيْرُ ثَابِتٍ وَقِرْصَافَةُ هَذِهِ لَا نَدْرِي مَنْ هِيَ وَالْمَشْهُورُ عَنْ عَائِشَةَ خِلَافُ مَا رَوَتْ عَنْهَا قِرْصَافَةُ";
nasai.urdu = "قرصافہ نامی ایک عورت سے روایت ہے کہ حضرت عائشہ رضی اللہ عنہ نے فرمایا ہر مشروب پی سکتے ہو مگر نشے میں نہ آؤ۔\nابو عبدالرحمٰن(امام نسائیؒ) نے فرمایا کہ یہ روایت بھی صحیح نہیں کیونکہ ہم (محدثین) نہیں جانتے یہ قرصافہ کون اور کیسی عورت ہے جب کہ حضرت عائشہ رضی اللہ عنہ سے مشہور روایات اس کے خلاف ہیں جو ان سے قرصافہ نے بیان کیا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قرصافۃ: لا یعرف حالھا (تقریب: 8663)`;
nasai.anwaar = [366,1];