var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا أَبَانُ بْنُ صَمْعَةَ قَالَ حَدَّثَتْنِي وَالِدَتِي عَنْ عَائِشَةَ أَنَّهَا سُئِلَتْ عَنْ الْأَشْرِبَةِ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ كُلِّ مُسْكِرٍ وَاعْتَلُّوا بِحَدِيثِ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہ سے کچھ مشروبات کے بارے میں سوال کیا گیا تو انھوں نے کہا کہ رسول اللہﷺ ہر نشہ آور چیز سے منع فرماتے تھے۔\n(امام نسائیؒ نے کہا کہ) ان لوگوں نے عبداللہ بن شداد کی عبداللہ بن عباس رضی اللہ عنہ سے بیان کردہ روایت سے دلیل پکڑی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;