var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا الْقَوَارِيرِيُّ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ سَمِعْتُ ابْنَ شُبْرُمَةَ يَذْكُرُهُ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ عَنْ ابْنِ عَبَّاسٍ قَالَ حُرِّمَتْ الْخَمْرُ قَلِيلُهَا وَكَثِيرُهَا وَالسُّكْرُ مِنْ كُلِّ شَرَابٍ ابْنُ شُبْرُمَةَ لَمْ يَسْمَعْهُ مِنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ نے فرمایا کہ خمر (شراب) تو قلیل بھی حرام ہے اور کثیر بھی جبکہ دوسرے مشروبات سے نشہ آور(حرام ہیں)۔\nابن شبرمہ نے یہ حدیث عبداللہ بن شداد سے نہیں سنی۔";
nasai.hukam = "صحیح";
nasai.description = ``;