var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ سُفْيَانَ عَنْ أَبِي الْجُوَيْرِيَةِ الْجَرْمِيِّ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ عَنْ الْبَاذَقِ فَقَالَ سَبَقَ مُحَمَّدٌ الْبَاذَقَ وَمَا أَسْكَرَ فَهُوَ حَرَامٌ قَالَ أَنَا أَوَّلُ الْعَرَبِ سَأَلَهُ";
nasai.urdu = "حضرت ابوالجویریہ جرمی سے روایت ہے کہ حضرت ابن عباس رضی اللہ عنہ کعبہ شریف سے ٹیک لگائے بیٹھے تھے کہ میں نے ان سے باذق کے بارے میں سوال کیا تو انھوں نے فرمایا حضرت محمدﷺ باذق(شراب) سے پہلے تشریف لے گئے (لیکن آپ کا فرمان موجود ہے) ہر نشہ آور مشروب حرام ہے۔ابوالجویریہ نے کہا کہ میں پہلا عربی تھا جس نے ان سے باذق کے بارے میں پوچھا۔";
nasai.hukam = "حسن";
nasai.description = ``;