var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ عَنْ أَبِي مُعَاوِيَةَ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ قَالَ أَبُو عَبْد الرَّحْمَنِ عَبْدُ الْمَلِكِ بْنُ نَافِعٍ لَيْسَ بِالْمَشْهُورِ وَلَا يُحْتَجُّ بِحَدِيثِهِ وَالْمَشْهُورُ عَنْ ابْنِ عُمَرَ خِلَافُ حِكَايَتِهِ";
nasai.urdu = "(ایک دوسری سند سے) حضرت ابن عمر رضی اللہ عنہ نے نبی اکرم ﷺ سے ایسی ہی روایت نقل کی فرمائی ہے۔\nابو عبدالرحمٰن (امام نسائیؒ) نے کہا کہ اس روایت کا راوی عبدالمالک بن نافع مشہور نہیں اور نہ اس کی حدیث قابل احتجاج ہے جب کہ حجرت ابن عمر رضی اللہ عنہ سے منقول مشہور روایات اس روایت کے خلاف ہیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>عبدالملک بن نافع: مجہول (تقریب: 4224) وضعفہ ابن معین وغیرہ وضعفہ راجح۔`;
nasai.anwaar = [367,1];