var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا عَوْفٌ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ ثُمَّ يَتَوَضَّأُ مِنْهُ قَالَ عَوْفٌ وَقَالَ خِلَاسٌ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’تم میں سے کوئی شخص کھڑے پانی میں پیشاب قطعاً نہ کرے (ہوسکتا ہے) کہ پھر بعد میں اس سے وضو کرلے۔‘‘ راویٔ حدیث عوف نے کہا: خلاس نے بھی حضرت ابوہریرہ رضی اللہ عنہ سے ایسی روایت بیان کی ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;