var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ شَبِيبًا وَهُوَ ابْنُ عَبْدِ الْمَلِكِ يَقُولُ حَدَّثَنِي مُقَاتِلُ بْنُ حَيَّانَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَرَّمَ اللَّهُ الْخَمْرَ وَكُلُّ مُسْكِرٍ حَرَامٌ";
nasai.urdu = "حجرت عبداللہ (ابن عمر) رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا اللہ تعالی نے شراب کو حرام قرار دیا ہے اور (یاد رکھو)ہر نشہ آور چیز حرام ہے";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;