var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ السَّرِيِّ بْنِ يَحْيَى قَالَ حَدَّثَنَا أَبُو حَفْصٍ إِمَامٌ لَنَا وَكَانَ مِنْ أَسْنَانِ الْحَسَنِ عَنْ أَبِي رَافِعٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ إِذَا خَشِيتُمْ مِنْ نَبِيذٍ شِدَّتَهُ فَاكْسِرُوهُ بِالْمَاءِ قَالَ عَبْدُ اللَّهِ مِنْ قَبْلِ أَنْ يَشْتَدَّ";
nasai.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ نے فرمایا جب تمھیں نبیذ میں تیزی اور جوش کاخطرہ ہو تو اس کی تیزی کو پانی سے توڑلیا کرو۔\n(راوی حدیث) عبداللہ نے کہا (یعنی) اس کی تیزی سے پہلے (پانی ملاؤ۔تیزی کے بعد نہیں کیونکہ پھر تونشہ پیدا ہوچکا)";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أبو حفص: مجہول (تقریب: 8056) ومع ذلک حسنہ ابن کثیر في مسند الفاروق (2/ 515،516)!`;
nasai.anwaar = [367,1];