var nasai = {};
nasai.arabic = "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ تَلَقَّتْ ثَقِيفٌ عُمَرَ بِشَرَابٍ فَدَعَا بِهِ فَلَمَّا قَرَّبَهُ إِلَى فِيهِ كَرِهَهُ فَدَعَا بِهِ فَكَسَرَهُ بِالْمَاءِ فَقَالَ هَكَذَا فَافْعَلُوا";
nasai.urdu = "حضرت سعید بن مسیب سے روایت ہے کہ بنو ثقیف نے حضرت عمر رضی اللہ عنہ کو ایک مشروب پیش کیا۔آپ نے منگوا کر جب اسے منہ کے قریب کیا تو اسے نا پسند فرمایا۔پھر پانی ملا کر اس کی تیزی توڑی اور فرمایا اس قسم کے مشروب کو ایسے کرلیا کرو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن۔`;
nasai.anwaar = [367,1];