var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ عُتْبَةَ بْنِ فَرْقَدٍ قَالَ كَانَ النَّبِيذُ الَّذِي يَشْرَبُهُ عُمَرُ بْنُ الْخَطَّابِ قَدْ خُلِّلَ وَمِمَّا يَدُلُّ عَلَى صِحَّةِ هَذَا حَدِيثُ السَّائِبِ";
nasai.urdu = "حضرت عقبہ بن فرقد سے روایت ہے انھوں نے کہا کہ جو نبیذ حضرت عمر بن خطاب نوش فرمایا کرتے تھے وہ سرکہ کی طرح ترش ہوتا تھا۔\nاس روایت کی صحت پر حضرت سائب کی آئندہ روایت بھی دلالت کرتی ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>إسماعیل بن أبي خالد عنعن۔`;
nasai.anwaar = [367,1];