var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي الْحَوْرَاءِ السَّعْديِّ قَالَ قُلْتُ لِلْحَسَنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا مَا حَفِظْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَفِظْتُ مِنْهُ دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ";
nasai.urdu = "حضرت انوالحوراء سعدی سے روایت ہے انھوں نے کہا کہ میں نے حضرت حسن بن علی رضی اللہ عنہ سے کہا کہ آپ نے رسول اللہ ﷺ سے کوئی فرمان یاد رکھا ہے انھوں نے کہا کہ میں نے آپ کا یہ فرمان یاد رکھا ہے مشکوک اور مشتبہ چیز کو چھوڑ کر وہ اختیار کرو جو مشتبہ نہ ہو۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;