var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ مَنْصُورًا عَنْ إِبْرَاهِيمَ عَنْ نُبَاتَةَ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ كَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى بَعْضِ عُمَّالِهِ أَنْ ارْزُقْ الْمُسْلِمِينَ مِنْ الطِّلَاءِ مَا ذَهَبَ ثُلُثَاهُ وَبَقِيَ ثُلُثُهُ";
nasai.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ نے اپنے ایک گورنر کو خط لکھا کہ مسلمانوں کو وہ طلاء پینے دو جس میں دو تہائی جوس خشک ہو چکا ہو اور ایک تہائی باقی رہ گیا ہو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>إبراہیم النخعي مدلس وعنعن۔`;
nasai.anwaar = [367,2];