var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ قَالَ أَخْبَرَنِي أَبِي قَالَ أَخْبَرَنِي ابْنُ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا طَلَعَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلَاةَ حَتَّى تُشْرِقَ وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلَاةَ حَتَّى تَغْرُبَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ اللہ کے رسول ﷺ نے فرمایا: ’’جب سورج کی ٹکیہ طلوع ہونے لگے تو نماز مؤخر کردو حتیٰ کہ خوب روشن ہوجائے اور جب سورج کی ٹکیہ غروب ہونے لگے تو نماز مؤخر کردو حتیٰ کہ غروب ہوجائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;