var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ قَالَ كَتَبَ إِلَيْنَا عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَمَّا بَعْدُ فَاطْبُخُوا شَرَابَكُمْ حَتَّى يَذْهَبَ مِنْهُ نَصِيبُ الشَّيْطَانِ فَإِنَّ لَهُ اثْنَيْنِ وَلَكُمْ وَاحِدٌ";
nasai.urdu = "حضر ت عبداللہ بن یزید خطمی سے روایت ہے انھوں نے کہا کہ حضرت عمر بن خطاب رضی اللہ عنہ نے ہم کو لکھا حمد وصلوۃ کے بعد تم انگور کے جوس کو اتنا پکاؤ کہ اس میں سے شیطان کا حصہ ہوجائے۔دو حصے اس کے ہیں ایک حصہ تمھارا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ہشام بن حسان مدلس وعنعن۔`;
nasai.anwaar = [368,1];