var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ جَرِيرٍ عَنْ مُغِيرَةَ عَنْ الشَّعْبِيِّ قَالَ كَانَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يَرْزُقُ النَّاسَ الطِّلَاءَ يَقَعُ فِيهِ الذُّبَابُ وَلَا يَسْتَطِيعُ أَنْ يَخْرُجَ مِنْهُ";
nasai.urdu = "حضرت شعبی سے روایت ہے انھوں نے کہاکہ حضرت علی رضی اللہ عنہ لوگوں کو وہ طلاء پینے دیتے تھے جس میں اگر مکھی گرجاتی تو نکل نہیں سکتی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>مغیرۃ بن مقسم عنعن۔`;
nasai.anwaar = [368,1];