var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ قَالَ سَأَلْتُ سَعِيدًا مَا الشَّرَابُ الَّذِي أَحَلَّهُ عُمَرُ رَضِيَ اللَّهُ عَنْهُ قَالَ الَّذِي يُطْبَخُ حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى ثُلُثُهُ";
nasai.urdu = "حضرت داود سے روایت ہے انھوں نے کہا کہ میں نے حجرت سعید بن مسیب سے پوچھا وہ کون سا مشروب تھا جسے حضرت عمر رضی اللہ عنہ نے حلال قراردیا تھا انھوں نے فرمایا جسے اتنا پکایا جائے کہ وہ دو تہائی خشک ہوجائے اور ایک تہائی رہ جائے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;