var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ يَعْلَى بْنِ عَطَاءٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ وَسَأَلَهُ أَعْرَابِيٌّ عَنْ شَرَابٍ يُطْبَخُ عَلَى النِّصْفِ فَقَالَ لَا حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى الثُّلُثُ";
nasai.urdu = "حضرت یعلیٰ بن عطاء سے روایت ہے کہ ایک اعرابی نے حضرت سعید بن مسیب سے اس مشروب کے بارے میں پوچھا جو نصف خشک ہوچکا ہو تو میں نے ان کو فرماتے سنا نہیں حتی ٰ کہ دو تہائی خشک ہوجائے اور ایک تہائی باقی رہ جائے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن۔<br>والحدیث الآتي (الأصل: 5726) یغني عنہ۔`;
nasai.anwaar = [368,1];