var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ عَنْ أَنَسِ بْنِ سِيرِينَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ إِنَّ نُوحًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَازَعَهُ الشَّيْطَانُ فِي عُودِ الْكَرْمِ فَقَالَ هَذَا لِي وَقَالَ هَذَا لِي فَاصْطَلَحَا عَلَى أَنَّ لِنُوحٍ ثُلُثَهَا وَلِلشَّيْطَانِ ثُلُثَيْهَا";
nasai.urdu = "حضرت انس بن سیرین سے روایت ہے کہ میں نے حضرت انس بن مالک رضی اللہ عنہ کو فرماتے سنا کہ حضرت نوح علیہ السلام سے شیطان نے انگور کی بیل کے بارے میں جھگڑا کیا۔انھوں نے فرمایا یہ میری ہے۔شیطان نے کہا یہ میری ہے۔آخر دونوں نے اس بات پر صلح کرلی کہ ایک تہائی حضرت نوح علیہ السلام کی ہوگی اور دو تہائی شیطان کی۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;