var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْمَلِكِ بْنِ طُفَيْلٍ الْجَزَرِيِّ قَالَ كَتَبَ إِلَيْنَا عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَنْ لَا تَشْرَبُوا مِنْ الطِّلَاءِ حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى ثُلُثُهُ وَكُلُّ مُسْكِرٍ حَرَامٌ";
nasai.urdu = "حضرت عبدالملک بن طفیل جزری سے روایت ہے کہ حضرت عمر بن عبدالعزیزؒ نے ہمیں لکھا کہ طلاء نہ پیو حتیٰ کہ اس میں دو تہائی خشک ہوجائے اور ایک تہائی باقی رہ جائے۔اور (یاد رکھو )ہر نشہ آور چیز حرام ہے۔(خواہ وہ طلاء ہی ہو۔)";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف<br>تقدم (5603)`;
nasai.anwaar = [368,1];