var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ جُرَيْجٍ قِرَاءَةً أَخْبَرَنِي عَطَاءٌ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ وَاللَّهِ مَا تُحِلُّ النَّارُ شَيْئًا وَلَا تُحَرِّمُهُ قَالَ ثُمَّ فَسَّرَ لِي قَوْلَهُ لَا تُحِلُّ شَيْئًا لِقَوْلِهِمْ فِي الطِّلَاءِ وَلَا تُحَرِّمُهُ الْوُضُوءُ مِمَّا مَسَّتْ النَّارُ";
nasai.urdu = "حضرت عطاء نے بتا یا کہ میں نےحضرت ابن عباس رضی اللہ عنہ کو فرماتے سنا اللہ کی قسم آگ نہ کسی چیز کو حلال کرسکتی ہے نہ حرام۔پھر حضرت عطاء نے اس قول کی تفسیر بیان کی کہ لوگ کہتے ہیں نشہ آور مشروب کو آگ پر پکاکر طلاء بنالیاجائے تو وہ حلال ہوجاتا ہے(حالانکہ یہ ممکن نہیں)۔آگ کسی چیز کو حلال نہیں کرسکتی ہے۔جس طرح آگ سے پکی ہوئی چیز سے وضو کرنے کا مسئلہ ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;