var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ وَهْبِ بْنِ الْأَجْدَعِ عَنْ عَلِيٍّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّلَاةِ بَعْدَ الْعَصْرِ إِلَّا أَنْ تَكُونَ الشَّمْسُ بَيْضَاءَ نَقِيَّةً مُرْتَفِعَةً";
nasai.urdu = "حضرت علی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے عصر کے بعد نماز پڑھنے سے منع فرمایا ہے مگر یہ کہ سورج سفید،صاف اور بلند ہو۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;