var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو دَاوُدَ الْحَرَّانِيُّ قَالَ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا مُطِيعٌ عَنْ أَبِي عُثْمَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَشْرَبُهُ مِنْ الْغَدِ وَمِنْ بَعْدِ الْغَدِ فَإِذَا كَانَ مَسَاءُ الثَّالِثَةِ فَإِنْ بَقِيَ فِي الْإِنَاءِ شَيْءٌ لَمْ يَشْرَبُوهُ أُهَرِيقَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کے لیے نبیذ بنایا جاتا تھا۔آپ اسےاگلے دن یا اس سے اگلے دن پی لیتے تھے۔جب تیسری رات کی شام ہوجاتی تو اگر برتن میں کچھ رہتا جو ابھی تک جو ابھی تک پیا نہ جا سکا ہوتاتو اسے بہادیا جاتا۔";
nasai.hukam = "صحیح";
nasai.description = ``;