var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ يَحْيَى بْنِ عُبَيْدٍ الْبَهْرَانِيِّ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنْقَعُ لَهُ الزَّبِيبُ فَيَشْرَبُهُ يَوْمَهُ وَالْغَدَ وَبَعْدَ الْغَدِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ کے لیے منقیٰ پانی میں بھگویا جاتا تو آپ اسے اس دن اگلے دن اور اس سے اگلے دن پی لیا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;