var nasai = {};
nasai.arabic = "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى عَنْ ابْنِ فُضَيْلٍ عَنْ الْأَعْمَشِ عَنْ يَحْيَى بْنِ أَبِي عُمَرَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْبَذُ لَهُ نَبِيذُ الزَّبِيبِ مِنْ اللَّيْلِ فَيَجْعَلُهُ فِي سِقَاءٍ فَيَشْرَبُهُ يَوْمَهُ ذَلِكَ وَالْغَدَ وَبَعْدَ الْغَدِ فَإِذَا كَانَ مِنْ آخِرِ الثَّالِثَةِ سَقَاهُ أَوْ شَرِبَهُ فَإِنْ أَصْبَحَ مِنْهُ شَيْءٌ أَهْرَاقَهُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ سے مروی ہے انھون نے فرمایا کہ رسول اللہ ﷺ کے لیے منقیٰ کی نبیذ رات کو بنائی جاتی۔آپ اسے مشکیزے میں بناتے۔پھر اس دن اگلے دن اوراس سے اگلے دن تک پیتے رہتے۔جب تیسری رات ہوتی تو اسے پی لیتے یا کسی کو پلادیتے اور اگر صبح تک کچھ بچی رہتی تو اسے بہادیتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;