var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ بَسَّامٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ عَنْ النَّبِيذِ قَالَ كَانَ عَلِيُّ بْنُ حُسَيْنٍ رَضِيَ اللَّهُ عَنْهُ يُنْبَذُ لَهُ مِنْ اللَّيْلِ فَيَشْرَبُهُ غُدْوَةً وَيُنْبَذُ لَهُ غُدْوَةً فَيَشْرَبُهُ مِنْ اللَّيْلِ";
nasai.urdu = "حضرت بسام رضی اللہ عنہ سے روایت ہے کہ میں نے حضرت ابو جعفر (باقر)ؒ سے نبیذ کے بارے میں پوچھاتو انھوں نے فرمایا والد (محترم) حضرت علی بن حسین (زین العابدین)ؒ کے لیے رات کے وقت نبیذ بنائی جاتی تو اسے دن کو پی لیتےاور دن کے وقت بنائی جاتی تو رات کو پی لیتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;