var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ وَلَيْسَ بِالنَّهْدِيِّ أَنَّ أُمَّ الْفَضْلِ أَرْسَلَتْ إِلَى أَنَسِ بْنِ مَالِكٍ تَسْأَلُهُ عَنْ نَبِيذِ الْجَرِّ فَحَدَّثَهَا عَنْ النَّضْرِ ابْنِهِ أَنَّهُ كَانَ يَنْبِذُ فِي جَرٍّ يُنْبَذُ غَدْوَةً وَيَشْرَبُهُ عَشِيَّةً";
nasai.urdu = "حضرت ام الفضل نے حضرت انس بن مالک رضی اللہ عنہ کو پیغام بھیجا اور مٹکے کی نبیذ کے بارے میں پوچھا تو انھوں نے اسے اپنے بیٹے نضر کے بارے میں بیان فرمایا کہ وہ مٹکے میں نبیذ بناتا ہے۔صبح نبیذ بناتا ہے تو شام کو پی لیتا ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>أبو عثمان: مجہول (التحریر: 8240)`;
nasai.anwaar = [368,1];