var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَكْرَهُ أَنْ يَجْعَلَ نَطْلَ النَّبِيذِ فِي النَّبِيذِ لِيَشْتَدَّ بِالنَّطْلِ";
nasai.urdu = "حضرت سعید بن مسیب کے بارے میں روایت ہے کہ وہ اس بات کو ناپسند فرماتے تھےکہ سابقہ نبیذ کی تلچھٹ کو نئی نبیذ میں شامل کیا جائے تاکہ اس میں تیزی پیدا ہو۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>قتادۃ عنعن۔`;
nasai.anwaar = [368,2];