var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ إِنَّمَا سُمِّيَتْ الْخَمْرُ لِأَنَّهَا تُرِكَتْ حَتَّى مَضَى صَفْوُهَا وَبَقِيَ كَدَرُهَا وَكَانَ يَكْرَهُ كُلَّ شَيْءٍ يُنْبَذُ عَلَى عَكَرٍ";
nasai.urdu = "حضرت سعید بن مسیب نے فرمایا شراب کو شراب اس لیے کہا جاتا ہے کہ اسے رکھا جاتا ہے۔حتیٰ کہ جب صاف صاف (جوس) ختم ہوجاتا ہے اور نیچے میل کچیل اور تلچھٹ باقی رہ جاتی ہے(تواسے استعمال کیا جاتا ہے(اس لیے) وہ ہر اس نبیذ کو ناپسند فرماتے تھے جس میں تلچھت شامل کی جائے";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;