var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ أَبِي عَوَانَةَ عَنْ أَبِي مِسْكِينٍ قَالَ سَأَلْتُ إِبْرَاهِيمَ قُلْتُ إِنَّا نَأْخُذُ دُرْدِيَّ الْخَمْرِ أَوْ الطِّلَاءِ فَنُنَظِّفُهُ ثُمَّ نَنْقَعُ فِيهِ الزَّبِيبَ ثَلَاثًا ثُمَّ نُصَفِّيهِ ثُمَّ نَدَعُهُ حَتَّى يَبْلُغَ فَنَشْرَبُهُ قَالَ يُكْرَهُ";
nasai.urdu = "حضرت ابو مسکین سے روایت ہے انھوں نے کہا کہ میں نے حضرت ابراہیم نخعی سے پوچھا کہ ہم شراب یا طلاء کی باقی ماندہ تلچھٹ کو لیکر اسے صاف کرتے ہیں پھر اس میں منقیٰ بھگو کر تین د ن تک پڑا رہنے دیتے ہیں پھر اسے صاف کرکے چھوڑتے ہیں حتی کہ وہ تیار ہوجاتی ہے پھر ہم اسے پی لیتے ہیں۔(کیا یہ درست ہے ) انھوں نے کاہ کہ مکروہ اور ناجائز ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;