var nasai = {};
nasai.arabic = "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ كَانَ لِأُمِّ سُلَيْمٍ قَدَحٌ مِنْ عَيْدَانٍ فَقَالَتْ سَقَيْتُ فِيهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلَّ الشَّرَابِ الْمَاءَ وَالْعَسَلَ وَاللَّبَنَ وَالنَّبِيذَ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے انھوں نے فرمایا ( یری والدہ محترمہ) حضرت ام سلیم رضی اللہ عنہ کے پاس لکڑی کا ایک پیالہ تھا جس کے بارے میں وہ فرمایا کرتی تھیں کہ میں نے اس پیالے میں رسول اللہ ﷺ کو ہر قسم کا مشروب پلایا ہے پانی بھی شہد بھی دودھ بھی اور نبیذ بھی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;