var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ ذَرِّ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ قَالَ سَأَلْتُ أُبَيَّ بْنَ كَعْبٍ عَنْ النَّبِيذِ فَقَالَ اشْرَبْ الْمَاءَ وَاشْرَبْ الْعَسَلَ وَاشْرَبْ السَّوِيقَ وَاشْرَبْ اللَّبَنَ الَّذِي نُجِعْتَ بِهِ فَعَاوَدْتُهُ فَقَالَ الْخَمْرَ تُرِيدُ الْخَمْرَ تُرِيدُ";
nasai.urdu = "حضرت عبدالرحمٰن بن ابزیٰ سے روایت ہے کہ میں نے حضرت ابی بن کعب رضی اللہ عنہ سے نبیذ کے بارے میں پوچھا تو انھوں نے فرمایا پانی پی شہد پی ستو پی اور دودھ پی جس کے ساتھ تیری پرورش ہوئی تھی۔میں نے دوبارہ سوال کیا تو (غصے سے) فرمانے لگے تو شراب پینا چاہتا ہے تو شراب پینا چاہتا ہے";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن۔`;
nasai.anwaar = [369,1];