var nasai = {};
nasai.arabic = "أَخْبَرَنِي أَحْمَدُ بْنُ عَلِيِّ بْنِ سَعِيدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ مُحَمَّدٍ عَنْ عَبِيدَةَ عَنْ ابْنِ مَسْعُودٍ قَالَ أَحْدَثَ النَّاسُ أَشْرِبَةً مَا أَدْرِي مَا هِيَ فَمَا لِي شَرَابٌ مُنْذُ عِشْرِينَ سَنَةً أَوْ قَالَ أَرْبَعِينَ سَنَةً إِلَّا الْمَاءُ وَالسَّوِيقُ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ النَّبِيذَ";
nasai.urdu = "حضرت (عبداللہ)ابن مسعود رضی اللہ عنہ نے فرمایا اب لوگوں نے کئی قسم کے مشروب ایجاد کرلیے ہیں۔میں نہیں جانتا وہ کیا اور کیسے ہیں بیس یا چالیس سال ہوگئے ہیں کہ میں نے پانی یا ستو کے علاوہ کوئی اور مشروب نہیں پیا۔انھوں نے نبیذ کا ذکر نہیں فرمایا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سلیمان التیمي عنعن۔`;
nasai.anwaar = [369,1];