var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبِيدَةَ قَالَ أَحْدَثَ النَّاسُ أَشْرِبَةً مَا أَدْرِي مَا هِيَ وَمَا لِي شَرَابٌ مُنْذُ عِشْرِينَ سَنَةً إِلَّا الْمَاءُ وَاللَّبَنُ وَالْعَسَلُ";
nasai.urdu = "حضرت عبیدہ (سلمانی) نے فرمایا کہ لوگوں نے بے شمار مشروب بنالیے ہیں۔میں نہیں جانتا وہ کون کون سے اور کیسے ہیں میری حالت تو یہ ہے کہ بیس سال گزرچکے ہیں میرے پاس پانی دودھ اور شہد کے علاوہ کوئی اور مشروب نہیں ہوتا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;