var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدِ بْنِ الْحَارِثِ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ مَسْرُوقًا وَالْأَسْوَدَ قَالَا نَشْهَدُ عَلَى عَائِشَةَ أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ عِنْدِي بَعْدَ الْعَصْرِ صَلَّاهُمَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ جب بھی عصر کی نماز کے بعد میرے پاس ہوتے تو یہ دو رکعتیں ضرور پڑھتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;