var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ صَلَاتَانِ مَا تَرَكَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي سِرًّا وَلَا عَلَانِيَةً رَكْعَتَانِ قَبْلَ الْفَجْرِ وَرَكْعَتَانِ بَعْدَ الْعَصْرِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ دونمازیں اللہ کے رسول ﷺ نے میرے گھر میں کبھی نہیں چھوڑیں،خفیہ نہ علانیہ۔فجر سے قبل دو رکعتیں اور عصر کے بعد دورکعتیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;