var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ يَحْيَى بْنِ عَتِيقٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ ثُمَّ يَغْتَسِلُ مِنْهُ قَالَ أَبُو عَبْد الرَّحْمَنِ كَانَ يَعْقُوبُ لَا يُحَدِّثُ بِهَذَا الْحَدِيثِ إِلَّا بِدِينَارٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’تم میں سے کوئی ٹھہرے پانی میں بالکل پیشاب نہ کرے (ہوسکتا ہے) کہ پھر بعد میں اس سے غسل کرے۔‘‘ ابو عبدالرحمٰن (امام نسائی) رحمہ اللہ نے فرمایا: (میرے استاذ) یعقوب بن ابراہیم یہ حدیث دینار لیے بغیر بیان نہیں کرتے تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;