var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ شُغِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّكْعَتَيْنِ قَبْلَ الْعَصْرِ فَصَلَّاهُمَا بَعْدَ الْعَصْرِ";
nasai.urdu = "حضرت ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کے رسول ﷺ (ایک دن) عصر سے پہلے (ظہر کے بعد) کی دو رکعتوں سے مصروف رہے تو آپ نے انھیں عصر کے بعد ادا فرمایا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;