var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ زِيْدِ بْنِ مُحَمَّدٍ قَالَ سَمِعْتُ نَافِعًا يُحَدِّثُ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا طَلَعَ الْفَجْرُ لَا يُصَلِّي إِلَّا رَكْعَتَيْنِ خَفِيفَتَيْنِ";
nasai.urdu = "حضرت حفصہ رضی اللہ عنہا فرماتی ہیں کہ جب فجر طلوع ہوجاتی تو رسول اللہ ﷺ صرف دو ہلکی رکعتیں پڑھتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;