var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ مِنْ أَبِي الزُّبَيْرِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ بَابَاهَ يُحَدِّثُ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا بَنِي عَبْدِ مَنَافٍ لَا تَمْنَعُوا أَحَدًا طَافَ بِهَذَا الْبَيْتِ وَصَلَّى أَيَّةَ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ";
nasai.urdu = "حضرت جبیر بن مطعم رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’اے بنی عبدمناف! تم کسی کو نہ روکو جو اس گھر کا طواف کرے اور نماز پڑھے،دن یا رات کے جس وقت میں چاہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;