var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مُفَضَّلٌ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا فَإِنْ زَاغَتْ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب سورج ڈھلنے سے پہلے سفر شروع کرتے تو ظہر کی نماز کو عصر کے وقت تک مؤخر کرتے،پھر اترتے اور دونوں کو اکٹھا کرتے اور اگر سفر شروع کرنے سے قبل سورج ڈھل جاتا تو ظہر کی نماز پڑھ کر سواری فرماتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;