var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ ثَمَانِيًا جَمِيعًا وَسَبْعًا جَمِيعًا أَخَّرَ الظُّهْرَ وَعَجَّلَ الْعَصْرَ وَأَخَّرَ الْمَغْرِبَ وَعَجَّلَ الْعِشَاءَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ میں نے نبی ﷺ کے ساتھ مدینہ منورہ میں آٹھ رکعتیں اکٹھی اور سات رکعتیں اکٹھی پڑھیں۔آپ نے ظہر کو مؤخر کیا اور عصر کو جلدی پڑھا،اسی طرح مغرب کو مؤخر کیا اور عشاء کو جلدی پڑھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;