var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ ابْنِ أَبِي حَمْزَةَ ح وَأَنْبَأَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عُثْمَانُ وَاللَّفْظُ لَهُ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي سَالِمٌ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَجِلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ صَلَاةَ الْمَغْرِبِ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ جب آپ کو سفر میں چلنے کی جلدی ہوتی تو مغرب کی نماز کو مؤخر کرتے حتیٰ کہ اسے اور عشاء کی نماز کو اکٹھا پڑھتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;