var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْمُؤَمَّلُ بْنُ إِهَابٍ قَالَ حَدَّثَنِي يَحْيَى بْنُ مُحَمَّدٍ الْجَارِيُّ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ غَابَتْ الشَّمْسُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَجَمَعَ بَيْنَ الصَّلَاتَيْنِ بِسَرِفَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ سورج غروب ہوا تو رسول اللہ ﷺ مکہ مکرمہ میں تھے مگر آپ نے دونوں نمازیں (مقامِ) سرف میں جمع کیں۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (1215)`;
nasai.anwaar = [324,1];