var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنَا جَابِرُ بْنُ إِسْمَعِيلَ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا عَجِلَ بِهِ السَّيْرُ يُؤَخِّرُ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ فَيَجْمَعُ بَيْنَهُمَا وَيُؤَخِّرُ الْمَغْرِبَ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ حَتَّى يَغِيبَ الشَّفَقُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کو جب چلنے کی جدلی ہوتی تو آپ ظہر کی نماز کو عصر کے وقت تک مؤخر کرتے،پھر دونوں کو اکٹھا پڑھتے۔اسی طرح مغرب کی نماز کو مؤخر کرتے حتیٰ کہ جب سرخی غائب ہوجاتی اسے اور عشاء کی نماز کو اکٹھا پڑھتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;