var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَدَّ بِهِ السَّيْرُ أَوْ حَزَبَهُ أَمْرٌ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ جب رسول اللہ ﷺ کو چلنے کی جلدی ہوتی یا کوئی مسئلہ آپ کو بے چین کرتا تو آپ مغرب اور عشاء کو جمع فرماتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = `یہ حدیث غریب ہے`;