var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ وَالْعَصْرَ جَمِيعًا وَالْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا مِنْ غَيْرِ خَوْفٍ وَلَا سَفَرٍ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے بغیر کسی خوف اور سفر کے ظہر اور عصر کی نمازیں اکٹھی پڑھیں،اسی طرح مغرب اور عشاء کی نمازیں بھی اکٹھی پڑھیں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;