var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ وَاسْمُهُ غَزْوَانُ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِالْمَدِينَةِ يَجْمَعُ بَيْنَ الصَّلَاتَيْنِ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ مِنْ غَيْرِ خَوْفٍ وَلَا مَطَرٍ قِيلَ لَهُ لِمَ قَالَ لِئَلَّا يَكُونَ عَلَى أُمَّتِهِ حَرَجٌ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے مدینہ منورہ میں ظہر وعصر اور مغرب و عشاء بغیر کسی خوف اور بارش کے اکٹھی کرکے پڑھیں۔کہا گیا: کیوں؟ انھوں نے فرمایا: تاکہ آپ کی امت پر تنگی نہ ہو۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;