var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ أَنَّ أَبَا أَيُّوبَ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا";
nasai.urdu = "حضرت ابوایوب انصاری رضی اللہ عنہ فرماتے ہیں: میں نے حجۃ الوداع کے موقع پر مزدلفہ میں رسول اللہ ﷺ کے ساتھ مغرب اور عشاء کی نمازیں ملا کر پڑھیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;