var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ كُنْتُ مَعَ ابْنِ عُمَرَ حَيْثُ أَفَاضَ مِنْ عَرَفَاتٍ فَلَمَّا أَتَى جَمْعًا جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ فَلَمَّا فَرَغَ قَالَ فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَكَانِ مِثْلَ هَذَا";
nasai.urdu = "حضرت سعید بن جبیر فرماتے ہیں کہ میں حضرت عبداللہ بن عمر رضی اللہ عنہما کے ساتھ تھا جب وہ عرفات سے واپس لوٹے اور جب وہ مزدلفہ آئے تو انھوں نے مغرب اور عشاء کو جمع کیا۔جب فارغ ہوئے تو فرمایا: اللہ کے رسول ﷺ نے اس مقام پر ایسے ہی کیا تھا،یعنی یہ دونمازیں اکٹھی پڑھی تھیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;