var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَ مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ صَلَاتَيْنِ إِلَّا بِجَمْعٍ وَصَلَّى الصُّبْحَ يَوْمَئِذٍ قَبْلَ وَقْتِهَا";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو کبھی دو نمازیں جمع کرکے پڑھتے نہیں دیکھا مگر مزدلفہ میں۔آپ نے اس دن صبح کی نماز (اپنے معمول کے) وقت سے پہلے پڑھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;