var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ وَنَقِّ قَلْبِي مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی ﷺ یہ دعا پڑھا کرتے تھے: [اللھم! اغسل خطایای…… من الدنس] ’’اے اللہ! میری غلطیوں کو برف کے پانی اور اولوں سے دھو دے اور میرے دل کو غلطیوں سے یوں پاک فرما دے جیسے تو نے سفید کپڑا میل کچیل سے صاف رکھا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;