var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ النَّخَعِيُّ سَمِعَهُ مِنْ أَبِي عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ عَزَّ وَجَلَّ قَالَ إِقَامُ الصَّلَاةِ لِوَقْتِهَا";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے پوچھا: کون سا عمل اللہ تعالیٰ کو زیادہ پسند ہے؟ آپ نے فرمایا: ’’وقت پر نماز قائم کرنا،والدین سے حسن سلوک کرنا اور اللہ عزوجل کے راستے میں جہاد کرنا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;