var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ يَزِيدَ قَالَ حَدَّثَنَا حَجَّاجٌ الْأَحْوَلُ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يَرْقُدُ عَنْ الصَّلَاةِ أَوْ يَغْفُلُ عَنْهَا قَالَ كَفَّارَتُهَا أَنْ يُصَلِّيَهَا إِذَا ذَكَرَهَا";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ سے اس آدمی کے بارے میں پوچھا گیا جو نماز سے سویا رہتا ہے یا غافل ہوجاتا ہے (بھول جاتا ہے)۔آپ نے فرمایا: ’’اس کا کفارہ یہ ہے کہ جب اسے یاد آئے،نماز پڑھ لے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;