var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ قَالَ ذَكَرُوا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَوْمَهُمْ عَنْ الصَّلَاةِ فَقَالَ إِنَّهُ لَيْسَ فِي النَّوْمِ تَفْرِيطٌ إِنَّمَا التَّفْرِيطُ فِي الْيَقَظَةِ فَإِذَا نَسِيَ أَحَدُكُمْ صَلَاةً أَوْ نَامَ عَنْهَا فَلْيُصَلِّهَا إِذَا ذَكَرَهَا";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے منقول ہے کہ صحابہ نے نبی ﷺ سے ذکر کیا کہ کبھی ہم نماز سے سوئے رہتے ہیں۔آپ نے فرمایا: ’’نیند ااجانے میں قصور اور کوتاہی نہیں۔کوتاہی تو یہ ہے کہ آدمی جاگتا ہوا نماز نہ پڑھے،چنانچہ جب تم میں سے کوئی بھول جائے یا اس سے سویا رہ جائے تو جب اسے یاد آئے (یا جاگے) تو اسی وقت نماز پڑھ لے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;