var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ الْمُبَارَكِ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِي النَّوْمِ تَفْرِيطٌ إِنَّمَا التَّفْرِيطُ فِيمَنْ لَمْ يُصَلِّ الصَّلَاةَ حَتَّى يَجِيءَ وَقْتُ الصَّلَاةِ الْأُخْرَى حِينَ يَنْتَبِهُ لَهَا";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’نیند آجانے میں کوتاہی نہیں۔کوتاہی تو اس شخص میں ہے جس نے اگلی نماز کا وقت آنے تک نماز نہ پڑھی،حالانکہ وہ جاگ رہا تھا۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;