var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا نَامُوا عَنْ الصَّلَاةِ حَتَّى طَلَعَتْ الشَّمْسُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيُصَلِّهَا أَحَدُكُمْ مِنْ الْغَدِ لِوَقْتِهَا";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ جب صحابہ صبح کی نماز سے سوئے رہ گئے تھے حتیٰ کہ سورج طلوع ہوگیا تھا تو اللہ کے رسول ﷺ نے فرمایا تھا کہ کل تم یہ نماز اس کے وقت پر پڑھنا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;