var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا فَإِنَّ اللَّهَ تَعَالَى قَالَ أَقِمْ الصَّلَاةَ لِذِكْرِي";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص نماز بھول جائے تو اسے چاہیے کہ اسے یاد آنے پر پڑھ لے کیونکہ اللہ تعالیٰ نے فرمایا ہے: (واقم الصلوۃلذکری) ’’اور میری یاد آنے پر نماز پڑھو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;