var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو عَاصِمٍ قَالَ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ حَدَّثَنَا حَبِيبٌ عَنْ عَمْرِو بْنِ هَرِمٍ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَدْلَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ عَرَّسَ فَلَمْ يَسْتَيْقِظْ حَتَّى طَلَعَتْ الشَّمْسُ أَوْ بَعْضُهَا فَلَمْ يُصَلِّ حَتَّى ارْتَفَعَتْ الشَّمْسُ فَصَلَّى وَهِيَ صَلَاةُ الْوُسْطَى";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ ایک دفعہ رسول اللہ ﷺ شروع رات میں چلے،پھر آخر رات آپ نے پڑاؤ ڈالا۔آپ بروقت جاگ نہ سکے حتیٰ کہ کچھ یا سارا سورج طلوع ہوگیا،چنانچہ آپ نے فوراً نماز نہ پڑھی حتیٰ کہ سورج بلند ہوگیا تو آپ نے نماز ادا فرمائی اور یہ (نمازفجر) صلاۃ وسطیٰ ہے۔";
nasai.hukam = "ضعیف";
nasai.description = `شاذ<br>قول الراوي ’’وھي صلاۃ الوسطی‘‘ شاذ،والصواب أن صلاۃ الوسطی ھي صلاۃ العصر۔`;
nasai.anwaar = [325,1];