var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي أَبُو جَعْفَرٍ عَنْ أَبِي الْمُثَنَّى عَنْ ابْنِ عُمَرَ قَالَ كَانَ الْأَذَانُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثْنَى مَثْنَى وَالْإِقَامَةُ مَرَّةً مَرَّةً إِلَّا أَنَّكَ تَقُولُ قَدْ قَامَتْ الصَّلَاةُ قَدْ قَامَتْ الصَّلَاةُ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے مروی ہے،انھوں نے کہا: رسول اللہ ﷺ کے زمانے میں اذان کے کلمات دو دو بار تھے اور اقامت (تکبیر) کے ایک ایک بار،مگر یہ کہ تو قد قامت الصلاۃ (دو مرتبہ) کہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;