var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هَمَّامِ بْنِ يَحْيَى عَنْ عَامِرِ بْنِ عَبْدِ الْوَاحِدِ حَدَّثَنَا مَكْحُولٌ عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ عَنْ أَبِي مَحْذُورَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَذَانُ تِسْعَ عَشْرَةَ كَلِمَةً وَالْإِقَامَةُ سَبْعَ عَشْرَةَ كَلِمَةً ثُمَّ عَدَّهَا أَبُو مَحْذُورَةَ تِسْعَ عَشْرَةَ كَلِمَةً وَسَبْعَ عَشْرَةَ";
nasai.urdu = "حضرت ابو محذورہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے مجھے اذان میں انیس (۱۹) کلمات اور اقامت میں سترہ (۱۷) کلمات سکھائے،پھر ابو محذورہ رضی اللہ عنہ نے انیس (۱۹) اور سترہ (۱۷) کلمات شمار کیے۔";
nasai.hukam = "صحیح";
nasai.description = ``;