var nasai = {};
nasai.arabic = "أَخْبَرَنَا حَاجِبُ بْنُ سُلَيْمَانَ عَنْ وَكِيعٍ عَنْ سُفْيَانَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَابْنُ عَمٍّ لِي وَقَالَ مَرَّةً أُخْرَى أَنَا وَصَاحِبٌ لِي فَقَالَ إِذَا سَافَرْتُمَا فَأَذِّنَا وَأَقِيمَا وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: میں اور میرا چچا زاد بھائی اور ایک بار فرمایا: میں اور میرا ایک ساتھی نبی ﷺ کے پاس آئے۔(واپسی کے وقت) آپ نے فرمایا: ’’جب تم سفر کرو تو اذان و اقامت کہا کرو اور (جماعت کے وقت) تم میں سے بڑا اقامت کرائے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;