var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُؤَذِّنُ بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے منقول ہے کہ اللہ کے رسول ﷺ نے فرمایا: ’’تحقیق بلال () رات کو اذان کہتے ہیں،لہٰذا تم کھاتے پیتے رہنا حتی کہ عبداللہ بن ام مکتوم رضی اللہ عنہ اذان کہیں۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;