var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَفْصٌ عَنْ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَذَّنَ بِلَالٌ فَكُلُوا وَاشْرَبُوا حَتَّى يُؤَذِّنَ ابْنُ أُمِّ مَكْتُومٍ قَالَتْ وَلَمْ يَكُنْ بَيْنَهُمَا إِلَّا أَنْ يَنْزِلَ هَذَا وَيَصْعَدَ هَذَا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب بلال اذان کہیں تو کھاتے پیتے رہو حتیٰ کہ ابن ام مکتوم اذان دیں۔‘‘ اور ان دونوں اذانوں کے درمیان صرف اتنا فاصلہ ہوتا تھا کہ ایک اترتا اور دوسرا چڑھ جاتا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;