var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ هُشَيْمٍ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمَّتِهِ أُنَيْسَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَذَّنَ ابْنُ أُمِّ مَكْتُومٍ فَكُلُوا وَاشْرَبُوا وَإِذَا أَذَّنَ بِلَالٌ فَلَا تَأْكُلُوا وَلَا تَشْرَبُوا";
nasai.urdu = "حضرت انیسہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب ابن ام مکتوم اذان کہیں تو تم کھاتے پیتے رہو اور جب بلال اذان کہیں تو کھانا پینا بند کر دو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;