var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ أَبِي عُثْمَانَ عَنْ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُؤَذِّنُ بِلَيْلٍ لِيُوقِظَ نَائِمَكُمْ وَلِيَرْجِعَ قَائِمَكُمْ وَلَيْسَ أَنْ يَقُولَ هَكَذَا يَعْنِي فِي الصُّبْحِ";
nasai.urdu = "حضرت ابن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’تحقیق بلال رات کو اذان کہتے ہیں تاکہ سونے والے کو جگائیں اور قیام کرنے والے کو قیام سے لوٹائیں (تاکہ وہ کچھ آرام کرلے) اور صبح صادق ایسی نہیں ہوتی (جیسی بلال کی اذان کے وقت ہوتی ہے)۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;