var nasai = {};
nasai.arabic = "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِيهِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ بِلَالٌ فَأَذَّنَ فَجَعَلَ يَقُولُ فِي أَذَانِهِ هَكَذَا يَنْحَرِفُ يَمِينًا وَشِمَالًا";
nasai.urdu = "حضرت ابو جحیفہ رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: میں نبی ﷺ کے پاس آیاا تو بلال رضی اللہ عنہ باہر نکلے اور اذان کہی۔وہ اپنی اذان میں ایسے دائیں بائیں منہ موڑتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;