var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ أَبِي جَعْفَرٍ عَنْ أَبِي سَلْمَانَ عَنْ أَبِي مَحْذُورَةَ قَالَ كُنْتُ أُؤَذِّنُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنْتُ أَقُولُ فِي أَذَانِ الْفَجْرِ الْأَوَّلِ حَيَّ عَلَى الْفَلَاحِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ";
nasai.urdu = "حضرت ابومحذورہ رضی اللہ عنہ بیان کرتے ہیں کہ میں رسول اللہ ﷺ کے حکم سے اذان کہا کرتا تھا اور میں فجر کی پہلی اذان میں [حی علی الفلاح] کے بعد [الصلاۃ خیر من النوم،الصلاۃ خیر من النوم،اللہ أکبر اللہ أکبر،لا إلہ إلا اللہ] کہا کرتا تھا۔";
nasai.hukam = "ضعیف";
nasai.description = `[648۔649] إسنادہ ضعیف<br>أبو سلمان ہمام المؤذن مجھول الحال۔<br> وأبو جعفر مجھول لیس ھو الفراء۔<br>والحدیث السابق (634) یغني عنہ۔`;
nasai.anwaar = [325,1];