var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى وَعَبْدُ الرَّحْمَنِ قَالَا حَدَّثَنَا سُفْيَانُ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عَبْد الرَّحْمَنِ وَلَيْسَ بِأَبِي جَعْفَرٍ الْفَرَّاءِ";
nasai.urdu = "حضرت سفیان کی یہ حدیث اسی سند کے ساتھ ہمیں عمرو بن علی کے واسطے سے بھی پہنچی ہے۔امام ابو عبدالرحمٰن (نسائی) رحمہ اللہ فرماتے ہیں: (سند میں مذکور حضرت سفیان کے استاد) ابوجعفر سے،ابوجعفر فراء مراد نہیں۔";
nasai.hukam = "ضعیف";
nasai.description = `۔649] إسنادہ ضعیف<br>أبو سلمان ہمام المؤذن مجھول الحال۔<br> وأبو جعفر مجھول لیس ھو الفراء۔<br>والحدیث السابق (634) یغني عنہ۔`;
nasai.anwaar = [325,1];