var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ قَالَ كَانَ آخِرُ أَذَانِ بِلَالٍ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ مِثْلَ ذَلِكَ";
nasai.urdu = "حضرت اسود سے منقول ہے کہ حضرت بلال رضی اللہ عنہ کی اذان کے آخری کلمات [اللہ اکبر اللہ اکبر،لا إلہ إلا اللہ] تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;