var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ قَالَ كَانَ آخِرُ أَذَانِ بِلَالٍ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ مِثْلَ ذَلِكَ";
nasai.urdu = "حضرت ابراہیم نخعی کی یہ روایت اعمش کے واسطے سے بھی ہم تک پہنچی ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;