var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَمْرِو بْنِ أَوْسٍ يَقُولُ أَنْبَأَنَا رَجُلٌ مِنْ ثَقِيفٍ أَنَّهُ سَمِعَ مُنَادِيَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي فِي لَيْلَةٍ مَطِيرَةٍ فِي السَّفَرِ يَقُولُ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ صَلُّوا فِي رِحَالِكُمْ";
nasai.urdu = "بنو ثقیف کے ایک آدمی سے روایت ہے کہ اس نے دوران سفر میں بارش والی رات میں نبی ﷺ کے مؤذن کو یوں کہتے سنا: [حی علی الصلاۃ،حی علی الفلاح،صلوا فی رحالکم] یعنی ’’اپنے خیموں میں نماز پڑھ لو۔‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>رجل من ثقیف مجھول و أخطأ من صحح ھذا الحدیث۔<br>والحدیث الآتي (655) یغني عنہ۔`;
nasai.anwaar = [325,1];