var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ أَذَّنَ بِالصَّلَاةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ فَقَالَ أَلَا صَلُّوا فِي الرِّحَالِ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ ذَاتُ مَطَرٍ يَقُولُ أَلَا صَلُّوا فِي الرِّحَالِ";
nasai.urdu = "امام نافع رحمہ اللہ سے روایت ہے کہ حضرت ابن عمر رضی اللہ عنہما نے ٹھنڈی ہوا والی رات میں اذان کہی تو فرمایا: [الا صلوا فی الرحال] ’’خبردار! گھروں میں نماز پڑھ لو۔‘‘ کیونکہ نبی ﷺ مؤذن کو حکم دیتے،جب بارش والی ٹھنڈی رات ہوتی کہ وہ (اذان میں) کے: [الا صلوا فی الرحال]";
nasai.hukam = "متفق علیہ";
nasai.description = ``;