var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ دَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى انْتَهَى إِلَى الْمُزْدَلِفَةِ فَصَلَّى بِهَا الْمَغْرِبَ وَالْعِشَاءَ بِأَذَانٍ وَإِقَامَتَيْنِ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ (واپسی کے دوران میں) چلے حتی کہ مزدلفہ پہنچ گئے۔وہاں مغرب اور عشاء کی نماازیں ایک اذان اور دو اقامتوں سے پڑھیں اور ان کے درمیان نوافل نہیں پڑھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;