var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ وَسَلَمَةُ بْنُ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ أَنَّهُ صَلَّى الْمَغْرِبَ وَالْعِشَاءَ بِجَمْعٍ بِإِقَامَةٍ وَاحِدَةٍ ثُمَّ حَدَّثَ عَنْ ابْنِ عُمَرَ أَنَّهُ صَنَعَ مِثْلَ ذَلِكَ وَحَدَّثَ ابْنُ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ مِثْلَ ذَلِكَ";
nasai.urdu = "حضرت سعید بن جبیر سے مروی ہے کہ انھوں نے مزدلفہ میں مغرب اور عشاء کی نمزیں ایک اقامت سے پڑھیں،پھر انھوں نے حضرت ابن عمر رضی اللہ عنہما سے بیان کیا کہ انھوں نے ایسے ہی کیا تھا اور حضرت ابن عمر رضی اللہ عنہما نے بیان فرمایا کہ نبی ﷺ نے بھی ایسے ہی کیا";
nasai.hukam = "صحیح";
nasai.description = ``;