var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ أَبِي خَالِدٍ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ أَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَمْعٍ بِإِقَامَةٍ وَاحِدَةٍ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ انھوں نے رسول اللہ ﷺ کے ساتھ مزدلفہ میں (مغرب اور عشاء کی) نمازیں ایک اقامت کے ساتھ پڑھیں۔";
nasai.hukam = "صحیح";
nasai.description = ``;