var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ وَكِيعٍ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَهُمَا بِالْمُزْدَلِفَةِ صَلَّى كُلَّ وَاحِدَةٍ مِنْهُمَا بِإِقَامَةٍ وَلَمْ يَتَطَوَّعْ قَبْلَ وَاحِدَةٍ مِنْهُمَا وَلَا بَعْدُ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ نبی ﷺ نے مزدلفہ میں مغرب اور عشاء کی نمازیں اکٹھی پڑھی تھیں۔آپ نے ان میں سے ہر نماز الگ اقامت سے پڑھی اور ان میں کسی نماز سے بھی آگے یا پیچھے نفل نہیں پڑھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;