var nasai = {};
nasai.arabic = "أَخْبَرَنَا هَنَّادٌ عَنْ هُشَيْمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ أَبِي عُبَيْدَةَ قَالَ قَالَ عَبْدُ اللَّهِ إِنَّ الْمُشْرِكِينَ شَغَلُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَرْبَعِ صَلَوَاتٍ يَوْمَ الْخَنْدَقِ فَأَمَرَ بِلَالًا فَأَذَّنَ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ ثُمَّ أَقَامَ فَصَلَّى الْمَغْرِبَ ثُمَّ أَقَامَ فَصَلَّى الْعِشَاءَ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ تحقیق مشرکین نے نبی ﷺ کو جنگ خندق میں ایک دن چار نمازوں سے روکے رکھا۔آپ نے بلال رضی اللہ عنہ کو حکم دیا تو انھوں نے اذان کہی،پھر اقامت کہی،چنانچہ آپ نے ظہر کی نماز پڑھی،پھر اقامت کہی تو آپ نے عصر کی نماز پڑھی،پھر اقامت کہی تو آپ نے مغرب کی نماز پڑھی،پھر اقامت کہی تو آپ نے عشاء کی نماز پڑھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (623)۔<br>والحدیث السابق (662) یغنی عنہ۔`;
nasai.anwaar = [325,1];