var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا يَحْيَى بْنُ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا هُوَ جَالِسٌ فِي صَفِّ الصَّلَاةِ الْحَدِيثَ";
nasai.urdu = "حضرت رفاعہ بن رافع رضی اللہ عنہ سےروایت ہے کہ ایک دفعہ رسول اللہ ﷺ نماز کی صف میں بیٹھے ہوئے تھے…… الحدیث۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;