var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا خَالِدٌ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ مُطَرِّفًا عَنْ عَبْدِ اللَّهِ بْنِ الْمُغَفَّلِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ وَرَخَّصَ فِي كَلْبِ الصَّيْدِ وَالْغَنَمِ وَقَالَ إِذَا وَلَغَ الْكَلْبُ فِي الْإِنَاءِ فَاغْسِلُوهُ سَبْعَ مَرَّاتٍ وَعَفِّرُوهُ الثَّامِنَةَ بِالتُّرَابِ";
nasai.urdu = "حضرت عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے کتوں کے قتل کا حکم دیا،البتہ شکاری اور بکریوں کی حفاظت کے لیے کتا رکھنے کی اجازت دی۔اور آپ نے فرمایا: ’’جب کتا برتن میں منہ ڈال دے تو اسے سات دفعہ دھوؤ اور آٹھویں مرتبہ مٹی بھی ملو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;