var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِصَاحِبٍ لِي إِذَا حَضَرَتْ الصَّلَاةُ فَأَذِّنَا ثُمَّ أَقِيمَا ثُمَّ لِيَؤُمَّكُمَا أَحَدُكُمَا";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے مجھے اور میرے ساتھی کو کہا: ’’جب نماز کا وقت آئے تو تم اذان کہو،پھر اقامت کہو،پھر تم میں سے بڑا امامت کروائے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;