var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ اجْعَلْنِي إِمَامَ قَوْمِي فَقَالَ أَنْتَ إِمَامُهُمْ وَاقْتَدِ بِأَضْعَفِهِمْ وَاتَّخِذْ مُؤَذِّنًا لَا يَأْخُذُ عَلَى أَذَانِهِ أَجْرًا";
nasai.urdu = "حضرت عثمان بن ابو العاص رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ سے گزارش کی کہ آپ مجھے میری قوم کا امام مقرر فرما دیں۔آپ نے فرمایا: ’’تم ان کے امام ہو۔نماز پڑھاتے وقت ان میں سے کمزور ترین آدمی کا لحاظ رکھنا اور ایسا مؤذن رکھنا جو اپنی اذان پر تنخواہ نہ لیتا ہو۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;