var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ حَدَّثَنَا جَرِيرٌ عَنْ مِسْعَرٍ عَنْ مُجَمِّعٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ قَالَ سَمِعْتُ مُعَاوِيَةَ رَضِيَ اللَّهُ عَنْهُ يَقُولُ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَمِعَ الْمُؤَذِّنَ فَقَالَ مِثْلَ مَا قَالَ";
nasai.urdu = "حضرت معاویہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،جب کہ آپ نے مؤذن کی اذان سنی تھی،کہ آپ اس طرح فرما رہے تھے جس طرح مؤذن کہہ رہا تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;