var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ يَحْيَى عَنْ كَهْمَسٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ لِمَنْ شَاءَ";
nasai.urdu = "حضرت عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’ہر دو اذانوں (اذان و اقامت) کے درمیان (نفل) نماز ہے۔ہر دو اذانوں کے درمیان نماز ہے۔ہر دو اذانوں کے درمیان نماز ہے،اس شخص کے لیے جو پڑھنا چاہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;