var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ عُمَرَ بْنِ سَعِيدٍ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ وَمَرَّ رَجُلٌ فِي الْمَسْجِدِ بَعْدَ النِّدَاءِ حَتَّى قَطَعَهُ فَقَالَ أَبُو هُرَيْرَةَ أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت ابو شعاء سے روایت ہے کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ کو دیکھا جب کہ ایک آدمی اذان کے بعد مسجد میں سے گزرا حتیٰ کہ مسجد سے باہر نکل گیا تو حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا: اس شخص نے حضرت ابوالقاسم ﷺ کی نافرمانی کی ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;