var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ أَبِي عُمَيْسٍ قَالَ أَخْبَرَنَا أَبُو صَخْرَةَ عَنْ أَبِي الشَّعْثَاءِ قَالَ خَرَجَ رَجُلٌ مِنْ الْمَسْجِدِ بَعْدَ مَا نُودِيَ بِالصَّلَاةِ فَقَالَ أَبُو هُرَيْرَةَ أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت ابو شعناء سے منقول ہے کہ ایک آدمی نماز کی اذان کے بعد مسجد سے نکلا تو حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا: اس شخص نے ابوالقاسم ﷺ کی نافرمانی کی ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;