var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَقُومُوا حَتَّى تَرَوْنِي خَرَجْتُ";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب اقامت ہو جائے تو کھڑے نہ ہوا کرو حتی کہ مجھے آتا ہوا دیکھ لو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;