var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عَمْرِو بْنِ عَبَسَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَنَى مَسْجِدًا يُذْكَرُ اللَّهُ فِيهِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ";
nasai.urdu = "حضرت عمرو بن عبسہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جس شخص نے (اس غرض سے) مسجد بنائی کہ اس میں اللہ تعالیٰ کا ذکر کیا جائے،اللہ عزوجل جنت میں اس کا گھر بنائے گا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;