var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَنَسٍ قَالَ أَتَانَا مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَاكُمْ عَنْ لُحُومِ الْحُمُرِ فَإِنَّهَا رِجْسٌ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ہمارے پاس اللہ کے رسول ﷺ کا منادی آیا اور اس نے کہا (اعلان کیا): تحقیق اللہ تعالیٰ اور اس کا رسول تمھیں گھھریلو گدھوں کا گوشت کھانے سے روکتے ہیں کیونکہ گدھے پلید ہیں۔(یا یہ گوشت حرام ہے۔)";
nasai.hukam = "متفق علیہ";
nasai.description = ``;