var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَتَبَاهَى النَّاسُ فِي الْمَسَاجِدِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’یہ قیامت کی نشانی ہے کہ لوگ مساجد میں ایک دوسرے پر فخر کریں گے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;