var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ أَنَّ مَيْمُونَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ مَنْ صَلَّى فِي مَسْجِدِ رَسُولِ اللَّهِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصَّلَاةُ فِيهِ أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا مَسْجِدَ الْكَعْبَةِ";
nasai.urdu = "نبی ﷺ کی زوجۂ محترمہ حضرت میمونہ رضی اللہ عنہا فرماتی ہیں کہ میں نے اللہ کے رسول ﷺ کو فرماتے ہوئے سنا کہ جو شخص اس (رسول اللہ ﷺ کی) مسجد میں نماز پڑھے تو مسجد نبویؐ کی نماز دوسری مساجد کی ہزار نماز سے افضل ہے،مگر مسجد کعبہ میں نماز (مسجد نبوی سے بھی افضل ہے۔)";
nasai.hukam = "صحیح";
nasai.description = ``;