var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ ابْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ قَالَ تَمَارَى رَجُلَانِ فِي الْمَسْجِدِ الَّذِي أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ فَقَالَ رَجُلٌ هُوَ مَسْجِدُ قُبَاءَ وَقَالَ الْآخَرُ هُوَ مَسْجِدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ مَسْجِدِي هَذَا";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ دو آدمیوں کا اس مسجد کے بارے میں اختلاف ہوگیا جس کی بنیاد شروع دن سے تقویٰ پر رکھی گئی ہے۔ایک شخص نے کہا: وہ مسجد قباء ہے۔دوسرے نے کہا: وہ رسول اللہ ﷺ کی مسجد ہے۔رسول اللہ ﷺ نے فرمایا: ’’وہ میری مسجد (مسجد نبوی) ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;