var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كُنْتُ أَتَعَرَّقُ الْعَرْقَ فَيَضَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاهُ حَيْثُ وَضَعْتُ وَأَنَا حَائِضٌ وَكُنْتُ أَشْرَبُ مِنْ الْإِنَاءِ فَيَضَعُ فَاهُ حَيْثُ وَضَعْتُ وَأَنَا حَائِضٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ میں کسی ہڈی سے گوشت نوچتی تو اللہ کے رسول ﷺ اس جگہ اپنا منہ مبارک رکھتے جہاں میں نے رکھا تھا،حالانکہ میں حیض کی حالت میں ہوتی تھی۔اور میں برتن سے پانی پیتی تو اللہ کے رسول ﷺ اس جگہ اپنا منہ رکھتے تھے جہاں میں نے لگایا تھا،حالانکہ میں حیض کی حالت میں ہوتی تھی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;