var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مُجَمِّعُ بْنُ يَعْقُوبَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الْكَرْمَانِيِّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ قَالَ قَالَ أَبِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَرَجَ حَتَّى يَأْتِيَ هَذَا الْمَسْجِدَ مَسْجِدَ قُبَاءَ فَصَلَّى فِيهِ كَانَ لَهُ عَدْلَ عُمْرَةٍ";
nasai.urdu = "حضرت سہل بن حنیف رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جو آدمی (گھر سے) نکلا،حتی کہ اس مسجد،یعنی مسجد قباء میں آیا اور اس میں نماز پڑھی تو اسے ایک عمرے کے برابر ثواب ملے گا۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;