var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ وَمَسْجِدِي هَذَا وَمَسْجِدِ الْأَقْصَى";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’تین مساجد کے علاوہ کسی جگہ کی طرف دور دراز سے سواریاں کس کے نہ جایا جائے۔(اور وہ تین مسجدیں یہ ہیں): مسجد حرام،مسجد نبوی اور مسجد اقصیٰ۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;