var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ الْعَلَاءِ بْنِ جَارِيَةَ الثَّقَفِيُّ عَنْ أَبِي سَلَمَةَ هُوَ ابْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حِينَ يَخْرُجُ الرَّجُلُ مِنْ بَيْتِهِ إِلَى مَسْجِدِهِ فَرِجْلٌ تُكْتَبُ حَسَنَةً وَرِجْلٌ تَمْحُو سَيِّئَةً";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’آدمی جب اپنے گھر سے مسجد کے لیے نکلتا ہے اور قدم اٹھاتا ہے تو (ہر قدم کے لیے) ایک پاؤں اٹھانے پر نیکی لکھی جاتی ہے اور دوسرا پاؤں اٹھانے پر ایک برائی مٹائی جاتی ہے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;