var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنَا عَطَاءٌ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ قَالَ أَوَّلَ يَوْمٍ الثُّومِ ثُمَّ قَالَ الثُّومِ وَالْبَصَلِ وَالْكُرَّاثِ فَلَا يَقْرَبْنَا فِي مَسَاجِدِنَا فَإِنَّ الْمَلَائِكَةَ تَتَأَذَّى مِمَّا يَتَأَذَّى مِنْهُ الْإِنْسُ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو آدمی یہ پودا (عطاء نے) پہلے دن (حدیث بیان کرتے ہوئے) کہا: لہسن،پھر (دوسرے موقع پر) کہا: لہسن اور پیاز اور گندنا (پیازی) کھائے تو وہ ہماری مسجدوں کے قریب نہ آئے کیونکہ فرشتوں کو اس چیز سے تکلیف ہوتی ہے جس سے انسان تکلیف محسوس کرتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;