var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ أُصِيبَ سَعْدٌ يَوْمَ الْخَنْدَقِ رَمَاهُ رَجُلٌ مِنْ قُرَيْشٍ رَمْيَةً فِي الْأَكْحَلِ فَضَرَبَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْمَةً فِي الْمَسْجِدِ لِيَعُودَهُ مِنْ قَرِيبٍ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ سعد بن معاذ رضی اللہ عنہ جنگ خندق کے دن زخمی ہوگئے۔ایک قریشی آدمی (حبان بن عرقہ) نے ان کے بازو کی بڑی رگ میں تیر مارا۔رسول اللہ ﷺ نے ان کے لیے مسجد میں خیمہ لگا دیا تاکہ آپ قریب سے ان کی عیادت کرلیا کریں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;