var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْلًا قِبَلَ نَجْدٍ فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ سَيِّدُ أَهْلِ الْيَمَامَةِ فَرُبِطَ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ مُخْتَصَرٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ایک گھوڑا سوار دستہ نجد کی طرف بھیجا۔وہ قبیلۂ بنو حنیفہ کے ایک آدمی کو،جن کا نام ثمامہ بن اثال تھا،پکڑ کر لائے۔یہ یمامہ والوں کے سردار تھے۔آپ نے انھیں مسجد کے ایک ستون کے ساتھ باندھ دیا۔یہ روایت مختصر ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;