var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ";
nasai.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے حجۃ الوداع میں اونٹ پر سوار ہوکر طواف کیا۔آپ حجر اسود کو چھڑی سے چھوتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;