var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّحَلُّقِ يَوْمَ الْجُمُعَةِ قَبْلَ الصَّلَاةِ وَعَنْ الشِّرَاءِ وَالْبَيْعِ فِي الْمَسْجِدِ";
nasai.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے جمعۃ المبارک کے دن نماز جمعہ سے قبل حلقے بنانے اور مسجد میں خرید و فروخت کرنے سے منع فرمایا ہے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;