var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ أَبِي عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ جَاءَ رَجُلٌ يَنْشُدُ ضَالَّةً فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَجَدْتَ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے مروی ہے کہ ایک آدمی آیا اور مسجد میں گم شدہ جانور کا اعلان کرنے لگا،چنانچہ رسول اللہ ﷺ نے فرمایا: ’’اللہ کرے تجھے نہ ملے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;