var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ وَمُحَمَّدُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا سُفْيَانُ قَالَ قُلْتُ لِعَمْرٍو أَسَمِعْتَ جَابِرًا يَقُولُ مَرَّ رَجُلٌ بِسِهَامٍ فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ بِنِصَالِهَا قَالَ نَعَمْ";
nasai.urdu = "سفیان کہتے ہیں کہ میں نے عمرو سے پوچھا: کیا آپ نے جابر رضی اللہ عنہ کو یہ فرماتے سنا ہے کہ ایک آدمی اپنے تیر لے کر مسجد سے گزرا تو رسول اللہ ﷺ نے اس سے فرمایا: ان کو نوکوں کو ہاتھ میں پکڑ لو۔‘‘ اس نے کہا: جی ہاں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;