var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى";
nasai.urdu = "حضرت عباد بن تمیم کے چچا حضرت عبداللہ بن زید رضی اللہ عنہ سے منقول ہے کہ میں نے رسول اللہ ﷺ کو مسجد میں سیدھے (چت) لیٹے ہوئے دیکھا۔آپ نے اپنا ایک پاؤں دوسرے پاؤں ک اوپر رکھا ہوا تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;