var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يَنَامُ وَهُوَ شَابٌّ عَزْبٌ لَا أَهْلَ لَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے مروی ہے کہ وہ اللہ کے رسول ﷺ کے دور میں مسجد نبوی میں سو جایا کرتے تھے جب کہ وہ نوجوان اور غیرشادی شدہ تھے اور ان کا گھر بار نہ تھا۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;