var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى بُصَاقًا فِي جِدَارِ الْقِبْلَةِ فَحَكَّهُ ثُمَّ أَقْبَلَ عَلَى النَّاسِ فَقَالَ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَبْصُقَنَّ قِبَلَ وَجْهِهِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قِبَلَ وَجْهِهِ إِذَا صَلَّى";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے قبلے والی دیوار پر تھوک لگا کر دیکھا۔آپ نے اسے کھرچ دیا،پھر آپ لوگوں کی طرف متوجہ ہوئے اور فرمایا: ’’جب تم میں سے کوئی شخص نماز پڑھتا ہو تو وہ اپنے سامنے نہ تھوکے کیونکہ جب انسان نماز پڑھتا ہے تو اللہ عزوجل اس کے سامنے ہوتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;