var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ فَحَكَّهَا بِحَصَاةٍ وَنَهَى أَنْ يَبْصُقَ الرَّجُلُ بَيْنَ يَدَيْهِ أَوْ عَنْ يَمِينِهِ وَقَالَ يَبْصُقُ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ الْيُسْرَى";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ نے مسجد کی قبلے والی دیوار پر تھوک لگا دیکھا۔آپ نے اسے کنکری سے کھرچ دیا اور منع فرمایا کہ نمازی اپنے سامنے یا دائیں تھوکے بلکہ فرمایا: ’’وہ اپنے بائیں جانب تھوکے یا بائیں قدم کے نیچے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;