var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ رِبْعِيٍّ عَنْ طَارِقِ بْنِ عَبْدِ اللَّهِ الْمُحَارِبِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتَ تُصَلِّي فَلَا تَبْزُقَنَّ بَيْنَ يَدَيْكَ وَلَا عَنْ يَمِينِكَ وَابْصُقْ خَلْفَكَ أَوْ تِلْقَاءَ شِمَالِكَ إِنْ كَانَ فَارِغًا وَإِلَّا فَهَكَذَا وَبَزَقَ تَحْتَ رِجْلِهِ وَدَلَكَهُ";
nasai.urdu = "حضرت طارق بن عبداللہ محاربی رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تو نماز پڑھتا ہو تو اپنے سامنے یا دائیں جانب نہ تھوک۔اگر خالی جگہ ہو (نمازی نہ ہوں) تو اپنے پیچھے یا بائیں طرف تھوک ورنہ ایسے کر۔‘‘ اور آپ نے پاؤں کے نیچے تھوکا اور اسے مل دیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;