var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ جَبْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ بِمَكُّوكٍ وَيَغْتَسِلُ بِخَمْسِ مَكَاكِيَّ";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،فرماتے ہیں: اللہ کے رسول ﷺ ایک مد پانی سے وضو فرما لیا کرتے تھے اور پانچ مد کے ساتھ غسل فرما لیا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;