var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعَيْنَ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنَا اللَّيْثُ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ قَالَ أَخْبَرَنِي مَرْوَانُ بْنُ عُثْمَانَ أَنَّ عُبَيْدَ بْنَ حُنَيْنٍ أَخْبَرَهُ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى قَالَ كُنَّا نَغْدُو إِلَى السُّوقِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَمُرُّ عَلَى الْمَسْجِدِ فَنُصَلِّي فِيهِ";
nasai.urdu = "حضرت ابو سعید بن معلیٰ رضی اللہ عنہ سے منقول ہے کہ ہم رسول اللہ ﷺ کے دور میں بازار کو جاتے ہوئے مسجد کے پاس سے گزرتے تو اس میں نماز پڑھتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>مروان بن عثمان: ضعیف،ضعفہ النسائي والجمہور۔`;
nasai.anwaar = [326,1];