var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَلَائِكَةَ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلَّاهُ الَّذِي صَلَّى فِيهِ مَا لَمْ يُحْدِثْ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’تحقیق فرشتے اس شخص کے لیے دعائیں کرتے رہتے ہیں جو اس جگہ بیٹھارہتا ہے جس جگہ اس نے نماز پڑھی: اے اللہ! اسے معاف فرما،اے اللہ! اس پر رحم فرما،جب تک وہ بے وضو نہ ہو۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;