var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرُ بْنُ مُضَرَ عَنْ عَيَّاشِ بْنِ عُقْبَةَ أَنَّ يَحْيَى بْنَ مَيْمُونٍ حَدَّثَهُ قَالَ سَمِعْتُ سَهْلًا السَّاعِدِيِّ رَضِيَ اللَّهُ عَنْهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلَاةَ فَهُوَ فِي الصَّلَاةِ";
nasai.urdu = "حضرت سہل بن سعد ساعدی رضی اللہ عنہ نے کہا: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’جو شخص مسجد میں بیٹھ کر اگلی نماز کا انتظار کرتا ہے،وہ (حکماً اور ثواب کے لحاظ سے) نماز ہی میں ہوتا ہے۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;