var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَعِيلَ بْنِ سُلَيْمَانَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا سَيَّارٌ عَنْ يَزِيدَ الْفَقِيرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جُعِلَتْ لِي الْأَرْضُ مَسْجِدًا وَطَهُورًا أَيْنَمَا أَدْرَكَ رَجُلٌ مِنْ أُمَّتِي الصَّلَاةَ صَلَّى";
nasai.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’ساری زمین میرے لیے سجدہ گاہ اور ذریعۂ طہارت بنائی گئی ہے،لہٰذا میرے کسی امتی کو جہاں بھی نماز کا وقت ہو جائے،وہ وہیں نماز پڑھ لے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;