var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى رَاحِلَتِهِ فِي السَّفَرِ حَيْثُمَا تَوَجَّهَتْ قَالَ مَالِكٌ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ سفر میں اپنی سواری پر (نفل) نماز پڑھ لیا کرتے تھے۔سواری کا منہ جس طرف بھی ہوتا۔امام مالک نے کہا: (حضرت ابن عمر رضی اللہ عنہما کے شاگرد) عبداللہ بن دینار نے کہا کہ ابن عمر رضی اللہ عنہما بھی ایسے ہی کیا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;