var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الرَّاحِلَةِ قِبَلَ أَيِّ وَجْهٍ تَوَجَّهُ بِهِ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لَا يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ سواری پر (نفل) نماز پڑھ لیا کرتے تھے جس طرف بھی اس کا منہ ہوتا۔اور آپ سواری پر وتر پڑھ لیا کرتے تھے،مگر فرض نماز سواری پر نہیں پڑھتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;