var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ عَنْ سُتْرَةِ الْمُصَلِّي فَقَالَ مِثْلُ مُؤْخِرَةِ الرَّحْلِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ اللہ کے رسول ﷺ سے غزوۂ تبوک میں نمازی کے سترے کے بارے میں پوچھا گیا تو آپ نے فرمایا: ’’پالان کی پچھلی لکڑی کے برابر ہونا چاہیے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;