var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ إِلَى سُتْرَةٍ فَلْيَدْنُ مِنْهَا لَا يَقْطَعَ الشَّيْطَانُ عَلَيْهِ صَلَاتَهُ";
nasai.urdu = "حضرت سہل بن ابو حثمہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی شخص سترے کی طرف نماز پڑھے تو اس سے قریب کھڑا ہو (تاکہ) شیطان اس کی نماز کو قطع نہ کر دے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;