var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنِي شُعْبَةُ وَهِشَامٌ عَنْ قَتَادَةَ قَالَ قُلْتُ لِجَابِرِ بْنِ زَيْدٍ مَا يَقْطَعُ الصَّلَاةَ قَالَ كَانَ ابْنُ عَبَّاسٍ يَقُولُ الْمَرْأَةُ الْحَائِضُ وَالْكَلْبُ قَالَ يَحْيَى رَفَعَهُ شُعْبَةُ";
nasai.urdu = "حضرت قتادہ سے روایت ہے کہ میں نے حضرت جابر بن زید سے پوچھا: کون سی چیز نماز کو توڑ دیتی ہے؟ انھوں نے کہا: حضرت ابن عباس رضی اللہ عنہما نے فرمایا: حیض والی عورت اور کتا۔حضرت یحیی بن سعید نے کہا کہ حضرت شعبہ نے اس روایت کو مرفوع بیان کیا ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;