var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ عَنْ عَبَّاسِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ الْعَبَّاسِ قَالَ زَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبَّاسًا فِي بَادِيَةٍ لَنَا وَلَنَا كُلَيْبَةٌ وَحِمَارَةٌ تَرْعَى فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ وَهُمَا بَيْنَ يَدَيْهِ فَلَمْ يُزْجَرَا وَلَمْ يُؤَخَّرَا";
nasai.urdu = "حضرت فضل بن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ ہماری بستی میں حضرت عباس رضی اللہ عنہ سے ملنے تشریف لائے۔ہمارے ہاں ایک چھوٹی سی کتیا اور ایک گدھی تھی جو چرتی پھرتی تھی۔نبی ﷺ نے عصر کی نماز پڑھی اور یہ دونوں آپ کے آگے تھیں۔نہ انھیں روکا گیا اور نہ پیچھے ہٹایا گیا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (718)`;
nasai.anwaar = [326,1];