var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كُنْتُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَإِذَا أَرَدْتُ أَنْ أَقُومَ كَرِهْتُ أَنْ أَقُومَ فَأَمُرَّ بَيْنَ يَدَيْهِ انْسَلَلْتُ انْسِلَالًا";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ میں اللہ کے رسول ﷺ کے سامنے لیٹی ہوتی تھی جب کہ آپ نماز پڑھ رہے ہوتے تھے۔جب میں اٹھنے کا ارادہ کرتی تو پسند نہ کرتی کہ سیدھی کھڑی ہوں اور آپ کے آگے سے گزروں،اس لیے میں لیٹی لیٹی کھسک جاتی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;