var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي سَعِيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَدَعْ أَحَدًا أَنْ يَمُرَّ بَيْنَ يَدَيْهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ";
nasai.urdu = "حضرت ابوسعید رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی آدمی نماز پڑھتا ہو تو وہ کسی کو اپنے آگے سے نہ گزرنے دے۔اگر وہ انکار کرے تو اس سے لڑائی کرے۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;