var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ قَالَ حَدَّثَنَا أَبِي عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ وَأَنَا رَاقِدَةٌ مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ عَلَى فِرَاشِهِ فَإِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَنِي فَأَوْتَرْتُ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے منقول ہے کہ رسول اللہ ﷺ رات کو نماز پڑھتے تھے اور میں آپ کے اور قبلے کے درمیان آپ کے بستر پر عرض کے رخ لیٹی ہوتی تھی۔جب آپ وتر پڑھنے کا ارادہ فرماتے تو مجھے جگا دیتے اور میں وتر پڑھ لیتی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;