var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ جَابِرٍ عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُصَلُّوا إِلَى الْقُبُورِ وَلَا تَجْلِسُوا عَلَيْهَا";
nasai.urdu = "حضرت ابومرثدغنوی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قبروں کی طرف نماز نہ پڑھھو اور نہ ان پر بیٹھو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;