var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ سَائِلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّلَاةِ فِي الثَّوْبِ الْوَاحِدِ فَقَالَ أَوَلِكُلِّكُمْ ثَوْبَانِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے رسول اللہ ﷺ سے ایک کپڑے میں نماز پڑھنے کے بارے میں پوچھا تو آپ نے فرمایا: ’’کیا تم میں سے ہر شخص کے پاس دو دو کپڑے ہیں؟‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;