var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ فِي بَيْتِ أُمِّ سَلَمَةَ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقَيْهِ";
nasai.urdu = "حضرت عمر بن ابو سلمہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ کو حضرت ام سلمہ رضی اللہ عنہا کے گھر میں ایک کپڑے میں نماز پڑھتے ہوئے دیکھا ہے،لاس طرح کہ آپ نے اس کے دونوں کنارے اپنے دونوں کندھوںپر ڈالے ہوئے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;