var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْعَطَّافُ عَنْ مُوسَى بْنِ إِبْرَاهِيمَ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي لَأَكُونُ فِي الصَّيْدِ وَلَيْسَ عَلَيَّ إِلَّا الْقَمِيصُ أَفَأُصَلِّي فِيهِ قَالَ وَزُرَّهُ عَلَيْكَ وَلَوْ بِشَوْكَةٍ";
nasai.urdu = "حضرت سلمہ بن اکوع رضی اللہ عنہ سے روایت ہے کہ میں نے اللہ کے رسول ﷺ سے عرض کی کہ کبھی میں شکار کے پیچھے ہوتا ہوں اور مجھ پر صرف ایک قمیص ہوتی ہے تو کیا اس میں نماز پڑھ لیا کروں؟ آپ نے فرمایا: ’’اسے بٹن لگا لیا کرو اگرچہ کانٹے ہی سے ہو۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;