var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ كَانَ رِجَالٌ يُصَلُّونَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَاقِدِينَ أُزْرَهُمْ كَهَيْئَةِ الصِّبْيَانِ فَقِيلَ لِلنِّسَاءِ لَا تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَسْتَوِيَ الرِّجَالُ جُلُوسًا";
nasai.urdu = "حضرت سہل بن سعد رضی اللہ عنہ سے منقول ہے کہ کچھ لوگ رسول اللہ ﷺ کے ساتھ نماز پڑھا کرتے تھے اور انھوں نے اپنے ازار (چھوٹے ہونے کی وجہ سے) بچوں کی طرح گردن پر باندھے ہوتے تھے تو (احتیاطاً) عورتوں سے کہا گیا کہ تم سجدے سے سر نہ اٹھایا کرو حتیکہ مرد سیدھے بیٹھ جایا کریں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;