var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِاللَّيْلِ وَأَنَا إِلَى جَنْبِهِ وَأَنَا حَائِضٌ وَعَلَيَّ مِرْطٌ بَعْضُهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ رات کو نماز پڑھتے اور میں آپ کے ایک طرف لیٹی ہوتی جب کہ میں حائضہ ہوتی تھی۔مجھ پر ایک چادر ہوتی تھی جس کا کچھ حصہ رسول اللہ ﷺ پر ہوتا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;