var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ وَعِيسَى بْنُ حَمَّادٍ زُغْبَةُ عَنْ اللَّيْثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ أُهْدِيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُّوجُ حَرِيرٍ فَلَبِسَهُ ثُمَّ صَلَّى فِيهِ ثُمَّ انْصَرَفَ فَنَزَعَهُ نَزْعًا شَدِيدًا كَالْكَارِهِ لَهُ ثُمَّ قَالَ لَا يَنْبَغِي هَذَا لِلْمُتَّقِينَ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ کو ایک ریشم کی اچکن،یعنی شیروانی سے ملتا جلتا لباس تحفے میں دیا گیا۔آپ نے اسے پہنا،پھر اس میں نماز پڑھی۔سلام پھیرا تو اسے بڑی تیزی اور سختی سے اتار دیا،گویا کہ آپ اسے ناپسند فرما رہے ہیں،پھر فرمایا: ’’یہ پرہیزگاروں کے لیے جائز نہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;