var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي خَمِيصَةٍ لَهَا أَعْلَامٌ ثُمَّ قَالَ شَغَلَتْنِي أَعْلَامُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَأْتُونِي بِأَنْبِجَانِيِّهِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ اللہ کے رسول ﷺ نے ایک دھاری دار منقش چادر میں نماز پڑھی،پھر فرمایا: ’’مجھے اس کے نقش و نگار نے اپنی طرف متوجہ رکھا۔اسے ابوجہم کے پاس لے جاؤ اور اس سے اس کی انبحانی چادر لے آؤ۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;