var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامٍ قَالَ رَأَيْتُ جَرِيرًا بَالَ ثُمَّ دَعَا بِمَاءٍ فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ ثُمَّ قَامَ فَصَلَّى فَسُئِلَ عَنْ ذَلِكَ فَقَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ مِثْلَ هَذَا";
nasai.urdu = "حضرت ہمام نے کہا کہ میں نے حضرت جریر بن عبداللہ رضی اللہ عنہ کو دیکھا کہ انھوں نے پیشاب کیا،پھر پانی منگوایا اور وضو کیا اور اپنے موزوں پر مسح کیا۔پھر اٹھے اور نماز پڑھی۔ان سے اس بارے میں پوچھا گیا تو فرمانے لگے: میں نے نبی ﷺ کو ایسے کرتے دیکھا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;