var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ يَزِيدَ بْنِ زُرَيْعٍ وَغَسَّانَ بْنِ مُضَرَ قَالَا حَدَّثَنَا أَبُو مَسْلَمَةَ وَاسْمُهُ سَعِيدُ بْنُ يَزِيدَ بَصْرِيٌّ ثِقَةٌ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي النَّعْلَيْنِ قَالَ نَعَمْ";
nasai.urdu = "حضرت ابو مسلمہ سعید بن یزید بصری نے کہا کہ میں نے حضرت انس بن مالک رضی اللہ سے پوچھا: کیا اللہ کے رسول ﷺ جوتوں میں نماز پڑھ لیتے تھے؟ انھوں نے فرمایا: ہاں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;