var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَشُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ الْفَتْحِ فَوَضَعَ نَعْلَيْهِ عَنْ يَسَارِهِ";
nasai.urdu = "حضرت عبداللہ بن سائب رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فتح مکہ کے دن نماز پڑھی تو آپ نے اپنے جوتوں کو اپنی بائیں طرف رکھا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;