var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّكُمْ سَتُدْرِكُونَ أَقْوَامًا يُصَلُّونَ الصَّلَاةَ لِغَيْرِ وَقْتِهَا فَإِنْ أَدْرَكْتُمُوهُمْ فَصَلُّوا الصَّلَاةَ لِوَقْتِهَا وَصَلُّوا مَعَهُمْ وَاجْعَلُوهَا سُبْحَةً";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’شاید تم ایسے لوگوں کو پاؤ جو بے وقت نماز پڑھیں گے۔اگر تم پر ایسا دور آ جائے تو نماز وقت پر پڑھ لیا کرنا،پھر ان کے ساتھ بھی پڑھ لینا اور اسے نفل سمجھ لینا۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;