var nasai = {};
nasai.arabic = "أَخْبَرَنَا حَاجِبُ بْنُ سُلَيْمَانَ الْمَنْبِجِيُّ عَنْ وَكِيعٍ عَنْ سُفْيَانَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَابْنُ عَمٍّ لِي وَقَالَ مَرَّةً أَنَا وَصَاحِبٌ لِي فَقَالَ إِذَا سَافَرْتُمَا فَأَذِّنَا وَأَقِيمَا وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے منقول ہے کہ میں اور میرا ایک چچازاد بھائی یا ساتھی رسول اللہ ﷺ کے پاس آئے تو آپ نے فرمایا،ددجب سفر میں نماز کا وقت ہو جائے تو اذان کہنا اور جو تم میں بڑا ہو وہ امامت کرائے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;