var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ يَحْيَى عَنْ هِشَامٍ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانُوا ثَلَاثَةً فَلْيَؤُمَّهُمْ أَحَدُهُمْ وَأَحَقُّهُمْ بِالْإِمَامَةِ أَقْرَؤُهُمْ";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب تین آدمی ہوں تو ان میں سے ایک امامت کرائے اور امامت کا زیادہ حق دار ان میں سے وہ ہے جو ان میں سے زیادہ قرآن پڑھنے والا ہو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;