var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَ آخِرُ صَلَاةٍ صَلَّاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ الْقَوْمِ صَلَّى فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا خَلْفَ أَبِي بَكْرٍ";
nasai.urdu = "حضرت انس رضی اللہ عنہ بیان کرتے ہیں کہ آخری نماز جو رسول اللہ ﷺ نے لوگوں کے ساتھ پڑھی وہ آپ نے حضرت ابوبکر رضی اللہ عنہ کے پیچھے ایک کپڑے میں پڑھی تھی جسے آپ نے اپنے جسم پر لپیٹ رکھا تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;