var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا بَكْرُ بْنُ عِيسَى صَاحِبُ الْبُصْرَى قَالَ سَمِعْتُ شُعْبَةَ يَذْكُرُ عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ أَبَا بَكْرٍ صَلَّى لِلنَّاسِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّفِّ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ حضرت ابوبکر رضی اللہ عنہ نے لوگوں کو نماز پڑھائی جب کہ رسول اللہ ﷺ صف میں تھے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;