var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ أَبَانَ بْنِ يَزِيدَ قَالَ حَدَّثَنَا بُدَيْلُ بْنُ مَيْسَرَةَ قَالَ حَدَّثَنَا أَبُو عَطِيَّةَ مَوْلًى لَنَا عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا زَارَ أَحَدُكُمْ قَوْمًا فَلَا يُصَلِّيَنَّ بِهِمْ";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا: جب تم میں سے کوئی دوسرے لوگوں سے ملنے جائے تو انھیں نماز نہ پڑھائے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;