var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ وَحَجَّاجُ بْنُ أَبِي عُثْمَانَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نُودِيَ لِلصَّلَاةِ فَلَا تَقُومُوا حَتَّى تَرَوْنِي";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: جب نماز کی اقامت کہی جائے تو کھڑے نہ ہو حتی کہ مجھے (آتا) دیکھ لو۔";
nasai.hukam = "صحیح";
nasai.description = ``;