var nasai = {};
nasai.arabic = "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ أَنَسٍ قَالَ أُقِيمَتْ الصَّلَاةُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَجِيٌّ لِرَجُلٍ فَمَا قَامَ إِلَى الصَّلَاةِ حَتَّى نَامَ الْقَوْمُ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے کہ ایک دفعہ نماز کی اقامت ہوگئی جب کہ اللہ کے رسول ﷺ ایک آدمی سے باتیں کر رہے تھے چنانچہ آپ جماعت کے لیے کھڑے نہ ہوئے حتی کہ لوگ سوگئے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;