var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ يَحْيَى قَالَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ الرُّوَاسِيُّ عَنْ أَبِيهِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ وَأَبُو بَكْرٍ خَلْفَهُ فَإِذَا كَبَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ أَبُو بَكْرٍ يُسْمِعُنَا";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے ہمیں ظہر کی نماز پڑھائی۔ابوبکر رضی اللہ عنہ آپ کے پیچھے تھے۔جب رسول اللہ ﷺ تکبیر کہتے تو ابوبکر رضی اللہ عنہ ہمیں سنانے کے لیے تکبیر کہتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;