var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ عَنْ مِسْعَرٍ عَنْ الْمِقْدَامِ وَهُوَ ابْنُ شُرَيْحٍ عَنْ أَبِيهِ قَالَ قُلْتُ لِعَائِشَةَ بِأَيِّ شَيْءٍ كَانَ يَبْدَأُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ بَيْتَهُ قَالَتْ بِالسِّوَاكِ";
nasai.urdu = "قاضی شریح سے روایت ہے،وہ کہتے ہیں کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ نبی ﷺ جب گھر میں داخل ہوتے تو سب سے پہلے کون سا کام کرتے تھے؟ انھوں نے فرمایا: مسواک کرتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;