var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَلَا أُخْبِرُكُمْ بِوُضُوءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَوَضَّأَ مَرَّةً مَرَّةً";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ کیا میں تمھیں اللہ کے رسول ﷺ کے وضو کے بارے میں نہ بتاؤں؟ پھر (یہ کہہ کر) انھوں نے اعضائے وضو کو ایک ایک دفعہ دھویا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;