var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا هُوَ إِلَّا أَنَا وَأُمِّي وَالْيَتِيمُ وَأُمُّ حِرَامٍ خَالَتِي فَقَالَ قُومُوا فَلِأُصَلِّيَ بِكُمْ قَالَ فِي غَيْرِ وَقْتِ صَلَاةٍ قَالَ فَصَلِّي بِنَا";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ ہمارے ہاں تشریف لائے۔ہم گھر والے صرف میں میری والدہ ایک یتیم لڑکا اور میری خالہ ام حرام (رضی اللہ عنھم) ہی تھے۔آپ نے فرمایا: اٹھو! میں تمھیں نماز پڑھاؤں۔حالانکہ کسی فرض نماز کا وقت نہ تھا پھر آپ نے ہمیں نماز پڑھائی۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;