var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُخْتَارٍ يُحَدِّثُ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ أَنَسٍ أَنَّهُ كَانَ هُوَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُمُّهُ وَخَالَتُهُ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ أَنَسًا عَنْ يَمِينِهِ وَأُمَّهُ وَخَالَتَهُ خَلْفَهُمَا";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ ایک دفعہ میں اور رسول اللہ ﷺ اور میری والدہ اور خالہ نماز پڑھنے لگے۔رسول اللہ ﷺ نے ہمیں نماز پڑھائی۔مجھے اپنے دائیں اور میری والدہ اور خالہ کو پیچھے کھڑا کیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;