var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ أَنَسٍ قَالَ صَلَّى بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِامْرَأَةٍ مِنْ أَهْلِي فَأَقَامَنِي عَنْ يَمِينِهِ وَالْمَرْأَةُ خَلْفَنَا";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے مجھے اور میرے دیگر گھر والوں میں سے ایک عورت کو اس طرح نماز پڑھائی کہ مجھے اپنی دائیں طرف کھڑا کیا اور عورت کو پیچھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;