var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ فَقُمْتُ عَنْ شِمَالِهِ فَقَالَ بِي هَكَذَا فَأَخَذَ بِرَأْسِي فَأَقَامَنِي عَنْ يَمِينِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ میں نے اپنی خالہ میمونہ (ام المومنین) رضی اللہ عنہا کے ہاں رات گزاری۔رسول اللہ ﷺ رات کو نماز (تہجد) پڑھنے کے لیے اٹھے تو میں آپ کی بائیں طرف کھڑا ہوگیا۔آپ نے مجھے اس طرح سر سے پکڑا اور دائیں طرف کھڑا کرلیا۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;