var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي الْمُطَّلِبُ بْنُ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ تَوَضَّأَ ثَلَاثًا ثَلَاثًا يُسْنَدُ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما نے اعضائے وضو کو تین تین بار دھویا اور وہ اس فعل کو نبی ﷺ کی طرف منسوب کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;