var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَبُو بَكْرِ بْنِ نَافِعٍ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اسْتَوُوا اسْتَوُوا اسْتَوُوا فَوَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَرَاكُمْ مِنْ خَلْفِي كَمَا أَرَاكُمْ مِنْ بَيْنِ يَدَيَّ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ تین فعہ فرمایا کرتے تھے: برابر ہو جاؤ۔قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! تحقیق میں تمھیں اپنے پیچھے سے بھی اسی طرح دیکھتا ہوں جیسے تمھیں سامنے سے دیکھتا ہوں۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;