var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ أَنْبَأَنَا إِسْمَعِيلُ عَنْ حُمَيْدٍ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ أَقْبَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِوَجْهِهِ حِينَ قَامَ إِلَى الصَّلَاةِ قَبْلَ أَنْ يُكَبِّرَ فَقَالَ أَقِيمُوا صُفُوفَكُمْ وَتَرَاصُّوا فَإِنِّي أَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ تکبیر تحریمہ کہنے سے قبل ہماری طرف متوجہ ہوئے اور فرمایا: اپنی صفیں سیدھی کرو اور مل کر کھڑے ہو کیونکہ میں تمھیں اپنے پیچھے سے بھی دیکھتا ہوں۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;