var nasai = {};
nasai.arabic = "أَخْبَرَنِي يَحْيَى بْنُ عُثْمَانَ الْحِمْصِيُّ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ الْعِرْبَاضِ بْنِ سَارِيَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى الصَّفِّ الْأَوَّلِ ثَلَاثًا وَعَلَى الثَّانِي وَاحِدَةً";
nasai.urdu = "حضرت عرباض بن ساریہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ پہلی صف کے لیے تین دفعہ دعا فرماتے تھے اور دوسری صف کے لیے ایک دفعہ۔";
nasai.hukam = "صحیح";
nasai.description = ``;