var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتِمُّوا الصَّفَّ الْأَوَّلَ ثُمَّ الَّذِي يَلِيهِ وَإِنْ كَانَ نَقْصٌ فَلْيَكُنْ فِي الصَّفِّ الْمُؤَخَّرِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: پہلی صف مکمل کرو پھر وہ جو اس (پہلی) سے ملی ہوئی ہے (دوسری)۔اگر کوئی کمی ہو تو وہ آخری صف میں ہونی چاہیے (نہ کہ پہلی صف میں)۔";
nasai.hukam = "صحیح";
nasai.description = ``;