var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ بْنِ مَثْرُودٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَصَلَ صَفًّا وَصَلَهُ اللَّهُ وَمَنْ قَطَعَ صَفًّا قَطَعَهُ اللَّهُ عَزَّ وَجَلَّ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: جو کوئی صف کو ملائے گا اللہ تعالیٰ اسے (اپنے ساتھ) ملائے گا اور جو صف کو کاٹے (توڑے) گا اللہ تعالیٰ اسے کاٹے (توڑے) گا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;