var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے فرمایا: مردوں کی بہترین صف پہلی صف ہے اور بدترین صف آخری صف ہے۔اور عورتوں کی بہترین صف آخری صف ہے اور بدترین صف پہلی صف ہے۔(جو مردوں سے ملی ہوئی ہو)۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;