var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مِسْعَرٍ عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنْ ابْنِ الْبَرَاءِ عَنْ الْبَرَاءِ قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْبَبْتُ أَنْ أَكُونَ عَنْ يَمِينِهِ";
nasai.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے منقول ہے کہ ہم جب رسول اللہ ﷺ کے پیچھے نماز پڑھتے تھے تو میری خواہش ہوتی تھی کہ میں آپ کی دائیں طرف کھڑا ہوں۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;