var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ بِالنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمْ السَّقِيمَ وَالضَّعِيفَ وَالْكَبِيرَ فَإِذَا صَلَّى أَحَدُكُمْ لِنَفْسِهِ فَلْيُطَوِّلْ مَا شَاءَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: جب تم میں سے کوئی آدمی لوگوں کو نماز پڑھائے تو ہلکی پڑھائے کیونکہ ان میں بیمار کمزور اور بوڑھے بھی ہوتے ہیں البتہ جب وہ اکیلا نماز پڑھے تو جس قدر چاہے لمبی پڑھے۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;