var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي لَأَقُومُ فِي الصَّلَاةِ فَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأُوجِزُ فِي صَلَاتِي كَرَاهِيَةَ أَنْ أَشُقَّ عَلَى أُمِّهِ";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے منقول ہے نبی ﷺ نے فرمایا: بسا اوقات میں نماز میں کھڑا ہوتا ہوں پھر کسی بچے کے رونے کی آواز سنتا ہوں تو نماز کو مختصر کر دیتا ہوں کہ اس کی ماں پر مشتقت کا سبب نہ بن جاؤں۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;