var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ ابْنِ أَبِي ذِئْبٍ قَالَ أَخْبَرَنِي الْحَارِثُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِالتَّخْفِيفِ وَيَؤُمُّنَا بِالصَّافَّاتِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نماز ہلکی پڑھانے کا حکم دیتے تھے مگر خود سورۂ صافات کے ساتھ ہماری امامت فرماتے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;