var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ عَنْ أَبِي قَتَادَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّ النَّاسَ وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ عَلَى عَاتِقِهِ فَإِذَا رَكَعَ وَضَعَهَا وَإِذَا رَفَعَ مِنْ سُجُودِهِ أَعَادَهَا";
nasai.urdu = "حضرت ابوقتادہ رضی اللہ عنہ سے روایت ہے میں نے رسول اللہ ﷺ کو دیکھا آپ لوگوں کی امامت کرا رہے تھے جب کہ آپ نے امامہ بنت ابو العاص کو اپنے کندھے پر اٹھایا ہوا تھا۔جب آپ رکوع فرماتے تو اسے اتار دیتے اور جب سجدے کے بعد اٹھتے تو اسے دوبارہ اٹھا لیتے۔";
nasai.hukam = "صحیح";
nasai.description = ``;