var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا يَخْشَى الَّذِي يَرْفَعُ رَأْسَهُ قَبْلَ الْإِمَامِ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے حضرت محمد ﷺ نے فرمایا: جو شخص امام سے پہلے اپنا سر اٹھا لیتا ہے کیا وہاس بات سے ڈرتا نہیں کہ اللہ تعالیٰ اس کا سر گدھے کے سر جیسا بنا دے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;