var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ يَخْطُبُ قَالَ حَدَّثَنَا الْبَرَاءُ وَكَانَ غَيْرَ كَذُوبٍ أَنَّهُمْ كَانُوا إِذَا صَلَّوْا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَامُوا قِيَامًا حَتَّى يَرَوْهُ سَاجِدًا ثُمَّ سَجَدُوا";
nasai.urdu = "حضرت براء رضی اللہ عنہ بیان کرتے ہیں اور وہ جھوٹے نہ تھے کہ جب وہ رسول اللہ ﷺ کے ساتھ نماز پڑھتے تھے اور آپ رکوع سے سر اٹھاتے تو صحابہ کھڑے رہتے حتی کہ آپ کو دیکھ لیتے کہ آپ سجدے میں چلے گئے ہیں تو پھر سجدہ کرتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;