var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ أَشْعَثَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى صَلَاةَ الْخَوْفِ فَصَلَّى بِالَّذِينَ خَلْفَهُ رَكْعَتَيْنِ وَبِالَّذِينَ جَاءُوا رَكْعَتَيْنِ فَكَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعًا وَلِهَؤُلَاءِ رَكْعَتَيْنِ رَكْعَتَيْنِ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے نماز خوف پڑھائی۔آپ نے ان لوگوں کو جو آپ کے پیچھے تھے دو رکعتیں پڑھائیں اور ج بعد میں آئے انھیں بھی دو رکعتیں پڑھائیں۔اس طرح نبی ﷺ کی چار رکعتیں ہوگئیں اور ان سب کی دو دو رکعتیں۔";
nasai.hukam = "صحیح — شاہد: صحیح مسلم (843/ 312)";
nasai.description = ``;