var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمَّارٍ قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الْجَمَاعَةِ تَزِيدُ عَلَى صَلَاةِ الْفَذِّ خَمْسًا وَعِشْرِينَ دَرَجَةً";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے نبی ﷺ نے فرمایا: نماز باجماعت اکیلے کی نماز سے پچیس (۲۵) درجے زیادہ فضیلت رکھتی ہے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;