var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانُوا ثَلَاثَةً فَلْيَؤُمَّهُمْ أَحَدُهُمْ وَأَحَقُّهُمْ بِالْإِمَامَةِ أَقْرَؤُهُمْ";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب نمازی تین آدمی ہوں تو ان میں سے ایک امامت کرائے۔اور ان میں سے امامت کا زیادہ حق دار وہ ہے جو زیادہ قاری ہو۔";
nasai.hukam = "صحیح";
nasai.description = ``;