var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ أَنَّ قَزَعَةَ مَوْلًى لِعَبْدِ الْقَيْسِ أَخْبَرَهُ أَنَّهُ سَمِعَ عِكْرِمَةَ قَالَ قَالَ ابْنُ عَبَّاسٍ صَلَّيْتُ إِلَى جَنْبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَائِشَةُ خَلْفَنَا تُصَلِّي مَعَنَا وَأَنَا إِلَى جَنْبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُصَلِّي مَعَهُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ میں نے نبی ﷺ کی ایک جانب نماز پڑھی اور حضرت عائشہ رضی اللہ عنہا ہمارے ساتھ نماز پڑھ رہی تھیں۔اور میں نبی ﷺ کے پہلو میں (دائیں جانب) آپ کے ساتھ نماز پڑھ رہا تھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;