var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُمْتُ عَنْ يَسَارِهِ فَأَخَذَنِي بِيَدِهِ الْيُسْرَى فَأَقَامَنِي عَنْ يَمِينِهِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے،انھوں نے فرمایا: میں نے رسول اللہ ﷺ کے ساتھ نماز پڑھی تو میں آپ ﷺ کی بائیں جانب کھڑا ہوگیا۔آپ نے مجھے اپنے بائیں ہاتھ سے پکڑ کر اپنی دائیں جانب کھڑا کر لیا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;