var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنْ عَبْدَ اللَّهِ بْنَ أَرْقَمَ كَانَ يَؤُمُّ أَصْحَابَهُ فَحَضَرَتْ الصَّلَاةُ يَوْمًا فَذَهَبَ لِحَاجَتِهِ ثُمَّ رَجَعَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا وَجَدَ أَحَدُكُمْ الْغَائِطَ فَلْيَبْدَأْ بِهِ قَبْلَ الصَّلَاةِ";
nasai.urdu = "حضرت عروہ سے روایت ہے کہ حضرت عبداللہ بن ارقم رضی اللہ عنہ اپنے ساتھیوں کو جماعت کراتے تھے۔ایک دن نماز کا وقت ہوگیا تو وہ قضائے حاجت کے لیے گئے،پھر واپس آئے اور فرمایا: میں نے رسول اللہ ﷺ کو یہ فرماتے سنا ہے: ’’جب تم میں سے کوئی شخص قضائے حاجت کی ضرورت محسوس کرے تو نماز سے پہلے قضائے حاجت کرلے۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;