var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحُنَيْنٍ فَأَصَابَنَا مَطَرٌ فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ صَلُّوا فِي رِحَالِكُمْ";
nasai.urdu = "حضرت ابوملیح اپنے والد سے بیان کرتے ہیں،انھوں نے فرمایا: ہم رسول اللہ ﷺ کے ساتھ حنین میں تھے کہ ہم پر بارش برسنے لگی تو رسول اللہ ﷺ کے مؤذن نے اعلان کیا کہ اپنے اپنے خیموں میں نماز پڑھ لو۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;