var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو الزِّنَادِ ح و حَدَّثَنَا الْحُسَيْنُ بْنُ عِيسَى عَنْ مَعْنٍ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَجْعَلْ فِي أَنْفِهِ مَاءً ثُمَّ لِيَسْتَنْثِرْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا: ’’جب تم میں سے کوئی شخص وضو کرے،تو اسے چاہیے کہ اپنے ناک میں پانی ڈالے اور پھر (اسےض اچھی طرح صاف کرے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;