var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ قَالَ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَيْتُمْ الصَّلَاةَ فَلَا تَأْتُوهَا وَأَنْتُمْ تَسْعَوْنَ وَأْتُوهَا تَمْشُونَ وَعَلَيْكُمْ السَّكِينَةُ فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَاقْضُوا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تم نماز کے لیے آؤ تو دوڑتے ہوئے نہ آؤ بلکہ سکون اور وقار کے ساتھ چلتے ہوئے آؤ۔جو نماز جماعت کے ساتھ مل جائے پڑھ لو اور جو رہ جائے بعد میں پوری کرلو۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;