var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ زَكَرِيَّا قَالَ حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ عَطَاءَ بْنَ يَسَارٍ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب نماز کی اقامت ہوجائے تو اس (باجماعت) فرض کے علاوہ کوئی اور نماز نہیں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;