var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدٌ عَنْ شُعْبَةَ عَنْ وَرْقَاءَ بْنِ عُمَرَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةُ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سےمروی ہے،نبی ﷺ نے فرمایا: ’’جب نماز کی اقامت ہوجائے تو فرض نماز کے علاوہ کوئی نماز نہیں۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;