var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ ابْنِ بُحَيْنَةَ قَالَ أُقِيمَتْ صَلَاةُ الصُّبْحِ فَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُصَلِّي وَالْمُؤَذِّنُ يُقِيمُ فَقَالَ أَتُصَلِّي الصُّبْحَ أَرْبَعًا";
nasai.urdu = "حضرت ابن بحینہ رضی اللہ عنہ سے منقول ہے کہ صبح کی نماز کی اقامت ہوئی تو رسول اللہ ﷺ نے ایک شخص کو نماز پڑھتے دیکھا جب کہ مؤذن اقامت کہہ رہا تھا۔آپ نےفرمایا: ’’تو صبح کی نماز چار رکعت پڑھے گا؟‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;