var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ عَنْ إِسْمَعِيلَ بْنِ كَثِيرٍ ح وَأَنْبَأَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي هَاشِمٍ عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبْرَةَ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي عَنْ الْوُضُوءِ قَالَ أَسْبِغْ الْوُضُوءَ وَبَالِغْ فِي الِاسْتِنْشَاقِ إِلَّا أَنْ تَكُونَ صَائِمًا";
nasai.urdu = "حضرت لقیط بن صبرہ رضی اللہ عنہ سے روایت ہے کہ میں نے کہا: اے اللہ کے رسول! مجھے وضو کے (صحیح طریقے) کے بارے میں بتائیں۔آپ نے فرمایا: ’’اعضائے وضو کو مکمل (اچھی طرح) دھو اور ناک میں پانی ڈالنے میں مبالغہ کر،سوائے اس کے کہ تو روزے سے ہو۔‘‘";
nasai.hukam = "صحیح";
nasai.description = ``;