var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي إِسْحَقُ بْنُ عَبْدِ اللَّهِ قَالَ سَمِعْتُ أَنَسًا رَضِيَ اللَّهُ عَنْهُ قَالَ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِنَا فَصَلَّيْتُ أَنَا وَيَتِيمٌ لَنَا خَلْفَهُ وَصَلَّتْ أُمُّ سُلَيْمٍ خَلْفَنَا";
nasai.urdu = "حضرت انس رضی اللہ بیان کرتے ہیں کہ رسول اللہ ﷺ ہمارے گھر تشریف لائے۔میں اور ہمارے ایک یتیم نے آپ کے پیچھے کھڑے ہوکر نماز پڑھی اور (ہماری والدہ) حضرت ام سلیم رضی اللہ عنہا نے ہمارے پیچھے نماز پڑھی۔";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;