var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ يَزِيدَ بْنِ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ زِيَادٍ الْأَعْلَمِ قَالَ حَدَّثَنَا الْحَسَنُ أَنَّ أَبَا بَكْرَةَ حَدَّثَهُ أَنَّهُ دَخَلَ الْمَسْجِدَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاكِعٌ فَرَكَعَ دُونَ الصَّفِّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَكَ اللَّهُ حِرْصًا وَلَا تَعُدْ";
nasai.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ وہ (ایک دفعہ) مسجد میں داخل ہوئے تو نبی ﷺ رکوع کی حالت میں تھے،چنانچہ انھوں نے صف سے پیچھے ہی رکوع کرلیا۔(اور رکوع ہی کی حالت میں چل کر صف میں پہنچے۔) نبی ﷺ نے (نماز کے بعد فرمایا: ’’اللہ تعالیٰ تمھاری (نیکی کی) حرص میں اضافہ فرمائے لیکن دوبارہ ایسے نہ کرنا۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;