var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَكَانَ يُصَلِّي بَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لَا يُصَلِّي بَعْدَ الْجُمْعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ ظہر سے پہلے دو رکعت اور بعد میں دو رکعت پڑھتے تھے۔اور مغرب کے بعد گھر میں دو رکعت اور عشاء کے بعد دو رکعت پڑھتےتھے۔اور جمعے کے بعد نماز نہیں پڑھتے تھے حتی کہ گھر جاکر دورکعت پڑھتے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;