var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَهُمَا كَذَلِكَ وَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ وَكَانَ لَا يَفْعَلُ ذَلِكَ فِي السُّجُودِ";
nasai.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ جب نماز شروع فرماتے تو اپنے کندھوں کے برابر ہاتھ اٹھاتے۔اور جب رکوع کرتے اور جب رکوع سے سر اٹھاتے توانھیں اسی طرح اٹھاتے اور فرماتے [سمع اللہ لمن حمدہ،ربنا ولک الحمد] اور سجدوں میں ایسا نہیں کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;