var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَوَضَّأَ فَلْيَسْتَنْثِرْ وَمَنْ اسْتَجْمَرَ فَلْيُوتِرْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جو شخص وضو کرے،اسے چاہیے کہ وہ ناک جھاڑے۔اور جو شخص (استنجے کے لیے) ڈھیلے استعمال کرے،اسے چاہیے کہ وہ طاق استعمال کرے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;