var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَ صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا افْتَتَحَ الصَّلَاةَ كَبَّرَ وَرَفَعَ يَدَيْهِ حَتَّى حَاذَتَا أُذُنَيْهِ ثُمَّ يَقْرَأُ بِفَاتِحَةِ الْكِتَابِ فَلَمَّا فَرَغَ مِنْهَا قَالَ آمِينَ يَرْفَعُ بِهَا صَوْتَهُ";
nasai.urdu = "حضرت وائل بن حجر رضی اللہ عنہما فرماتے ہیں کہ میں نے رسول اللہ ﷺ کے پیچھے نماز پڑھی۔جب آپ نے نماز شروع فرمائی تو اللہ اکبر کہا اور اپنے ہاتھ اٹھائے حتی کہ وہ کانوں کے برابر ہوگئے،پھر آپ نے سورۂ فاتحہ پڑھی۔جب سورت سے فارغ ہوئے تو بلند آواز سے آمین کہی۔";
nasai.hukam = "صحیح";
nasai.description = ``;