var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ نَصْرَ بْنَ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى رَفَعَ يَدَيْهِ حِينَ يُكَبِّرُ حِيَالَ أُذُنَيْهِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ";
nasai.urdu = "حضرت مالک بن حویرث رضی اللہ عنہ سے روایت ہے،اور وہ نبی ﷺ کے صحابہ میں سے ہیں،کہ رسول اللہ ﷺ جب نماز پڑھتے تو تکبیر تحریمہ کے وقت اپنے دونوں ہاتھ کانوں تک اٹھاتے اور جب رکوع میں جانے کا ارادہ فرماتےاور جب رکوع سے سر اٹھاتے (تو بھی رفع الیدین کرتے)۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;