var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا فِطْرُ بْنُ خَلِيفَةَ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَتَّى تَكَادَ إِبْهَامَاهُ تُحَاذِي شَحْمَةَ أُذُنَيْهِ";
nasai.urdu = "حضرت وائل بن حجر رضی اللہ عنہ سے مروی ہے،انھوں نے نبی ﷺ کو دیکھا،جب آپ نے نماز شروع فرمائی تو اپنے ہاتھ اٹھائے حتی کہ قریب تھا،آپ کے انگوٹھے کانوں کی لوؤں (نچلے کنارے) کے برابر ہوجاتے۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابو داود (737)`;
nasai.anwaar = [327,1];