var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مُوسَى بْنِ عُمَيْرٍ الْعَنْبَرِيِّ وَقَيْسِ بْنِ سُلَيْمٍ الْعَنْبَرِيِّ قَالَا حَدَّثَنَا عَلْقَمَةُ بْنُ وَائِلٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ قَائِمًا فِي الصَّلَاةِ قَبَضَ بِيَمِينِهِ عَلَى شِمَالِهِ";
nasai.urdu = "حضرت وائل بن حجررضی اللہ عنہ سے منقول ہے کہ میں نے رسول اللہ ﷺکو دیکھا،جب آپ نماز میں کھڑے ہوتے تو اپنے دائیں ہاتھ کو بائیں پر رکھ کر اسے پکڑتے۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;