var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ الْحَجَّاجِ بْنِ أَبِي زَيْنَبَ قَالَ سَمِعْتُ أَبَا عُثْمَانَ يُحَدِّثُ عَنْ ابْنِ مَسْعُودٍ قَالَ رَآنِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ وَضَعْتُ شِمَالِي عَلَى يَمِينِي فِي الصَّلَاةِ فَأَخَذَ بِيَمِينِي فَوَضَعَهَا عَلَى شِمَالِي";
nasai.urdu = "حضرت ابن مسعود رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ نے مجھے نماز میں اس حالت میں دیکھا کہ میں نے اپنا بایاں ہاتھ دائیں ہاتھ پر رکھا ہوا تھا تو آپ نے میرا دایاں ہاتھ پکڑا اور اسے بائیں پر رکھ دیا۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;