var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَلَمَةَ بْنِ قَيْسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَوَضَّأْتَ فَاسْتَنْثِرْ وَإِذَا اسْتَجْمَرْتَ فَأَوْتِرْ";
nasai.urdu = "حضرت سلمہ بن قیس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تو وضو کرے تو ناک جھاڑ اور جب تو (قضائے حاجت کے بعد) ڈھیلے استعمال کرے تو طاق استعمال کر۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;