var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ هِشَامٍ ح و أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ وَاللَّفْظُ لَهُ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُصَلِّيَ الرَّجُلُ مُخْتَصِرًا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے نماز میں کوکھ پر ہاتھ رکھنے سے منع فرمایا ہے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;