var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مَيْسَرَةُ بْنُ حَبِيبٍ قَالَ سَمِعْتُ الْمِنْهَالَ بْنَ عَمْرٍو يُحَدِّثُ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ أَنَّهُ رَأَى رَجُلًا يُصَلِّي قَدْ صَفَّ بَيْنَ قَدَمَيْهِ فَقَالَ أَخْطَأَ السُّنَّةَ وَلَوْ رَاوَحَ بَيْنَهُمَا كَانَ أَعْجَبَ إِلَيَّ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ نے ایک آدمی کو نماز کی حالت میں دیکھا تو فرمایا: ’’یہ شخص سنت نبوی سے خطا کر گیا۔اگر یہ پاؤں کھلے رکھ کر راحت حاصل کرتا تو مجھے زیادہ اچھا لگتا۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (893)`;
nasai.anwaar = [327,1];