var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفِطْرَةُ خَمْسٌ الِاخْتِتَانُ وَالِاسْتِحْدَادُ وَقَصُّ الشَّارِبِ وَتَقْلِيمُ الْأَظْفَارِ وَنَتْفُ الْإِبْطِ";
nasai.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ نے فرمایا: ’’پانچ چیزیں فطری ہیں: ختنہ کرانا،زیر ناف کے بال مونڈنا،مونچھیں کاٹنا،ناخن تراشنا اور بغلوں کے بال اکھیڑنا۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;