var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ زُنْبُورٍ الْمَكِّيُّ قَالَ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ حَدَّثَهُ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ مَنَامِهِ فَتَوَضَّأَ فَلْيَسْتَنْثِرْ ثَلَاثَ مَرَّاتٍ فَإِنَّ الشَّيْطَانَ يَبِيتُ عَلَى خَيْشُومِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا: ’’جب تم میں سے کوئی شخص نیند سے جاگے اور وضو کرے تو وہ تین بار ناک کو جھاڑے کیونکہ شیطان اس کی ناک کی جڑ میں رات گزارتا ہے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;