var nasai = {};
nasai.arabic = "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ عَلِيِّ بْنِ عَلِيٍّ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا افْتَتَحَ الصَّلَاةَ قَالَ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ تَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرُكَ";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے منقول ہے کہ نبی ﷺ جب نماز کا آغاز فرماتے تو یہ دعا پڑھتے: [سبحانک اللھم!۔۔۔ولا الہ غیرک] اے اللہ! تو (ہرقسم کے نقائص و عیوب سے) پاک ہے اور سب تعریفوں والا ہے۔تیرا نام بابرکت ہے اور تیری شان بلند ہے۔اور تیرے سوا کوئی (سچا) معبود نہیں۔‘‘";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;