var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا يَسْتَفْتِحُونَ الْقِرَاءَةَ بِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: نبی ﷺ،حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما قراءت کو (الحمدللہ رب العالمین) سے شروع فرمایا کرتے تھے۔";
nasai.hukam = "صحیح";
nasai.description = ``;