var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا فَافْتَتَحُوا بِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ میں نے نبی ﷺ،حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما کے ساتھ نمازیں پڑھیں۔ان سب نے قراءت کاآغاز (الحمد للہ رب العالمین) سے کیا۔";
nasai.hukam = "صحیح";
nasai.description = ``;