var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ قَالَ سَمِعْتُ أَبِي يَقُولُ أَنْبَأَنَا أَبُو حَمْزَةَ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُسْمِعْنَا قِرَاءَةَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَصَلَّى بِنَا أَبُو بَكْرٍ وَعُمَرُ فَلَمْ نَسْمَعْهَا مِنْهُمَا";
nasai.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: ہمیں رسول اللہ ﷺ نے نماز پڑھائی۔آپ نے ہمیں (بسم اللہ الرحمن الرحیم) بلند آواز سے نہیں سنائی۔حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما نے بھی ہمیں نماز پڑھائی۔ہم نے یہ (بسم اللہ۔۔۔) ان سے بھی نہیں سنی۔";
nasai.hukam = "صحیح";
nasai.description = ``;