var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو سَعِيدٍ الْأَشَجُّ قَالَ حَدَّثَنِي عُقْبَةُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا شُعْبَةُ وَابْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمْ فَلَمْ أَسْمَعْ أَحَدًا مِنْهُمْ يَجْهَرُ بِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ";
nasai.urdu = "حضرت انس رضی اللہ عنہ سے مروی ہے کہ میں نے رسول اللہ ﷺ،حضر ت ابوبکر،حضرت عمر اور حضرت عثمان رضی اللہ عنہم کے پیچھے نمازیں پڑھی ہیں۔میں نے ان میں سے کسی کو بلند آواز سے (بسم اللہ الرحمن الرحیم) پڑھتے نہیں سنا۔";
nasai.hukam = "إسنادہ صحیح، صحیح مسلم";
nasai.description = ``;