var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ قَالَ حَدَّثَنَا خَالِدُ بْنُ عَلْقَمَةَ عَنْ عَبْدِ خَيْرٍ عَنْ عَلِيٍّ أَنَّهُ دَعَا بِوَضُوءٍ فَتَمَضْمَضَ وَاسْتَنْشَقَ وَنَثَرَ بِيَدِهِ الْيُسْرَى فَفَعَلَ هَذَا ثَلَاثًا ثُمَّ قَالَ هَذَا طُهُورُ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے منقول ہے کہ انھوں نے وضو کا پانی منگوایا،پھر اس سے کلی کی اور ناک میں پانی چڑھایا اور اپنے بائیں ہاتھ سے جھاڑا۔یہ کام تین دفعہ کیا،پھر فرمایا: یہ ہے اللہ کے نبی ﷺ کا وضو۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;