var nasai = {};
nasai.arabic = "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ عَنْ صَدَقَةَ عَنْ زَيْدِ بْنِ وَاقِدٍ عَنْ حَرَامِ بْنِ حَكِيمٍ عَنْ نَافِعِ بْنِ مَحْمُودِ بْنِ رَبِيعَةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْضَ الصَّلَوَاتِ الَّتِي يُجْهَرُ فِيهَا بِالْقِرَاءَةِ فَقَالَ لَا يَقْرَأَنَّ أَحَدٌ مِنْكُمْ إِذَا جَهَرْتُ بِالْقِرَاءَةِ إِلَّا بِأُمِّ الْقُرْآنِ";
nasai.urdu = "حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ہمیں ایک ایسی نماز پڑھائی جس میں بلند آواز سے قراءت کی جاتی ہے۔پھر آپ نے فرمایا: ’’جب میں بلند آواز سے قراءت کروں تو تم میں سے کوئی آدمی سورۂ فاتحہ کے سوا کچھ نہ پڑھے۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;