var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ الزُّبَيْدِيِّ قَالَ أَخْبَرَنِي الزُّهْرِيُّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَّنَ الْقَارِئُ فَأَمِّنُوا فَإِنَّ الْمَلَائِكَةَ تُؤَمِّنُ فَمَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے،رسول اللہ ﷺ نے فرمایا: ’’جب پڑھنے والا (امام) آمین کہے تو تم بھی آمین کہو کیونکہ فرشتے بھی آمین کہتے ہیں،چنانچہ جس کی آمین فرشتوں کی آمین سے مل گئی،اللہ تعالیٰ اس کے سابقہ تمام گناہ معاف کردیتا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;