var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَمَّنَ الْقَارِئُ فَأَمِّنُوا فَإِنَّ الْمَلَائِكَةَ تُؤَمِّنُ فَمَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،نبی ﷺ نے فرمایا: ’’جب قراءت کرنے والا (امام) آمین کہے تو تم آمین کہو کیونکہ فرشتے بھی آمین کہتے ہیں۔جس کی آمین فرشتوں کی آمین سے مل جائے،اس کے سابقہ سب گناہ معاف کر دیے جاتے ہیں۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;