var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَمَّنَ الْإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب امام آمین کہے تو تم آمین کہو۔جس کی آمین فرشتوں کی آمین سے مل جائے،اس کے سابقہ سب گناہ معاف کر دیے جاتے ہیں۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;