var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ فَقُولُوا آمِينَ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جب امام (غیر المغضوب علیھم ولاالضالین) کہے تو تم آمین کہو کیونکہ جس کا قول فرشتوں کے قول کے ساتھ مل جائے،اس کے لیے اس کے پہلے سب گناہ معاف کر دیے جاتے ہیں۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;