var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ أَحَدُكُمْ آمِينَ وَقَالَتْ الْمَلَائِكَةُ فِي السَّمَاءِ آمِينَ فَوَافَقَتْ إِحْدَاهُمَا الْأُخْرَى غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کوئی آمین کہتا ہے اور فرشتے آسمان میں آمین کہتے ہیں،پھر ان میں سے ایک آمین دوسری آمین کے ساتھ مل جائے تو ان کے پہلے سب گناہ معاف کر دیے جاتے ہیں۔‘‘";
nasai.hukam = "صحیح بخاری";
nasai.description = ``;