var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ صَاحِبِ الْقُرْآنِ كَمَثَلِ الْإِبِلِ الْمُعَقَّلَةِ إِذَا عَاهَدَ عَلَيْهَا أَمْسَكَهَا وَإِنْ أَطْلَقَهَا ذَهَبَتْ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہا سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’قرآن کو یاد کرنے والے (حافظ قرآن) کی مثال بندھے ہوئے اونٹوں کے مالک کی طرح ہے۔اگر وہ ان کا خیال رکھے گا تو انھیں محفوظ رکھے گا اور اگر انھیں کھول دے گا تو وہ بھاگ جائیں گے۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;