var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بِئْسَمَا لِأَحَدِهِمْ أَنْ يَقُولَ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ اسْتَذْكِرُوا الْقُرْآنَ فَإِنَّهُ أَسْرَعُ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنْ النَّعَمِ مِنْ عُقُلِهِ";
nasai.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے،نبی ﷺ نے فرمایا: ’’کسی مسلمان کے لیے بری بات ہے کہ وہ کہے: میں فلاں آیت بھول گیا ہوں بلکہ وہ اسے بھلا دیا گیا ہے۔قرآن مجید دہراتے رہو کیونکہ قرآن مجید لوگوں کے سینوں سے زیادہ جلدی نکل جاتا ہے بہ نسبت ان اونٹوں کے جنھیں رسی سے باندھ دیا گیا ہو۔‘‘";
nasai.hukam = "متفق علیہ";
nasai.description = ``;