var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ دُحَيْمٌ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي رَكْعَتَيْ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ فجر کی دو سنتوں میں دو سورتیں: (قل یا یھا الکفرون) اور (قل ھو اللہ احد) پڑھتے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;