var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ إِنْ كُنْتُ لَأَرَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي رَكْعَتَيْ الْفَجْرِ فَيُخَفِّفُهُمَا حَتَّى أَقُولَ أَقَرَأَ فِيهِمَا بِأُمِّ الْكِتَابِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں رسول اللہ ﷺ کو صبح کی سنتیں پڑھتے دیکھتی تھی۔آپ ان کو اس قدر ہلکا پڑھتے تھے کہ میں (دل میں) کہتی تھی: کیا آپ نے سورۂ فاتحہ بھی پڑھی ہے؟";
nasai.hukam = "متفق علیہ";
nasai.description = ``;