var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ سَيَّارٍ يَعْنِي ابْنَ سَلَامَةَ عَنْ أَبِي بَرْزَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْغَدَاةِ بِالسِّتِّينَ إِلَى الْمِائَةِ";
nasai.urdu = "حضرت ابوبرزہ رضی اللہ عنہ سے مروی ہے کہ نبی ﷺ صبح کی نماز میں ساٹھ (۶۰) سے لے کر سو (۱۰۰) تک آیات پڑھتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;