var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا ابْنُ أَبِي الرِّجَالِ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ مَا أَخَذْتُ ق وَالْقُرْآنِ الْمَجِيدِ إِلَّا مِنْ وَرَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِهَا فِي الصُّبْحِ";
nasai.urdu = "حضرت ام ہشام رضی اللہ عنہا فرماتی ہیں کہ میں نے سورۂ (ق والقرآن المجید) رسول اللہ ﷺ کے پیچھے (نماز پڑھتے ہوئے) سیکھی کیونکہ آپ اسے (اکثر) صبح کی نماز میں پڑھا کرتے تھے۔";
nasai.hukam = "حسن";
nasai.description = ``;