var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُوسَى بْنُ حِزَامٍ التِّرْمِذِيُّ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ قَالَ أَخْبَرَنِي سُفْيَانُ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُعَوِّذَتَيْنِ قَالَ عُقْبَةُ فَأَمَّنَا بِهِمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْفَجْرِ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے مروی ہے کہ میں نے نبی ﷺ سے معوذتین (کی فضیلت) کے بارے میں پوچھا تو رسول اللہ ﷺ نے فجر کی امامت فرماتے ہوئے یہ دونوں سورتیں پڑھیں۔";
nasai.hukam = "حسن";
nasai.description = ``;