var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ بَيَانٍ عَنْ قَيْسٍ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آيَاتٌ أُنْزِلَتْ عَلَيَّ اللَّيْلَةَ لَمْ يُرَ مِثْلُهُنَّ قَطُّ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ وَقُلْ أَعُوذُ بِرَبِّ النَّاسِ";
nasai.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’آج رات مجھ پر کچھ آیات نازل ہوئی ہیں کہ ان جیسی آیات کبھی بھی نہیں دیکھی گئیں۔اور وہ (قل اعوذ برب الفلق) اور (قل اعوذ برب الناس) ہیں۔‘‘";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;