var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ وَاللَّفْظُ لَهُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الصُّبْحِ يَوْمَ الْجُمُعَةِ الم تَنْزِيلُ وَهَلْ أَتَى";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ اللہ کے رسول ﷺ جمعۃ المبارک کے دن صبح کی نماز میں (المo تنزیل) اور (ھل اتی) پڑھا کرتے تھے۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;