var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ ح و أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ وَاللَّفْظُ لَهُ عَنْ الْمُخَوَّلِ بْنِ رَاشِدٍ عَنْ مُسْلِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الصُّبْحِ يَوْمَ الْجُمُعَةِ تَنْزِيلُ السَّجْدَةَ وَهَلْ أَتَى عَلَى الْإِنْسَانِ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ جمعۃ المبارک کے دن صبح کی نماز میں (تنزیل) السجدۃ اور (ھل اتی علی الانسان) پڑھا کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;