var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ عُمَرَ بْنِ ذَرٍّ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي ص وَقَالَ سَجَدَهَا دَاوُدُ تَوْبَةً وَنَسْجُدُهَا شُكْرًا";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی ﷺ نے سورۂ صٓ میں سجدہ کیا اور فرمایا: ’’داود علیہ السلام نے یہ سجدہ بطور توبہ کیا تھا اور ہم اسے شکرانے کے طور پر کرتے ہیں۔‘‘";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;