var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَرَأَ بِهِمْ إِذَا السَّمَاءُ انْشَقَّتْ فَسَجَدَ فِيهَا فَلَمَّا انْصَرَفَ أَخْبَرَهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِيهَا";
nasai.urdu = "حضرت ابوسلمہ بن عبدالرحمٰن سے روایت ہے کہ حضرت ابوہریرہ رضی اللہ عنہ نے ان پر (نماز میں) سورۂ (اذا السماء انشقت) پڑھی اور سجدہ کیا۔جب (نماز سے) فارغ ہوئے تو انھیں بتایا کہ رسول اللہ ﷺ نے بھی اس سورت میں سجدہ فرمایا تھا۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;