var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ قَالَ أَنْبَأَنَا ابْنُ أَبِي ذِئْبٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عَيَّاشٍ عَنْ ابْنِ قَيْسٍ وَهُوَ مُحَمَّدٌ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے سورہ (اذا السماء انشقت) میں سجدہ فرمایا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;