var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَ قَالَ سَجَدْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ہم نے نبی ﷺ کے ساتھ سورہ (اذا السماء انشقت) اور سورہ (ااقرا باسم ربک) میں سجدہ تلاوت کیا۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;