var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَجَدَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا فِي إِذَا السَّمَاءُ انْشَقَّتْ وَمَنْ هُوَ خَيْرٌ مِنْهُمَا";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ حضرت ابوبکر اور حضرت عمر رضی اللہ عنہ نے سورۂ (اذا السماء انشقت) میں سجدہ کیا،نیز اس شخصیت (رسول اللہ ﷺ) نے بھی جو ان دونوں سے بہتر تھی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;