var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْمُعْتَمِرُ عَنْ قُرَّةَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَجَدَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا وَمَنْ هُوَ خَيْرٌ مِنْهُمَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ حضرت ابوبکر،حضرت عمر رضی اللہ عنہما اور وہ شخصیت جو ان دونوں سے بہتر تھی (رسول اللہ ﷺ) ان سب نے سورہ (اذا السماء انشقت) اور سورہ (اقرا باسم ربک) میں سجدہ کیا ہے۔";
nasai.hukam = "صحیح";
nasai.description = ``;