var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءِ بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ وَوَكِيعٌ عَنْ سُفْيَانَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءِ بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَجَدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کے ساتھ (اذا السماء انشقت) اور (اقرا باسم ربک) میں سجدہ کیا ہے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;