var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ رَقَبَةَ عَنْ عَطَاءٍ قَالَ قَالَ أَبُو هُرَيْرَةَ كُلُّ صَلَاةٍ يُقْرَأُ فِيهَا فَمَا أَسْمَعَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْمَعْنَاكُمْ وَمَا أَخْفَاهَا أَخْفَيْنَا مِنْكُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ ہر نماز میں قرآن پڑھا جاتا ہے۔جس نماز میں ہمیں رسول اللہ ﷺ نے سنا دیا (اونچی آواز سے پڑھا) ہم نے تمھیں سنا دیا اور جس نماز میں ہم سے مخفی رکھا (آہستہ پڑھا) ہم نے تم سے مخفی رکھا۔";
nasai.hukam = "صحیح";
nasai.description = ``;