var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَ فِي كُلِّ صَلَاةٍ قِرَاءَةٌ فَمَا أَسْمَعَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْمَعْنَاكُمْ وَمَا أَخْفَاهَا أَخْفَيْنَا مِنْكُمْ";
nasai.urdu = "حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ہر نماز میں قراءت ہے،جو ہمیں اللہ کے رسول ﷺ نے سنائی ہے،وہ ہم نے تمھیں سنائی اور جو آپ نے ہم سے مخفی رکھی وہ ہم نے تم سے مخفی رکھی۔";
nasai.hukam = "متفق علیہ";
nasai.description = ``;