var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ صُدْرَانَ قَالَ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ قَالَ حَدَّثَنَا هَاشِمُ بْنُ الْبَرِيدِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ كُنَّا نُصَلِّي خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فَنَسْمَعُ مِنْهُ الْآيَةَ بَعْدَ الْآيَاتِ مِنْ سُورَةِ لُقْمَانَ وَالذَّارِيَاتِ";
nasai.urdu = "حضرت براء (بن عازب) رضی اللہ عنہ فرماتے ہیں کہ ہم نبی ﷺ کے پیچھے ظہر کی نماز پڑھ رہے تھے اور ہمیں چند آیتوں کے بعد ایک آیت سورہ لقمان اور سورہ ذاریات کی سنائی دیتی تھی۔";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>ابن ماجہ (830)<br>أبوإسحاق عنعن۔`;
nasai.anwaar = [328,1];