var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَطِيَّةَ بْنِ قَيْسٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ لَقَدْ كَانَتْ صَلَاةُ الظُّهْرِ تُقَامُ فَيَذْهَبُ الذَّاهِبُ إِلَى الْبَقِيعِ فَيَقْضِي حَاجَتَهُ ثُمَّ يَتَوَضَّأُ ثُمَّ يَجِيءُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّكْعَةِ الْأُولَى يُطَوِّلُهَا";
nasai.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ تحقیق ظہر کی اقامت ہوتی اور کوئی جانے والا بقیع تک جاتا اور قضائے حاجت کرتا،پھر وضو کرکے واپس آتا تو رسول اللہ ﷺ ابھی پہلی رکعت میں ہوتے تھے۔اسے (اس قدر) لمبی کرتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;