var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ بِالسَّمَاءِ ذَاتِ الْبُرُوجِ وَالسَّمَاءِ وَالطَّارِقِ وَنَحْوِهِمَا";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ سے منقول ہے،انھوں نے فرمایا: نبی ﷺ ظہر اور عصر کی نمازوں میں (والسمآء ذات البروج) اور (والسماء والطارق) اور ان جیسی سورتیں پڑھا کرتے تھے۔";
nasai.hukam = "إسنادہ حسن";
nasai.description = ``;