var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ شُعْبَةَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الظُّهْرِ وَاللَّيْلِ إِذَا يَغْشَى وَفِي الْعَصْرِ نَحْوَ ذَلِكَ وَفِي الصُّبْحِ بِأَطْوَلَ مِنْ ذَلِكَ";
nasai.urdu = "حضرت جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی ﷺ ظہر کی نماز (والیل اذا یغشی) (اور اس جیسی سورت) پڑھتے۔اور عصر کی نماز میں بھی اس قسم کی سورتیں پڑھتے تھے۔اور صبح کی نماز میں اس سے لمبی سورتیں پڑھتے تھے۔";
nasai.hukam = "صحیح مسلم";
nasai.description = ``;