var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ عَنْ حُمَيْدٍ عَنْ أَنَسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ قَالَتْ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهِ الْمَغْرِبَ فَقَرَأَ الْمُرْسَلَاتِ مَا صَلَّى بَعْدَهَا صَلَاةً حَتَّى قُبِضَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
nasai.urdu = "حضرت ام فضل بنت حارث رضی اللہ عنہما سے روایت ہے،وہ فرماتی ہیں: رسول اللہ ﷺ نے ہمیں اپنے گھر میں مغرب کی نماز پڑھائ یاور سورہ مرسلات پڑھی۔اس کے بعد آپ نے کوئی باجماعت نماز نہیں پڑھائی حتی کہ آپ ﷺ فوت ہوگئے۔";
nasai.hukam = "صحیح";
nasai.description = ``;