var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا حَيْوَةُ وَذَكَرَ آخَرَ قَالَا حَدَّثَنَا جَعْفَرُ بْنُ رَبِيعَةَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ حَدَّثَهُ أَنَّ مُعَاوِيَةَ بْنَ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُتْبَةَ بْنِ مَسْعُودٍ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي صَلَاةِ الْمَغْرِبِ بِ حم الدُّخَانِ";
nasai.urdu = "حضرت عبداللہ بن عتبہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مغرب کی نماز میں سورہ حم الدخان پڑھی۔";
nasai.hukam = "إسنادہ صحیح";
nasai.description = ``;