var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ الَّذِي أُرِيَ النِّدَاءَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ مَرَّتَيْنِ وَغَسَلَ رِجْلَيْهِ مَرَّتَيْنِ وَمَسَحَ بِرَأْسِهِ مَرَّتَيْنِ";
nasai.urdu = "حضرت عبداللہ بن زید رضی اللہ عنہ جنھیں خواب میں اذان دکھلائی گئی تھی،سے منقول ہے،کہتے ہیں کہ میں نے رسول اللہ ﷺ کو وضو کرتے دیکھا،چنانچہ آپ نے اپنا چہرہ تین دفعہ دھویا اور دو بازو دو دفعہ دھوئے۔پاؤں کو بھی دو مرتبہ دھویا اور اپنے سر کا مسح دو دفعہ کیا۔";
nasai.hukam = "ضعیف";
nasai.description = `ضعیف لشذوذہ<br>سفیان بن عیینۃ صرح بالسماع ولکنہ شک في ھذا اللفظ ’’مسح برأسہ مرتین‘‘ وھو شاذ۔<br>وللحدیث شاہد ضعیف في سنن أبي داود (126)`;
nasai.anwaar = [321,1];