var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا زَائِدَةُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ رَبِيعِ بْنِ خُثَيْمٍ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ امْرَأَةٍ عَنْ أَبِي أَيُّوبَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْ هُوَ اللَّهُ أَحَدٌ ثُلُثُ الْقُرْآنِ قَالَ أَبُو عَبْد الرَّحْمَنِ مَا أَعْرِفُ إِسْنَادًا أَطْوَلَ مِنْ هَذَا";
nasai.urdu = "حضرت ابو ایوب رضی اللہ عنہ سے مروی ہے،نبی ﷺ نے فرمایا: ’’سورہ (قل ھو اللہ احد) قرآن مجید کا ایک تہائی حصہ ہے۔‘‘ ابو عبدالرحمٰن (امام نسائی) رحمہ اللہ بیان کرتے ہیں کہ میں اس سے لمبی سند نہیں جانتا۔";
nasai.hukam = "حسن";
nasai.description = ``;