var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرٍ قَالَ قَامَ مُعَاذٌ فَصَلَّى الْعِشَاءَ الْآخِرَةَ فَطَوَّلَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَتَّانٌ يَا مُعَاذُ أَفَتَّانٌ يَا مُعَاذُ أَيْنَ كُنْتَ عَنْ سَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَالضُّحَى وَإِذَا السَّمَاءُ انْفَطَرَتْ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے منقول ہے کہ ایک دفعہ معاذ رضی اللہ عنہ نے عشاء کی نماز پڑھائی تو بہت لمبی کر دی۔نبی ﷺنے فرمایا: ’’اے معاذ کیا تو فتنے باز ہے؟ اے معاذ! کیا لولوں کو فتنے میں ڈالتا ہے؟ تو (سبح اسم ربک الاعلی) اور (والضحی) اور (اذا السمآء انفطرت) سے کہاں چلا گیا تھا؟‘‘";
nasai.hukam = "ضعیف";
nasai.description = `إسنادہ ضعیف<br>سلیمان الأعمش مدلس وعنعن۔`;
nasai.anwaar = [328,1];