var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ ثَوْبَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي عَلَى الْحَقِّ مَنْصُورِينَ لَا يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ عَزَّ وَجَلَّ";
ibnemaja.urdu = "حضرت ثوبان رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘میری امت کی ایک جماعت ہمیشہ حق پر قائم رہے گی اور اس کی مدد کی جاتی رہے گی،ان کی مخالفت کرنے والے انہیں نقصان نہیں پہنچا سکیں گے،حتی کہ اللہ تعالیٰ کا حکم (قیامت) آجائے۔’’";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;