var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو شُعَيْبٍ صَالِحُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ بَكْرِ بْنِ خُنَيْسٍ قَالَ: حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ،عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَبُو بَكْرٍ وَعُمَرُ سَيِّدَا كُهُولِ أَهْلِ الْجَنَّةِ مِنَ الْأَوَّلِينَ وَالْآخِرِينَ،إِلَّا النَّبِيِّينَ وَالْمُرْسَلِينَ»";
ibnemaja.urdu = "حضرت ابو جحیفہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:‘‘ ابو بکر اور عمر رضی اللہ عنہما پہلے اور پچھلے معمر جنتیوں کے سردار ہیں،لیکن نبیوں اور رسولوں کے سوا۔’’";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;