var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنِ الْعَلَاءِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،وعَنْ سُهَيْلٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا،وَشَرُّهَا أَوَّلُهَا،وَخَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا،وَشَرُّهَا آخِرُهَا»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’عورتوں کی بہترین صفیں آخری ہیں۔اور سب سے نکمی(کم ثواب والی) صفیں پہلی ہیں۔اور مردوں کی بہترین صفیں پہلی ہیں اور سب سے نکمی صفیں آخری ہیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;