var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ صُفُوفِ الرِّجَالِ مُقَدَّمُهَا،وَشَرُّهَا مُؤَخَّرُهَا،وَخَيْرُ صُفُوفِ النِّسَاءِ مُؤَخَّرُهَا،وَشَرُّهَا مُقَدَّمُهَا»";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مردوں کی بہترین صفیں آگے والی ہیں،اور(ان کی) سب سے نکمی صفیں پیچھے والی ہیں،اور عورتوں کی بہترین صفیں پیچھے والی ہیں اور (ان کی) سب سے نکمی(اور کم ثواب والی) صفیں آگے والی ہیں۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;