var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ أَبُو طَالِبٍ قَالَ: حَدَّثَنَا أَبُو دَاوُدَ،وَأَبُو قُتَيْبَةَ قَالَا: حَدَّثَنَا هَارُونُ بْنُ مُسْلِمٍ،عَنْ قَتَادَةَ،عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ،عَنْ أَبِيهِ،قَالَ: «كُنَّا نُنْهَى أَنْ نَصُفَّ بَيْنَ السَّوَارِي عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنُطْرَدُ عَنْهَا طَرْدًا»";
ibnemaja.urdu = "سیدنا معاویہ بن قرہ اپنے والد(سیدنا قرہ بن ایاس مزنی رضی اللہ عنہ) سے روایت کرتے ہیں،انہوں نے فرمایا: ہمیں رسول اللہ ﷺ کے زمانے میں ستونوں کے درمیان صف بنانے سے منع کیا جاتا تھا اور اس سے سختی کے ساتھ روکا جاتا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قتادۃ مدلس و عنعن <br>و حدیث أبي داود (673) عن أنس: ’’کنا نتقي ھذا علی عہد رسول اللّٰہ ﷺ ‘‘<br>سندہ صحیح وھو یغني عنہ`;
ibnemaja.anwaar = [413,1];