var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ هِلَالِ بْنِ يَسَافٍ قَالَ أَخَذَ بِيَدِي زِيَادُ بْنُ أَبِي الْجَعْدِ فَأَوْقَفَنِي عَلَى شَيْخٍ بِالرَّقَّةِ يُقَالُ لَهُ وَابِصَةُ بْنُ مَعْبَدٍ فَقَالَ صَلَّى رَجُلٌ خَلْفَ الصَّفِّ وَحْدَهُ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ";
ibnemaja.urdu = "سیدنا وابصہ بن معبد رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک آدمی نے صف کے پیچھے اکیلے کھڑے ہو کر نماز پڑھی تو نبی ﷺ نے اسے نماز دوبارہ پڑھنے کا حکم دیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;