var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى مَيَامِنِ الصُّفُوفِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بے شک اللہ تعالیٰ صفوں کی دائیں جناب پر رحمتیں نازل کرتا ہے اور فرشتے اس کے لئے دعائے خیر کرتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (676)`;
ibnemaja.anwaar = [413,1];