var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنْ ابْنِ الْبَرَاءِ بْنِ عَازِبٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِسْعَرٌ مِمَّا نُحِبُّ أَوْ مِمَّا أُحِبُّ أَنْ نَقُومَ عَنْ يَمِينِهِ";
ibnemaja.urdu = "سیدنا براء رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ جب رسول اللہ ﷺ کے پیچھے نماز پڑھتے تھے تو ہمیں۔۔۔۔یا فرمایا: مجھے۔۔۔۔یہ بات پسند تھی کہ ہم دائیں طرف کھڑے ہوں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;