var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْحُسَيْنِ أَبُو جَعْفَرٍ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ الْكِلَابِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ عَنْ لَيْثِ بْنِ أَبِي سَلِيمٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قِيلَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مَيْسَرَةَ الْمَسْجِدِ تَعَطَّلَتْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عَمَّرَ مَيْسَرَةَ الْمَسْجِدِ كُتِبَ لَهُ كِفْلَانِ مِنْ الْأَجْرِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ سے عرض کیا گیا: مسجد کی بائیں جانب تو بالکل خالی ہوگئی۔(لوگ ثواب کی نیت سے دائیں طرف کھڑے ہوتے ہیں) تو نبی ﷺ نے فرمایا: ’’جس نے مسجد کی بائیں جانب کو آباد کیا اسے دگنا ثواب ملے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،لضعف لیث بن أبي سلیم ‘‘`;
ibnemaja.anwaar = [413,1];