var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا هُشَيْمٌ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ عُمَرُ قُلْتُ يَا رَسُولَ اللَّهِ لَوْ اتَّخَذْتَ مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى فَنَزَلَتْ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى)البقرۃ:125";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،سیدنا عمر رضی اللہ عنہ نے فرمایا: میں نے عرض کیا: اے اللہ کے رسول! کاس! آپ مقام ابراہیم کے قریب نماز پڑھیں،تو یہ آیت نازم ہوئی:(وَ اتَّخِذُوْا مِنْ مَّقَامِ اِبْرٰہٖمَ مُصَلًّی ۭ) ’’تم مقام ابراہیم کو نماز کی جگہ مقرر کر لو۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;