var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ،وَالْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ،قَالَا: حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ،أَيُّ النَّاسِ أَحَبُّ إِلَيْكَ؟ قَالَ: «عَائِشَةُ» قِيلَ: مِنَ الرِّجَالِ؟ قَالَ: «أَبُوهَا»";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ کسی نے عرض کیا: اے اللہ کے رسول! کون سا شخص آپ کو سب سے زیادہ پیارا ہے؟ آپ نے فرمایا:‘‘ عائشہ۔’’عرض کیا گیا مردوں میں سے کون؟ فرمایا:‘‘ ان کے والد(ابو بکر رضی اللہ عنہ)۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;