var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْأَزْدِيُّ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ قِبْلَةٌ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مشرق اور مغرب کے درمیان قبلہ ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;