var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ كَثِيرِ بْنِ زَيْدٍ عَنْ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلَا يَجْلِسْ حَتَّى يَرْكَعَ رَكْعَتَيْنِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضٰ اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب کوئی شخص مسجد میں داخل ہو تو دو رکعت نماز پڑھے بغیر نہ بیٹھے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;