var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ عَنْ أَبِي قَتَادَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيُصَلِّ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ";
ibnemaja.urdu = "سیدنا ابو قتادہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب کوئی شخص مسجد میں داخل ہو تو اسے چاہیے کہ بیٹھے سے پہلے دو رکعت نماز پڑھ لے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;