var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ كُنَّا نُسَلِّمُ فِي الصَّلَاةِ فَقِيلَ لَنَا إِنَّ فِي الصَّلَاةِ لَشُغْلًا";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم نماز میں(ایک دوسرے کو) سلام کر لیا کرتے تھے۔پھر ہمیں فرمایا گیا: نماز میں مصروفیت ہوتی ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;