var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ قَالَ: أَخْبَرَنِي الْجُرَيْرِيُّ،عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ،قَالَ: قُلْتُ لِعَائِشَةَ: أَيُّ أَصْحَابِهِ كَانَ أَحَبَّ إِلَيْهِ؟ قَالَتْ: «أَبُو بَكْرٍ» قُلْتُ: ثُمَّ أَيُّهُمْ؟ قَالَتْ: «عُمَرُ» قُلْتُ: ثُمَّ أَيُّهُمْ؟ قَالَتْ: «أَبُو عُبَيْدَةَ»";
ibnemaja.urdu = "حضرت عبداللہ بن شقیق رحمہ اللہ سے روای تہے،انہوں نے کہا: میں نے حضرت عائشہ رضی اللہ عنہا سے عرض کیا: نبی ﷺ کو اپنے کس صحابی سے سب سے زیادہ محبت تھی؟ انہوں نے کہا: ابو بکر رضی اللہ عنہ سے۔میں نے کہا: ان کے بعد کون(زیادہ محبوب تھے؟)فرمایا: عمر رضی اللہ عنہ۔میں نے کہا: پھر کون؟ فرمایا: ابو عبیدہ رضی اللہ عنہ۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;