var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ طَارِقِ بْنِ عَبْدِ اللَّهِ الْمُحَارِبِيِّ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّيْتَ فَلَا تَبْزُقَنَّ بَيْنَ يَدَيْكَ وَلَا عَنْ يَمِينِكَ وَلَكِنْ ابْزُقْ عَنْ يَسَارِكَ أَوْ تَحْتَ قَدَمِكَ";
ibnemaja.urdu = "سیدنا طارق بن عبداللہ محاربی رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب تو نماز پڑ ھ رہا ہو تو اپنے سامنے ہر گز نہ تھوکنا،نہ دائیں طرف تھوکنا،البتہ بائیں طرف یا قدم کے نیچے تھوک سکتے ہو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;