var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ وَعَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَزَقَ فِي ثَوْبِهِ وَهُوَ فِي الصَّلَاةِ ثُمَّ دَلَكَهُ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے نماز کے دوران میں کپڑے میں تھوکا،پھر اسے مل دیا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;