var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ حَدَّثَنِي مُعَيْقِيبٌ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْحِ الْحَصَى فِي الصَّلَاةِ إِنْ كُنْتَ فَاعِلًا فَمَرَّةً وَاحِدَةً";
ibnemaja.urdu = "سیدنا معیقیب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے نماز کے دوران میں کنکریوں پر ہاتھ پھیرنے کے بارے میں فرمایا: ’’اگر تم نے ضرور یہ کام کرنا ہو تو ایک بار کر لو۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;