var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْأَحْوَصِ اللَّيْثِيِّ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ إِلَى الصَّلَاةِ فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ فَلَا يَمْسَحْ بِالْحَصَى";
ibnemaja.urdu = "سیدنا ابو ذر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب کوئی شخص نماز پڑھنے کھڑا ہوتا ہے تو رحمت الٰہی اس کی طرف متوجہ ہوتی ہے،اس لئے اسے چاہیے کہ(دوران نماز میں)کنکریوں پر ہاتھ نہ پھیرے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;