var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ حَدَّثَتْنِي مَيْمُونَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الْخُمْرَةِ";
ibnemaja.urdu = "ام المومنین سیدہ میمونہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ چھوٹی چٹائی پر نماز ادا فرماتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;