var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُحَمَّدٍ الطَّلْحِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ خِرَاشٍ الْحَوْشَبِيُّ،عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: لَمَّا أَسْلَمَ عُمَرُ،نَزَلَ جِبْرِيلُ فَقَالَ: يَا مُحَمَّدُ،لَقَدِ اسْتَبْشَرَ أَهْلُ السَّمَاءِ بِإِسْلَامِ عُمَرَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ انہوں نے فرمایا: جب حضرت عمر رضی اللہ عنہ اسلام لائے تو جبریل علیہ السلام نازل ہوئے اور فرمایا: اے محمدﷺ! عمر کے اسلام لانے سے آسمان والے(فرشتے) بھی خوش ہوگئے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن خراش: ضعفہ الجمہور و قال الھیثمي: و ضعفہ الجمھور (مجمع الزوائد 25/4) <br>و قال الحافظ ابن حجر: ضعیف و أطلق علیہ ابن عمار الکذب (تقریب: 3293)`;
ibnemaja.anwaar = [378,2];