var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي زَمْعَةُ بْنُ صَالِحٍ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ صَلَّى ابْنُ عَبَّاسٍ وَهُوَ بِالْبَصْرَةِ عَلَى بِسَاطِهِ ثُمَّ حَدَّثَ أَصْحَابَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى بِسَاطِهِ";
ibnemaja.urdu = "سیدنا عمرو بن دینار رحمہ اللہ سے روایت ہے انہوں نے کہا: سیدنا عبداللہ بن عباس رضی اللہ عنہما نے بصرہ میں اپنے بچھونے پر نماز پڑھی،پھر اپنے ساتھیوں کو بتایا کہ رسول اللہ ﷺ بھی اپنے بچھونے پر نماز پڑھ لیا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>زمعۃ بن صالح ضعیف <br>وحدیث البخاري (6203) ومسلم (2150) یغني عنہ`;
ibnemaja.anwaar = [414,1];