var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ إِسْمَعِيلَ بْنِ أَبِي حَبِيبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ جَاءَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِنَا فِي مَسْجِدِ بَنِي عَبْدِ الْأَشْهَلِ فَرَأَيْتُهُ وَاضِعًا يَدَيْهِ عَلَى ثَوْبِهِ إِذَا سَجَدَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عبدالرحمٰن رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ ہمارے ہاں تشریف لائے اور بنو عبدالاشہل کی مسجد میں ہمیں نماز پڑھائی،میں نے آپ و کو سجدہ کے دوران میں دونوں ہاتھ کپڑے پر رکھے ہوئے دیکھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إسماعیل بن أبي حبیبۃ: فیہ ضعف (تقریب: 433) أ ي من جھۃ جھالتہ لأنہ مجھول والسند منقطع`;
ibnemaja.anwaar = [414,1];