var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي أُوَيْسٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ الْأَشْهَلِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَابِتِ بْنِ الصَّامِتِ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي بَنِي عَبْدِ الْأَشْهَلِ وَعَلَيْهِ كِسَاءٌ مُتَلَفِّفٌ بِهِ يَضَعُ يَدَيْهِ عَلَيْهِ يَقِيهِ بَرْدَ الْحَصَى";
ibnemaja.urdu = "سیدنا ثابت بن صامت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے قبیلہ بنو عبدالاشہل کے محلے(کی مسجد) میں نماز ادا فرمائی اور آ پ نے ایک چادر اوڑھ رکھی تھی،کنکریوں کی ٹھنڈک سے بچنے کے لئے (سجدہ کرتے وقت اس پر ہاتھ رکھ لیتےتھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إبراہیم بن إسماعیل بن أبي حبیبۃ: ضعیف (ضعیف سنن الترمذ ي: 1462)`;
ibnemaja.anwaar = [414,1];