var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ غَالِبٍ الْقَطَّانِ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شِدَّةِ الْحَرِّ فَإِذَا لَمْ يَقْدِرْ أَحَدُنَا أَنْ يُمَكِّنَ جَبْهَتَهُ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ سکت گرمی میں نبی ﷺ کی اقتدا میں نماز پڑھتے تھے۔جب کوئی زمین پر اپنی پیشانی نہ رکھ سکتا تو اپنا کپڑا بچھا کر اس پر سجدہ کر لیتا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;