var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ وَعُبَيْدُ اللَّهِ عَنْ نَافِعٍ أَنَّهُ كَانَ يَقُولُ قَالَ ابْنُ عُمَرَ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلنِّسَاءِ فِي التَّصْفِيقِ وَلِلرِّجَالِ فِي التَّسْبِيحِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے عورتوں کو تالی بجانے کی اجازت دی ہے،اور مردوں کو سبحان اللہ کہنے کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سوید بن سعید: ضعیف ضعفہ الأئمۃ من أجل اختلاطہ ولا یحتج بہ إلا ما یروي عنہ مسلم في صحیحہ <br>والحدیث السابق (الأصل: 1035) یغني عنہ`;
ibnemaja.anwaar = [414,1];