var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ النُّعْمَانِ بْنِ سَالِمٍ عَنْ ابْنِ أَبِي أَوْسٍ قَالَ كَانَ جَدِّي أَوْسٌ أَحْيَانًا يُصَلِّي فَيُشِيرُ إِلَيَّ وَهُوَ فِي الصَّلَاةِ فَأُعْطِيهِ نَعْلَيْهِ وَيَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْهِ";
ibnemaja.urdu = "سیدنا ابن ابی اوس رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میرے دادا سیدنا اوس رضی اللہ عنہ بعض اوقات نماز پڑھ رہے ہوتے تو نماز کے دوران ہی میں مجھے اشارہ کرتے تو میں انہیں جوتے دے دیتا۔وہ فرمایا کرتے تھے:میں نے رسول اللہ ﷺ کو جوتے پہن کر نماز ادا کرتے دیکھا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;