var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَافِيًا وَمُنْتَعِلًا";
ibnemaja.urdu = "سیدنا عمرو بن شعیب رحمہ اللہ اپنے والد سے اور وہ اپنے دادا سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو جوتے اتار کر نماز پڑھتے دیکھا ہے،اور جوتے پہن کر بھی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;