var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ لَقَدْ رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي النَّعْلَيْنِ وَالْخُفَّيْنِ";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم نے رسول اللہ ﷺ کو جوتے اور موزے پہن کر نماز پرھتے دیکھا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو إسحاق عنعن`;
ibnemaja.anwaar = [414,1];