var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُحَمَّدٍ الطَّلْحِيُّ قَالَ: أَنْبَأَنَا دَاوُدُ بْنُ عَطَاءٍ الْمَدِينِيُّ،عَنْ صَالِحِ بْنِ كَيْسَانَ،عَنِ ابْنِ شِهَابٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أُبَيِّ بْنِ كَعْبٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ مَنْ يُصَافِحُهُ الْحَقُّ عُمَرُ،وَأَوَّلُ مَنْ يُسَلِّمُ عَلَيْهِ،وَأَوَّلُ مَنْ يَأْخُذُ بِيَدِهِ فَيُدْخِلُهُ الْجَنَّةَ»";
ibnemaja.urdu = "حضرت ابی بن کعب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ حق تعالیٰ سب سے پہلے جس شخص سے مصافحہ کرے گا اور سب سے پہلے جسے سلام کہے گا اور جسے سب سے پہلے ہاتھ پکڑ کر جنت میں داخل کرے گا وہ عمر رضی اللہ عنہ ہیں۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>داود بن عطاء: ضعیف (تقریب: 1801) والسند ضعفہ البوصیري <br>وقال في داود بن عطاء: ’’ قد اتفقوا علی ضعفہ ‘‘`;
ibnemaja.anwaar = [379,1];