var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ أُمِرْنَا أَلَّا نَكُفَّ شَعَرًا وَلَا ثَوْبًا وَلَا نَتَوَضَّأَ مِنْ مَوْطَإٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہمیں حکم دیا گیا ہے کہ ہم (نماز میں) بال یا کپڑے نہ سمیٹیں،اور (ناپاک جگہ پر) پاؤں پڑ جانے کی وجہ سے وضو نہ کریں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (204)`;
ibnemaja.anwaar = [414,1];