var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَرْفَعُوا أَبْصَارَكُمْ إِلَى السَّمَاءِ أَنْ تَلْتَمِعَ يَعْنِي فِي الصَّلَاةِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اسمان کی طرف نظریں نہ اٹھاؤ،مبادا اچک لی جائیں۔‘‘یعنی نماز میں اوپر نظر نہ اٹھاؤ۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;