var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ جَابِرِ بْنِ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَنْتَهِيَنَّ أَقْوَامٌ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ أَوْ لَا تَرْجِعُ أَبْصَارُهُمْ";
ibnemaja.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جو لوگ (نماز میں) آسمان کی طرف نظریں اٹھاتے ہیں،انہیں ضرور باز آجانا چاہیے ورنہ ان کی نظریں واپس (زمین کی طرف) نہیں لوٹیں گی (بلکہ چھیں لی جائیں گی۔)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;