var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ أَتَى رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَحَدُنَا يُصَلِّي فِي الثَّوْبِ الْوَاحِدِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَ كُلُّكُمْ يَجِدُ ثَوْبَيْنِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ’’ایک آدمی نبی ﷺ کی خدمت میں حاضر ہوا اور عرض کیا: اے اللہ کے رسول! اگر کوئی شخص ایک کپڑے میں نما زپڑھ لے (تو کیا حکم ہے؟) نبی ﷺ نے فرمایا: ’’کیا ہر کسی کو دو کپڑے میسر ہوتے ہیں؟‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;