var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ أَنَّهُ دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا بِهِ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ وہ رسول اللہ ﷺ کی خدمت میں حاضر ہوئے تو آپ ﷺ ایک کپڑا توشح کے انداز سے اوڑھ کر نماز پڑھ رہے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;