var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا بِهِ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقَيْهِ";
ibnemaja.urdu = "سیدنا عمر بن ابو سلمہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو ایک کپڑا اوڑھ کر نماز پڑھتے دیکھا،نبی ﷺ نے اسے توشح کے انداز سے اوڑھ رکھا تھا،اور اس کے دونوں سرے آپ ﷺ کے کندھوں پر تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;