var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ أَبُو عُبَيْدٍ الْمَدِينِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الْمَاجِشُونِ قَالَ: حَدَّثَنِي الزَّنْجِيُّ بْنُ خَالِدٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ أَعِزَّ الْإِسْلَامَ بِعُمَرَ بْنِ الْخَطَّابِ خَاصَّةً»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا؛‘‘ اے اللہ! اسلام کو خاص طور پر عمر بن خطاب کے ذریعے سے قوت بخش۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>مسلم بن خالد الزنجي: ضعیف،ضعفہ النسائي (الضعفاء: 569) والجمھور وقال البخاري: ’’ منکر الحدیث‘‘ (کتاب الضعفاء بتحقیقي: 352) <br>وانظر ضعیف سنن أبي داود (3510) <br>وللحدیث شاھد معلول عندالحاکم (3/ 83 ح 4485)`;
ibnemaja.anwaar = [379,1];