var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنَا مُحَمَّدُ بْنُ حَنْظَلَةَ بْنِ مُحَمَّدِ بْنِ عَبَّادٍ الْمَخْزُومِيُّ عَنْ مَعْرُوفِ بْنِ مُشْكَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَيْسَانَ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالْبِئْرِ الْعُلْيَا فِي ثَوْبٍ";
ibnemaja.urdu = "سیدنا عبدالرحمٰن بن کیسان رحمہ اللہ اپنے والد (سیدنا کیسان بن جریر رضی اللہ عنہ) سے روایت کرتے ہیں انہوں نے فرمایا: میں نے بئر علیا کے مقام پر رسول اللہ ﷺ کو ایک کپڑے میں نماز پڑھتے دیکھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد الرحمٰن بن کیسان مستور (تقریب:3992) <br>والحدیث السابق (الأصل: 1049) یغني عنہ`;
ibnemaja.anwaar = [415,1];