var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عَمْرُو بْنُ كَثِيرٍ حَدَّثَنَا ابْنُ كَيْسَانَ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الظُّهْرَ وَالْعَصْرَ فِي ثَوْبٍ وَاحِدٍ مُتَلَبِّبًا بِهِ";
ibnemaja.urdu = "سیدنا کیسان رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو ایک کپڑا سینے پر گرہ دے کر ظہر اور عصر کی نمازیں پڑھتے دیکھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1050)`;
ibnemaja.anwaar = [415,1];