var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ عُمَرَ الدِّمَشْقِيِّ عَنْ أُمِّ الدَّرْدَاءِ قَالَتْ حَدَّثَنِي أَبُو الدَّرْدَاءِ أَنَّهُ سَجَدَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى عَشْرَةَ سَجْدَةً مِنْهُنَّ النَّجْمُ";
ibnemaja.urdu = "سیدنا ابو درداء رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی ﷺ کے ساتھ گیراہ سجدے کیے۔ان میں سے ایک سورہٴ نجم میں ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (568)`;
ibnemaja.anwaar = [415,1];