var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ عَنْ نَافِعِ بْنِ يَزِيدَ حَدَّثَنَا الْحَارِثُ بْنُ سَعِيدٍ الْعُتَقِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُنَيْنٍ مِنْ بَنِي عَبْدِ كِلَالٍ عَنْ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَهُ خَمْسَ عَشْرَةَ سَجْدَةً فِي الْقُرْآنِ مِنْهَا ثَلَاثٌ فِي الْمُفَصَّلِ وَفِي الْحَجِّ سَجْدَتَيْنِ";
ibnemaja.urdu = "سیدنا عمرو بن عاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے انہیں پندرہ سجدے پڑھائے جن میں تین مفصل سورتوں میں ہیں اور سورہٴ حج میں دو سجدے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1401)`;
ibnemaja.anwaar = [415,1];