var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءِ بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَجَدْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم نے رسول اللہ ﷺ کے ساتھ سورہٴ (اذا السماء انشقت) اور سورہٴ(اقرا باسم ربک) میں سجدہٴ تلاوت کیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;