var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ عَمْرِو بْنِ مُرَّةَ،عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ،قَالَ: سَمِعْتُ عَلِيًّا،يَقُولُ: «خَيْرُ النَّاسِ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَبُو بَكْرٍ،وَخَيْرُ النَّاسِ بَعْدَ أَبِي بَكْرٍ عُمَرُ»";
ibnemaja.urdu = "حضرت عبداللہ بن سلمہ رحمہ اللہ سے روایت ہے،انہوں نے کہا: میں نے حضرت علی رضی اللہ عنہ سے سنا،وہ فرما رہے تھے: اللہ کے رسول ﷺ کے بعد سب سے افضل انسان ابو بکر رضی اللہ عنہ ہیں اور ابو بکر رضی اللہ عنہ کے بعد سب سے افضل انسان عمر رضی اللہ عنہ ہیں۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;