var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ زُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عُمَرَ قَالَ صَلَاةُ السَّفَرِ رَكْعَتَانِ وَالْجُمُعَةُ رَكْعَتَانِ وَالْعِيدُ رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: سفر کی نماز دو رکعت ہے،جمعے کی نماز دو رکعت ہے اور عید کی نماز دو رکعت ہے۔سیدنا محمد ﷺ کی زبان مبارک کی رُو سے یہ مکمل ہیں،ناقص نہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;