var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ أَنْبَأَنَا يَزِيدُ بْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ زُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ عَنْ عُمَرَ قَالَ صَلَاةُ السَّفَرِ رَكْعَتَانِ وَصَلَاةُ الْجُمُعَةِ رَكْعَتَانِ وَالْفِطْرُ وَالْأَضْحَى رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: سفر کی نماز دو رکعت ہے،جمعے کی نماز دو رکعت ہے،عید الفطر اور عید الاضحیٰ کی نماز دو رکعت ہے۔محمد ﷺ کے ارشاد کے مطابق یہ مکمل ہیں،ناقص نہیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;