var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ بِشْرِ بْنِ حَرْبٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مِنْ هَذِهِ الْمَدِينَةِ لَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى يَرْجِعَ إِلَيْهَا";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جب اس مدینہ شریف سے(سفر پر) روانہ ہوتے تھے تو دو رکعت سے زیادہ نماز نہیں پڑھتے تھے(پورے سفر میں دوگانہ پڑھتے رہتے) حتی کہ واپس مدینہ شریف پہنچ جاتے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;