var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ وَجُبَارَةُ بْنُ الْمُغَلِّسِ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ افْتَرَضَ اللَّهُ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: اللہ تعالیٰ نے تمہارے نبی ﷺ کی زبان اقدس سے حضر میں چار رکعت نماز فرض کی ہے اور سفر میں دو رکعت۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;