var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَعِيلَ عَنْ عَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ وَسَعِيدِ بْنِ جُبَيْرٍ وَعَطَاءِ بْنِ أَبِي رَبَاحٍ وَطَاوُسٍ أَخْبَرُوهُ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ أَخْبَرَهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ فِي السَّفَرِ مِنْ غَيْرِ أَنْ يُعْجِلَهُ شَيْءٌ وَلَا يَطْلُبَهُ عَدُوُّ وَلَا يَخَافَ شَيْئًا";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ سفر میں مغرب اور عشاء کو جمع کر لیتے تھے حالانکہ آپ کو نہ تو کسی وجہ سے جلدی ہوتی تھی نہ کوئی دشمن آپ کے تعاقب میں ہوتا تھا اور نہ آپ کو کوئی خوف ہوتا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إبراہیم بن إسماعیل بن مجمع الأنصاري: ضعیف (تقریب: 148)`;
ibnemaja.anwaar = [415,1];