var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ أَبِي الطُّفَيْلِ عَنْ مُعَاذِ بْنِ جَبَلٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ فِي غَزْوَةِ تَبُوكَ فِي السَّفَرِ";
ibnemaja.urdu = "سیدنا معاذ بن جبل رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے غزوہٴ تبول کے موقع پر سفر میں ظہر اور عصر کو اور مغرب اور عشاء کو جمع کر کے پڑھا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;