var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ الزُّهْرِيِّ قَالَ سَأَلْتُ السَّائِبَ بْنَ يَزِيدَ مَاذَا سَمِعْتَ فِي سُكْنَى مَكَّةَ قَالَ سَمِعْتُ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثًا لِلْمُهَاجِرِ بَعْدَ الصَّدَرِ";
ibnemaja.urdu = "سیدنا عبدالرحمٰن بن حمید زہری رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں نے سیدنا سائب بن یزید رضی اللہ عنہ سے پوچھا: آپ نے مکہ میں ٹھہرنے کے بارے میں کون سی حدیث سنی ہے؟ انہوں نے فرمایا: میں نے سیدنا علاء بن حضرمی رضی اللہ عنہ سے سنا،نبی ﷺ نے فرمایا: ’’مہاجر کو(منیٰ سے) واپس پر(مکہ میں) تین دن رہنے کی اجازت ہے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;