var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو عَاصِمٍ وَقَرَأْتُهُ عَلَيْهِ أَنْبَأَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ فِي أُنَاسٍ مَعِي قَالَ قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ صُبْحَ رَابِعَةٍ مَضَتْ مِنْ شَهْرِ ذِي الْحِجَّةِ";
ibnemaja.urdu = "سیدنا عطاء رحمہ اللہ سے روایت ہے انہوں نے فرمایا: مجھے اور میرے ساتھ چند افراد کو سیدنا جابر بن عبداللہ رضی اللہ عنہما نے یہ حدیث بیان کی کہ رسول اللہ ﷺ ذوالحجہ کی چار تاریخ کو مکہ تشریف لائے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;