var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ أَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعَةَ عَشَرَ يَوْمًا يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ فَنَحْنُ إِذَا أَقَمْنَا تِسْعَةَ عَشَرَ يَوْمًا نُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ فَإِذَا أَقَمْنَا أَكْثَرَ مِنْ ذَلِكَ صَلَّيْنَا أَرْبَعًا";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے انیس دن قیام فرمایا اور دو دو رکعتیں پڑھتے رہے اس لئے ہم بھی انیس دن ٹھہرتے ہیں تو دو دو رکعتیں پڑھتے ہیں جب اس سے زیادہ ٹھہرتے ہیں تو چار رکعت پڑھتے ہیں۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;