var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ وَعَبْدُ الْأَعْلَى قَالَا حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ عَنْ أَنَسٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَصَلَّى رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعْنَا قُلْتُ كَمْ أَقَامَ بِمَكَّةَ قَالَ عَشْرًا";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ رسول اللہ ﷺ کے ہمراہ مدینہ منورہ سے مکہ مکرمہ کی طرف روانہ ہوئے تو نبی ﷺ دو دو رکعت نماز ادا کرتے رہے حتی کہ ہم واپس آگئے۔(یحییٰ بن اسحاق کہتے ہیں:) میں نے کہا: نبی ﷺ مکہ میں کتنا عرصہ قیام پذیر رہے؟ سیدنا انس رضی اللہ عنہ نے فرمایا: دس دن۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;