var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ الْبَالِسِيُّ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ حَدَّثَنَا حُسَيْنُ بْنُ وَاقِدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَهْدُ الَّذِي بَيْنَنَا وَبَيْنَهُمْ الصَّلَاةُ فَمَنْ تَرَكَهَا فَقَدْ كَفَرَ";
ibnemaja.urdu = "سیدنا بریدہ بن حصیب رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’ہمارے درمیان اور ان (کافروں اور مشرکوں) کے درمیان جو عہد ہے،وہ نماز ہے۔جس نے اسے چھوڑ دیا اس نے کفر کیا۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;