var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ مَكْحُولٍ،عَنْ غُضَيْفِ بْنِ الْحَارِثِ،عَنْ أَبِي ذَرٍّ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ وَضَعَ الْحَقَّ عَلَى لِسَانِ عُمَرَ يَقُولُ بِهِ»";
ibnemaja.urdu = "حضرت ابو ذر رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے اللہ کے رسول ﷺ سے سنا،آپ فرما رہے تھے:‘‘ اللہ تعالیٰ نے عمر کی زبان پر حق رکھ دیا ہے،وہ اسی کے مطابق بات کرتے ہیں۔’’(رضی اللہ عنہ)";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;