var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجُمُعَةُ إِلَى الْجُمُعَةِ كَفَّارَةُ مَا بَيْنَهُمَا مَا لَمْ تُغْشَ الْكَبَائِرُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جمعے (کی نماز) سے (گزشتہ) جمعے تک کے گناہ معاف ہو جاتے ہیں جب کہ کبیرہ گناہوں کا ارتکاب نہ کیا جائے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;