var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ عَنْ أَبِي إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ مَنْ أَتَى الْجُمُعَةَ فَلْيَغْتَسِلْ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو منبر پر(کھڑے ہو کر) یہ فرماتے سنا: ’’جو شخص جمعہ پڑھنے آئے اسے چاہیے کہ (پہلے) غسل کرے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;