var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ قَالَ: حَدَّثَنَا أَبِي عُثْمَانُ بْنُ خَالِدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ،عَنْ أَبِيهِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ نَبِيٍّ رَفِيقٌ فِي الْجَنَّةِ،وَرَفِيقِي فِيهَا عُثْمَانُ بْنُ عَفَّانَ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:‘‘ ہر نبی کا جنت میں ایک ساتھی ہوتا ہے اور وہاں میرا ساتھی عثمان بن عفان ہے۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>عثمان بن خالد العثماني: متروک الحدیث (تقریب: 4464) <br>فالسند ضعیف جدًا <br>وللحدیث شاہد ضعیف عندالترمذي (3698)`;
ibnemaja.anwaar = [379,1];