var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ الْمَكِّيُّ عَنْ يَزِيدَ الرَّقَاشِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ تُجْزِئُ عَنْهُ الْفَرِيضَةُ وَمَنْ اغْتَسَلَ فَالْغُسْلُ أَفْضَلُ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جس نے جمعے کے دن(جمعے کی نماز کے لئے آتے وقت) وضو کیا تو کافی ہے اور اچھا ہے۔اس کا فرض ادا ہو جائے گا۔اور جس نے غسل کیا تو غسل افضل عمل ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إسماعیل بن مسلم المکي: ضعیف <br>ویزید الرقاشي: ضعیف <br>وحدیث أبي داود (354) یغني عنہ`;
ibnemaja.anwaar = [416,1];