var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سَعِيدِ بْنِ بَشِيرٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ مَثَلَ الْجُمُعَةِ ثُمَّ التَّبْكِيرِ كَنَاحِرِ الْبَدَنَةِ كَنَاحِرِ الْبَقَرَةِ كَنَاحِرِ الشَّاةِ حَتَّى ذَكَرَ الدَّجَاجَةَ";
ibnemaja.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے نماز جمعہ کی اور اس میں جلدی حاضر ہونے کی مثال ایسے بیان فرمائی(کہ یہ عمل کرنے والا ایسے ہے) جیسے اونٹ قربان کرنے والا،گائے کی قربانی دینے والا،بکری کی قربانی دینے والا،حتی کہ آپ نے مرغی کا ذکر بھی کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سعید بن بشیر ضعیف <br>و قتادۃ عنعن إن صح السند إلیہ <br>و الحدیث السابق (الأصل: 1092) یغني عنہ`;
ibnemaja.anwaar = [416,1];