var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ حَدَّثَنَا عَلِيُّ بْنُ غُرَابٍ عَنْ صَالِحِ بْنِ أَبِي الْأَخْضَرِ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ بْنِ السَّبَّاقِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذَا يَوْمُ عِيدٍ جَعَلَهُ اللَّهُ لِلْمُسْلِمِينَ فَمَنْ جَاءَ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ وَإِنْ كَانَ طِيبٌ فَلْيَمَسَّ مِنْهُ وَعَلَيْكُمْ بِالسِّوَاكِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’یہ عید کا دن ہے جو اللہ نے مسلمانوں کے لیے مقرر کیا ہے۔لہٰذا جو شخص جمعہ پڑھنے آئے اسے چاہیے کہ غسل کر کے آئے۔اگر خوشبو موجود ہو تو لگالے اور مسواک ضرور کیا کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `سندہ ضعیف<br>صالح بن أبی الأخضر لینہ الجمہور و علي بن غراب والزہري مدلسان و عنعنا إن صح السند إلی الزہري`;
ibnemaja.anwaar = [535,1];