var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ قَالَ: حَدَّثَنَا أَبِي عُثْمَانُ بْنُ خَالِدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ،عَنْ أَبِي الزِّنَادِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَقِيَ عُثْمَانَ عِنْدَ بَابِ الْمَسْجِدِ،فَقَالَ: «يَا عُثْمَانُ،هَذَا جِبْرِيلُ أَخْبَرَنِي أَنَّ اللَّهَ قَدْ زَوَّجَكَ أُمَّ كُلْثُومٍ بِمِثْلِ صَدَاقِ رُقَيَّةَ،عَلَى مِثْلِ صُحْبَتِهَا»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ مسجد کے دروازے کے پاس حضرت عثمان رضی اللہ عنہ سے ملے اور فرمایا:‘‘ عثمان! یہ جبریل علیہ السلام ہیںِ انہوں نے مجھے بتایا ہے کہ اللہ تعالیٰ نے آپ کا نکاح ام کلثوم رضی اللہ عنہا سے رقیہ رضی اللہ عنہا کے مہر کے برابر مہر پر کر دیا ہے،اس شرط پر کہ ان سے بھی اسی طرح حسن سلوک کرو جس طرح رقیہ رضی اللہ عنہا سے کرتے تھے۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (109)`;
ibnemaja.anwaar = [379,1];