var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ قَالَ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ فَلَا نَرَى لِلْحِيطَانِ فَيْئًا نَسْتَظِلُّ بِهِ";
ibnemaja.urdu = "سیدنا سلمہ بن اکوع رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ نبی ﷺ کے ساتھ جمعے کی نماز پڑھ کر واپس لوٹتے تھے تو ہمیں دیواروں کا اتنا سایہ نہیں ملتا تھا کہ اس سائے میں چل سکیں۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;