var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ مُؤَذِّنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّهُ كَانَ يُؤَذِّنُ يَوْمَ الْجُمُعَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الْفَيْءُ مِثْلَ الشِّرَاكِ";
ibnemaja.urdu = "نبی اکرم ﷺ کے مؤذن سیدنا سعد القرظ رضی اللہ عنہ سے روایت ہے کہ وہ رسول اللہ ﷺ کے زمانے میں جمعے کے دن اس وقت اذان کہتے تھے جب سایہ تسمے کے برابر ہوتا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،عبد الرحمٰن أجمعوا علی تضعیفہ وأما أبوہ فقال ابن القطان: لا یعرف حالہ وحال أبیہ‘‘ عبد الرحمٰن بن سعد: ضعیف (تقریب: 3873)`;
ibnemaja.anwaar = [416,1];