var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ ح و حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ أَبُو سَلَمَةَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ خُطْبَتَيْنِ يَجْلِسُ بَيْنَهُمَا جَلْسَةً زَادَ بِشْرٌ وَهُوَ قَائِمٌ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ دو خطبے دیتے تھے اور ان کے درمیان تھوڑا سا بیٹھتے تھے۔بشر نے اپنی روایت میں یہ اضافہ کیا ہے کہ نبی ﷺ کھڑے ہوکر خطبہ دیتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;