var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا غَيْرَ أَنَّهُ كَانَ يَقْعُدُ قَعْدَةً ثُمَّ يَقُومُ";
ibnemaja.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کھڑے ہو کر خطبہ دیتے تھے،تاہم (اثنائے خطبہ میں) ایک بار بیٹھتے تھے پھر کھڑے ہو جاتے تھے(اور دوسرا خطبہ دیتے تھے)۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;