var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلَاتُهُ قَصْدًا";
ibnemaja.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ کھڑے ہو کر خطبہ دیتے تھے،پھر بیٹھ جاتے،پھر کھڑے ہو کر قرآن مجید کی آیات تلاوت فرماتے اور اللہ کو یاد کرتے۔نبی ﷺ کا خطبہ متوسط ہوتا تھا اور نماز بھی متوسط ہوتی تھی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;