var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَطَبَ فِي الْحَرْبِ خَطَبَ عَلَى قَوْسٍ وَإِذَا خَطَبَ فِي الْجُمُعَةِ خَطَبَ عَلَى عَصًا";
ibnemaja.urdu = "(نبی ﷺ کے مؤذن) سیدنا سعد القرظ رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا: رسول اللہ ﷺ جب جنگ کے دوران میں خطبہ دیتے تو کمان ہاتھ میں لے کر خطبہ دیتے اور جب جمعے کا خطبہ دیتے تو عصا ہاتھ میں لے کر خطبہ دیتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد الرحمٰن بن سعد: ضعیف<br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [416,1];