var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّهُ سُئِلَ أَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا أَوْ قَاعِدًا قَالَ أَوَمَا تَقْرَأُ وَتَرَكُوكَ قَائِمًا قَالَ أَبُو عَبْد اللَّهِ غَرِيبٌ لَا يُحَدِّثُ بِهِ إِلَّا ابْنُ أَبِي شَيْبَةَ وَحْدَهُ";
ibnemaja.urdu = "سیدنا عبداللہ (بن مسعود) رضی اللہ عنہ سے روایت ہے ان سے سوال کیا گیا: کیا نبی ﷺ کھڑے ہو کر خطبہ دیتے تھے یا بیٹھ کر؟ انہوں نے فرمایا: کیا تم یہ آیت نہیں پڑھتے: (وترکوک قائما) ’’وہ آپ کو کھڑا چھوڑ جاتے ہیں۔‘‘ امام ابو عبداللہ(ابن ماجہ)نے کہا یہ حدیث غریب ہے،اسے ابن شیبہ کے علاوہ کسی نے بیان نہیں کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الأعمش عنعن`;
ibnemaja.anwaar = [416,2];