var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ مُهَاجِرٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَعِدَ الْمِنْبَرَ سَلَّمَ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ جب منبر پر تشریف فرما ہوتے تو(حاجرین کو) سلام کہتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن لہیعۃ عنعن <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [417,1];