var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ سَمِعَ جَابِرًا وَأَبُو الزُّبَيْرِ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ دَخَلَ سُلَيْكٌ الْغَطَفَانِيُّ الْمَسْجِدَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ فَصَلِّ رَكْعَتَيْنِ وَأَمَّا عَمْرٌو فَلَمْ يَذْكُرْ سُلَيْكًا";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ سیدنا سلیک غطفانی رضی اللہ عنہ مسجد میں آئے تو نبی ﷺ خطبہ ارشاد فرما رہے تھے۔رسول اللہ ﷺ نے(ان سے) پوچھا: ’’تم نے نماز پڑھی ہے؟‘‘ انہوں نے کہا: نہیں۔آپ نے فرمایا: ’’تب دو رکعتیں پڑھ لو۔‘‘ حدیث کے راوی عمرو بن دینار نے سلیک (کے داخل ہونے) کا ذکر نہیں کیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;