var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ عَجْلَانَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ قَالَ جَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ فَصَلِّ رَكْعَتَيْنِ";
ibnemaja.urdu = "سیدنا ابو سعید رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ خطبہ دے رہے تھے کہ ایک آدمی آیا،آپ نے فرمایا: ’’تو نے نماز پڑھی ہے؟‘‘اس نے کہا: نہیں۔آپ نے فرمایا: ’’تب دو رکعتیں پڑھ لے۔‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;