var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَا جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَلَّيْتَ رَكْعَتَيْنِ قَبْلَ أَنْ تَجِيءَ قَالَ لَا قَالَ فَصَلِّ رَكْعَتَيْنِ وَتَجَوَّزْ فِيهِمَا";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ اور سیدنا جابر رضی اللہ عنہما سے روایت ہے کہ سیدنا سلیک غطفانی رضی اللہ عنہ آئے اور رسول اللہ ﷺ خطبہ ارشاد فرما رہے تھے۔نبی ﷺ نے انہیں کہا: ’’کیا تم نے آنے سے پہلے دو رکعتیں پڑھی ہیں؟‘‘ انہوں نے کہا: نہیں۔آپ نے فرمایا: ’’تب دو رکعتیں پڑھ لو اور ہلکی پڑھنا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حفص بن غیاث: عنعن وھو مدلس<br>والحدیث في صحیح مسلم (875) ولم یذکر ’’ قبل أن تجئ ‘‘`;
ibnemaja.anwaar = [417,1];