var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَجَعَلَ يَتَخَطَّى النَّاسَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْلِسْ فَقَدْ آذَيْتَ وَآنَيْتَ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ جمعے کے دن رسول اللہ ﷺ خطبہ ارشاد فرما رہے تھے کہ ایک آدمی مسجد میں داخل ہوا،وہ (قریب آکر بیٹھنے کے لئے) لوگوں کے اوپر سے گزرنے لگا۔رسول اللہ ﷺ نے فرمایا: ’’بیٹھ جا،تو نے لوگوں کو تکلیف پہنچائی اور دیر سے آیا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;