var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ زَبَّانَ بْنِ فَائِدٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ اتُّخِذَ جِسْرًا إِلَى جَهَنَّمَ";
ibnemaja.urdu = "سیدنا معاذ بن انس رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جس نے جمعے دن لوگوں کی گردنیں پھلانگیں اسے جہنم تک پہنچنے کے لئے پل بنا دیا گیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (513)`;
ibnemaja.anwaar = [417,1];