var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَلَّمُ فِي الْحَاجَةِ إِذَا نَزَلَ عَنْ الْمِنْبَرِ يَوْمَ الْجُمُعَةِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ جمعے کے دن (خطبے سے فارغ ہو کر) جب منبر سے اترتے تو آپ سے ضرورت کی بات چیت کر لی جاتی تھی";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1120) ترمذي (517) نسائي (1420)`;
ibnemaja.anwaar = [417,1];