var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ أَنْبَأَنَا ضَمْرَةُ بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ كَتَبَ الضَّحَّاكُ بْنُ قَيْسٍ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ أَخْبِرْنَا بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ مَعَ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ فِيهَا هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ";
ibnemaja.urdu = "سیدنا عبیداللہ رحمہ اللہ سے روایت ہے کہ سیدنا ضحاک بن قیس رضی اللہ عنہ نے سیدنا نعمان بن بشیر رضی اللہ عنہ کو خط لکھا۔ہمیں یہ بتایئے کہ نبی ﷺ جمعے کے دن سورہٴ جمعہ کے ساتھ دوسری کون سی سورت پڑھتے تھے؟ انہوں نے جواب دیا: نبی ﷺ اس نماز میں(ھل اتک حدیث الغاشیۃ) (سورۃ الغاشیہ) پڑھتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;