var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ سَعِيدِ بْنِ سِنَانٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ أَبِي عِنَبَةَ الْخَوْلَانِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ";
ibnemaja.urdu = "سیدنا ابو عنبہ خولانی رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ جمعے کی نماز میں (سبح اسم ربک الاعلی) اور (ھل اتک حدیث الغاشیۃ) پرھتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;