var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عُمَرُ بْنُ حَبِيبٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ وَسَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ مِنْ الْجُمُعَةِ رَكْعَةً فَلْيَصِلْ إِلَيْهَا أُخْرَى";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جسے جمعے کی ایک رکعت ملے،وہ اس کے ساتھ دوسری ملا لے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;