var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ الْأَيْلِيُّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ رَكْعَةً مِنْ صَلَاةِ الْجُمُعَةِ أَوْ غَيْرِهَا فَقَدْ أَدْرَكَ الصَّلَاةَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جسے جمعے کی نماز یا کسی اور نماز کی ایک رکعت مل گئی اسے وہ نماز مل گئی۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;