var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ إِنَّ أَهْلَ قُبَاءَ كَانُوا يُجَمِّعُونَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: قباء کے رہنے والے جمعے کے دن جمعے کی نماز رسول اللہ ﷺ کی اقتدا میں ادا کرتے تھے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;