var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَيَزِيدُ بْنُ هَارُونَ وَمُحَمَّدُ بْنُ بِشْرٍ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنِي عُبَيْدَةُ بْنُ سُفْيَانَ الْحَضْرَمِيُّ عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ وَكَانَ لَهُ صُحْبَةٌ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ ثَلَاثَ مَرَّاتٍ تَهَاوُنًا بِهَا طُبِعَ عَلَى قَلْبِهِ";
ibnemaja.urdu = "صحابی رسول سیدنا ابو جعد ضمری رضی اللہ عنہ سے روایت ہے،انہوں نے کہا کہ نبی ﷺ نے فرمایا: ’’جس نے اہمیت نہ دیتے ہوئے تین بار جمعے کی نماز تےرک کر دی،اس کے دل پر مہر لگا دی جائے گی۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;