var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَسِيدِ بْنِ أَبِي أَسِيدٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ أَسِيدِ بْنِ أَبِي أَسِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ ثَلَاثًا مِنْ غَيْرِ ضَرُورَةٍ طَبَعَ اللَّهُ عَلَى قَلْبِهِ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے کسی مجبوری کے بغیر تین بار جمعے کی نماز ترک کی،اللہ تعالیٰ اس کے دل پر مہر لگا دیتا ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;