var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا نُوحُ بْنُ قَيْسٍ عَنْ أَخِيهِ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ الْجُمُعَةَ مُتَعَمِّدًا فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ";
ibnemaja.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جس نے جان بوجھ کر جمعہ چھوڑ دیا،اسے چاہیے کہ ایک دینار صدقہ کرے،اگر اس کے پاس (ایک دینار) نہ ہو تو آدھا دینار صدقہ کرے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1053) نسائي (1373ب)<br>قتادۃ عنعن <br>وللحدیث شاہد ضعیف عند أبي داود (1053)`;
ibnemaja.anwaar = [417,1];