var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ حَدَّثَنَا بَقِيَّةُ عَنْ مُبَشِّرِ بْنِ عُبَيْدٍ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَطِيَّةَ الْعُوفِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْكَعُ قَبْلَ الْجُمُعَةِ أَرْبَعًا لَا يَفْصِلُ فِي شَيْءٍ مِنْهُنَّ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ جمعے (کی فرض نماز) سے پہلے چار رکعتیں پڑھتے تھے اور ان میں فاصلہ نہیں کرتے تھے۔(ایک سلام سے پڑھتے تھے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع<br>قال البوصیري: ’’ ھذا إسناد مسلسل بالضعفاء: عطیۃ (العوفي) متفق علی ضعفہ وحجاج (بن أرطاۃ) مدلس <br>و مبشر بن عبید: کذاب،وبقیۃ ھو ابن الولید یدلس بتدلیس التسویۃ‘‘ بقیۃ: صدوق مدلس`;
ibnemaja.anwaar = [417,1];