var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّيْتُمْ بَعْدَ الْجُمُعَةِ فَصَلُّوا أَرْبَعًا";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب تم جمعے کے بعد نماز پڑھو تو چار رکعت (سنت) پڑھو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;