var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا ابْنُ لَهِيعَةَ جَمِيعًا عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُحَلَّقَ فِي الْمَسْجِدِ يَوْمَ الْجُمُعَةِ قَبْلَ الصَّلَاةِ";
ibnemaja.urdu = "سیدنا عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا (سیدنا عبداللہ بن عمرو رضی اللہ عنہما) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے جمعے کے دن نماز سے پہلے مسجد میں حلقے بنانے سے منع فرمایا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;