var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الِاحْتِبَاءِ يَوْمَ الْجُمُعَةِ يَعْنِي وَالْإِمَامُ يَخْطُبُ";
ibnemaja.urdu = "سیدنا عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا (سیدنا عبداللہ بن عمرو رضی اللہ عنہما) سے روایت کرتے ہیں،انہوں نے فرمایا: رسول اللہ ﷺ نے جمعے کے دن گوٹ مار کر بیٹھنے سے منع فرمایا،یعنی جب امام خطبہ دے رہا ہو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;