var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ أَبَانَ بْنِ تَغْلِبَ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ عَلَى الْمِنْبَرِ اسْتَقْبَلَهُ أَصْحَابُهُ بِوُجُوهِهِمْ";
ibnemaja.urdu = "سیدنا ثابت رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ جب منبر پر کھڑے ہوتے تو صحابہ کرام رضی اللہ عنہم اپنے چہرے نبی ﷺ کی طرف کر لیتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ثابت أبو عدي مجھول الحال (تقریب:836) ولم یذکر من حدثہ بہ <br>وحدیث البخاري (921) یغني عنہ`;
ibnemaja.anwaar = [417,2];