var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا رَجُلٌ مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ فِيهَا خَيْرًا إِلَّا أَعْطَاهُ وَقَلَّلَهَا بِيَدِهِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جمعے (کے دن) میں ایک گھڑی ہے جو مسلمان آدمی اسے اس حال میں پالے کہ وہ کھڑا نماز پڑھ رہا ہو،وہ اس گھڑی میں اللہ سے جو بھلائی مانگے گا (دنیا کی ہو یا آخرت کی) اللہ اسے وہ چیز دے دے گا۔‘‘ آپ نے ہاتھ سے اشارہ کیا کہ وہ گھڑی مختصر سی ہے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;