var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي يَوْمِ الْجُمُعَةِ سَاعَةٌ مِنْ النَّهَارِ لَا يَسْأَلُ اللَّهَ فِيهَا الْعَبْدُ شَيْئًا إِلَّا أُعْطِيَ سُؤْلَهُ قِيلَ أَيُّ سَاعَةٍ قَالَ حِينَ تُقَامُ الصَّلَاةُ إِلَى الِانْصِرَافِ مِنْهَا";
ibnemaja.urdu = "سیدنا عمرو بن عوف مزنی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو یہ فرماتے سنا ہے: ’’جمعے کے دن میں ایک گھڑی ہے اس میں بندہ اللہ سے جو کچھ مانگے،اللہ اسے اس کی مطلوبہ چیز دے دیتا ہے‘‘۔عرض کیا گیا: وہ کون سی گھڑی ہے؟ آپ نے فرمایا: ’’جب نماز کھڑی ہو جائے(اس وقت سے لیے کر) نماز سے فارغ ہونے تک۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (490)`;
ibnemaja.anwaar = [418,1];