var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،وَأَبُو مُعَاوِيَةَ،وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنِ الْأَعْمَشِ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ زِرِّ بْنِ حُبَيْشٍ،عَنْ عَلِيٍّ،قَالَ: عَهِدَ إِلَيَّ النَّبِيُّ الْأُمِّيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَّهُ لَا يُحِبُّنِي إِلَّا مُؤْمِنٌ،وَلَا يُبْغِضُنِي إِلَّا مُنَافِقٌ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی امی ﷺ نے مجھے بالتاکید خبر دی کہ مجھ سے صرف مومن ہی محبت رکھے گااور مجھ سے صرف منافق ہی نفرت کرے گا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;