var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى فِي يَوْمٍ وَلَيْلَةٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ";
ibnemaja.urdu = "ام المومنین سیدہ ام حبیبہ بنت ابو سفیان رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے فرمایا: ’’جس شخص نے دن رات میں (فرضوں کے علاوہ) بارہ رکعتیں پڑھیں اس کے لئے جنت میں گھر تعمیر کیا جائے گا۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;