var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الرَّكْعَتَيْنِ قَبْلَ الْغَدَاةِ كَأَنَّ الْأَذَانَ بِأُذُنَيْهِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ صبح (کے فرضوں) سے پہلے دو رکعتیں پڑھتے،(اور اتنے ہلکی پڑھتے) گویا آپ کے کانوں میں اقامت کے آواز آرہی ہے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;