var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ بِنْتِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا نُودِيَ لِصَلَاةِ الصُّبْحِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ يَقُومَ إِلَى الصَّلَاةِ";
ibnemaja.urdu = "سیدہ حفصہ بنت عمر رضی اللہ عنہما سے روایت ہے کہ جب صبح کی اذان ہو جاتی تو رسول اللہ ﷺ نماز (فرض) کے لیے جانے سے پہلے ہلکی سی دو رکعتیں ادا فرماتے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;