var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے فجر سے پہلے کی دو رکعتوں (سنتوں) میں (قل یایھا الکافرون) اور (قل ھواللہ احد) کی تلاوت فرمائی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;