var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَمُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيَّانِ قَالَا حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ رَمَقْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا فَكَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: میں نے ایک ماہ تک رسول اللہ ﷺ (کی نماز) کا مشاہدہ کیا تو آپ فجر کی سنتوں میں(قل یا یھا الکافرون) اور (قل ھواللہ احد) پڑھتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (417) نسائي (993)<br>أبو إسحاق عنعن`;
ibnemaja.anwaar = [418,1];