var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،قَالَ: سَمِعْتُ إِبْرَاهِيمَ بْنَ سَعْدِ بْنِ أَبِي وَقَّاصٍ،يُحَدِّثُ عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لِعَلِيٍّ: «أَلَا تَرْضَى أَنْ تَكُونَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى»";
ibnemaja.urdu = "حضرت سعد بن ابو وقاص رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے حضرت علی رضی اللہ عنہ سے فرمایا:’’کیا تو اس بات پر راضی نہیں کہ میرے ساتھ تیری وہ نسبت ہو جو ہاروں علیہ السلام کی موسیٰ علیہ السلام سے تھی۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;