var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي رَكْعَتَيْنِ قَبْلَ الْفَجْرِ وَكَانَ يَقُولُ نِعْمَ السُّورَتَانِ هُمَا يُقْرَأُ بِهِمَا فِي رَكْعَتَيْ الْفَجْرِ قُلْ هُوَ اللَّهُ أَحَدٌ وَقُلْ يَا أَيُّهَا الْكَافِرُونَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: ’’رسول اللہ ﷺ فجر (کی فرض نماز) سے پہلے دو رکعتیں پڑھا کرتے تھے،اور فرمایا کرتے تھے:’’یہ دو سورتیں کتنی اچھی ہیں جو فجر کی سنتوں میں پڑھی جاتی ہیں: (قل ھواللہ احد) اور (قل یایھا الکافرون)۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الجریري اِختلط وسماع یزید بن ھارون وإسحاق الأزرق منہ بعد اختلاطہ (التقیید والإیضاح ص 427) <br>وانظر ضعیف سنن أبي داود (1555) <br>وللحدیث شواھد`;
ibnemaja.anwaar = [418,1];