var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُصَلِّي الرَّكْعَتَيْنِ قَبْلَ صَلَاةِ الْغَدَاةِ وَهُوَ فِي الصَّلَاةِ فَلَمَّا صَلَّى قَالَ لَهُ بِأَيِّ صَلَاتَيْكَ اعْتَدَدْتَ";
ibnemaja.urdu = "سیدنا عبداللہ بن سرجس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے نماز کے دوران میںایک آدمی کو فجر سے پہلے کی دو سنتیں پڑھتے دیکھا،نماز سے فارغ ہو کر رسول اللہ ﷺ اس سے فرمایا: ’’تو نے اپنی دونوں نمازوں میں سے کس کا اعتبار کیا ہے؟‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;