var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَامَ عَنْ رَكْعَتَيْ الْفَجْرِ فَقَضَاهُمَا بَعْدَ مَا طَلَعَتْ الشَّمْسُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نیند کی وجہ سے فجر کی سنتیں نہ پڑھ سکے تو آپ نے سورج طلوع ہونےکے بعد ان کی قضا دی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;