var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ قَابُوسَ عَنْ أَبِيهِ قَالَ أَرْسَلَ أَبِي إِلَى عَائِشَةَ أَيُّ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَحَبَّ إِلَيْهِ أَنْ يُوَاظِبَ عَلَيْهَا قَالَتْ كَانَ يُصَلِّي أَرْبَعًا قَبْلَ الظُّهْرِ يُطِيلُ فِيهِنَّ الْقِيَامَ وَيُحْسِنُ فِيهِنَّ الرُّكُوعَ وَالسُّجُودَ";
ibnemaja.urdu = "سیدنا قابوس رحمہ اللہ اپنے والد(سیدنا ابو ظبیان حصین بن جندب رحمہ اللہ) سے روایت کرتے ہوئے فرماتے ہیں کہ میرے والد نے سیدہ عائشہ رضی اللہ عنہا کے پاس(کسی کو) یہ دریافت کرنے کے لئے بھیجا کہ رسول اللہ ﷺ کون سی نماز پر دوام کرنا زیادہ پسند کرتے تھے؟ انہوں نے فرمایا: رسول اللہ ﷺ ظہر(کے فرضوں) سے پہلے چار رکعت پڑھتے تھے،جن میں طویل قیام فرماتے اور رکوع اور سجدے خوب اچھی طرح کرتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قابوس: ضعیف`;
ibnemaja.anwaar = [418,1];