var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ عُبَيْدَةَ بْنِ مُعَتِّبٍ الضَّبِّيِّ عَنْ إِبْرَاهِيمَ عَنْ سَهْمِ بْنِ مِنْجَابٍ عَنْ قَزَعَةَ عَنْ قَرْثَعٍ عَنْ أَبِي أَيُّوبَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا إِذَا زَالَتْ الشَّمْسُ لَا يَفْصِلُ بَيْنَهُنَّ بِتَسْلِيمٍ وَقَالَ إِنَّ أَبْوَابَ السَّمَاءِ تُفْتَحُ إِذَا زَالَتْ الشَّمْسُ";
ibnemaja.urdu = "سیدنا ابو ایوب (خالد بن زید انصاری) رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ سورج ڈھلنے پر ظہر سے پہلے چار رکعتیں پڑھتے تھے۔ان میں سلام کے ساتھ فاصلہ نہیں کرتے تھے۔نبی ﷺ نے فرمایا: ’’جب سورج ڈھل جاتا ہے تو آسمان کے دروازے کھول دیے جاتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1270)`;
ibnemaja.anwaar = [418,1];