var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَزَيْدُ بْنُ أَخْزَمَ وَمُحَمَّدُ بْنُ مَعْمَرٍ قَالُوا حَدَّثَنَا مُوسَى بْنُ دَاوُدَ الْكُوفِيُّ حَدَّثَنَا قَيْسُ بْنُ الرَّبِيعِ عَنْ شُعْبَةَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَاتَتْهُ الْأَرْبَعُ قَبْلَ الظُّهْرِ صَلَّاهَا بَعْدَ الرَّكْعَتَيْنِ بَعْدَ الظُّهْرِ قَالَ أَبُو عَبْد اللَّهِ لَمْ يُحَدِّثْ بِهِ إِلَّا قَيْسٌ عَنْ شُعْبَةَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کی جب ظہر کی پہلی چار سنتیں چھوٹ جاتیں تو آپ ظہر کی بعد والی دو سنتوں کے بعد ادا کر لیتے تھے۔\nامام ابو عبد اللہ(ابن ماجہ)نے کہا‘اس روایت کو قیس عن شعبہ کے علاوہ کسی نے بیان نہیں کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قیس بن الربیع: ضعیف ضعفہ الجمہور <br>وحدیث الترمذي (426) ھو المحفوظ`;
ibnemaja.anwaar = [418,2];