var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الشُّعَيْثِيُّ عَنْ أَبِيهِ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى قَبْلَ الظُّهْرِ أَرْبَعًا وَبَعْدَهَا أَرْبَعًا حَرَّمَهُ اللَّهُ عَلَى النَّارِ";
ibnemaja.urdu = "ام المومنین سیدہ ام حبیبہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’جو شخص ظہر سے پہلے چار اور اس کے بعد چار رکعتیں پڑھے،اللہ تعالیٰ اسے جہنم پر حرام فرما دیتاہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;