var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَوَكِيعٌ عَنْ كَهْمَسٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ قَالَهَا ثَلَاثًا قَالَ فِي الثَّالِثَةِ لِمَنْ شَاءَ";
ibnemaja.urdu = "سیدنا عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے تین بار فرمایا: ’’ہر دو اذانوں کے درمیان نماز ہے۔‘‘تیسر بار فرمایا: ’’جو کوئی چاہے (پڑھے لے)‘‘۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;