var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَلِيَّ بْنَ زَيْدِ بْنِ جُدْعَانَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ إِنْ كَانَ الْمُؤَذِّنُ لَيُؤَذِّنُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَرَى أَنَّهَا الْإِقَامَةُ مِنْ كَثْرَةِ مَنْ يَقُومُ فَيُصَلِّي الرَّكْعَتَيْنِ قَبْلَ الْمَغْرِبِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کے زمانے میں مؤذن اذان دیتا تو لوگ مغرب سے پہلے دو رکعت (سنت) پڑھنے کے لئے اس کثرت سے کھڑے ہو جاتے کہ محسوس ہوتا اقامت ہوگئی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;