var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا هُشَيْمٌ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْمَغْرِبَ ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ مغرب کی نماز ادا فرماتے،پھر میرے گھر تشریف لاتے اور دور رکعت ادا فرماتے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;