var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَنِي عَبْدِ الْأَشْهَلِ فَصَلَّى بِنَا الْمَغْرِبَ فِي مَسْجِدِنَا ثُمَّ قَالَ ارْكَعُوا هَاتَيْنِ الرَّكْعَتَيْنِ فِي بُيُوتِكُمْ";
ibnemaja.urdu = "سیدنا رافع بن خدیج رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ ہمارے ہاں(یعنی) بنع عبدالاشہل کے محلے میں تشریف لائے۔آپ نے ہماری مسجد میں ہمیں مغرب کی نماز پڑھائی،پھر فرمایا: ’’یہ دو رکعتیں اپنے گھروں میں پڑھا کرو۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;