var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ وَاقِدٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُؤَمَّلِ بْنِ الصَّبَّاحِ حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ قَالَا حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الْوَلِيدِ حَدَّثَنَا عَاصِمُ بْنُ بَهْدَلَةَ عَنْ زِرٍّ وَأَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ بَعْدَ صَلَاةِ الْمَغْرِبِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ مغرب(کے فرضوں) کے بعد کی دو رکعتوں میں(قل یایھا الکافرون) اور (قل ھواللہ احد) پرھتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (431)`;
ibnemaja.anwaar = [419,1];