var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو الْحُسَيْنِ الْعُكْلِيُّ أَخْبَرَنِي عُمَرُ بْنُ أَبِي خَثْعَمٍ الْيَمَامِيُّ أَنْبَأَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى بَعْدَ الْمَغْرِبِ سِتَّ رَكَعَاتٍ لَمْ يَتَكَلَّمْ بَيْنَهُنَّ بِسُوءٍ عُدِلْنَ لَهُ بِعِبَادَةِ ثِنْتَيْ عَشْرَةَ سَنَةً";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جس نے مغرب کے بعد چھ رکعتیں پڑھیں اور ان کے درمیان کوئی نا مناسب بات منہ سے نہ نکالی،اس کے لئے یہ نماز بارہ برس کی عبادت کے برابر ہو جائے گی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>ترمذي (435) وانظر الحدیث الآتي (1374)`;
ibnemaja.anwaar = [419,1];