var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ اللَّهِ بْنِ رَاشِدٍ الزَّوْفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُرَّةَ الزَّوْفِيِّ عَنْ خَارِجَةَ بْنِ حُذَافَةَ الْعَدَوِيِّ قَالَ خَرَجَ عَلَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ قَدْ أَمَدَّكُمْ بِصَلَاةٍ لَهِيَ خَيْرٌ لَكُمْ مِنْ حُمُرِ النَّعَمِ الْوِتْرُ جَعَلَهُ اللَّهُ لَكُمْ فِيمَا بَيْنَ صَلَاةِ الْعِشَاءِ إِلَى أَنْ يَطْلُعَ الْفَجْرُ";
ibnemaja.urdu = "سیدنا خارجہ بن حذافہ عدوی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:نبی ﷺ ہمارے پاس تشریف لائے اور فرمایا: ’’اللہ تعالیٰ نے تمہیں مزید ایک نماز عطا فرمائی ہے،وہ تمہارے لئےسرخ اونٹوں سے بہتر ہے وہ نماز وتر ہے جس کو اللہ تعالیٰ نے تمہارے لئے عشاء کی نماز سے صبح صادق طلوع ہونے تک کے وقت میں مقرر کیا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1418) ترمذي (452)`;
ibnemaja.anwaar = [419,1];