var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ السَّلُولِيِّ قَالَ قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ إِنَّ الْوِتْرَ لَيْسَ بِحَتْمٍ وَلَا كَصَلَاتِكُمْ الْمَكْتُوبَةِ وَلَكِنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْتَرَ ثُمَّ قَالَ يَا أَهْلَ الْقُرْآنِ أَوْتِرُوا فَإِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ";
ibnemaja.urdu = "سیدنا عاصم بن ضمرہ سلولی رحمہ اللہ سے روایت ہے کہ علی بن ابی طالب رضی اللہ عنہ نے فرمایا: وتر لازمی نہیں ہے اور نہ تمہاری فرض نمازوں کی طرح ہے لیکن رسول اللہ ﷺ نے نماز وتر ادا کی ہے اور فرمایا: ’’اے قرآن والو! وتر پڑھا کرو کیوں کہ اللہ تعالیٰ وتر(اکیلا) ہے،وتر کو پسند کرتاہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1416) ترمذي (453) نسائي (1676)`;
ibnemaja.anwaar = [419,1];