var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ أَوْتِرُوا يَا أَهْلَ الْقُرْآنِ فَقَالَ أَعْرَابِيٌّ مَا يَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ لَكَ وَلَا لِأَصْحَابِكَ";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’اللہ تعالیٰ وتر(اکیلا) ہے اور وتر (طاق عدد) کو پسند کرتا ہے،قرآن والو! وتر(کی نماز) پڑھا کرو۔‘‘ ایک اعرابی نے کہا: اللہ کے رسولﷺ کیا فرما رہے ہیں: فرمایا: ’’تیرے لیے یا تیرے ساتھیوں کے لیے نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1417)`;
ibnemaja.anwaar = [419,1];