var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ حَدَّثَنَا الْأَعْمَشُ عَنْ طَلْحَةَ وَزُبَيْدٍ عَنْ ذَرٍّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
ibnemaja.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ وتروں میں(سبح اسم ربک الاعلی) (قل یایھاالکافرون) اور (قل ھواللہ احد) پڑھا کرتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;