var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْوَاسِطِيُّ قَالَ: حَدَّثَنَا الْمُعَلَّى بْنُ عَبْدِ الرَّحْمَنِ قَالَ: حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْحَسَنُ وَالْحُسَيْنُ سَيِّدَا شَبَابِ أَهْلِ الْجَنَّةِ،وَأَبُوهُمَا خَيْرٌ مِنْهُمَا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’حسن اور حسین رضی اللہ عنہما جنتی جوانوں کے سردار ہیں،اور ان کے والد ان سے افضل ہیں۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;