var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا عَائِذُ بْنُ حَبِيبٍ عَنْ صَالِحِ بْنِ حَسَّانَ الْأَنْصَارِيِّ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَعَوْتَ اللَّهَ فَادْعُ بِبَاطِنِ كَفَّيْكَ وَلَا تَدْعُ بِظُهُورِهِمَا فَإِذَا فَرَغْتَ فَامْسَحْ بِهِمَا وَجْهَكَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تو اللہ سے دعا کرے تو سیدھی ہتھیلیوں کے ساتھ دعا کر اور ہاتھوں کی پشت کے ساتھ(ہاتھ الٹے کر کے) دعا مت کر۔اور جب تو (دعا سے) فارغ ہو جائے تو ہاتھوں کو چہرے پر پھیر لے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف جدًا <br>صالح بن حسان: متروک <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [419,1];