var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ عَنْ سُفْيَانَ عَنْ زُبَيْدٍ الْيَامِيِّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ فَيَقْنُتُ قَبْلَ الرُّكُوعِ";
ibnemaja.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ وتر پرھتے تھے تو رکوع سے پہلے دعائے قنوت پرھتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;