var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سُئِلَ عَنْ الْقُنُوتِ فِي صَلَاةِ الصُّبْحِ فَقَالَ كُنَّا نَقْنُتُ قَبْلَ الرُّكُوعِ وَبَعْدَهُ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ان سے صبح کی نماز میں قنوت پڑھنے کا مسئلہ دریافت کیا گیا تو انہوں نے فرمایا: ہم رکوع سے پہلے بھی قنوت پڑھ لیا کرتے تھے،اور رکوع کے بعد بھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;