var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ الْقُنُوتِ فَقَالَ قَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ الرُّكُوعِ";
ibnemaja.urdu = "جناب محمدرحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں نے سیدنا انس بن مالک رضی اللہ عنہ سے قنوت کے بارے میں سوال کیا تو انہوں نے فرمایا: رسول اللہ ﷺ نے رکوع کے بعد دعائے قنوت فرمائی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;