var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي حُصَيْنٍ عَنْ يَحْيَى بْنِ وَثَّابٍ عَنْ مَسْرُوقٍ قَالَ سَأَلْتُ عَائِشَةَ عَنْ وِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ مِنْ كُلِّ اللَّيْلِ قَدْ أَوْتَرَ مِنْ أَوَّلِهِ وَأَوْسَطِهِ وَانْتَهَى وِتْرُهُ حِينَ مَاتَ فِي السَّحَرِ";
ibnemaja.urdu = "سیدنا مسروق رحمہ اللہ سے روایت ہے انہوں نے کہا: میں نے ام المومنین سیدہ عائشہ رضی اللہ عنہا سے رسول اللہ ﷺ کی نماز وتر کے متعلق سوال کیا تو انہوں نے فرمایا: رسول اللہ ﷺ نے رات کے ہر حصے میں وتر پڑھے ہیں،رات کے شروع میں بھی اور درمیان میں بھی اور جب رسول اللہ ﷺ کی وفات ہوئی تو(ان دنوں) آپ کے وتر (عام طور پر) سحر کے وقت ختم ہوتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;