var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ قَالَ مِنْ كُلِّ اللَّيْلِ قَدْ أَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَوَّلِهِ وَأَوْسَطِهِ وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے رات کے ہر حصے میں وتر پڑھے ہیں۔رات کے شروع میں بھی درمیان میں بھی اور آپ کے وتر سحر تک ختم ہوتے تھے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;