var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَسُوَيْدُ بْنُ سَعِيدٍ،وَإِسْمَاعِيلُ بْنُ مُوسَى،قَالُوا: حَدَّثَنَا شَرِيكٌ،عَنْ أَبِي إِسْحَاقَ،عَنْ حُبْشِيِّ بْنِ جُنَادَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «عَلِيٌّ مِنِّي وَأَنَا مِنْهُ،وَلَا يُؤَدِّي عَنِّي إِلَّا عَلِيٌّ»";
ibnemaja.urdu = "حضرت حُبشی بن جنادہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو یہ فرماتے سنا ہے:’’علی مجھ سے ہے اور میں اس سے ہوں،میری طرف سے صرف علی رضی اللہ عنہ ہی ادا کریں گے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;