var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْفِرْيَابِيُّ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوِتْرُ حَقٌّ فَمَنْ شَاءَ فَلْيُوتِرْ بِخَمْسٍ وَمَنْ شَاءَ فَلْيُوتِرْ بِثَلَاثٍ وَمَنْ شَاءَ فَلْيُوتِرْ بِوَاحِدَةٍ";
ibnemaja.urdu = "سیدنا ابو ایوب انصاری رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’وتر ضروری ہیں،لہٰذا جو شخص پانچ رکعت وتر پڑھنا چاہے پڑھ لے اور شخص تین وتر پڑھنا چاہے پڑھ لے اور جو شخص ایک وتر پڑھنا چاہے پڑھ لے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;