var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ زُهَيْرٍ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبْعٍ أَوْ بِخَمْسٍ لَا يَفْصِلُ بَيْنَهُنَّ بِتَسْلِيمٍ وَلَا كَلَامٍ";
ibnemaja.urdu = "سیدنا ام المومنین ام سلمہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ساتھ یا پانچ رکعت وتر پڑھتے تھے ان کے درمیان سلام یا کلام کے ساتھ تفریق نہیں کرتے تھے(ایک ہی سلام سے پرھتے تھے)۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;