var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا شُعْبَةُ عَنْ جَابِرٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي السَّفَرِ رَكْعَتَيْنِ لَا يَزِيدُ عَلَيْهِمَا وَكَانَ يَتَهَجَّدُ مِنْ اللَّيْلِ قُلْتُ وَكَانَ يُوتِرُ قَالَ نَعَمْ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ سفر میں دو رکعت (فرض) ادا کرتےت ھے،اس سے زیادہ نہیں پڑھتے تھے اور نبی ﷺ (سفر میں) رات کو تہجد بھی پڑھتے تھے۔(سالم فرماتے ہیں) میں نے عرض کیا: آپ ﷺ (سفر میں) وتر بھی پڑھتے تھے؟ ابن عمر رضی اللہ عنہما نے فرمایا: ہاں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>جابر الجعفي: ضعیف جدًا مدلس <br>وقال البوصیري: ’’ ھذا إسناد ضعیف‘‘`;
ibnemaja.anwaar = [419,1];