var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ حَدَّثَنَا مَيْمُونُ بْنُ مُوسَى الْمَرَئِيُّ عَنْ الْحَسَنِ عَنْ أُمِّهِ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْوِتْرِ رَكْعَتَيْنِ خَفِيفَتَيْنِ وَهُوَ جَالِسٌ";
ibnemaja.urdu = "سیدہ ام المومنین ام سلمہ رضی اللہ عنا سے روایت ہے کہ رسول اللہ ﷺ وتر کے بعد بیٹھ کر ہلکی سی دو رکعتیں پڑھ لیاکرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الحسن البصري عنعن <br>و میمون بن موسی المرئي مدلس و عنعن (طبقات المدلسین 3/109) <br>و حدیث مسلم (738) و الترمذي (471) یغني عنہ`;
ibnemaja.anwaar = [420,1];