var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ قَالَ حَدَّثَتْنِي عَائِشَةُ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِوَاحِدَةٍ ثُمَّ يَرْكَعُ رَكْعَتَيْنِ يَقْرَأُ فِيهِمَا وَهُوَ جَالِسٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ";
ibnemaja.urdu = "ام المومنین سیدہ عائشہ رضی اللہ عنا سےروایت ہے کہ رسول اللہ ﷺ ایک وتر پڑھتے تھے،پھر دو رکعتیں پڑھتے ان میں قراءت بیٹھ کر کرتے جب رکوع کرنا ہوتا تو کھڑے ہو کر رکوع کرتے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;