var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ وَسُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْ مَا كُنْتُ أُلْفِي أَوْ أَلْقَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ آخِرِ اللَّيْلِ إِلَّا وَهُوَ نَائِمٌ عِنْدِي قَالَ وَكِيعٌ تَعْنِي بَعْدَ الْوِتْرِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے ﷺ فرمایا: میں رات کے آخری حصے میں رسول اللہ ﷺ کو ہمیشہ اپنے ہاں سوئے ہوئے پاتی تھی۔وکیع رحمہ اللہ بیان کرتے ہیں: یعنی وتر کے بعد۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;