var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى رَكْعَتَيْ الْفَجْرِ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ جب فجر کی دو(سنت) رکعتیں پڑھ لیتے تو دائیں پہلو پر لیٹ جاتے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;