var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ الرَّازِيُّ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ: أَنْبَأَنَا الْعَلَاءُ بْنُ صَالِحٍ،عَنِ الْمِنْهَالِ،عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ عَلِيٌّ: «أَنَا عَبْدُ اللَّهِ وَأَخُو رَسُولِهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَأَنَا الصِّدِّيقُ الْأَكْبَرُ،لَا يَقُولُهَا بَعْدِي إِلَّا كَذَّابٌ،صَلَّيْتُ قَبْلَ النَّاسِ لِسَبْعِ سِنِينَ»";
ibnemaja.urdu = "حضرت عباد بن عبداللہ رحمہ اللہ عنہ سے روایت ہے کہ علی رضٰ اللہ عنہ نے فرمایا: میں اللہ کا بندہ ہوں اور اس کے رسول کا بھائی ہوں،میں صدیق اکبر ہوں،میرے بعد یہ بات وہی کہے گا جو انتہائی جھوٹا ہے۔میں نے دوسروں سے سات سال پہلے نماز پڑھی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عباد بن عبد اللّٰہ: ضعیف (تقریب: 3136)`;
ibnemaja.anwaar = [379,1];