var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنِي الْحَكَمُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلَاةِ قَالَ وَمَا ذَاكَ فَقِيلَ لَهُ فَثَنَى رِجْلَهُ فَسَجَدَ سَجْدَتَيْنِ";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک بار نبی ﷺنے ظہر کی نماز پانچ رکعتیں پڑھیں۔آپ سے کہا گیا: کیا نماز(کی رکعتوں) میں اضافہ کر دیا گیا ہے؟ آپ ﷺ نے فرمایا: ’’بات کیا ہے؟‘‘ آپ کو بتایا گیا(کہ پانچ رکعتیں پڑھی گئی ہیں۔) تب آپ ﷺ نے پاؤں موڑا اور دو سجدے کر لیے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;