var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةً أَظُنُّ أَنَّهَا الظُّهْرُ فَلَمَّا كَانَ فِي الثَّانِيَةِ قَامَ قَبْلَ أَنْ يَجْلِسَ فَلَمَّا كَانَ قَبْلَ أَنْ يُسَلِّمَ سَجَدَ سَجْدَتَيْنِ";
ibnemaja.urdu = "سیدنا ابن بحینہ (عبداللہ بن مالک رضی اللہ عنہ) سے روایت ہے کہ نبی ﷺ نے ایک نماز پڑھائی وہ غالباً عصر کی نماز تھی۔دوسری رکعت پڑھ کر نبی ﷺ (تشہد کے لیے) بیٹھنے سے پہلے ہی (بھول کر) کھڑے ہو گئے،پھر جب سلام سے پہلے کا وقت آیا تو آپ ﷺ نے دو سجدے کر لیے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;