var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَكَّ أَحَدُكُمْ فِي الصَّلَاةِ فَلْيَتَحَرَّ الصَّوَابَ ثُمَّ يَسْجُدْ سَجْدَتَيْنِ قَالَ الطَّنَافِسِيُّ هَذَا الْأَصْلُ وَلَا يَقْدِرُ أَحَدٌ يَرُدُّهُ";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب کسی کو نماز میں شک پڑ جائے تو اسے چاہیے کہ صحیح بات(سوچ کر) معلوم کرے،پھر دو سجدے کر لے۔‘‘ امام ابن ماجہ رحمہ اللہ کے استاد علی بن محمد طنافسی بیان کرتے ہیں کہ یہ اصل ہے۔اس کا کوئی انکار نہیں کر سکتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;