var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا يُونُسُ بْنُ بَكِيرٍ حَدَّثَنَا ابْنُ إِسْحَقَ أَخْبَرَنِي سَلَمَةُ بْنُ صَفْوَانَ بْنِ سَلَمَةَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّيْطَانَ يَدْخُلُ بَيْنَ ابْنِ آدَمَ وَبَيْنَ نَفْسِهِ فَلَا يَدْرِي كَمْ صَلَّى فَإِذَا وَجَدَ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’شیطان انسان کے اور اس کے دل کے درمیان مداخلت کرتا ہے،چنانچہ اس (نمازی) کوئی معلوم نہیں رہتا کہ کتنی نماز پڑھی ہے۔جب یہ صورت حال پیش آئے تو اسے چاہیے کہ سلام سے پہلے دو سجدے کر لے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;