var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ أَنَّ ابْنَ مَسْعُودٍ سَجَدَ سَجْدَتَيْ السَّهْوِ بَعْدَ السَّلَامِ وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ ذَلِكَ";
ibnemaja.urdu = "سیدنا علقمہ رحمہ اللہ سے روایت ہے کہ سیدنا عبداللہ بن مسعود رضی اللہ عنہ نے سلام کے بعد سہو کے سجدے کیے پھر بیان فرمایا کہ نبی ﷺ نے بھی اسی طرح کیا تھا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;