var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ زُهَيْرِ بْنِ سَالِمٍ الْعَنْسِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ ثَوْبَانَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي كُلِّ سَهْوٍ سَجْدَتَانِ بَعْدَ مَا يُسَلِّمُ";
ibnemaja.urdu = "سیدنا ثوبان رضی اللہ عنہ سے روایت ہے،انہوں نےفرمایا: میں نے رسول اللہ ﷺ سے سنا۔آپ نے فرمایا: ’’ہر بھول میں دو سجدے ہیں۔سلام پھیرنے کے بعد۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;