var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ خَارِجَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَصَابَهُ قَيْءٌ أَوْ رُعَافٌ أَوْ قَلَسٌ أَوْ مَذْيٌ فَلْيَنْصَرِفْ فَلْيَتَوَضَّأْ ثُمَّ لِيَبْنِ عَلَى صَلَاتِهِ وَهُوَ فِي ذَلِكَ لَا يَتَكَلَّمُ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے اللہ کے رسول ﷺ نے فرمایا: ’’جسے نماز میں قے آجائے یا نکسیر پھوٹے یا کوئی چیز پیٹ میں سے منہ میں آئے یا مذی نکلے تو اسے چاہیے کہ(نماز چھوڑ کر) چلا جائے،وضو کرے،پھر اپنی نماز پر بنا کر لے،بشرطیکہ اس اثنا میں کلام نہ کرے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،لأنہ من روایۃ إسماعیل عن الحجازین وھي ضعیفۃ‘‘`;
ibnemaja.anwaar = [420,1];