var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ ابْنِ بُرَيْدَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ كَانَ بِيَ النَّاصُورُ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّلَاةِ فَقَالَ صَلِّ قَائِمًا فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ";
ibnemaja.urdu = "سیدنا عمران بن حصین رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے پھوڑا نکلا ہوا تھا۔میں نے نبی ﷺ سے نماز کے متعلق سوال کیا(کہ کیسے نماز پڑھوں؟) تو آپ ﷺ نے فرمایا: ’’کھڑا ہو کر نماز پڑھ،اگر(کھڑا ہونے کی) طاقت نہ ہو تو بیٹھ کر،اگر اس کی بھی طاقت نہ ہو تو پہلو کے بل (لیٹ کر نماز پڑھ لے۔‘‘)";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;