var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ عَنْ سُفْيَانَ عَنْ جَابِرٍ عَنْ أَبِي حَرِيزٍ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى جَالِسًا عَلَى يَمِينِهِ وَهُوَ وَجِعٌ";
ibnemaja.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو بیٹھ کر نماز پڑھتے دیکھا،آپ بیماری کی وجہ سے دائیں طرف جھک کر بیٹھے ہوئے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جابر: ضعیف رافضي <br>وأبو حریز: مجہول (تقریب: 8044)`;
ibnemaja.anwaar = [420,1];