var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ وَالَّذِي ذَهَبَ بِنَفْسِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَاتَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ وَهُوَ جَالِسٌ وَكَانَ أَحَبُّ الْأَعْمَالِ إِلَيْهِ الْعَمَلَ الصَّالِحَ الَّذِي يَدُومُ عَلَيْهِ الْعَبْدُ وَإِنْ كَانَ يَسِيرًا";
ibnemaja.urdu = "ام المومنین سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: قسم ہے اس ذات کی جس نے نبی ﷺ کو وفات دی! نبی ﷺ اس وقت تک فوت نہیں ہوئے جب تک آپ اکثر (نفلی) نماز بیٹھ کر نہ پڑھنے لگے،اور رسول اللہ ﷺ کو وہ نیک عمل پسند تھا جس پر بندہ ہمیشگی اختیار کرے اگرچہ (وہ عمل) تھوڑا ہو۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;