var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ الْوَلِيدِ بْنِ أَبِي هِشَامٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ وَهُوَ قَاعِدٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ قَدْرَ مَا يَقْرَأُ إِنْسَانٌ أَرْبَعِينَ آيَةً";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ بیٹھ کر قراءت کرتے تھے،جب رکوع کرنا چاہتے تو اتنے عرصے کے لئے کھڑے ہو جاتے جس میں کوئی انسان چالیس آیتوں کی تلاوت کر لے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;