var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا قُطْبَةُ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ بَابَاهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يُصَلِّي جَالِسًا فَقَالَ صَلَاةُ الْجَالِسِ عَلَى النِّصْفِ مِنْ صَلَاةِ الْقَائِمِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرورضی اللہ عنہما سے روایت ہے کہ وہ بیٹھ کر نماز پڑھ رہے تھے کہ ان کے پاس سے نبی ﷺ گزرے اور فرمایا: ’’بیٹھے ہوئے کی نماز کھڑے ہوئے کی نماز سے (ثواب میں) آدمی ہوتی ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;