var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَرَأَى أُنَاسًا يُصَلُّونَ قُعُودًا فَقَالَ صَلَاةُ الْقَاعِدِ عَلَى النِّصْفِ مِنْ صَلَاةِ الْقَائِمِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ (گھر سے) باہر تشریف لائے تو کچھ لوگ بیٹھ کر نماز پڑھتے نظر آئے تو آپ ﷺ نے فرمایا: ’’بیٹھے ہوئے کی نماز کھڑے ہوئے کی نماز سے آدمی ہوتی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;