var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَهَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،قَالَ: قَالَتْ لِي عَائِشُةُ،يَا عُرْوَةُ كَانَ أَبَوَاكَ مِنَ الَّذِينَ اسْتَجَابُوا لِلَّهِ وَالرَّسُولِ مِنْ بَعْدِ مَا أَصَابَهُمُ الْقَرْحُ: أَبُو بَكْرٍ،وَالزُّبَيْرُ";
ibnemaja.urdu = "حضرت عروہ رحمہ اللہ سے روایت ہے کہ حضرت عائشہ رضی اللہ عنہا نے مجھ سے فرمایا: عروہ! تمہارے والد اور نانا ان لوگوں میں شامل ہیں،جنہوں نے زخمی ہونے کے بعد بھی اللہ اور اس کے رسول کے حکم کی تعمیل کی،یعنی ابو بکر اور زبیر رضی اللہ عنہما۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;