var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْنُتُ فِي صَلَاةِ الصُّبْحِ يَدْعُو عَلَى حَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ شَهْرًا ثُمَّ تَرَكَ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ فجر کی نماز میں قنوت فرماتے تھے(قنوت میں) عرب کے ایک قبیلے کے خلاف ایک مہینے تک بددعا کرتے رہے تھے۔پھر اسے ترک کر دیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;