var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ ضَمْضَمِ بْنِ جَوْسٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْأَسْوَدَيْنِ فِي الصَّلَاةِ الْعَقْرَبِ وَالْحَيَّةِ";
ibnemaja.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے نماز کے دوران میں دو سیاہ جانوروں یعنی بچھو اور سانپ کو قتل کرنے کا حکم دیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;