var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ حَدَّثَنَا مِنْدَلٌ عَنْ ابْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتَلَ عَقْرَبًا وَهُوَ فِي الصَّلَاةِ";
ibnemaja.urdu = "جناب ابن ابو رافع رحمہ اللہ اپنے والد سے اور وہ ان کے دادا سے روایت کرتے ہیں کہ نبی ﷺ نے ایک بچھو مار ڈالا جب کہ آپ نماز پڑھ رہے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مندل و محمد بن عبید اللّٰہ بن أبي رافع ضعیفان (تقریب: 6883)`;
ibnemaja.anwaar = [420,1];