var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى التَّيْمِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’عصر کے بعد کوئی نماز نہیں حتی کہ سورج غروب ہو جائے اور فجر کے بعد کوئی نماز نہیں حتی کہ سورج طلوع ہو جائے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;