var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ الْأَوْدِيُّ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا الصَّلْتُ الْأَزْدِيُّ قَالَ: حَدَّثَنَا أَبُو نَضْرَةَ،عَنْ جَابِرٍ،أَنَّ طَلْحَةَ مَرَّ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «شَهِيدٌ يَمْشِي عَلَى وَجْهِ الْأَرْضِ»";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ حضرت طلحہ رضی اللہ عنہ نبی اکرم ﷺ کے پاس سے گزرے تو آپ نے فرمایا:’’یہ شہید ہے جو زمین پر چل رہا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>سنن الترمذي (3739)`;
ibnemaja.anwaar = [380,1];