var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بَنِي عَبْدِ مَنَافٍ لَا تَمْنَعُوا أَحَدًا طَافَ بِهَذَا الْبَيْتِ وَصَلَّى أَيَّةَ سَاعَةٍ شَاءَ مِنْ اللَّيْلِ وَالنَّهَارِ";
ibnemaja.urdu = "سیدنا جبیر بن مطعم رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’اے بنی عبد مناف! کوئی شخص رات یا دن میں جس وقت بھی اس گھر کا طواف کرنا اور نماز پڑھنا چاہے تم اسے منع نہ کرنا۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;