var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّكُمْ سَتُدْرِكُونَ أَقْوَامًا يُصَلُّونَ الصَّلَاةَ لِغَيْرِ وَقْتِهَا فَإِنْ أَدْرَكْتُمُوهُمْ فَصَلُّوا فِي بُيُوتِكُمْ لِلْوَقْتِ الَّذِي تَعْرِفُونَ ثُمَّ صَلُّوا مَعَهُمْ وَاجْعَلُوهَا سُبْحَةً";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’شاید تمہیں ایسے لوگ ملیں جو نماز کو بے وقت ادا کرتے ہوں۔اگر تم انہیں پاؤ تو گھروں میں اس وقت نماز ادا کر لیا کرو جو تمہیں معلوم ہے(کہ یہ صحیح وقت ہے) پھر ان کے ساتھ بھی نماز پڑھ لو اور اسے نفل سمجھ لو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;