var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلِّ الصَّلَاةَ لِوَقْتِهَا فَإِنْ أَدْرَكْتَ الْإِمَامَ يُصَلِّي بِهِمْ فَصَلِّ مَعَهُمْ وَقَدْ أَحْرَزْتَ صَلَاتَكَ وَإِلَّا فَهِيَ نَافِلَةٌ لَكَ";
ibnemaja.urdu = "سیدنا ابو ذر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’ نماز وقت پر ادا کر،پھر اگر تجھے امام لوگوں کو نماز پڑھاتا مل جائے تو ان کے ساتھ بھی نماز پڑھ لے اور(اول وقت ادا کر کے) تو نے اپنی نماز محفوظ کر لی ورنہ (دوبارہ پڑھنے سے) وہ تیرے لئے نفل بن گئی۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;