var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ أَبِي الْمُثَنَّى عَنْ أَبِي أُبَيٍّ ابْنِ امْرَأَةِ عُبَادَةَ بْنِ الصَّامِتِ يَعْنِي عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيَكُونُ أُمَرَاءُ تَشْغَلُهُمْ أَشْيَاءُ يُؤَخِّرُونَ الصَّلَاةَ عَنْ وَقْتِهَا فَاجْعَلُوا صَلَاتَكُمْ مَعَهُمْ تَطَوُّعًا";
ibnemaja.urdu = "سیدنا عبادہ بن صامت رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’مستقبل میں ایسے حکمران ہوں گے جنہیں دوسری چیزیں نماز سے مشغول کر دیں گی اور وہ نمازوں کو ان کے اوقات سے موخر کر دیں گے۔تم ان کے ساتھ پڑھی ہوئی اپنی نماز کو نفل سمجھ لینا۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;