var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ: حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ: حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ قَالَ: حَدَّثَنِي إِسْحَاقُ بْنُ يَحْيَى بْنِ طَلْحَةَ،عَنْ مُوسَى بْنِ طَلْحَةَ،عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ،قَالَ: نَظَرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى طَلْحَةَ،فَقَالَ: «هَذَا مِمَّنْ قَضَى نَحْبَهُ»";
ibnemaja.urdu = "حضرت معاویہ بن ابو سفیان رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے حضرت طلحہ رضی اللہ عنہ کو دیکھ کر فرمایا:’’یہ ان میں سے ہے جنہوں نے اپنا وعدہ پورا کر دیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `[126۔127] إسنادہ ضعیف <br>ترمذي (3202)<br>قلت: و حدیث الترمذي (الأصل: 3203 وسندہ حسن) یغني عنہ`;
ibnemaja.anwaar = [380,1];