var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ أَبِي مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنْ النَّاسِ فَإِذَا رَأَيْتُمُوهُ فَقُومُوا فَصَلُّوا";
ibnemaja.urdu = "سیدنا ابو مسعود رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’سورج اور چاند کو لوگوں میں سے کسی کے مرنے پر گرہن نہیں لگتا،جب تم یہ چیز دیکھو تو کھڑے ہو کر نماز پرھو۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;