var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ ثَعْلَبَةَ بْنِ عِبَادٍ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْكُسُوفِ فَلَا نَسْمَعُ لَهُ صَوْتًا";
ibnemaja.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں سورج گرہن کی نماز پڑھائی اور ہمیں نبی ﷺ کی(قراءت کی) آواز سنائی نہیں دے رہی تھی۔(سری قراءت کی۔)";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;