var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ: أَنْبَأَنَا إِسْحَاقُ،عَنْ مُوسَى بْنِ طَلْحَةَ،قَالَ: كُنَّا عِنْدَ مُعَاوِيَةَ،فَقَالَ: أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «طَلْحَةُ مِمَّنْ قَضَى نَحْبَهُ»";
ibnemaja.urdu = "حضرت موسیٰ بن طلحہ سے روایت ہے انہوں نے کہا: ہہم معاویہ رضی اللہ عنہ کے پاس تھے۔انہوں نے فرمایا: میں گواہی دیتا ہوں کہ میں نے اللہ کے رسول ﷺ سے سنا ہے آپ فرما رہے تھے:’’طلحہ(رضی اللہ عنہ) ان لوگوں میں سے ہیں جنہوں نے اپنا وعدہ پورا کر دیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `۔127] إسنادہ ضعیف <br>ترمذي (3202)<br>قلت: و حدیث الترمذي (الأصل: 3203 وسندہ حسن) یغني عنہ`;
ibnemaja.anwaar = [380,1];