var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ عَنْ بَرَكَةَ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْقَى حَتَّى رَأَيْتُ أَوْ رُئِيَ بَيَاضُ إِبْطَيْهِ قَالَ مُعْتَمِرٌ أُرَاهُ فِي الِاسْتِسْقَاءِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ نے بارش کی دعا کی (اور ہاتھ خوب اٹھائے) حتی کہ مجھے آپ ﷺ کی بغلوں کی سفیدی نظر آگئی۔(حدیث کے راوی) معتمر رحمہ اللہ بیان کرتے ہیں: میرا خیال ہے کہ نماز استسقاء کے موقع پر ایسا ہوا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سلیمان التیمي مدلس و عنعن <br>و لبعض الحدیث شواھد و ھي تغني عن ھذا الحدیث`;
ibnemaja.anwaar = [421,1];