var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ الْحَسَنِ بْنِ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ الْعِيدِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے عید کے دن بغیر اذان اور بغیر اقامت کے(عید کی) نماز ادا فرمائی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;