var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَوْثَرَةُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَبُو بَكْرٍ ثُمَّ عُمَرُ يُصَلُّونَ الْعِيدَ قَبْلَ الْخُطْبَةِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،ا نہوں نے فرمایا: نبی ﷺ ان کے بعد ابو بکر،پھر ان کے بعد عمر رضی اللہ عنہما عید کی نمازخطبے سے پہلے ادا فرماتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;