var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَبِّرُ فِي الْعِيدَيْنِ فِي الْأُولَى سَبْعًا قَبْلَ الْقِرَاءَةِ وَفِي الْآخِرَةِ خَمْسًا قَبْلَ الْقِرَاءَةِ";
ibnemaja.urdu = "سیدنا سعد مؤذنِ رسول ﷺ سے روایت ہے کہ رسول اللہ ﷺ عیدین کی نماز میں پہلی رکعت میں قراءت سے پہلے ساتھ تکبیریں اور دوسری رکعت میں قراءت سے پہلے پانچ تکبیریں کہتے تھے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;