var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي صَلَاةِ الْعِيدَيْنِ سَبْعًا وَخَمْسًا";
ibnemaja.urdu = "عمرو بن شعیب اپنے والد (شعیب بن محمد رحمہ اللہ) سے اور وہ اپنے دادا(عبداللہ بن عمرو رضی اللہ عنہما) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے نمازِ عید میں سات اور پانچ تکبیریں کہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;