var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَسْعُودٍ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ عَثْمَةَ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي الْعِيدَيْنِ سَبْعًا فِي الْأُولَى وَخَمْسًا فِي الْآخِرَةِ";
ibnemaja.urdu = "کثیر بن عبداللہ رحمہ اللہ اپنے والد (عبداللہ بن عمرو بن عوف رحمہ اللہ) سے اور وہ ان کے دادا(عمرو بن عوف رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے دونوں عیدوں میں پہلی رکعت میں سات تکبیریں اور دوسری رکعت میں پانچ تکبیریں کہیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;