var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ خَالِدِ بْنِ يَزِيدَ وَعُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي الْفِطْرِ وَالْأَضْحَى سَبْعًا وَخَمْسًا سِوَى تَكْبِيرَتَيْ الرُّكُوعِ";
ibnemaja.urdu = "ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے عید الفطر اور عیدا لاضحیٰ (کی نماز) میں سات اور پانچ تکبیریں کہیں جن میں رکوع کی تکبیریں شامل نہیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;