var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْعِيدَيْنِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ";
ibnemaja.urdu = "نعمان بن بشیر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ دونوں عیدوں میں(سَبِّحِ اسْمَ رَبِّکَ الأَعْلَی) اور (ہَلْ أَتَاکَ حَدِیثُ الْغَاشِیَۃِ) پڑھا کرتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;