var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ خَرَجَ عُمَرُ يَوْمَ عِيدٍ فَأَرْسَلَ إِلَى أَبِي وَاقِدٍ اللَّيْثِيِّ بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي مِثْلِ هَذَا الْيَوْمِ قَالَ بِقَافْ وَاقْتَرَبَتْ";
ibnemaja.urdu = "عبیداللہ بن عبداللہ رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: عمر رضی اللہ عنہ عید کے دن باہر تشریف لائے،انہوں نے ابو واقد لیثی رضی اللہ عنہ سے دریافت کرایا: نبی ﷺ اس دن(عید کے دن) کن سورتوں کی قراءت فرماتے تھے؟ ابو واقد رضی اللہ عنہ نے فرمایا: قاف(سورہٴ ق) اور اقتربت (سورہٴ قمر)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;