var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ كَانَ يَقْرَأُ فِي الْعِيدَيْنِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہےکہ نبی ﷺ عیدین میں (سَبِّحِ اسْمَ رَبِّکَ الأَعْلَی)اور (ہَلْ أَتَاکَ حَدِیثُ الْغَاشِیَۃِ) پڑھا کرتے تھے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;