var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ قَالَ رَأَيْتُ أَبَا كَاهِلٍ وَكَانَتْ لَهُ صُحْبَةٌ فَحَدَّثَنِي أَخِي عَنْهُ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَةٍ وَحَبَشِيٌّ آخِذٌ بِخِطَامِهَا";
ibnemaja.urdu = "سیدنا ابو کاہل احمسی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو اونٹنی پر خطبہ ارشاد فرماتے دیکھا اور ایک حبشی نے اونٹنی کی مہار پکڑ رکھی تھی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;