var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ عَائِذٍ هُوَ أَبُو كَاهِلٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَةٍ حَسْنَاءَ وَحَبَشِيٌّ آخِذٌ بِخِطَامِهَا";
ibnemaja.urdu = "ابو کاہل قیس بن عائذ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو ایک خوبصورت اونٹنی پر سوار ہو کر خطبہ دیتے ہوئے سنا اور ایک حبشی نے اس کی مہار تھام رکھی تھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;