var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ أَبِيهِ أَنَّهُ حَجَّ فَقَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى بَعِيرِهِ";
ibnemaja.urdu = "سلمہ بن نبیط اپنے والد(نبیط بن شریط رضی اللہ عنہ) سے روایت کرتے ہیں کہ انہوں نے حج کیا اور فرمایا: میں نے نبی ﷺ کو اونٹنی پر (سوار ہو کر) خطبہ دیتے دیکھا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>سنن أبي داود (1916) نسائي (3010،3011)`;
ibnemaja.anwaar = [421,1];