var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ الْمُؤَذِّنِ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ بَيْنَ أَضْعَافِ الْخُطْبَةِ يُكْثِرُ التَّكْبِيرَ فِي خُطْبَةِ الْعِيدَيْنِ";
ibnemaja.urdu = "سعد القرظ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ خطبے کے دوران میں تکبیرات کہا کرتے تھے۔عیدین کے خطبے میں کثرت سے تکبیرات کہتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد الرحمٰن بن سعد: ضعیف`;
ibnemaja.anwaar = [421,1];