var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو بَحْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فِطْرٍ أَوْ أَضْحَى فَخَطَبَ قَائِمًا ثُمَّ قَعَدَ قَعْدَةً ثُمَّ قَامَ";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: عید الفطر یا عید الاضحیٰ کے دن رسول اللہ ﷺ باہر(میدان میں) تشریف لے گئے۔آپ نے کھڑے ہو کر خطبہ دیا،پھر تھوڑی دیر بیٹھ گئے پھر کھڑے ہوگئے (اور خطبہ دیا)۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري ما ملخصہ: ’’ إسماعیل بن مسلم (المکي) أجمعوا علی ضعفہ،أبو بحر (البکراوي) ضعیف ‘‘ إسماعیل بن مسلم: ضعیف <br>وعبد الرحمٰن بن عثمان البکراوي: ضعیف`;
ibnemaja.anwaar = [421,1];