var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ،عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ،قَالَ: مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَمَعَ أَبَوَيْهِ لِأَحَدٍ غَيْرَ سَعْدِ بْنِ مَالِكٍ،فَإِنَّهُ قَالَ لَهُ يَوْمَ أُحُدٍ: «ارْمِ سَعْدُ،فِدَاكَ أَبِي وَأُمِّي»";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے سعد بن مالک رضی اللہ عنہ کے سوا کسی صحابی کے متعلق رسول اللہ ﷺ سے ماں باپ قربان ہونے کے الفاظ نہیں سنے۔صرف انہیں آپ ﷺ نے غزوہٴ احد کے موقع پر فرمایا تھا:’’سعد! تیر چلاؤ،میرے ماں باپ تم پر قربان۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;