var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ وَعَمْرُو بْنُ رَافِعٍ الْبَجَلِيُّ قَالَا حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَ حَضَرْتُ الْعِيدَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِنَا الْعِيدَ ثُمَّ قَالَ قَدْ قَضَيْنَا الصَّلَاةَ فَمَنْ أَحَبَّ أَنْ يَجْلِسَ لِلْخُطْبَةِ فَلْيَجْلِسْ وَمَنْ أَحَبَّ أَنْ يَذْهَبَ فَلْيَذْهَبْ";
ibnemaja.urdu = "عبداللہ بن سائب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں رسول اللہ ﷺ کے ہمراہ نماز عید میں شریک ہوا،آپ ﷺ نے ہمیں عید کی نماز پڑھائی،پھر فرمایا: ’’ہم نے نماز پڑھ لی ہے۔(اب) جو شخص خطبہ سننے کے لیے بیٹھنا چاہے بیٹھ جائے اور شخص جانا چاہےچلا جائے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;