var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَصَلَّى بِهِمْ الْعِيدَ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ باہر (میدان میں) تشریف لے گئے اور لوگوں کو نماز عید پڑھائی۔اس سے پہلے یا بعد میں کوئی(نفل) نماز ادا نہیں کی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;