var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الطَّائِفِيُّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا فِي عِيدٍ";
ibnemaja.urdu = "سیدنا عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا(عبداللہ بن عمرو بن عاص رضی اللہ عنہما) سے روایت بیان کرتے ہیں کہ نبی ﷺ نے نماز عید کے موقع پر اس سے پہلے یا بعد میں نماز (نفل)ادا نہیں فرمائی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;