var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو الرَّقِّيِّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي قَبْلَ الْعِيدِ شَيْئًا فَإِذَا رَجَعَ إِلَى مَنْزِلِهِ صَلَّى رَكْعَتَيْنِ";
ibnemaja.urdu = "ابو سعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ عید کی نماز سے پہلے کوئی نماز نہیں پرھتے تھے۔پھر جب (نماز عید کی ادائیگی کے بعد گھر) واپس تشریف لاتے تو دو رکعت نماز پڑھتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن عقیل ضعیف`;
ibnemaja.anwaar = [422,1];