var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ إِلَى الْعِيدِ مَاشِيًا وَيَرْجِعُ مَاشِيًا";
ibnemaja.urdu = "سعد القرظ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نماز عید کے لیے پیدل تشریف لے جاتے تھے اور پیدل واپس آتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد الرحمٰن بن سعد: ضعیف <br>وضعفہ البوصیري <br>وللحدیث شواھد ضعیفۃ عند الترمذي (530) وغیرہ`;
ibnemaja.anwaar = [422,1];