var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ الْعُمَرِيُّ عَنْ أَبِيهِ وَعُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ إِلَى الْعِيدِ مَاشِيًا وَيَرْجِعُ مَاشِيًا";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نماز عید کے لئے پیدل تشریف لے جاتے تھے اور پیدل واپس آتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد فیہ عبد الرحمٰن بن عبد اللّٰہ العمري وھو ضعیف ‘‘ وھو متروک (تقریب: 3922)`;
ibnemaja.anwaar = [422,1];