var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْخَطَّابِ حَدَّثَنَا مِنْدَلٌ عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي الْعِيدَ مَاشِيًا";
ibnemaja.urdu = "سیدنا ابو رافع رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ عید کی نماز کے لیے پید جاتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>انظر الحدیث الآتي (1300) <br>مندل و محمد بن عبید اللّٰہ بن أبي رافع: ضعیفان`;
ibnemaja.anwaar = [422,1];