var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو قُتَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يَخْرُجُ إِلَى الْعِيدِ فِي طَرِيقٍ وَيَرْجِعُ فِي أُخْرَى وَيَزْعُمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ وہ عید کی نماز کے لیے ایک راستے جاتے اور دوسرے سے واپس آتے اور بیان کرتے کہ رسول اللہ ﷺ بھی اسی طرح کرتے تھے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;