var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،ح وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،وَإِسْمَاعِيلُ بْنُ عَيَّاشٍ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،قَالَ: سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ،يَقُولُ: لَقَدْ جَمَعَ لِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ أَبَوَيْهِ،فَقَالَ: «ارْمِ سَعْدُ،فِدَاكَ أَبِي وَأُمِّي»";
ibnemaja.urdu = "حضرت سعد بن ابو وقاص رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جنگِ احد کے دن رسول اللہ ﷺ نے میرے لئے اپنے والدین کا نام لیا،یعنی یوں فرمایا:’’اے سعد! تیر چلاؤ،میرے ماں باپ تم پر قربان۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;