var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْخَطَّابِ حَدَّثَنَا مِنْدَلٌ عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي الْعِيدَ مَاشِيًا وَيَرْجِعُ فِي غَيْرِ الطَّرِيقِ الَّذِي ابْتَدَأَ فِيهِ";
ibnemaja.urdu = "سیدنا ابو رافع رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ عید کی نماز کے لیے پیدل تشریف لے جاتے تھے اور جس راستے سے جاتے تھے اس کے علاوہ دوسرے راستے سے واپس تشریف لاتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (1297)`;
ibnemaja.anwaar = [422,1];