var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا أَبُو تُمَيْلَةَ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ الْحَارِثِ الزُّرَقِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ إِلَى الْعِيدِ رَجَعَ فِي غَيْرِ الطَّرِيقِ الَّذِي أَخَذَ فِيهِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ جب عید کی نماز کے لئے باہر تشریف لے جاتے تو جس راستے سے جاتے اس کے سوا دوسرے راستے سے واپس آتے تھے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;