var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا شَرِيكٌ عَنْ مُغِيرَةَ عَنْ عَامِرٍ قَالَ شَهِدَ عِيَاضٌ الْأَشْعَرِيُّ عِيدًا بِالْأَنْبَارِ فَقَالَ مَا لِي لَا أَرَاكُمْ تُقَلِّسُونَ كَمَا كَانَ يُقَلَّسُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عامر رحمہ اللہ عنہ سے روایت ہے انہوں نے فرمایا: سیدنا عیاش اشعری رضی اللہ عنہ نے ایک عید انبار میں منائی تو فرمایا: کیا بات ہے میں تمہیں گاتے بجاتے نہیں دیکھ رہا جس طرح رسول اللہ ﷺ کی موجودگی میں گانا بجانا ہوتا تھا؟";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>شریک القاضي و مغیرۃ عنعنا`;
ibnemaja.anwaar = [422,1];