var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى يَوْمَ عِيدٍ أَوْ غَيْرَهُ نُصِبَتْ الْحَرْبَةُ بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا وَالنَّاسُ مِنْ خَلْفِهِ قَالَ نَافِعٌ فَمِنْ ثَمَّ اتَّخَذَهَا الْأُمَرَاءُ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ عید کے دن یا کسی اور دن جب نماز ادا فرماتے تو آپ کے سامنے برچھی گاڑ دی جاتی۔آپ اس کی طرف منہ کر کے نماز ادا فرماتے اور لوگ آپ کے پیچھے کھڑے ہو جاتے تھے۔امام نافع رحمہ اللہ نے فرمایا: اسی وجہ سے خلفاء نے یہ طریقہ اختیار کیا ہے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;