var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْعِيدَ بِالْمُصَلَّى مُسْتَتِرًا بِحَرْبَةٍ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے عید گاہ میں عید کی نماز برچھی کو سترہ بنا کر ادا فرمائی۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;