var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْرِجُوا الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ لِيَشْهَدْنَ الْعِيدَ وَدَعْوَةَ الْمُسْلِمِينَ وَلْيَجْتَنِبَنَّ الْحُيَّضُ مُصَلَّى النَّاسِ";
ibnemaja.urdu = "ام عطیہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: نو جوان،پردہ نشین بچیوں کو بھی (نماز عید کے لئے) گھروں سے باہر(عید گاہ میں) لے کر آؤ،انہیں چاہیے کہ وہ عید میں اور مسلمانوں کی دعا میں حاضر ہوں۔حیض والی عورتیں عام لوگوں(نماز پڑھنے والی عورتوں) کی نماز کی جگہ سے الگ رہیں۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;