var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخْرِجُ بَنَاتِهِ وَنِسَاءَهُ فِي الْعِيدَيْنِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ عیدین میں اپنی صاحب زادیوں اور خواتین کو گھر سے باہر(عید گاہ) میں لے جایا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حجاج بن أرطاۃ عنعن <br>والسند ضعفہ البوصیري لتدلیسہ`;
ibnemaja.anwaar = [423,1];