var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا مِنْدَلُ بْنُ عَلِيٍّ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ اجْتَمَعَ عِيدَانِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِالنَّاسِ ثُمَّ قَالَ مَنْ شَاءَ أَنْ يَأْتِيَ الْجُمُعَةَ فَلْيَأْتِهَا وَمَنْ شَاءَ أَنْ يَتَخَلَّفَ فَلْيَتَخَلَّفْ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ انہوں نے فرمایا: رسول اللہ ﷺ کے زمانے میں دو عیدیں (ایک دن میں) جمع ہوگئیں۔آپ ﷺ نے لوگوں کو (عید کی) نماز پڑھائی پھر فرمایا: ’’جو شخص جمعے کی نماز میں آنا چاہے آجائے جو پیچھے رہنا چاہے پیچھے رہ جائے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>جبارۃ بن المغلس ضعیف (تقریب: 890) <br>و مندل بن علي ضعیف <br>و الحدیث السابق (الأصل: 1310) یغني عنہ`;
ibnemaja.anwaar = [423,1];