var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ حَدَّثَنَا نَائِلُ بْنُ نَجِيحٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ زِيَادٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُلْبَسَ السِّلَاحُ فِي بِلَادِ الْإِسْلَامِ فِي الْعِيدَيْنِ إِلَّا أَنْ يَكُونُوا بِحَضْرَةِ الْعَدُوِّ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے مسلمانوں کے علاقے میں عیدین کے موقع پر ہتھیار پہننے سے منع فرمایا،الا یہ کہ وہ دشمن کے مقابل ہوں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>إسماعیل بن زیاد: متروک کذبوہ (تقریب: 446) <br>ونائل بن نجیح: ضعیف (تقریب:7089)`;
ibnemaja.anwaar = [423,1];