var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا حَجَّاجُ بْنُ تَمِيمٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ عید الفطر اور عید الاضحیٰ کے دن غسل کیا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>جبارۃ:ضعیف <br>والحجاج بن تمیم: ضعیف (تقریب: 1120) <br>والسند ضعفہ الحافظ فی الدرایۃ (ح36)`;
ibnemaja.anwaar = [423,1];