var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يُوسُفُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو جَعْفَرٍ الْخَطْمِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُقْبَةَ بْنِ الْفَاكِهِ بْنِ سَعْدٍ عَنْ جَدِّهِ الْفَاكِهِ بْنِ سَعْدٍ وَكَانَتْ لَهُ صُحْبَةٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ يَوْمَ الْفِطْرِ وَيَوْمَ النَّحْرِ وَيَوْمَ عَرَفَةَ وَكَانَ الْفَاكِهُ يَأْمُرُ أَهْلَهُ بِالْغُسْلِ فِي هَذِهِ الْأَيَّامِ";
ibnemaja.urdu = "سیدنا فاکہ بن سعد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ عید الفطر کے دن قربانی کے دن اور عرفہ کے دن غسل کرتے تھے،فاکہ رضی اللہ عنہ بھی ان ایام میں اپنے گھر والوں کو غسل کرنے کا حکم دیا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع <br>یوسف بن خالد: زندیق کذاب،لا یکتب عنہ شيء کما قال ابن معین رحمہ اللّٰہ (تاریخ ابن معین روایۃ الدوري: 3556) وعبد الرحمٰن بن عقبۃ: مجہول (تقریب:3956)`;
ibnemaja.anwaar = [423,1];