var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ أَنَّهُ خَرَجَ مَعَ النَّاسِ يَوْمَ فِطْرٍ أَوْ أَضْحَى فَأَنْكَرَ إِبْطَاءَ الْإِمَامِ وَقَالَ إِنْ كُنَّا لَقَدْ فَرَغْنَا سَاعَتَنَا هَذِهِ وَذَلِكَ حِينَ التَّسْبِيحِ";
ibnemaja.urdu = "عبداللہ بن بسر رضی اللہ عنہما سے روایت ہے کہ وہ عید الفطر یا عید الاضحیٰ کے دن لوگوں کے ساتھ(عید گاہ کی طرف) روانہ ہوئے۔انہوں نے امام کے دیر کرنے کو نا پسند فرمایا۔اور فرمایا: ہم تو اس وقت تک فارغ ہو جایا کرتے تھے۔اس وقت نفل نماز کی ادائیگی کا وقت ہو چکا تھا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;