var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَسْرُوقُ بْنُ الْمَرْزُبَانِ قَالَ: حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ،عَنْ هَاشِمِ بْنِ هَاشِمٍ،قَالَ: سَمِعْتُ سَعِيدَ بْنَ الْمُسَيِّبِ،يَقُولَ: قَالَ: سَعْدُ بْنُ أَبِي وَقَّاصٍ،: «مَا أَسْلَمَ أَحَدٌ فِي الْيَوْمِ الَّذِي أَسْلَمْتُ فِيهِ،وَلَقَدْ مَكَثْتُ سَبْعَةَ أَيَّامٍ وَإِنِّي لَثُلُثُ الْإِسْلَامِ»";
ibnemaja.urdu = "حضرت سعد بن ابو وقاص رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جس دن میں اسلام قبول کیا،اس دس کسی اور شخص نے اسلام قبول نہیں کیا۔سات دن تک میں مسلمانوں کی تعداد کا ایک تہائی رہا ہوں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;