var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ وَعَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ و عَنْ ابْنِ أَبِي لَبِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ و عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عُمَرَ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ يُصَلِّي مَثْنَى مَثْنَى فَإِذَا خَافَ الصُّبْحَ أَوْتَرَ بِوَاحِدَةٍ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ سے رات کی نماز (تہجد) کے بارے میں سوال کیا گیا تو آپ نے فرمایا: ’’(نمازی کو چاہیے کہ) دو دو رکعت پڑھتا رہے،جب صبح صادق ہوجانے کا خوف محسوس ہو تو ایک وتر پڑھ لے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;