var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ أَنَّهُ سَمِعَ عَلِيًّا الْأَزْدِيَّ يُحَدِّثُ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’رات اور دن کی (نفل) نماز دو دو رکعت ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;