var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِي سُفْيَانَ السَّعْدِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي كُلِّ رَكْعَتَيْنِ تَسْلِيمَةٌ";
ibnemaja.urdu = "ابو سعید رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’ہر دو رکعت میں سلام ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>طریف بن شہاب السعدي: ضعیف`;
ibnemaja.anwaar = [424,1];