var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَبْدُ رَبِّهِ بْنُ سَعِيدٍ عَنْ أَنَسِ بْنِ أَبِي أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ نَافِعِ ابْنِ الْعَمْيَاءِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ الْمُطَّلِبِ يَعْنِي ابْنَ أَبِي وَدَاعَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى وَتَشَهَّدُ فِي كُلِّ رَكْعَتَيْنِ وَتَبَاءَسُ وَتَمَسْكَنُ وَتُقْنِعُ وَتَقُولُ اللَّهُمَّ اغْفِرْ لِي فَمَنْ لَمْ يَفْعَلْ ذَلِكَ فَهِيَ خِدَاجٌ";
ibnemaja.urdu = "مطلب بن ابو وداعہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’رات کی نماز دو دو رکعت ہے،ہر دو رکعت کے بعد تشہد ہے اور عجزہ مسکنت کا اظہار ہے اور ہاتھ اٹھا کر کہو: اے اللہ! مجھے بخش دے،جس نے ایسے نہ کیا،اس کی نماز ناقص ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1296)`;
ibnemaja.anwaar = [424,1];