var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ ذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ ذَلِكَ الشَّيْطَانُ بَالَ فِي أُذُنَيْهِ";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کی موجودگی میں ایک شخص کا ذکر ہوا کہ وہ رات سے صبح تک (ساری رات) سویا رہا،آپ ﷺ نے فرمایا: ’’اس شخص کے کانوں میں شیطان نے پیشاب کر دیا تھا۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;