var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكُنْ مِثْلَ فُلَانٍ كَانَ يَقُومُ اللَّيْلَ فَتَرَكَ قِيَامَ اللَّيْلِ";
ibnemaja.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’فلاں کی طرح نہ ہو جانا۔وہ رات کو قیام کیا کرتا تھا،پھر اس نے رات کا قیام (تہجد پڑھنا) ترک کر دیا۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;