var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُحَمَّدٍ الطَّلْحِيُّ حَدَّثَنَا ثَابِتُ بْنُ مُوسَى أَبُو يَزِيدَ عَنْ شَرِيكٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَثُرَتْ صَلَاتُهُ بِاللَّيْلِ حَسُنَ وَجْهُهُ بِالنَّهَارِ";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص رات کو زیادہ نماز پڑھے اس کا چہرہ دن کو خوبصورت ہو جاتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `موضوع <br>ثابت بن موسی الزاہد: ضعیف الحدیث (تقریب: 831) <br>وأدخل قول شریک فی الخبر کما قال ابن حبان (المجروحین 1/ 207) <br>و أوردہ ابن الجوزي فی الموضوعات (109/2،110)`;
ibnemaja.anwaar = [424,1];