var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ الْأَغَرِّ عَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَيْقَظَ الرَّجُلُ مِنْ اللَّيْلِ وَأَيْقَظَ امْرَأَتَهُ فَصَلَّيَا رَكْعَتَيْنِ كُتِبَا مِنْ الذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ";
ibnemaja.urdu = "سیدنا ابو سعید اور ابو ہریرہ رضی اللہ عنہما سے روایت ہے نبی ﷺ نے فرمایا:’’جب آدمی رات کو جاگے اور اپنی بیوی کو بھی جگائے،پھر وہ دونوں دو رکعت نماز پڑھیں تو ان کے نام اللہ کے بہت زیادہ ذکر کرنے والے مردوں اور بہت ذکر والی عورتوں میں لکھ دیے جاتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (1309)`;
ibnemaja.anwaar = [424,1];