var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَدَنِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ بْنِ مُجَمِّعٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَحْسَنِ النَّاسِ صَوْتًا بِالْقُرْآنِ الَّذِي إِذَا سَمِعْتُمُوهُ يَقْرَأُ حَسِبْتُمُوهُ يَخْشَى اللَّهَ";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’قرآن کی تلاوت میں اچھی آواز والا وہ ہے جسے تم تلاوت کرتے سن کر یہ گماہ کرو کہ وہ اللہ کا خوف رکھتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن مجمع: ضعیف <br>وللحدیث شاہد مرسل ضعیف عند ابن المبارک فی الزہد (114)`;
ibnemaja.anwaar = [425,1];