var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدِ بْنِ رَاشِدٍ الرَّمْلِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ عُبَيْدِ اللَّهِ عَنْ مَيْسَرَةَ مَوْلَى فَضَالَةَ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَلَّهُ أَشَدُّ أَذَنًا إِلَى الرَّجُلِ الْحَسَنِ الصَّوْتِ بِالْقُرْآنِ يَجْهَرُ بِهِ مِنْ صَاحِبِ الْقَيْنَةِ إِلَى قَيْنَتِهِ";
ibnemaja.urdu = "فضالہ بن عبید رضٰ اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ اچھی آواز والے آدمی کو بلند آواز سے قرآن پڑھتے ہوئے اس سے بھی زیادہ توجہ سے سنتا ہے جس قدر توجہ سے گانے والی لونڈی کا مالک اپنی لونڈی کا گانا سنتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الولید بن مسلم لم یصرح بالسماع المسلسل <br>و فی السند علۃ أخری: بین فضالۃ رضي اللّٰہ عنہ و إسماعیل بن عبید اللّٰہ: میسرۃ مولی فضالۃ وھو مجھول الحال`;
ibnemaja.anwaar = [425,1];