var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ فَسَمِعَ قِرَاءَةَ رَجُلٍ فَقَالَ مَنْ هَذَا فَقِيلَ عَبْدُ اللَّهِ بْنُ قَيْسٍ فَقَالَ لَقَدْ أُوتِيَ هَذَا مِنْ مَزَامِيرِ آلِ دَاوُدَ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ مسجد میں داخل ہوئے تو ایک آدمی کی تلاوت کی آواز سنائی دی۔فرمایا: ’’یہ کون ہے؟‘‘ عرض کی گئی: عبداللہ بن قیس ہیں۔فرمایا: ’’اسے تو آل داؤدعلیہ السلام کا ایک ساز مل گیا ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;