var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ طَلْحَةَ الْيَامِيَّ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْسَجَةَ قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يُحَدِّثُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ";
ibnemaja.urdu = "براء بن عازب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قرآن کو اپنی آوازوں کے ساتھ مزین کرو۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;