var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمْ يَفْقَهْ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاثٍ";
ibnemaja.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے اللہ کے رسول ﷺ نے فرمایا: ’’جس نے تین دن سے کم مدت میں قرآن مجید پورا پڑھا اس نے قرآن کو سمجھا ہی نہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;