var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ حَدَّثَنَا قَتَادَةُ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ لَا أَعْلَمُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ حَتَّى الصَّبَاحِ";
ibnemaja.urdu = "سیدنا عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: میرے علم میں نہیں کہ اللہ کے نبی ﷺ نے صبح تک پورا قرآن مجید پڑھا ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;