var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مِسْعَرٌ عَنْ أَبِي الْعَلَاءِ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ قَالَتْ كُنْتُ أَسْمَعُ قِرَاءَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ وَأَنَا عَلَى عَرِيشِي";
ibnemaja.urdu = "ام ہانی بنت ابو طالب رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: مجھے رات کو نبی ﷺ کی تلاوت کی آواز سنائی دیتی تھی،جب کہ میں اپنے گھر کی چھت پر ہوتی تھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;