var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،جَمِيعًا عَنْ أَبِي إِسْحَاقَ،عَنْ صِلَةَ بْنِ زُفَرَ،عَنْ حُذَيْفَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَهْلِ نَجْرَانَ: «سَأَبْعَثُ مَعَكُمْ رَجُلًا أَمِينًا حَقَّ أَمِينٍ»،قَالَ: فَتَشَرَّفَ لَهُ النَّاسُ،فَبَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ";
ibnemaja.urdu = "حضرت حذیفہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے نجران والوں سے کہا: ’’میں تمہارے ساتھ ایک دیانت دار آدمی بھیجوں گا،جو کما حقہ دیانت دار ہے۔‘‘ لوگوں کو جستجو ہوئی۔آپ ﷺ نے ابو عبیدہ بن جراح رضی اللہ عنہ کو بھیجا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;