var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فَكَانَ إِذَا مَرَّ بِآيَةِ رَحْمَةٍ سَأَلَ وَإِذَا مَرَّ بِآيَةِ عَذَابٍ اسْتَجَارَ وَإِذَا مَرَّ بِآيَةٍ فِيهَا تَنْزِيهٌ لِلَّهِ سَبَّحَ";
ibnemaja.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے نماز پڑھی۔آپ جب کسی رحمت کی آیت پر پہنچتے تو(اللہ کی رحمت کا) سوال فرماتے۔اور جب کسی عذاب کی آیت پر پہنچتے تو (اللہ کے عذاب سے) پناہ مانگتے اور جب کسی ایسی آیت پر پہنچتے جس میں اللہ کی تقدیس اور پاکیزگی کا ذکر ہوتا تو اللہ کی تسبیح بیان فرماتے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;