var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ ثَابِتٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي لَيْلَى قَالَ صَلَّيْتُ إِلَى جَنْبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي مِنْ اللَّيْلِ تَطَوُّعًا فَمَرَّ بِآيَةِ عَذَابٍ فَقَالَ أَعُوذُ بِاللَّهِ مِنْ النَّارِ وَوَيْلٌ لِأَهْلِ النَّارِ";
ibnemaja.urdu = "سیدنا ابو لیلیٰ بلال انصاری رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ رات کو نفل نماز پڑھ رہے تھے۔میں نے آپ کے پہلو میں نماز پڑھی،(تلاوت کے دوران میں) نبی ﷺ ایک آیت پر پہنچے جس میں عذاب کا ذکر تھا تو آپ نے فرمایا: (أَعُوذُ بِاللَّہِ مِنَ النَّارِ وَوَیْلٌ لأَہْلِ النَّارِ)’’میں جہنم سے اللہ کی پناہ مانگتا ہوں اور جہنمیوں کے لیے ہلاکت ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (881)`;
ibnemaja.anwaar = [425,1];