var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ قَتَادَةَ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قِرَاءَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَانَ يَمُدُّ صَوْتَهُ مَدًّا";
ibnemaja.urdu = "سیدنا قتادہ رحمہ اللہ سے روایت ہے انہوں نے کہا: میں نے انس بن مالک رضی اللہ عنہ سے نبی ﷺ کی تلاوت کے بارے میں سوال کیا تو انہوں نے فرمایا: نبی ﷺ آواز کو طویل کرتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;