var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ أَبِي إِسْحَاقَ،عَنْ صِلَةَ بْنِ زُفَرَ،عَنْ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ: «هَذَا أَمِينُ هَذِهِ الْأُمَّةِ»";
ibnemaja.urdu = "حضرت عبداللہ رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے ابو عبیدہ بن جراح رضی اللہ عنہ کے بارے میں فرمایا:’’یہ اس امت کا دیانت دار آدمی ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;