var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ يَزِيدَ بْنِ طَلْقٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَسْلَمَ مَعَكَ قَالَ حُرٌّ وَعَبْدٌ قُلْتُ هَلْ مِنْ سَاعَةٍ أَقْرَبُ إِلَى اللَّهِ مِنْ أُخْرَى قَالَ نَعَمْ جَوْفُ اللَّيْلِ الْأَوْسَطُ";
ibnemaja.urdu = "عمرو بن عبسہ رضی اللہ عنہ سے روایت ہے انہوں نے کہا: میں رسول اللہ ﷺ کی خدمت میں حاضر ہوا۔میں نے کہا: اے اللہ کے رسول! آپ کے ساتھ کون کون اسلام لایا ہے؟ فرمایا: ’’آزاد اور غلام‘‘ میں نے کہا: کیا کوئی گھڑی دوسری گھڑی کی نسبت اللہ سے زیادہ قرب کا باعث ہے؟ فرمایا: ’’ہاں،رات کا درمیانی حصہ‘‘۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1251)`;
ibnemaja.anwaar = [425,1];