var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كُنْتُ مُسْتَخْلِفًا أَحَدًا عَنْ غَيْرِ مَشُورَةٍ،لَاسْتَخْلَفْتُ ابْنَ أُمِّ عَبْدٍ»";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’اگر میں بغیر مشور کے کسی کو خلیفہ مقرر کرتا تو ام عبد کے بیٹے(عبداللہ بن مسعود رضی اللہ عنہ ) کو خلیفہ مقرر کرتا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3808،3809)`;
ibnemaja.anwaar = [380,1];