var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ أَبِي بَكْرِ بْنِ يَحْيَى بْنِ النَّضْرِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ اضْطَجَعَ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’تم میں سے کوئی شخص جب رات کو قیام کرے،پھر اس کی زبان پر قرآن مشکل ہو جائے اور اسے پتہ نہ چلے کہ وہ کیا کہہ رہا ہے تو(اسے چاہیے کہ) وہ لیٹ جائے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;