var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَعْقُوبُ بْنُ الْوَلِيدِ الْمَدَنِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ عِشْرِينَ رَكْعَةً بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص مغرب اور عشاء کے رمیان بیس رکعت نماز پڑھے،اس کے لیے اللہ تعالیٰ جنت میں ایک گھر تعمیر کر دیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع <br>یعقوب بن الولید:کذاب،کذبہ أحمد وغیرہ<br>وللحدیث شاہد موضوع عند ابن عدي (1798/5) فیہ عمرو بن جریر کذبہ أبو حاتم`;
ibnemaja.anwaar = [425,1];