var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَضَى أَحَدُكُمْ صَلَاتَهُ فَلْيَجْعَلْ لِبَيْتِهِ مِنْهَا نَصِيبًا فَإِنَّ اللَّهَ جَاعِلٌ فِي بَيْتِهِ مِنْ صَلَاتِهِ خَيْرًا";
ibnemaja.urdu = "ابو سعید خدری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب کوئی شخص اپنی نماز پوری کر لے تو اسے چاہیے کہ س کا ایک حصہ اپنے گھر کے لیے بھی رکھے کیوں کہ اللہ تعالیٰ اس کی نماز کی وجہ سے اس کے گھر میں بھلائی عطا فرمائے گا۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;