var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ قَالَ: حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ عَاصِمٍ،عَنْ زِرٍّ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،أَنَّ أَبَا بَكْرٍ،وَعُمَرَ،بَشَّرَاهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَحَبَّ أَنْ يَقْرَأَ الْقُرْآنَ غَضًّا كَمَا أُنْزِلَ،فَلْيَقْرَأْهُ عَلَى قِرَاءَةِ ابْنِ أُمِّ عَبْدٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ ابو بکر و عمر رضی اللہ عنہما نے انہیں خوشخبری دی کہ اللہ کے رسول ﷺ نے فرمایا:’’جو شخص قرآن کو اس طرح تروتازہ پڑھنا چاہتا ہے جس طرح وہ نازل ہوا،اسے چاہیے کہ ابن ام عبد(عبداللہ بن مسعود رضی اللہ عنہ) کی قراءت کے مطابق پڑھے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;