var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ ثُمَامَةَ بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَلَّى الضُّحَى ثِنْتَيْ عَشْرَةَ رَكْعَةً بَنَى اللَّهُ لَهُ قَصْرًا مِنْ ذَهَبٍ فِي الْجَنَّةِ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ کو فرماتے سنا: ’’جو شخص ضحیٰ کی بارہ رکعتیں پڑھے گا اللہ تعالیٰ اس کے لیے جنت میں سونے کا ایک محل تعمیر کرے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `<br>إسنادہ ضعیف <br>ترمذي (473)`;
ibnemaja.anwaar = [426,1];