var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ الرِّشْكِ عَنْ مُعَاذَةَ الْعَدَوِيَّةِ قَالَتْ سَأَلْتُ عَائِشَةَ أَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى قَالَتْ نَعَمْ أَرْبَعًا وَيَزِيدُ مَا شَاءَ اللَّهُ";
ibnemaja.urdu = "معاذ عدویہ رحمہمااللہ سے روایت ہے،انہوں نے کہا: میں نے عائشہ رضی اللہ عنہا سے سوال کیا: کیا نبی ﷺ ضحیٰ (چاشت) کی نماز پرھتے تھے؟ انہوں نے فرمایا: ہاں،چار رکعت پڑھتے تھے اور اس سے زیادہ بھی پڑھ لیتے تھے،جس قدر اللہ تعالیٰ چاہتا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;