var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ،عَنْ إِبْرَاهِيمَ بْنِ سُوَيْدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذْنُكَ عَلَيَّ أَنْ تَرْفَعَ الْحِجَابَ،وَأَنْ تَسْمَعَ سِوَادِي،حَتَّى أَنْهَاكَ»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے اللہ کے رسول ﷺ نے فرمایا:’’تمہارا اذن(گھر میں آنے کے لئے) یہی ہے کہ پردہ اٹھاؤ،اور تم میری رازدارانہ گفتگو بھی سن سکتے ہو،حتٰی کہ میں منع کر دوں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;