var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ حَدَّثَتْنِي شَعْثَاءُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ بُشِّرَ بِرَأْسِ أَبِي جَهْلٍ رَكْعَتَيْنِ";
ibnemaja.urdu = "عبداللہ ابو اوفیٰ رضی اللہ عنہ سے روایت ہے کہ جس دن رسول اللہ ﷺ کو ابو جہل کا سر کاٹے جانے کی خوشخبری دی گئی آپ نے دو رکعتیں پڑھیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>شعثاء: لا تعرف (تقریب: 8616) <br>وللحدیث شاہد ضعیف مرسل عند البیہقي،انظر السیرۃ النبویۃ لابن کثیر (444/2)`;
ibnemaja.anwaar = [426,1];