var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ صَالِحٍ الْمِصْرِيُّ أَنْبَأَنَا أَبِي أَنْبَأَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَمْرِو بْنِ الْوَلِيدِ بْنِ عَبْدَةَ السَّهْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُشِّرَ بِحَاجَةٍ فَخَرَّ سَاجِدًا";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ کو ایک کام ہو جانے کی خوش خبری دی گئی تو آپ سجدے میں گر پڑے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;