var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ وَأَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ عَنْ بَكَّارِ بْنِ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَتَاهُ أَمْرٌ يَسُرُّهُ أَوْ بُشِّرَ بِهِ خَرَّ سَاجِدًا شُكْرًا لِلَّهِ تَبَارَكَ وَتَعَالَى";
ibnemaja.urdu = "ابو بکرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ کو جب کوئی خوشی والا معاملہ پیش آتا تو آپ اللہ تعالیٰ کا شکر ادا کرنے کے لیے سجدہ ریز ہوجاتے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;