var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِيهِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ";
ibnemaja.urdu = "حضرت ام المومنین عائشہ صدیقہ رضی اللہ عنہا سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:‘‘جو شخص ہمارے دین میں وہ چیز ایجاد کرے جو(اصل میں) اس میں(شامل) نہیں ہے،تو وہ مردود ہے۔’’";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;