var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ عُصْمٍ أَبِي عُلْوَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ أُمِرَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخَمْسِينَ صَلَاةً فَنَازَلَ رَبَّكُمْ أَنْ يَجْعَلَهَا خَمْسَ صَلَوَاتٍ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: تمہارے نبی ﷺ کو پچاس نمازوں کا حکم دیا گیا تھا تو انہوں نے تمہارے رب سے تخفیف کرا کے پانچ کروالیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;