var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ مِنَ الْمَسَاجِدِ إِلَّا الْمَسْجِدَ الْحَرَامَ»";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے نبی ﷺ نے فرمایا: ’’میری اس مسجد میں ایک نماز مسجد حرام کے سوا،دوسری مسجدوں میں پڑھی جانے والی ہزار نمازوں سے افضل ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;