var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَسَدٍ قَالَ: حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ قَالَ: أَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو،عَنْ عَبْدِ الْكَرِيمِ،عَنْ عَطَاءٍ،عَنْ جَابِرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «صَلَاةٌ فِي مَسْجِدِي أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا الْمَسْجِدَ الْحَرَامَ وَصَلَاةٌ فِي الْمَسْجِدِ الْحَرَامِ أَفْضَلُ مِنْ مِائَةِ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ»";
ibnemaja.urdu = "جابر رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’میری مسجد میں نماز مسجد حرام کے سوا کسی بھی مسجد کی ہزاروں نمازوں سے افضل ہے۔اور مسجد حرام میں ایک نماز پڑھنا کسی دوسری مسجد کی ایک لاکھ نمازوں سے افضل ہے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;