var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَرْيَمَ،عَنْ قَزَعَةَ،عَنْ أَبِي سَعِيدٍ،وَعَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ: إِلَى الْمَسْجِدِ الْحَرَامِ،وَإِلَى الْمَسْجِدِ الْأَقْصَى وَإِلَى مَسْجِدِي هَذَا";
ibnemaja.urdu = "عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کجاوے کس کر سفر نہ کیا جائے مگر تین مسجدوں کی طرف۔مسجد حرام کی طرف،مسجد اقصیٰ کی طرف اور میری اس مسجد کی طرف۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;