var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ قَالَ: حَدَّثَنَا أَبُو الْأَبْرَدِ،مَوْلَى بَنِي خَطْمَةَ أَنَّهُ سَمِعَ أُسَيْدَ بْنَ ظُهَيْرٍ الْأَنْصَارِيَّ،وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: «صَلَاةٌ فِي مَسْجِدِ قُبَاءَ كَعُمْرَةٍ»";
ibnemaja.urdu = "نبی ﷺ کی صحابی اسید بن ظہیر انصاری رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’مسجد قباء میں ایک نماز ایک عمرے کے برابر ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;