var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،وَعِيسَى بْنُ يُونُسَ،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْكَرْمَانِيُّ،قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ،يَقُولَ: قَالَ سَهْلُ بْنُ حُنَيْفٍ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَطَهَّرَ فِي بَيْتِهِ ثُمَّ أَتَى مَسْجِدَ قُبَاءَ،فَصَلَّى فِيهِ صَلَاةً،كَانَ لَهُ كَأَجْرِ عُمْرَةٍ»";
ibnemaja.urdu = "ابو امامہ بن سہل بن حنیف رضی اللہ عنہما نے اپنے والد سہل بن حنیف رضی اللہ عنہ سے روایت کیا ہے کہ اللہ کے رسول ﷺ نے فرمایا: ’’جو شخص اپنے گھر میں وضو کرے،پھر مسجد قباء میں آئے اور اس میں ایک نماز پڑھے اسے ایک عمرے کا ثواب ملے گا۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;