var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ زِيَادِ بْنِ عِلَاقَةَ،سَمِعَ الْمُغِيرَةَ،يَقُولُ: قَامَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَوَرَّمَتْ قَدَمَاهُ،فَقِيلَ: يَا رَسُولَ اللَّهِ قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ،قَالَ: «أَفَلَا أَكُونُ عَبْدًا شَكُورًا»";
ibnemaja.urdu = "مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: اللہ کے رسول ﷺ نے قیام فرمایا حتی کہ آپ کے قدم مبارک سوج گئے۔عرض کیا گیا: اللہ کے رسلو! اللہ نے آپ کے تو اگلے پچھلے گناہ معاف کر دیے ہیں(پھر آپ اتنی مشقت کیوں کرتے ہیں؟) فرمایا: ’’کیا میں شکر گزار بندہ نہ بنوں؟‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;