var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ،عَنْ نَافِعِ بْنِ جُبَيْرٍ،عَنْ أَبِي هُرَيْرَةَ،أنّ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْحَسَنِ: «اللَّهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ،وَأَحِبَّ مَنْ يُحِبُّهُ»،قَالَ: وَضَمَّهُ إِلَى صَدْرِهِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے حضرت حسن رضی اللہ عنہ کے متعلق فرمایا: ’’اے اللہ! میں اس سے محبت رکھتا ہوں تو بھی اس سے محبت رکھ،اور جو اس سے محبت کرے اس سے بھی محبت کرے۔‘‘ حضرت ابو ہریرہ رضی اللہ عنہ نے فرمایا: آپ ﷺ نے انہیں سینے سے لگایا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;