var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ مُحَمَّدُ بْنُ يَزِيدَ قَالَ: حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَتَّى تَوَرَّمَتْ قَدَمَاهُ،فَقِيلَ لَهُ: إِنَّ اللَّهَ قَدْ غَفَرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ،قَالَ: «أَفَلَا أَكُونُ عَبْدًا شَكُورًا»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ (طویل) نماز پڑھتے تھے حتی کہ آپ کے قدموں پر ورم آجاتا۔عرض کیا گیا: اللہ تعالیٰ نے آپ کے اگلے پچھلے گناہ معاف کر دیے ہیں۔نبی ﷺ نے فرمایا: ’’تو کیا میں شکر گزار بندہ نہ بنوں؟‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;