var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ قَالَ: حَدَّثَنَا أَبُو عَاصِمٍ،عَنِ ابْنِ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الصَّلَاةِ أَفْضَلُ؟ قَالَ: «طُولُ الْقُنُوتِ»";
ibnemaja.urdu = "جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے نبی ﷺ سے سوال کیا گیا: کون سی نماز افضل ہے؟ فرمایا: ’’لمبا قنوت (طویل قیام والی نماز۔‘‘)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;