var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ،عَنْ لَيْثٍ،عَنْ حَجَّاجِ بْنِ عُبَيْدٍ،عَنْ إِبْرَاهِيمَ بْنِ إِسْمَاعِيل،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيَعْجِزُ أَحَدُكُمْ إِذَا صَلَّى أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ،أَوْ عَنْ يَمِينِهِ،أَوْ عَنْ شِمَالِهِ» يَعْنِي السُّبْحَةَ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’کیا تم میں سے کسی سے یہ نہیں ہو سکتا کہ جب وہ نماز پڑھے تو آگے پیچھے یا دائیں بائیں ہو جائے۔‘‘ یعنی نفل و سنت پڑھتے وقت۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1006)`;
ibnemaja.anwaar = [427,1];