var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،ح وَحَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،قَالَا: حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ،عَنْ أَبِيهِ،عَنْ تَمِيمِ بْنِ مَحْمُودٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِبْلٍ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَلَاثٍ: عَنْ نَقْرَةِ الْغُرَابِ،وَعَنْ فِرْشَةِ السَّبُعِ،وَأَنْ يُوَطِّنَ الرَّجُلُ الْمَكَانَ الَّذِي يُصَلِّي فِيهِ كَمَا يُوَطِّنُ الْبَعِيرُ";
ibnemaja.urdu = "عبدالرحمٰن بن شبل رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ نے تین کاموں سے منع فرمایا ہے: کوے کی طرح ٹھکونگیں مارنے سے،درندے کی طرح بازو پھیلانے سے اور اس بات سے کہ آدمی نماز کے لیے ایک جگہ مقرر کر لے جس طرح اونٹ (باڑے میں اپنے لیے) جگہ مقرر کر لیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (862) نسائي (1113)`;
ibnemaja.anwaar = [427,1];