var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ دَاوُدَ بْنِ أَبِي عَوْفٍ أَبِي الْجَحَّافِ،وَكَانَ مَرْضِيًّا،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحَبَّ الْحَسَنَ وَالْحُسَيْنَ فَقَدْ أَحَبَّنِي،وَمَنْ أَبْغَضَهُمَا فَقَدْ أَبْغَضَنِي»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا:’’جس نے حسن اور حسین رضی اللہ عنہما سے محبت کی اس نے مجھ سے محبت کی اور جس نے ان سے بغض رکھا اس نے مجھ سے بغض رکھا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;