var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنِ ابْنِ جُرَيْجٍ،عَنْ مُحَمَّدِ بْنِ عَبَّادٍ،عَنْ عَبْدِ اللَّهِ بْنِ سُفْيَانَ،عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ،قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «صَلَّى يَوْمَ الْفَتْحِ فَجَعَلَ نَعْلَيْهِ عَنْ يَسَارِهِ»";
ibnemaja.urdu = "عبداللہ بن سائب رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: میں نے فتح مکہ کے دن رسول اللہ ﷺ کو دیکھا کہ آپ نے نماز پڑھی تو اپنے جوتے اپنی بائیں طرف رکھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;