var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ،وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ،قَالَا: حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ،عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي سَعِيدٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلْزِمْ نَعْلَيْكَ قَدَمَيْكَ،فَإِنْ خَلَعْتَهُمَا فَاجْعَلْهُمَا بَيْنَ رِجْلَيْكَ،وَلَا تَجْعَلْهُمَا عَنْ يَمِينِكَ،وَلَا عَنْ يَمِينِ صَاحِبِكَ،وَلَا وَرَاءَكَ،فَتُؤْذِيَ مَنْ خَلْفَكَ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’اپنے جوتے اپنے پاؤں میں رکھو(پہنے رہو۔) اگر انہیں اتارو تو اپنے دونوں پاؤں کے درمیان رکھو۔انہیں اپنی دائیں طرف نہ رکھنا۔نہ اپنے ساتھی کے دائیں طرف رکھنا نہ اپنے پیچھے رکھنا کہ اپنے پیچھے والے(نمازی) کو تکلیف دو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد اللّٰہ بن سعید المقبري:متروک`;
ibnemaja.anwaar = [427,1];