var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ قَالَ: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتَّةٌ بِالْمَعْرُوفِ: يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ،وَيُجِيبُهُ إِذَا دَعَاهُ،وَيُشَمِّتُهُ إِذَا عَطَسَ،وَيَعُودُهُ إِذَا مَرِضَ،وَيَتْبَعُ جِنَازَتَهُ إِذَا مَاتَ،وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ";
ibnemaja.urdu = "علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دستور کے مطابق مسلمان کے مسلمان پر چھ حق ہیں۔جب اس سے ملے تو سلام کہے،جب وہ اسے دعوت دے تو اس کی دعوت قبول کرے،جب اسے چھینک آئے تو اسے دعا دے،جب وہ بیمار ہو جائے تو اس کی بیمار پرسی کرے،جب وہ فوت ہو جائے تو اس کے جنازے کے ساتھ جائے اور اس کے لیے وہی کچھ پسند کرے جو اپنے لیے پسند کرتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2736)`;
ibnemaja.anwaar = [428,1];