var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ مِنْ حَقِّ الْمُسْلِمِ عَلَى الْمُسْلِمِ: رَدُّ التَّحِيَّةِ،وَإِجَابَةُ الدَّعْوَةِ،وَشُهُودُ الْجِنَازَةِ،وَعِيَادَةُ الْمَرِيضِ،وَتَشْمِيتُ الْعَاطِسِ إِذَا حَمِدَ اللَّهَ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’پانچ چیزیں مسلمان کے مسلمان پر حق میں شامل ہیں: سلام کا جواب دینا،دعوت قبول کرنا،جنازے میں حاضر ہونا،بیمار کی عیادت کرنا اور جب چھینکنے والا اللہ کی تعریف کرے(الحمدللہ کہے) تو اسے دعا دینا(یرحمک اللہ کہنا۔‘‘)";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;