var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الصَّنْعَانِيُّ قَالَ: حَدَّثَنَا سُفْيَانُ،قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ،يَقُولُ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: «عَادَنِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَاشِيًا وَأَبُو بَكْرٍ،وَأَنَا فِي بَنِي سَلَمَةَ»";
ibnemaja.urdu = "جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ اور ابو بکر رضی اللہ عنہ پیدل چل کر میری عیادت کے لیے تشریف لائے جب کہ میں بنو سلمہ کے محلے میں تھا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;