var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا مَسْلَمَةُ بْنُ عُلَيٍّ قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ حُمَيْدٍ الطَّوِيلِ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَعُودُ مَرِيضًا إِلَّا بَعْدَ ثَلَاثٍ»";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ تین دن کے بعد ہی بیمار کی عیادت فرماتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>مسلمۃ بن علي: متروک`;
ibnemaja.anwaar = [428,1];