var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ،عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَخَلْتُمْ عَلَى الْمَرِيضِ،فَنَفِّسُوا لَهُ فِي الْأَجَلِ،فَإِنَّ ذَلِكَ لَا يَرُدُّ شَيْئًا،وَهُوَ يُطَيِّبُ بِنَفْسِ الْمَرِيضِ»";
ibnemaja.urdu = "ابو سعید خدری رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب تم مریض کے پاس جاؤ تو اسے زندی کی امید دلاؤ اس سے(تقدیر کا فیصلہ تو) کچھ نہیں ٹلتا لیکن بیمار کا دل خوش ہوجاتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2087)`;
ibnemaja.anwaar = [428,1];