var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ قَالَ: حَدَّثَنِي كَثِيرُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ،عَنْ مَيْمُونِ بْنِ مِهْرَانَ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،قَالَ: قَالَ لِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَخَلْتَ عَلَى مَرِيضٍ،فَمُرْهُ أَنْ يَدْعُوَ لَكَ؛ فَإِنَّ دُعَاءَهُ كَدُعَاءِ الْمَلَائِكَةِ»";
ibnemaja.urdu = "عمر بن خطاب رضی اللہ عنہ سے روایت ہے نبی ﷺ نے مجھ سے فرمایا: ’’جب تو کسی مریض کے پاس جائے تو اسے کہہ کہ تیرے لیے دعا کرے کیوں کہ اس کی دعا فرشتوں کی دعا کی طرح ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>میمون بن مہران لم یدرک عمر رضي اللّٰہ عنہ (تحفۃ الأشراف: 110/8)`;
ibnemaja.anwaar = [428,1];