var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ قَالَ: حَدَّثَنَا أَبُو سِنَانٍ الْقَسْمَلِيُّ،عَنْ عُثْمَانَ بْنِ أَبِي سَوْدَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ عَادَ مَرِيضًا،نَادَى مُنَادٍ مِنَ السَّمَاءِ: طِبْتَ،وَطَابَ مَمْشَاكَ،وَتَبَوَّأْتَ مِنَ الْجَنَّةِ مَنْزِلًا";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص کسی مریض کی عیادت کرتا ہے تو اسے آسمان سے ایک آواز دینے والا (فرشتہ) آواز دیتا ہے: تو بھی پاک(اور اچھا) ہے اور تیرا چلنا بھی پاک ہے اور تو نے جنت میں گھر بنالیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2008)`;
ibnemaja.anwaar = [428,1];