var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ سُلَيْمَانَ بْنِ بِلَالٍ،عَنْ عُمَارَةَ بْنِ غَزِيَّةَ،عَنْ يَحْيَى بْنِ عُمَارَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اللَّهُ»";
ibnemaja.urdu = "ابو سعید خدری رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’اپنے مرنے والوں کو(لا الہ الااللہ) کی تلقین کرو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;