var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ،عَنِ ابْنِ الْمُبَارَكِ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،عَنْ أَبِي عُثْمَانَ،-وَلَيْسَ بِالنَّهْدِيِّ-عَنْ أَبِيهِ،عَنْ مَعْقِلِ بْنِ يَسَارٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اقْرَءُوهَا عِنْدَ مَوْتَاكُمْ،يَعْنِي يس»";
ibnemaja.urdu = "معقل بن یسار رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے سورہٴ یٰسٓ کے بارے میں فرمایا: ’’اسے اپنے فوت ہونے والوں کے پاس پڑھا کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3121)`;
ibnemaja.anwaar = [429,1];