var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،وَعَلِيُّ بْنُ الْمُنْذِرِ،قَالَا: حَدَّثَنَا أَبُو غَسَّانَ قَالَ: حَدَّثَنَا أَسْبَاطُ بْنُ نَصْرٍ،عَنِ السُّدِّيِّ،عَنْ صُبَيْحٍ مَوْلَى أُمِّ سَلَمَةَ،عَنْ زَيْدِ بْنِ أَرْقَمَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَعَلِيٍّ،وَفَاطِمَةَ،وَالْحَسَنِ،وَالْحُسَيْنِ،: «أَنَا سِلْمٌ لِمَنْ سَالَمْتُمْ،وَحَرْبٌ لِمَنْ حَارَبْتُمْ»";
ibnemaja.urdu = "حضرت زید بن ارقم رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے حضرات علی،فاطمہ،حسن اور حسین رضی اللہ عنہم سے فرمایا:’’جس سے تم صلح کرو،میری بھی اس سے صلح ہے اور جس سے تم جنگ کرو،اس سے میری بھی جنگ ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3870)`;
ibnemaja.anwaar = [380,1];