var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى قَالَ: حَدَّثَنَا يُوسُفُ بْنُ الْمَاجِشُونِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ،قَالَ: دَخَلْتُ عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ وَهُوَ يَمُوتُ،فَقُلْتُ: اقْرَأْ عَلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ السَّلَامَ";
ibnemaja.urdu = "محمد بن منکدر رحمہ اللہ سے روایت ہے،ا نہوں نے فرمایا: جب جابر بن عبداللہ رضی اللہ عنہما کی وفات کا وقت تھا تو میں اس کے پاس گیا اور میں نے کہا: رسول اللہ ﷺ کو سلام کہہ دیجئے گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;