var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ عَطَاءٍ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا حَمِيمٌ لَهَا يَخْنُقُهُ الْمَوْتُ،فَلَمَّا رَأَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا بِهَا قَالَ لَهَا «لَا تَبْتَئِسِي عَلَى حَمِيمِكِ،فَإِنَّ ذَلِكَ مِنْ حَسَنَاتِهِ»";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ ان کے پاس تشریف لائے جب کہ ان کے پاس ان کا ایک رشتہ دار تھا۔جس پر موت کی سختی طاری تھی۔جب رسول اللہ ﷺ نے عائشہ رضی اللہ عنہا کا رنج دیکھا تو فرمایا: ’’عائشہ! اپنے رشتہ دار پر غم نہ کرو،یہ بھی اس کی نیکیوں میں سے ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الولید لم یصرح بالسماع المسلسل`;
ibnemaja.anwaar = [429,1];