var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رَوْحُ بْنُ الْفَرَجِ قَالَ: حَدَّثَنَا نَصْرُ بْنُ حَمَّادٍ قَالَ: حَدَّثَنَا مُوسَى بْنُ كَرْدَمٍ،عَنْ مُحَمَّدِ بْنِ قَيْسٍ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،قَالَ: سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَتَى تَنْقَطِعُ مَعْرِفَةُ الْعَبْدِ مِنَ النَّاسِ،قَالَ: «إِذَا عَايَنَ»";
ibnemaja.urdu = "ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سوال کیا: بندہ لوگوں کو پہچاننا کب چھوڑ دیتا ہے؟ نبی ﷺ نے فرمایا: ’’جب وہ (آخرت کی چیزوں یا موت کے فرشتوں) کا مشاہدہ کر لیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال البو صیري: ’’ في إسنادہ: نصر بن حماد،کذبہ یحیی بن معین وغیرہ ‘‘ وھو: متروک متھم (تحفۃ الأقویاء في تحقیق کتاب الضعفاء ص 127 رقم: 441) وقال یحیی بن معین: نصر بن حماد: کذاب (کتاب الضعفاء للعقیلي 301/4 وسندہ صحیح) وشیخہ موسی بن کردم: مجہول (تقریب: 7005)`;
ibnemaja.anwaar = [429,1];