var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَسَدٍ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو قَالَ: حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ أَبِي قِلَابَةَ،عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ،عَنْ أُمِّ سَلَمَةَ،قَالَتْ: دَخَلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى أَبِي سَلَمَةَ وَقَدْ شَقَّ بَصَرُهُ فَأَغْمَضَهُ،ثُمَّ قَالَ: «إِنَّ الرُّوحَ إِذَا قُبِضَ تَبِعَهُ الْبَصَرُ»";
ibnemaja.urdu = "ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ ابو سلمہ رضی اللہ عنہ (کی میت) کے پاس آئے تو ان کی آنکھیں کھلی تھیں۔آپ نے ان کی آنکھیں بند کر دیں اور فرمایا: ’’جب روح قبض کی جاتی ہے تو نظر اس کا تعاقب کرتی ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;