var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ،وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ،وَسَهْلُ بْنُ أَبِي سَهْلٍ،قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ سُفْيَانَ،عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ،عَنْ عُبَيْدِ اللَّهِ،عَنِ ابْنِ عَبَّاسٍ،وَعَائِشَةَ،أَنَّ «أَبَا بَكْرٍ،قَبَّلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَهُوَ مَيِّتٌ»";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما اور عائشہ صدیقہ رضی اللہ عنہا سے روایت ہے کہ ابو بکر رضی اللہ عنہ نے نبی ﷺ کی وفات کے بعد آپ کو بوسہ دیا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;