var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنْ هَانِئِ بْنِ هَانِئٍ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،قَالَ: كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فَاسْتَأْذَنَ عَمَّارُ بْنُ يَاسِرٍ،فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْذَنُوا لَهُ،مَرْحَبًا بِالطَّيِّبِ الْمُطَيَّبِ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نبی ﷺ کے پاس بیٹھا تھا کہ حضرت عمار بن یاسر رضی اللہ عنہما نے آنے کی اجازت چاہی۔نبی ﷺ نے فرمایا:’’اسے اجازت دے دو۔اس پاک کیے ہوئے پاک باز کو خوش آمدید۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;