var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ آدَمَ قَالَ: حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ،عَنِ ابْنِ جُرَيْجٍ،عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ،عَنْ عَاصِمِ بْنِ ضَمْرَةَ،عَنْ عَلِيٍّ،قَالَ: قَالَ لِيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُبْرِزْ فَخِذَكَ،وَلَا تَنْظُرْ إِلَى فَخِذِ حَيٍّ،وَلَا مَيِّتٍ»";
ibnemaja.urdu = "علی رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ نے مجھ سے فرمایا: ’’اپنی ران ظاہر نہ کرو اور کسی زندہ یا مردہ کی ران کو نہ دیکھو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>سنن أبي داود (4015،3140)`;
ibnemaja.anwaar = [429,1];