var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ قَالَ: حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ،عَنْ مُبَشِّرِ بْنِ عُبَيْدٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِيُغَسِّلْ مَوْتَاكُمُ الْمَأْمُونُونَ»";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’تمہارے مردوں کو وہ لوگ غسل دیں جو قابل اعتماد ہوں۔‘‘(تاکہ اگر میت کے بارے میں کوئی ایسی چیز معلوم ہو جس کا ظاہر کرنا مناسب نہیں تو وہ اسے راز رکھ سکیں۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع <br>مبشر بن عبید: کذاب`;
ibnemaja.anwaar = [429,2];