var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ غَسَّلَ مَيِّتًا،فَلْيَغْتَسِلْ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص میت کو غسل دے وہ خود بھی غسل کرے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;