var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ الْوَهْبِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ،عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: «لَوْ كُنْتُ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ،مَا غَسَّلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَيْرُ نِسَائِهِ»";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: اگر مجھے پہلے وہ خیال آجاتا جو بعدمیں آیا تو نبی ﷺ کو ازواج مطہرات ہی غسل دیتیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;