var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ الْأَزْهَرِ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ: حَدَّثَنَا أَبُو بُرْدَةَ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنِ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،قَالَ: لَمَّا أَخَذُوا فِي غُسْلِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،نَادَاهُمْ مُنَادٍ مِنَ الدَّاخِلِ: «لَا تَنْزِعُوا عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَمِيصَهُ»";
ibnemaja.urdu = "بریدہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: جب صحابہ رضی اللہ عنہم نے نبی ﷺ کو غسل دینے کا ارادہ کیا تو(گھر کے) اندر سے ایک (نامعلوم) آواز دینے والے نے آواز دی: رسول اللہ ﷺ قیض نہ اتارو۔(چنانچہ قیض سمیت غسل دیا گیا۔)";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;