var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ خِذَامٍ قَالَ: حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ: أَخْبَرَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،قَالَ: لَمَّا غَسَّلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ يَلْتَمِسُ مِنْهُ مَا يُلْتَمَسُ مِنَ الْمَيِّتِ،فَلَمْ يَجِدْهُ،فَقَالَ: «بِأَبِي الطَّيِّبُ،طِبْتَ حَيًّا،وَطِبْتَ مَيِّتًا»";
ibnemaja.urdu = "علی رضی اللہ عنہ سے روایت ہے کہ انہوں نے جب نبی ﷺ کو غسل دیا تو انہوں نے وہ چیز معلوم کرنی چاہی جومیت سے ظاہر ہوا کرتی ہے لیکن ایسی کوئی چیز محسوس نہ ہوئی تو انہوں نے فرمایا: اس پاک ہستی پر میرا باپ قربان ہو!(اے نبی!) آپ زندگی میں بھی پاک تھے وفات کے بعد بھی پاک ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الزھري عنعن فی المتصل وصرح بالسماع فی المرسل فالسند معلل`;
ibnemaja.anwaar = [430,1];