var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبَّادُ بْنُ يَعْقُوبَ قَالَ: حَدَّثَنَا الْحُسَيْنُ بْنُ زَيْدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيٍّ،عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ،عَنْ أَبِيهِ،عَنْ عَلِيٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَنَا مُتُّ فَاغْسِلُونِي بِسَبْعِ قِرَبٍ مِنْ بِئْرِي،بِئْرِ غَرْسٍ»";
ibnemaja.urdu = "علی رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب میں فوت ہو جاؤں تو مجھے میرے کنویں بئر غرس کے پانی کی سات مشکوں سے غسل دینا۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = `عباد بن یعقوب الرواجنی الاسدی: ثقۃ صدوق عند الجمہور، فھو حسن الحدیث`;