var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ قَالَ: حَدَّثَنَا عَثَّامُ بْنُ عَلِيٍّ،عَنِ الْأَعْمَشِ،عَنْ أَبِي إِسْحَاقَ،عَنْ هَانِئِ بْنِ هَانِئٍ،قَالَ: دَخَلَ عَمَّارٌ عَلَى عَلِيٍّ،فَقَالَ: مَرْحَبًا بِالطَّيِّبِ الْمُطَيَّبِ،سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مُلِئَ عَمَّارٌ إِيمَانًا إِلَى مُشَاشِهِ»";
ibnemaja.urdu = "حضرت ہانی بن ہانی رحمہ اللہ عنہ سے روایت ہے،حضرت عمار رضی اللہ عنہ علی رضی اللہ عنہ کے پاس آئے تو انہوں نے فرمایا: پاک کیے ہوئے پاک باز کو خوش آمدید! میں نے رسول اللہ ﷺ سے سنا ہے،آپ نے فرمایا: ’’عمار رضی اللہ عنہ سرتاپا ایمان سے معمور ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو إسحاق السبیعي و الأعمش مدلسان وعنعنا <br>وللحدیث شواھد ضعیفۃ عند النسائي (5010) والحاکم (392/3،393) وغیرہما۔`;
ibnemaja.anwaar = [380,1];