var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ قَالَ: حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ،قَالَ هَذَا مَا سَمِعْتُ مِنْ أَبِي مُعَيْدٍ حَفْصِ بْنِ غَيْلَانَ،عَنْ سُلَيْمَانَ بْنِ مُوسَى،عَنْ نَافِعٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: «كُفِّنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثِ رِيَاطٍ بِيضٍ سُحُولِيَّةٍ»";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کو تین سفید سحولی چادروں میں کفن دیا گیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;