var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ مِقْسَمٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: كُفِّنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ: قَمِيصُهُ الَّذِي قُبِضَ فِيهِ،وَحُلَّةٌ نَجْرَانِيَّةٌ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کو تین کپڑوں میں کفن دیا گیا۔ایک نبی ﷺ کی وہ قمیص جسے آپ وفات کے وقت پہنے ہوئے تھے اور نجرانی چادروں کا ایک جوڑا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3153)<br>وجاء في بعض نسخ سنن ابن ماجہ: ’’ الحکم بن عتیبۃ ‘‘ بین یزید بن أبي زیاد ومقسم وھو وھم،واﷲ أعلم`;
ibnemaja.anwaar = [430,1];