var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ،عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ ثِيَابِكُمُ الْبَيَاضُ،فَكَفِّنُوا فِيهَا مَوْتَاكُمْ،وَالْبَسُوهَا»";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’تمہارے بہترین کپڑے سفید ہیں،لہٰذا اپنے مردوں کو ان میں کفن دیا کرو اور خود بھی پہنو۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;