var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَنْبَأَنَا هِشَامُ بْنُ سَعْدٍ،عَنْ حَاتِمِ بْنِ أَبِي نَصْرٍ،عَنْ عُبَادَةَ بْنِ نُسَيٍّ،عَنْ أَبِيهِ،عَنْ عُبَادَةَ بْنِ الصَّامِتِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خَيْرُ الْكَفَنِ الْحُلَّةُ»";
ibnemaja.urdu = "عبادہ بن صامت رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بہترین کفن جوڑا ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;