var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا عُمَرُ بْنُ يُونُسَ قَالَ: حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ،عَنْ هِشَامِ بْنِ حَسَّانَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي قَتَادَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وَلِيَ أَحَدُكُمْ أَخَاهُ،فَلْيُحْسِنْ كَفَنَهُ»";
ibnemaja.urdu = "ابو قتادہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب کوئی اپنے بھائی کے معاملات کا نگران بنے تو اسے اچھا کفن دے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;