var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ سَمُرَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ قَالَ: حَدَّثَنَا أَبُو شَيْبَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: لَمَّا قُبِضَ إِبْرَاهِيمُ ابْنُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ لَهُمُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا تُدْرِجُوهُ فِي أَكْفَانِهِ حَتَّى أَنْظُرَ إِلَيْهِ،فَأَتَاهُ،فَانْكَبَّ عَلَيْهِ،وَبَكَى";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جب نبی ﷺ کے فرزند ابراہیم رضی اللہ عنہ کی وفات ہوئی تو نبی ﷺ نے فرمایا: ’’اسے اس کے کفن میں(پوری طرح) نہ لپیٹنا،جب تک میں اسے دیکھ نہ لوں۔‘‘ پھر آپ ﷺ ان کے پاس آکر ان پر جھک گئے اور رو پڑے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو شیبۃ یوسف بن إبراہیم: ضعیف <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [430,1];