var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ حَبِيبِ بْنِ سُلَيْمٍ،عَنْ بِلَالِ بْنِ يَحْيَى،قَالَ: كَانَ حُذَيْفَةُ إِذَا مَاتَ لَهُ الْمَيِّتُ،قَالَ: لَا تُؤْذِنُوا بِهِ أَحَدًا،إِنِّي أَخَافُ أَنْ يَكُونَ نَعْيًا،إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِأُذُنَيَّ هَاتَيْنِ،«يَنْهَى عَنِ النَّعْيِ»";
ibnemaja.urdu = "بلال بن یحییٰ رحمہ اللہ سے روایت ہے انہوں نے فرمایا: جب حذیفہ بن یمان رضی اللہ عنہ کے اقارب میں سے کوئی فوت ہو جاتا تو وہ فرماتے: کسی کو اس کی اطلاع نہ کرنا،میں ڈرتا ہوں کہ یہ بھی نعی(اعلان) میں شامل نہ ہو۔میں نے اپنے دونوں کانوں سے رسول اللہ ﷺ کو موت کے اعلان سے منع کرتے سنا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (986)`;
ibnemaja.anwaar = [430,1];