var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَهِشَامُ بْنُ عَمَّارٍ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَسْرِعُوا بِالْجِنَازَةِ،فَإِنْ تَكُنْ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ،وَإِنْ تَكُنْ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جنازے کو جلدی (قبرستان کی طرف) لے جایا کرو،اگر میت نیک ہے تو تم اسے بھلائی کی طرف لے جا رہے ہو،اگر دوسری صورت ہے تو ایک بری چیز کا بوجھ اپنی گردنوں سے اتار رہے ہو۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;