var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ مَنْصُورٍ،عَنْ عُبَيْدِ بْنِ نِسْطَاسٍ،عَنْ أَبِي عُبَيْدَةَ،قَالَ: قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ: «مَنِ اتَّبَعَ جِنَازَةً فَلْيَحْمِلْ بِجَوَانِبِ السَّرِيرِ كُلِّهَا؛ فَإِنَّهُ مِنَ السُّنَّةِ،ثُمَّ إِنْ شَاءَ فَلْيَتَطَوَّعْ،وَإِنْ شَاءَ فَلْيَدَعْ»";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: جو شخص جنازہ اٹھائے (کندھا دے) اسے چاہیے کہ چار پائی چاروں سے (باری باری) اٹھائے۔کیوں کہ یہ سنت ہے۔اس کے بعد اگر چاہے تو مزید ثواب حاصل کر لے،چاہے تو رہنے دے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ منقطع،فإن أبا عبیدۃ لم یسمع من أبیہ،قالہ أبو حاتم و أبو زرعۃ وغیرھما ‘‘ انظر الحدیث السابق (615)`;
ibnemaja.anwaar = [430,1];