var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ قَالَ: حَدَّثَنَا بِشْرُ بْنُ ثَابِتٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ لَيْثٍ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ رَأَى جِنَازَةً يُسْرِعُونَ بِهَا،فَقَالَ: «لِتَكُنْ عَلَيْكُمُ السَّكِينَةُ»";
ibnemaja.urdu = "ابو موسیٰ رضی اللہ عنہ نے نبی ﷺ سے روایت کیا کہ آپ ﷺ نے ایک جنازہ دیکھا جسے بڑی تیزی سے لیے جا رہے تھے تو رسول اللہ ﷺ نے فرمایا: ’’اطمینان سے چلو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>لیث: ضعیف <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [430,1];