var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ،قَالَا جَمِيعًا: حَدَّثَنَا وَكِيعٌ،عَنْ عَبْدِ الْعَزِيزِ بْنِ سِيَاهٍ،عَنْ حَبيبِ بْنِ أَبِي ثَابِتٍ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَمَّارٌ مَا عُرِضَ عَلَيْهِ أَمْرَانِ إِلَّا اخْتَارَ الْأَرْشَدَ مِنْهُمَا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’عمار رضی اللہ عنہ پر جب بھی دو کام پیش کیے تو انہوں نے زیادہ صحیح کام کا انتخاب کیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>ترمذي (3799)`;
ibnemaja.anwaar = [380,1];