var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ قَالَ: حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ،عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ،عَنْ رَاشِدِ بْنِ سَعْدٍ،عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: رَأَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَاسًا رُكْبَانًا عَلَى دَوَابِّهِمْ فِي جِنَازَةٍ،فَقَالَ: «أَلَا تَسْتَحْيُونَ أَنَّ مَلَائِكَةَ اللَّهِ يَمْشُونَ عَلَى أَقْدَامِهِمْ،وَأَنْتُمْ رُكْبَانٌ؟»";
ibnemaja.urdu = "رسول اللہ ﷺ کے آزاد کردہ غلام ثوبان رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے جنازے کے ساتھ کچھ لوگوں کو جانوروں پر سوار ہو کر جاتے دیکھا تو فرمایا: ’’کیا تم لوگ حیا نہیں کرتے کہ اللہ کے فرشتے تو پیدل چل رہے ہیں اور تم سوار ہو؟‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1012)`;
ibnemaja.anwaar = [430,2];