var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ بْنِ جُبَيْرِ بْنِ حَيَّةَ قَالَ: حَدَّثَنِي زِيَادُ بْنُ جُبَيْرِ بْنِ حَيَّةَ،سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ،يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الرَّاكِبُ خَلْفَ الْجِنَازَةِ وَالْمَاشِي مِنْهَا حَيْثُ شَاءَ»";
ibnemaja.urdu = "مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: ’’سوار جنازے کے پیچھے چلے اور پیدل جہاں چاہے(آگے،پیچھے دائیں یا بائیں)۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;