var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَهِشَامُ بْنُ عَمَّارٍ،وَسَهْلُ بْنُ أَبِي سَهْلٍ،قَالُوا: حَدَّثَنَا سُفْيَانُ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،قَالَ: «رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ،وَعُمَرَ يَمْشُونَ أَمَامَ الْجِنَازَةِ»";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: ’’میں نے نبی ﷺ ابو بکر اور عمر رضی اللہ عنہما کو جنازے کے آگے چلتے دیکھا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;