var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: أَنْبَأَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ،عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ التَّيْمِيِّ،عَنْ أَبِي مَاجِدَةَ الْحَنَفِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «الْجِنَازَةُ مَتْبُوعَةٌ وَلَيْسَتْ بِتَابِعَةٍ،لَيْسَ مَعَهَا مَنْ تَقَدَّمَهَا»";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جنازے کے پیچھے چلا جاتا ہے۔جنازہ کسی کے پیچھے نہیں چلتا جو اس سے آگے چلے وہ اس کے ساتھ نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3184) ترمذي (1011)`;
ibnemaja.anwaar = [431,1];