var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي سَعِيدُ بْنُ عَبْدِ اللَّهِ الْجُهَنِيُّ،أَنَّ مُحَمَّدَ بْنَ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ،حَدَّثَهُ عَنْ أَبِيهِ،عَنْ جَدِّهِ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُؤَخِّرُوا الْجِنَازَةَ إِذَا حَضَرَتْ»";
ibnemaja.urdu = "علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب جنازہ تیار ہو جاتا تو تاخیر نہ کرو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;