var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،قَالَ أَخْبَرَنِي الْحُسَيْنُ بْنُ ذَكْوَانَ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ الْأَسْلَمِيِّ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ الْفَزَارِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «صَلَّى عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا،فَقَامَ وَسَطَهَا»";
ibnemaja.urdu = "سمرہ بن جندب فزاری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ایک خاتون کا جنازہ پڑھا جو نفاس کے ایام میں فوت ہوگئی تھی تو نبی ﷺ اس کی کمر کے مقابل کھڑے ہوئے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;