var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ أَبِي عَاصِمٍ النَّبِيلُ،وَإِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ،قَالَا: حَدَّثَنَا أَبُو عَاصِمٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ جَعْفَرٍ الْعَبْدِيُّ قَالَ: حَدَّثَنِي شَهْرُ بْنُ حَوْشَبٍ قَالَ: حَدَّثَتْنِي أُمُّ شَرِيكٍ الْأَنْصَارِيَّةُ،قَالَتْ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نَقْرَأَ عَلَى الْجِنَازَةِ بِفَاتِحَةِ الْكِتَابِ»";
ibnemaja.urdu = "ام شریک انصاریہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے ہمیں نماز جنازہ میں سورہٴ فاتحہ پڑھنے کا حکم دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>حماد بن جعفر ضعیف ضعفہ الجمھور و للحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [431,1];