var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ حَجَّاجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: «مَا أَبَاحَ لَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَلَا أَبُو بَكْرٍ وَلَا عُمَرُ فِي شَيْءٍ،مَا أَبَاحُوا فِي الصَّلَاةِ عَلَى الْمَيِّتِ» يَعْنِي لَمْ يُوَقِّتْ";
ibnemaja.urdu = "جابر رضی اللہ عنہ سے روایت ہے،انہوں ن فرمایا: رسول اللہ ﷺ ابو بکر اور عمر رضی اللہ عنہما نے ہمیں کسی چیز میں اتنی چھوٹ نہیں دی،جتنی نماز جنازہ میں دی ہے۔‘‘ یعنی اس کے لیے وقت کی حد مقرر نہیں کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حجاج بن أرطاۃ وأبو الزبیر عنعنا`;
ibnemaja.anwaar = [432,1];