var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ: حَدَّثَنَا خَالِدُ بْنُ إِلْيَاسَ،عَنْ إِسْمَاعِيلَ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ،عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَكَمِ بْنِ الْحَارِثِ،عَنْ عُثْمَانَ بْنِ عَفَّانَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «صَلَّى عَلَى عُثْمَانَ بْنِ مَظْعُونٍ،وَكَبَّرَ عَلَيْهِ أَرْبَعًا»";
ibnemaja.urdu = "عثمان بن عفان رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے عثمان بن مظعون رضی اللہ عنہ کی نماز جنازہ ادا فرمائی اور چار تکبیریں کہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>خالد بن إیاس: متروک`;
ibnemaja.anwaar = [432,1];