var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ،قَالَ: حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ بْنِ جُبَيْرِ بْنِ حَيَّةَ قَالَ: حَدَّثَنِي عَمِّي زِيَادُ بْنُ جُبَيْرٍ قَالَ: حَدَّثَنِي أَبِي جُبَيْرُ بْنُ حَيَّةَ،أَنَّهُ سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الطِّفْلُ يُصَلَّى عَلَيْهِ»";
ibnemaja.urdu = "مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے،وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا: ’’بچے کی نماز جنازہ پڑھی جائے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;