var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْبَخْتَرِيُّ بْنُ عُبَيْدٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَلُّوا عَلَى أَطْفَالِكُمْ،فَإِنَّهُمْ مِنْ أَفْرَاطِكُمْ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے فرمایا: ’’اپنے بچوں کا جنازہ پڑھاکرو،وہ تمہاری پیش رو ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>البختري بن عبید: ضعیف متروک (التلخیص الحبیر 114/2 ح 753،والتقریب: 642) وأبو ہ عبید بن سلمان الطابخي: مجہول (تقريب: 4375)`;
ibnemaja.anwaar = [432,1];