var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ مِقْسَمٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: أُتِيَ بِهِمْ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ،فَجَعَلَ «يُصَلِّي عَلَى عَشَرَةٍ عَشَرَةٍ،وَحَمْزَةُ هُوَ كَمَا هُوَ،يُرْفَعُونَ وَهُوَ كَمَا هُوَ مَوْضُوعٌ»";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: غزوہٴ احد کے دن شہداء کو رسول اللہ ﷺ کے پاس لایا گیا،آپ ان میں سے دس دس افراد کا جنازہ ادا کرنے لگے۔حمزہ رضی اللہ عنہ جہاں تھے وہیں رہے(ان کی میت سامنے رہی) دوسروں کی میتیں اٹھالی جاتی تھیں اور حمزہ رضی اللہ عنہ کی میت جیسے تھے،ویسے ہی(سامنے) پڑی رہتی تھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;