var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ،عَنْ عَطَاءِ بْنِ السَّائِبِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«أَمَرَ بِقَتْلَى أُحُدٍ أَنْ يُنْزَعَ عَنْهُمُ الْحَدِيدُ وَالْجُلُودُ،وَأَنْ يُدْفَنُوا فِي ثِيَابِهِمْ بِدِمَائِهِمْ»";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے جنگ احد کے شہیدوں کے بارے میں حکم دیا کہ ان سے لوہا(ہتھیار،مثلاً: زرہ،ڈھال وغیرہ) اور چمڑا(چمڑے کے ملبوسات) اتار دیے جائیں اور انہیں خون سمیت ان کے کپڑوں میں دفن کر دیا جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3134)`;
ibnemaja.anwaar = [432,1];