var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَسَهْلُ بْنُ أَبِي سَهْلٍ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الْأَسْوَدِ بْنِ قَيْسٍ،سَمِعَ نُبَيْحًا الْعَنْزِيَّ،يَقُولُ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَمَرَ بِقَتْلَى أُحُدٍ أَنْ يُرَدُّوا إِلَى مَصَارِعِهِمْ،وَكَانُوا نُقِلُوا إِلَى الْمَدِينَةِ»";
ibnemaja.urdu = "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے جنگ احد کے شہیدوں کو شہادت کے مقامات پر واپس لے جانے کا حکم دیا جب کہ انہیں مدینہ لایا جا چکا تھا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;