var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنِ ابْنِ أَبِي ذِئْبٍ،عَنْ صَالِحٍ،مَوْلَى التَّوْأَمَةِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى عَلَى جِنَازَةٍ فِي الْمَسْجِدِ،فَلَيْسَ لَهُ شَيْءٌ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جس نے مسجد میں جنازہ پڑھا،اس کے لئے کچھ نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3191)`;
ibnemaja.anwaar = [433,1];