var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ،عَنْ صَالِحِ بْنِ عَجْلَانَ،عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ عَائِشَةَ،قَالَتْ: «وَاللَّهِ مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلَّا فِي الْمَسْجِدِ» قَالَ ابْنُ مَاجَةَ: حَدِيثُ عَائِشَةَ أَقْوَى";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: قسم ہے اللہ کی! رسول اللہ ﷺ نے بیضاء رضی اللہ عنہا کے بیٹے سہیل رضی اللہ عنہ کا جنازہ مسجد ہی میں پڑھا تھا۔\nامام ابن ماجہ رحمہ اللہ نے فرمایا:حضرت عائشہ رضی اللہ عنہا کی حدیث زیادہ قوی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;