var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ عُمَرَ بْنِ حَمْزَةَ،عَنْ سَالِمٍ،أَنَّ شَاعِرًا مَدَحَ بِلَالَ بْنَ عَبْدِ اللَّهِ،فَقَالَ: [البحر الطويل] بِلَالُ بْنُ عَبْدِ اللَّهِ خَيْرُ بِلَالٍ،فَقَالَ ابْنُ عُمَرَ: «كَذَبْتَ،لَا،بَلْ بِلَالُ رَسُولِ اللَّهِ خَيْرُ بِلَالٍ»";
ibnemaja.urdu = "حضرت سالم رحمہ اللہ سے روایت ہے کسی شاعر نے عبداللہ بن عمر رضی اللہ عنہما کے بیٹے بلال رحمہ اللہ کی تعریف کرتے ہوئے یہ کہہ دیا: عبداللہ رضی اللہ عنہ کے بیٹے بلال ہر بلال سے اچھے ہیں۔حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا: تو جھوٹ کہتا ہے،نہیں بلکہ اللہ کے رسول ﷺ کے بلال(رضی اللہ عنہ) ہر بلال سے اچھے ہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = `مشکوۃ المصابیح: عمر بن حمزہ: حسن الحدیث وثقہ الجمھور`;