var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا يَحْيَى بْنُ الْيَمَانِ،عَنْ مِنْهَالِ بْنِ خَلِيفَةَ،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَدْخَلَ رَجُلًا قَبْرَهُ لَيْلًا،وَأَسْرَجَ فِي قَبْرِهِ»";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے ایک شخص کو رات کے وقت قبر میں اتارا اور قبر میں چراغ لے گئے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>منھال بن خلیفۃ: ضعیف (تقریب: 6917) وأخرجہ الترمذي: 1057 مطولاً`;
ibnemaja.anwaar = [433,1];