var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ الْأَوْدِيُّ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ إِبْرَاهِيمَ بْنِ يَزِيدَ الْمَكِّيِّ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَدْفِنُوا مَوْتَاكُمْ بِاللَّيْلِ،إِلَّا أَنْ تُضْطَرُّوا»";
ibnemaja.urdu = "جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’اپنے فوت ہونے والوں کو رات کو دفن نہ کرو،سوائے اس کے کہ تمہیں کوئی مجبوری ہو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إ براھیم بن یزید الخوزي المکي: متروک الحدیث <br>وللحدیث طرق ضعیفۃ عند ابن الجوزي فی الواھیات (العلل المتناہیۃ 2/ 427) وغیرہ <br>وحدیث مسلم (943) یغني عنہ`;
ibnemaja.anwaar = [433,1];