var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنِ ابْنِ لَهِيعَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «صَلُّوا عَلَى مَوْتَاكُمْ بِاللَّيْلِ وَالنَّهَارِ»";
ibnemaja.urdu = "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے نبی ﷺ نے فرمایا: ’’اپنے فوت ہونے والوں کا جنازہ رات کو بھی پڑھو اور دن کو بھی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن لہیعۃ و أبو الزبیر: عنعنا`;
ibnemaja.anwaar = [433,1];