var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ قَالَ: حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا الْحَارِثُ بْنُ نَبْهَانَ قَالَ: حَدَّثَنَا عُتْبَةُ بْنُ يَقْظَانَ،عَنْ أَبِي سَعِيدٍ،عَنْ مَكْحُولٍ،عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَلُّوا عَلَى كُلِّ مَيِّتٍ،وَجَاهِدُوا مَعَ كُلِّ أَمِيرٍ»";
ibnemaja.urdu = "واثلہ بن اسقع رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’ہر میت کاجنازہ پڑھو اور ہر امیر کی قیادت میں جہاد کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>فیہ علل منھا أبو سعید المصلوب وھو کذاب <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [433,1];