var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي لَيْلَى الْكِنْدِيِّ،قَالَ: جَاءَ خَبَّابٌ إِلَى عُمَرَ فَقَالَ: «ادْنُ،فَمَا أَحَدٌ أَحَقَّ بِهَذَا الْمَجْلِسِ مِنْكَ إِلَّا عَمَّارٌ،فَجَعَلَ خَبَّابٌ يُرِيهِ آثَارًا بِظَهْرِهِ مِمَّا عَذَّبَهُ الْمُشْرِكُونَ»";
ibnemaja.urdu = "حضرت ابو لیلیٰ کندی رحمہ اللہ سے روایت ہے کہ حضرت خباب رضی اللہ عنہ عمر رضی اللہ عنہ کے پاس آئے تو انہوں نے فرمایا: قریب آکر بیٹھو،اس جگہ بیٹھنے کا حق آپ سے زیادہ کسی کو نہیں،سوائے عمر رضی اللہ عنہ کے۔پھر حضرت خباب رضی اللہ عنہ عمر رضی اللہ عنہ کو مشرکین کی اذیتوں کے نتیجے میں کمر پر پڑجانے والے نشانات دکھانے لگے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن وشیخہ حسن الحدیث <br>وللحدیث شواھد ضعیفۃ عند ابن سعد (3/ 165) وغیرہ`;
ibnemaja.anwaar = [380,2];