var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ،وَمُحَمَّدُ بْنُ يَحْيَى،قَالَا: حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ قَالَ: حَدَّثَنَا غُنْدَرٌ،عَنْ شُعْبَةَ،عَنْ حَبِيبِ بْنِ الشَّهِيدِ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «صَلَّى عَلَى قَبْرٍ بَعْدَ مَا قُبِرَ»";
ibnemaja.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے ایک قبر پر میت کی تدفین کے بعد نمازِ جنازہ پڑھی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;