var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ قَالَ: حَدَّثَنَا مِهْرَانُ بْنُ أَبِي عُمَرَ،عَنْ أَبِي سِنَانٍ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنِ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«صَلَّى عَلَى مَيِّتٍ بَعْدَ مَا دُفِنَ»";
ibnemaja.urdu = "سلیمان بن بریدہ رحمہ اللہ اپنے والد بریدہ بن حصیب رضی اللہ عنہ سے روایت کرتے ہیں،انہوں نے فرمایا: نبی ﷺ نے ایک میت کا جنازہ اس کے دفن کیے جانے کے بعد ادا کیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;