var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ حُمْرَانَ بْنِ أَعْيَنَ،عَنْ أَبِي الطُّفَيْلِ،عَنْ مُجَمِّعِ بْنِ جَارِيَةَ الْأَنْصَارِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِنَّ أَخَاكُمُ النَّجَاشِيَّ قَدْ مَاتَ،فَقُومُوا فَصَلُّوا عَلَيْهِ» فَصَفَّنَا خَلْفَهُ صَفَّيْنِ";
ibnemaja.urdu = "مجمع بن حاریہ انصاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تمہارا بھائی نجاشی فوت ہوگیا ہے،اٹھو اس کا جنازہ پڑھو لو۔‘‘ تو ہم نے آپ ﷺ کے پیچھے دو صفیں بنالیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;