var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنِ الْمُثَنَّى بْنِ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَبِي الطُّفَيْلِ،عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ بِهِمْ فَقَالَ: «صَلُّوا عَلَى أَخٍ لَكُمْ مَاتَ بِغَيْرِ أَرْضِكُمْ» قَالُوا: مَنْ هُوَ؟ قَالَ: «النَّجَاشِيُّ»";
ibnemaja.urdu = "سیدنا حذیفہ بن اسید غفاری رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ صحابہ کرام رضی اللہ عنہم کو لے کر نکلے اور فرمایا: ’’اپنے ایک بھائی کا جنازہ پڑھو جو تمہارے علاقے سے بارہ فوت ہوگیا ہے۔‘‘ صحابہ رضی اللہ عنہم نے کہا: وہ کون ہے؟ فرمایا: ’’نجاشی‘‘۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;