var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنْ عَامِرِ بْنِ رَبِيعَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،ح وحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،عَنْ عَامِرِ بْنِ رَبِيعَةَ سَمِعَهُ يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا رَأَيْتُمُ الْجِنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ»";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما نے عامر بن ربیعہ رضی اللہ عنہ سے روایت بیان کی کہ نبی ﷺ نے فرمایا: ’’جب تم جنازہ دیکھو تو اس کے لئے کھڑے ہو جاؤ حتی کہ وہ آگے گزر جائے یا(زمین پر) رکھ دیا جائے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;