var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَهَنَّادُ بْنُ السَّرِيِّ،قَالَا: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ مُرَّ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِجِنَازَةٍ،فَقَامَ وَقَالَ: «قُومُوا؛ فَإِنَّ لِلْمَوْتِ فَزَعًا»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ کے پاس سے ایک جنازہ گزرا تو آپ کھڑے ہوگئے اور فرمایا: ’’کھڑے ہو جاؤ،موت کی ایک گھبراہٹ (اور پریشانی) ہوتی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;