var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ شُعْبَةَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ مَسْعُودِ بْنِ الْحَكَمِ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،قَالَ: «قَامَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِجِنَازَةٍ فَقُمْنَا،حَتَّى جَلَسَ فَجَلَسْنَا»";
ibnemaja.urdu = "علی بن ابی طالب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جنازہ دیکھ کر کھڑے ہوئے تو ہم بھی کھڑے ہوگئے،پھر رسول اللہ ﷺ بیٹھ گئے تو ہم بھی بیٹھ گئے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;