var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ يُونُسَ بْنِ خَبَّابٍ،عَنِ الْمِنْهَالِ بْنِ عَمْرٍو،عَنْ زَاذَانَ،عَنِ الْبَرَاءِ بْنِ عَازِبٍ،قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي جِنَازَةٍ،«فَقَعَدَ حِيَالَ الْقِبْلَةِ»";
ibnemaja.urdu = "براء بن عازب رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: ہم لوگ رسول اللہ ﷺ کے ساتھ ایک جنازے میں گئے تو آپ ﷺ قبلہ رو ہو کر بیٹھ گئے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>یونس بن خباب ضعیف رافضي ضعفہ الجمھور و الحدیث الآتي (الأصل: 1549) یغني عنہ`;
ibnemaja.anwaar = [434,1];