var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ عَمْرِو بْنِ قَيْسٍ،عَنِ الْمِنْهَالِ بْنِ عَمْرٍو،عَنْ زَاذَانَ،عَنِ الْبَرَاءِ بْنِ عَازِبٍ،قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي جِنَازَةٍ،فَانْتَهَيْنَا إِلَى الْقَبْرِ «فَجَلَسَ،وَجَلَسْنَا،كَأَنَّ عَلَى رُءُوسِنَا الطَّيْرَ»";
ibnemaja.urdu = "براء بن عازب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم ایک جنازے میں رسول اللہ ﷺ کے ساتھ گئے۔ہم قبرتک پہنچے تو آپ ﷺ بیٹھ گئے اور ہم بھی(بڑی خاموشی سے) بیٹھ گئے۔گویا ہمارے سروں پر پرندے ہیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;