var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الرَّقَاشِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْخَطَّابِ قَالَ: حَدَّثَنَا مَنْدَلُ بْنُ عَلِيٍّ قَالَ: أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ،عَنْ دَاوُدَ بْنِ الْحُصَيْنِ،عَنْ أَبِيهِ،عَنْ أَبِي رَافِعٍ،قَالَ: «سَلَّ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَعْدًا،وَرَشَّ عَلَى قَبْرِهِ مَاءً»";
ibnemaja.urdu = "ابو رافع رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے سعد بن معاذ رضی اللہ عنہ کو سر کی طرف سے قبر میں اتارا اور ان کی قبر پر پانی چھڑکا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مندل ومحمد بن عبیداللّٰہ: ضعیفان`;
ibnemaja.anwaar = [434,1];