var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ قَالَ: حَدَّثَنَا الْمُحَارِبِيُّ،عَنْ عَمْرِو بْنِ قَيْسٍ،عَنْ عَطِيَّةَ،عَنْ أَبِي سَعِيدٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«أُخِذَ مِنْ قِبَلِ الْقِبْلَةِ،وَاسْتُقْبِلَ اسْتِقْبَالًا»";
ibnemaja.urdu = "ابو سعید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کے جسم مبارک کو قبلے کی طرف سے لیا گیا اور اٹھا کر قبر میں داخل کر دیے گئے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عطیۃ: ضعیف مدلس <br>والمحاربي عنعن`;
ibnemaja.anwaar = [434,1];