var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ الرَّازِيُّ،قَالَ سَمِعْتُ عَلِيَّ بْنَ عَبْدِ الْأَعْلَى،يَذْكُرُ عَنْ أَبِيهِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللَّحْدُ لَنَا،وَالشَّقُّ لِغَيْرِنَا»";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے رویت ہے،رسول اللہ ﷺ نے فرمایا: ’’لحد(بغلی قبر) ہمارے لیے ہے اور شق(صندوقی قبر) ہمارے سوا دوسروں کے لیے ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3208) ترمذي (1045) نسائي (2011)`;
ibnemaja.anwaar = [434,1];