var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى السُّدِّيُّ قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ أَبِي الْيَقْظَانِ،عَنْ زَاذَانَ،عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللَّحْدُ لَنَا،وَالشَّقُّ لِغَيْرِنَا»";
ibnemaja.urdu = "جریر بن عبداللہ بجلی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بغلی قبر ہمارے لیے ہے اور صندوقی قبر دوسروں کے لیے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو الیقظان:ضعیف`;
ibnemaja.anwaar = [434,1];