var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا أَبُو عَامِرٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الزُّهْرِيُّ،عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ،عَنْ عَامِرِ بْنِ سَعْدٍ،عَنْ سَعْدٍ،أَنَّهُ قَالَ: «أَلْحِدُوا لِي لَحْدًا،وَانْصِبُوا عَلَيَّ اللَّبِنِ نَصْبًا،كَمَا فُعِلَ بِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
ibnemaja.urdu = "عامر بن سعد اپنے والد سعد بن ابی وقاص رضی اللہ عنہ سے روایت کرتے ہیں،انہوں نے فرمایا: میرے لیے لحد تیار کرنا اور مجھ پر کچھی اینٹیں لگانا جس طرح رسول اللہ ﷺ کے لیے کیا گیا تھا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;