var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ عُثْمَانَ بْنِ عُمَيْرٍ،عَنْ أَبِي حَرْبِ بْنِ أَبِي الْأَسْوَدِ الدِّيْلِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا أَقَلَّتِ الْغَبْرَاءُ،وَلَا أَظَلَّتِ الْخَضْرَاءُ،مِنْ رَجُلٍ أَصْدَقَ لَهْجَةً مِنْ أَبِي ذَرٍّ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ رضی اللہ عنہ سےس نا آپ نے فرمایا:’’ابو ذر رضی اللہ عنہ سے بڑھ کر بات میں سچا آدمی نہ زمین نے اٹھایا،نہ آسمان نے اس پر سایہ کیا۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;