var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا أَيُّوبُ،عَنْ حُمَيْدِ بْنِ هِلَالٍ،عَنْ أَبِي الدَّهْمَاءِ،عَنْ هِشَامِ بْنِ عَامِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «احْفِرُوا،وَأَوْسِعُوا،وَأَحْسِنُوا»";
ibnemaja.urdu = "ہشام بن عامر انصاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’(قبری) کشادہ اور اچھی کھودو۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;