var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ أَيُّوبَ أَبُو هُرَيْرَةَ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ كَثِيرِ بْنِ زَيْدٍ،عَنْ زَيْنَبَ بِنْتِ نُبَيْطٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَعْلَمَ قَبْرَ عُثْمَانَ بْنِ مَظْعُونٍ بِصَخْرَةٍ»";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے عثمان بن مظعون رضی اللہ عنہ کی قبر پر(اس کے سرہانے) علامت کے طور پر ایک بڑا پتھر رکھا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;