var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ قَالَ: حَدَّثَنَا وُهَيْبٌ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ،عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ،عَنْ أَبِي سَعِيدٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«نَهَى أَنْ يُبْنَى عَلَى الْقَبْرِ»";
ibnemaja.urdu = "ابو سعید رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے قبر پر کوئی چیز تعمیر کرنے سے منع فرمایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;