var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ قَالَ: حَدَّثَنَا سَلَمَةُ بْنُ كُلْثُومٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«صَلَّى عَلَى جِنَازَةٍ،ثُمَّ أَتَى قَبْرَ الْمَيِّتِ،فَحَثَى عَلَيْهِ مِنْ قِبَلِ رَأْسِهِ ثَلَاثًا»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ایک میت کا جنازہ پڑھا پھر اس کی قبر پر آئے اور اس کے سر کی طرف سے اس پر(مٹی کی) تین لپیں ڈالیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>یحیی بن أبي کثیر مدلس و عنعن <br>و جاء تصریح سماعہ في روایۃ موضوعۃ و للحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [434,1];