var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،عَنْ يَزِيدَ بْنِ كَيْسَانَ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «زُورُوا الْقُبُورَ؛ فَإِنَّهَا تُذَكِّرُكُمُ الْآخِرَةَ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قبروں کی زیارت کیا کرو،یہ تمہیں آخرت کی یاد دہانی کراتی ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;