var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَنْبَأَنَا ابْنُ جُرَيْجٍ،عَنْ أَيُّوبَ بْنِ هَانِئٍ،عَنْ مَسْرُوقِ بْنِ الْأَجْدَعِ،عَنِ ابْنِ مَسْعُودٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ،فَزُورُوهَا؛ فَإِنَّهَا تُزَهِّدُ فِي الدُّنْيَا،وَتُذَكِّرُ الْآخِرَةَ»";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’میں نے تمہیں قبروں کی زیارت سے منع کیا تھا،(اب) ان کی زیارت کیا کروکیوں کہ وہ دنیا سے بے رغبتی پیدا کرتی ہے اور آخرت کی یاد دلاتی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن جریج عنعن <br>وللحدیث شواھد عند مسلم (977) وغیرہ إلا قولہ: ’’ فإنھا تزھد فی الدنیا ‘‘`;
ibnemaja.anwaar = [435,1];