var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَأَبُو بِشْرٍ قَالَا: حَدَّثَنَا قَبِيصَةُ،ح وحَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا عُبَيْدُ بْنُ سَعِيدٍ،ح وحَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ قَالَ: حَدَّثَنَا الْفِرْيَابِيُّ،وَقَبِيصَةُ كُلُّهُمْ عَنْ سُفْيَانَ،عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ بَهْمَانَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَسَّانَ بْنِ ثَابِتٍ،عَنْ أَبِيهِ،قَالَ: «لَعَنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زُوَّارَاتِ الْقُبُورِ»";
ibnemaja.urdu = "حسان بن ثابت رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ نے قبروں کی بکثرت زیارت کرنے والی عورتوں پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;