var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ أَبُو نَصْرٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ طَالِبٍ قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «لَعَنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زُوَّارَاتِ الْقُبُورِ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا: اللہ کے رسول ﷺ نے قبروں کی بکثرت زیارت کرنے والی عورتوں پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;