var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ،مَوْلَى الصَّهْبَاءِ عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أُمِّ سَلَمَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: وَلَا يَعْصِينَكَ فِي مَعْرُوفٍ [الممتحنة: 12] قَالَ: «النَّوْحُ»";
ibnemaja.urdu = "ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ نے آیت مبارکہ (وَلاَ یَعْصِینَکَ فِی مَعْرُوفٍ)’’نیکی کے کام میں آپ کی نافرمانی نہیں کریں گی۔‘‘ کی وضاحت کرتے ہوئے فرمایا: ’’نوحہ کے بارے میں ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;