var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ قَالَ: حَدَّثَنَا حَرِيزٌ مَوْلَى مُعَاوِيَةَ قَالَ: خَطَبَ مُعَاوِيَةُ بِحِمْصَ فَذَكَرَ فِي خُطْبَتِهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«نَهَى عَنِ النَّوْحِ»";
ibnemaja.urdu = "معاویہ رضی اللہ عنہ کے آزاد کردہ غلام جریر رحمہ اللہ سے روایت ہے،انہوں نے کہا: معاویہ رضی اللہ عنہ نے حمص شہر میں خطبہ دیا تو اس خطبے کے دوران میں یہ بھی ذکر فرمایا کہ اللہ کے رسول ﷺ نے نوحہ کرنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد اللّٰہ بن دینار الحمصي ضعیف ضعفہ الجمھور و حریز مولی معاویۃ مجھول و للحدیث طریق آخر عند البخاري فی التاریخ الکبیر (7/ 234) و سندہ ضعیف<br>فیہ کیسان مولی معاویۃ مجھول الحال،و ثقہ ابن حبان وحدہ و في سماع محمد بن مہاجر الشامي منہ نظر <br>و حدیث البخاري (4892) و مسلم (936) یغني عنہ`;
ibnemaja.anwaar = [435,1];