var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ: أَنْبَأَنَا إِسْرَائِيلُ،عَنْ أَبِي يَحْيَى،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عُمَرَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ تُتْبَعَ جِنَازَةٌ مَعَهَا رَانَّةٌ»";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: ’’رسول اللہ ﷺ نے اس جنازے کے ساتھ جانے سے منع فرمایا ہے جس کے ساتھ نوحہ کرنے والی عورت ہو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو یحیی القتات: روی عنہ إسرائیل أحادیث کثیرۃ مناکیر جدًا،قالہ أحمد (سنن أبي داود:4069) <br>وللحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [435,1];