var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ الْمُحَارِبِيُّ،وَمُحَمَّدُ بْنُ كَرَامَةَ،قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ،عَنْ مَكْحُولٍ،وَالْقَاسِمِ،عَنْ أَبِي أُمَامَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«لَعَنَ الْخَامِشَةَ وَجْهَهَا،وَالشَّاقَّةَ جَيْبَهَا،وَالدَّاعِيَةَ بِالْوَيْلِ وَالثُّبُورِ»";
ibnemaja.urdu = "ابو امامہ (اسعد بن سہل بن حنیف) رضی الہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے(اظہار غم کے لیے) چہرہ نوچنے والی پر،گریبان چاک کرنے والی پر،اور بربادی اور ہلاکت پکارنے والی پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;