var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ إِبْرَاهِيمَ الْهَجَرِيِّ،عَنِ ابْنِ أَبِي أَوْفَى،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمَرَاثِي»";
ibnemaja.urdu = "عبداللہ بن ابی اوفی رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: اللہ کے رسول ﷺ نے مرثیہ گوئی سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إبراہیم بن مسلم الہجري: لین الحدیث <br>وھو ضعیف الحدیث علی الراجح`;
ibnemaja.anwaar = [436,1];