var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا شَاذَانُ،ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَمُحَمَّدُ بْنُ الْوَلِيدِ،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،ح وحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا عَبْدُ الصَّمَدِ،وَوَهْبُ بْنُ جَرِيرٍ،قَالُوا: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنِ ابْنِ عُمَرَ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمَيِّتُ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ»";
ibnemaja.urdu = "عمر بن خطاب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’میت پر نوحہ کیا جائے تو اس کی وجہ سے میت کو عذاب ہوتا ہے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;