var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَمْرٍو،عَنِ ابْنِ أَبِي مُلَيْكَةَ،عَنْ عَائِشَةَ،قَالَتْ إِنَّمَا كَانَتْ يَهُودِيَّةٌ مَاتَتْ،فَسَمِعَهُمُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَبْكُونَ عَلَيْهَا،قَالَ: «فَإِنَّ أَهْلَهَا يَبْكُونَ عَلَيْهَا،وَإِنَّهَا تُعَذَّبُ فِي قَبْرِهَا»";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: ایک یہودی عورت مرگئی،نبی ﷺ نے ان لوگوں کو اس پر روتے ہوئے سنا تو فرمایا: ’’اس کے گھر والے اس پر روہے رہیں اور اسے قبر میں عذاب ہو رہا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;