var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا ثَابِتُ بْنُ عَجْلَانَ،عَنِ الْقَاسِمِ،عَنْ أَبِي أُمَامَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَقُولُ اللَّهُ سُبْحَانَهُ: «ابْنَ آدَمَ إِنْ صَبَرْتَ وَاحْتَسَبْتَ عِنْدَ الصَّدْمَةِ الْأُولَى،لَمْ أَرْضَ لَكَ ثَوَابًا دُونَ الْجَنَّةِ»";
ibnemaja.urdu = "ابو امامہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’اللہ سبحانہ وتعالیٰ فرماتا ہے: اے آدم کے بیٹے! اگر ابتدائے صدمہ کے وقت تو صبر کرے اور حصول ثواب کی نیت کرے تو میں تیرے لیے جنت سے کم ثواب پسند نہیں کروں گا۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;