var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ،عَنْ هِشَامِ بْنِ زِيَادٍ،عَنْ أُمِّهِ،عَنْ فَاطِمَةَ بِنْتِ الْحُسَيْنِ،عَنْ أَبِيهَا،قَالَ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أُصِيبَ بِمُصِيبَةٍ،فَذَكَرَ مُصِيبَتَهُ،فَأَحْدَثَ اسْتِرْجَاعًا،وَإِنْ تَقَادَمَ عَهْدُهَا،كَتَبَ اللَّهُ لَهُ مِنَ الْأَجْرِ مِثْلَهُ يَوْمَ أُصِيبَ»";
ibnemaja.urdu = "حسن بن علی رضی اللہ عنہما سے روایت ہے نبی ﷺ نے فرمایا: ’’جسے کوئی مصیبت آئی (بعد میں) پھر اسے وہ مصیبت (دوبارہ) یاد آئی تو اس نے نئے سرے سے( إِنَّا لِلَّہِ وَإِنَّا إِلَیْہِ رَاجِعُونَ اللَّہُمَّ)پڑھ لیا اگرچہ اس کو گزرے طویل عرصہ گزر گیا ہو،اللہ تعالیٰ اس کے لئے اتنا ہی ثواب لکھے گا جتنا (اس دن ملا تھا) جس دن مصیبت آئی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>ھشام بن زیاد: متروک`;
ibnemaja.anwaar = [436,1];