var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ قَالَ: حَدَّثَنِي قَيْسٌ أَبُو عُمَارَةَ،مَوْلَى الْأَنْصَارِ قَالَ: سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ،يُحَدِّثُ عَنْ أَبِيهِ،عَنْ جَدِّهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «مَا مِنْ مُؤْمِنٍ يُعَزِّي أَخَاهُ بِمُصِيبَةٍ،إِلَّا كَسَاهُ اللَّهُ سُبْحَانَهُ مِنْ حُلَلِ الْكَرَامَةِ يَوْمَ الْقِيَامَةِ»";
ibnemaja.urdu = "عمرو بن حزم رضی اللہ عنہما سے روایت ہے نبی ﷺ نے فرمایا: ’’جو مومن اپنے بھائی کو کسی مصیبت پر تسلی دیتا ہے،اللہ تعالیٰ اسے قیامت کے دن عزت افزائی کا خلعت عطا فرمائے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قیس أبو عمارۃ: فیہ لین (تقریب: 5598) ضعیف (التحریر 3/ 190) <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [436,1];