var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ،قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ،عَنْ مُحَمَّدِ بْنِ سُوقَةَ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ عَزَّى مُصَابًا فَلَهُ مِثْلُ أَجْرِهِ»";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص کسی مصیبت زدہ کو تسلی دے،اسے بھی اس(مصیبت زدہ) کے برابر ثواب ملے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1073)`;
ibnemaja.anwaar = [436,1];