var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمُوتُ لِرَجُلٍ ثَلَاثَةٌ مِنْ الْوَلَدِ فَيَلِجَ النَّارَ إِلَّا تَحِلَّةَ الْقَسَمِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:’’جس آدمی کے تین بچے فوت ہو جائیں وہ جہنم میں داخل نہیں ہوگا مگر قسم پوری کرنے کے لئے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;