var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ مُسْلِمَيْنِ يُتَوَفَّى لَهُمَا ثَلَاثَةٌ مِنْ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا أَدْخَلَهُمْ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَةِ اللَّهِ إِيَّاهُمْ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جن دو مسلمانوں(میاں بیوی) کے تین بچے فوت ہوجائیں جو گناہ کی عمر کو نہ پہنچے ہوں تو اللہ تعالیٰ ان پر رحمت کر کے انہیں جنت میں داخل کر دے گا‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;