var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ هَاشِمِ بْنِ مَرْزُوقٍ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ حَدَّثَنَا يَحْيَى بْنُ عُبَيْدِ اللَّهِ عَنْ عُبَيْدِ اللَّهِ بْنِ مُسْلِمٍ الْحَضْرَمِيِّ عَنْ مُعَاذِ بْنِ جَبَلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ السِّقْطَ لَيَجُرُّ أُمَّهُ بِسَرَرِهِ إِلَى الْجَنَّةِ إِذَا احْتَسَبَتْهُ";
ibnemaja.urdu = "معاذ بن جبل رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! ناتمام بچہ اپنی ماں کو آنول کے ذریعے سے کھینچ کر جنت میں لے جائے گا جب کہ اس نے اس پر صبر کیا ہو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>وقال البوصیري: ’’ ھذا إسناد ضعیف،لإتفاقھم علی ضعف یحیی بن عبید اللّٰہ بن عبد اللّٰہ بن موہب ‘‘ متروک (ترمذي:1929) <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [437,1];