var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ جَعْفَرِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ لَمَّا جَاءَ نَعْيُ جَعْفَرٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اصْنَعُوا لِآلِ جَعْفَرٍ طَعَامًا فَقَدْ أَتَاهُمْ مَا يَشْغَلُهُمْ أَوْ أَمْرٌ يَشْغَلُهُمْ";
ibnemaja.urdu = "عبداللہ بن جعفر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا جب جعفر (بن ابی طالب)رضی اللہ عنہ کی وفات کی خبر آئی تو رسول اللہ ﷺ نے فرمایا: ’’جعفر کے گھر والون کے لیے کھانا تیار کرو،ان کے پاس وہ چیز آگئی ہے،یا فرمایا: وہ معاملہ آگیا ہے جس نے انہیں مشغول کر دیا ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;