var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا أَبُو الْمُنْذِرِ الْهُذَيْلُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَوْتُ غُرْبَةٍ شَهَادَةٌ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بے وطنی کی موت شہادت ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الہذیل بن الحکم: لین الحدیث (تقریب: 7271) <br>أي: ضعیف وللحدیث شواہد کلھا ضعیفۃ`;
ibnemaja.anwaar = [437,1];