var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنَا أَبُو عُبَيْدَةَ بْنُ أَبِي السَّفَرِ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ أَبِي عَطَاءٍ عَنْ مُوسَى بْنِ وَرْدَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ مَرِيضًا مَاتَ شَهِيدًا وَوُقِيَ فِتْنَةَ الْقَبْرِ وَغُدِيَ وَرِيحَ عَلَيْهِ بِرِزْقِهِ مِنْ الْجَنَّةِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص بیمار ہو کر مرا،وہ شہید ہوا،اسے قبر کے عذاب سے محفوظ رکھا جائے گا اور اسے صبح و شام جنت سے رزق دیا جاتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>إبراہیم الأسلمي: متروک <br>و قیل: أنہ کان یتبرأ من ھذا الحدیث`;
ibnemaja.anwaar = [437,1];