var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ قَالَ حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’میت کی ہڈ توڑنا ایسے ہی ہے جیسے اس کی زندگی میں توڑنا۔‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;