var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ،قَالَا: حَدَّثَنَا وَكِيعٌ،قَالَ حَدَّثَنَا سُفْيَانُ،عَنْ نُسَيْرِ بْنِ ذُعْلوقٍ،قَالَ: كَانَ ابْنُ عُمَرَ يَقُولُ: «لَا تَسُبُّوا أَصْحَابَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَلَمُقَامُ أَحَدِهِمْ سَاعَةً،خَيْرٌ مِنْ عَمَلِ أَحَدِكُمْ عُمُرَهُ»";
ibnemaja.urdu = "حضرت نسیر بن ذعلوق رحمہ اللہ سے روایت ہے کہ حضرت عبداللہ بن عمر رضی اللہ عنہما فرمایا کرتے تھے: محمد ﷺ کے صحابہ کو برا نہ کہو،ایک صحابی کا(نبی اکرم ﷺ کی صحبت میں) گھڑی بھر ٹھہرنا،تم میں سے کسی کی زندگی بھر کے عملوں سے بہتر ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = `سفیان صرح بالسماع عند مسدد (المطالب العالیۃ 8/ 481 ح 4155) وتوضیح المشتبۃ (1/ 539)`;