var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ صَالِحٍ أَبِي الْخَلِيلِ عَنْ سَفِينَةَ عَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي مَرَضِهِ الَّذِي تُوُفِّيَ فِيهِ الصَّلَاةَ وَمَا مَلَكَتْ أَيْمَانُكُمْ فَمَا زَالَ يَقُولُهَا حَتَّى مَا يَفِيضُ بِهَا لِسَانُهُ";
ibnemaja.urdu = "ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ جس مرض میں رسول اللہ ﷺ نے انتقام فرمایا،اس کے دوران میں آپ فرمایا کرتےتھے: ’’نماز(کی حفاظت کرو)اور(ان لونڈی غلاموں کی) جو تمہارے ہاتھوں کی ملکیت ہیں۔‘‘ آپ نے یہ الفاظ باربار فرمائے حتی کہ آپ کی زبان مبارک رک گئی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>والحدیث الآتي (الأصل: 2698) یغني عنہ <br>قتادۃ عنعن <br>وللحدیث شواھد کلھا معلولۃ،انظر ح: 2697`;
ibnemaja.anwaar = [437,1];