var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ الْعِجْلِيُّ عَنْ ابْنِ عَوْنٍ عَنْ الْحَسَنِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّمَا وَجْهُنَا وَاحِدٌ فَلَمَّا قُبِضَ نَظَرْنَا هَكَذَا وَهَكَذَا";
ibnemaja.urdu = "ابی بن کعب رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کی موجودگی میں ہم لوگوں کی توجہ ایک ہی (آخرت کی) طرف ہوتی تھی،جب آپ فوت ہوگئے تو ادھر ادھر (کوئی دنیا کو اور کوئی آخرت کو) دیکھنے لگے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الحسن البصري لم یسمع من أبي بن کعب رضي اللّٰہ عنہ کما في تحفۃ الأشراف(12/1)`;
ibnemaja.anwaar = [438,1];