var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِلَّهِ عِنْدَ كُلِّ فِطْرٍ عُتَقَاءَ وَذَلِكَ فِي كُلِّ لَيْلَةٍ";
ibnemaja.urdu = "جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ ہر افطار کے وقت کچھ لوگوں کو آزاد فرماتا ہے۔اور یہ(رمضان کی) ہر رات میں ہوتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سلیمان الأعمش عنعن <br>و للحدیث شواھد ضعیفۃ (انظر الترغیب والترہیب 2/ 103۔104)`;
ibnemaja.anwaar = [439,1];