var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَدْرٍ عَبَّادُ بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ بِلَالٍ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ دَخَلَ رَمَضَانُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذَا الشَّهْرَ قَدْ حَضَرَكُمْ وَفِيهِ لَيْلَةٌ خَيْرٌ مِنْ أَلْفِ شَهْرٍ مَنْ حُرِمَهَا فَقَدْ حُرِمَ الْخَيْرَ كُلَّهُ وَلَا يُحْرَمُ خَيْرَهَا إِلَّا مَحْرُومٌ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے کہا: رمضان کا مہینہ شروع ہوا تو رسول اللہ ﷺ نے فرمایا: ’’تمہارے پاس یہ مہینہ آگیا ہے،اس میں ایک رات ہے جو ہزار مہینے سے افضل ہے۔جو اس رات(کا ثواب حاصل کرنے) سے محروم رہا،وہ ہر بھلائی سے محروم ہے۔اس کے خیر سے وہی محروم رہتا ہے جو واقعی محروم ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قتادۃ عنعن <br>ولحدیثہ شاھد منقطع (سنن النسائي: 2108) و مرسل (مصنف عبدالرزاق: 7383)`;
ibnemaja.anwaar = [439,1];