var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ أَبِي إِسْحَقَ عَنْ صِلَةَ بْنِ زُفَرَ قَالَ كُنَّا عِنْدَ عَمَّارٍ فِي الْيَوْمِ الَّذِي يُشَكُّ فِيهِ فَأُتِيَ بِشَاةٍ فَتَنَحَّى بَعْضُ الْقَوْمِ فَقَالَ عَمَّارٌ مَنْ صَامَ هَذَا الْيَوْمَ فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "صلہ بن زفر رحمہ اللہ سے روایت ہے،انہوں نے کہا: ہم لوگ عمار رضی اللہ عنہ کی خدمت میں حاضر تھے اور دن وہ تھا جس میں شک کیا جاتا ہے۔آپ کی خدمت میں ایک (پکائی ہوئی) بکری پیش کی گئی۔بعض لوگ (کھانے سے اجتناب کرتے ہوئے) ایک طرف ہوگئے۔عمار رضی اللہ عنہ نے فرمایا: جس نے اس دن روزہ رکھا،اس نے ابو القاسم ﷺ کی نافرمانی کی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2334) ترمذي (686) نسائي (2190)`;
ibnemaja.anwaar = [439,1];