var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ عَنْ جَدِّهِ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تَعْجِيلِ صَوْمِ يَوْمٍ قَبْلَ الرُّؤْيَةِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے کہا: رسول اللہ ﷺ نے چاند نظر آنے سے ایک دن پہلے جلدی کرتے ہوئے روزہ رکھنے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>عبداﷲ بن سعید المقبري: متروک`;
ibnemaja.anwaar = [439,1];