var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ رَبِيعَةَ بْنِ الْغَازِ أَنَّهُ سَأَلَ عَائِشَةَ عَنْ صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ حَتَّى يَصِلَهُ بِرَمَضَانَ";
ibnemaja.urdu = "ربیعہ بن غاز رحمہ اللہ سے روایت ہے کہ انہوں نے ام المومنین عائشہ رضی اللہ عنہا سے رسول اللہ ﷺ کے روزوں کے بارے میں سوال کیا تو ام المومنین رضی اللہ عنہا نے فرمایا: آپ ﷺ پورا شعبان روزے رکھتے تھے حتی کہ اسے رمضان سے ملا دیتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;