var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ قَالَ: حَدَّثَنِي كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رَحِمَ اللَّهُ الْأَنْصَارَ،وَأَبْنَاءَ الْأَنْصَارِ،وَأَبْنَاءَ أَبْنَاءِ الْأَنْصَارِ»";
ibnemaja.urdu = "حضرت عمرو بن عوف رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا:‘‘ اللہ انصار پر رحمت فرمائے،انصار کے بیٹوں پر اور انصار کے پوتوں پر۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>کثیر بن عبد اللّٰہ العوفي: متروک <br>وحدیث مسلم (2605) یغني عنہ`;
ibnemaja.anwaar = [381,1];