var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبٍ وَالْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقَدَّمُوا صِيَامَ رَمَضَانَ بِيَوْمٍ وَلَا بِيَوْمَيْنِ إِلَّا رَجُلٌ كَانَ يَصُومُ صَوْمًا فَيَصُومُهُ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’رمضان(شروع ہونے) سے ایک دو دن پہلے روزہ نہ رکھو،سوائے اس شخص کے جو پہلے سے وہ روزہ رکھتا چلا آرہا ہو تو اس دن بھی رکھ لے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;