var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ ح و حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ قَالَا حَدَّثَنَا الْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ النِّصْفُ مِنْ شَعْبَانَ فَلَا صَوْمَ حَتَّى يَجِيءَ رَمَضَانُ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب شعبان آدھا ہو جائے تو رمضان آجانے تک کوئی روزہ نہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;