var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الْهِلَالَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ قَالَ وَكَانَ ابْنُ عُمَرَ يَصُومُ قَبْلَ الْهِلَالِ بِيَوْمٍ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب تم چاند دیکھو تو روزے رکھو،اور جب چاند دیکھو تو روزے چھوڑ دو۔اگر تم پر بادل چھا جائے تو اس کا اندازہ کر لو۔‘‘ ابن عمر چاند سے ایک دن پہلے روزہ رکھتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;