var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمْ مَضَى مِنْ الشَّهْرِ قَالَ قُلْنَا اثْنَانِ وَعِشْرُونَ وَبَقِيَتْ ثَمَانٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّهْرُ هَكَذَا وَالشَّهْرُ هَكَذَا وَالشَّهْرُ هَكَذَا ثَلَاثَ مَرَّاتٍ وَأَمْسَكَ وَاحِدَةً";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’مہینے کا کتنا حصہ گزر گیا ہے؟‘‘ ہم نے کہا: بائیس (دن گزر گئے ہیں) اور باقی آٹھ دن ہیں۔رسول اللہ ﷺ نے فرمایا: ’’مہینہ اتنا ہوتا ہے اور مہینہ اتنا ہوتا ہے،اور مہینہ اتنا ہوتا ہے۔‘‘ آپ نے تین بار یہ الفاظ فرمائے اور (تیسری بار) ایک انگلی بند فرمالی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سلیمان الأعمش عنعن <br>و الحدیث الآتي (الأصل: 1657) یغني عنہ`;
ibnemaja.anwaar = [439,1];