var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا وَعَقَدَ تِسْعًا وَعِشْرِينَ فِي الثَّالِثَةِ";
ibnemaja.urdu = "سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: مہینہ اتنا اتنا اور اتنا ہوتا ہے۔‘‘ آپ ﷺ نے تیسری بار کے اشارے سے انتیس کا اشارہ مکمل کیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;