var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا صُمْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعًا وَعِشْرِينَ أَكْثَرُ مِمَّا صُمْنَا ثَلَاثِينَ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم نے رسول اللہ ﷺ کے عہد مبارک میں تیس روزوں کی نسبت انتیس روزے زیادہ دفعہ رکھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سعید بن ایاس الجریري اختلط <br>و لا یعرف سماع القاسم بن مالک منہ قبل اختلاطہ <br>و حدیث أبي داود (الأصل: 2322 وسندہ حسن) یغني عنہ`;
ibnemaja.anwaar = [440,1];