var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شَهْرَا عِيدٍ لَا يَنْقُصَانِ رَمَضَانُ وَذُو الْحِجَّةِ";
ibnemaja.urdu = "ابو بکرہ(نفیع بن حارث ثقفی) رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’عید کے دو مہینے ناقص نہیں ہوتے،یعنی رمضان اور ذوالحجہ۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;