var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،وَأَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ،قَالَا: حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ: حَدَّثَنَا خَالِدٌ الْحَذَّاءُ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: ضَمَّنِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِ وَقَالَ: «اللَّهُمَّ عَلِّمْهُ الْحِكْمَةَ،وَتَأْوِيلَ الْكِتَابِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے مجھے سینے سے لگایا اور فرمایا:‘‘ اے اللہ! اسے حکمت سکھا دے اور کتاب(قرآن مجید) کا مطلب سکھا دے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;