var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ أَبِي عُمَرَ الْمُقْرِئُ حَدَّثَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفِطْرُ يَوْمَ تُفْطِرُونَ وَالْأَضْحَى يَوْمَ تُضَحُّونَ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’عید الفطر اس دن ہے جس دن تم (رمضان مکمل کر کے) روزہ چھوڑتے ہو،اور عید الاضحیٰ اس دن ہے جس دن تم قربانی کرتے ہو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;