var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ سَأَلَ حَمْزَةُ الْأَسْلَمِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أَصُومُ أَفَأَصُومُ فِي السَّفَرِ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے کہ حمزہ بن عمرو اسلمی رضی اللہ عنہ نے رسول اللہ ﷺ سے سوال کیا اور کہا: میں (نفلی) روزے رکھا کرتا ہوں،کیا سفر میں بھی روزہ رکھ لیا کروں؟ رسول اللہ ﷺ نے فرمایا: ’’اگر تو چاہے تو روزہ رکھ لے،چاہے تو چھوڑ دے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;