var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُوسَى التَّيْمِيُّ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَائِمُ رَمَضَانَ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ";
ibnemaja.urdu = "عبدالرحمٰن بن عوف رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’سفر میں رمضان کا روزہ رکھنے والا ایسے ہی ہے جیسے گھر میں ہوتے ہوئے روزہ نہ رکھنے والا۔ابو اسحاق نے فرمایا: یہ حدیث کسی کام کی نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نسائي (2286)<br>أبو سلمۃ لم یسمع من أبیہ والزہري عنعن`;
ibnemaja.anwaar = [440,1];