var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ الدِّمَشْقِيُّ حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ عَنْ الْجُرَيْرِيِّ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحُبْلَى الَّتِي تَخَافُ عَلَى نَفْسِهَا أَنْ تُفْطِرَ وَلِلْمُرْضِعِ الَّتِي تَخَافُ عَلَى وَلَدِهَا";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے اس حاملہ کو جسے اپنی جان کا خطرہ ہو روزہ چھوڑنے کی رخصت دی ہے،اور دودھ پلانے والی اس عورت کو بھی (رخصت دی ہے) جسے اپنے بچے کے بارے میں (نقصان پہنچنے کا) خوف ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>الربیع بن بدر: متروک`;
ibnemaja.anwaar = [440,1];