var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي سَلَمَةَ قَالَ سَمِعْتُ عَائِشَةَ تَقُولُ إِنْ كَانَ لَيَكُونُ عَلَيَّ الصِّيَامُ مِنْ شَهْرِ رَمَضَانَ فَمَا أَقْضِيهِ حَتَّى يَجِيءَ شَعْبَانُ";
ibnemaja.urdu = "ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: میرے ذمے رمضان کے روزے ہوتے تھے تو میں ان کی قضا نہیں دیتی تھی حتی کہ شعبان آجاتا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;