var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ ابْنِ الْمُطَوِّسِ عَنْ أَبِيهِ الْمُطَوِّسِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ لَمْ يُجْزِهِ صِيَامُ الدَّهْرِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جس نے بغیر عذر کے رمضان کا ایک بھی روزہ چھوڑ دیا،اس کے بدلے زمانے بھر کےروزے بھی کافی نہیں ہوں گے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داو د (2396) ترمذي (723)`;
ibnemaja.anwaar = [440,1];