var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ سُلَيْمَانَ أَبُو الشَعْثَاءِ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ جَمِيعًا عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ذَرَعَهُ الْقَيْءُ فَلَا قَضَاءَ عَلَيْهِ وَمَنْ اسْتَقَاءَ فَعَلَيْهِ الْقَضَاءُ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جس کو خود بخود قے آجائے اس پر قضا نہیں،اور جو قصداً قے کرے،اس پر قضا ضروری ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2380) ترمذي (720)`;
ibnemaja.anwaar = [440,1];