var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو إِسْمَعِيلَ الْمُؤَدِّبُ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْرِ خِصَالِ الصَّائِمِ السِّوَاكُ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’روزے دار کے بہترین اعمال میں سے ایک عمل مسواک بھی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مجالد: ضعیف`;
ibnemaja.anwaar = [440,1];