var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو التَّقِيِّ هِشَامُ بْنُ عَبْدِ الْمَلِكِ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا الزُّبَيْدِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ اكْتَحَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ صَائِمٌ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے روزے کی حالت میں سرمہ لگایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سعید بن عبد الجبار الزبیدي: ضعیف،کا ن جریر یکذبہ (تقریب: 2343)`;
ibnemaja.anwaar = [440,1];