var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ وَدَاوُدُ بْنُ رَشِيدٍ قَالَا حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بِشْرٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’سینگی لگانے والے اور لگوانے والے نے روزہ کھول دیا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;