var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ أَنْبَأَنَا شَيْبَانُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو قِلَابَةَ أَنَّ أَبَا أَسْمَاءَ حَدَّثَهُ عَنْ ثَوْبَانَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ";
ibnemaja.urdu = "ثوبان رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو یہ فرماتے سنا ہے: ’’سینگی لگانے والے اور لگوانے والے نے روزہ کھول دیا۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;