var ibnemaja = {};
ibnemaja.arabic = "وبإسناده‘عَنْ أَبِي قِلَابَةَ أَنَّهُ أَخْبَرَهُ أَنَّ شَدَّادَ بْنَ أَوْسٍ بَيْنَمَا هُوَ يَمْشِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْبَقِيعِ فَمَرَّ عَلَى رَجُلٍ يَحْتَجِمُ بَعْدَ مَا مَضَى مِنْ الشَّهْرِ ثَمَانِيَ عَشْرَةَ لَيْلَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ";
ibnemaja.urdu = "شداد بن اوس رضی اللہ عنہ سے روایت ہے کہ وہ مقام بقیع میں رسول اللہ ﷺ کے ساتھ چلے جا رہے تھے کہ آپ ایک آدمی کے پاس سے گزرے جو سینگی لگوارہاتھا۔اس وقت رمضان کی اٹھارہ راتیں گزر چکی تھیں تو رسول اللہ ﷺ نے فرمایا: ’’سینگی لگانے والے اور لگوانے والے نے روزہ کھول دیا۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;