var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ وَهُوَ صَائِمٌ وَأَيُّكُمْ يَمْلِكُ إِرْبَهُ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْلِكُ إِرْبَهُ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ روزے کی حالت میں بوسہ لے لیتے تھے۔اور تم میں سے کسے اپنی خواہش پر اتنا قابو ہو سکتا ہے،جتنا رسول اللہ ﷺ کو اپنی خواہش پر قابو حاصل تھا؟";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;