var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ عَنْ إِسْرَائِيلَ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ أَبِي يَزِيدَ الضِّنِّيِّ عَنْ مَيْمُونَةَ مَوْلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ رَجُلٍ قَبَّلَ امْرَأَتَهُ وَهُمَا صَائِمَانِ قَالَ قَدْ أَفْطَرَا";
ibnemaja.urdu = "نبی ﷺ کی آزاد کردہ لونڈی میمونہ بنت سعد رضی اللہ عنہا سے روایت ہے،انہوں نے کہا:نبی ﷺ سے سوال کیا گیا کہ اگر مرد اپنی بیوی کا بوسہ لے لے جب کہ ان دونوں کا روزہ ہو(تو کیا حکم ہے؟) آپ ﷺ نے فرمایا: ’’ان دونوں نے روزہ کھول دیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو یزید: مجہول (تقریب: 8451) <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [440,1];