var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ ابْنِ عَوْنٍ عَنْ إِبْرَاهِيمَ قَالَ دَخَلَ الْأَسْوَدُ وَمَسْرُوقٌ عَلَى عَائِشَةَ فَقَالَا أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَاشِرُ وَهُوَ صَائِمٌ قَالَتْ كَانَ يَفْعَلُ وَكَانَ أَمْلَكَكُمْ لِإِرْبِهِ";
ibnemaja.urdu = "ابراہیم نخعی رحمہ اللہ سے روایت ہے کہااسود اور مسروق ام المومنین عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوئے اور کہا: کیا رسول اللہ ﷺ روزے کی حالت میں مباشرت کیا کرتے تھے؟ ام المومنین نے فرمایا: آپ ﷺ ایسے کر لیا کرتے تھے لیکن آپ ﷺ کو اپنی خواہش پر تم سے زیادہ قابو حاصل تھا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;