var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْجَهْلَ وَالْعَمَلَ بِهِ فَلَا حَاجَةَ لِلَّهِ فِي أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جس نے جھوٹ اور بے ہودہ باتوں اور بے ہودہ اعمال سے اجتناب نہ کیا،اللہ کو کوئی ضرورت نہیں کہ وہ شخص کھانا پینا ترک کردے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;