var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلَا يَرْفُثْ وَلَا يَجْهَلْ وَإِنْ جَهِلَ عَلَيْهِ أَحَدٌ فَلْيَقُلْ إِنِّي امْرُؤٌ صَائِمٌ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب تم میں سے کسی کا دن کو روزہ ہو تو وہ فحش گوئی نہ کرے اور ناروا حرکت کرے،اگر کوئی اس سے بدتمیزی کرے تو کہہ دے میں روزے دار ہوں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;