var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ عَنْ سَلَمَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اسْتَعِينُوا بِطَعَامِ السَّحَرِ عَلَى صِيَامِ النَّهَارِ وَبِالْقَيْلُولَةِ عَلَى قِيَامِ اللَّيْلِ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’سحری کے کھانے کے ساتھ دن کے روزے کے لیے مدد حاصل کرو،اور قیلولے کے ذریعے سے قیام اللیل(نماز تہجد) کے لیے مدد حاصل کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br> زمعۃ: ضعیف <br>وللحدیث شاہد ضعیف فی العلل لابن أبي حاتم (241/1،ح 701) فیہ مجہولان (!)`;
ibnemaja.anwaar = [441,1];