var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ حُذَيْفَةَ قَالَ تَسَحَّرْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ النَّهَارُ إِلَّا أَنَّ الشَّمْسَ لَمْ تَطْلُعْ\n(قال ابو اسحاق:حدیث حذیفۃ منسوخ لیس بشیئ)";
ibnemaja.urdu = "حذیفہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ کے ساتھ سحری کھائی جب کہ دن نکل آیا تھا لیکن سورج طلوع نہیں ہوتا تھا۔امام ابو اسحاق نے کہا: حذیفہ رضی اللہ عنہ کی حدیث منسوخ ہے اور کچھ بھی نہیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;