var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ سَهْلِ بْنِ سَعْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْإِفْطَارَ";
ibnemaja.urdu = "سہل بن سعد رضی اللہ عنہما سے روایت ہے نبی ﷺ نے فرمایا: ’’لوگ اس وقت تک بھلائی پر رہیں گے جب تک روزہ جلدی کھولتے رہیں گے۔‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;