var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ عَجِّلُوا الْفِطْرَ فَإِنَّ الْيَهُودَ يُؤَخِّرُونَ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’لوگ اس وقت تک بھلائی پر رہیں گے جب تک روزہ جلدی کھولتے رہیں گے۔روزہ جلدی کھولا کرو کیوں کہ یہودی دیر کرتے ہیں۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;