var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ الْقَطَوَانِيُّ عَنْ إِسْحَقَ بْنِ حَازِمٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صِيَامَ لِمَنْ لَمْ يَفْرِضْهُ مِنْ اللَّيْلِ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما نے ام المومنین حفصہ رضی اللہ عنہا سے روایت کرتے ہوئے فرمایا کہ اللہ کے رسول ﷺ نے فرمایا: ’’جو شخص رات سے روزے کا پختہ ارادہ نہ کرے،اس کا کوئی روزہ نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2454) ترمذي (730) نسائي (2333)<br>الزھري مدلس وعنعن <br>وأخرج النسائي (2338) بإسناد صحیح کالشمس عن حفصۃ قالت: ’’لاصیام لمن لم یجمع قبل الفجر ‘‘ موقوف`;
ibnemaja.anwaar = [441,1];