var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو الْقَارِيِّ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ لَا وَرَبِّ الْكَعْبَةِ مَا أَنَا قُلْتُ مَنْ أَصْبَحَ وَهُوَ جُنُبٌ فَلْيُفْطِرْ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَهُ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رب کعبہ کی قسم! یہ بات میں (اپنی طرف سے) نہیں کہتا،محمد ﷺ نے یہ فرمایا ہے: ’’جسے جنابت کی حالت میں صبح ہو جائے،وہ روزہ چھوڑ دے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;