var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ بْنُ سَعِيدٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَأَبُو دَاوُدَ قَالُوا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ الْأَبَدَ فَلَا صَامَ وَلَا أَفْطَرَ";
ibnemaja.urdu = "عبداللہ بن شخیر رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جس نے ہمیشہ روزے رکھے،اس نے نہ روزہ رکھا،نہ افطار کیا۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;