var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ وَسُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي الْعَبَّاسِ الْمَكِّيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَامَ مَنْ صَامَ الْأَبَدَ";
ibnemaja.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے ہمیشہ روزہ رکھا،اس نے روزہ رکھا ہی نہیں۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;