var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ فَذَلِكَ صَوْمُ الدَّهْرِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ تَصْدِيقَ ذَلِكَ فِي كِتَابِهِ مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا(الانعام:160) فَالْيَوْمُ بِعَشْرَةِ أَيَّامٍ";
ibnemaja.urdu = "ابو ذر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے ہر مہینے میں تین روزے رکھے تو یہی ہمیشہ کے روزے ہیں۔‘‘ اللہ تعالیٰ نے اپنی کتاب میں اس کی تائید نازل فرما دی: (مَنْ جَاءَ بِالْحَسَنَۃِ فَلَہُ عَشْرُ أَمْثَالِہَا) ’’جو شخص نیکی لے کر حاضر ہوا،اس کے لیے اس کا دس گنا (ثواب) ہے۔‘‘ چنانچہ ایک دن(کے روزے) سے دس دن کا ثواب ملتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (762) نسائي (2411)`;
ibnemaja.anwaar = [441,1];