var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ يَزِيدَ الرِّشْكِ عَنْ مُعَاذَةَ الْعَدَوِيَّةِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ قُلْتُ مِنْ أَيِّهِ قَالَتْ لَمْ يَكُنْ يُبَالِي مِنْ أَيِّهِ كَانَ";
ibnemaja.urdu = "معاذہ عدوہ رحمہ اللہ عائشہ رضی اللہ عنہا سے روایت کرتی ہیں،انہوں نے فرمایا: رسول اللہ ﷺ ہر مہینے میں تین روزے رکھتےتھے،(معاذہ عدویہ رحمہا اللہ نے بیان کیا) میں نے کہا: مہینے کے کس حصے میں؟ انہوں نے کہا:نبی ﷺ اس بات کی پرواہ نہیں کرتے تھے کہ کون سے حصے میں (روزے رکھے) ہیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;