var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَسُوَيْدُ بْنُ سَعِيدٍ،قَالَا: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيَقْرَأَنَّ الْقُرْآنَ نَاسٌ مِنْ أُمَّتِي،يَمْرُقُونَ مِنَ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ میری امت کے کچھ لوگ قرآن پڑھیں گے۔(اس کے باوجود) وہ اسلام سے اس طرح نکل جائیں گے جس طرح نشانہ بننے والے جانور میں سے تیر آر پار ہوتا ہے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;