var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لَا يَصُومُ وَمَا صَامَ شَهْرًا مُتَتَابِعًا إِلَّا رَمَضَانَ مُنْذُ قَدِمَ الْمَدِينَةَ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ (مسلسل) روزے رکھتے تھے حتی کہ ہم کہتے: آپ افطار نہیں کریں گے۔اور افطار کرتے حتی کہ ہم کہتے: آپ روزے نہیں رکھیں گے،اور آپ ﷺ جب سے مدینہ تشریف لائے،آپ نے رمضان کے سوا کبھی مسلسل ایک مہینہ روزے نہیں رکھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;