var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ سَعْدِ بْنِ سَعِيدٍ عَنْ عُمَرَ بْنِ ثَابِتٍ عَنْ أَبِي أَيُّوبَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ بِسِتٍّ مِنْ شَوَّالٍ كَانَ كَصَوْمِ الدَّهْرِ";
ibnemaja.urdu = "ابو ایوب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺنے فرمایا: ’’جس شخص نے رمضان کے روزے رکھے،پھر اس کے بعد شوال میں چھ روزے بھی رکھ لیے تو اس نے گویا زمانے بھر روزے رکھے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;