var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ الْهَادِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ النَّارَ مِنْ وَجْهِهِ سَبْعِينَ خَرِيفًا";
ibnemaja.urdu = "ابو سعید خدری رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص اللہ کی راہ میں ایک دن روزہ رکھے گا اللہ تعالیٰ اس دن کی وجہ سے اس کے چہرے سے جہنم کو ستر سال کے فاصلے تک دور کر دے گا۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;