var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْعَزِيزِ اللَّيْثِيُّ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ زَحْزَحَ اللَّهُ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص اللہ کی راہ میں ایک دن روزہ رکھے گا،اللہ تعالیٰ اس کے چہرے کو جہنم سے ستر سال کے فاصلے تک دور کر دے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد اللّٰہ بن عبدالعزیز اللیثي ضعیف واختلط بأخرۃ (تقریب:3444) <br>و قال الھیثمي: وقد ضعفہ الجمھور (مجمع الزوائد 89/7،362/9) <br>والحدیث السابق (الأصل: 1717) یغني عنہ`;
ibnemaja.anwaar = [441,1];