var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ بِشْرِ بْنِ سُحَيْمٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ أَيَّامَ التَّشْرِيقِ فَقَالَ لَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُسْلِمَةٌ وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ";
ibnemaja.urdu = "بشر بن سحیم رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ایام تشریق میں خطبہ ارشاد فرمایا،(اس خطبے کے دوران میں) آپ نے فرمایا: ’’جنت میں صرف مسلمان جان ہی داخل ہوگی۔اور یہ ایام کھانے پینے کے دن ہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;