var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى التَّيْمِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ صَوْمِ يَوْمِ الْفِطْرِ وَيَوْمِ الْأَضْحَى";
ibnemaja.urdu = "ابو سعید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے عید الفطر اورعید الاضحیٰ کے دن روزہ رکھنے سے منع فرمایا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;