var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَحَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ يَوْمِ الْجُمُعَةِ إِلَّا بِيَوْمٍ قَبْلَهُ أَوْ يَوْمٍ بَعْدَهُ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے کہا: رسول اللہ ﷺ نے جمعے کے دن کا روزہ رکھنے سے منع فرمایا ہے،سوائے اس صورت کے کہ اس سے ایک دن پہلے یا ایک دن بعد بھی روزہ رکھ لیا جائے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;