var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرِ بْنِ شَيْبَةَ عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ قَالَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ وَأَنَا أَطُوفُ بِالْبَيْتِ أَنَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صِيَامِ يَوْمِ الْجُمُعَةِ قَالَ نَعَمْ وَرَبِّ هَذَا الْبَيْتِ";
ibnemaja.urdu = "محمد بن عباد بن جعفر رحمہ اللہ سے روایت ہے کہ انہوں نے کہا: میں بیت اللہ کا طواف کر رہا تھا،اس دوران میں میں نے جابر بن عبداللہ رضی اللہ عنہما سے سوال کیا: کیا نبی ﷺ نے جمعے کا روزہ رکھنے سے منع فرمایا ہے؟ انہوں نے فرمایا: ہاں،قسم ہے اس گھر کے رب کی!";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;