var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُمَرُ بْنُ شَبَّةَ بْنِ عَبِيدَةَ حَدَّثَنَا مَسْعُودُ بْنُ وَاصِلٍ عَنْ النَّهَّاسِ بْنِ قَهْمٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ أَيَّامِ الدُّنْيَا أَيَّامٌ أَحَبُّ إِلَى اللَّهِ سُبْحَانَهُ أَنْ يُتَعَبَّدَ لَهُ فِيهَا مِنْ أَيَّامِ الْعَشْرِ وَإِنَّ صِيَامَ يَوْمٍ فِيهَا لَيَعْدِلُ صِيَامَ سَنَةٍ وَلَيْلَةٍ فِيهَا بِلَيْلَةِ الْقَدْرِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دنیا کے دنوں میں کوئی دن ایسا نہیں جس میں عبادت کرنا اللہ کو ان دس دنوں کی عبادت سے زیادہ محبوب ہو۔ان میں ایک دن کا روزہ سال بھر کے روزوں کے برابر ہے۔اور ان کی ایک ایک رات شب قدر کے برابر ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (758)`;
ibnemaja.anwaar = [441,1];