var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِيَامُ يَوْمِ عَرَفَةَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ وَالَّتِي بَعْدَهُ";
ibnemaja.urdu = "ابو قتادہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’عرفے کے دن کے روزے کی وجہ سے میں اللہ سے امید رکھتا ہوں کہ وہ اس سے پہلے سال بھرکے اور اس کے بعد کے سال بھر کے گناہ معاف فرما دے گا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;