var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ قَتَادَةَ بْنِ النُّعْمَانِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَامَ يَوْمَ عَرَفَةَ غُفِرَ لَهُ سَنَةٌ أَمَامَهُ وَسَنَةٌ بَعْدَهُ";
ibnemaja.urdu = "قتادہ بن نعمان رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا،آپ فرما رہے تھے: ’’جس شخص نے عرفے کے دن روزہ رکھا،اس کے ایک سال آگے اور ایک سال پیچھے کے گناہ معاف ہو جائیں گے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>إسحاق بن عبد اللّٰہ بن أبي فروۃ: متروک <br>والحدیث السابق (الأصل: 1730) یغني عنہ`;
ibnemaja.anwaar = [441,1];