var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ عَاشُورَاءَ وَيَأْمُرُ بِصِيَامِهِ";
ibnemaja.urdu = "ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ عاشورا(دس محرم) کے دن روزہ رکھتے تھے،اور اس دن روزہ رکھنے کا حکم دیتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;