var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمُ عَاشُورَاءَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَوْمًا يَصُومُهُ أَهْلُ الْجَاهِلِيَّةِ فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَصُومَهُ فَلْيَصُمْهُ وَمَنْ كَرِهَهُ فَلْيَدَعْهُ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کے پاس عاشورا کے دن کا ذکر ہوا تو آپ نے فرمایا: ’’زمانہ جاہلیت کے لوگ اس دن روزہ رکھا کرتے تھے،چنانچہ اب جو شخص اس کا روزہ رکھنا چاہتا ہے رکھ لے اور جو شخص روزہ نہیں رکھنا چاہتا،چھوڑ دے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;