var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِيَامُ يَوْمِ عَاشُورَاءَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ";
ibnemaja.urdu = "ابو قتادہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’عاشورا کے دن کے روزے سے،میں اللہ سے اس قدر ثواب کی امید رکھتا ہوں کہ اس سے پہلے ایک سال کے گناہ معاف فرمادے گا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;