var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ رَبِيعَةَ بْنِ الْغَازِ أَنَّهُ سَأَلَ عَائِشَةَ عَنْ صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ يَتَحَرَّى صِيَامَ الِاثْنَيْنِ وَالْخَمِيسِ";
ibnemaja.urdu = "ربیعہ بن غاز رحمہ اللہ سے روایت ہے کہ انہوں نے عائشہ رضی اللہ عنہا سے رسول اللہ ﷺ کے روزوں کے متعلق دریافت کیا تو ام المومنین نے فرمایا: آپ سوموار اور جمعرات کے روزے کا اہتمام فرماتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;