var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيُّ الصِّيَامِ أَفْضَلُ بَعْدَ شَهْرِ رَمَضَانَ قَالَ شَهْرُ اللَّهِ الَّذِي تَدْعُونَهُ الْمُحَرَّمَ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: ایک آدمی نے نبی ﷺ کی خدمت میں حاضر ہو کر کہا: ماہ رمضان کے بعد کون سے روزے افضل ہیں؟ آپ ﷺ نے فرمایا: ’’اللہ کے اس مہینے کے،جسے تم لوگ محرم کہتے ہو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;