var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا دَاوُدُ بْنُ عَطَاءٍ حَدَّثَنِي زَيْدُ بْنُ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ عَنْ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ رَجَبٍ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے رجب میں روزے رکھنے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>داود بن عطاء: ضعیف`;
ibnemaja.anwaar = [442,1];