var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ أَنَّ أُسَامَةَ بْنَ زَيْدٍ كَانَ يَصُومُ أَشْهُرَ الْحُرُمِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ شَوَّالًا فَتَرَكَ أَشْهُرَ الْحُرُمِ ثُمَّ لَمْ يَزَلْ يَصُومُ شَوَّالًا حَتَّى مَاتَ";
ibnemaja.urdu = "محمد بن ابراہیم رحمہ اللہ سے روایت ہے کہ اسامہ بن زید رضی اللہ عنہما حرمت والے مہینوں کے روزے رکھتے تھے۔رسول اللہ ﷺ نے انہیں فرمایا: ’’شوال کے مہینے کے روزے رکھو۔‘‘ چنانچہ انہوں نے حرمت والے مہینوں کے روزے چھوڑ دیے اور وفات تک شوال میں روزے رکھتے رہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>محمد بن إبراہیم التیمي أرسل عن أسامۃ بن زید وأسید بن حضیر ولم یسمع منھما(جامع التحصیل ص 261)`;
ibnemaja.anwaar = [442,1];