var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ ح و حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ جَمِيعًا عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ جُمْهَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكُلِّ شَيْءٍ زَكَاةٌ وَزَكَاةُ الْجَسَدِ الصَّوْمُ زَادَ مُحْرِزٌ فِي حَدِيثِهِ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصِّيَامُ نِصْفُ الصَّبْرِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’ہر چیز کی زکاۃ ہوتی ہے،اور جسم کی زکاۃ روزہ ہے۔‘‘ ایک روایت کے راوی محرز نے یہ اضافہ بیان کیا ہے کہ رسول اللہ ﷺ نے فرمایا: ’’روزہ آدھا صبر ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>موسی بن عبیدۃ: ضعیف <br>وللحدیث طرق لا یصح منھا شئ`;
ibnemaja.anwaar = [442,1];