var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي لَيْلَى وَخَالِي يَعْلَى عَنْ عَبْدِ الْمَلِكِ وَأَبُو مُعَاوِيَةَ عَنْ حَجَّاجٍ كُلُّهُمْ عَنْ عَطَاءٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَطَّرَ صَائِمًا كَانَ لَهُ مِثْلُ أَجْرِهِمْ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْئًا";
ibnemaja.urdu = "زید بن خالد جہنی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے روزے دار کا روزہ افطار کرایا،اسے اس(روزے داروں) کے برابر ثواب ملے گا،لیکن ان کے ثواب میں کچھ کمی نہیں ہوگی۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;