var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ إِنِّي صَائِمٌ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جب تم میں سے کسی کو کھانے کی دعوت دی جائے اور وہ روزے سے ہو تو اسے چاہیے کہ کہہ دے: میں روز ے سے ہوں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;