var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ حَدَّثَنَا أَبُو عَاصِمٍ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ دُعِيَ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيُجِبْ فَإِنْ شَاءَ طَعِمَ وَإِنْ شَاءَ تَرَكَ";
ibnemaja.urdu = "جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جسے کھانے کی دعوت دی جائے اور وہ روزے سے ہو تو اسے چاہیے کہ دعوت قبول کر لے،پھر چاہے کھانا کھائے چاہے نہ کھائے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;