var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا هُشَيْمٌ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْرُجُ يَوْمَ الْفِطْرِ حَتَّى يَطْعَمَ تَمَرَاتٍ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ عید الفطر کے دن اس وقت تک(نماز عید کے لیے) نہیں نکلتے تھے جب تک چند کھجوریں نہ کھالیتے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;