var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا مَنْدَلُ بْنُ عَلِيٍّ حَدَّثَنَا عُمَرُ بْنُ صَهْبَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْدُو يَوْمَ الْفِطْرِ حَتَّى يُغَذِّيَ أَصْحَابَهُ مِنْ صَدَقَةِ الْفِطْرِ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ عید الفطر کے دن نکلنے سے پہلے صحابہ کرام کو صدقہ فطر میں سے کچھ کھلالیتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>جبارۃ و مندل: مجروحان <br>وعمر بن صھبان: ضعیف (تقریب: 4923)`;
ibnemaja.anwaar = [442,1];