var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا ثَوَابُ بْنُ عُتْبَةَ الْمَهْرِيُّ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَخْرُجُ يَوْمَ الْفِطْرِ حَتَّى يَأْكُلَ وَكَانَ لَا يَأْكُلُ يَوْمَ النَّحْرِ حَتَّى يَرْجِعَ";
ibnemaja.urdu = "بریدہ بن حصیب اسلمی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ عید الفطر کے دن کچھ کھائے بغیر(عید کے لیے) نہیںنکلتے تھے اور قریبانی کے دن(نماز عید سے) واپسی تک نہیں کھاتے تھے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;