var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْثَرُ عَنْ أَشْعَثَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ وَعَلَيْهِ صِيَامُ شَهْرٍ فَلْيُطْعَمْ عَنْهُ مَكَانَ كُلِّ يَوْمٍ مِسْكِينٌ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص اس حال میں فوت ہو جائے کہ اس کے ذمے ماہ رمضان کے روزے ہوں تو اس کی طرف سے ہر دن (کے روزے) کی جگہ ایک مسکین کو کھانا کھلادیا جائے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (718)`;
ibnemaja.anwaar = [442,1];