var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ جَاءَتْ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا صَوْمٌ أَفَأَصُومُ عَنْهَا قَالَ نَعَمْ";
ibnemaja.urdu = "بریدہ بن حصیب رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا: ایک خاتون نے نبی ﷺ کی خدمت میں حاضر ہو کر عرض کی: اے اللہ کے رسول! میری والدہ فوت ہوگئی اور ان کے ذمے روزے تھے۔کیا میں ان کی طرف سے روزے رکھوں؟ آپ ﷺ نے فرمایا: ’’ہاں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;