var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سُلَيْمَانَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النِّسَاءَ أَنْ يَصُمْنَ إِلَّا بِإِذْنِ أَزْوَاجِهِنَّ";
ibnemaja.urdu = "ابو سعید رضی اللہ عنہ سے روایت ہے انہوں نے کہا: رسول اللہ ﷺ نے عورتوں کو اپنے خاوندوں کی اجازت کے بغیر روزہ رکھنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2459)`;
ibnemaja.anwaar = [443,1];