var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْأَزْدِيُّ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ وَخَالِدُ بْنُ أَبِي يَزِيدَ قَالَا حَدَّثَنَا أَبُو بَكْرٍ الْمَدَنِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَزَلَ الرَّجُلُ بِقَوْمٍ فَلَا يَصُومُ إِلَّا بِإِذْنِهِمْ";
ibnemaja.urdu = "ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے نبی ﷺ نے فرمایا:’’جب کوئی شخص کچھ لوگوں کا مہمان ہو تو ان کی اجازت کے بغیر روزہ نہ رکھے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>ترمذي (789)`;
ibnemaja.anwaar = [443,1];