var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الْأُمَوِيِّ عَنْ مَعْنِ بْنِ مُحَمَّدٍ عَنْ حَنْظَلَةَ بْنِ عَلِيٍّ الْأَسْلَمِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ الطَّاعِمُ الشَّاكِرُ بِمَنْزِلَةِ الصَّائِمِ الصَّابِرِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’کھانے والا شکر گزار صبر کرنے والے روزے دار کے درجے میں ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;