var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي حُرَّةَ عَنْ عَمِّهِ حَكِيمِ بْنِ أَبِي حُرَّةَ عَنْ سِنَانِ بْنِ سَنَّةَ الْأَسْلَمِيِّ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الطَّاعِمُ الشَّاكِرُ لَهُ مِثْلُ أَجْرِ الصَّائِمِ الصَّابِرِ";
ibnemaja.urdu = "نبی ﷺ کے صحابی سنان بن سَنَّہ اسلمی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کھانے والے شکر گزار کے لیے صبر کرنے والے روزہ دار جتنا ثواب ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;