var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ اعْتَكَفْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَشْرَ الْأَوْسَطَ مِنْ رَمَضَانَ فَقَالَ إِنِّي أُرِيتُ لَيْلَةَ الْقَدْرِ فَأُنْسِيتُهَا فَالْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ فِي الْوَتْرِ";
ibnemaja.urdu = "ابو سعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم نے رسول اللہ ﷺ کے ساتھ رمضان کے درمیانی عشرے کا اعتکاف کیا،پھر آپ نے فرمایا: ’’مجھے شب قدر دکھائی گئی تھی،پھر بھلا دی گئی۔اسے آخری دہائی کی طاق راتوں میں تلاش کرو۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;