var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ وَأَبُو إِسْحَقَ الْهَرَوِيُّ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ قَالَا حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ مَا لَا يَجْتَهِدُ فِي غَيْرِهِ";
ibnemaja.urdu = "ام المومنین عائشہ صدیقہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: نبی ﷺ آخری دس دنوں میں اتنی محنت کرتے تھے جتنی اور دنوں میں نہیں کرتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;