var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عُبَيْدِ بْنِ نِسْطَاسٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَتْ الْعَشْرُ أَحْيَا اللَّيْلَ وَشَدَّ الْمِئْزَرَ وَأَيْقَظَ أَهْلَهُ";
ibnemaja.urdu = "ام المومنین عائشہ صدیقہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: جب آخری عشرہ شروع ہوتا تو نبی ﷺ راتوں کو جاگتے،کمر کس لیتے اور گھر والوں کو بھی بیدار کرتے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;