var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَبِي رَافِعٍ عَنْ أُبَيِّ بْنِ كَعْبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ فَسَافَرَ عَامًا فَلَمَّا كَانَ مِنْ الْعَامِ الْمُقْبِلِ اعْتَكَفَ عِشْرِينَ يَوْمًا";
ibnemaja.urdu = "ابی بن کعب رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ رمضان کے آخری عشرے کا اعتکاف کیا کرتے تھے۔ایک سال آپ ﷺ (آخری عشرے کے دوران میں) سفر میں تھے تو جب اگلا سال آیا آپ نے بیس دس اعتکاف کیا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;