var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْخَطْمِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ أَنَّهُ كَانَ عَلَيْهِ نَذْرُ لَيْلَةٍ فِي الْجَاهِلِيَّةِ يَعْتَكِفُهَا فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ أَنْ يَعْتَكِفَ";
ibnemaja.urdu = "عمر رضی اللہ عنہ سے روایت ہے کہ انہوں نے قبول اسلام سے پہلے ایک رات کے اعتکاف کی نذر مانی تھی (جو اسلام لانے تک پوری نہ کر سکے تھے)،چنانچہ انہوں نے نبی ﷺ سے مسئلہ دریافت کیا تو آپ ﷺ نے انہیں اعتکاف کرنے کا حکم دیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;