var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَنْبَأَنَا يُونُسُ أَنَّ نَافِعًا حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ قَالَ نَافِعٌ وَقَدْ أَرَانِي عَبْدُ اللَّهِ بْنُ عُمَرَ الْمَكَانَ الَّذِي كَانَ يَعْتَكِفُ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ رمضان کے آخری دس دن اعتکاف کیا کرتے تھے۔نافع رحمہ اللہ نے فرمایا: عبداللہ بن عمر رضی اللہ عنہما نے مجھے وہ جگہ دکھائی تھی جہاں رسول اللہ ﷺ اعتکاف کیا کرتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;