var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ عِيسَى بْنِ عُمَرَ بْنِ مُوسَى عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا اعْتَكَفَ طُرِحَ لَهُ فِرَاشُهُ أَوْ يُوضَعُ لَهُ سَرِيرُهُ وَرَاءَ أُسْطُوَانَةِ التَّوْبَةِ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ جب اعتکاف کرتے تو ستون توبہ کے قریب آپ کا بستر بچھا دیا جاتا،یا آپ کی چار پائی وہاں بچھا دی جاتی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;