var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنْصُورٍ أَبُو بَكْرٍ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْهَيَّاجُ الْخُرَاسَانِيُّ حَدَّثَنَا عَنْبَسَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْخَالِقِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُعْتَكِفُ يَتْبَعُ الْجِنَازَةَ وَيَعُودُ الْمَرِيضَ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اعتکاف والا جنازے کے ساتھ جا سکتا ہے اور بیمار کی بیمار پرسی کر سکتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع <br>عنبسۃ: متہم بوضع الحدیث <br>وعبد الخالق: مجہول (تقریب:3779)`;
ibnemaja.anwaar = [443,1];