var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُدْنِي إِلَيَّ رَأْسَهُ وَهُوَ مُجَاوِرٌ فَأَغْسِلُهُ وَأُرَجِّلُهُ وَأَنَا فِي حُجْرَتِي وَأَنَا حَائِضٌ وَهُوَ فِي الْمَسْجِدِ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ اعتکاف بیٹھے ہوتے تو اپنا سر میرے قریب کر دیتے،میں آپ ﷺ کا سر مبارک دھو کر کنگھی کر دیتی،میں اپنے حجرے میں ہوتی تھی اور ایام سے ہوتی تھی اور آپ ﷺ مسجد میں ہوتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;