var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ عِيسَى الرَّمْلِيُّ،عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تُضَامُونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ؟» قَالُوا: لَا،قَالَ: «فَكَذَلِكَ لَا تُضَامُونَ فِي رُؤْيَةِ رَبِّكُمْ يَوْمَ الْقِيَامَةِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:‘‘ کیا تمہیں چودھویں رات کو چاند دیکھنے میں مشقت ہوتی ہے۔’’صحابہ نے کہا: جی نہیں۔فرمایا:‘‘ اسی طرح قیامت کے دن تمہیں اپنے رب کی زیارت میں کوئی مشکل نہیں ہوگی۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;