var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الصَّبَّاحُ حَدَّثَنَا عَفَّانُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عِكْرِمَةَ قَالَ قَالَتْ عَائِشَةُ اعْتَكَفَتْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةٌ مِنْ نِسَائِهِ فَكَانَتْ تَرَى الْحُمْرَةَ وَالصُّفْرَةَ فَرُبَّمَا وَضَعَتْ تَحْتَهَا الطَّسْتَ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کے ساتھ آپ کی ایک زوجہ محترمہ نے اعتکاف کیا۔انہیں سرخ اور زرد رنگ (کا استحاضہ) آتا تھا۔بعض اوقات وہ اپنے نیچے چوڑا برتن رکھ لیا کرتی تھیں۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;