var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ حَدَّثَنَا مُحَمَّدُ بْنُ أُمَيَّةَ حَدَّثَنَا عِيسَى بْنُ مُوسَى الْبُخَارِيُّ عَنْ عُبَيْدَةَ الْعَمِّيِّ عَنْ فَرْقَدٍ السَّبَخِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمُعْتَكِفِ هُوَ يَعْكِفُ الذُّنُوبَ وَيُجْرَى لَهُ مِنْ الْحَسَنَاتِ كَعَامِلِ الْحَسَنَاتِ كُلِّهَا";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے اعتکاف کرنے والے کے بارے میں فرمایا:’’وہ گناہوں کو روک دیتا ہے۔اور اس کے لیے ساری نیکیاں انجام دینے والے کی طرح نیکیاں جاری کی جاتی ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبیدۃ بن بلال: مجہول الحال (تقریب: 4407) <br>وفرقد ضعیف<br>والحدیث ضعفہ البوصیري لضعف فرقد السبخي`;
ibnemaja.anwaar = [443,1];