var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو أَحْمَدَ الْمَرَّارُ بْنُ حَمُّويَةَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ ثَوْرِ بْنِ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ أَبِي أُمَامَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ لَيْلَتَيْ الْعِيدَيْنِ مُحْتَسِبًا لِلَّهِ لَمْ يَمُتْ قَلْبُهُ يَوْمَ تَمُوتُ الْقُلُوبُ";
ibnemaja.urdu = "ابو امامہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جس نے اللہ سے ثواب حاصل کرنے کی نیت سے عیدین کی دونوں راتوں میں قیام کیا،اس کا دل نہیں مرے گا،جس دن(لوگوں کے) دل مر جائیں گے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br> بقیۃ مدلس وعنعن <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [443,1];