var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ قَالَ: حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ قَالَ: حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ،عَنْ دَرَّاجٍ أَبِي السَّمْحِ،عَنِ ابْنِ حُجَيْرَةَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَدَّيْتَ زَكَاةَ مَالِكَ فَقَدْ قَضَيْتَ مَا عَلَيْكَ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: جب تو نے اپنے مال کی زکاۃ ادا کر دی تو اپنے فرض سے سبک دوش ہو گیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;