var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ آدَمَ،عَنْ شَرِيكٍ،عَنْ أَبِي حَمْزَةَ،عَنِ الشَّعْبِيِّ،عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ،أَنْهَا سَمِعَتْهُ تَعْنِي النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَيْسَ فِي الْمَالِ حَقٌّ سِوَى الزَّكَاةِ»";
ibnemaja.urdu = "حضرت فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے،انہوں نے نبی ﷺ کو فرماتے ہوئے سنا: زکاۃ کے سوا مال میں کوئی حق نہیں (جس کا ادا کرنا مالک پر فرض ہو۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (659،660)`;
ibnemaja.anwaar = [443,1];