var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي قَدْ عَفَوْتُ عَنْكُمْ عَنْ صَدَقَةِ الْخَيْلِ وَالرَّقِيقِ،وَلَكِنْ هَاتُوا رُبُعَ الْعُشْرِ،مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمًا»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: میں نے تمہیں گھوڑوں اور غلاموں کا صدقہ معاف کر دیا ہے لیکن (نقدی میں سے) چالیسواں حصہ ادا کرو،یعنی ہر چالیس درہم میں سے اہک درہم۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (1574) ترمذي (620)`;
ibnemaja.anwaar = [443,1];