var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ،وَمُحَمَّدُ بْنُ يَحْيَى،قَالَا: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ: أَنْبَأَنَا إِبْرَاهِيمُ بْنُ إِسْمَاعِيلَ،عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ،عَنِ ابْنِ عُمَرَ،وَعَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«كَانَ يَأْخُذُ مِنْ كُلِّ عِشْرِينَ دِينَارًا فَصَاعِدًا نِصْفَ دِينَارٍ،وَمِنَ الْأَرْبَعِينَ دِينَارًا دِينَارًا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر اور حضرت عائشہ رضی اللہ عنھم سے روایت ہے کہ نبی ﷺ ہر بیس دینار یا (اس سے کچھ) زیادہ،میں سے آدھا دینار اور چالیس دینار میں سے ایک دینار وصول فرماتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إبراہیم بن إسماعیل بن مجمع ضعیف <br>و للحدیث شواھد ضعیفۃ عند أبي داود (1573) وغیرہ`;
ibnemaja.anwaar = [443,1];