var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ قَالَ: حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ قَالَ: حَدَّثَنَا حَارِثَةُ بْنُ مُحَمَّدٍ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،قَالَتْ: سَمِعْتُ رَسُول اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا زَكَاةَ فِي مَالٍ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،وہ فرماتی ہیں: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: کسی مال میں زکاۃ نہیں حتی کہ اس پر سال گزر جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حارثۃ بن محمد ھو ابن أبی الرجال: ضعیف <br>و للحدیث شواھد ضعیفۃ،انظر سنن أبي داود (1573)`;
ibnemaja.anwaar = [444,1];