var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ قَالَ: حَدَّثَنِي الْوَلِيدُ بْنُ كَثِيرٍ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ،عَنْ يَحْيَى بْنِ عُمَارَةَ،وَعَبَّادِ بْنِ تَمِيمٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «لَا صَدَقَةَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ مِنَ التَّمْرِ،وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ،وَلَا فِيمَا دُونَ خَمْسٍ مِنَ الْإِبِلِ»";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے نبی ﷺ سے یہ فرمان سنا: پانچ وسق کھجوروں سے کم میں زکاۃ نہیں،پانچ اوقیہ (چاندی) سے کم میں زکاۃ نہیں اور پانچ سے کم اونٹوں میں بھی نہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;