var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ،وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ،وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ صَدَقَةٌ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: پانچ سے کم اونٹوں میں زکاۃ نہیں،پانچ اوقیہ سے کم (چاندی) میں زکاۃ نہیں،پانچ وسق سے کم(غلے) میں زکاۃ نہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;