var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا،عَنْ حَجَّاجِ بْنِ دِينَارٍ،عَنِ الْحَكَمِ،عَنْ حُجَيَّةَ بْنِ عَدِيٍّ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،أَنَّ الْعَبَّاسَ،«سَأَلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ،فَرَخَّصَ لَهُ فِي ذَلِكَ»";
ibnemaja.urdu = "حضرت علی بن ابو طالب رضی اللہ عنہ سے روایت ہے کہ حضرت عباس رضی اللہ عنہ نے واجب ہونے سے پہلے جلدی کرتے ہوئے زکاۃ ادا کرنے کی اجازت مانگی تو آپ ﷺ نے انہیں اجازت دے دی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (1624) ترمذي (678)`;
ibnemaja.anwaar = [444,1];