var ibnemaja = {};
ibnemaja.arabic = "عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ شُعْبَةَ،عَنْ عَمْرِو بْنِ مُرَّةَ،قَالَ: سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى،يَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،إِذَا أَتَاهُ الرَّجُلُ بِصَدَقَةِ مَالِهِ،صَلَّى عَلَيْهِ،فَأَتَيْتُهُ بِصَدَقَةِ مَالِي،فَقَالَ: «اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى»";
ibnemaja.urdu = "حضرت عبداللہ بن ابی اوفیٰ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جب کوئی شخص رسول اللہ ﷺ کی خدمت میں اپنے مال کا صدقہ (زکاۃ) لے کر حاضر ہوتا تو نبی ﷺ اس کو دعا دیتے۔میں اپنے مال کی زکاۃ لے کر رسول اللہ ﷺ کی خدمت میں حاضر ہوا تو آپ نے فرمایا: اے اللہ! ابواوفیٰ کے خاندان پر رحمت نازل فرما۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;