var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنِ الْبَخْتَرِيِّ بْنِ عُبَيْدٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِذَا أَعْطَيْتُمُ الزَّكَاةَ فَلَا تَنْسَوْا ثَوَابَهَا،أَنْ تَقُولُوا: اللَّهُمَّ اجْعَلْهَا مَغْنَمًا،وَلَا تَجْعَلْهَا مَغْرَمًا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب تم زکاۃ دو تو اس کا ثواب (حاصل ہونے کی دعا کرنا) فراموش نہ کرو۔یوں کہو: (اللہم اجعلنا مغنما ولا تجعلہا مغرما) اے اللہ! اسے فائدے کی چیز بنا اور تاوان نہ بنانا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع<br>البختري بن عبید: ضعیف متروک <br>وقال الحاکم: ’’ روی عن أبیہ عن أبي ہریرۃ أحادیث موضوعۃ ‘‘ (المدخل إلی الصحیح ص 124)`;
ibnemaja.anwaar = [444,1];