var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ إِسْرَائِيلَ،عَنْ جَابِرٍ،عَنْ عَامِرٍ،عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَرْجِعُ الْمُصَدِّقُ إِلَّا عَنْ رِضًا»";
ibnemaja.urdu = "حضرت جریر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: زکاۃ وصول کرنے والا تمہارے پاس سے خوش ہو کر واپس جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>جابر الجعفي ضعیف رافضي <br>و تابعہ مجالد: ضعیف (11) عند الطبراني (2362) و روی مسلم (989) عن رسول اللّٰہ ﷺ قال: ((أرضوا مصدقیکم)) وھو یغني عنہ`;
ibnemaja.anwaar = [444,1];