var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ عِيسَى الرَّمْلِيُّ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ شَقِيقٍ،عَنْ مَسْرُوقٍ،عَنْ مُعَاذِ بْنِ جَبَلٍ،قَالَ: «بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ،وَأَمَرَنِي أَنْ آخُذَ مِنَ الْبَقَرِ،مِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً،وَمِنْ كُلِّ ثَلَاثِينَ تَبِيعًا،أَوْ تَبِيعَةً»";
ibnemaja.urdu = "حضرت معاذ بن جبل رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے رسول اللہ ﷺ نے یمن بھیجا اور مجھے حکم دیا کہ میں گایوں میں ہر چالیس میں سے ایک دو دانت والی (گائے یا بیل) اور ہر تیس میں سے ایک سال کا ایک بچھڑا یا بچھڑی وصول کروں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1578) ترمذي (623) نسائي (2452)`;
ibnemaja.anwaar = [444,1];