var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ قَالَ: حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ،عَنْ خَصِيفٍ،عَنْ أَبِي عُبَيْدَةَ،عَنْ عَبْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «فِي ثَلَاثِينَ مِنَ الْبَقَرِ تَبِيعٌ،أَوْ تَبِيعَةٌ،وَفِي أَرْبَعِينَ مُسِنَّةٌ»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ہر تیس گایوں میں ایک سالہ بچھڑا یا بچھڑی (زکاۃ) ہے،اور چالیس پر دو دانت کا (دو سالہ جانور)۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (622)`;
ibnemaja.anwaar = [444,1];