var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَدْرٍ عَبَّادُ بْنُ الْوَلِيدِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ قَالَ: حَدَّثَنَا ابْنُ الْمُبَارَكِ،عَنْ أُسَامَةَ بْنِ زَيْدٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تُؤْخَذُ صَدَقَاتُ الْمُسْلِمِينَ عَلَى مِيَاهِهِمْ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مسلمانوں (کے جانوروں) کی زکاۃ پانی پلانے کی جگہ وصول کی جائے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;