var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ قَالَ: حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ سَعْدِ بْنِ سِنَانٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمُعْتَدِي فِي الصَّدَقَةِ كَمَانِعِهَا»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: زکاۃ کے معاملے میں زیادتی کرنے والا زکاۃ روک لینے والے کی طرح ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1585) ترمذي (642)`;
ibnemaja.anwaar = [444,1];