var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،وَمُحَمَّدُ بْنُ فُضَيْلٍ،وَيُونُسُ بْنُ بُكَيْرٍ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ،عَنْ مَحْمُودِ بْنِ لَبِيدٍ،عَنْ رَافِعِ بْنِ خَدِيجٍ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «الْعَامِلُ عَلَى الصَّدَقَةِ بِالْحَقِّ كَالْغَازِي فِي سَبِيلِ اللَّهِ،حَتَّى يَرْجِعَ إِلَى بَيْتِهِ»";
ibnemaja.urdu = "حضرت رافع بن خدیج رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا: آپ فرما رہے تھے: ھق کے ساتھ زکاۃ وصول کرنے والا،اللہ کی راہ میں جنگ کرنے والے کی طرح ہے حتی کہ گھر واپس آ جائے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;