var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ عِرَاكِ بْنِ مَالِكٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: مسلمان پر اس کے غلام میں اور اس کے گھوڑے میں صدقہ نہیں ہے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;