var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «تَجَوَّزْتُ لَكُمْ عَنْ صَدَقَةِ الْخَيْلِ وَالرَّقِيقِ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: میں نے تمہیں گھوڑوں اور غلاموں کی زکاۃ معاف کر دی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حارث الأعور ضعیف <br>و أبو إسحاق عنعن <br>وانظر الحدیث السابق (1790) <br>قلت: الحدیث السابق (الأصل: 1812) یغني عنہ`;
ibnemaja.anwaar = [444,2];