var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْمِصْرِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ،عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ مُعَاذِ بْنِ جَبَلٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ إِلَى الْيَمَنِ،وَقَالَ لَهُ: «خُذِ الْحَبَّ مِنَ الْحَبِّ،وَالشَّاةَ مِنَ الْغَنَمِ،وَالْبَعِيرَ مِنَ الْإِبِلِ،وَالْبَقَرَةَ مِنَ الْبَقَرِ»";
ibnemaja.urdu = "حضرت معاذ بن جبل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے انہیں (گورنر بنا کر) یمن روانہ کیا اور ان سے فرمایا: غلے میں سے غلہ وصول کرنا،بکریوں سے بکری،اونٹوں میں سے اونٹ اور گایوں میں سے گائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1599)`;
ibnemaja.anwaar = [445,1];