var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ،عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: إِنَّمَا سَنَّ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الزَّكَاةَ فِي هَذِهِ الْخَمْسَةِ: فِي الْحِنْطَةِ،وَالشَّعِيرِ،وَالتَّمْرِ،وَالزَّبِيبِ،وَالذُّرَةِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ان پانچ چیزوں کی زکاۃ کا حکم جاری فرمایا ہے: گندم،جو،منقیٰ اور مکئی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>محمد بن عبید اللّٰہ العرزمي: متروک`;
ibnemaja.anwaar = [445,1];