var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى أَبُو مُوسَى الْأَنْصَارِيُّ قَالَ: حَدَّثَنَا عَاصِمُ بْنُ عَبْدِ الْعَزِيزِ بْنِ عَاصِمٍ قَالَ: حَدَّثَنَا الْحَارِثُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي ذُبَابٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،وَعَنْ بُسْرِ بْنِ سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فِيمَا سَقَتِ السَّمَاءُ وَالْعُيُونُ الْعُشْرُ،وَفِيمَا سُقِيَ بِالنَّضْحِ نِصْفُ الْعُشْرِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: جو کھیتیاں بارش اور چشموں سے سیراب ہوں،ان میں سے دسواں حصہ ہے اور جسے پانی کھینچ کر دیا جائے،اس میں بیسواں حصہ (زکاۃ) ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;