var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْمِصْرِيُّ أَبُو جَعْفَرٍ قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي يُونُسُ،عَنِ ابْنِ شِهَابٍ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «فِيمَا سَقَتِ السَّمَاءُ وَالْأَنْهَارُ وَالْعُيُونُ،أَوْ كَانَ بَعْلًا،الْعُشْرُ،وَفِيمَا سُقِيَ بِالسَّوَانِي نِصْفُ الْعُشْرِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا،آپ فرما رہے تھے: جسے بارش،ندیوں اور چشموں سے پانی ملے،یا جو زمین کی نمی سے سیراب ہو،اس میں دسواں حصہ ہے،اور جسے جانوروں پر پانی لا کر سینچا جائے،اس میں بیسواں حصہ ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;