var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ،وَالزُّبَيْرُ بْنُ بَكَّارٍ،قَالَا: حَدَّثَنَا ابْنُ نَافِعٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ صَالِحٍ التَّمَّارُ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ عَتَّابِ بْنِ أَسِيدٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«كَانَ يَبْعَثُ عَلَى النَّاسِ مَنْ يَخْرُصُ عَلَيْهِمْ كُرُومَهُمْ وَثِمَارَهُمْ»";
ibnemaja.urdu = "حضرت عتاب بن اسید رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ لوگوں کے پاس آدمی بھیجتے تھے تو وہ ان کے انگوروں اور پھلوں (کی مقدار) کا اندازہ لگاتا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (163،1604) ترمذي (644) نسائي (2619)`;
ibnemaja.anwaar = [445,1];