var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ،عَنْ سُلَيْمَانَ بْنِ مُوسَى،عَنْ أَبِي سَيَّارَةَ الْمُتَعِيُّ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ،إِنَّ لِي نَحْلًا،قَالَ: «أَدِّ الْعُشْرَ»،قُلْتُ: يَا رَسُولَ اللَّهِ،احْمِهَا لِي،فَحَمَاهَا لِي";
ibnemaja.urdu = "حضرت ابوسیارہ متعی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے عرض کیا اے اللہ کے رسول! میرے پاس شہد کی مکھیاں ہیں۔آپ ﷺ نے فرمایا: دسواں حصہ (زکاۃ) ادا کرو۔میں نے عرض کیا: اے اللہ کے رسول! انہیں میرے لیے خاص کر دیجئے۔آپ ﷺ نے وہ میرے لیے خاص کر دیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف لانقطاعہ <br>و قال البخاري في ھذا الحدیث: ’’ ھو حدیث مرسل،سلیمان (بن موسی) لم یدرک أحدًا من أصحاب النبي ﷺ ‘‘ (علل الترمذی الکبیر 1/ 313 باب في زکوۃ العسل) <br>و الحدیث الآتي (الأصل: 1824،وسندہ حسن) یغني عنہ`;
ibnemaja.anwaar = [445,1];