var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ قَالَ: حَدَّثَنَا ابْنُ الْمُبَارَكِ قَالَ: حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَنَّهُ أَخَذَ مِنَ الْعَسَلِ الْعُشْرَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے نبی ﷺ نے شہد کا عشر وصول کیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;