var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ قَالَ: حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«أَمَرَ بِزَكَاةِ الْفِطْرِ صَاعًا مِنْ تَمْرٍ،أَوْ صَاعًا مِنْ شَعِيرٍ» قَالَ عَبْدُ اللَّهِ: «فَجَعَلَ النَّاسُ عِدْلَهُ مُدَّيْنِ مِنْ حِنْطَةٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے صدقہ فطر کے طور پر ایک صاع کھجور یا ایک صاع جو دینے کا حکم دیا۔\nحضرت عبداللہ رضی اللہ عنہ نے فرمایا: پھر لوگوں نے دو مد گندم کو اس کے برابر قرار دے لیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;