var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَفْصُ بْنُ عَمْرٍو قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: «فَرَضَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ،أَوْ صَاعًا مِنْ تَمْرٍ،عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ،ذَكَرٍ أَوْ أُنْثَى مِنَ الْمُسْلِمِينَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے مسلمانوں میں سے ہر آزاد،غلام،مرد اور عورت پر (فی کس) ایک صاع جو یا ایک صاع کھجوریں صدقہ فطر مقرر فرمایا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;