var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ،عَنْ أَبِي عَمَّارٍ،عَنْ قَيْسِ بْنِ سَعْدٍ،قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِصَدَقَةِ الْفِطْرِ قَبْلَ أَنْ تُنْزَلَ الزَّكَاةُ،فَلَمَّا نَزَلَتِ الزَّكَاةُ،لَمْ يَأْمُرْنَا،وَلَمْ يَنْهَنَا،وَنَحْنُ نَفْعَلُهُ»";
ibnemaja.urdu = "حضرت قیس بن سعد بن عبادہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: زکاۃ کا حکم نازل ہونے سے پہلے رسول اللہ ﷺ نے ہمیں صدقہ فطر ادا کرنے کا حکم دیا تھا۔جب زکاۃ کے احکام نازل ہو گئے تو آپ ﷺ نے ہمیں صدقہ فطر کا (دوبارہ) حکم نہیں دیا اور منع بھی نہیں فرمایا،البتہ ہم لوگ اس کی ادائیگی کرتے ہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;