var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارٍ الْمُؤَذِّنِ قَالَ: حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ،عَنْ عَمَّارِ بْنِ سَعْدٍ مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَمَرَ بِصَدَقَةِ الْفِطْرِ صَاعًا مِنْ تَمْرٍ،أَوْ صَاعًا مِنْ شَعِيرٍ،أَوْ صَاعًا مِنْ سُلْتٍ»";
ibnemaja.urdu = "رسول اللہ ﷺ کے مؤذن حضرت سعد القرظ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ایک صاع خشک کھجور یا ایک صاع جو یا ایک صاع سلت (ایک قسم کے جو) صدقہ فطر ادا کرنے کا حکم دیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;