var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ جُنَيْدٍ الدَّامَغَانِيُّ قَالَ: حَدَّثَنَا عَتَّابُ بْنُ زِيَادٍ الْمُرْوَزِيُّ قَالَ: حَدَّثَنَا أَبُو حَمْزَةَ قَالَ: سَمِعْتُ مُغِيرَةَ الْأَزْدِيَّ،يُحَدِّثُ عَنْ مُحَمَّدِ بْنِ زَيْدٍ،عَنْ حَيَّانَ الْأَعْرَجِ،عَنِ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ،قَالَ: «بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى الْبَحْرَيْنِ،أَوْ إِلَى هَجَرَ،فَكُنْتُ آتِي الْحَائِطَ يَكُونُ بَيْنَ الْإِخْوَةِ،يُسْلِمُ أَحَدُهُمْ،فَآخُذُ مِنَ الْمُسْلِمِ الْعُشْرَ،وَمِنَ الْمُشْرِكِ الْخَرَاجَ»";
ibnemaja.urdu = "حضرت علاء بن حضرمی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے رسول اللہ ﷺ نے بحرین یا ہجر (زکاۃ وصول کرنے کے لیے) بھیجا۔(بعض اوقات) میں ایک باغ میں پہنچتا جو کئی بھائیوں کی مشترکہ ملکیت ہوتا جن میں ایک بھائی مسلمان ہوتا تو میں مسلمان سے عشر وصول کرتا اور مشرک سے خراج۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>روایۃ حیان الأعرج عن العلاء مرسلۃ،قالہ البوصیري`;
ibnemaja.anwaar = [445,1];