var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ،عَنْ إِدْرِيسَ الْأَوْدِيِّ،عَنْ عَمْرِو بْنِ مُرَّةَ،عَنْ أَبِي الْبَخْتَرِيِّ،عَنْ أَبِي سَعِيدٍ،رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «الْوَسْقُ سِتُّونَ صَاعًا»";
ibnemaja.urdu = "حضرت ابوسعید رضی اللہ عنہ نے مرفوعا بیان کیا کہ نبی ﷺ نے فرمایا: وسق ساٹھ صاع کا ہوتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1559)`;
ibnemaja.anwaar = [445,1];