var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ،عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ،وَأَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْوَسْقُ سِتُّونَ صَاعًا»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: وسق ساٹھ صاع کا ہوتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>العرزمي محمد بن عبید اللّٰہ: متروک`;
ibnemaja.anwaar = [445,1];