var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ،عَنْ أَبِي زُرْعَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ النَّاسَ أَمْوَالَهُمْ تَكَثُّرًا،فَإِنَّمَا يَسْأَلُ جَمْرَ جَهَنَّمَ،فَلْيَسْتَقِلَّ مِنْهُ أَوْ لِيُكْثِرْ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص مال میں اضافہ کرنے کے لیے لوگوں سے ان کی دولت مانگتا ہے وہ تو جہنم کے انگاروں کا سوال کر رہا ہے۔(اسے اختیار ہے کہ) کم طلب کرے یا زیادہ مانگ لے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;