var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ أَبِي حُصَيْنٍ،عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ،وَلَا لِذِي مِرَّةٍ سَوِيٍّ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: صدقہ نہ مال دار کے لیے حلال ہے،اور نہ طاقت ور تندرست آدمی کے لیے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;