var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنِ ابْنِ عَوْنٍ،عَنْ حَفْصَةَ بِنْتِ سِيرِينَ،عَنِ الرَّبَابِ أُمِّ الرَّائِحِ بِنْتِ صُلَيْعٍ،عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ،وَعَلَى ذِي الْقَرَابَةِ اثْنَتَانِ: صَدَقَةٌ وَصِلَةٌ";
ibnemaja.urdu = "حضرت سلمان بن عامر ضبی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مسکین کو صدقہ دینا صدقہ ہے،اور رشتے داروں کو (صدقہ دینا) دو نیکیاں ہیں: صدقہ بھی،اور صلہ رحمی بھی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;