var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَيْسَرَةَ،عَنْ طَاوُسٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَمْ نَرَ-يُرَ-لِلْمُتَحَابَّيْنِ مِثْلُ النِّكَاحِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: آپس میں محبت رکھنے والوں کے لیے نکاح جیسی کوئی چیز نہیں دیکھی گئی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;