var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ سَعْدٍ،قَالَ: «لَقَدْ رَدَّ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ،وَلَوْ أَذِنَ لَهُ لَاخْتَصَيْنَا»";
ibnemaja.urdu = "حضرت سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے حضرت عثمان بن معظون رضی اللہ عنہ کو بے نکاح رہنے کی اجازت نہیں دی۔اگر آپ ﷺ انہیں اجازت دے دیتے تو ہم لوگ خصی ہو جاتے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;