var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمَ،عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِنَّمَا الدُّنْيَا مَتَاعٌ،وَلَيْسَ مِنْ مَتَاعِ الدُّنْيَا شَيْءٌ أَفْضَلَ مِنَ الْمَرْأَةِ الصَّالِحَةِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دنیا (عارضی) فائدے کی چیز ہے اور دنیا کے سازوسامان میں نیک عورت سے بہتر کوئی چیز نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد الرحمٰن بن زیاد بن أنعم الإفریقي ضعیف <br>و روی مسلم (1467): ((الدنیا متاع و خیر متاع الدنیا المرأۃ الصالحۃ)) و ھو یغني عنہ`;
ibnemaja.anwaar = [446,1];