var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ: لِمَالِهَا،وَلِحَسَبِهَا،وَلِجَمَالِهَا،وَلِدِينِهَا،فَاظْفَرْ بِذَاتِ الدِّينِ،تَرِبَتْ يَدَاكَ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: عورتوں سے چار چیزوں کی وجہ سے نکاح کیا جاتا ہے: (کسی سے) اس کے مال کی وجہ سے،(کسی سے) اس کے حسب و نسب کی وجہ سے،(کسی سے) اس کے حسن و جمال کی وجہ سے،(کسی سے) اس کی دینداری (اور نیکی) کی وجہ سے۔تو دین دار عورت (کے حصول میں) کامیاب ہو جا۔تیرا بھلا ہو۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;