var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ التَّيْمِيُّ قَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَالِمِ بْنِ عُتْبَةَ بْنِ عُوَيْمِ بْنِ سَاعِدَةَ الْأَنْصَارِيُّ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بِالْأَبْكَارِ،فَإِنَّهُنَّ أَعْذَبُ أَفْوَاهًا،وَأَنْتَقُ أَرْحَامًا،وَأَرْضَى بِالْيَسِيرِ»";
ibnemaja.urdu = "حضرت عتبہ بن عویم بن ساعدہ انصاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: کنواریوں سے نکاح کرو کیونکہ وہ شیریں دہن،زیاہد بچے پیدا کرنے والی،اور تھوڑی چیز پر راضی رہنے والی ہوتی ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>السند مرسل (انظر السنن الکبری للبیہقي 7/ 87) <br>وللحدیث شواہد ضعیفۃ،راجع التلخیص الحبیر (145/3)`;
ibnemaja.anwaar = [447,1];