var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَسَهْلُ بْنُ أَبِي سَهْلٍ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَخْطُبِ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: کوئی آدمی اپنے بھائی کے پیغام نکاح پر نکاح کا پیغام نہ بھیجے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;