var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ: حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ،وَلَا الْبِكْرُ حَتَّى تُسْتَأْذَنَ،وَإِذْنُهَا الصُّمُوتُ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: شوہر دیدہ کا نکاح اس سے مشورہ کیے بغیر نہ کیا جائے۔اور کنواری کا نکاح اس سے اجازت لیے بغیر نہ کیا جائے۔اور اس کی اجازت خاموش رہنا ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;