var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ،عَنْ عَدِيِّ بْنِ عَدِيٍّ الْكِنْدِيِّ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الثَّيِّبُ تُعْرِبُ عَنْ نَفْسِهَا،وَالْبِكْرُ رِضَاهَا صَمْتُهَا»";
ibnemaja.urdu = "حضرت عدی بن عدی کندی رحمۃ اللہ علیہ اپنے والد حضرت عدی بن عمیرہ رضی اللہ عنہ سے روایت کرتے ہوئے فرماتے ہیں،رسول اللہ ﷺ نے فرمایا: شوہر دیدہ اپنی رضامندی کا (زبان سے) اظہار کرے اور کنواری کی رضامندی (کی علامت) اس کا خاموش رہنا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عدي بن عدي لم یسمع من أبیہ کما قال أبو حاتم الرازي (کتاب المراسیل ص 152) <br>و الحدیث السابق (1870) یغني عنہ`;
ibnemaja.anwaar = [447,1];