var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ قَالَ: حَدَّثَنَا أَبُو أَحْمَدَ قَالَ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي عُبَيْدَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ: «تَزَوَّجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَائِشَةَ وَهِيَ بِنْتُ سَبْعٍ،وَبَنَى بِهَا وَهِيَ بِنْتُ تِسْعٍ،وَتُوُفِّيَ عَنْهَا وَهِيَ بِنْتُ ثَمَانِي عَشْرَةَ سَنَةً»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے حضرت عائشہ رضی اللہ عنہا سے نکاح کیا تو ان کی عمر سات برس تھی اور جب ان کی رخصتی ہوئی تو وہ نو سال کی تھیں۔جب رسول اللہ ﷺ کی وفات ہوئی تو ام المومنین کی عمر اٹھارہ سال تھی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;