var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ حَجَّاجٍ،عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وعَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا نِكَاحَ إِلَّا بِوَلِيٍّ»،وَفِي حَدِيثِ عَائِشَةَ: «وَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُ»";
ibnemaja.urdu = "ام المومنین حضرت عائشہ اور حضرت عبداللہ بن عباس رضی اللہ عنھم سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سرپرست (کی اجازت) کے بغیر نکاح نہیں ہوتا۔حضرت عائشہ رضی اللہ عنہا کی روایت میں یہ الفاظ بھی ہیں: جس کا ولی نہ ہو،بادشاہ اس کا ولی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;