var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ الْعُقَيْلِيُّ قَالَ: حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُزَوِّجُ الْمَرْأَةُ الْمَرْأَةَ،وَلَا تُزَوِّجُ الْمَرْأَةُ نَفْسَهَا،فَإِنَّ الزَّانِيَةَ هِيَ الَّتِي تُزَوِّجُ نَفْسَهَا»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: کوئی عورت کسی عورت کا نکاح نہ کرے،نہ عورت خود اپنا نکاح کرے۔بدکار عورت ہی اپنا نکاح خود کرتی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;