var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الشِّغَارِ،وَالشِّغَارُ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ: زَوِّجْنِي ابْنَتَكَ أَوْ أُخْتَكَ،عَلَى أَنْ أُزَوِّجَكَ ابْنَتِي أَوْ أُخْتِي،وَلَيْسَ بَيْنَهُمَا صَدَاقٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے نکاح شغار سے منع فرمایا ہے۔اور شغار یہ ہے کہ ایک شخص دوسرے سے کہے: تم مجھ سے اپنی بیٹی یا بہن کا نکاح کر دو،اس کے عوض میں تم سے اپنی بیٹی یا بہن کا نکاح کر دوں گا اور ان دونوں (عورتوں) کا حق مہر کچھ نہ ہو۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;