var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عُمَرَ الضَّرِيرُ،وَهَنَّادُ بْنُ السَّرِيِّ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ،عَنْ أَبِيهِ،«أَنَّ رَجُلًا مِنْ بَنِي فَزَارَةَ تَزَوَّجَ عَلَى نَعْلَيْنِ،فَأَجَازَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نِكَاحَهُ»";
ibnemaja.urdu = "حضرت عامر بن ربیعہ رضی اللہ عنہ سے روایت ہے کہ قبیلہ بنو فزارہ کے ایک آدمی نے جوتوں کا جوڑا حق مہر مقرر کر کے نکاح کیا۔نبی ﷺ نے اس کے نکاح کو صحیح قرار دے دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1113)`;
ibnemaja.anwaar = [447,1];