var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى،عَنِ ابْنِ عَجْلَانَ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ بِيَدِهِ قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ: رَحْمَتِي سَبَقَتْ غَضَبِي";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:‘‘ اللہ تعالیٰ نے مخلوقات کو پیدا کرنے سے پہلے اپنے ہاتھ سے اپنی ذات کے میں یہ تحریر فرما دیا ہے: میری رحمت میرے غضب سے بڑھ گئی۔’’";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;