var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ مُحَمَّدُ بْنُ يَزِيدَ قَالَ: حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ قَالَ: حَدَّثَنَا الْأَغَرُّ الرَّقَاشِيُّ،عَنْ عَطِيَّةَ الْعَوْفِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَ عَائِشَةَ عَلَى مَتَاعِ بَيْتٍ قِيمَتُهُ خَمْسُونَ دِرْهَمًا»";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے گھر کا کچھ سامان حق مہر مقرر کر کے حضرت عائشہ رضی اللہ عنہا سے نکاح فرمایا۔اس سامان کی قیمت پچاس درہم تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الأغر الرقاشي:مجہول (تقریب: 545) وشیخہ عطیۃ العوفي ضعیف مدلس`;
ibnemaja.anwaar = [447,1];