var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،وَالْخَلِيلُ بْنُ عَمْرٍو،قَالَا: حَدَّثَنَا عِيسَى بْنُ يُونُسَ،عَنْ خَالِدِ بْنِ إِلْيَاسَ،عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ،عَنِ الْقَاسِمِ،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَعْلِنُوا هَذَا النِّكَاحَ،وَاضْرِبُوا عَلَيْهِ بِالْغِرْبَالِ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: اس نکاح کا اعلان کیا کرو اور اس موقع پر دَف بجایا کرو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>ترمذي (1089)<br>خالد بن إیاس: متروک`;
ibnemaja.anwaar = [447,2];