var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ الْخَلَّادِ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ عَجْلَانَ أَنْبَأَنَا عَوْنُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَظُنُّوا بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي هُوَ أَهْنَاهُ وَأَهْدَاهُ وَأَتْقَاهُ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جب میں تمہیں اللہ کے رسول ﷺ کی کوئی حدیث سناؤں تو تم رسول اللہ ﷺ کے بارے میں وہ گمان رکھو جو زیادہ بہتر اور ہدایت و تقویٰ سے قریب تر ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد فیہ انقطاع،عون بن عبد اللّٰہ لم یسمع من عبد اللّٰہ بن مسعود ‘‘`;
ibnemaja.anwaar = [375,1];