var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا الْفِرْيَابِيُّ،عَنْ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ التَّمِيمِيِّ،عَنْ لَيْثٍ،عَنْ مُجَاهِدٍ،قَالَ: كُنْتُ مَعَ ابْنِ عُمَرَ،فَسَمِعَ صَوْتَ طَبْلٍ،فَأَدْخَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ،ثُمَّ تَنَحَّى،حَتَّى فَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ،ثُمَّ قَالَ: هَكَذَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "حضرت مجاہد رحمۃ اللہ علیہ سے روایت ہے،انہوں نے فرمایا: میں حضرت عبداللہ بن عمر رضی اللہ عنہ کے ساتھ تھا کہ انہیں ڈھول کی آواز سنائی دی۔انہوں نے کانوں میں انگلیاں دے لیں اور (راستے سے) ایک طرف ہٹ گئے۔(تاکہ آواز سے زیادہ دور ہو جائیں۔) انہوں نے تین بار ایسا ہی کیا۔پھر فرمایا: رسول اللہ ﷺ نے بھی اسی طرح کیا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>لیث: ضعیف`;
ibnemaja.anwaar = [448,1];