var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ،عَنْ سُهَيْلٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«لَعَنَ الْمَرْأَةَ تَتَشَبَّهُ بِالرِّجَالِ،وَالرَّجُلَ يَتَشَبَّهُ بِالنِّسَاءِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے مردوں سے مشابہت اختیار کرنے والی عورت پر اور عورتوں سے مشابہت اختیار کرنے والے مرد پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;