var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَ: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «لَعَنَ الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ،وَلَعَنَ الْمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بِالرِّجَالِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے عورتوں سے مشابہت اختیار کرنے والے مردوں پر اور مردوں سے مشابہت اختیار کرنے والی عورتوں پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;