var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،كَانَ إِذَا رَفَّأَ،قَالَ: «بَارَكَ اللَّهُ لَكُمْ،وَبَارَكَ عَلَيْكُمْ،وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی صلی اللہ علیہ جب شادی کی مبارک باد دیتے تو یوں فرماتے: (بارک اللہ لکم وبارک علیکم‘ وجمع بینکما فی خیر) اللہ تمہیں برکت دے،اور تم پر برکت نازل فرمائے،اور تم دونوں کو خیر میں اکٹھا کرے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;