var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا أَشْعَثُ،عَنِ الْحَسَنِ،عَنْ عَقِيلِ بْنِ أَبِي طَالِبٍ،أَنَّهُ تَزَوَّجَ امْرَأَةً مِنْ بَنِي جُشَمَ،فَقَالُوا: بِالرَّفَاءِ،وَالْبَنِينَ،فَقَالَ: لَا تَقُولُوا هَكَذَا،وَلَكِنْ قُولُوا كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ بَارِكْ لَهُمْ،وَبَارِكْ عَلَيْهِمْ»";
ibnemaja.urdu = "حضرت عقیل بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ انہوں نے قبیلہ بنو چشم کی ایک خاتون سے شادی کی،لوگوں نے (مبارک باد کے طور پر) کہا (بالرفاء والبنین) تمہیں آپس میں موافقت ہو اور بیٹے نصیب ہوں۔حضرت عقیل رضی اللہ عنہ نے فرمایا: اس طرح نہ کہو بلکہ جس طرح رسول اللہ ﷺ نے فرمایا ہے اس طرح کہو: (اللہم بارک لہم‘ وبارک علیہم) یا اللہ! انہیں برکت دے اور ان پر برکت نازل فرما۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نسائي (3373)`;
ibnemaja.anwaar = [448,1];