var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ ثَابِتٍ الْبُنَانِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: «مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى شَيْءٍ مِنْ نِسَائِهِ مَا أَوْلَمَ عَلَى زَيْنَبَ،فَإِنَّهُ ذَبَحَ شَاةً»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نہیں دیکھا کہ رسول اللہ ﷺ نے کسی زوجہ محترمہ سے نکاح کے موقع پر ایسا (پر تکلف) ولیمہ کیا ہو جیسا حضرت زینب رضی اللہ عنہا سے نکاح کے موقع پر کیا۔آپ ﷺ نے (اس موقع پر) ایک بکری ذبح فرمائی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;