var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ،وَغِيَاثُ بْنُ جَعْفَرٍ الرَّحَبِيُّ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ: حَدَّثَنَا وَائِلُ بْنُ دَاوُدَ،عَنِ ابْنِهِ،عَنِ الزُّهْرِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَوْلَمَ عَلَى صَفِيَّةَ بِسَوِيقٍ وَتَمْرٍ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے حضرت صفیہ رضی اللہ عنہا کا ولیمہ ستوؤں اور کھجوروں سے کیا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;