var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ أَبُو خَيْثَمَةَ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: «شَهِدْتُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلِيمَةً،مَا فِيهَا لَحْمٌ وَلَا خُبْزٌ» . قَالَ ابْنُ مَاجَةَ: «لَمْ يُحَدِّثْ بِهِ إِلَّا ابْنُ عُيَيْنَةَ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نبی ﷺ کے ایک ولیمے میں حاضر ہوا۔اس میں نہ گوشت تھا نہ روٹی۔(صرف ستو اور کھجوریں وغیرہ پیش کی گئیں۔)\nامام ابن ماجہ رحمۃ اللہ علیہ فرماتے ہیں کہ اس حدیث کو صرف ابن عیینہ ہی بیان کرتے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>علي بن زید: ضعیف <br>وللحدیث شواھد ضعیفۃ عند أحمد (3/ 655،266) وغیرہ`;
ibnemaja.anwaar = [448,1];