var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ،يُدْعَى لَهَا الْأَغْنِيَاءُ وَيُتْرَكُ الْفُقَرَاءُ،وَمَنْ لَمْ يُجِبْ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اس ولیمے کا کھانا بدترین کھانا جس میں دولت مندوں کو بلایا جائے اور غریبوں کو نہ بلایا جائے۔اور جس نے (ولیمہ کی دعوت) قبول نہ کی،اس نے اللہ کی اور اس کے رسول ﷺ کی نافرمانی کی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;