var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةِ عُرْسٍ فَلْيُجِبْ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب کسی کو شادی کے ولیمے میں بلایا جائے تو اسے چاہیے کہ (دعوت) قبول کرے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;