var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ حُسَيْنٍ أَبُو مَالِكٍ النَّخَعِيُّ،عَنْ مَنْصُورٍ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْوَلِيمَةُ أَوَّلَ يَوْمٍ حَقٌّ،وَالثَّانِيَ مَعْرُوفٌ،وَالثَّالِثَ رِيَاءٌ وَسُمْعَةٌ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: پہلے دن ولیمہ حق (ضروری) ہے،دوسرے دن نیکی ہے،تیسرے دن دکھاوا اور شہرت ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>أبو مالک النخعي اتفقوا علی ضعفہ کما قال البوصیري <br>وللحدیث شواہد ضعیفۃ عند أبي داود (3745) وغیرہ`;
ibnemaja.anwaar = [448,1];