var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى،وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى،قَالَا: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي يُونُسُ،عَنِ ابْنِ شِهَابٍ قَالَ: حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ،أَنَّ أَبَا هُرَيْرَةَ،كَانَ يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَقْبِضُ اللَّهُ الْأَرْضَ يَوْمَ الْقِيَامَةِ،وَيَطْوِي السَّمَاءَ بِيَمِينِهِ،ثُمَّ يَقُولُ: أَنَا الْمَلِكُ،أَيْنَ مُلُوكُ الْأَرْضِ؟";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ اللہ تعالیٰ قیامت کے دن زمین کو ہاتھ میں لے لے گا اور آسمان کو دائیں ہاتھ سےلپیٹ دے گا،پھر فرمائے گا: میں بادشاہ ہوں،زمین کے بادشاہ کہاں ہیں؟’’";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;