var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ وَهْبٍ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ الْقَاسِمِ الْهَمْدَانِيُّ قَالَ: حَدَّثَنَا الْأَحْوَصُ بْنُ حَكِيمٍ،عَنْ أَبِيهِ،وَرَاشِدُ بْنُ سَعْدٍ،وَعَبْدُ الْأَعْلَى بْنُ عَدِيٍّ،عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ فَلْيَسْتَتِرْ،وَلَا يَتَجَرَّدْ تَجَرُّدَ الْعَيْرَيْنِ»";
ibnemaja.urdu = "حضرت عتبہ بن عبدسلمی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب کوئی اپنی بیوی کے پاس جائے تو اسے چاہیے کہ پردہ کرے،اور گدھوں کی طرح ننگا نہ ہو جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الأحوص بن حکیم: ضعیف الحفظ (تقریب: 290) و قال الھیثمي: و ضعفہ الجمھور (مجمع الزوائد 42/3) <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [448,1];