var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ مَنْصُورٍ،عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ،عَنْ مَوْلًى لِعَائِشَةَ،عَنْ عَائِشَةَ،قَالَتْ: «مَا نَظَرْتُ،أَوْ مَا رَأَيْتُ فَرْجَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَطُّ»،قَالَ أَبُو بَكْرٍ: قَالَ أَبُو نُعَيْمٍ: عَنْ مَوْلَاةٍ لِعَائِشَةَ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں نے کبھی رسول اللہ ﷺ کی شرم گاہ نہیں دیکھی۔ابوبکر نے کہا: ابونعیم (حضرت عائشہ کے غلام کی بجائے) حضرت عائشہ رضی اللہ عنہا کی لونڈی سے بیان کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (662)`;
ibnemaja.anwaar = [448,2];