var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنِ الْحَارِثِ بْنِ مُخَلَّدٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا يَنْظُرُ اللَّهُ إِلَى رَجُلٍ جَامَعَ امْرَأَتَهُ فِي دُبُرِهَا»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اللہ تعالیٰ اس مرد کی طرف نظر نہیں فرمائے گا،جو اپنی بیوی سے دُبر میں مجامعت کرتا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;