var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: أَنْبَأَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ،عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ عَبْدِ اللَّهِ بْنِ هَرَمِيٍّ،عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَا يَسْتَحْيِي مِنَ الْحَقِّ،ثَلَاثَ مَرَّاتٍ،لَا تَأْتُوا النِّسَاءَ فِي أَدْبَارِهِنَّ»";
ibnemaja.urdu = "حضرت خزیمہ بن ثابت رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے تین بار فرمایا: بے شک اللہ تعالیٰ حق بات سے نہیں شرماتا۔پھر فرمایا: عورتوں سے ان کی پیٹھوں میں مجامعت نہ کرو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;