var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنِ ابْنِ شِهَابٍ قَالَ: حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْعَزْلِ،فَقَالَ: «أَوَتَفْعَلُونَ؟ لَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا،فَإِنَّهُ لَيْسَ مِنْ نَسَمَةٍ قَضَى اللَّهُ لَهَا أَنْ تَكُونَ،إِلَّا هِيَ كَائِنَةٌ»";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے رسول اللہ ﷺ سے عزل کے بارے میں سوال کیا۔آپ ﷺ نے فرمایا: کیا تم یہ کام کرتے ہو؟ اگر نہ کرو تو کوئی حرج نہیں،جس روح کو پیدا کرنے کا اللہ نے فیصلہ کر لیا ہے،وہ ہو کر رہے گی۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;