var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ: حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ: حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ،عَنِ الزُّهْرِيِّ،عَنْ مُحَرَّرِ بْنِ أَبِي هُرَيْرَةَ،عَنْ أَبِيهِ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعْزَلَ عَنِ الْحُرَّةِ إِلَّا بِإِذْنِهَا»";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے آزاد عورت سے اس کی اجازت کے بغیر عزل کرنے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،لضعف ابن لہیعۃ ‘‘`;
ibnemaja.anwaar = [449,1];