var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ هِشَامِ بْنِ حَسَّانَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا،وَلَا عَلَى خَالَتِهَا»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: کسی عورت سے،اس کی پھوپھی یا خالہ کے نکاح میں ہوتے ہوئے نکاح نہ کیا جائے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;