var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ يَعْقُوبَ بْنِ عُتْبَةَ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«يَنْهَى عَنْ نِكَاحَيْنِ،أَنْ يَجْمَعَ الرَّجُلُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا،وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا»";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو دو نکاحوں سے منع فرماتے ہوئے سنا ہے،(اس بات سے منع فرمایا) کہ کوئی مرد ایک عورت اور اس کی پھوپھی کو (نکاح میں) جمع کرے،یا عورت اور اس کی خالہ کو (نکاح میں جمع کرے۔)";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;