var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ النَّهْشَلِيُّ قَالَ: حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي مُوسَى،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُنْكَحُ الْمَرْأَةِ عَلَى عَمَّتِهَا،وَلَا عَلَى خَالَتِهَا»";
ibnemaja.urdu = "حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: عورت سے،اس کی پھوپھی یا خالہ کے نکاح میں ہوتے ہوئے نکاح نہ کیا جائے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;