var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا أَبُو عَامِرٍ،عَنْ زَمْعَةَ بْنِ صَالِحٍ،عَنْ سَلَمَةَ بْنِ وَهْرَامَ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «لَعَنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمُحَلِّلَ،وَالْمُحَلَّلَ لَهُ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے حلالہ کرنے والے اور حلالہ کرانے والے پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;