var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ الْبَخْتَرِيِّ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،عَنِ ابْنِ عَوْنٍ،وَمُجالِدٌ،عَنِ الشَّعْبِيِّ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ: «لَعَنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمُحَلِّلَ،وَالْمُحَلَّلَ لَهُ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے حلالہ کرنے والے اور حلالہ کرانے والے پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2076) ترمذي (1119)`;
ibnemaja.anwaar = [449,1];