var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنِ الْحَجَّاجِ،عَنِ الْحَكَمِ،عَنْ عِرَاكِ بْنِ مَالِكٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَحْرُمُ مِنَ الرَّضَاعِ مَا يَحْرُمُ مِنَ النَّسَبِ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: رضاعت سے بھی وہ (رشتہ) حرام ہو جاتا ہے جو نسب سے حرام ہوتا ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;