var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ أَبِي الْخَلِيلِ،عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ،أَنَّ أُمَّ الْفَضْلِ،حَدَّثَتْهُ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا تُحَرِّمُ الرَّضْعَةُ وَلَا الرَّضْعَتَانِ،أَوِ الْمَصَّةُ وَالْمَصَّتَانِ»";
ibnemaja.urdu = "حضرت ام الفضل رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ایک بار دودھ پینا حرام نہیں کرتا،نہ دو بار دودھ پینا،نہ ایک بار چوسنا،نہ دو بار چوسنا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;