var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ قَالَ: حَدَّثَنَا ابْنُ عُلَيَّةَ،عَنْ أَيُّوبَ،عَنِ ابْنِ أَبِي مُلَيْكَةَ،عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا تُحَرِّمُ الْمَصَّةُ وَالْمَصَّتَانِ»";
ibnemaja.urdu = "حضرت عبداللہ بن زبیر رضی اللہ عنہ حضرت عائشہ رضی اللہ عنہا سے روایت بیان کرتے ہیں کہ نبی ﷺ نے فرمایا: ایک دو بار چوسنا حرام نہیں کرتا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;