var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ قَالَ: حَدَّثَنَا أَبِي قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ أَبِيهِ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،أَنَّهَا قَالَتْ: كَانَ فِيمَا أَنْزَلَ اللَّهُ مِنَ الْقُرْآنِ ثُمَّ سَقَطَ،«لَا يُحَرِّمُ إِلَّا عَشْرُ رَضَعَاتٍ،أَوْ خَمْسٌ مَعْلُومَاتٌ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: اللہ تعالیٰ نے قرآن مجید میں جو کچھ نازل فرمایا،پھر اس کی تلاوت منسوخ ہو گئی،اس میں یہ بھی تھا کہ دس بار دودھ پلانے،یا پانچ بار دودھ پلانے ہی سے محرم کا رشتہ قائم ہوتا ہے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;