var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ،عَنْ أَبِيهِ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ،فَقَالَ: مَنْ هَذَا؟ قَالَتْ: هَذَا أَخِي،قَالَ: «انْظُرُوا مَنْ تُدْخِلْنَ عَلَيْكُنَّ،فَإِنَّ الرَّضَاعَةَ مِنَ الْمَجَاعَةِ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ ان کے پاس تشریف لائے تو ان کے پاس ایک مرد بیٹھا تھا۔آپ نے فرمایا: یہ کون ہے؟ انہوں نے کہا: یہ میرا بھائی ہے۔آپ ﷺ نے فرمایا: غور کر لیا کرو کہ تم کسے اپنے پاس آنے کی اجازت دے رہی ہو کیونکہ رضاعت بھوک سے ہوتی ہے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;