var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي ابْنُ لَهِيعَةَ،عَنْ أَبِي الْأَسْوَدِ،عَنْ عُرْوَةَ،عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا رَضَاعَ إِلَّا مَا فَتَقَ الْأَمْعَاءَ»";
ibnemaja.urdu = "حضرت عبداللہ بن زبیر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: رضاعت وہی (معتبر) ہے جو آنتوں کو پھاڑے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;