var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ،عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ،عَنْ أَبِي وَهْبٍ الْجَيْشَانِيِّ،عَنْ أَبِي خِرَاشٍ الرُّعَيْنِيِّ،عَنِ الدَّيْلَمِيِّ،قَالَ: قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَعِنْدِي أُخْتَانِ تَزَوَّجْتُهُمَا فِي الْجَاهِلِيَّةِ،فَقَالَ: «إِذَا رَجَعْتَ فَطَلِّقْ إِحْدَاهُمَا»";
ibnemaja.urdu = "حضرت فیروز دیلمی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں رسول اللہ ﷺ کی خدمت میں حاضر ہوا تو میرے نکاح میں دو بہنیں تھیں جن سے میں نے زمانہ جاہلیت میں نکاح کیا تھا تو نبی ﷺ نے فرمایا: جب واپس جاؤ تو ان میں سے ایک کو طلاق دے دینا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;