var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي ابْنُ لَهِيعَةَ،عَنْ أَبِي وَهْبٍ الْجَيْشَانِيِّ،حَدَّثَهُ أَنَّهُ سَمِعَ الضَّحَّاكَ بْنَ فَيْرُوزَ الدَّيْلَمِيَّ،يُحَدِّثُ عَنْ أَبِيهِ،قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقُلْتُ: يَا رَسُولَ اللَّهِ،إِنِّي أَسْلَمْتُ وَتَحْتِي أُخْتَانِ،قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِي: «طَلِّقْ أَيَّتَهُمَا شِئْتَ»";
ibnemaja.urdu = "حضرت فیروز دیلمی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نبی ﷺ کی خدمت میں حاضر ہوا۔میں نے کہا: اللہ کے رسول! میں نے اسلام قبول کر لیا ہے اور میرے نکاح میں دو بہنیں ہیں۔رسول اللہ ﷺ نے مجھے فرمایا: ان میں سے جس عورت کو چاہو طلاق ے دو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;