var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَ: حَدَّثَنَا هُشَيْمٌ،عَنِ ابْنِ أَبِي لَيْلَى،عَنْ حُمَيْضَةَ بِنْتِ الشَّمَرْدَلِ،عَنْ قَيْسِ بْنِ الْحَارِثِ،قَالَ: أَسْلَمْتُ وَعِنْدِي ثَمَانِ نِسْوَةٍ،فَأَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقُلْتُ ذَلِكَ لَهُ،فَقَالَ: «اخْتَرْ مِنْهُنَّ أَرْبَعًا»";
ibnemaja.urdu = "حضرت قیس بن حارث رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے اسلام قبول کیا تو میرے نکاح میں آٹھ عورتیں تھیں۔میں نے نبی ﷺ کی خدمت میں حاضر ہو کر یہ بات بتائی تو آپ نے فرمایا: ان میں سے چار عورتیں منتخب کر لو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2241،2242)`;
ibnemaja.anwaar = [449,1];