var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،قَالَ: أَسْلَمَ غَيْلَانُ بْنُ سَلَمَةَ وَتَحْتَهُ عَشْرُ نِسْوَةٍ،فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خُذْ مِنْهُنَّ أَرْبَعًا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: حضرت غیلان بن سلمہ رضی اللہ عنہ نے اسلام قبول کیا تو ان کے نکاح میں دس عورتیں تھیں۔نبی ﷺ نے انہیں فرمایا: ان میں سے چار رکھ لو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;