var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ،وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ،قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِنَّ أَحَقَّ الشَّرْطِ أَنْ يُوفَى بِهِ،مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ»";
ibnemaja.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: وہ شرطیں پوری کی جانے کا حق سب سے زیادہ رکھتی ہیں،جن کے ساتھ تم نے عورتوں کی عصمت (اپنے لیے) حلال کی۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;