var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُبَيْشُ بْنُ مُبَشِّرٍ قَالَ: حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ،عَنْ عَائِشَةَ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا،وَتَزَوَّجَهَا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے حضرت صفیہ رضی اللہ عنہا کو آزاد کیا اور ان کی آزادی کو ان کا حق مہر قرار دے کر ان سے نکاح کر لیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;