var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا الْقَاسِمُ بْنُ عَبْدِ الْوَاحِدِ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا تَزَوَّجَ الْعَبْدُ بِغَيْرِ إِذْنِ سَيِّدِهِ كَانَ عَاهِرًا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب غلام،اپنے آقا کی اجازت کے بغیرنکاح کر لے تو وہ بدکار ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن عقیل: ضعیف <br>وللحدیث شواہد ضعیفۃ عند ابن ماجہ(1960) وأبي داود (2078) وغیرھما`;
ibnemaja.anwaar = [449,1];