var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،وَصَالِحُ بْنُ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ،قَالَا: حَدَّثَنَا أَبُو غَسَّانَ مَالِكُ بْنُ إِسْمَاعِيلَ قَالَ: حَدَّثَنَا مَنْدَلٌ،عَنِ ابْنِ جُرَيْجٍ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ فَهُوَ زَانٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو بھی غلام اپنے مالکوں کی اجازت کے بغیر نکاح کرے،وہ بدکار ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مندل: ضعیف`;
ibnemaja.anwaar = [449,1];