var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا بِشْرُ بْنُ عُمَرَ قَالَ: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنِ ابْنِ شِهَابٍ،عَنْ عَبْدِ اللَّهِ،وَالْحَسَنِ،ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ،عَنْ أَبِيهِمَا،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ،وَعَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ»";
ibnemaja.urdu = "حضرت علی بن ابوطالب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے جنگ خیبر کے موقع پر عورتوں سے متعہ کرنے سے اور پالتو گدھوں کا گوشت کھانے سے منع فرما دیا تھا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;