var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ،عَنْ مَالِكِ بْنِ أَنَسٍ،عَنْ نَافِعٍ،عَنْ نَبِيهِ بْنِ وَهْبٍ،عَنْ أَبَانَ بْنِ عُثْمَانَ بْنِ عَفَّانَ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمُحْرِمُ لَا يَنْكِحُ،وَلَا يُنْكِحُ،وَلَا يَخْطُبُ»";
ibnemaja.urdu = "حضرت عثمان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: احرام والا خود اپنا نکاح کر سکتا نہ کسی دوسرے کا نکاح کر سکتا ہے اور نہ نکاح کا پیغام ہی دے سکتا ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;