var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ سَابُورَ الرَّقِّيُّ قَالَ: حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ سُلَيْمَانَ الْأَنْصَارِيُّ،أَخُو فُلَيْحٍ،عَنْ مُحَمَّدِ بْنِ عَجْلَانَ،عَنِ ابْنِ وَثِيمَةَ النَّصْرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَتَاكُمْ مَنْ تَرْضَوْنَ خُلُقَهُ وَدِينَهُ فَزَوِّجُوهُ،إِلَّا تَفْعَلُوا تَكُنْ فِتْنَةٌ فِي الْأَرْضِ وَفَسَادٌ عَرِيضٌ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب تمہارے پاس ایسا آدمی (رشتہ مانگنے) آئے،جس کا اخلاق اور دین تمہیں پسند ہو تو اسے رشتہ دے دو۔اگر تم یوں نہیں کرو گے تو زمین میں بہت زیادہ فتنہ و فساد پیدا ہو جائے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1084)`;
ibnemaja.anwaar = [449,1];