var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا الْحَارِثُ بْنُ عِمْرَانَ الْجَعْفَرِيُّ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَخَيَّرُوا لِنُطَفِكُمْ،وَانْكِحُوا الْأَكْفَاءَ،وَأَنْكِحُوا إِلَيْهِمْ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: حصولِ اولاد کے لیے (اچھی عوریں) منتخب کرو،ہم مرتبہ لوگوں سے رشتے لو اور دو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدا منکر`;
ibnemaja.anwaar = [449,1];