var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ هَمَّامٍ،عَنْ قَتَادَةَ،عَنِ النَّضْرِ بْنِ أَنَسٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَتْ لَهُ امْرَأَتَانِ،يَمِيلُ مَعَ إِحْدَاهُمَا عَلَى الْأُخْرَى،جَاءَ يَوْمَ الْقِيَامَةِ وَأَحَدُ شِقَّيْهِ سَاقِطٌ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس کی دو عورتیں ہوں اور وہ ایک کو دوسری پر ترجیح دے،وہ قیامت کے دن اس حال میں آئے گا کہ اس کا آدھا جسم گرا ہوا (مفلوج) ہو گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف سنن أبي داود (2133) ترمذي (1141) نسائي (3394)`;
ibnemaja.anwaar = [449,1];