var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ وَمُحَمَّدُ بْنُ يَحْيَى،قَالَا: حَدَّثَنَا أَبُو عَاصِمٍ،عَنْ جَعْفَرِ بْنِ يَحْيَى بْنِ ثَوْبَانَ،عَنْ عَمِّهِ عُمَارَةَ بْنِ ثَوْبَانَ،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «خَيْرُكُمْ خَيْرُكُمْ لِأَهْلِهِ،وَأَنَا خَيْرُكُمْ لِأَهْلِي»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: تم میں سے بہتر وہ ہے جو اپنے گھر والوں کے لیے بہتر ہو اور تم سب کی نسبت میں اپنے گھر والوں کے لیے بہتر ہوں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;