var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَفْصُ بْنُ عَمْرٍو قَالَ: حَدَّثَنَا عُمَرُ بْنُ حَبِيبٍ الْقَاضِي،قَالَ: حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: «كُنْتُ أَلْعَبُ بِالْبَنَاتِ وَأَنَا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَكَانَ يُسَرِّبُ إِلَيَّ صَوَاحِبَاتِي يُلَاعِبْنَنِي»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا:میں اس وقت بھی گڑیوں سے کھیلا کرتی تھی جب میں رسول اللہ ﷺ کے پاس آ چکی تھی۔رسول اللہ ﷺ میری سہیلیوں کو میرے پاس بھیج دیتے تھے اور وہ میرے ساتھ کھیلتیں۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;