var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ: حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ،قَالَ: خَطَبَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،ثُمَّ ذَكَرَ النِّسَاءَ،فَوَعَظَهُمْ فِيهِنَّ،ثُمَّ قَالَ: «إِلَامَ يَجْلِدُ أَحَدُكُمُ امْرَأَتَهُ جَلْدَ الْأَمَةِ؟ وَلَعَلَّهُ أَنْ يُضَاجِعَهَا مِنْ آخِرِ يَوْمِهِ»";
ibnemaja.urdu = "حضرت عبداللہ بن زمعہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: نبی ﷺ نے خطبہ دیا۔(مختلف مسائل بیان فرمائے) پھر عورتوں کا ذکر فرمایا تو ان کے بارے میں لوگوں کو نصیحت کی،پھر فرمایا: آدمی کب تک اپنی عورت کو لونڈی کی طرح پیٹتا رہے گا؟ شاید دن کے آخر میں وہ اس کے ساتھ لیٹے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;