var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: «مَا ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَادِمًا لَهُ،وَلَا امْرَأَةً،وَلَا ضَرَبَ بِيَدِهِ شَيْئًا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے نہ اپنے کسی لونڈی غلام کو مارا،نہ کبھی کسی بیوی کو مارا۔(بلکہ) آپ ﷺ نے اپنے ہاتھ سے کسی چیز کو نہیں مارا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;