var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،وَأَبُو أُسَامَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«أَنَّهُ لَعَنَ الْوَاصِلَةَ،وَالْمُسْتَوْصِلَةَ،وَالْوَاشِمَةَ،وَالْمُسْتَوْشِمَةَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ نے نبی ﷺ سے روایت بیان کی کہ آپ ﷺ نے بالوں میں دوسرے بال ملانے والی،اور بال ملوانے والی اور گودنے والی اور گدوانے والی پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;