var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ: حَدَّثَنَا زُهَيْرٌ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ الْمَلِكِ بْنِ الْحَارِثِ بْنِ هِشَامٍ،عَنْ أَبِيهِ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،تَزَوَّجَ أُمَّ سَلَمَةَ فِي شَوَّالٍ،وَجَمَعَهَا إِلَيْهِ فِي شَوَّالٍ»";
ibnemaja.urdu = "حضرت عبدالملک بن حارث بن ہشام اپنے والد (ابوبکر بن عبدالرحمٰن بن حارث بن ہشام) سے روایت کرتے ہیں کہ نبی ﷺ نے حضرت ام سلمہ رضی اللہ عنہا سے شوال میں نکاح کیا اور شوال میں انہیں (رخصتی کرا کے) گھر لائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبدالملک ھو ابن أبي بکر بن عبد الرحمٰن بن الحارث المخزومي،وأبوہ ثقۃ تابعي فالحدیث مرسل وانظرالضعیفۃ (9/ 336-347 ح 4350) وأما ابن إسحاق فصرح بالسماع عند ابن سعد (8/ 95)`;
ibnemaja.anwaar = [450,1];