var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ مَنْصُورٍ-ظَنَّهُ-عَنْ طَلْحَةَ،عَنْ خَيْثَمَةَ،عَنْ عَائِشَةَ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَمَرَهَا أَنْ تُدْخِلَ عَلَى رَجُلٍ امْرَأَتَهُ قَبْلَ أَنْ يُعْطِيَهَا شَيْئًا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے انہیں حکم دیا کہ خاوند کے پاس اس کی بیوی کو بھیج دیں،حالانکہ اس نے ابھی اسے کوئی چیز نہیں دی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2128)`;
ibnemaja.anwaar = [450,1];