var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنِي سُلَيْمَانُ بْنُ سُلَيْمٍ الْكَلْبِيُّ،عَنْ يَحْيَى بْنِ جَابِرٍ،عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ،عَنْ عَمِّهِ مِخْمَرِ بْنِ مُعَاوِيَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: لَا شُؤْمَ،وَقَدْ يَكُونُ الْيُمْنُ فِي ثَلَاثَةٍ: فِي الْمَرْأَةِ،وَالْفَرَسِ،وَالدَّارِ";
ibnemaja.urdu = "حضرت مخمر بن معاویہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے سنا کہ آپ فرما رہے تھے: نحوست کچھ نہیں اور برکت بعض اوقات تین چیزوں میں ہوتی ہے: عورت میں،گھوڑے میں اور مکان میں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;