var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ عَاصِمٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ،قَالَ: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ أَبِي حَازِمٍ،عَنْ سَهْلِ بْنِ سَعْدٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِنْ كَانَ فَفِي الْفَرَسِ،وَالْمَرْأَةِ،وَالْمَسْكَنِ»،يَعْنِي الشُّؤْمَ";
ibnemaja.urdu = "حضرت سہل بن سعد رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے نحوست کے بارے میں فرمایا: اگر ہو تو گھوڑے،عورت یا گھر میں ہوتی ہے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;