var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا فَظُنُّوا بِهِ الَّذِي هُوَ أَهْنَاهُ وَأَهْدَاهُ وَأَتْقَاهُ";
ibnemaja.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جب میں تمہیں اللہ کے رسول ﷺ کی کوئی حدیث سناؤں تو تم اللہ کے رسول ﷺ کے بارے میں وہ گمان رکھو،جو زیادہ بہتر اور ہدایت و تقویٰ سے قریب سے تر ہو۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;