var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا شُرَحْبِيلُ بْنُ مُسْلِمٍ،قَالَ: سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «الْوَلَدُ لِلْفِرَاشِ،وَلِلْعَاهِرِ الْحَجَرُ»";
ibnemaja.urdu = "حضرت ابوامامہ باہلی رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: لڑکا بستر والے کا ہے اور زانی کے لیے پتھر ہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;