var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ حَجَّاجٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،رَدَّ ابْنَتَهُ زَيْنَبَ عَلَى أَبِي الْعَاصِ بْنِ الرَّبِيعِ بِنِكَاحٍ جَدِيدٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے (اپنی بیٹی) زینب رضی اللہ عنہا کو حضرت ابوالعاص بن ربیع رضی اللہ عنہ کے پاس نیا نکاح کر کے واپس بھیجا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1142)`;
ibnemaja.anwaar = [450,1];