var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ،عَنْ عَمْرِو بْنِ مُهَاجِرٍ،أَنَّهُ سَمِعَ أَبَاهُ الْمُهَاجِرَ بْنَ أَبِي مُسْلِمٍ،يُحَدِّثُ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ بْنِ السَّكَنِ،وَكَانَتْ مَوْلَاتَهُ،أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «لَا تَقْتُلُوا أَوْلَادَكُمْ سِرًّا،فَوَالَّذِي نَفْسِي بِيَدِهِ،إِنَّ الْغَيْلَ لَيُدْرِكُ الْفَارِسَ عَلَى ظَهْرِ فَرَسِهِ حَتَّى يَصْرَعَهُ»";
ibnemaja.urdu = "حضرت اسماء بنت یزید بن سکن رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اپنی اولاد کو خفیہ طور پر قتل نہ کرو۔قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! غیلہ تو گھوڑے کی پیٹھ پر بیٹھے ہوئے سوار پر بھی اثر انداز ہو کر اسے گرا دیتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3881)`;
ibnemaja.anwaar = [450,1];