var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُعَلَّى بْنِ مَنْصُورٍ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا يُحَرِّمُ الْحَرَامُ الْحَلَالَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: حرام کام حلال کو حرام نہیں کرتا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الفروي: ضعیف یعتبر بہ (التحریر: 381) ضعفہ الجمہور <br>وباقي السند حسن`;
ibnemaja.anwaar = [450,2];