var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُؤَمَّلٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَا بَالُ أَقْوَامٍ يَلْعَبُونَ بِحُدُودِ اللَّهِ،يَقُولُ أَحَدُهُمْ: قَدْ طَلَّقْتُكِ،قَدْ رَاجَعْتُكِ،قَدْ طَلَّقْتُكِ";
ibnemaja.urdu = "حضرت ابوموسیٰ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: لوگوں کو کیا ہو گیا ہے کہ اللہ کی حدود (اور اس کے قوانین) کو کھیل بنا لیتے ہیں۔آدمی (اپنی بیوی سے) کہتا ہے: میں نے تجھے طلاق دی،میں نے تجھ سے رجوع کیا،میں نے تجھے طلاق دی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الثوري و أبو إسحاق عنعنا`;
ibnemaja.anwaar = [451,1];