var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ الْوَلِيدِ الْوَصَّافِيِّ،عَنْ مُحَارِبِ بْنِ دِثَارٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَبْغَضُ الْحَلَالِ إِلَى اللَّهِ الطَّلَاقُ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: حلال کاموں میں سے اللہ کو سب سے زیادہ ناپسند کام،طلاق ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;