var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَزِيرُ بْنُ صَبِيحٍ قَالَ: حَدَّثَنَا يُونُسُ بْنُ حَلْبَسٍ،عَنْ أُمِّ الدَّرْدَاءِ،عَنْ أَبِي الدَّرْدَاءِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ تَعَالَى: كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ [الرحمن: 29]،قَالَ: «مِنْ شَأْنِهِ أَنْ يَغْفِرَ ذَنْبًا،وَيُفَرِّجَ كَرْبًا،وَيَرْفَعَ قَوْمًا،وَيَخْفِضَ آخَرِينَ»";
ibnemaja.urdu = "حضرت ابو درداء رضی اللہ عنہ سے روایت ہے کہ آیت مبارکہ:‘‘ ہر روز وہ ایک شان میں ہے۔﴿کُلَّ یَوْمٍ ہُوَ فِیْ شَاْنٍ﴾’’کی وضاحت کرتے ہوئے نبی ﷺ نے فرمایا:‘‘ یہ بھی اس کی شان ہے کہ وہ گناہ معاف کرتا ہے،پریشانی دور کرتا ہے،کسی قوم کو بلندیوں سے نوازتا ہے اور کسی کو پست کر دیتا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;