var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ سُفْيَانَ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،قَالَ: «طَلَاقُ السُّنَّةِ أَنْ يُطَلِّقَهَا طَاهِرًا مِنْ غَيْرِ جِمَاعٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: طلاقِ سنت یہ ہے کہ عورت کو طہر کی حالت میں اور جماع کیے بغیر طلاق دے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `<br>إسنادہ ضعیف <br>نسائي (3423۔3424)`;
ibnemaja.anwaar = [451,1];