var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنِ الْأَعْمَشِ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،قَالَ: فِي طَلَاقِ السُّنَّةِ: يُطَلِّقُهَا عِنْدَ كُلِّ طُهْرٍ تَطْلِيقَةً،فَإِذَا طَهُرَتِ الثَّالِثَةَ،طَلَّقَهَا،وَعَلَيْهَا بَعْدَ ذَلِكَ حَيْضَةٌ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے مسنون طلاق کے بارے میں فرمایا: عورت کو ہر طہر میں ایک طلاق دے،جب تیسری بار طہر آ لے تو اسے (آخری) طلاق دے دے،اس کے بعد وہ ایک حیض عدت گزارے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `<br>إسنادہ ضعیف <br>انظر الحدیث السابق (2020)`;
ibnemaja.anwaar = [451,1];