var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ،مَوْلَى آلِ طَلْحَةَ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ،فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: «مُرْهُ فَلْيُرَاجِعْهَا،ثُمَّ يُطَلِّقْهَا وَهِيَ طَاهِرٌ،أَوْ حَامِلٌ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ انہوں نے اپنی بیوی کو ایام حیض میں طلاق دے دی۔حضرت عمر رضی اللہ عنہ نے یہ بات نبی ﷺ کو بتائی تو آپ ﷺ نے فرمایا: اس حکم دو کہ رجوع کر لے،پھر اسے اس وقت طلاق دے جب وہ پاک ہو (ایام طہر میں ہو) یا حاملہ ہو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;