var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ إِسْحَاقَ بْنِ أَبِي فَرْوَةَ،عَنْ أَبِي الزِّنَادِ،عَنْ عَامِرٍ الشَّعْبِيِّ،قَالَ: قُلْتُ لِفَاطِمَةَ بِنْتِ قَيْسٍ: حَدِّثِينِي عَنْ طَلَاقِكِ،قَالَتْ: «طَلَّقَنِي زَوْجِي ثَلَاثًا،وَهُوَ خَارِجٌ إِلَى الْيَمَنِ،فَأَجَازَ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
ibnemaja.urdu = "حضرت عامر شعبی رحمۃ اللہ علیہ سے روایت ہے،انہوں نے فرمایا: میں نے حضرت فاطمہ بنت قیس رضی اللہ عنہا سے کہا: مجھے اپنی طلاق کے بارے میں بتائیے۔انہوں نے فرمایا: میرے خاوند نے مجھے تین طلاقیں دے دیں جب کہ وہ یمن گئے ہوئے تھے تو رسول اللہ ﷺ نے اسے نافذ قرار دے دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `<br>إسنادہ ضعیف جدًا<br>إسحاق بن أبي فروۃ: متروک <br>وأخرجہ مسلم (43۔45/ 1480) وغیرہ من طرق عن الشعبي نحوہ دون قولہ ’’فأجاز ذلک / رسول اللّٰہ ﷺ ‘‘ (وانظر الأصل: 2036)`;
ibnemaja.anwaar = [451,1];