var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،وَمُحَمَّدُ بْنُ بَشَّارٍ،قَالَا: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ قَالَ: حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«أَمَرَ سُبَيْعَةَ أَنْ تَنْكِحَ إِذَا تَعَلَّتْ مِنْ نِفَاسِهَا»";
ibnemaja.urdu = "حضرت مسور بن مخرمہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے حضرت سبیعہ رضی اللہ عنہ کو نفاس سے فارغ ہونے پر نکاح کر لینے کا حکم دیا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;