var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ مُسْلِمٍ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ: «وَاللَّهِ،لَمَنْ شَاءَ لَاعَنَّاهُ،لَأُنْزِلَتْ سُورَةُ النِّسَاءِ الْقُصْرَى بَعْدَ أَرْبَعَةِ أَشْهُرٍ وَعَشْرًا»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: قسم ہے اللہ کی! جو شخص چاہے ہم اس سے مباہلہ کر سکتے ہیں کہ عورتوں کے مسائل کی چھوٹی سورت (سورۃ الطلاق) چار ماہ دس دن کا حکم نازل ہونے کے بعد نازل ہوئی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2307)`;
ibnemaja.anwaar = [451,1];