var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ قَالَ: قَالَتْ فَاطِمَةُ بِنْتُ قَيْسٍ: «يَا رَسُولَ اللَّهِ،إِنِّي أَخَافُ أَنْ يُقْتَحَمَ عَلَيَّ،فَأَمَرَهَا أَنْ تَتَحَوَّلَ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا کہ حضرت فاطمہ بنت قیس رضی اللہ عنہا نے عرض کیا: اے اللہ کے رسول! مجھے ڈر لگتا ہے کہ کوئی میرے گھر میں نہ گھس آئے تو رسول اللہ ﷺ نے انہیں منتقل ہو جانے کا حکم دے دیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;