var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ بْنِ صُخَيْرٍ الْعَدَوِيِّ،قَالَ: سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ،تَقُولُ: «إِنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا،فَلَمْ يَجْعَلْ لَهَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُكْنَى،وَلَا نَفَقَةً»";
ibnemaja.urdu = "حضرت فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے کہ ان کے خاوند نے انہیں تین طلاقیں دے دیں تو رسول اللہ ﷺ نے انہیں رہائش اور خرچ نہ دلوایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;