var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا جَرِيرٌ،عَنْ مُغِيرَةَ،عَنِ الشَّعْبِيِّ،قَالَ: قَالَتْ فَاطِمَةُ بِنْتُ قَيْسٍ: طَلَّقَنِي زَوْجِي عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا سُكْنَى لَكِ،وَلَا نَفَقَةَ»";
ibnemaja.urdu = "حضرت فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا کہ مجھے میرے خاوند نے رسول اللہ ﷺ کے زمانے میں تین طلاقیں دے دیں تو رسول اللہ ﷺ نے فرمایا: تیرے لیے نہ رہائش ہے نہ خرچ۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;