var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَبِيبِ بْنِ أَرْدَكَ قَالَ: حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ،عَنْ يُوسُفَ بْنِ مَاهَكَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ثَلَاثٌ جِدُّهُنَّ جِدٌّ،وَهَزْلُهُنَّ جِدٌّ: النِّكَاحُ،وَالطَّلَاقُ،وَالرَّجْعَةُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: تین چیزیں قصد و ارادے سے کی جائیں تو بھی حقیقی (شمار ہوتی) ہیں اور ہنسی مذاق میں کی جائیں تو بھی حقیقی (شمار ہوتی) ہیں: نکاح،طلاق اور رجوع۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;