var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،وَعَبْدَةُ بْنُ سُلَيْمَانَ،ح وحَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،جَمِيعًا عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ زُرَارَةَ بْنِ أَوْفَى،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَجَاوَزَ لِأُمَّتِي عَمَّا حَدَّثَتْ بِهِ أَنْفُسَهَا،مَا لَمْ تَعْمَلْ بِهِ،أَوْ تَكَلَّمْ بِهِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ نے میری امت کے لوگوں سے وہ سب کچھ معاف کر دیا ہے جو وہ اپنے دلوں سے بات کریں،جب تک اس (کیال) کو عمل میں نہ لائیں یا (زبان سے) کلام نہ کریں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;