var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ: أَنْبَأَنَا الْقَاسِمُ بْنُ يَزِيدَ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «يُرْفَعُ الْقَلَمُ عَنِ الصَّغِيرِ،وَعَنِ الْمَجْنُونِ،وَعَنِ النَّائِمِ»";
ibnemaja.urdu = "حضرت علی بن ابو طالب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: بچے سے،پاگل سے اور سوئے ہوئے سے قلم اٹھا لیا جاتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،القاسم بن یزید ھذا مجھول و أیضًا لم یدرک علي بن أبي طالب‘‘`;
ibnemaja.anwaar = [452,1];