var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ يُوسُفَ الْفِرْيَابِيُّ قَالَ: حَدَّثَنَا أَيُّوبُ بْنُ سُوَيْدٍ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ الْهُذَلِيُّ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ قَدْ تَجَاوَزَ عَنْ أُمَّتِي الْخَطَأَ،وَالنِّسْيَانَ،وَمَا اسْتُكْرِهُوا عَلَيْهِ»";
ibnemaja.urdu = "حضرت ابوذر غفاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ نے میری خاطر میری امت کو غلطی،بھول اور وہ کام معاف کر دیے ہیں جن پر انہیں مجبور کیا گیا ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;