var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ مِسْعَرٍ،عَنْ قَتَادَةَ،عَنْ زُرَارَةَ بْنِ أَوْفَى،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَجَاوَزَ لِأُمَّتِي عَمَّا تُوَسْوِسُ بِهِ صُدُورُهَا،مَا لَمْ تَعْمَلْ بِهِ،أَوْ تَتَكَلَّمْ بِهِ،وَمَا اسْتُكْرِهُوا عَلَيْهِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ نے میری امت کے ان کے دلوں میں آنے والے وسوسے معاف کر دیے ہیں،جب تک ان پر عمل نہ کریں،یا انہیں زبان سے ادا نہ کریں اور (وہ گناہ بھی معاف کر دیے ہیں) جن پر انہیں زبردستی مجبور کیا جائے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;