var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِنَّ اللَّهَ وَضَعَ عَنْ أُمَّتِي الْخَطَأَ،وَالنِّسْيَانَ،وَمَا اسْتُكْرِهُوا عَلَيْهِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اللہ تعالیٰ نے میری امت سے غلطی،بھول اور وہ گناہ معاف کر دیے ہیں جن پر انہیں زبردستی مجبور کیا گیا ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;