var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ ثَوْرٍ،عَنْ عُبَيْدِ بْنِ أَبِي صَالِحٍ،عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ،قَالَتْ: حَدَّثَتْنِي عَائِشَةُ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا طَلَاقَ،وَلَا عَتَاقَ فِي إِغْلَاقٍ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: زبردستی میں نہ طلاق ہوتی ہے،نہ غلام آزاد ہوتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2193)`;
ibnemaja.anwaar = [452,1];