var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا هُشَيْمٌ قَالَ: أَنْبَأَنَا عَامِرٌ الْأَحْوَلُ،ح وحَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ،جَمِيعًا عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا طَلَاقَ فِيمَا لَا يَمْلِكُ»";
ibnemaja.urdu = "حضرت عمرو بن شعیب نے اپنے والد سے،اور انہوں نے اپنے دادا (حضرت عبداللہ بن عمرو رضی اللہ عنہ) سے روایت کی،رسول اللہ ﷺ نے فرمایا: اس (عورت) کو طلاق نہیں (دی جا سکتی) جو طلاق دینے والے کی ملکیت (منکوحہ) نہ ہو۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;