var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ قَالَ: حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ،عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا طَلَاقَ قَبْلَ نِكَاحٍ،وَلَا عِتْقَ قَبْلَ مِلْكٍ»";
ibnemaja.urdu = "حضرت مسور بن مخرمہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: نکاح سے پہلے طلاق نہیں اور مالک بننے سے پہلے غلام کا آزاد کرنا (درست) نہیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;