var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ مُسْلِمٍ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ،قَالَتْ: «خَيَّرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاخْتَرْنَاهُ،فَلَمْ يَرَهُ شَيْئًا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں اختیار دیا۔ہم نے آپ ﷺ (کی زوجیت میں رہنے) کو منتخب کر لیا۔تو آپ نے اسے (طلاق وغیرہ) کچھ بھی شمار نہیں کیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;