var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ،حَدَّثَنَا أَبُو عَاصِمٍ،عَنْ جَعْفَرِ بْنِ يَحْيَى بْنِ ثَوْبَانَ،عَنْ عَمِّهِ عُمَارَةَ بْنِ ثَوْبَانَ،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا تَسْأَلُ الْمَرْأَةُ زَوْجَهَا الطَّلَاقَ فِي غَيْرِ كُنْهِهِ فَتَجِدَ رِيحَ الْجَنَّةِ،وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو عورت بغیر کسی واقعی سبب کے اپنے خاوند سے طلاق مانگے گی،اسے جنت کی خوشبو نہیں آئے گی،حالانکہ اس کی خوشبو چالیس سال کے فاصلے سے محسوس ہوتی ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;