var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ،عَنْ حَمَّادِ بْنِ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ أَبِي أَسْمَاءَ،عَنْ ثَوْبَانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا امْرَأَةٍ سَأَلَتْ زَوْجَهَا الطَّلَاقَ فِي غَيْرِ مَا بَأْسٍ،فَحَرَامٌ عَلَيْهَا رَائِحَةُ الْجَنَّةِ»";
ibnemaja.urdu = "حضرت ثوبان رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: جس عورت نے بغیر سخت مجبوری کے اپنے خاوند سے طلاق مانگی،اس پر جنت کی خوشبو حرام ہے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;