var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ،عَنْ حَارِثَةَ بْنِ مُحَمَّدٍ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،إِنَّمَا آلَى لِأَنَّ زَيْنَبَ رَدَّتْ عَلَيْهِ هَدِيَّتَهُ»،فَقَالَتْ عَائِشَةُ: لَقَدْ أَقْمَأَتْكَ،فَغَضِبَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَآلَى مِنْهُنَّ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے اس لیے ایلاء کیا تھا کہ ام المومنین زینب رضی اللہ عنہا نے آپ کا بھیجا ہوا ہدیہ واپس کر دیا تھا۔(اس پر) حضرت عائشہ رضی اللہ عنہا نے کہا: زینب رضی اللہ عنہا نے آپ کی عظمت و شان کا خیال نہیں کیا۔آپ ﷺ کو غصہ آ گیا اور آپ نے ان (سب) سے ایلاء کر لیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حارثہ بن أبی الرجال: ضعیف`;
ibnemaja.anwaar = [452,1];