var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ سَلَمَةَ بْنِ صَخْرٍ الْبَيَاضِيِّ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فِي الْمُظَاهِرِ يُوَاقِعُ قَبْلَ أَنْ يُكَفِّرَ،قَالَ: «كَفَّارَةٌ وَاحِدَةٌ»";
ibnemaja.urdu = "حضرت سلمہ بن صخر بیاضی رضی اللہ عنہ سے روایت ہے کہ ظہار کرنے والا جو مرد کفارہ ادا کرنے سے پہلے مباشرت کر لے،اس کے بارے میں نبی ﷺ نے فرمایا: (اس کے ذمے) ایک ہی کفارہ ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (2062)`;
ibnemaja.anwaar = [452,2];