var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ مَالِكِ بْنِ أَنَسٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،«أَنَّ رَجُلًا لَاعَنَ امْرَأَتَهُ وَانْتَفَى مِنْ وَلَدِهَا،فَفَرَّقَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا،وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ ایک مرد نے اپنی عورت سے لعان کیا اور اس کے بیٹے کو اپنا ماننے سے انکار کیا تو رسول اللہ ﷺ نے ان دونون کے درمیان جدائی کرادی اور بچے کو عورت کے ساتھ کر دیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;