var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ الْحَضْرَمِيُّ،عَنْ ضَمْرَةَ بْنِ رَبِيعَةَ،عَنِ ابْنِ عَطَاءٍ،عَنْ أَبِيهِ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: أَرْبَعٌ مِنَ النِّسَاءِ لَا مُلَاعَنَةَ بَيْنَهُنَّ: النَّصْرَانِيَّةُ تَحْتَ الْمُسْلِمِ،وَالْيَهُودِيَّةُ تَحْتَ الْمُسْلِمِ،وَالْحُرَّةُ تَحْتَ الْمَمْلُوكِ،وَالْمَمْلُوكَةُ تَحْتَ الْحُرِّ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: چار عورتوں سے لعان نہیں کیا جاتا: مسلمان مرد کی عیسائی بیوی،مسلمان مرد کی یہودی بیوی،غلام خاوند کی آزاد بیوی اور آزاد خاوند کی وہ بیوی جو (کسی اور کی) لونڈی ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>عثمان بن عطاء الخراساني ضعیف الحدیث جدًا <br>ولہ متابعۃ مردودۃ`;
ibnemaja.anwaar = [453,1];