var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ قَزْعَةَ قَالَ: حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ قَالَ: حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ،عَنْ عَامِرٍ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ،قَالَتْ: «آلَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ نِسَائِهِ،وَحَرَّمَ فَجَعَلَ الْحَلَالَ حَرَامًا،وَجَعَلَ فِي الْيَمِينِ كَفَّارَةً»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے اپنی بیویوں سے ایلاء کیا اور (ان کو اپنے اوپر) حرام کر لیا،حلال چیز کو حرام کیا اور قسم کا کفارہ ادا کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1201)`;
ibnemaja.anwaar = [453,1];