var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ: حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ يَعْلَى بْنِ حَكِيمٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،قَالَ: قَالَ ابْنُ عَبَّاسٍ: «فِي الْحَرَامِ يَمِينٌ»،وَكَانَ ابْنُ عَبَّاسٍ،يَقُولُ: لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ [الأحزاب: 21]";
ibnemaja.urdu = "حضرت سعید بن جبیر رحمۃ اللہ علیہ سے روایت ہے کہ حضرت عبداللہ بن عباس رضی اللہ عنہ نے حلال چیز کو حرام کر لینے کے بارے میں فرمایا: یہ قسم ہے۔\nاور حضرت عبداللہ بن عباس رضی اللہ عنہ فرمایا کرتے تھے: (لَّقَدْ کَانَ لَکُمْ فِی رَ‌سُولِ ٱللَّہِ أُسْوَۃٌ حَسَنَۃٌ) تمہارے لیے اللہ کے رسول میں اچھا نمونہ ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;