var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ،وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ،قَالَا: حَدَّثَنَا عُمَرُ بْنُ شَبِيبٍ الْمُسْلِيُّ،عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى،عَنْ عَطِيَّةَ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «طَلَاقُ الْأَمَةِ اثْنَتَانِ،وَعِدَّتُهَا حَيْضَتَانِ»";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: لونڈی کی طلاقیں دو ہیں،اور اس کی عدت دو حیض ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عطیۃ ضعیف مدلس <br>وعمر بن شبیب: ضعیف (تقریب: 4919)`;
ibnemaja.anwaar = [453,1];