var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ لَيْثٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ دَاعٍ يَدْعُو إِلَى شَيْءٍ إِلَّا وُقِفَ يَوْمَ الْقِيَامَةِ لَازِمًا لِدَعْوَتِهِ،مَا دَعَا إِلَيْهِ،وَإِنْ دَعَا رَجُلٌ رَجُلًا»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جو دعوت دینے والا کسی (اچھی یا بری) چیز کی طرف دعوت دیتا ہے،وہ قیامت کے دن اس طرح کھڑا کیا جائے گا کہ وہ اپنی دعوت کے عمل سے جدا نہیں ہو سکے گا،جس چیز کی طرف بھی اس نے دعوت دی ہو اگرچہ کسی آدمی نے ایک ہی آدمی کو دعوت دی ہو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھذا إسناد ضعیف،لیث ھو ابن أبي سلیم: ضعفہ الجمہور ‘‘ وھو ضعیف مدلس`;
ibnemaja.anwaar = [381,1];