var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ مَطَرٍ الْوَرَّاقِ،عَنْ رَجَاءِ بْنِ حَيْوَةَ،عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ،عَنْ عَمْرِو بْنِ الْعَاصِ،قَالَ: «لَا تُفْسِدُوا عَلَيْنَا سُنَّةَ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عِدَّةُ أُمِّ الْوَلَدِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا»";
ibnemaja.urdu = "حضرت عمرو بن عاص رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم پر ہمارے نبی حضرت محمد ﷺ کی سنت خلط ملط نہ کرو۔ام ولد کی عدت چار مہینے دس دن ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;