var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا يَحِلُّ لِامْرَأَةٍ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ،إِلَّا عَلَى زَوْجٍ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: عورت کے لیے جائز نہیں کہ خاوند کے سوا کسی فوت ہونے والے پر تین دن سے زیادہ سوگ کرے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;