var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ قَالَ: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ نَافِعٍ،عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ،عَنْ حَفْصَةَ،زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ،إِلَّا عَلَى زَوْجٍ»";
ibnemaja.urdu = "نبی ﷺ کی زوجہ محترمہ حضرت حفصہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ اور آخرت پر ایمان رکھنے والی کسی عورت کے لیے جائز نہیں کہ خاوند کے سوا کسی فوت ہونے والے پر تین دن سے زیادہ سوگ کرے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;