var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ،عَنِ الْأَوْزَاعِيِّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ رِفَاعَةَ الْجُهَنِيِّ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفَ قَالَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ»";
ibnemaja.urdu = "حضرت رفاعہ بن عرابہ جہنی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ جب قسم کھاتے تو یوں فرماتے: قسم ہے اس ذات کی جس کے ہاتھ میں محمد (ﷺ) کی جان ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;