var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الصَّنْعَانِيُّ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ رِفَاعَةَ بْنِ عَرَابَةَ الْجُهَنِيِّ،قَالَ: كَانَتْ يَمِينُ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الَّتِي يَحْلِفُ بِهَا،أَشْهَدُ عِنْدَ اللَّهِ: «وَالَّذِي نَفْسِي بِيَدِهِ»";
ibnemaja.urdu = "حضرت رفاعہ بن عرابہ جہنی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں اللہ کے سامنے گواہی دیتا ہوں کہ رسول اللہ ﷺ جو قسم کھاتے تھے وہ یوں ہوتی تھی: قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;