var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَاقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ،عَنْ عَبَّادِ بْنِ إِسْحَاقَ،عَنِ ابْنِ شِهَابٍ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،قَالَ: كَانَتْ أَكْثَرُ أَيْمَانِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا وَمُصَرِّفِ الْقُلُوبِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ اکثر ان الفاظ کے ساتھ قسم کھاتے تھے: دلوں کو پھیرنے والے کی قسم! (بات اس طرح) نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>نسائي (3793)`;
ibnemaja.anwaar = [454,1];