var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ،ح وحَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا مَعْنُ بْنُ عِيسَى،جَمِيعًا عَنْ مُحَمَّدِ بْنِ هِلَالٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: كَانَتْ يَمِينُ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا،وَأَسْتَغْفِرُ اللَّهَ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ کی قسم ہوتی ھی: (لا‘ واستغفراللہ) نہیں! اور میں اللہ سے مغفرت اور بخشش کا طالب ہوں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3265)`;
ibnemaja.anwaar = [454,1];