var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ هِشَامٍ،عَنِ الْحَسَنِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِالطَّوَاغِي،وَلَا بِآبَائِكُمْ»";
ibnemaja.urdu = "حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: بتوں کی قسمیں نہ کھایا کرو،اور نہ باپ دادا کی قسمیں کھاؤ۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;