var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ،عَنِ الْأَوْزَاعِيِّ،عَنِ الزُّهْرِيِّ،عَنْ حُمَيْدٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ حَلَفَ فَقَالَ فِي يَمِينِهِ: بِاللَّاتِ وَالْعُزَّى،فَلْيَقُلْ: لَا إِلَهَ إِلَّا اللَّهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص قسم کھاتے وقت یہ کہہ دے: قسم ہے لات اور عزی کی اسے چاہیے کہ (فورا) لا الہ الا اللہ کہہ لے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;