var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ أَبِي قِلَابَةَ،عَنْ ثَابِتِ بْنِ الضَّحَّاكِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ بِمِلَّةٍ سِوَى الْإِسْلَامِ كَاذِبًا مُتَعَمِّدًا،فَهُوَ كَمَا قَالَ»";
ibnemaja.urdu = "حضرت ثابت بن ضحاک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے اسلام کے علاوہ دوسرے مذہب (میں چلے جانے) کی جان بوجھ کر جھوٹی قسم کھائی تو وہ ویسے ہی ہے جیسے اس نے کہا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;