var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا بَقِيَّةُ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَرَّرٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَقُولُ: أَنَا إِذًا لَيَهُودِيٌّ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَجَبَتْ»";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے سنا کہ ایک آدمی کہہ رہا تھا: (اگر یوں ہوا تو) یقینا میں اس وقت یہودی ہوں۔رسول اللہ ﷺ نے فرمایا: (یہودیو یا دوزخ) واجب ہو گئی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>عبد اللّٰہ بن محرر: متروک (تقریب: 3573) <br>والسند ضعفہ البوصیري لتدلیس بقیۃ بن الولید`;
ibnemaja.anwaar = [454,1];