var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ حَدَّثَنَا الْمَقْبُرِيُّ عَنْ جَدِّهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا أَعْرِفَنَّ مَا يُحَدَّثُ أَحَدُكُمْ عَنِّي الْحَدِيثَ وَهُوَ مُتَّكِئٌ عَلَى أَرِيكَتِهِ فَيَقُولُ اقْرَأْ قُرْآنًا مَا قِيلَ مِنْ قَوْلٍ حَسَنٍ فَأَنَا قُلْتُهُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:‘‘میرے علم میں یہ بات نہیں آنی چاہیئے(اس سے اجتناب کرو) کہ تم میں سے کسی کو میری حدیث سنائی جائے اور وہ اپنے پلنگ پر ٹیک لگائے بیٹھا ہو اور (میری حدیث سن کر) کہہ دے: قرآن پڑھو۔(بات یہ ہے کہ) جو بھی اچھی بات کہی گئی ہے وہ میں نے کہی ہے۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>عبد اللّٰہ بن سعید المقبري: متروک <br>وللحدیث طریق آخر: ضعیف / عند أحمد (483/2)`;
ibnemaja.anwaar = [375,1];