var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ بَشَّارِ بْنِ كِدَامٍ،عَنْ مُحَمَّدِ بْنِ زَيْدٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الْحَلِفُ حِنْثٌ أَوْ نَدَمٌ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قسم توڑنا پڑتی ہے یا اس پر شرمندہ ہونا پڑتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>بشار بن کدام: ضعیف (تقریب: 673) <br>وللحدیث شاہد ضعیف موقوف عند الحاکم(303/4،304)`;
ibnemaja.anwaar = [454,1];