var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنِ ابْنِ طَاوُسٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ حَلَفَ،فَقَالَ: إِنْ شَاءَ اللَّهُ فَلَهُ ثُنْيَاهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس شخص نے قسم کھائی اور ان شاءاللہ کہا تو اس کو اس شرط کا فائدہ ہو گا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;