var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ وَاسْتَثْنَى،إِنْ شَاءَ رَجَعَ،وَإِنْ شَاءَ تَرَكَ غَيْرُ حَانِثٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے قسم کھائی اور اِن شاءاللہ کہا تو چاہے وہ (اپنے ارادے سے) رجوع کر لے،چاہے (ارادہ قائم) رہنے دے (اور وہ کام کر لے جس کی قسم کھائی ہے) وہ قسم توڑنے والا (شمار) نہیں ہو گا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;