var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ،قَالَا: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ،عَنْ تَمِيمِ بْنِ طَرَفَةَ،عَنْ عَدِيِّ بْنِ حَاتِمٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا،فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ،وَلْيُكَفِّرْ عَنْ يَمِينِهِ»";
ibnemaja.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص کوئی قسم کھائے،پھر دوسری چیز اس سے بہتر معلوم ہو تو اسے چاہیے کہ بہتر کام کر لے اور اپنی قسم کا کفارہ ادا کر دے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;