var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ قَالَ: حَدَّثَنَا شُعْبَةُ،وَسُفْيَانُ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنْ سَعْدِ بْنِ عُبَيْدَةَ،عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ،عَنْ عُثْمَانَ بْنِ عَفَّانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَالَ شُعْبَةُ «خَيْرُكُمْ» وَقَالَ سُفْيَانُ،«أَفْضَلُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ»";
ibnemaja.urdu = "سیدنا عثمان بن عفان رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:’’تم میں سے بہتر وہ ہے جس نے قرآن سیکھا اور سکھایا‘‘۔ایک روایت میں راوی سفیان کے یہ لفظ ہیں:’’تم میں سے افضل وہ ہے۔۔۔۔۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;