var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ حَارِثَةَ بْنِ أَبِي الرِّجَالِ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ فِي قَطِيعَةِ رَحِمٍ،أَوْ فِيمَا لَا يَصْلُحُ،فَبِرُّهُ أَنْ لَا يُتِمَّ عَلَى ذَلِكَ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے قطع رحمی کی قسم کھائی،یا کسی ناجائز کام کی قسم کھائی تو اس قسم کا پورا کرنا یہی ہے کہ اسے چھوڑ دے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حارثۃ بن أبی الرجال ضعیف <br>وروی الطحاوي في مشکل الآثار (1/ 287) بإسناد حسن عن ابن عباس عن رسول اللّٰہ ﷺ قال: ((من حلف بیمین علی قطیعۃ الرحم أو معصیۃ فحنث فذلک کفارۃ لہ))`;
ibnemaja.anwaar = [454,1];