var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْمُؤْمِنِ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا عَوْنُ بْنُ عُمَارَةَ قَالَ: حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَتْرُكْهَا،فَإِنَّ تَرْكَهَا كَفَّارَتُهَا»";
ibnemaja.urdu = "جناب عمرو بن شعیب اپنے والد سے،وہ اپنے دادا سے بیان کرتے ہیں،نبی ﷺ نے فرمایا: جس نے کوئی قسم کھائی،پھر دوسری بات اس سے بہتر معلوم ہوئی تو اس (قسم والے غلط کام) کو چھوڑ دے۔اسے چھوڑنا ہی اس کا کفارہ ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;