var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ قَالَ: حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ الْبَكَّائِيُّ قَالَ: حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ يَعْلَى الثَّقَفِيُّ،عَنِ الْمِنْهَالِ بْنِ عَمْرٍو،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «كَفَّرَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِصَاعٍ مِنْ تَمْرٍ،وَأَمَرَ النَّاسَ بِذَلِكَ،فَمَنْ لَمْ يَجِدْ فَنِصْفُ صَاعٍ مِنْ بُرٍّ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ نے کفارے کے طور پر ایک صاع (خشک) کھجورین دیں اور لوگوں کو بھی یہی حکم دیا۔جس کے پاس (کھجوریں) نہ ہوں،وہ نصف صاع گندم دے دے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عمر بن عبد اللّٰہ بن یعلی: ضعیف <br>والحدیث ضعفہ ابن کثیر في تفسیرہ (93/2)`;
ibnemaja.anwaar = [454,1];