var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ سُلَيْمَانَ بْنِ أَبِي الْمُغِيرَةِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: كَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ سَعَةٌ،وَكَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ شِدَّةٌ،فَنَزَلَتْ: مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ [المائدة: 89]";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: کوئی آدمی اپنے گھر والوں کو وسعت کے ساتھ کھانا دیتا تھا اور کوئی تنگی کے ساتھ دیتا تھا۔تب یہ آیت نازل ہوئی: (أَوْسَطِ مَا تُطْعِمُونَ أَہْلِیکُمْ) اوسط درجے کا کھانا جو تم اپنے گھر والوں کو کھلاتے ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سفیان بن عینۃ مدلس وعنعن <br>ولا ینفعہ کونہ لا یدلس إلا عن ثقۃ مدلس وغیر مدلسٍ کما حققتہ في تخریج النہایۃ فی الفتن والملاحم (ح1030) یسر اللّٰہ لنا طبعہ`;
ibnemaja.anwaar = [454,2];