var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ عَلِيِّ بْنِ صَالِحٍ،عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ،عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ،عَنِ الْبَرَاءِ بْنِ عَازِبٍ،قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِإِبْرَارِ الْمُقْسِمِ»";
ibnemaja.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں قسم دینے والے کی قسم پوری کرنے کا حکم دیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;