var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ: حَدَّثَنَا الْأَجْلَحُ الْكِنْدِيُّ،عَنْ يَزِيدَ بْنِ الْأَصَمِّ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِذَا حَلَفَ أَحَدُكُمْ فَلَا يَقُلْ: مَا شَاءَ اللَّهُ وَشِئْتَ،وَلَكِنْ لِيَقُلْ: مَا شَاءَ اللَّهُ،ثُمَّ شِئْتَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب کوئی قسم کھائے تو یوں نہ کہے: جو اللہ اور تو چاہے بلکہ یوں کہے: جو اللہ چاہے،اس کے بعد جو تو چاہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;