var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ،عَنْ عُثْمَانَ بْنِ عَفَّانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ»";
ibnemaja.urdu = "سیدنا عثمان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’تم میں سے افضل وہ ہے جو قرآن کا علم حاصل کے اور اس کی تعلیم دے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;