var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ: أَخْبَرَنَا هُشَيْمٌ،عَنْ عَبَّادِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرماای: قسم،قسم دلانے والے کی نیت پر ہوتی ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;