var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا هُشَيْمٌ قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَمِينُكَ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: تیری قسم اس مفہوم پر واقع ہو گی جس پر تیرا ساتھی (قسم دلانے والا) تجھے سچا سمجھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;