var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ مَنْصُورٍ،عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ النَّذْرِ،وَقَالَ: «إِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ اللَّئِيمِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے نذر ماننے سے منع کیا اور فرمایا: اس کے ذریعے سے کنجوس (کے ہاتھ) سے (مال) نکلوایا جاتا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;