var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ: حَدَّثَنَا أَيُّوبُ،عَنْ أَبِي قِلَابَةَ،عَنْ عَمِّهِ،عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا نَذْرَ فِي مَعْصِيَةٍ،وَلَا نَذْرَ فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ»";
ibnemaja.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: گناہ کے کام کی کوئی نذر نہیں اور جس چیز کا انسان مالک نہیں،اس کی کوئی نذر نہیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;