var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ أَبُو طَاهِرٍ قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَنْبَأَنَا يُونُسُ،عَنِ ابْنِ شِهَابٍ،عَنْ أَبِي سَلَمَةَ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا نَذْرَ فِي مَعْصِيَةٍ،وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: گناہ کے کام کی کوئی نذر نہیں اور اس کا کفارہ قسم کا کفارہ ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;