var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ رَافِعٍ،عَنْ خَالِدِ بْنِ يَزِيدَ،عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ نَذَرَ نَذْرًا وَلَمْ يُسَمِّهِ،فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ»";
ibnemaja.urdu = "حضرت عقبہ بن عامر جہنی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے نذر مانی اور اس کا نام نہ لیا،اس کا کفارہ قسم کا کفارہ ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;