var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،قَالَ: «نَذَرْتُ نَذْرًا فِي الْجَاهِلِيَّةِ،فَسَأَلْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ مَا أَسْلَمْتُ،فَأَمَرَنِي أَنْ أُوفِيَ بِنَذْرِي»";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے جاہلیت میں ایک نذر مانی۔اسلام قبول کرنے کے بعد میں نے نبی ﷺ سے دریافت کیا تو آپ نے مجھے نذر پوری کرنے کا حکم دیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;