var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ قَالَ: حَدَّثَنَا الْحَارِثُ بْنُ نَبْهَانَ قَالَ: حَدَّثَنَا عَاصِمُ ابْنُ بَهْدَلَةَ،عَنْ مُصْعَبِ بْنِ سَعْدٍ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خِيَارُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ»،قَالَ: «وَأَخَذَ بِيَدِي،فَأَقْعَدَنِي مَقْعَدِي هَذَا أُقْرِئُ»";
ibnemaja.urdu = "عاصم بن بہدلہ نے سیدنا مصعب بن سعد سے اور انہوں نے اپنے والد سیدنا سعد بن ابو وقاص رضی اللہ عنہ سے روایت کیا کہ رسول اللہ ﷺ نے فرمایا:’’تم میں سے وہ لوگ بہتر ہیں جو قرآن سیکھیں اور سیکھائیں۔‘‘ عاصم نے کہا: مصعب بن سعد نے مجھے ہاتھ سے پکڑ کر اس جگہ بٹھایا کہ میں قرآن پڑھاؤں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>قال البوصیري: ’’ ھذا إسناد ضعیف لضعف الحارث بن نبھان ‘‘ وھو متروک <br>والحدیث السابق (الأصل: 211) یغني عن حدیثہ`;
ibnemaja.anwaar = [382,1];