var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنِ ابْنِ شِهَابٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ سَعْدَ بْنَ عُبَادَةَ،اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ،تُوُفِّيَتْ وَلَمْ تَقْضِهِ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اقْضِهِ عَنْهَا»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ حضرت سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ ﷺ سے مسئلہ پوچھا کہ ان کی والدہ کے ذمے نذر تھی،وہ نذر پوری کیے بغیر فوت ہو گئیں تو رسول اللہ ﷺ نے فرمایا: اس کی طرف سے تم پوری کرو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;