var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ: حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَتْ: إِنَّ أُمِّي تُوُفِّيَتْ وَعَلَيْهَا نَذْرُ صِيَامٍ،فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِيَصُمْ عَنْهَا الْوَلِيُّ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ ایک خاتون رسول اللہ ﷺ کی خدمت میں حاضر ہوئیں اور کہا: اللہ کے رسول! میری والدہ فوت ہو گئی ہیں اور ان کے ذمے نذر کے روزے تھے۔وہ نذر پوری کرنے سے پہلے ہی فوت ہو گئیں۔تو رسول اللہ ﷺ نے فرمایا: اس کی طرف سے ولی روزے رکھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن لھیعۃ ضعیف مدلس <br>وحدیث ’’ من مات وعلیہ صیام صام عنہ ولیہ ‘‘ (البخاري:1952،مسلم: 1147) یغني عنہ`;
ibnemaja.anwaar = [455,1];