var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ،عَنْ أَبِي سَعِيدٍ الرُّعَيْنِيِّ،أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكٍ أَخْبَرَهُ،أَنَّ عُقْبَةَ بْنَ عَامِرٍ أَخْبَرَهُ،أَنَّ أُخْتَهُ نَذَرَتْ أَنْ تَمْشِيَ حَافِيَةً،غَيْرَ مُخْتَمِرَةٍ،وَأَنَّهُ ذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: «مُرْهَا فَلْتَرْكَبْ،وَلْتَخْتَمِرْ،وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ»";
ibnemaja.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ ان کی بہن نے ننگے پاؤں اور ننگے سر پیدل سفر (کر کے حج) کرنے کی نذر مان لی۔انہوں نے رسول اللہ ﷺ کو یہ بات بتائی تو آپ نے فرمایا: اسے حکم دو کہ سواری پر بیٹھے،(سر پر) دوپٹہ لے اور تین روزے رکھ لے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3293) ترمذي (1544) نسائي (3846)`;
ibnemaja.anwaar = [455,1];