var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ،قَالُوا: حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ،وَإِنَّ وَلَدَهُ مِنْ كَسْبِهِ»";
ibnemaja.urdu = "ام المومنین حضرت عائشہ صدیقہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: انسان کا بہترین کھانا وہ ہے جو اسکی کمائی سے (حاصل) ہو۔اور اس کی اولاد بھی اس کی کمائی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;