var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ،عَنْ بَحِيرِ بْنِ سَعْدٍ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ الزُّبَيْدِيِّ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَا كَسَبَ الرَّجُلُ كَسْبًا أَطْيَبَ مِنْ عَمَلِ يَدِهِ،وَمَا أَنْفَقَ الرَّجُلُ عَلَى نَفْسِهِ وَأَهْلِهِ وَوَلَدِهِ وَخَادِمِهِ،فَهُوَ صَدَقَةٌ»";
ibnemaja.urdu = "حضرت مقدام بن معدی کریب زبیدہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: کوئی آدمی اپنے ہاتھ کی کمائی سے زیادہ پاکیزہ (اور عمدہ) روزی حاصل نہیں کر سکتا۔اور آدمی اپنی ذات پر،اپنے بیوی بچوں پر اور اپنے خدام پر جو کچھ بھی خرچ کرتا ہے،وہ صدقہ ہوتا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;