var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا كُلْثُومُ بْنُ جَوْشَنٍ الْقُشَيْرِيُّ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «التَّاجِرُ الْأَمِينُ الصَّدُوقُ الْمُسْلِمُ مَعَ الشُّهَدَاءِ يَوْمَ الْقِيَامَةِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہعنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دیانت دار،سچا مسلمان تاجر قیامت کے دن شہیدوں کے ساتھ ہو گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>کلثوم بن جوشن: ضعیف(تقریب: 5655) <br>وللحدیث شاہد ضعیف عند الترمذي (1209)`;
ibnemaja.anwaar = [456,1];