var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ،عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيْلِيِّ،عَنْ أَبِي الْغَيْثِ،مَوْلَى ابْنِ مُطِيعٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ،وَكَالَّذِي يَقُومُ اللَّيْلَ وَيَصُومُ النَّهَارَ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: بیوی اور مسکین (کی ضروریات پوری کرنے) کے لیے دوڑ دھوپ کرنے والا،اللہ کی راہ میں جہاد کرنے والے کی طرح ہے،اور اس شخص کی طرح ہے جو رات کو قیام کرتا اور دن کو روزہ رکھتا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;