var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ،عَنْ عُمَارَةَ بْنِ غَزِيَّةَ،عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ،عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ الْأَنْصَارِيِّ،عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَجْمِلُوا فِي طَلَبِ الدُّنْيَا،فَإِنَّ كُلًّا مُيَسَّرٌ لِمَا خُلِقَ لَهُ»";
ibnemaja.urdu = "حضرت ابوحمید (منذر بن سعد) ساعدی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دنیا کے حصول کے لیے اچھا طریقہ اختیار کرو۔ہر انسان کے لیے وہ کام آسان ہو جاتا ہے جس کے لیے وہ پیدا کیا گیا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;