var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ بِهْرَامٍ قَالَ: حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عُثْمَانَ،زَوْجُ بِنْتِ الشَّعْبِيِّ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنِ الْأَعْمَشِ،عَنْ يَزِيدَ الرَّقَاشِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَعْظَمُ النَّاسِ هَمًّا الْمُؤْمِنُ،الَّذِي يَهْتَمُّ بِأَمْرِ دُنْيَاهُ وَأَمْرِ آخِرَتِهِ» قَالَ أَبُو عَبْدِ اللَّهِ: «هَذَا حَدِيثٌ غَرِيبٌ تَفَرَّدَ بِهِ إِسْمَاعِيلُ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سب سے زیادہ پریشانی اس مومن کو ہوتی ہے جو اپنی دنیا کے معاملات کی بھی فکر کرتا ہے اور اپنی آخرت کے معاملات کی بھی۔\nامام ابن ماجہ رحمۃ اللہ علیہ بیان کرتے ہیں کہ یہ حدیث غریب ہے۔اسے صرف اسماعیل (بن بہرام) نے روایت کیا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>فیہ علل منھا ضعف یزید الرقاشي: زاہد ضعیف`;
ibnemaja.anwaar = [456,1];