var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا فَرْوَةُ أَبُو يُونُسَ،عَنْ هِلَالِ بْنِ جُبَيْرٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصَابَ مِنْ شَيْءٍ فَلْيَلْزَمْهُ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جسے کسی جانب سے (کسی پیشے،علاقے،ملازمت وغیرہ سے) کچھ (رزق) ملے تو اسے چاہیے کہ اس (پیشےوغیرہ) کو اختیار کیے رکھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ہلال مستور (تقریب: 7330) <br>وشک ابن حبان في سماعہ من أنس والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [456,1];