var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ نَافِعٍ،عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِنَّ أَصْحَابَ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ،يُقَالُ لَهُمْ: أَحْيُوا مَا خَلَقْتُمْ";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: بلاشبہ تصویرین بنانے والوں کو قیامت کے دن عذاب ہو گا۔انہیں کہا جائے گا جو کچھ تم نے (اپنے خیال کے مطابق) پیدا کیا تھا،اسے زندہ بھی کرو۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;