var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا عُمَرُ بْنُ هَارُونَ،عَنْ هَمَّامٍ،عَنْ فَرْقَدٍ السَّبَخِيِّ،عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَكْذَبُ النَّاسِ الصَّبَّاغُونَ وَالصَّوَّاغُونَ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سب سے زیادہ جھوٹ بولنے والے رنگریز اور زرگر ہوتے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>فرقد السبخي: ضعیف`;
ibnemaja.anwaar = [456,1];