var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ قَالَ: حَدَّثَنَا أَبُو أَحْمَدَ قَالَ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ عَلِيِّ بْنِ سَالِمِ بْنِ ثَوْبَانَ،عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْجَالِبُ مَرْزُوقٌ،وَالْمُحْتَكِرُ مَلْعُونٌ»";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: بازار میں مال لانے والے کو رزق ملتا ہے اور ذخیرہ اندوزی کرنے والا ملعون ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>علي بن سالم: ضعیف (تقریب: 4736) <br>وکذا علي بن زید بن جدعان <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [456,1];