var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ بْنِ نَضْلَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحْتَكِرُ إِلَّا خَاطِئٌ»";
ibnemaja.urdu = "حضرت معمر بن عبداللہ بن نضلہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: گناہ گار ہی ذخیرہ اندوزی کرتا ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;