var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ: حَدَّثَنَا الْهَيْثَمُ بْنُ رَافِعٍ قَالَ: حَدَّثَنِي أَبُو يَحْيَى الْمَكِّيُّ،عَنْ فَرُّوخَ،مَوْلَى عُثْمَانَ بْنِ عَفَّانَ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «مَنِ احْتَكَرَ عَلَى الْمُسْلِمِينَ طَعَامَهُمْ،ضَرَبَهُ اللَّهُ بِالْجُذَامِ وَالْإِفْلَاسِ»";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو یہ فرماتے سنا: جو مسلمانوں سے کھانے پینے کی چیزوں کی ذخیرہ اندوزی کرے گا،اللہ تعالیٰ اسے جذام اور افلاس میں مبتلا کرے گا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;