var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ ثَوْرِ بْنِ يَزِيدَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ مَعْدَانَ قَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَلْمٍ،عَنْ عَطِيَّةَ الْكَلَاعِيِّ،عَنْ أُبَيِّ بْنِ كَعْبٍ،قَالَ: عَلَّمْتُ رَجُلًا الْقُرْآنَ،فَأَهْدَى إِلَيَّ قَوْسًا،فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: «إِنْ أَخَذْتَهَا أَخَذْتَ قَوْسًا مِنْ نَارٍ»،فَرَدَدْتُهَا";
ibnemaja.urdu = "حضرت ابی بن کعب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے ایک آدمی کو قرآن پڑھایا۔اس نے مجھے تحفے کے طور پر ایک کمان دی۔میں نے رسول اللہ ﷺ کو یہ بات بتائی تو آپ نے فرمایا: اگر تو نے یہ لے لی تو آگ کی کمان لی۔چنانچہ میں نے وہ واپس کر دی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عطیۃ بن قیس الکلاعي عن أبي بن کعب مرسل (جامع التحصیل ص 239) <br>و الحدیث السابق (الأصل: 2157) یغني عنہ`;
ibnemaja.anwaar = [456,1];