var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَمُحَمَّدُ بْنُ الصَّبَّاحِ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي مَسْعُودٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «نَهَى عَنْ ثَمَنِ الْكَلْبِ،وَمَهْرِ الْبَغِيِّ،وَحُلْوَانِ الْكَاهِنِ»";
ibnemaja.urdu = "حضرت ابو مسعود (عقبہ بن عمرو انصاری) رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے کتے کی قیمت،طوائف کی اجرت اور کاہن کا نذرانہ لینے سے منع فرمایا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;