var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ،عَنْ أَبِي عُمَرَ،عَنْ كَثِيرِ بْنِ زَاذَانَ،عَنْ عَاصِمِ بْنِ ضَمْرَةَ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ الْقُرْآنَ وَحَفِظَهُ،أَدْخَلَهُ اللَّهُ الْجَنَّةَ،وَشَفَّعَهُ فِي عَشَرَةٍ مِنْ أَهْلِ بَيْتِهِ،كُلُّهُمْ قَدِ اسْتوْجَبَ النَّارَ»";
ibnemaja.urdu = "سیدنا علی بن ابی طالب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جس شخص نے قرآن پڑھا اور اسے حفظ کیا،اللہ تعالیٰ اسے جنت میں داخل کرے گا اور اس کے گھر والوں میں سے دس ایسے افراد کے حق میں اس کی شفاعت قبول کرے گا جن پر(گناہوں کی وجہس ے) جہنم واجب ہو چکی ہوگی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>ترمذي (2905)`;
ibnemaja.anwaar = [382,1];