var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَمُحَمَّدُ بْنُ طَرِيفٍ،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ،وَعَسْبِ الْفَحْلِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے کتے کی قیمت اور نسل کشی کے جانور (سانڈ) چھوڑنے کی اجرت لینے سے منع فرمایا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;