var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ ابْنِ طَاوُسٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عَبَّاسٍ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،احْتَجَمَ وَأَعْطَاهُ أَجْرَهُ»،«تَفَرَّدَ بِهِ ابْنُ أَبِي عُمَرَ وَحْدَهُ»،قَالَهُ ابْنُ مَاجَةَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے سینگی لگوائی اور اسے (سینگی لگوانے والے کو) اجرت عطا فرمائی۔\nامام ابن ماجہ رحمۃ اللہ علیہ نے کہا: اس روایت کو صرف ابن ابی عمر ہی نے بیان کیا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;