var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ قَالَ: حَدَّثَنِي الْأَوْزَاعِيُّ،عَنِ الزُّهْرِيِّ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ،عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْحَجَّامِ»";
ibnemaja.urdu = "حضرت ابو مسعود عقبہ بن عمرو رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے سینگی لگانے والے کی کمائی سے منع فرمایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;