var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ،عَنِ ابْنِ أَبِي ذِئْبٍ،عَنِ الزُّهْرِيِّ،عَنْ حَرَامِ بْنِ مُحَيِّصَةَ،عَنْ أَبِيهِ،أَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَنْ كَسْبِ الْحَجَّامِ،فَنَهَاهُ عَنْهُ،فَذَكَرَ لَهُ الْحَاجَةَ،فَقَالَ: «اعْلِفْهُ نَوَاضِحَكَ»";
ibnemaja.urdu = "حضرت حرام بن محیصہ رحمۃ اللہ علیہ اپنے والد (حضرت سعد بن محیصہ بن مسعود انصاری رضی اللہ عنہ) سے روایت کرتے ہوئے فرماتے ہیں کہ انہوں نے نبی ﷺ سے سینگی لگانے والے کی کمائی کے متعلق دریافت کیا تو نبی ﷺ نے انہیں اس سے منع فرمایا۔انہوں نے اپنے حاجت مند (اور مفلس) ہونے کا ذکر کیا تو آپ نے فرمایا: اس کا اپنے اونٹوں کو چارہ کھلا دو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;