var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ قَالَ: حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ: حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ،عَنْ عَاصِمٍ،عَنْ أَبِي الْمُهَلَّبِ،عَنْ عُبَيْدِ اللَّهِ الْإِفْرِيقِيِّ،عَنْ أَبِي أُمَامَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْمُغَنِّيَاتِ،وَعَنْ شِرَائِهِنَّ،وَعَنْ كَسْبِهِنَّ،وَعَنْ أَكْلِ أَثْمَانِهِنَّ»";
ibnemaja.urdu = "حضرت ابو امامہ اسعد بن سہل بن حنیف رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے گانے والی لونڈیاں بیچنے اور خریدنے سے ان کی کمائی سے اور ان کی قیمت کھانے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>فیہ علل منھا ضعف عبید اللّٰہ (بن زحر) الإفریقي (ضعیف / د 3293) وھو رواہ عن علي بن یزید ضعیف عند الترمذي (1282) <br>وللحدیث شواہد ضعیفۃ عند الطبراني (212/8 ح 7749) وغیرہ`;
ibnemaja.anwaar = [457,1];