var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،وَأَبُو أُسَامَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ حَفْصِ بْنِ عَاصِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ،عَنِ الْمُلَامَسَةِ،وَالْمُنَابَذَةِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے دو قسم کی بیع سے منع فرمایا ہے: منابذہ سے اور ملامسہ سے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;