var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ،وَلَا يَسُومُ عَلَى سَوْمِ أَخِيهِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: آدمی اپنے بھائی کی بیع پع بیع نہ کرے،اور اپنے بھائی کے سودے پر سودا نہ کرے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;