var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا يَبِيعُ حَاضِرٌ لِبَادٍ،دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: شہری باہر والے کی طرف سے فروخت نہ کرے،لوگوں کو چھوڑ دو کہ اللہ انہیں ایک دوسرے کے ذریعے سے رزق عطا فرمائے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;