var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ هِشَامِ بْنِ حَسَّانَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَلَقَّوْا الْأَجْلَابَ،فَمَنْ تَلَقَّى مِنْهُ شَيْئًا فَاشْتَرَى،فَصَاحِبُهُ بِالْخِيَارِ إِذَا أَتَى السُّوقَ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: سامان لانے والے تاجروں کو (آگے جا کر) نہ ملو۔جو شخص کسی (تاجر) سے جا کر ملا اور اس سے (سامان) خرید لیا تو مالک (بیچنے والا) جب بازار میں پہنچے گا تو اسے اختیار ہو گا (کہ سودا قائم رکھے یا منسوخ کر دے۔)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;