var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،وَحَمَّادُ بْنُ مَسْعَدَةَ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ قَالَ: حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ،قَالَ: سَمِعْتُ أَبِي،قَالَ: حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ تَلَقِّي الْبُيُوعِ»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے (دیہات سے لا کر چیزیں) بیچنے والوں کو (منڈی میں پہنچنے سے پہلے) آگے جا کر ملنے سے منع فرمایا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;