var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ،وَأَحْمَدُ بْنُ الْمِقْدَامِ،قَالَا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ جَمِيلِ بْنِ مُرَّةَ،عَنْ أَبِي الْوَضِيءِ،عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا»";
ibnemaja.urdu = "حضرت ابوبرزہ اسلمی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: خریدنے والے اور بیچنے والے کو اختیار ہے،جب تک وہ ایک دوسرے سے جدا نہ ہوں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;