var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،وَإِسْحَاقُ بْنُ مَنْصُورٍ،قَالَا: حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا»";
ibnemaja.urdu = "حضرت سمرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: خریدنے والے اور بیچنے والے کو اختیار ہے،جب تک وہ ایک دوسرے سے جدا نہ ہوں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;