var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى،وَأَحْمَدُ بْنُ عِيسَى الْمِصْرِيَّانِ،قَالَا: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي ابْنُ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: اشْتَرَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ رَجُلٍ مِنَ الْأَعْرَابِ حِمْلَ خَبَطٍ،فَلَمَّا وَجَبَ الْبَيْعُ،قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اخْتَرْ»،فَقَالَ: الْأَعْرَابِيُّ: عَمْرَكَ اللَّهَ بَيِّعًا";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ایک اعرابی سے درختوں کے پتوں کی ایک گٹھڑی خریدی۔جب بیع ہو چکی تو رسول اللہ ﷺ نے فرمایا: تجھے اختیار ہے (بیع کو قائم رکھے یا فسخ کر دے)۔اعرابی نے کہا: اللہ آپ جیسے سودا کرنے والے کو لمبی عمر دے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1249)`;
ibnemaja.anwaar = [457,1];