var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ دَاوُدَ بْنِ صَالِحٍ الْمَدَنِيِّ،عَنْ أَبِيهِ،قَالَ: سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الْبَيْعُ عَنْ تَرَاضٍ»";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: بیع باہمی رضا مندی سے ہوتی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;