var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي بِشْرٍ،قَالَ: سَمِعْتُ يُوسُفَ بْنَ مَاهَكَ،يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ الرَّجُلُ يَسْأَلُنِي الْبَيْعَ وَلَيْسَ عِنْدِي،أَفَأَبِيعُهُ؟ قَالَ: «لَا تَبِعْ مَا لَيْسَ عِنْدَكَ»";
ibnemaja.urdu = "حضرت حکیم بن حزام رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے عرض کیا: اے اللہ کے رسول! ایک شخص مجھ سے کوئی چیز خریدنا چاہتا ہے جبکہ وہ چیز میرے پاس موجود نہیں،کیا میں اسے وہ چیز بیچ دوں؟ آپ نے فرمایا: جو چیز تیرے پاس نہیں،وہ فروخت نہ کر۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;