var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ،قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،ح وحَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ،قَالَا: حَدَّثَنَا أَيُّوبُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ بَيْعُ مَا لَيْسَ عِنْدَكَ،وَلَا رِبْحُ مَا لَمْ يُضْمَنْ»";
ibnemaja.urdu = "حضرت عمرو بببن شعیب رحمۃ اللہ علیہ اپنے والد شعیب بن محمد رحمۃ اللہ علیہ سے،اور وہ اپنے دادا حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: جو چیز تیرے پاس نہیں،اسے بیچنا جائز نہیں،اور جس کی ذمہ داری قبول نہیں کی گئی،اس پر نفع لینا بھی جائز نہیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;