var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ،عَنْ لَيْثٍ،عَنْ عَطَاءٍ،عَنْ عَتَّابِ بْنِ أَسِيدٍ،قَالَ: «لَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى مَكَّةَ،نَهَاهُ عَنْ شِفِّ مَا لَمْ يُضْمَنْ»";
ibnemaja.urdu = "حضرت عتاب بن اسید رضی اللہ عنہ سے روایت ہے کہ جب رسول اللہ ﷺ نے انہیں مکہ (گورنر بنا کر) بھیجا تو انہیں اس چیز کا نفع لینے سے منع فرمایا جس کی ذمے داری قبول نہ کی گئی ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الحدیث ضعفہ البوصیري وقال: ’’ وعطاء ھو ابن أبي رباح لم یدرک عتابًا ‘‘`;
ibnemaja.anwaar = [457,1];