var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ: حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،أَوْ سَمُرَةَ بْنِ جُنْدَبٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «أَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا»";
ibnemaja.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ یا حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو شخص دو آدمیوں سے بیع کرے تو وہ ان دونوں میں سے پہلے آدمی کی ہو گی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;