var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلَانِيُّ،وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا بَاعَ الْمُجِيزَانِ فَهُوَ لِلْأَوَّلِ»";
ibnemaja.urdu = "حضرت سمرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب دو صاحب اختیار بیع کریں تو وہ پہلے کی ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;