var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ أَبِي الزِّنَادِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْغَرَرِ،وَعَنْ بَيْعِ الْحَصَاةِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے بیان کیا: رسول اللہ ﷺ نے دھوکے کی بیع اور کنکری کی بیع سے منع فرمایا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;