var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ،قَالَا: حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ قَالَ: حَدَّثَنَا أَيُّوبُ بْنُ عُتْبَةَ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْغَرَرِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے دھوکے کی بیع سے منع فرمایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;