var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زِيَادُ بْنُ يَحْيَى أَبُو الْخَطَّابِ قَالَ: حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَقَالَ مُسْلِمًا،أَقَالَهُ اللَّهُ عَثْرَتَهُ يَوْمَ الْقِيَامَةِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص کسی مسلمان کی بیع واپس کر لے گا تو اللہ تعالیٰ قیامت کے دن اس کے گناہ معاف فرما دے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3460)`;
ibnemaja.anwaar = [457,1];