var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ مَعْمَرٍ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:’’اللہ تعالیٰ جس کے ساتھ بھلائی کا ارادہ فرماتا ہے،اسے دین کی سمجھ عطا کر دیتا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;