var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ أَبُو بَكْرٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُلَيَّةَ،عَنْ يُونُسَ بْنِ عُبَيْدٍ،عَنْ عَطَاءِ بْنِ فَرُّوخَ،قَالَ: قَالَ عُثْمَانُ بْنُ عَفَّانَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَدْخَلَ اللَّهُ الْجَنَّةَ رَجُلًا كَانَ سَهْلًا بَائِعًا وَمُشْتَرِيًا»";
ibnemaja.urdu = "حضرت عثمان بن عفان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ نے ایک آدمی کو جنت میں داخل کر دیا۔وہ بیچتے وقت بھی نرمی کرتا تھا اور خریدتے وقت بھی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;