var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ قَالَ: حَدَّثَنَا أَبِي قَالَ: حَدَّثَنَا أَبُو غَسَّانَ مُحَمَّدُ بْنُ مُطَرِّفٍ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رَحِمَ اللَّهُ عَبْدًا سَمْحًا إِذَا بَاعَ،سَمْحًا إِذَا اشْتَرَى،سَمْحًا إِذَا اقْتَضَى»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ اس بندے پر رحم فرمائے جو بیچتے وقت نرمی کرتا ہے،خریدتے وقت نرمی کرتا ہے اور جب تقاضا کرتا ہے تو نرمی کرتا ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;