var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَسَهْلُ بْنُ أَبِي سَهْلٍ،قَالَا: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ: أَنْبَأَنَا الرَّبِيعُ بْنُ حَبِيبٍ،عَنْ نَوْفَلِ بْنِ عَبْدِ الْمَلِكِ،عَنْ أَبِيهِ،عَنْ عَلِيٍّ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ السَّوْمِ قَبْلَ طُلُوعِ الشَّمْسِ،وَعَنْ ذَبْحِ ذَوَاتِ الدَّرِّ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے سورج لوع ہونے سے پہلے (کسی چیز کا) مول کرنے سے اور دودھ دیتا جانور ذبح کرنے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نوفل بن عبدالملک: مستور (تقریب: 7215) <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [457,1];