var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،ح وحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ،عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ،عَنْ أَبِي قَتَادَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِيَّاكُمْ وَالْحَلِفَ فِي الْبَيْعِ،فَإِنَّهُ يُنَفِّقُ،ثُمَّ يَمْحَقُ»";
ibnemaja.urdu = "حضرت ابوقتادہ حارث بن ربعی انصاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: فروخت کرتے وقت قسم کھانے سے اجتناب کرو،یہ سودے میں رغبت پیدا کرتی ہے (جس سے پہلے پہل سودا زیادہ بکتا ہے)،پھر برکت ختم کر دیتی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;