var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ جَنَاحٍ،عَنْ يُونُسَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ،أَنَّهُ حَدَّثَهُ،قَالَ: سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ،يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الْخَيْرُ عَادَةٌ،وَالشَّرُّ لَجَاجَةٌ،وَمَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ»";
ibnemaja.urdu = "سیدنا معاویہ بن سفیان رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’نیکی عادت ہے اور گناہ ایک جھگڑا ہے۔اور اللہ تعالیٰ جس کے لئے بھلائی کا ارادہ فرماتا ہے،اسے دین کی سمجھ عطا کر دیتا ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;