var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: «مَنْ بَاعَ نَخْلًا وَبَاعَ عَبْدًا جَمَعَهُمَا جَمِيعًا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو شخص کھجور کے درخت بیچے اور غلام بیچے... نافع رحمۃ اللہ علیہ نے ابن عمر رضی اللہ عنہ سے دونوں جملے اکٹھے (ایک جملہ کی صورت میں) روایت کیے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;