var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ قَالَ: حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ،عَنْ مُوسَى بْنِ عُقْبَةَ قَالَ: حَدَّثَنِي إِسْحَاقُ بْنُ يَحْيَى بْنِ الْوَلِيدِ،عَنْ عُبَادَةَ بْنِ الصَّامِتِ،قَالَ: «قَضَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِثَمَرِ النَّخْلِ لِمَنْ أَبَّرَهَا،إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ،وَأَنَّ مَالَ الْمَمْلُوكِ لِمَنْ بَاعَهُ،إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ»";
ibnemaja.urdu = "حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے فیصلہ فرمایا کہ کھجور کے درختوں کا پھل تابیر کرنے والے کا ہے،سوائے اس صورت کے کہ خریدار شرط کر لے۔اور غلام کا مال بیچنے والے کا ہے،سوائے اس صورت کے کہ خریدار شرط کر لے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إسحاق بن یحیی بن الولید أرسل عن عبادۃ وھو مجھول الحال (تقریب:392)`;
ibnemaja.anwaar = [457,1];