var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَبِيعُوا الثَّمَرَةَ حَتَّى يَبْدُوَ صَلَاحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِيَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: پھل اس وقت تک نہ بیچو،جب تک ان کا صحیح ہونا ظاہر نہ ہو جائے۔نبی ﷺ نے بیچنے والے اور خریدنے والے (دونوں) کو منع فرمایا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;