var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرَةِ حَتَّى تَزْهُوَ وَعَنْ بَيْعِ الْعِنَبِ حَتَّى يَسْوَدَّ وَعَنْ بَيْعِ الْحَبِّ حَتَّى يَشْتَدَّ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے پھلوں کی فروخت سے منع فرمایا حتی کہ ان کا رنگ بدل جائے،اور انگوروں کی فروخت سے منع فرمایا حتی کہ وہ سیاہ ہو جائیں،اور حلے (گندم اور جو وغیرہ) کی فروخت سے منع فرمایا حتی کہ وہ سخت ہو جائیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;