var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ السِّنِينَ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے کئی سال کا (آئندہ پیدا ہونے والا) پھل فروکت کرنے سے منع فرمایا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;