var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَاعَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلَا يَأْخُذْ مِنْ مَالِ أَخِيهِ شَيْئًا عَلَامَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ الْمُسْلِمِ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص (باغ کا) پھل فروخت کرے،پھر اس پر آفت آ جائے تو اس (بیچنے والے) کو چاہیے کہ اپنے بھائی کے مال سے کچھ نہ لے (اس کی قیمت وصول نہ کرے۔) وہ اپنے مسلمان بھائی کا مال کس وجہ سے لیتا ہے؟";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;