var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا رَوْحُ بْنُ جَنَاحٍ أَبُو سَعْدٍ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَقِيهٌ وَاحِدٌ أَشَدُّ عَلَى الشَّيْطَانِ مِنْ أَلْفِ عَابِدٍ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:’’ایک فقیہ(دین کی صحیح سمجھ رکھنے والا عالم) شیطان کو ایک ہزار(جاہل) عبادت گزار افراد سے زیادہ ناگوار اور بھاری ہوتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>ترمذي (2681)`;
ibnemaja.anwaar = [382,1];