var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ مَالِكًا أَبَا صَفْوَانَ بْنَ عُمَيْرَةَ قَالَ بِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِجْلَ سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَوَزَنَ لِي فَأَرْجَحَ لِي";
ibnemaja.urdu = "حضرت ابو صفوان بن عمیرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے ہجرت سے پہلے رسول اللہ ﷺ کے ہاتھ ایک پاجامہ فروخت کیا۔آپ نے (اس کی قیمت کے طور پر سونا،چاندی یا غلہ) مجھے تول کر عطا فرمایا اور جھکتا ہوا تولا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;