var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ يَبِيعُ طَعَامًا فَأَدْخَلَ يَدَهُ فِيهِ فَإِذَا هُوَ مَغْشُوشٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنَّا مَنْ غَشَّ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ایک آدمی کے پاس سے گزرے جو غلہ فروخت کر رہا تھا۔آپ نے اس (غلے) میں ہاتھ ڈالا تو معلوم ہوا کہ اس میں دھوکا ہے۔رسول اللہ ﷺ نے فرمایا: جو دھوکا دے،وہ ہم میں سے نہیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;