var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي دَاوُدَ عَنْ أَبِي الْحَمْرَاءِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِجَنَبَاتِ رَجُلٍ عِنْدَهُ طَعَامٌ فِي وِعَاءٍ فَأَدْخَلَ يَدَهُ فِيهِ فَقَالَ لَعَلَّكَ غَشَشْتَ مَنْ غَشَّنَا فَلَيْسَ مِنَّا";
ibnemaja.urdu = "(نبی ﷺ کے آزاد کردہ غلام) حضرت ابوالحمراء (ہلال بن حارث رضی اللہ عنہ) سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ایک آدمی کے پاس سے گزرے جس کے پاس ایک برتن میں کھانے کی چیز (گندم یا کھجور وغیرہ) تھی۔آپ نے اس میں ہاتھ ڈالا،پھر فرمایا: شاید تو نے دھوکا کیا ہے۔جس نے ہمیں دھوکا دیا،وہ ہم میں سے نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>أبو داود الأعمی متھم بالکذب`;
ibnemaja.anwaar = [458,1];