var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الطَّعَامِ حَتَّى يَجْرِيَ فِيهِ الصَّاعَانِ صَاعُ الْبَائِعِ وَصَاعُ الْمُشْتَرِي";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے کھانے کی چیز (غلہ وغیرہ) فروخت کرنے سے منع فرمایا،جب تک اسے دو پیمانے نہ ماپ لیں: بیچنے والے کا پیمانہ اور خریدنے والے کا پیمانہ۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>محمد بن أبي لیلی: ضعیف <br>وأبو الزبیر عنعن <br>وللحدیث شاھد عند البیھقي (5/ 316) من حدیث أبي ھریرۃ رضي اللّٰہ عنہ،فیہ ھشام بن حسان مدلس (د 443) <br>ولم أجد تصریح سماعہ`;
ibnemaja.anwaar = [458,1];