var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كُنَّا نَشْتَرِي الطَّعَامَ مِنْ الرُّكْبَانِ جِزَافًا فَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَبِيعَهُ حَتَّى نَنْقُلَهُ مِنْ مَكَانِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ قافلوں سے غلہ ماپے تولے بغیر خرید لیتے تھے۔رسول اللہ ﷺ نے ہمیں اس کو بیچنے سے منع فرمایا حتی کہ اس کی جگہ سے منتقل کر لیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;