var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْيَحْصُبِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ الْمَازِنِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ";
ibnemaja.urdu = "حضرت عبداللہ بن بسر مازنی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: اپنا کھانا (غلہ وغیرہ) ماپ لیا کرو،اس میں تمہارے لیے برکت ہو گی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = `التاریخ الکبیر للبخاري (151/1) وسندہ حسن`;