var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ الْمِقْدَامِ بْنِ مَعْدِ يكَرِبَ عَنْ أَبِي أَيُّوبَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ";
ibnemaja.urdu = "حضرت ابو ایوب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اپنا کھانا (غلہ وغیرہ) ماپ لیا کرو،اس میں تمہارے لیے برکت ہو گی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;