var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْسُ بْنُ مَيْمُونٍ حَدَّثَنَا عَوْنٌ الْعُقَيْلِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ سَلْمَانَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ غَدَا إِلَى صَلَاةِ الصُّبْحِ غَدَا بِرَايَةِ الْإِيمَانِ وَمَنْ غَدَا إِلَى السُّوقِ غَدَا بِرَايَةِ إِبْلِيسَ";
ibnemaja.urdu = "حضرت سلمان رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: جو شخص صبح کے وقت فجر کی نماز کے لیے جاتا ہے،وہ ایمان کا جھنڈا لے کر جاتا ہے۔اور جو شخص صبح صبح بازار جاتا ہے،وہ ابلیس کا جھنڈا لے کر جاتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عبیس بن میمون: ضعیف متروک کما قال الہیثمي(مجمع الزوائد 77/4) وقال البوصیري: ’’ھو متفق علی تضعیفہ ‘‘`;
ibnemaja.anwaar = [458,1];