var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَدَنِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا يَوْمَ الْخَمِيسِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اے اللہ! میری امت کے لیے جمعرات کی صبح میں برکت عطا فرما۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>محمد بن میمون: لم أجد من وثقہ وقال ابن حجر في حدیثہ: ’’ منکر ‘‘ (تہذیب التہذیب 428/9ط دار الفکر) <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [458,1];