var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا إِسْحَقُ بْنُ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْجَدْعَانِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اے اللہ! میری امت کے لیے صبح کے وقت میں برکت عطا فرما۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;