var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ابْتَاعَ مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا صَاعًا مِنْ تَمْرٍ لَا سَمْرَاءَ يَعْنِي الْحِنْطَةَ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جس نے ایسا جانور خریدا جس کا دودھ روکا گیا تھا تو اسے تین دن تک اختیار ہے (کہ سودا قائم رکھے یا ختم کر دے) اگر وہ جانور کو واپس کرے تو اس کے ساتھ ایک صاع کھجوریں بھی دے،گندم نہ دے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;