var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا حَفْصُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ شِنْظِيرٍ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ،وَوَاضِعُ الْعِلْمِ عِنْدَ غَيْرِ أَهْلِهِ كَمُقَلِّدِ الْخَنَازِيرِ الْجَوْهَرَ وَاللُّؤْلُؤَ وَالذَّهَبَ»";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:’’علم طلب کرنا ہر مسلمان پر فرض ہے۔اور علم کو نااہلوں کے سامنے رکھنے والا ایسے ہے جیسے خنزیروں کو جواہرات،موتیوں اور سونے کے ہار پہنانے والا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>حفص القارئ: متروک`;
ibnemaja.anwaar = [382,1];