var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا صَدَقَةُ بْنُ سَعِيدٍ الْحَنَفِيُّ حَدَّثَنَا جُمَيْعُ بْنُ عُمَيْرٍ التَّيْمِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَيُّهَا النَّاسُ مَنْ بَاعَ مُحَفَّلَةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا مِثْلَيْ لَبَنِهَا أَوْ قَالَ مِثْلَ لَبَنِهَا قَمْحًا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: لوگو! جس نے دودھ روکا ہوا جانور خرید لیا،اسے تین دن تک (واپس کرنے کا) اختیار ہے۔اگر وہ واپس کرے تو اس کے ساتھ اس کے دودھ کا دگنا ادا کرے۔یا فرمایا: اس کے دودھ کے مثل گندم اداکرے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3446)`;
ibnemaja.anwaar = [458,1];