var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ جَابِرٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ قَالَ أَشْهَدُ عَلَى الصَّادِقِ الْمَصْدُوقِ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ حَدَّثَنَا قَالَ بَيْعُ الْمُحَفَّلَاتِ خِلَابَةٌ وَلَا تَحِلُّ الْخِلَابَةُ لِمُسْلِمٍ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں گواہی دیتا ہوں کہ سچ بولنے والے،اور جنہیں سچی خبریں دی گئیں،(یعنی) ابوالقاسم (رسول اللہ ﷺ) نے ہمیں حدیث سنائی اور فرمایا: ان مادہ جانوروں کی فروخت دھوکا ہے جن کا دودھ روکا گیا ہو۔اور مسلمان کے لیے دھوکا بازل حرام ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>جابر الجعفي: ضعیف رافضي مدلس`;
ibnemaja.anwaar = [458,2];