var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ مَخْلَدِ بْنِ خُفَافِ بْنِ إِيمَاءَ بْنِ رَحَضَةَ الْغِفَارِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ خَرَاجَ الْعَبْدِ بِضَمَانِهِ";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فیصلہ جاری فرمایا کہ غلام کا فائدہ اس (کے نقصان) کی ذمے داری کے ساتھ ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;