var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ الزَّنْجِيُّ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَجُلًا اشْتَرَى عَبْدًا فَاسْتَغَلَّهُ ثُمَّ وَجَدَ بِهِ عَيْبًا فَرَدَّهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ اسْتَغَلَّ غُلَامِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَرَاجُ بِالضَّمَانِ";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ ایک آدمی نے ایک غلام خریدا اور اس سے مزدوری کروائی،پھر اس غلام میں عیب معلوم ہوا تو اسے واپس کر دیا۔بیچنے والے نے کہا: اے اللہ کے رسول! اس نے میرے غلام سے مزدوری کروائی ہے (لہذا وہ آمدنی مجھے دلوائی جائے)۔تو رسول اللہ ﷺ نے فرمایا: فائدہ (نقصان کی) ذمے داری کے ساتھ ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3510)`;
ibnemaja.anwaar = [459,1];