var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ إِنْ شَاءَ اللَّهُ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُهْدَةُ الرَّقِيقِ ثَلَاثَةُ أَيَّامٍ";
ibnemaja.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: غلام کی ذؐمے داری تین دن تک ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>قتادۃ عنعن <br>وللحدیث شاہد ضعیف،انظر الحدیث الآتي (2245)`;
ibnemaja.anwaar = [459,1];