var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ يُحَدِّثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَحِلُّ لِمُسْلِمٍ بَاعَ مِنْ أَخِيهِ بَيْعًا فِيهِ عَيْبٌ إِلَّا بَيَّنَهُ لَهُ";
ibnemaja.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: مسلمان مسلمان کا بھائی ہے،اور جو مسلمان اپنے بھائی کے ہاتھ کوئی عیب دار چیز بیچے اس کے لیے حلال نہیں کہ اس کے لیے (وہ عیب) بیان نہ کرے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;