var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ مُعَاوِيَةَ بْنِ يَحْيَى عَنْ مَكْحُولٍ وَسُلَيْمَانَ بْنِ مُوسَى عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَاعَ عَيْبًا لَمْ يُبَيِّنْهُ لَمْ يَزَلْ فِي مَقْتِ اللَّهِ وَلَمْ تَزَلْ الْمَلَائِكَةُ تَلْعَنُهُ";
ibnemaja.urdu = "حضرت واثلہ بن اسقع رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: جس شخص نے بتائے بغیر عیب دار چیز بیچ دی،وہ ہمیشہ اللہ کے غضب میں مبتلا رہے گا،اور فرشتے اس پر ہمیشہ لعنت کرتے رہیں گے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>بقیۃ عنعن`;
ibnemaja.anwaar = [459,1];