var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ جَابِرٍ عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِالسَّبْيِ أَعْطَى أَهْلَ الْبَيْتِ جَمِيعًا كَرَاهِيَةَ أَنْ يُفَرِّقَ بَيْنَهُمْ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ کی خدمت میں جب غلام حاضر کیے جاتے تو آپ ایک گھر کے سب افراد (ایک شخص کو) عطا فرماتے،ان کے درمیان جدائی ڈالنا پسند نہ فرماتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>جابر ضعیف رافضي`;
ibnemaja.anwaar = [459,1];