var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَفَّانُ عَنْ حَمَّادٍ أَنْبَأَنَا الْحَجَّاجُ عَنْ الْحَكَمِ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ عَلِيٍّ قَالَ وَهَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُلَامَيْنِ أَخَوَيْنِ فَبِعْتُ أَحَدَهُمَا فَقَالَ مَا فَعَلَ الْغُلَامَانِ قُلْتُ بِعْتُ أَحَدَهُمَا قَالَ رُدَّهُ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے رسول اللہ ﷺ نے دو غلام عطا فرمائے جو آپس میں بھائی تھے۔میں نے ان میں سے ایک بیچ دیا۔آپ ﷺ نے فرمایا: ان دو غلاموں کا کیا حال ہے؟ میں نے کہا: میں نے ان میں سے ایک بیچ دیا ہے۔آپ نے فرمایا: اسے واپس لے لو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1284)`;
ibnemaja.anwaar = [459,1];