var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَنْبَأَنَا إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ عَنْ طَلِيقِ بْنِ عِمْرَانَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَرَّقَ بَيْنَ الْوَالِدَةِ وَوَلَدِهَا وَبَيْنَ الْأَخِ وَبَيْنَ أَخِيهِ";
ibnemaja.urdu = "حضرت ابو موسیٰ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے اس شخص پر لعنت فرمائی ہے جو ماں بیٹے میں،یا بھائی بھائی میں جدائی ڈالے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن مجمع ضعیف <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [459,1];