var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفِضَّةَ بِالْفِضَّةِ وَالذَّهَبَ بِالذَّهَبِ وَالشَّعِيرَ بِالشَّعِيرِ وَالْحِنْطَةَ بِالْحِنْطَةِ مِثْلًا بِمِثْلٍ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: چاندی کے بدلے میں چاندی،سونے کے بدلے میں سونا،جو کے بدلے میں جو،اور گندم کے بدلے میں گندم برابر برابر (تبادلہ) ہونا چاہیے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;