var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ سَمِعَ مَالِكَ بْنَ أَوْسِ بْنِ الْحَدَثَانِ يَقُولُ سَمِعْتُ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالْوَرِقِ رِبًا إِلَّا هَاءَ وَهَاءَ قَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ سَمِعْتُ سُفْيَانَ يَقُولُ الذَّهَبُ بِالْوَرِقِ احْفَظُوا";
ibnemaja.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: چاندی کے بدلے میں سونا لینا سود ہے مگر جب دست بدست ہو (پھر نہیں)۔ابوبکر بن ابو شیبہ بیان کرتے ہیں کہ حضرت سفیان بن عیینہ رحمۃ اللہ علیہ نے فرمایا: چاندی کے بدلے میں سونا،یاد رکھو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;