var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَسُوَيْدُ بْنُ سَعِيدٍ وَهَارُونُ بْنُ إِسْحَقَ قَالُوا حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ فَضَاءٍ عَنْ أَبِيهِ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْرِ سِكَّةِ الْمُسْلِمِينَ الْجَائِزَةِ بَيْنَهُمْ إِلَّا مِنْ بَأْسٍ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے مسلمانوں کا رائج سکہ بلا ضرورت توڑنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3449)`;
ibnemaja.anwaar = [459,1];