var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے حضرت زید بن ثابت رضی اللہ عنہ نے بتایا کہ رسول اللہ ﷺ نے عرایا کے بارے میں رخصت دی ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;