var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ وَأَبُو خَالِدٍ عَنْ حَجَّاجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا بَأْسَ بِالْحَيَوَانِ وَاحِدًا بِاثْنَيْنِ يَدًا بِيَدٍ وَكَرِهَهُ نَسِيئَةً";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ایک جانور کا دو جانوروں سے دست بدست تبادلہ کرنے میں کوئی حرج نہیں۔اور نبی ﷺ نے (اس قسم کا تبادلہ) ادھار کے ساتھ ناپسند فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1238)`;
ibnemaja.anwaar = [459,1];