var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا الْحُسَيْنُ بْنُ عُرْوَةَ ح و حَدَّثَنَا أَبُو عُمَرَ حَفْصُ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى صَفِيَّةَ بِسَبْعَةِ أَرْؤُسٍ قَالَ عَبْدُ الرَّحْمَنِ مِنْ دِحْيَةَ الْكَلْبِيِّ";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے حضرت صفیہ رضی اللہ عنہا کو سات غلاموں کے عوض خریدا تھا۔\nعبدالرحمٰن بن مہدی رحمۃ اللہ علیہ نے اس حدیث میں یہ الفاظ بھی بیان فرمائے: حضرت دحیہ کلبی رضی اللہ عنہ سے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;