var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَبِي الصَّلْتِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى قَوْمٍ بُطُونُهُمْ كَالْبُيُوتِ فِيهَا الْحَيَّاتُ تُرَى مِنْ خَارِجِ بُطُونِهِمْ فَقُلْتُ مَنْ هَؤُلَاءِ يَا جِبْرَائِيلُ قَالَ هَؤُلَاءِ أَكَلَةُ الرِّبَا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس رات مجھے معراج ہوئی،(اس سفر کے دوران میں) میرا گزر ایسے افراد کے پاس سے ہوا جن کے پیٹ مکانوں کی طرح (بڑے بڑے) تھے،ان (پیٹوں) میں سانپ بھرے ہوئے تھے جو ان کے پیٹوں کے باہر سے نظر آ رہے تھے۔میں نے کہا: جبریل! یہ کون لوگ ہیں؟ جبریل علیہ السلام نے فرمایا: یہ سود کھانے والے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو الصلت:مجہول (تقریب: 8178) <br>وتلمیذہ علي بن زید ضعیف`;
ibnemaja.anwaar = [460,1];