var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ أَبِي مَعْشَرٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرِّبَا سَبْعُونَ حُوبًا أَيْسَرُهَا أَنْ يَنْكِحَ الرَّجُلُ أُمَّهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سود کے ستر گناہ ہیں جن میں سب سے ہلکا گناہ اس قدر (بڑا) ہے جیسے کوئی شخص اپنی ماں سے نکاح کرے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>وقال البوصیري: ’’ ھذا إسناد ضعیف،أبو معشر ھو نجیح بن عبد الرحمٰن متفق علی تضعیفہ ‘‘ <br>و للحدیث شواھد ضعیفۃ عند ابن الجارود (647) و الحاکم (2/ 37) وغیرہما`;
ibnemaja.anwaar = [460,1];