var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ الصَّيْرَفِيُّ أَبُو حَفْصٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ زُبَيْدٍ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرِّبَا ثَلَاثَةٌ وَسَبْعُونَ بَابًا";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: سود کے تہتر دروازے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>إبراھیم النخعي مدلس وعنعن<br>اضافہ از معاذ: ولہ شاھد موقوف صحیح عند المروزی فی السنۃ (201،وسندہ صحیح) والخلال فی السنۃ (1496) وھو یغني عنہ،لعلہ حکمًا مرفوعًا،واللہ اعلم`;
ibnemaja.anwaar = [460,1];