var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ إِنَّ آخِرَ مَا نَزَلَتْ آيَةُ الرِّبَا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُبِضَ وَلَمْ يُفَسِّرْهَا لَنَا فَدَعُوا الرِّبَا وَالرِّيبَةَ";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: سب سے آخر میں سود کی آیت نازل ہوئی اور رسول اللہ ﷺ اس کی تشریح کرنے سے پہلے فوت ہو گئے،اس لیے سود کو بھی چھوڑ دو اور مشکوک صورت سے بھی پرہیز کرو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قتادۃ عنعن <br>ولہ طریق آخر عند الإسماعیلي کما في مسند الفاروق (571/2) <br>وإسنادہ ضعیف`;
ibnemaja.anwaar = [460,1];