var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ آكِلَ الرِّبَا وَمُؤْكِلَهُ وَشَاهِدِيهِ وَكَاتِبَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے سود کھانے والے پر،دوس دینے والے پر،اس کے گواہوں پر اور اس کی تحریر لکھنے والے پر لعنت فرمائی ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;