var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ سَعِيدِ بْنِ أَبِي خَيْرَةَ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى مِنْهُمْ أَحَدٌ إِلَّا آكِلُ الرِّبَا فَمَنْ لَمْ يَأْكُلْ أَصَابَهُ مِنْ غُبَارِهِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: لوگوں پر ضرور ایسا زمانہ آئے گا جس میں کوئی شخص سود کھائے بغیر نہیں رہے گا۔جو شخص سود نہیں کھائے گا اسے بھی اس کا گردوغبار تو پہنچ ہی جائے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داو د (3331) نسائي (4460)`;
ibnemaja.anwaar = [460,1];