var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ إِسْرَائِيلَ عَنْ الرُّكَيْنِ بْنِ الرَّبِيعِ بْنِ عُمَيْلَةَ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَحَدٌ أَكْثَرَ مِنْ الرِّبَا إِلَّا كَانَ عَاقِبَةُ أَمْرِهِ إِلَى قِلَّةٍ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو شخص سود کے ذریعے سے مال میں اضافہ کرے گا،اس کا انجام کار مال کی قلت ہو گا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;