var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنْ قَائِدِ السَّائِبِ عَنْ السَّائِبِ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْتَ شَرِيكِي فِي الْجَاهِلِيَّةِ فَكُنْتَ خَيْرَ شَرِيكٍ لَا تُدَارِينِي وَلَا تُمَارِينِي";
ibnemaja.urdu = "حضرت سائب بن صیفی مخزومی رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی ﷺ سے کہا: آپ زمانہ جاہلیت میں میرے شریک تھے تو آپ بہترین شریک تھے۔آپ نہ مجھ سے مقابلہ کرتے تھے،نہ جھگڑا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4836)`;
ibnemaja.anwaar = [461,1];