var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَ اشْتَرَكْتُ أَنَا وَسَعْدٌ وَعَمَّارٌ يَوْمَ بَدْرٍ فِيمَا نُصِيبُ فَلَمْ أَجِئْ أَنَا وَلَا عَمَّارٌ بِشَيْءٍ وَجَاءَ سَعْدٌ بِرَجُلَيْنِ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے،حضرت سعد رضی اللہ عنہ نے اور حضرت عمار رضی اللہ عنہ نے جنگ بدر کے دن حاصل ہونے والے مال غنیمت میں شراکت کی۔میں اور حضرت عمار رضی اللہ عنہ کچھ نہ لائے،جب کہ حضرت سعد رضی اللہ عنہ (کفار کے) دو آدمی (گرفتار کر کے) لے آئے۔(جو ہم تینوں کے مشترکہ غلام ہوئے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3388) نسائي (3969،4701)`;
ibnemaja.anwaar = [461,1];