var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا بِشْرُ بْنُ ثَابِتٍ الْبَزَّارُ حَدَّثَنَا نَصْرُ بْنُ الْقَاسِمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ دَاوُدَ عَنْ صَالِحِ بْنِ صُهَيْبٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثٌ فِيهِنَّ الْبَرَكَةُ الْبَيْعُ إِلَى أَجَلٍ وَالْمُقَارَضَةُ وَأَخْلَاطُ الْبُرِّ بِالشَّعِيرِ لِلْبَيْتِ لَا لِلْبَيْعِ";
ibnemaja.urdu = "حضرت صالح بن صہیب بن سنان رحمۃ اللہ علیہ اپنے والد (حضرت صہیب رومی رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: تین چیزوں میں برکت ہے: ادھار بیچنا،مقارضہ،اور گھر میں استعمال کے لیے گندم میں جو ملا لینا،بیچنے کے لیے نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>نصر: مجہول،وصالح (بن صہیب بن سنان الرومی): مجہول الحال (تقریب: 7123،2870) وأوردہ ابن الجوزي فی الموضوعات (2/ 248،249)`;
ibnemaja.anwaar = [461,1];