var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ عَمَّتِهِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَطْيَبَ مَا أَكَلْتُمْ مِنْ كَسْبِكُمْ وَإِنَّ أَوْلَادَكُمْ مِنْ كَسْبِكُمْ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: تمہارا بہترین کھانا وہ ہے جو تمہاری کمائی سے (حاصل) ہو۔اور تمہاری اولاد بھی تمہاری کمائی ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;