var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا يُوسُفُ بْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالًا وَوَلَدًا وَإِنَّ أَبِي يُرِيدُ أَنْ يَجْتَاحَ مَالِي فَقَالَ أَنْتَ وَمَالُكَ لِأَبِيكَ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے کہا: اے اللہ کے رسول! میرے پاس کچھ مال ہے اور میری اولاد بھی ہے۔اور میرا باپ میرا سارا مال لے لینا چاہتا ہے تو آپ ﷺ نے فرمایا: تو بھی اور تیرا مال بھی تیرے باپ ہی کا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;