var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنِي شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُنْفِقُ الْمَرْأَةُ مِنْ بَيْتِهَا شَيْئًا إِلَّا بِإِذْنِ زَوْجِهَا قَالُوا يَا رَسُولَ اللَّهِ وَلَا الطَّعَامَ قَالَ ذَلِكَ مِنْ أَفْضَلِ أَمْوَالِنَا";
ibnemaja.urdu = "حضرت ابو امامہ باہلی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: عورت اپنے گھر کی کوئی چیز خاوند کی اجازت کے بغیر خرچ نہ کرے۔حاضرین نے عرض کیا: اے اللہ کے رسول! کھانا پر نہیں؟ آپ نے فرمایا: وہ تو ہمارا عمدہ مال ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;