var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مُسْلِمٍ الْمُلَائِيِّ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجِيبُ دَعْوَةَ الْمَمْلُوكِ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ غلام کی دعوت قبول کر لیا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1017) والحدیث الآتي (4178)`;
ibnemaja.anwaar = [461,1];