var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ وَأَيُّوبُ بْنُ حَسَّانَ الْوَاسِطِيُّ وَعَلِيُّ بْنُ سَلَمَةَ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَرَّ أَحَدُكُمْ بِحَائِطٍ فَلْيَأْكُلْ وَلَا يَتَّخِذْ خُبْنَةً";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب کوئی شخص کسی باغ کے پاس سے گزرے تو اس میں سے کھا سکتا ہے لیکن کپڑوں میں چھپا کر نہ لے جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1287)`;
ibnemaja.anwaar = [461,1];