var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ عَامِرٍ عَنْ عُرْوَةَ الْبَارِقِيِّ يَرْفَعُهُ قَالَ الْإِبِلُ عِزٌّ لِأَهْلِهَا وَالْغَنَمُ بَرَكَةٌ وَالْخَيْرُ مَعْقُودٌ فِي نَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ";
ibnemaja.urdu = "حضرت عروہ بن جعد بارقی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اونٹ اپنے مالکوں کے لیے قوت کا باعث ہیں،اور بکریاں برکت والی ہیں،اور گھوڑوں کی پیشانی کے بالوں سے قیامت تک خیر کا تعلق قائم کر دیا گیا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;