var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِصْمَةُ بْنُ الْفَضْلِ النَّيْسَابُورِيُّ وَمُحَمَّدُ بْنُ فِرَاسٍ أَبُو هُرَيْرَةَ الصَّيْرَفِيُّ قَالَا حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ حَدَّثَنَا زَرْبِيٌّ إِمَامُ مَسْجِدِ هِشَامِ بْنِ حَسَّانَ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّاةُ مِنْ دَوَابِّ الْجَنَّةِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: بکری جنت کے جانوروں میں سے ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال البوصیري: ’’ زربي (بن عبد اللّٰہ) متفق علی ضعفہ ‘‘ ضعیف (تقریب: 2013) <br>وللحدیث طریق آخر مظلم عند الخطیب (435/7) <br>وللحدیث شواہد ضعیفۃ فی الصحیحۃ للألباني (1128) !`;
ibnemaja.anwaar = [461,1];