var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عَلِيُّ بْنُ عُرْوَةَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَغْنِيَاءَ بِاتِّخَاذِ الْغَنَمِ وَأَمَرَ الْفُقَرَاءَ بِاتِّخَاذِ الدَّجَاجِ وَقَالَ عِنْدَ اتِّخَاذِ الْأَغْنِيَاءِ الدَّجَاجَ يَأْذَنُ اللَّهُ بِهَلَاكِ الْقُرَى";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے دولت مندوں کو بکریاں پالنے کا حکم دیا اور ناداروں کو مرغیان پالنے کا حکم دیا۔اور فرمایا: جب دولت مند مرغیاں پالنے لگیں تو اللہ تعالیٰ بستیوں کو ہلاک کرنے کا حکم دے دیتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع<br>علي بن عروۃ: متروک (تقریب: 4771) <br>وقال البوصیري: ’’ ھذا إسناد ضعیف،علي بن عروۃ ترکوہ،قال ابن حبان: یضع الحدیث ‘‘`;
ibnemaja.anwaar = [462,1];