var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ عَنْ الْمَقْبُريِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جسے لوگوں کے درمیان فیصلہ کرنے والا (جج) مقرر کیا گیا،اسے (گویا) بغیر چھری کے ذبح کر دیا گیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;