var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْرَائِيلُ عَنْ عَبْدِ الْأَعْلَى عَنْ بِلَالِ بْنِ أَبِي مُوسَى عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ الْقَضَاءَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ جُبِرَ عَلَيْهِ نَزَلَ إِلَيْهِ آلِكْ فَسَدَّدَهُ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے قاضی کا منصب طلب کیا،وہ اپنی جان کے حوالے کر دیا جاتا ہے،اور جسے (اس (منصب کو قبول کرنے) پر مجبور کیا گیا،ایک فرشتہ نازل ہو کر اس کی رہنمائی کرتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3578) ترمذي (1323،1324)`;
ibnemaja.anwaar = [462,1];