var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا مُجَالِدٌ عَنْ عَامِرٍ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ حَاكِمٍ يَحْكُمُ بَيْنَ النَّاسِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَمَلَكٌ آخِذٌ بِقَفَاهُ ثُمَّ يَرْفَعُ رَأْسَهُ إِلَى السَّمَاءِ فَإِنْ قَالَ أَلْقِهِ أَلْقَاهُ فِي مَهْوَاةٍ أَرْبَعِينَ خَرِيفًا";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو بھی قاضی لوگوں کے درمیان فیصلے کرتا ہے،قیامت کے دن وہ اس حال میں حاضر ہو گا کہ ایک فرشتے نے اسے گدی سے پکڑ رکھا ہو گا،پھر آسمان کی طرف سر اٹھائے گا،اگر اللہ نے فرمایا: اسے پھینک دے تو فرشتہ اسے (جہنم) کے گڑھے میں پھینک دے گا (جس میں وہ) چالیس سال تک (گرتا چلا جائے گا۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مجالد: ضعیف <br>والسند ضعفہ البو صیري`;
ibnemaja.anwaar = [462,1];