var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانَ حَدَّثَنَا مُحَمَّدُ بْنُ بِلَالٍ عَنْ عِمْرَانَ الْقَطَّانِ عَنْ حُسَيْنٍ يَعْنِي ابْنَ عِمْرَانَ عَنْ أَبِي إِسْحَقَ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ مَعَ الْقَاضِي مَا لَمْ يَجُرْ فَإِذَا جَارَ وَكَّلَهُ إِلَى نَفْسِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن ابی اوفی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ قاضی کے ساتھ ہوتا ہے جب تک وہ ظلم (بے انصافی) نہ کرے۔جب وہ ظلم کرتا ہے تو اللہ تعالیٰ اسے اس کے نفس کے سپرد کر دیتا ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;