var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعْنَةُ اللَّهِ عَلَى الرَّاشِي وَالْمُرْتَشِي";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: رشوت دینے والے اور رشوت لینے والے پر اللہ کی لعنت ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;