var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ بْنِ سَعِيدٍ أَبُو عُبَيْدَةَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ حَدَّثَنِي الْحُسَيْنُ بْنُ ذَكْوَانَ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ قَالَ حَدَّثَنِي يَحْيَى بْنُ يَعْمَرَ أَنَّ أَبَا الْأَسْوَدِ الدِّيلِيَّ حَدَّثَهُ عَنْ أَبِي ذَرٍّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ";
ibnemaja.urdu = "حضرت ابوذر (جندب بن جنادہ غفاری رضی اللہ عنہ) سے روایت ہے،انہوں نے رسول اللہ ﷺ سے سنا،آپ فرما رہے تھے: جو شخص اس چیز کا دعویٰ کرے جو اس کی نہیں تو وہ ہم میں سے نہیں،اسے اپنا ٹھکانہ جہنم میں بنا لینا چاہیے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;