var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَمُحَمَّدُ بْنُ الْوَلِيدِ،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ سِمَاكٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِيهِ،أنَّ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «نَضَّرَ اللَّهُ امْرَأً سَمِعَ مِنَّا حَدِيثًا فَبَلَّغَهُ،فَرُبَّ مُبَلَّغٍ أَحْفَظُ مِنْ سَامِعٍ»";
ibnemaja.urdu = "سیدنا عبداللہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:’’اللہ تعالیٰ اس شخص کو خوش رکھے،جس نے ہماری کوئی بات سنی،پھر اسے(دوسروں تک) پہنچایا،بعض اوقات جسے حدیث پہنچائی جاتی ہے،وہ(براہ راست) سننے والے سے زیادہ یاد رکھنے والا ہوتا ہے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;