var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ ثَعْلَبَةَ بْنِ سَوَاءٍ حَدَّثَنِي عَمِّي مُحَمَّدُ بْنُ سَوَاءٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ أَوْ يُعِينُ عَلَى ظُلْمٍ لَمْ يَزَلْ فِي سَخَطِ اللَّهِ حَتَّى يَنْزِعَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے کسی مقدمے میں ظلم میں (ظالم کی) مدد کی،وہ ہمیشہ الہ کی ناراضی کا مستحق رہتا ہے حتی کہ (اس گناہ سے) باز آ جائے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;