var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ ادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ وَلَكِنْ الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اگر لوگوں کو محج ان کے دعوے کی بنا پر چیز دے دی جائے تو لوگ دوسرے افراد کے جان و مال پر دعوے کر دیں لیکن قسم کھانا مدعا علیہ کے ذمے ہے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;