var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ قَالَا حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ وَهُوَ فِيهَا فَاجِرٌ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے کوئی قسم کھائی جب کہ وہ قسم کھاتے ہوئے گناہ (جھوٹ) کا ارتکاب کر رہا ہے اور اس (جھوٹی قسم) کے ذریعے سے کسی مسلمان کے مال کا کچھ حصہ حاصل کرتا ہے،جب اللہ سے اس کی ملاقات ہو گی تو اللہ اس پر ناراض ہو گا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;