var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَا حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ عَنْ عَبْدِ اللَّهِ بْنِ نِسْطَاسٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ بِيَمِينٍ آثِمَةٍ عِنْدَ مِنْبَرِي هَذَا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ وَلَوْ عَلَى سِوَاكٍ أَخْضَرَ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے میرے اس منبر کے پاس گناہ والی (جھوٹی) قسم کھائی،اسے چاہیے کہ اپنا ٹھکانا جہنم میں بنا لے اگرچہ تازہ مسواک کے لیے (قسم کھائی) ہو۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;