var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَزَيْدُ بْنُ أَخْزَمَ قَالَا حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ حَدَّثَنَا الْحَسَنُ بْنُ يَزِيدَ بْنِ فَرُّوخَ قَالَ مُحَمَّدُ بْنُ يَحْيَى وَهُوَ أَبُو يُونُسَ الْقَوِيُّ قَالَ سَمِعْتُ أَبَا سَلَمَةَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْلِفُ عِنْدَ هَذَا الْمِنْبَرِ عَبْدٌ وَلَا أَمَةٌ عَلَى يَمِينٍ آثِمَةٍ وَلَوْ عَلَى سِوَاكٍ رَطْبٍ إِلَّا وَجَبَتْ لَهُ النَّارُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اس منبر کے پاس جو بھی بندہ یا بندی گناہ والی (جھوٹی) قسم کھائے گا،خواہ تازہ مسوا کے لیے کھائے،اس کے لیے جہنم واجب ہو جائے گی۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;