var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا رَجُلًا مِنْ عُلَمَاءِ الْيَهُودِ فَقَالَ أَنْشُدُكَ بِالَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى";
ibnemaja.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے ایک یہودی عالم کو بلایا اور فرمایا: میں تجھے اس ذات کی قسم دیتا ہوں جس نے حضرت موسیٰ علیہ السلام پر تورات نازل فرمائی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;