var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ ذَكَرَ أَنَّ رَجُلَيْنِ ادَّعَيَا دَابَّةً وَلَمْ يَكُنْ بَيْنَهُمَا بَيِّنَةٌ فَأَمَرَهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ دو آدمیوں نے ایک جانور کے بارے میں دعویٰ کیا،اور ان کے درمیان (فیصلہ کرنے والی) کوئی گواہی موجود نہ تھی تو نبی ﷺ نے انہیں حکم دیا کہ قسم کھانے کے لیے قرعہ اندازی کر لیں۔(پھر جس کا قرعہ نکلے وہ قسم کھا لے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3616) والحدیث الآتي (2346)`;
ibnemaja.anwaar = [462,1];