var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ وَمُحَمَّدُ بْنُ مَعْمَرٍ وَزُهَيْرُ بْنُ مُحَمَّدٍ قَالُوا حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ أَبِي مُوسَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْتَصَمَ إِلَيْهِ رَجُلَانِ بَيْنَهُمَا دَابَّةٌ وَلَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهَا بَيْنَهُمَا نِصْفَيْنِ";
ibnemaja.urdu = "حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ دو آدمیوں نے رسول اللہ ﷺ کے سامنے مقدمہ پیش کیا،ان کے درمیان (جھگڑے کی وجہ) ایک جانور تھا۔ان میں سے کسی کے پاس گواہ نہ تھا تو نبی ﷺ نے ان دونوں کو وہ جانور آدھا آدھا تقسیم کر دیا (کہ وہ جانور فروخت کر کے قیمت آپس میں تقسیم کر لیں۔)";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;