var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا حَجَّاجٌ عَنْ سَعِيدِ بْنِ عُبَيْدِ بْنِ زَيْدِ بْنِ عُقْبَةَ عَنْ أَبِيهِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ضَاعَ لِلرَّجُلِ مَتَاعٌ أَوْ سُرِقَ لَهُ مَتَاعٌ فَوَجَدَهُ فِي يَدِ رَجُلٍ يَبِيعُهُ فَهُوَ أَحَقُّ بِهِ وَيَرْجِعُ الْمُشْتَرِي عَلَى الْبَائِعِ بِالثَّمَنِ";
ibnemaja.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب کسی کی کوئی چیز گم ہو جائے یا چوری ہو جائے،پھر اسے وہ چیز اس شخص کے ہاتھ میں ملے جو اسے فروخت کر رہا ہے تو وہ (مالک) اس چیز کا زیادہ حق رکھتا ہے اور خریدار بیچنے والے سے اپنی قیمت وصول کر لے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حجاج بن أرطاۃ: ضعیف`;
ibnemaja.anwaar = [462,1];