var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ أَبِي الْأَسْوَدِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً عَلَى جِدَارِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: کوئی شخص اپنے ہمسائے کو اپنی دیوار پر لکڑی رکھنے سے منع نہ کرے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;