var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَمُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ قَالَا حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب راستے کے بارے میں تمہارا اختلاف ہو جائے تو اسے سات ہاتھ رکھ لیا کرو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;