var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،ح وَحَدَّثَنَا إِسْحاقُ بْنُ مَنْصُورٍ قَالَ: أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ،عَنْ بَهْزِ بْنِ حَكِيمٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ مُعَاوِيَةَ الْقُشَيْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ»";
ibnemaja.urdu = "سیدنا معاویہ قشیری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’سنو! جو شخص موجود ہے،وہ غیر موجود تک پہنچا دے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;