var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ حَدَّثَنَا إِسْحَقُ بْنُ يَحْيَى بْنِ الْوَلِيدِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنْ لَا ضَرَرَ وَلَا ضِرَارَ";
ibnemaja.urdu = "حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فیصلہ دیا: نہ (پہلے پہل) کسی کو نقصان پہنچانا اور تکلیف دینا جائز ہے،نہ بدلے کے طور پر نقصان پہنچانا اور تکلیف دینا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إسحاق بن یحیی: مجھول الحال،أرسل عن عبادۃ <br>ولہ شواھد کثیرۃ جدًا ولم یصح منھا شئ`;
ibnemaja.anwaar = [463,1];