var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ جَابِرٍ الْجُعْفِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا ضَرَرَ وَلَا ضِرَارَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: نہ (پہلے پہل) کسی کو نقصان پہنچانا اور تکلیف دینا جائز ہے،نہ بدلے کے طور پر نقصان پہنچانا اور تکلیف دینا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جابر الجعفي: ضعیف رافضي <br>وانظر الحدیث السابق (2340)`;
ibnemaja.anwaar = [463,1];