var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ لُؤْلُؤَةَ عَنْ أَبِي صِرْمَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَقَّ اللَّهُ عَلَيْهِ";
ibnemaja.urdu = "حضرت ابو صرمہ (مالک بن قیس انصاری) رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو (کسی کو) نقصان پہنچائے گا،اللہ اس کا نقصان کر دے گا اور جو کسی کو مشکل میں ڈالے گا،اللہ اس پر سختی کرے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3635) ترمذي (1940)`;
ibnemaja.anwaar = [463,1];