var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا هَمَّامٌ عَنْ قتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا بِيعَ الْبَيْعُ مِنْ رَجُلَيْنِ فَالْبَيْعُ لِلْأَوَّلِ قَالَ أَبُو الْوَلِيدِ فِي هَذَا الْحَدِيثِ إِبْطَالُ الْخَلَاصِ";
ibnemaja.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جب ایک چیز دو آدمیوں کے ہاتھ فروخت کر دی جائے تو پہلے کے ہاتھ بیچنا ہی معتبر ہو گا۔ابوالولید نے کہا: اس حدیث سے (دوسرے خریدار کی طرف سے) قبضہ دلوانے کی شرط ناجائز ثابت ہوتی ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;