var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَجُلًا كَانَ لَهُ سِتَّةُ مَمْلُوكِينَ لَيْسَ لَهُ مَالٌ غَيْرُهُمْ فَأَعْتَقَهُمْ عِنْدَ مَوْتِهِ فَجَزَّأَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً";
ibnemaja.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ ایک آدمی کے چھ غلام تھے۔اس کا ان کے علاوہ اور کوئی مال نہیں تھا۔اس نے وفات کے وقت ان سب کو آزاد کر دیا۔رسول اللہ ﷺ نے ان کے (تین) حصے کیے،پھر دو غلاموں کو آزاد کر دیا اور چار غلاموں کو رہنے دیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;