var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلَيْنِ تَدَارَءَا فِي بَيْعٍ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ أَحَبَّا ذَلِكَ أَمْ كَرِهَا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک دوسے میں دو ادمیوں کا جھگڑا ہو گیا۔ان میں سے کسی کے پاس ثبوت نہیں تھا (گواہی وغیرہ یا کوئی اور قرینہ) تو رسول اللہ ﷺ نے انہیں حکم دیا کہ قرعہ ڈال کر قسم کھا لیں،خواہ انہیں (قسم کھانا) پسند ہو یا ناپسند ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (2329)`;
ibnemaja.anwaar = [463,1];