var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: أَنْبَأَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ قَالَ: حَدَّثَنِي قُدَامَةُ بْنُ مُوسَى،عَنْ مُحَمَّدِ بْنِ الْحُصَيْنِ التَّمِيمِيِّ،عَنْ أَبِي عَلْقَمَةَ،مَوْلَى ابْنِ عَبَّاسٍ،عَنْ يَسَارٍ،مَوْلَى ابْنِ عُمَرَ،عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِيُبَلِّغْ شَاهِدُكُمْ غَائِبَكُمْ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’تم میں سے جو لوگ موجود ہیں،وہ انہیں پہنچادیں جو موجود نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (1278) ترمذي (419)`;
ibnemaja.anwaar = [383,1];