var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ أَبِي مَيْمُونَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيَّرَ غُلَامًا بَيْنَ أَبِيهِ وَأُمِّهِ وَقَالَ يَا غُلَامُ هَذِهِ أُمُّكَ وَهَذَا أَبُوكَ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے ایک بچے کو اس کے والد اور والدہ کے درمیان انتخاب کا موقع دیا اور فرمایا: لڑکے! یہ تیری والدہ ہے اور یہ تیرا والد ہے (تو جس کے ساتھ چاہے چلا جا۔)";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;