var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلَّا صُلْحًا حَرَّمَ حَلَالًا أَوْ أَحَلَّ حَرَامًا";
ibnemaja.urdu = "حضرت عمرو بن عوف انصاری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: مسلمانوں کے درمیان صلح درست ہے سوائے اس صلح کے جو کسی حلال کو حرام کرے یا حرام کو حلال کرے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;