var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا الْيَمَانُ بْنُ عَدِيٍّ حَدَّثَنِي الزُّبَيْدِيُّ مُحَمَّدُ بْنُ الْوَلِيدِ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرِئٍ مَاتَ وَعِنْدَهُ مَالُ امْرِئٍ بِعَيْنِهِ اقْتَضَى مِنْهُ شَيْئًا أَوْ لَمْ يَقْتَضِ فَهُوَ أُسْوَةٌ لِلْغُرَمَاءِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص فوت ہو جائے اور اس کے پاس کسی(قرض خواہ) کا مال بعینہ موجود ہو تو قرض خواہ نے اس سے کچھ وصول کیا ہو یا نہ کیا ہو،(ہر حال میں) وہ دوسرے قرض خواہوں کی طرح ہی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال الدارقطني (3/ 29): ’’ الیمان بن عدي ضعیف الحدیث ‘‘ <br>و الحدیث السابق (الأصل: 2360) یغني عنہ`;
ibnemaja.anwaar = [464,1];