var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدِينِيُّ أَحْمَدُ بْنُ عَبْدِ اللَّهِ الزُّهْرِيُّ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے (مدعی کی) قسم اور ایک گواہ کے ساتھ فیصلہ فرمایا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;