var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَقَ الْهَرَوِيُّ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ حَدَّثَنَا سَيْفُ بْنُ سُلَيْمَانَ الْمَكِّيُّ أَخْبَرَنِي قَيْسُ بْنُ سَعْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشَّاهِدِ وَالْيَمِينِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ایک گواہ اور (مدعی کی) قسم کے ساتھ فیصلہ فرمایا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;