var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ عَنْ سُرَّقٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجَازَ شَهَادَةَ الرَّجُلِ وَيَمِينَ الطَّالِبِ";
ibnemaja.urdu = "حضرت سرق (بن اسد جہنی رضی اللہ عنہ) سے روایت ہے کہ نبی ﷺ نے ایک آدمی کی گواہی اور مدعی کی قسم کو درست قرار دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>رجل من أھل مصر مجھول وضعفہ البوصیري من أجلہ<br>ولأصل الحدیث شاھد صحیح تقدم قبلہ (الأصل: 2370)`;
ibnemaja.anwaar = [464,1];