var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُرَاتِ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ تَزُولَ قَدَمَا شَاهِدِ الزُّورِ حَتَّى يُوجِبَ اللَّهُ لَهُ النَّارَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جھوٹی گواہی دینے والے کے قدم (حساب کتاب کے موقع پر) اپنی جگہ سے حرکت نہیں کریں گے حتی کہ اللہ تعالیٰ اس کے لیے جہنم واجب کر دے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>محمد بن فرات: کذبوہ (تقریب: 6217) <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [464,1];