var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ مُجَالِدٍ عَنْ عَامِرٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجَازَ شَهَادَةَ أَهْلِ الْكِتَابِ بَعْضِهِمْ عَلَى بَعْضٍ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اہل کتاب کی ایک دوسرے کے بارے میں گواہی کو معتبر قرار دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4452)<br>وضعفہ البوصیري من أجل مجالدبن سعید (ضعیف،انظر الحدیث السابق:11)`;
ibnemaja.anwaar = [464,1];