var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ وَمُحَمَّدِ بْنِ النُّعْمَانِ بْنِ بَشِيرٍ أَخْبَرَاهُ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ أَبَاهُ نَحَلَهُ غُلَامًا وَأَنَّهُ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشْهِدُهُ فَقَالَ أَكُلَّ وَلَدِكَ نَحَلْتَهُ قَالَ لَا قَالَ فَارْدُدْهُ";
ibnemaja.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہ سے روایت ہے کہ ان کے والد نے انہیں ایک غلام ہبہ کیا۔وہ نبی ﷺ کی خدمت میں حاضر ہوئے تاکہ آپ کو اس پر گواہ بنا لیں۔رسول اللہ ﷺ نے فرمایا: کیا تم نے اپنی تمام اولاد کو یہی کچھ دیا ہے؟ انہوں نے کہا: جی نہیں۔آپ نے فرمایا: پھر اسے واپس لے لو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;