var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ وَابْنِ عُمَرَ يَرْفَعَانِ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِلرَّجُلِ أَنْ يُعْطِيَ الْعَطِيَّةَ ثُمَّ يَرْجِعَ فِيهَا إِلَّا الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ اور حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: آدمی کے لیے جائز نہیں کہ(کسی کو) کوئی چیز دے کر واپس لے لے،سوائے والد کے،جو کچھ وہ اپنی اولاد کو دیتا ہے (،اسے واپس لے سکتا ہے)۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;