var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرْجِعْ أَحَدُكُمْ فِي هِبَتِهِ إِلَّا الْوَالِدَ مِنْ وَلَدِهِ";
ibnemaja.urdu = "حضرت عمرو بن شعیب رحمۃ اللہ علیہ اپنے والد سے،وہ اپنے دادا (حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ) سے روایت کرتے ہیں کہ اللہ کے نبی ﷺ نے فرمایا: کوئی شخص اپنے ہبہ سے رجوع نہ کرے مگر والد اپنی اولاد سے (واپس لے سکتا ہے)۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;