var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ أَبُو جَعْفَرٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِي حَازِمٍ،عَنْ سَهْلِ بْنِ سَعْدٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ هَذَا الْخَيْرَ خَزَائِنُ،وَلِتِلْكَ الْخَزَائِنِ مَفَاتِيحُ،فَطُوبَى لِعَبْدٍ جَعَلَهُ اللَّهُ مِفْتَاحًا لِلْخَيْرِ،مِغْلَاقًا لِلشَّرِّ،وَوَيْلٌ لِعَبْدٍ جَعَلَهُ اللَّهُ مِفْتَاحًا لَلشَّرِّ،مِغْلَاقًا لِلْخَيْرِ»";
ibnemaja.urdu = "سیدنا سہل بن سعد رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’نیکی کے کچھ خزانے ہیں اور ان خزانوں کی چابیاں ہیں۔مبارک ہے اس بندے کو جسے اللہ نے نیکی کی چابی اور برائی کا تالا بنا دیا،اور تباہی ہے اس بندے کے لئے جسے اللہ نے برائی کی چابی اور نیکی کا تالا بنادیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبد الرحمٰن بن زید بن أسلم: ضعیف`;
ibnemaja.anwaar = [383,1];