var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَعْمَرَ رَجُلًا عُمْرَى لَهُ وَلِعَقِبِهِ فَقَدْ قَطَعَ قَوْلُهُ حَقَّهُ فِيهَا فَهِيَ لِمَنْ أُعْمِرَ وَلِعَقِبِهِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے سنا،آپ فرما رہے تھے: جس نے کسی شخص کو عمری کے طور پر کچھ دیا تو وہ اس (وصول کرنے والے) کا اور اس کے بچوں کا ہے۔عمری کرنے والے کی بات سے اس میں اس کا حق ختم ہو گیا،وہ چیز اس کی ہے جسے عمر بھر کے لیے دی گئی،اور اس کی اولاد کے لیے ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;