var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا رُقْبَى فَمَنْ أُرْقِبَ شَيْئًا فَهُوَ لَهُ حَيَاتَهُ وَمَمَاتَهُ قَالَ وَالرُّقْبَى أَنْ يَقُولَ هُوَ لِلْآخَرِ مِنِّي وَمِنْكَ مَوْتًا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: رقبی کچھ نہیں،جسے رقبی کے طور پر کوئی چیز دی گئی،وہ زندگی میں بھی اور مرنے پر بھی اسی کی ہے۔راوی نے بیان کیا: رقبی کا مطلب دوسرے سے یہ کہنا ہے: یہ چیز اس کی ہے جو ہم دونوں میں سے بعد میں فوت ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;