var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَوْفٍ عَنْ خِلَاسٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مَثَلَ الَّذِي يَعُودُ فِي عَطِيَّتِهِ كَمَثَلِ الْكَلْبِ أَكَلَ حَتَّى إِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ فَأَكَلَهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص اپنا عطیہ واپس لیتا ہے،وہ کتے کی طرح ہے،جو کھاتا رہتا ہے،جب سیر ہو جاتا ہے تو قے کر دیتا ہے،پھر اپنی قے کو دوبارہ کھانے لگ جاتا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;