var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُوسُفَ الْعَرْعَرِيُّ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَكِيمٍ حَدَّثَنَا الْعُمَرِيُّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اپنا ہبہ واپس لینے والا اس کتے کی طرح ہے جو اپنی قے کو دوبارہ کھاتا ہے۔‎";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;