var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ بْنِ مُجَمِّعِ بْنِ جَارِيَةَ الْأَنْصَارِيُّ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلُ أَحَقُّ بِهِبَتِهِ مَا لَمْ يُثَبْ مِنْهَا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: آدمی اپنے ہبہ (تحفے) کا زیادہ حق رکھتا ہے،جب تک اسے اس کا بدلہ (جوابی تحفہ) نہ دیا جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن مجمع: ضعیف`;
ibnemaja.anwaar = [465,1];