var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو يُوسُفَ الرَّقِّيُّ مُحَمَّدُ بْنُ أَحْمَدَ الصَّيْدَلَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ الْمُثَنَّى بْنِ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي خُطْبَةٍ خَطَبَهَا لَا يَجُوزُ لِامْرَأَةٍ فِي مَالِهَا إِلَّا بِإِذْنِ زَوْجِهَا إِذَا هُوَ مَلَكَ عِصْمَتَهَا";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہ نے ایک خطبہ دیا۔اس میں آپ نے فرمایا: عورت کو خاوند کی اجازت کے بغیر اپنے مال میں تصرف جائز نہیں،جب کہ وہ اس کی عصمت کا مالک ہو (جب تک نکاح قائم ہو۔)";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;