var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،عَنْ عُثْمَانَ بْنِ عَطَاءٍ،عَنْ أَبِيهِ،عَنْ أَبِي الدَّرْدَاءِ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّهُ لَيَسْتَغْفِرُ لِلْعَالِمِ مَنْ فِي السَّمَاوَاتِ،وَمَنْ فِي الْأَرْضِ،حَتَّى الْحِيتَانِ فِي الْبَحْرِ»";
ibnemaja.urdu = "سیدنا ابو درداء رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا،آپ نے فرمایا:’’عالم کے لئے ہر وہ چیز دعائے مغفرت کرتی ہے جو آسمان میں ہے اور جو زمین میں ہے حتی کہ سمندر میں مچھلیاں بھی(اس کے حق میں دعائے مغفرت کرتی ہیں۔‘‘)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عثمان بن عطاء الخراساني: ضعیف وحفص بن عمر الشامي البزاز مجھول (تقریب: 4502،1425) <br>قال الدارقطني في عثمان بن عطاء الخراساني: ’’ ھو ضعیف الحدیث جدًا ‘‘ (163/3،164)`;
ibnemaja.anwaar = [383,1];