var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْعَبَّاسِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الَّذِي يَتَصَدَّقُ ثُمَّ يَرْجِعُ فِي صَدَقَتِهِ مَثَلُ الْكَلْبِ يَقِيءُ ثُمَّ يَرْجِعُ فَيَأْكُلُ قَيْئَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص صدقہ دے کر اپنا صدقہ واپس لے لیتا ہے،اس کی مثال کتے کی سی ہے جو قے کرتا ہے،پھر پلٹ کر اپنی قے کھا لیتا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;