var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ الزُّبَيْرِ بْنِ الْعَوَّامِ أَنَّهُ حَمَلَ عَلَى فَرَسٍ يُقَالُ لَهُ غَمْرٌ أَوْ غَمْرَةٌ فَرَأَى مُهْرًا أَوْ مُهْرَةً مِنْ أَفْلَائِهَا يُبَاعُ يُنْسَبُ إِلَى فَرَسِهِ فَنَهَى عَنْهَا";
ibnemaja.urdu = "حضرت زبیر بن عوام رضی اللہ عنہ سے روایت ہے کہ ان کا ایک گھوڑا جس کا نام غمر یا غمرہ تھا،انہوں نے وہ (بطور صدقہ کسی کو) سواری کے لیے دے دیا۔بعد میں انہوں نے اس کے ایک بچھیرے یا بچھیری کو بکتا دیکھا تو نبی ﷺ نے انہیں اس (کو خریدنے) سے منع کر دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سلیمان التیمي عنعن <br>و حدیث البخاري (2623) و مسلم (1620) یغني عنہ`;
ibnemaja.anwaar = [465,1];