var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا شُرَحْبِيلُ بْنُ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا أُمَامَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعَارِيَةُ مُؤَدَّاةٌ وَالْمِنْحَةُ مَرْدُودَةٌ";
ibnemaja.urdu = "حضرت ابو امامہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے یہ ارشاد سنا ہے: عاریتا لی ہوئی چیز واپس کی جائے اور دودھ کے لیے لیا ہوا جانور واپس کیا جائے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;