var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيَّانِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعَارِيَةُ مُؤَدَّاةٌ وَالْمِنْحَةُ مَرْدُودَةٌ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: عاریتا لی ہوئی چیز واپس کی جائے اور دودھ کے لیے لیا ہوا جانور واپس کیا جائے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;