var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى الْمِصْرِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،عَنْ يَحْيَى بْنِ أَيُّوبَ،عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ عَلَّمَ عِلْمًا فَلَهُ أَجْرُ مَنْ عَمِلَ بِهِ،لَا يَنْقُصُ مِنْ أَجْرِ الْعَامِلِ»";
ibnemaja.urdu = "سیدنا معاذ بن انس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:’’جو (کسی کو) علم سکھاتا ہے،اسے اس پر عمل کرنے والے کے برابر ثواب ملتا ہے اور عمل کرنے والے کے ثواب میں کمی نہیں ہوتی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد اللّٰہ بن وھب مدلس و عنعن <br>و الحدیث السابق (الأصل: 206) یغني عنہ`;
ibnemaja.anwaar = [383,1];