var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ح و حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ جَمِيعًا عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى الْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَهُ";
ibnemaja.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ہاتھ نے جو کچھ (قرض یا عاریت کے طور پر) لیا،وہ اس کے ذمے رہتا ہے حتی کہ اسے ادا کرے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3561) ترمذي (1266)`;
ibnemaja.anwaar = [465,1];