var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْجَهْمِ الْأَنْمَاطِيُّ حَدَّثَنَا أَيُّوبُ بْنُ سُوَيْدٍ عَنْ الْمُثَنَّى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُودِعَ وَدِيعَةً فَلَا ضَمَانَ عَلَيْهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس کے پاس امانت رکھی گئی ہو (اور وہ اتفاقا ضائع ہو جائے) تو اس پر تاوان نہیں ہو گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>المثنی بن الصباح: ضعیف <br>ولہ متابعات ضعیفۃ`;
ibnemaja.anwaar = [465,1];