var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّلْمُ مَطْلُ الْغَنِيِّ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دولت والے کا ٹال مٹول کرنا ظلم ہے۔اور تم میں سے کسی کو جب مال دار آدمی کا حوالہ دیا جائے تو اسے چاہیے کہ حوالہ قبول کر لے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;