var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ تَوْبَةَ حَدَّثَنَا هُشَيْمٌ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُحِلْتَ عَلَى مَلِيءٍ فَاتْبَعْهُ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دولت والے کا ٹال مٹول کرنا ظلم ہے اور اگر تجھے کسی مال دار آدمی کا حوالہ دیا جائے تو قبول کر۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;