var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَالْحَسَنُ بْنُ عَرَفَةَ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنِي شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الزَّعِيمُ غَارِمٌ وَالدَّيْنُ مَقْضِيٌّ";
ibnemaja.urdu = "حضرت ابو امامہ باہلی رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے سنا،آپ فرما رہے تھے: ضمانت دینے والے پر تاوان ہو گا اور قرض ادا کیا جائے گا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;