var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ عَنْ أَبِي الْغَيْثِ مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَخَذَ أَمْوَالَ النَّاسِ يُرِيدُ إِتْلَافَهَا أَتْلَفَهُ اللَّهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص لوگوں کا مال اسے ضائع کرنے کے ارادے سے لیتا ہے،اللہ اسے تباہ کر دے گا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;