var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ فَارَقَ الرُّوحُ الْجَسَدَ وَهُوَ بَرِيءٌ مِنْ ثَلَاثٍ دَخَلَ الْجَنَّةَ مِنْ الْكِبْرِ وَالْغُلُولِ وَالدَّيْنِ";
ibnemaja.urdu = "رسول اللہ ﷺ کے آزاد کردہ غلام حضرت ثوبان رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا: جس شخص کی جان اس حال میں اس کے جسم سے نکلی کہ وہ تین چیزوں سے پاک تھا،وہ جنت میں داخل ہو جائے گا: تکبر سے،مال غنیمت کی خیانت سے اور قرض سے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1573)`;
ibnemaja.anwaar = [466,1];