var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفْسُ الْمُؤْمِنِ مُعَلَّقَةٌ بِدَيْنِهِ حَتَّى يُقْضَى عَنْهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مومن کی روح اس کے قرض کی وجہ سے لٹکتی رہتی ہے حتی کہ اس کی طرف سے (قرض) ادا کر دیا جائے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;