var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ ثَعْلَبَةَ بْنِ سَوَاءٍ حَدَّثَنَا عَمِّي مُحَمَّدُ بْنُ سَوَاءٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ وَعَلَيْهِ دِينَارٌ أَوْ دِرْهَمٌ قُضِيَ مِنْ حَسَنَاتِهِ لَيْسَ ثَمَّ دِينَارٌ وَلَا دِرْهَمٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص اس حال میں فوت ہوا کہ اس کے ذؐے ایک دینار یا ایک درہم تھا،وہ اس کی نیکیوں سے ادا کیا جائے گا،وہاں (آخرت میں) دینار ہوں گے نہ درہم۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;