var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَعَلَيَّ وَإِلَيَّ وَأَنَا أَوْلَى بِالْمُؤْمِنِينَ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو کوئی مال چھوڑ جائے تو وہ اس کے وارثوں کا ہے اور جو کوئی قرض یا چھوٹے بچے چھوڑ جائے تو اس کی ادائیگی اور ان کی نگہداشت میرے ذمے ہے۔اور میں مومنوں سے سب سے زیادہ تعلق رکھنے والا ہوں (یا ان کا زیادہ ذمے دار ہوں)۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;