var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ نُفَيْعٍ أَبِي دَاوُدَ عَنْ بُرَيْدَةَ الْأَسْلَمِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَنْظَرَ مُعْسِرًا كَانَ لَهُ بِكُلِّ يَوْمٍ صَدَقَةٌ وَمَنْ أَنْظَرَهُ بَعْدَ حِلِّهِ كَانَ لَهُ مِثْلُهُ فِي كُلِّ يَوْمٍ صَدَقَةٌ";
ibnemaja.urdu = "حضرت بریدہ بن حصیب اسلمی رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو شخص کسی تنگ دست کو مہلت دیتا ہے،اسے ہر روز صدقے کا ثواب ملتا ہے۔اور جس نے واجب الادا ہونے کے بعد مزید مہلت دی،اسے بھی یہی ثواب ملتا ہے،(یعنی) ہر روز صدقے کا ثواب ہوتا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;