var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُعَاوِيَةَ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ عَنْ أَبِي الْيَسَرِ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَحَبَّ أَنْ يُظِلَّهُ اللَّهُ فِي ظِلِّهِ فَلْيُنْظِرْ مُعْسِرًا أَوْ لِيَضَعْ لَهُ";
ibnemaja.urdu = "نبی ﷺ کے صحابی حضرت ابویسر (کعب بن عمرو سلمی رضی اللہ عنہ) سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص پسند کرتا ہے کہ اللہ تعالیٰ اسے اپنے سائے میں جگہ دے تو اسے چاہیے کہ تنگ دست کو مہلت دے یا اس کا قرض معاف کر دے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;