var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ وَعَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ طَالَبَ حَقًّا فَلْيَطْلُبْهُ فِي عَفَافٍ وَافٍ أَوْ غَيْرِ وَافٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ اور حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو کوئی اپنا حق طلب کرے،اسے چاہیے کہ شرافت سے طلب کرے،پورا ادا ہو یا ادھورا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;