var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُؤَمَّلِ بْنِ الصَّبَّاحِ الْقَيْسِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مُحَبَّبٍ الْقُرَشِيُّ حَدَّثَنَا سَعِيدُ بْنُ السَّائِبِ الطَّائِفِيُّ عَنْ عَبْدِ اللَّهِ بْنِ يَامِينَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِصَاحِبِ الْحَقِّ خُذْ حَقَّكَ فِي عَفَافٍ وَافٍ أَوْ غَيْرِ وَافٍ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے حق والے (قرض خواہ) سے فرمایا: اپنا حق شرافت سے وصول کرو،پورا ادا ہو یا ادھورا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;