var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا الْهِرْمَاسُ بْنُ حَبِيبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغَرِيمٍ لِي فَقَالَ لِي الْزَمْهُ ثُمَّ مَرَّ بِي آخِرَ النَّهَارِ فَقَالَ مَا فَعَلَ أَسِيرُكَ يَا أَخَا بَنِي تَمِيمٍ";
ibnemaja.urdu = "حضرت ہرماس بن حبیب رحمۃ اللہ علیہ اپنے والد (حضرت حبیب بن ثعلبہ) سے اور وہ ہرماس کے دادا (حضرت ثعلبہ تمیمی عنبری رضی اللہ عنہ) سے روایت کرتے ہیں،انہوں نے فرمایا: میں اپنے ایک مقروض کو لے کر نبی ﷺ کی خدمت میں حاضر ہوا۔آپ نے مجھ سے فرمایا: (یہ جہاں جائے) اس کے ساتھ رہو۔پھر نبی ﷺ شام کے وقت میرے پاس سے گزرے تو فرمایا: اے بنی تمیم کے بھائی! تمہارے قیدی کا کیا بنا؟";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3629)`;
ibnemaja.anwaar = [466,1];