var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ الْمَدَنِيُّ قَالَ: حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ،عَنْ صَفْوَانَ بْنِ سُلَيْمٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ طَلْحَةَ،عَنِ الْحَسَنِ الْبَصْرِيِّ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَفْضَلُ الصَّدَقَةِ أَنْ يَتَعَلَّمَ الْمَرْءُ الْمُسْلِمُ عِلْمًا ثُمَّ يُعَلِّمَهُ أَخَاهُ الْمُسْلِمَ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:’’سب سے افضل صدقہ یہ ہے کہ مسلمان آدمی کسی چیز کا علم حاصل کرے،پھر اپنے مسلمان بھائی کو اس کی تعلیم دے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الحسن مدلس و عنعن <br>والحدیث ضعفہ البو صیري`;
ibnemaja.anwaar = [383,1];