var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ حَدَّثَنِي الْأَسْوَدُ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ وَرَهَنَهُ دِرْعَهُ";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی الہ عنہا سے روایت ہے کہ نبی ﷺ نے ایک یہودی سے غلہ ادھار خریدا،اور اپنی زرہ اس کے پاس رہن رکھی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;