var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ لَقَدْ رَهَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرْعَهُ عِنْدَ يَهُودِيٍّ بِالْمَدِينَةِ فَأَخَذَ لِأَهْلِهِ مِنْهُ شَعِيرًا";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے مدینے میں ایک یہودی کے پاس اپنی زرہ گروی رکھ کر اس سے اپنے گھر والوں کے لیے جو حاصل کیے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;