var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ عَبْدِ الْحَمِيدِ بْنِ بَهْرَامَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُوُفِّيَ وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِطَعَامٍ";
ibnemaja.urdu = "حضرت اسماء بنت یزید بن سکن رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ جب فوت ہوئے تو آپ کی زرہ ایک یہودی کے پاس غلے کے عوض گروی رکھی ہوئی تھی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;