var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ حَدَّثَنَا هِلَالُ بْنُ خَبَّابٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاتَ وَدِرْعُهُ رَهْنٌ عِنْدَ يَهُودِيٍّ بِثَلَاثِينَ صَاعًا مِنْ شَعِيرٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ فوت ہوئے آپ کی زرہ ایک یہودی کے پاس تیس صاع جو کے بدلے میں رہن رکھی ہوئی تھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;