var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظَّهْرُ يُرْكَبُ إِذَا كَانَ مَرْهُونًا وَلَبَنُ الدَّرِّ يُشْرَبُ إِذَا كَانَ مَرْهُونًا وَعَلَى الَّذِي يَرْكَبُ وَيَشْرَبُ نَفَقَتُهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سواری کا جانورو جب رہن رکھا جائے تو اس پر سواری کی جائے گی،اور دودھ دینے والا جانور (گائے،بھینس،بکری وغیرہ) جب رہن رکھا جائے تو اس کا دودھ پیا جائے گا۔اور جانور کا خرچ اس شخص کے ذمے ہو گا جو سواری کرتا اور دودھ پیتا ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;