var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ مَسْلَمَةَ بْنِ عَلِيٍّ عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ عَنْ الْحَارِثِ بْنِ يَزِيدَ عَنْ عُلَيِّ بْنِ رَبَاحٍ قَالَ سَمِعْتُ عُتْبَةَ بْنَ النُّدَّرِ يَقُولُ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ طس حَتَّى إِذَا بَلَغَ قِصَّةَ مُوسَى قَالَ إِنَّ مُوسَى صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آجَرَ نَفْسَهُ ثَمَانِيَ سِنِينَ أَوْ عَشْرًا عَلَى عِفَّةِ فَرْجِهِ وَطَعَامِ بَطْنِهِ";
ibnemaja.urdu = "حضرت عتبہ بن ندر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم رسول اللہ ﷺ کی خدمت میں حاضر تھے۔آپ نے سورہ طسم (قصص) تلاوت فرمائی حتی کہ جب حضرت موسی علیہ السلام کے واقعے تک پہنچے (آیت:27،28) تو فرمایا: موسیٰ علیہ اسللام نے آٹھ دس سال پاک دامنی اور پیٹ بھر روٹی کے عوض مزدوری کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>مسلمۃ بن علي:متروک <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [467,1];