var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي حَيَّةَ عَنْ عَلِيٍّ قَالَ كُنْتُ أَدْلُو الدَّلْوَ بِتَمْرَةٍ وَأَشْتَرِطُ أَنَّهَا جَلْدَةٌ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں ایک کھجور کے بدلے میں ایک ڈول پانی نکالتا تھا اور یہ شرط لگا لیتا تھا کہ وہ عمدہ ہو گی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سفیان الثوري و أبو إسحاق عنعنا <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [467,1];