var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ كُنَّا نُخَابِرُ وَلَا نَرَى بِذَلِكَ بَأْسًا حَتَّى سَمِعْنَا رَافِعَ بْنَ خَدِيجٍ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُ فَتَرَكْنَاهُ لِقَوْلِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم مخابرہ پر عمل کرتے تھے اور اس میں حرج نہیں سمجھتے تھے حتی کہ ہم نے حضرت رافع بن خدیج رضی اللہ عنہ سے ان کا یہ فرمان سنا کہ رسول اللہ ﷺ نے اس سے منع فرمایا ہے تو ان کی بات سن کر ہم نے مخابرہ ترک کر دیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;