var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ";
ibnemaja.urdu = "حضرت ابو ھریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جس کے پاس زمین ہے تو وہ اسے کاشت کرے یا اپنے بھائی کو کاشت کے لیے (بلامعاوضہ) دے دے۔وہ ایسے نہیں کرنا چاہتا تو اپنی زمین اپنے پاس رکھے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;