var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ عَنْ ابْنِ شَوْذَبٍ عَنْ مَطَرٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا وَلَا يُؤَاجِرْهَا";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے ہمیں خطبہ دیا اور فرمایا: جس کے پاس زمین ہو تو وہ اسے کاشت کرے،یا کسی سے کاشت کرا لے،اور اسے کرائے پر نہ دے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;