var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُطَرِّفُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مَالِكٌ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي سُفْيَانَ مَوْلَى ابْنِ أَبِي أَحْمَدَ أَنَّهُ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُحَاقَلَةُ اسْتِكْرَاءُ الْأَرْضِ";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے محاقلہ سے منع فرمایا۔\nاور محاقلہ کا مطلب ہے زمین کرائے پر دینا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;