var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ عَبْدِ الْمَلِكِ بْنِ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ لَمَّا سَمِعَ إِكْثَارَ النَّاسِ فِي كِرَاءِ الْأَرْضِ قَالَ سُبْحَانَ اللَّهِ إِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا مَنَحَهَا أَحَدُكُمْ أَخَاهُ وَلَمْ يَنْهَ عَنْ كِرَائِهَا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ انہوں نے جب لوگوں کو بٹائی پر زمین دینے کے بارے میں بہت باتیں کرتے سنا (کہ یہ منع ہے) تو فرمایا: سبحان اللہ! اللہ کے رسول ﷺ نے تو یہ فرمایا تھا: آدمی اپنے بھائی کو زمین کیوں نہیں دے دیتا؟ آپ نے کرائے پر دینے سے منع نہیں فرمایا تھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;