var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنِ الْأَسْوَدِ بْنِ قَيْسٍ،عَنْ نُبَيْحٍ الْعَنَزِيِّ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا مَشَى مَشَى أَصْحَابُهُ أَمَامَهُ وَتَرَكُوا ظَهْرَهُ لِلْمَلَائِكَةِ»";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا:’’جب نبی ﷺ چلتے تو صحابہ کرام رضی اللہ عنہم آپ سے آگے چلتے تھے اور آپ پیچھے فرشتوں کے لیے جگہ چھوڑ دیتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سفیان الثوري عنعن <br>و روی الحاکم (4/ 281 ح 7753) عن جابر بن عبد اللّٰہ رضي اللّٰہ عنہ قال قال رسول اللّٰہ ﷺ: ((لا تمشوا بین یدي ولا خلفي فإن ھذا مقام الملائکۃ)) قال جابر: ’’ جئت أسعی إلی النبي ﷺ کأني شرارۃ ‘‘ وسندہ صحیح`;
ibnemaja.anwaar = [384,1];