var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ خَالِدٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ أَنَّ مُعَاذَ بْنَ جَبَلٍ أَكْرَى الْأَرْضَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ عَلَى الثُّلُثِ وَالرُّبُعِ فَهُوَ يُعْمَلُ بِهِ إِلَى يَوْمِكَ هَذَا";
ibnemaja.urdu = "حضرت طاوس رحمۃ اللہ علیہ سے روایت ہے،(انہوں نے فرمایا) حضرت معاذ بن جبل رضی اللہ عنہ نے نبی ﷺ کے عہد مبارک میں،حضرت ابوبکر،حضرت عمر اور حضرت عثمان رضی اللہ عنھم کے زمانہ خلافت میں تہائی اور چوتھائی کی شرط پر زمین کرائے پر دی۔اور آج تک اسی پر عمل ہوتا آ رہا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>طاوس لم یسمع من معاذ رضي اللّٰہ عنہ شیئًا (جامع التحصیل للعلائي ص 201)`;
ibnemaja.anwaar = [467,1];