var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ قَالَ قَالَ ابْنُ عَبَّاسٍ إِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ الْأَرْضَ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ خَرَاجًا مَعْلُومًا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے یہی فرمایا تھا: اگر کوئی اپنے بھائی کو زمین بلا معاوضہ دے دے تو یہ کام اس کے لیے مقرر کردہ ٹھیکہ لینے سے بہتر ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;