var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَطَاءٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَلَيْسَ لَهُ مِنْ الزَّرْعِ شَيْءٌ وَتُرَدُّ عَلَيْهِ نَفَقَتُهُ";
ibnemaja.urdu = "حضرت رافع بن خدیج رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے کچھ لوگوں کی زمین میں ان کی اجازت کے بغیر فصل کاشت کر لی تو اسے اس فصل میں سے کچھ نہیں ملے گا،اور اس کا خرچ اسے واپس کر دیا جائے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3403) ترمذي (1366)`;
ibnemaja.anwaar = [467,1];