var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَسَهْلُ بْنُ أَبِي سَهْلٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِالشَّطْرِ مِمَّا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے خیبر والوں سے پھلوں اور غلے کی نصف پیداوار کے عوض (کاشت کاری کا) معاہدہ فرمایا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;