var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ تَوْبَةَ حَدَّثَنَا هُشَيْمٌ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَى خَيْبَرَ أَهْلَهَا عَلَى النِّصْفِ نَخْلِهَا وَأَرْضِهَا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے خیبر کے رہنے والوں (یہودیوں) کو وہاں کے کھجوروں کے باغات اور زمین نصف پیداوار کے عوض (کام کرنے کے لیے) عطا فرمائی۔‎";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;