var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ خِرَاشِ بْنِ حَوْشَبٍ الشَّيْبَانِيُّ عَنْ الْعَوَّامِ بْنِ حَوْشَبٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمُونَ شُرَكَاءُ فِي ثَلَاثٍ فِي الْمَاءِ وَالْكَلَإِ وَالنَّارِ وَثَمَنُهُ حَرَامٌ قَالَ أَبُو سَعِيدٍ يَعْنِي الْمَاءَ الْجَارِيَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مسلمان تین چیزوں میں شریک ہیں: پانی،گھاس اور آگ میں۔اور ان کی قیمت لینا حرام ہے۔(امام ابن ماجہ رحمۃ اللہ علیہ کے استاد) حضرت ابو سعید (عبداللہ بن سعید بن حصین) نے فرمایا: پانی سے مراد جاری پانی (دریا،نہر،ندی وغیرہ) ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عبد اللّٰہ بن خراش: ضعیف <br>والحدیث صحیح دون قولہ’’ وثمنہ حرام ‘‘`;
ibnemaja.anwaar = [468,1];