var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الْمِنْهَالِ سَمِعْتُ إِيَاسَ بْنَ عَبْدٍ الْمُزَنِيَّ وَرَأَى نَاسًا يَبِيعُونَ الْمَاءَ فَقَالَ لَا تَبِيعُوا الْمَاءَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُبَاعَ الْمَاءُ";
ibnemaja.urdu = "حضرت اِیاس بن عبد مزنی رضی اللہ عنہ سے روایت ہے کہ انہوں نے کچھ لوگوں کو اپنی فروخت کرتے دیکھا تو فرمایا: پانی نہ بیچو،میں نے رسول اللہ ﷺ کو پانی فروخت کرنے سے منع کرتے سنا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;