var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ فَضْلِ الْمَاءِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے (ضرورت پوری کرنے کے بعد) بچا ہوا پانی فروخت کرنے سے منع فرمایا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;