var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبِي عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي سَيْلِ مَهْزُورٍ أَنْ يُمْسِكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ ثُمَّ يُرْسِلَ الْمَاءَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے وادی مہزورکے سیلابی پانی کے بارے میں یہ فیصلہ دیا کہ آدمی پانی روکے حتی کہ ٹخنوں تک پانی پہنچ جائے،پھر وہ (دوسرے کے لیے) پانی چھوڑ دے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;