var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ أَنْبَأَنَا أَبُو الْجَعْدِ عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ الْمُزَنِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَدَّأُ بِالْخَيْلِ يَوْمَ وِرْدِهَا";
ibnemaja.urdu = "حضرت عمرو بن عوف مزنی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: پانی پلانے کے دن پہلے گھوڑوں کو پلایا جائے (اونٹوں اور بکروں سے پہلے گھوڑوں کو پانی پلایا جائے)۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>کثیر بن عبد اللّٰہ العوفي: ضعیف جدًا`;
ibnemaja.anwaar = [468,1];