var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الشَّعْثَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ قَسْمٍ قُسِمَ فِي الْجَاهِلِيَّةِ فَهُوَ عَلَى مَا قُسِمَ وَكُلُّ قَسْمٍ أَدْرَكَهُ الْإِسْلَامُ فَهُوَ عَلَى قَسْمِ الْإِسْلَامِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو تقسیم زمانہ جاہلیت میں ہو چکی ہے،وہ جس طرح تقسیم ہو گئی ہے اسی طرح رہے گی۔اور جو تقسیم اسلام کے زمانے میں ہو گی،وہ اسلام کے طریقہ تقسیم کے مطابق ہو گی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;