var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْوَلِيدُ بْنُ عَمْرِو بْنِ سُكَيْنٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى ح و حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ الْمَكِيُّ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَفَرَ بِئْرًا فَلَهُ أَرْبَعُونَ ذِرَاعًا عَطَنًا لِمَاشِيَتِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جس نے کنواں کھودا تو چالیس ہاتھ زمین اس کے مویشیوں کے بیٹھنے کے لیے ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;