var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي الصُّغْدِيِّ حَدَّثَنَا مَنْصُورُ بْنُ صُقَيْرٍ حَدَّثَنَا ثَابِتُ بْنُ مُحَمَّدٍ عَنْ نَافِعٍ أَبِي غَالِبٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرِيمُ الْبِئْرِ مَدُّ رِشَائِهَا";
ibnemaja.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرامای: کنویں کا حریم (متعلقہ رقبہ) اس کے رسے کی لمبائی کے برابر ہوتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،ثابت بن محمد انقلب علی ابن ماجۃ وصوابہ محمد بن ثابت کما ذکرہ الذھبي فی الکاشف وقد ضعفوہ ومنصور بن صقیر متفق علی ضعفہ ‘‘ منصور بن صقیر: ضعیف (تقریب: 2903)`;
ibnemaja.anwaar = [468,1];