var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي الصُّغْدِيِّ حَدَّثَنَا مَنْصُورُ بْنُ صُقَيْرٍ حَدَّثَنَا ثَابِتُ بْنُ مُحَمَّدٍ الْعَبْدِيُّ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرِيمُ النَّخْلَةِ مَدُّ جَرِيدِهَا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرامای: کھجور کے درخت کا حریم اس کی شاخوں کے پھیلاؤ تک ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>منصور بن صقیر: ضعیف`;
ibnemaja.anwaar = [468,1];