var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَعَمْرُو بْنُ رَافِعٍ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ حَدَّثَنَا أَبُو مَالِكٍ النَّخَعِيُّ عَنْ يُوسُفَ بْنِ مَيْمُونٍ عَنْ أَبِي عُبَيْدَةَ بْنِ حُذَيْفَةَ عَنْ أَبِيهِ حُذَيْفَةَ بْنِ الْيَمَانِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَاعَ دَارًا وَلَمْ يَجْعَلْ ثَمَنَهَا فِي مِثْلِهَا لَمْ يُبَارَكْ لَهُ فِيهَا";
ibnemaja.urdu = "حضرت حذیفہ بن یمان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے مکان بیچا اور اس کی قیمت کو اس جیسی چیز میں خرچ نہ کیا تو اسے اس میں برکت حاصل نہیں ہو گی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>یوسف بن میمون المخزومي: ضعیف (تقریب: 7889) <br>و قال الھیثمي: وضعفہ الجمھور (مجمع الزوائد 200/10) وأبومالک النخعي: متروک <br>وللحدیث شاھد ضعیف عند البیہقي (6/ 33،34)`;
ibnemaja.anwaar = [469,1];