var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ نَخْلٌ أَوْ أَرْضٌ فَلَا يَبِيعُهَا حَتَّى يَعْرِضَهَا عَلَى شَرِيكِهِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس کا کھجوروں کا باغ ہو یا زمین ہو تو وہ اسے نہ بیچے جب تک اپنے شریک کو پیش کش نہ کرے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;