var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانَ وَالْعَلَاءُ بْنُ سَالِمٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَأَرَادَ بَيْعَهَا فَلْيَعْرِضْهَا عَلَى جَارِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جس کے پاس زمین ہو اور وہ اسے بیچنا چاہے تو اسے چاہیے کہ اپنے ہمسائے کو (خریدنے کی) پیش کش کرے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;