var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَارُ أَحَقُّ بِشُفْعَةِ جَارِهِ يَنْتَظِرُ بِهَا وَإِنْ كَانَ غَائِبًا إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ہمسایہ اپنے ہمسائے کے شفعے کا زیادہ حق رکھتا ہے۔اگر (ہمسایہ) غیر حاضر ہو تو اس (کے شفعے) کا انتظار کیا جائے جب کہ ان دونوں کا راستہ ایک ہو۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;