var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِي رَافِعٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجَارُ أَحَقُّ بِسَقَبِهِ";
ibnemaja.urdu = "حضرت ابو رافع رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ہمسایہ اپنے قریب کی جگہ (مکان یا زمین) کا زیادہ حق دار ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;