var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ عَمْرِو بْنِ الشَّرِيدِ بْنِ سُوَيْدٍ عَنْ أَبِيهِ الشَّرِيدِ بْنِ سُوَيْدٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرْضٌ لَيْسَ فِيهَا لِأَحَدٍ قِسْمٌ وَلَا شِرْكٌ إِلَّا الْجِوَارُ قَالَ الْجَارُ أَحَقُّ بِسَقَبِهِ";
ibnemaja.urdu = "حضرت شرید بن سوید ثقفی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے عرض کیا: اے اللہ کے رسول! وہ زمین جس میں کسی کا حصہ یا شراکت نہیں،صرف ہمسائیگی ہے (اس کا کیا حکم ہے؟) رسول اللہ ﷺ نے فرمایا: ہمسایہ اپنے قریب کی جگہ کا زیادہ حق دار ہے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;