var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِي رَافِعٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّرِيكُ أَحَقُّ بِسَقَبِهِ مَا كَانَ";
ibnemaja.urdu = "حضرت ابو رافع رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: شریک اپنے قریب کی (مشترک) جگہ کا زیادہ حق دار ہے جو کچھ بھی ہو۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;