var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الْبَيْلَمَانِيِّ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشُّفْعَةُ كَحَلِّ الْعِقَالِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: شفعہ اونٹ کی رسی کھولنے کی طرح ہے۔(جس طرح رسی کھلنے سے اونٹ فورا آزاد ہو جاتا ہے،اسی طرح شفعے کا دعویٰ فوری طور پر قابل قبول ہے۔جونہی زمین یا مکان کی فروخت کی خبر ملے تو دعویٰ کرے،بعد یہ میں دعویٰ قابل قبول نہیں ہے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>محمد بن الحارث: ضعیف <br>وشیخہ محمد بن عبد الرحمٰن بن البیلماني: ضعیف <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [469,1];