var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الْبَيْلَمَانِيِّ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا شُفْعَةَ لِشَرِيكٍ عَلَى شَرِيكٍ إِذَا سَبَقَهُ بِالشِّرَاءِ وَلَا لِصَغِيرٍ وَلَا لِغَائِبٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ایک شریک کو دوسرے شریک پر شفعے کا حق نہیں،جب وہ اس سے پہلے خرید لے۔نہ چھوٹے (نا بالاغ) بچے کو حق شفعہ حاصل ہے،نہ غیر حاضر ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>انظر الحدیث السابق (2500)`;
ibnemaja.anwaar = [469,1];