var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ الْحَسَنِ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ";
ibnemaja.urdu = "حضرت عبداللہ بن شخیر عامری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مومن کا گم شدہ جانور (جہنم کی) آگ کا شعلہ ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;