var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ مُوسَى بْنِ عُبَيْدَةَ،عَنْ مُحَمَّدِ بْنِ ثَابِتٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي،وَعَلِّمْنِي مَا يَنْفَعُنِي،وَزِدْنِي عِلْمًا،وَالْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ فرمایا کرتے تھے:﴿ اللَّہُمَّ انْفَعْنِی بِمَا عَلَّمْتَنِی وَعَلِّمْنِی مَا یَنْفَعُنِی وَزِدْنِی عِلْمًا وَالْحَمْدُ لِلَّہِ عَلَی کُلِّ حَالٍ ﴾ ’’اے اللہ! تو مجھے جو علم نصیب فرمائے اس سے مجھے فائدہ پہنچا اور مجھے وہ علم دے جو مجھے فائدہ دے اور میرے علم میں اضافہ فرما۔اور ہر حال میں اللہ کی تعریف ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذی (3599) وانظر الحدیث الآتي (3833)<br>وروایۃ المستدرک (1/ 510 ح 1879،سندہ حسن) یغنی عنہ`;
ibnemaja.anwaar = [384,1];