var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ دَبَّرَ رَجُلٌ مِنَّا غُلَامًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَاعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاشْتَرَاهُ ابْنُ النَّحَّامِ رَجُلٌ مِنْ بَنِي عَدِيٍّ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہمارے قبیلے کے ایک آدمی نے ایک غلام کو مدبر قرار دے دیا۔اس کے پاس اس غلام کے علاوہ کوئی مال نہیں تھا۔نبی ﷺ نے اس (غلام) کو فروخت کر دیا۔اسے قبیلہ بنو عدی کے ایک شخص ابن نحام (رضی اللہ عنہ) نے خرید لیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;