var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ ظَبْيَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُدَبَّرُ مِنْ الثُّلُثِ قَالَ ابْن مَاجَةَ سَمِعْتُ عُثْمَانَ يَعْنِي ابْنَ أَبِي شَيْبَةَ يَقُولُ هَذَا خَطَأٌ يَعْنِي حَدِيثَ الْمُدَبَّرُ مِنْ الثُّلُثِ قَالَ أَبُو عَبْد اللَّهِ لَيْسَ لَهُ أَصْلٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: مدبر (ترکے کے) تیسرے حصے میں (سے آزاد ہوتا) ہے۔امام ابن ماجہ رحمۃ اللہ علیہ نے فرمایا: میں نے حضرت عثمان بن ابی شیبہ رحمۃ اللہ علیہ کو یہ فرماتے سنا: یہ حدیث،یعنی مدبر تیسرے حصے میں ہے،غلط ہے۔\nامام ابن ماجہ رحمۃ اللہ علیہ نے فرمایا: اس حدیث کی کوئی اصل نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>علي بن ظبیان: ضعیف (تقریب: 4756) <br>ورجع عن رفعہ،والموقوف ھو الصحیح،<br>وللمر فوع شاہد ضعیف جدًا`;
ibnemaja.anwaar = [469,2];