var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي النَّهْشَلِيَّ عَنْ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ ذُكِرَتْ أُمُّ إِبْرَاهِيمَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعْتَقَهَا وَلَدُهَا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کی موجودگی میں (رسول اللہ ﷺ کے بیٹے) حضرت ابراہیم رضی اللہ عنہ کی والدہ کا ذکر ہوا تو رسول اللہ ﷺ نے فرمایا: اس کے بیٹے نے اسے آزاد کروا دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>أبو بکر بن أبي سبرۃ: ضعیف جدًا <br>وانظر الحدیث السابق (2515)`;
ibnemaja.anwaar = [470,1];