var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كُنَّا نَبِيعُ سَرَارِيَّنَا وَأُمَّهَاتِ أَوْلَادِنَا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِينَا حَيٌّ لَا نَرَى بِذَلِكَ بَأْسًا";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم اپنی لونڈیوں اور امہاتِ اولاد کو بیچ دیا کرتے تھے جب کہ نبی ﷺ زندہ تھے۔ہم اس میں کوئی حرج نہیں سمجھتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;