var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ كُلُّهُمْ حَقٌّ عَلَى اللَّهِ عَوْنُهُ الْغَازِي فِي سَبِيلِ اللَّهِ وَالْمُكَاتَبُ الَّذِي يُرِيدُ الْأَدَاءَ وَالنَّاكِحُ الَّذِي يُرِيدُ التَّعَفُّفَ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: تین قسم کے تمام آدمیوں کی مدد اللہ نے اپنے ذمے لے لی ہے۔اللہ کے راستے میں جنگ کرنے والا،وہ مکاتب جو ادائیگی کا ارادہ رکھتا ہے اور وہ نکاح کرنے والا جس کا مقصد پاک دامن رہنا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;