var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَمُحَمَّدُ بْنُ فُضَيْلٍ عَنْ حَجَّاجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا عَبْدٍ كُوتِبَ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلَّا عَشْرَ أُوقِيَّاتٍ فَهُوَ رَقِيقٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس غلام سے سو اوقیے کے عوض مکاتبت کی گئی اور اس نے رقم ادا کر دی،صرف دس اوقیے اس کے ذمے رہ گئے تو وہ غلام ہی رہے گا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;