var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ نَبْهَانَ مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ أَنَّهَا أَخْبَرَتْ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا كَانَ لِإِحْدَاكُنَّ مُكَاتَبٌ وَكَانَ عِنْدَهُ مَا يُؤَدِّي فَلْتَحْتَجِبْ مِنْهُ";
ibnemaja.urdu = "ام المومنین حضرت ام سلمہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جب کسی عورت کا غلام مکاتب ہو اور اس کے پاس ادا کرنے (اور آزاد ہو جانے) کے لیے رقم موجود ہو تو مالکہ کو اس سے پردہ کرنا چاہیے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;