var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ أَبِي مُرَاوِحٍ عَنْ أَبِي ذَرٍّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَيُّ الرِّقَابِ أَفْضَلُ قَالَ أَنْفَسُهَا عِنْدَ أَهْلِهَا وَأَغْلَاهَا ثَمَنًا";
ibnemaja.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے عرض کیا: اے اللہ کے رسول! کون سا غلام (لونڈی) آزاد کرنا افضل ہے؟ رسول اللہ ﷺ نے فرمایا: جو مالکوں کی نظر میں زیادہ عمدہ ہو،اور جس کی قیمت زیادہ ہو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;