var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ قَتَادَةَ وَعَاصِمٍ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ";
ibnemaja.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو کسی محرم رشتے دار کا مالک بن گیا تو (اس کا) وہ (رشتے دار) آزاد ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;