var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ وَعُبَيْدُ اللَّهِ بْنُ الْجَهْمِ الْأَنْمَاطِيُّ قَالَا حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو کسی محرم رشتے دار کا مالک بن گیا تو (اس کا) وہ (رشتے دار) آزاد ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;