var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سَعِيدِ بْنِ جُمْهَانَ عَنْ سَفِينَةَ أَبِي عَبْدِ الرَّحْمَنِ قَالَ أَعْتَقَتْنِي أُمُّ سَلَمَةَ وَاشْتَرَطَتْ عَلَيَّ أَنْ أَخْدُمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عَاشَ";
ibnemaja.urdu = "حضرت ابو عبدالرحمٰن سفینہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے ام المومنین حضرت ام سلمہ رضی اللہ عنہا نے آزاد کیا تھا اور یہ شرط لگا دی تھی کہ جب تک رسول اللہ ﷺ زندہ ہیں،میں نبی ﷺ کی خدمت کرتا رہوں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;