var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ: حَدَّثَنَا أَبُو كَرِبٍ الْأَزْدِيُّ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ طَلَبَ الْعِلْمَ لِيُمَارِيَ بِهِ السُّفَهَاءَ،أَوْ لِيُبَاهِيَ بِهِ الْعُلَمَاءَ،أَوْ لِيَصْرِفَ وُجُوهَ النَّاسِ إِلَيْهِ،فَهُوَ فِي النَّارِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا:’’جو شخص اس لئے علم حاصل کرتا ہے کہ بے علم(عوام) سے بحث کرے یا علماء کے مقابلے میں فخر کا اظہار کرے یا لوگوں کی توجہ اپنی طرف مبذول کرائے،وہ جہنم میں جائے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حماد بن عبد الرحمٰن الکلبي: ضعیف وأبو کرب الأزدي مجھول (تقريب:1502،8326) <br>وللحدیث شواھد ضعیفۃ عند الترمذي (2654) وغیرہ`;
ibnemaja.anwaar = [384,1];