var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ أَبِي يَزِيدَ الضَّبِّيِّ عَنْ مَيْمُونَةَ بِنْتِ سَعْدٍ مَوْلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ وَلَدِ الزِّنَا فَقَالَ نَعْلَانِ أُجَاهِدُ فِيهِمَا خَيْرٌ مِنْ أَنْ أُعْتِقَ وَلَدَ الزِّنَا";
ibnemaja.urdu = "نبی ﷺ کی آزاد کردہ حضرت میمونہ بنت سعد رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ سے ناجائز تعلق کے نتیجے میں پیدا ہونے والے (غلام) کے بارے میں دریافت کیا گیا تو آپ نے فرمایا: ناجائز بچے کو آزاد کرنے سے تو جوتوں کا وہ جوڑا بہتر ہے جنہیں پہن کر میں جہاد کروں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو یزید الضني: مجہول (تقریب: 8451) والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [470,1];