var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْبَلُ اللَّهُ مِنْ مُشْرِكٍ أَشْرَكَ بَعْدَ مَا أَسْلَمَ عَمَلًا حَتَّى يُفَارِقَ الْمُشْرِكِينَ إِلَى الْمُسْلِمِينَ";
ibnemaja.urdu = "حضرت بہز بن حکیم رحمۃ اللہ علیہ اپنے والد (حضرت حکیم بن معاویہ رحمۃ اللہ علیہ) سے اور وہ ان کے دادا (حضرت معاویہ بن حیدہ قشیری رضی اللہ عنہ) سے روایت کرتے ہیں،رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ اس مشرک کا کوئی عمل قبول نہیں کرتا جو اسلام لانے کے بعد مشرک ہو جائے حتی کہ وہ مشرکوں کو چھوڑ کر مسلمانوں سے آ ملے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;