var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا سَعِيدُ بْنُ سِنَانٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ أَبِي شَجَرَةَ كَثِيرِ بْنِ مُرَّةَ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِقَامَةُ حَدٍّ مِنْ حُدُودِ اللَّهِ خَيْرٌ مِنْ مَطَرِ أَرْبَعِينَ لَيْلَةً فِي بِلَادِ اللَّهِ عَزَّ وَجَلَّ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ کی مقرر کردہ حدوں میں سے ایک حد جاری کرنا اللہ عزوجل کی زمین میں چالیس راتوں کی بارش سے بہتر ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>سعید بن سنان الحنفي الحمصي: ’’ متروک رماہ الدار قطني وغیرہ بالوضع ‘‘ (تقریب: 2333)`;
ibnemaja.anwaar = [470,1];