var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَنْبَأَنَا عِيسَى بْنُ يَزِيدَ قَالَ أَظُنُّهُ عَنْ جَرِيرِ بْنِ يَزِيدَ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدٌّ يُعْمَلُ بِهِ فِي الْأَرْضِ خَيْرٌ لِأَهْلِ الْأَرْضِ مِنْ أَنْ يُمْطَرُوا أَرْبَعِينَ صَبَاحًا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: زمین میں ایک (مجرم کو) حد لگانا زمین والوں کے لیے چالیس دن بارش برسنے سے بہتر ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نسائي (4908،4909)`;
ibnemaja.anwaar = [470,1];