var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ قَالَ: أَنْبَأَنَا يَحْيَى بْنُ أَيُّوبَ،عَنِ ابْنِ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَعَلَّمُوا الْعِلْمَ لِتُبَاهُوا بِهِ الْعُلَمَاءَ،وَلَا لِتُمَارُوا بِهِ السُّفَهَاءَ،وَلَا تَخَيَّرُوا بِهِ الْمَجَالِسَ،فَمَنْ فَعَلَ ذَلِكَ فَالنَّارُ النَّارُ»";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا:’’علم اس لئے حاصل نہ کرو کہ علماء کے مقابلہ میں فخر کا اظہار کرو،نہ اس لئے کہ کم عقل لوگوں سے بحث کرو،نہ اس لئے کہ مجلس میں ممتاز مقام حاصل کرو۔جس نے ایسا کیا تو(اس کے لئے) آگ ہے،آگ ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن جریج وأبو الزبیر مدلسان وعنعنا`;
ibnemaja.anwaar = [384,1];