var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَالِمٍ الْمَفْلُوجُ حَدَّثَنَا عُبَيْدَةُ بْنُ الْأَسْوَدِ عَنْ الْقَاسِمِ بْنِ الْوَلِيدِ عَنْ أَبِي صَادِقٍ عَنْ رَبِيعَةَ بْنِ نَاجِدٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقِيمُوا حُدُودَ اللَّهِ فِي الْقَرِيبِ وَالْبَعِيدِ وَلَا تَأْخُذْكُمْ فِي اللَّهِ لَوْمَةُ لَائِمٍ";
ibnemaja.urdu = "حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ کی حدیثں قریب والے پر بھی نافذ کرو اور درود والے پر بھی۔تمہیں اللہ (کے احکام کی تعمیل) کے بارے میں کسی ملامت کرنے والے کی ملامت (ان پر عمل کرنے سے) رکاوٹ نہ بنے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبیدۃ بن الأسود مدلس وعنعن <br>وللحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [471,1];