var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ سَمِعْتُ عَطِيَّةَ الْقُرَظِيَّ يَقُولُ عُرِضْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ قُرَيْظَةَ فَكَانَ مَنْ أَنْبَتَ قُتِلَ وَمَنْ لَمْ يُنْبِتْ خُلِّيَ سَبِيلُهُ فَكُنْتُ فِيمَنْ لَمْ يُنْبِتْ فَخُلِّيَ سَبِيلِي";
ibnemaja.urdu = "حضرت عطیہ قرظی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: بنو قریظہ (کی سزا) کے دن ہم لوگ رسول اللہ ﷺ کی خدمت میں پیش کیے گئے تو جس کے (زیر ناف) بال اگ آئے تھے اسے قتل کر دیا گیا اور جس کے بال نہیں اگ تھے،اسے چھوڑ دیا گیا۔میں ان افراد میں سے تھا جن کے بال نہیں اگے تھے تو مجھے بھی چھوڑ دیا گیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;