var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ حَدَّثَنَا وَكِيعٌ عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادْفَعُوا الْحُدُودَ مَا وَجَدْتُمْ لَهُ مَدْفَعًا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جہاں تک حد لگانے سے بچاؤ کی گنجائش ملے،حد رفع کرو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>إبراہیم بن الفضل:متروک <br>ولہ شواہد ضعیفۃ عند الترمذي (1424) وغیرہ`;
ibnemaja.anwaar = [471,1];