var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْجُمَحِيُّ حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَتَرَ عَوْرَةَ أَخِيهِ الْمُسْلِمِ سَتَرَ اللَّهُ عَوْرَتَهُ يَوْمَ الْقِيَامَةِ وَمَنْ كَشَفَ عَوْرَةَ أَخِيهِ الْمُسْلِمِ كَشَفَ اللَّهُ عَوْرَتَهُ حَتَّى يَفْضَحَهُ بِهَا فِي بَيْتِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو شخص اپنے مسلمان بھائی کی برہنگی چھپائے گا تو اللہ تعالیٰ قیامت کے دن اس کی برہنگی چھپائے گا۔اور جو شخص اپنے مسلمان بھائی کا پردہ فاش کرے گا تو اللہ تعالیٰ اس کا پردہ فاش کرے گا حتی کہ اس اس کے گھر کے اندر رسوا کر دے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>محمد بن عثمان بن صفوان الجمحي: ضعیف (تقریب: 6130) <br>والحدیث السابق (الأصل: 2544) یُغني عنہ`;
ibnemaja.anwaar = [471,1];