var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُفِعَ إِلَيْهِ رَجُلٌ وَطِئَ جَارِيَةَ امْرَأَتِهِ فَلَمْ يَحُدَّهُ";
ibnemaja.urdu = "حضرت سلمہ بن محیق رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کی خدمت میں ایک مرد پیش کیا گیا جس نے اپنی بیوی کی لونڈی سے مباشرت کی تھی۔رسول اللہ ﷺ نے اسے حد نہیں لگائی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;