var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو عَمْرٍو حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَاجِرِ عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ أَنَّ امْرَأَةً أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاعْتَرَفَتْ بِالزِّنَا فَأَمَرَ بِهَا فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ رَجَمَهَا ثُمَّ صَلَّى عَلَيْهَا";
ibnemaja.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ ایک خاتون نے نبی ﷺ کی خدمت میں حاضر ہو کر زنا کا اقرار کیا،رسول اللہ ﷺ کے حکم سے اس کے کپڑے اچھی طرح باندھ دیے گئے،پھر آپ نے اسے سنگسار کیا،پھر اس کی نماز جنازہ ادا کی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;