var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ يَهُودِيَّيْنِ أَنَا فِيمَنْ رَجَمَهُمَا فَلَقَدْ رَأَيْتُهُ وَإِنَّهُ يَسْتُرُهَا مِنْ الْحِجَارَةِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے دو یہودی افراد (ایک مرد اور ایک عورت) کو رجم کیا۔رجم کرنے والوں میں میں بھی شامل تھا۔میں نے اس (یہودی) کو دیکھا کہ وہ اس (عورت) کو پتھروں سے بچانے کی کوشش کر رہا تھا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;