var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيرِ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَاقْتُلُوا الْفَاعِلَ وَالْمَفْعُولَ بِهِ";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جسے تم حضرت لوط علیہ السلام کی قوم والا کام کرتے دیکھو تو فاعل اور مفعول دونوں کو قتل کر دو۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;