var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ نَافِعٍ أَخْبَرَنِي عَاصِمُ بْنُ عُمَرَ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ قَالَ ارْجُمُوا الْأَعْلَى وَالْأَسْفَلَ ارْجُمُوهُمَا جَمِيعًا";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے اس شخص کے بارے میں،جو حضرت لوط علیہ السلام کی (بدکار) قوم والی حرکت کرتا ہے،فرمایا: اوپر والے اور نیچے والے کو سنگسار کر دو۔ان دونوں کو سنگسار کر دو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;