var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَعِيلَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَقَعَ عَلَى ذَاتِ مَحْرَمٍ فَاقْتُلُوهُ وَمَنْ وَقَعَ عَلَى بَهِيمَةٍ فَاقْتُلُوهُ وَاقْتُلُوا الْبَهِيمَةَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص محرم عورت سے بدکاری کرے تو اسے قتل کر دو۔اور جو شخص کسی جانور سے بدفعلی کرے تو اسے بھی قتل کر دو،اور اس جانور کو بھی ہلاک کر دو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1462)<br>فائدۃ: و انظر الحدیث الآتي لقتل من تزوج امرأۃ أبیہ (الأصل: 2608) و سندہ حسن`;
ibnemaja.anwaar = [471,1];