var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ لَمَّا نَزَلَ عُذْرِي قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَذَكَرَ ذَلِكَ وَتَلَا الْقُرْآنَ فَلَمَّا نَزَلَ أَمَرَ بِرَجُلَيْنِ وَامْرَأَةٍ فَضُرِبُوا حَدَّهُمْ";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: جب میری براءت بازل ہوئی تو رسول اللہ ﷺ نے منبر پر کھڑے ہو کر اس کا ذکر فرمایا اور قرآن (کی متعلقہ آیات) کی تلاوت فرمائی۔جب منبر سے اترے تو دو مردوں اور ایک عورت کو (حد لگانے کا)حکم جاری فرمایا،چنانچہ انہیں حد لگائی گئی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;