var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنِي ابْنُ أَبِي حَبِيبَةَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ يَا مُخَنَّثُ فَاجْلِدُوهُ عِشْرِينَ وَإِذَا قَالَ الرَّجُلُ لِلرَّجُلِ يَا لُوطِيُّ فَاجْلِدُوهُ عِشْرِينَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ﷜ سے روایت ہے نبی ﷺ نے فرمایا: ’’جب کوئی مرد دوسرے کو کہے: اے مخنث! (اے ہیجڑے) تو اسے بیس کوڑے مارو۔اور جب کوئی مرد دوسرے مرد کوکہے: اے لوطی!تواسے بیس کوڑے مارو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1462)<br>انظر الحدیث المتقدم (2564)`;
ibnemaja.anwaar = [471,1];