var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ جَمِيعًا عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضْرِبُ فِي الْخَمْرِ بِالنِّعَالِ وَالْجَرِيدِ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ شراب نوشی کے جرم میں جوتوں اور چھڑیوں سے سزا دیتے تھے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;