var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الْحَارِثِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَكِرَ فَاجْلِدُوهُ فَإِنْ عَادَ فَاجْلِدُوهُ فَإِنْ عَادَ فَاجْلِدُوهُ ثُمَّ قَالَ فِي الرَّابِعَةِ فَإِنْ عَادَ فَاضْرِبُوا عُنُقَهُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اگر کوئی نشہ کرے تو اسے کوڑے لگاؤ۔اگر دوبارہ (یہ جرم) کرے تو اسے کوڑے لگاؤ۔اگر پھر (یہ جرم) کرے تو اسے کوڑے لگاؤ۔پھر چوتھی بار فرمایا: اگر پھر (یہ جرم) کرے تو اسے قتل کر دو۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;