var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَقَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ ذَكْوَانَ أَبِي صَالِحٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا شَرِبُوا الْخَمْرَ فَاجْلِدُوهُمْ ثُمَّ إِذَا شَرِبُوا فَاجْلِدُوهُمْ ثُمَّ إِذَا شَرِبُوا فَاجْلِدُوهُمْ ثُمَّ إِذَا شَرِبُوا فَاقْتُلُوهُمْ";
ibnemaja.urdu = "حضرت معاویہ بن ابو سفیان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اگر لوگ شراب پی لیں تو انہیں کوڑے مارو۔پھر اگر (دوبارہ) پئیں تو انہیں کوڑے مارو۔اگر پھر (تیسری بار) پئیں تو انہیں کوڑے مارو۔اگر پھر (چوتھی بار) پئیں تو انہیں قتل کر دو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;