var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ الْبَرَّادِ بْنِ يُوسُفَ بْنِ بُرَيْدِ بْنِ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے ہم پر ہتھیار اٹھایا وہ ہم میں سے نہیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;