var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ وَأَبُو كُرَيْبٍ وَيُوسُفُ بْنُ مُوسَى وَعَبْدُ اللَّهِ بْنُ الْبَرَّادِ قَالُوا حَدَّثَنَا أَبُو أُسَامَةُ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ مَنْ شَهَرَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا";
ibnemaja.urdu = "حضرت ابو موسیٰ عبداللہ بن قیس اشعری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے ہم پر (حملہ کرنے کے لیے) ہتھیار نکالا وہ ہم میں سے نہیں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;