var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ حَدَّثَنَا الدَّرَاوَرْدِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ قَوْمًا أَغَارُوا عَلَى لِقَاحِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَطَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ کچھ لوگوں نے رسول اللہ ﷺ کی دودھ والی اونٹنیاں لوٹ لیں تو نبی ﷺ نے ان کے ہاتھ پاؤں کاٹ دیے،اور لوہے کی گرم سلائیوں سے ان کی آنکھیں پھوڑ دیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;