var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ،وَأَبُو بدْرٍ عَبَّادُ بْنُ الْوَلِيدِ،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ الْهُنَائِيُّ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ الْهُنَائِيُّ،عَنْ أَيُّوبَ السَّخْتِيَانِيِّ،عَنْ خَالِدِ بْنِ دُرَيْكٍ،عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ طَلَبَ الْعِلْمَ لِغَيْرِ اللَّهِ،أَوْ أَرَادَ بِهِ غَيْرَ اللَّهِ،فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’جس نے غیراللہ کے لئے علم طلب کیا یا اس سے اللہ کے سوا کسی اور کا ارادہ کیا،اسے چاہیے کہ اپنا ٹھکانا جہنم میں بنالے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2655)`;
ibnemaja.anwaar = [385,1];