var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ";
ibnemaja.urdu = "حضرت سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جو شخص اپنے مال کو (چور یا ڈاکو سے) بچانے کے لیے (اس کا مقابلہ کرتے ہوئے) قتل ہو گیا،وہ شہید ہے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;