var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْخَلِيلُ بْنُ عَمْرٍو حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ حَدَّثَنَا يَزِيدُ بْنُ سِنَانٍ الْجَزَرِيُّ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُتِيَ عِنْدَ مَالِهِ فَقُوتِلَ فَقَاتَلَ فَقُتِلَ فَهُوَ شَهِيدٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس کے مال کے پاس کوئی آئے اور (اسے لینے کی کوشش کرے،جب وہ بچانا چاہے تو) اس سے جنگ کی جائے،تب وہ (حملہ آور سے) لڑے اور قتل ہو جائے تو وہ شہید ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;