var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُرِيدَ مَالُهُ ظُلْمًا فَقُتِلَ فَهُوَ شَهِيدٌ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس سے ظلم کے طور پر اس کا مال طلب کیا جائے،وہ قتل ہو جائے تو وہ شہید ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;