var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ اللَّهُ السَّارِقَ يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ لعنت فرمائے اس چور پر جو اندا چراتا ہے تو (بالآخر) اس کا ہاتھ کاٹ دیا جاتا ہے اور رسی چراتا ہے تو اس کا ہاتھ کاٹ دیا جاتا ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;