var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ أَنَّ عَمْرَةَ أَخْبَرَتْهُ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقْطَعُ الْيَدُ إِلَّا فِي رُبُعِ دِينَارٍ فَصَاعِدًا";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ہاتھ صرف چوتھائی دینار یا اس سے زیادہ (کی چوری) کی وجہ سے کاٹا جائے گا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;