var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ وَمُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو سَلَمَةَ الْجُوبَارِيُّ يَحْيَى بْنُ خَلَفٍ قَالُوا حَدَّثَنَا عُمَرُ بْنُ عَلِيِّ بْنِ عَطَاءِ بْنِ مُقَدَّمٍ عَنْ حَجَّاجٍ عَنْ مَكْحُولٍ عَنْ ابْنِ مُحَيْرِيزٍ قَالَ سَأَلْتُ فَضَالَةَ بْنَ عُبَيْدٍ عَنْ تَعْلِيقِ الْيَدِ فِي الْعُنُقِ فَقَالَ السُّنَّةُ قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ رَجُلٍ ثُمَّ عَلَّقَهَا فِي عُنُقِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن محریز رحمۃ اللہ علیہ سے روایت ہے،انہوں نے فرمایا: میں نے حضرت فضالہ بن عبید رضی اللہ عنہ سے (چور کے) گلے میں ہاتھ لٹکانے کے بارے میں سوال کیا تو انہوں نے فرمایا: یہ سنت ہے۔رسول اللہ ﷺ نے ایک آدمی کا ہاتھ کاٹا،پھر وہ اس کی گردن میں لٹکا دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4411) ترمذي (1447) نسائي (4985)`;
ibnemaja.anwaar = [471,1];