var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ أَبِي عَوَانَةَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَرَقَ الْعَبْدُ فَبِيعُوهُ وَلَوْ بِنَشٍّ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب غلام چوری کرے تو اسے بیچ ڈالو،خواہ نصف اوقیے کے عوض (فروخت ہو)۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;