var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَاصِمٍ الْعَبَّادَانِيُّ قَالَ: حَدَّثَنَا بَشِيرُ بْنُ مَيْمُونٍ،قَالَ: سَمِعْتُ أَشْعَثَ بْنَ سَوَّارٍ،عَنِ ابْنِ سِيرِينَ،عَنْ حُذَيْفَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَعَلَّمُوا الْعِلْمَ لِتُبَاهُوا بِهِ الْعُلَمَاءَ،أَوْ لِتُمَارُوا بِهِ السُّفَهَاءَ،أَوْ لِتَصْرِفُوا وُجُوهَ النَّاسِ إِلَيْكُمْ،فَمَنْ فَعَلَ ذَلِكَ فَهُوَ فِي النَّارِ»";
ibnemaja.urdu = "سیدنا حذیفہ رضی اللہ عنہ سےروایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے یہ ارشاد مبارک سنا ہے:’’علم کو اس غرض سے حاصل نہ کرو کہ علماء کے مقابلے میں فخر کا اظہار کرو یا کم عقل لوگوں سے بحث کرو،یا لوگوں کی توجہ اپنی طرف مبذول کرو۔جس نے یہ کام کیا،وہ جہنمی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف ‘‘ بشیر بن میمون: متروک متھم (تقریب: 725) وأشعث بن سوار: ضعیف <br>وللحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [385,1];