var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا حَجَّاجُ بْنُ تَمِيمٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ أَنَّ عَبْدًا مِنْ رَقِيقِ الْخُمُسِ سَرَقَ مِنْ الْخُمُسِ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَقْطَعْهُ وَقَالَ مَالُ اللَّهِ عَزَّ وَجَلَّ سَرَقَ بَعْضُهُ بَعْضًا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ خمس کے غلاموں میں سے ایک غلام نے خمس کے مال میں سے کچھ چرا لیا۔اسے نبی ﷺ کی خدمت میں پیش کیا گیا تو آپ نے اس کا ہاتھ نہ کاٹا۔اور فرمایا: اللہ کے مال (غلام) نے اللہ کا مال چوری کیا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جبارۃ: ضعیف جدًا <br>وحجاج بن تمیم:ضعیف`;
ibnemaja.anwaar = [472,1];