var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقْطَعُ الْخَائِنُ وَلَا الْمُنْتَهِبُ وَلَا الْمُخْتَلِسُ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: خیانت کرنے والے کا ہاتھ کاٹا جائے،نہ چھیننے والے کا اور نہ اچکنے والے کا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;