var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ عَاصِمِ بْنِ جَعْفَرٍ الْمِصْرِيُّ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيْسَ عَلَى الْمُخْتَلِسِ قَطْعٌ";
ibnemaja.urdu = "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے یہ ارشاد سنا: اچکنے والے کی سزا ہاتھ کاٹنا نہیں ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;