var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ";
ibnemaja.urdu = "حضرت رافع بن خدیج رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: پھل چرانے یا کھجور کا گودا چرانے پر ہاتھ نہیں کاٹا جائے گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;