var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ وَأَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ أَنْبَأَنَا الْحَجَّاجُ بْنُ أَرْطَاةَ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَ اسْتُكْرِهَتْ امْرَأَةٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَرَأَ عَنْهَا الْحَدَّ وَأَقَامَهُ عَلَى الَّذِي أَصَابَهَا وَلَمْ يَذْكُرْ أَنَّهُ جَعَلَ لَهَا مَهْرًا";
ibnemaja.urdu = "عبدالجبار بن وائل نے اپنے والد (حضرت وائل بن حجر رضی اللہ عنہ) سے روایت کی ہے کہ رسول اللہ ﷺ کے زمانے میں ایک عورت سے زبردستی بدکاری کا ارتکاب کیا گیا تو رسول اللہ ﷺ نے اسے حد سے بری کر دیا،اور اس شخص پر حد جاری کی جس نے اس سے بدکاری کی تھی۔صحابی نے یہ ذکر نہیں کیا کہ نبی ﷺ نے اس عورت کو مہر دلوایا تھا (یا نہیں۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1453)`;
ibnemaja.anwaar = [472,1];