var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ جَمِيعًا عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مسجدوں میں حدیں نہ لگائی جائیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1401)`;
ibnemaja.anwaar = [472,1];