var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو النَّضْرِ عَنْ شُعْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ قَالَ سَمِعْتُ الشَّعْبِيَّ يَقُولُ جَالَسْتُ ابْنَ عُمَرَ سَنَةً فَمَا سَمِعْتُهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا";
ibnemaja.urdu = "امام شعبی رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں سال بھر حضرت عبداللہ بن عمر رضی اللہ عنہما کی مجلس میں حاضر رہا،(اس دوران میں) میں نے انہیں کبھی رسول اللہ ﷺ سے کوئی چیز بیان کرتے نہیں سنا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;