var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ قَالَ: أَنْبَأَنَا وَهْبُ بْنُ إِسْمَاعِيلَ الْأَسَدِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْمَقْبُرِيُّ،عَنْ جَدِّهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَعَلَّمَ الْعِلْمَ لِيُبَاهِيَ بِهِ الْعُلَمَاءَ،وَيُجَارِيَ بِهِ السُّفَهَاءَ،وَيَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ،أَدْخَلَهُ اللَّهُ جَهَنَّمَ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جس نے علم اس لئے حاصل کیا کہ اس کی وجہ سے علماء کے مقابلے میں فخر کرے یا کم عقل لوگوں سے بحث کرے یا لوگوں کی توجہ اپنی طرف مبذول کرے،تو اللہ تعالیٰ اسے جہنم میں داخل کرے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف۔لإ تفاقھم علٰی ضعف عبد اللّٰہ بن سعید ‘‘ وھو متروک`;
ibnemaja.anwaar = [385,1];