var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ أَنَّهُ سَمِعَ عَمْرَو بْنَ شُعَيْبٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ جَلْدِ الْحَدِّ فِي الْمَسَاجِدِ";
ibnemaja.urdu = "حضرت عمرو بن شعیب رحمۃ اللہ علیہ نے اپنے والد سے،اور انہوں نے اپنے دادا (حضرت عبداللہ بن عمرو رضی اللہ عنہ) سے روایت کیا ہے کہ رسول اللہ ﷺ نے مسجدوں میں حد لگانے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھذا إسناد ضعیف لضعف ابن لھیعۃ ‘‘`;
ibnemaja.anwaar = [472,1];