var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لَا يُجْلَدُ أَحَدٌ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ";
ibnemaja.urdu = "حضرت ابوبردہ بن نیار رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ فرمایا کرتے تھے: اللہ کی مقرر کردہ حدوں میں سے کسی حد کے علاوہ کسی (مجرم) کو دس سے زیادہ کوڑے نہ مارے جائیں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;