var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا عَبَّادُ بْنُ كَثِيرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُعَزِّرُوا فَوْقَ عَشَرَةِ أَسْوَاطٍ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دس کوڑوں سے زیادہ تعزیر نہ لگاؤ۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ضعفہ البوصیري من أجل عباد بن کثیر <br>وللحدیث شاھد عند الطبراني فی الأوسط (7524) <br>والعقیلي فی الضعفاء (1/ 65) وقال: ’’ إبراہیم بن محمد شامي مجھول،حدیثہ منکر غیر محفوظ ‘‘ والحدیث السابق (الأصل: 2601) یغني عنہ`;
ibnemaja.anwaar = [472,1];