var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ وَابْنُ أَبِي عَدِيٍّ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْأَشْعَثِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَصَابَ مِنْكُمْ حَدًّا فَعُجِّلَتْ لَهُ عُقُوبَتُهُ فَهُوَ كَفَّارَتُهُ وَإِلَّا فَأَمْرُهُ إِلَى اللَّهِ";
ibnemaja.urdu = "حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: تم میں سے جس شخص سے حد کے قابل جرم سر زد ہو جائے،پھر اسے جلدی (دنیا ہی میں) سزا مل جائے تو یہ اس کا کفارہ بن جاتی ہے۔ورنہ (اگر وہ دنیوی سزا سے بچ جائے) تو اس کا معاملہ اللہ کے سپرد ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;