var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ ابْنُ أَخِي الْحُسَيْنِ الْجُعْفِيِّ حَدَّثَنَا يُوسُفُ بْنُ مَنَازِلَ التَّيْمِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ خَالِدِ بْنِ أَبِي كَرِيمَةَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَجُلٍ تَزَوَّجَ امْرَأَةَ أَبِيهِ أَنْ أَضْرِبَ عُنُقَهُ وَأُصَفِّيَ مَالَهُ";
ibnemaja.urdu = "حضرت معاویہ بن قرہ رحمۃ اللہ علیہ نے اپنے والد حضرت قرہ بن ایاس رضی اللہ عنہ سے روایت کی ہے،انہوں نے فرمایا: مجھے رسول اللہ ﷺ نے ایک شخص کی طرف بھیجا جس نے اپنے والد کی بیوی سے نکاح کر لیا تھا (اور مجھے حکم دیا) کہ میں اسے قتل کر دوں اور اس کا مال ضبط کر لوں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;