var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا ابْنُ أَبِي الضَّيْفِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ انْتَسَبَ إِلَى غَيْرِ أَبِيهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص اپنے باپ کے سوا کسی اور کی طرف نسبت کرے،اور جو (غلام یا لونڈی) اپنے مولیٰ(آزاد کرنے والے) کے علاوہ کسی اور کو اپنا مولیٰ قرار دے،اس پر اللہ کی،فرشتوں کی اور تمام لوگوں کی لعنت ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;