var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَ سَمِعْتُ سَعْدًا وَأَبَا بَكْرَةَ وَكُلُّ وَاحِدٍ مِنْهُمَا يَقُولُ سَمِعَتْ أُذُنَايَ وَوَعَى قَلْبِي مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ";
ibnemaja.urdu = "حضرت سعد اور حضرت ابوبکرہ رضی اللہ عنہ سے روایت ہے،ان دونوں میں سے ہر ایک نے فرمایا: میرے کانوں نے حضرت محمد ﷺ سے یہ ارشاد مبارک سنا اور میرے دل نے اسے یاد رکھا کہ آپ ﷺ فرما رہے تھے: جو شخص جان بوجھ کر اپنے باپ کے سوا کسی دوسرے کی طرف اپنی نسبت کرتا ہے،اس پر جنت حرام ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;