var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ عَنْ عَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ خَمْسِ مِائَةِ عَامٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص اپنے والد کے سوا کسی اور کی طرف نسبت کرتا ہے تو وہ جنت کی خوشبو نہیں پائے گا،حالانکہ اس کی خوشبو پانچ سو سال کے فاصلے سے محسوس ہوتی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضیعف <br>سفیان الثوري عنعن <br>ورواہ شعبۃ عن الحکم بن عتیبۃ عن مجاہد بہ نحوہ بلفظ: و إن ریحھا لیوجد من قدر سبعین عاما۔(أحمد 171/2،194) وسندہ معلول،الحکم بن عتیبۃ مدلس و عنعن`;
ibnemaja.anwaar = [472,2];