var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُقْتَلُ نَفْسٌ ظُلْمًا،إِلَّا كَانَ عَلَى ابْنِ آدَمَ الْأَوَّلِ كِفْلٌ مِنْ دَمِهَا،لِأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ»";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جس انسان کو بھی ظلم کے طور پر قتل کیا جاتا ہے اس کے خون (کے گناہ) کا ایک حصہ آدم کے پہلے بیٹے (قابیل) کو بھی ملتا ہے۔کیونکہ سب سے پہلے اس نے قتل کا طریقہ جاری کیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;