var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ الْأَزْهَرِ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الْأَزْرَقُ،عَنْ شَرِيكٍ،عَنْ عَاصِمٍ،عَنْ أَبِي وَائِلٍ،عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’قیامت کے دن لوگوں میں سب سے پہلے خون کے مقدمات کے فیصلے ہوں گے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;