var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَائِذٍ،عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَقِيَ اللَّهَ لَا يُشْرِكُ بِهِ شَيْئًا لَمْ يَتَنَدَّ بِدَمٍ حَرَامٍ دَخَلَ الْجَنَّةَ»";
ibnemaja.urdu = "سیدنا عقبہ بن عامر جہنی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص اللہ سے اس حال میں ملتا ہے کہ اس کے ساتھ کسی چیز کو (عبادت میں) شریک نہیں کرتا اور کسی حرام خون میں ملوث نہیں ہوتا تو وہ جنت میں داخل ہو جاتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>إسماعیل بن أبي خالد مدلس و عنعن <br>ولأول الحدیث شاھد عند البخاري (129) وھو یغني عنہ`;
ibnemaja.anwaar = [473,1];