var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ جَنَاحٍ،عَنْ أَبِي الْجَهْمِ الْجُوزَجَانِيِّ،عَنِ الْبَرَاءِ بْنِ عَازِبٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَزَوَالُ الدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ قَتْلِ مُؤْمِنٍ بِغَيْرِ حَقٍّ»";
ibnemaja.urdu = "سیدنا براء بن عازب رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’اللہ کی نظر میں کسی مومن کو ناحق قتل کرنے سے پوری دنیا کا تباہ ہو جانا بھی کم اہمیت رکھتا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;