var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زِيَادٍ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ أَعَانَ عَلَى قَتْلِ مُؤْمِنٍ وَلَوْ بِشَطْرِ كَلِمَةٍ،لَقِيَ اللَّهَ عَزَّ وَجَلَّ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ: آيِسٌ مِنْ رَحْمَةِ اللَّهِ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس شخص نے کسی مومن کے قتل میں آدھے لفظ کے ساتھ بھی تعاون کیا،وہ جب اللہ سے ملے تو اس کی پیشانی پر لکھا ہوگا اللہ کی رحمت سے مایوس۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>یزید بن زیاد الشامي: متروک <br>وللحدیث شواہد ضعیفۃ عند البیہقي (22/8)وغیرہ`;
ibnemaja.anwaar = [473,1];