var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ: حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ: إِمَّا أَنْ يَقْتُلَ،وَإِمَّا أَنْ يُفْدَى";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس کا کوئی (قریبی رشتے دار) آدمی قتل ہو جائے تو اسے دو ایک جیسی چیزوں میں سے ایک کے انتخاب کا حق حاصل ہے۔یا (قاتل کو) قتل کر لے،یا فدیہ(دیت) لے لے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;