var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلَانِيُّ قَالَ: حَدَّثَنَا خَلَفُ بْنُ تَمِيمٍ،عَنْ عَبْدِ اللَّهِ بْنِ السَّرِيِّ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا لَعَنَ آخِرُ هَذِهِ الْأُمَّةِ أَوَّلَهَا،فَمَنْ كَتَمَ حَدِيثًا فَقَدْ كَتَمَ مَا أَنْزَلَ اللَّهُ»";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جب امت کے پچھلے لوگ پہلوں پر لعنت کرنے لگیں،اس وقت جس نے کوئی حدیث چھپائی،اس نے اللہ کی نازل کردہ چیز کو چھپالیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `موضوع <br>عبد اللّٰہ بن السري: لم یدرک ابن المنکدر،بل سمع ھذا الحدیث من سعید بن زکریا المدائني عن عنبسۃ بن عبد الرحمٰن (متروک،رماہ أبو حاتم بالوضع / ضعیف سنن الترمذي: 1856) عن محمد بن زاذان (متروک / ضعیف سنن الترمذي:2699) عن ابن المنکدر بہ<br>انظر المعجم الأوسط للطبراني (432)`;
ibnemaja.anwaar = [385,1];