var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ عَاصِمٍ قَالَ: حَدَّثَنَا الصَّبَّاحُ بْنُ مُحَارِبٍ قَالَ: حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ قَالَ: حَدَّثَنَا زَيْدُ بْنُ جُبَيْرٍ،عَنْ خِشْفِ بْنِ مَالِكٍ الطَّائِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فِي دِيَةِ الْخَطَأِ عِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً وَعِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ بَنِي مَخَاضٍ ذُكُورٌ»";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قتل خطا کی دیت بیس حقے(تین سالہ اونٹنیاں) بیس جذعے(چار سالہ اونٹنیاں) بیس بنت مخاض(ایک سالہ اونٹنیاں) بیس بنت لبون(دو سالہ اونٹنیاں) اور بیس مذکر ابن مخاض(ایک سالہ اونٹ) ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (4545) ترمذي (1386) نسائي (4806)`;
ibnemaja.anwaar = [473,1];