var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا أَبِي،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ،عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ،عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: «قَضَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالدِّيَةِ عَلَى الْعَاقِلَةِ»";
ibnemaja.urdu = "مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے فیصلہ دیا کہ دیت کی ذمے دار،عاقلہ(قاتل کی برادری) ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;