var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ مُعَاذِ بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ عَنْ ابْنِ صُهْبَانَ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَوَدَ فِي الْمَأْمُومَةِ وَلَا الْجَائِفَةِ وَلَا الْمُنَقِّلَةِ";
ibnemaja.urdu = "عباس بن عبدالمطلب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دماغ کی جھلی تک پہنچ جانے والے زخم کا قصاص نہیں،نہ جسم کے اندرونی خلا(مثلا پیٹ) تک پہنچ جانے والے زخم میں اور نہ ہڈی کو اپنی جگہ سے ہٹا دینے والی چوٹ میں قصاص ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>رشدین بن سعد: ضعیف <br>وللحدیث شاہد ضعیف وأخرج البیہقي (65/8) بإسناد حسن عن طلحۃ رضي اللّٰہ عنہ أن النبي ﷺ قال: ((لیس فی المأمومۃ قود))`;
ibnemaja.anwaar = [473,2];