var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ: حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ قَالَ: حَدَّثَنِي عُمَرُ بْنُ سُلَيْمٍ قَالَ: حَدَّثَنَا يُوسُفُ بْنُ إِبْرَاهِيمَ،قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ سُئِلَ عَنْ عِلْمٍ فَكَتَمَهُ أُلْجِمَ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ»";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سےسنا ہے: آپ نے فرمایا:’’جس نے علم کی کوئی بات دریافت کی گئی،پھر اس نے اسے چھپایا،اسے قیامت کے دن آگ کی لگام دی جائے گی۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;