var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ إِسْحَقَ بْنِ يَحْيَى بْنِ الْوَلِيدِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى لِحَمَلِ بْنِ مَالِكٍ الْهُذَلِيِّ اللِّحْيَانِيِّ بِمِيرَاثِهِ مِنْ امْرَأَتِهِ الَّتِي قَتَلَتْهَا امْرَأَتُهُ الْأُخْرَى";
ibnemaja.urdu = "عبادہ بن صامت رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے حمل بن مال ہذلی رضی اللہ عنہ کو ان کی اس بیوی کے ترکے سے حصہ دلوایا جسے ان کی دوسری بیوی نے قتل کر دیا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>إسحاق لم یدرک عبادۃ رضي اللّٰہ عنہ`;
ibnemaja.anwaar = [474,1];