var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ عَقْلَ أَهْلِ الْكِتَابَيْنِ نِصْفُ عَقْلِ الْمُسْلِمِينَ وَهُمْ الْيَهُودُ وَالنَّصَارَى";
ibnemaja.urdu = "عمرو بن شعیب رحمہ اللہ نے اپنے والد سے،اور انہوں نے اپنے دادا(عبداللہ بن عمرو بن عاص رضی اللہ عنہما) سے روایت کی کہ رسول اللہ ﷺ نے یہ فیصلہ صادر فرمایا کہ اہل کتاب کا خون بہا مسلمانوں کے خون بہا سے نصف ہے۔اہل کتاب سے مراد یہودی اور عیسائی ہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;