var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مُجَالِدٌ عَنْ الشَّعْبِيِّ عَنْ جَابِرٍ قَالَ جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدِّيَةَ عَلَى عَاقِلَةِ الْقَاتِلَةِ فَقَالَتْ عَاقِلَةُ الْمَقْتُولَةِ يَا رَسُولَ اللَّهِ مِيرَاثُهَا لَنَا قَالَ لَا مِيرَاثُهَا لِزَوْجِهَا وَوَلَدِهَا";
ibnemaja.urdu = "جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ﷺ نے دیت،قتل کرنے والی عورت کے عصبہ رشتہ داروں کے ذمے ڈالی۔مقتول عورت کے عصبہ رشتہ داروں نے کہا: اے اللہ کے رسول! اس کا ترکہ ہمیں ملے گا؟ آپ ﷺ نے فرمایا: ’’نہیں،اس کا ترکہ اس کے خاوند اور اس کے بچوں کے لیے ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (4575)`;
ibnemaja.anwaar = [474,1];