var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ حِبَّانَ بْنُ وَاقِدٍ الثَّقَفِيُّ أَبُو إِسْحاقَ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَاصِمٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ دَابٍ،عَنْ صَفْوَانَ بْنِ سُلَيْمٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَتَمَ عِلْمًا مِمَّا يَنْفَعُ اللَّهُ بِهِ فِي أَمْرِ النَّاسِ أَمْرِ الدِّينِ،أَلْجَمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنَ النَّارِ»";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جس نے علم کی کوئی ایسی بات چھپائی جس سے اللہ لوگوں کو دین کے معاملے میں فائدہ پہنچاتا ہے،اسے قیامت کے دن اللہ تعالیٰ آگ کی لگام ڈالے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>قال البوصیري: ’’ ھذا إسناد ضعیف فیہ محمد بن دأب،کذبہ أبو زرعۃ وغیرہ ونسب إلی وضع الحدیث ‘‘`;
ibnemaja.anwaar = [385,2];