var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ الْبَالِسِيُّ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ حَدَّثَنَا أَبُو حَمْزَةَ الْمَرْوَزِيُّ حَدَّثَنَا يَزِيدُ النَّحْوِيُّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَضَى فِي السِّنِّ خَمْسًا مِنْ الْإِبِلِ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے دانت کے بارے میں پانچ اونٹوں کا فیصلہ فرمایا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;