var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَابْنُ أَبِي عَدِيٍّ قَالُوا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذِهِ وَهَذِهِ سَوَاءٌ يَعْنِي الْخِنْصَرَ وَالْإِبْهَامَ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’یہ اور یہ برابر ہیں۔‘‘ یعنی خنصر (چھوٹی انگلی) بنصر (چھوٹی کے ساتھ والی انگلی) اور انگوٹھا(سب برابر ہیں۔)";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;