var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ مَطَرٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَصَابِعُ سَوَاءٌ كُلُّهُنَّ فِيهِنَّ عَشْرٌ عَشْرٌ مِنْ الْإِبِلِ";
ibnemaja.urdu = "عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’انگلیاں سب (آپس میں) برابر ہیں۔ان کی دیت دس دس اونٹ ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;