var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى السَّمَرْقَنْدِيُّ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ غَالِبٍ التَّمَّارِ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ مَسْرُوقِ بْنِ أَوْسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَصَابِعُ سَوَاءٌ";
ibnemaja.urdu = "ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’انگلیاں برابر ہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;