var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ مَطَرٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ مِنْ الْإِبِلِ";
ibnemaja.urdu = "عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’جن زخموں سے ہڈی ظاہر ہو جائے ان میں پانچ پانچ اونٹ دیت ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;