var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَفْصِ بْنِ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ قَالَ: حَدَّثَنَا أَبُو إِبْرَاهِيمَ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْكَرَابِيسِيُّ،عَنِ ابْنِ عَوْنٍ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سُئِلَ عَنْ عِلْمٍ يَعْلَمُهُ فَكَتَمَهُ،أُلْجِمَ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:’’جس سے علم کا کوئی ایسا مسئلہ پوچھا گیا جو اسے معلوم تھا،پھر بھی اس نے اسے چھپایا،اسے قیامت کے دن آگ کی لگام ڈالی جائے گی۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;