var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ حَنَشٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِهِ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’مومن کو کافر کے بدلے میں قتل نہ کیا جائے اور نہ عہد والے(ذمی) کو اس کے عہد میں قتل کیا جائے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>حنش: حسین بن قیس أبو علي الرحبي متروک <br>و قولہ: ((لا یقتل مؤمن بکافر۔)) صحیح بالشواھد و قولہ: ’’ و لا ذو عھد في عھدہ ‘‘ ضعیف ولہ شواھد ضعیفۃ عند ابن حبان (الموارد: 1699) و أبي داود (4530) وغیرھما`;
ibnemaja.anwaar = [474,1];