var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَهُ جَدَعْنَاهُ";
ibnemaja.urdu = "سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے اپنے غلام کو قتل کیا،ہم اسے قتل کر دیں گے،اور جس نے غلام کے ناک کان کاٹے،ہم بھی اس کے ناک کان کاٹ دیں گے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;