var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ الطَّبَّاعِ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ عَلِيٍّ و عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَتَلَ رَجُلٌ عَبْدَهُ عَمْدًا مُتَعَمِّدًا فَجَلَدَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِائَةً وَنَفَاهُ سَنَةً وَمَحَا سَهْمَهُ مِنْ الْمُسْلِمِينَ";
ibnemaja.urdu = "علی رضی اللہ عنہ اور عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک آدمی نے جان بوجھ کر اپنے غلام کو عمداً قتل کر دیا۔رسول اللہ ﷺ نے اسے سو کوڑے لگوائے،اسے ایک سال کے لیے جلا وطن کر دیا اور مسلمانوں (کے مال غنیمت) میں سے اس کا حصہ ختم کر دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>إسحاق بن أبي فروۃ: متروک`;
ibnemaja.anwaar = [474,2];