var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ هَمَّامِ بْنِ يَحْيَى عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ يَهُودِيًّا رَضَخَ رَأْسَ امْرَأَةٍ بَيْنَ حَجَرَيْنِ فَقَتَلَهَا فَرَضَخَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ بَيْنَ حَجَرَيْنِ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک یہودی نے ایک عورت کا سر دو پتھروں کے درمیان کچل کر اسے قتل کر دیا۔رسول اللہ ﷺ نے بھی اس (قاتل) کا سر دو پتھروں کے درمیان کچل دیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;