var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ سُفْيَانَ عَنْ جَابِرٍ عَنْ أَبِي عَازِبٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قَوَدَ إِلَّا بِالسَّيْفِ";
ibnemaja.urdu = "نعمان بن بشیر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قصاص صرف تلوار سے ہوتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جابر الجعفي: ضعیف رافضي <br>وأبو عازب:مستور (تقریب: 8194)`;
ibnemaja.anwaar = [475,1];