var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ حَدَّثَنَا الْحُرُّ بْنُ مَالِكٍ الْعَنْبَرِيُّ حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَوَدَ إِلَّا بِالسَّيْفِ";
ibnemaja.urdu = "ابو بکرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قصاص صرف تلوار سے ہوتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الحسن عنعن <br>وللحدیث طریق معلول عند الدار قطني (106/3)`;
ibnemaja.anwaar = [475,1];