var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ شَبِيبِ بْنِ غَرْقَدَةَ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي حَجَّةِ الْوَدَاعِ أَلَا لَا يَجْنِي جَانٍ إِلَّا عَلَى نَفْسِهِ لَا يَجْنِي وَالِدٌ عَلَى وَلَدِهِ وَلَا مَوْلُودٌ عَلَى وَالِدِهِ";
ibnemaja.urdu = "عمرو بن احوص رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے حجۃ الوداع میں رسول اللہ ﷺ کو یہ فرماتے سنا: ’’سنو! کوئی جرم کرنے والا اپنے سوا کسی پر جرم نہیں کرتا۔نہ باپ کے جرم کی ذمے داری اس کے بیٹے پر ہے،نہ بیٹے کے جرم کی ذمے داری اس کے باپ پر ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;