var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ حَدَّثَنَا جَامِعُ بْنُ شَدَّادٍ عَنْ طَارِقٍ الْمُحَارِبِيِّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ يَقُولُ أَلَا لَا تَجْنِي أُمٌّ عَلَى وَلَدٍ أَلَا لَا تَجْنِي أُمٌّ عَلَى وَلَدٍ";
ibnemaja.urdu = "طارق محاربی رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے دیکھا کہ رسول اللہ ﷺ نے اپنے ہاتھ بلند فرمائے حتی کہ مجھے رسول اللہ ﷺ کی بغلوں کی سفیدی نظر آئی۔آپ نے فرمایا: ’’سنو! کسی ماں کے جرم کی ذمے داری اس کے بیٹے پر نہیں۔سنو! کسی ماں کے جرم کی ذمے داری اس کے بیٹے پر نہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;