var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا هُشَيْمٌ عَنْ يُونُسَ عَنْ حُصَيْنِ بْنِ أَبِي الْحُرِّ عَنْ الْخَشْخَاشِ الْعَنْبَرِيِّ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِيَ ابْنِي فَقَالَ لَا تَجْنِي عَلَيْهِ وَلَا يَجْنِي عَلَيْكَ";
ibnemaja.urdu = "خشخاش عنبری رضی اللہ عنہ سے روایت ہے انہوں نے کہا: میں نبی ﷺ کی خدمت میں حاضر ہوا،ا ور میرے ساتھ میرا بیٹا تھا،رسول اللہ ﷺ نے فرمایا: ’’تیرے جرم کی پرسش اس سے نہیں ہوگی اور اس کے جرم کی پرسش تجھ سے نہیں ہوگی۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;