var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا أَبُو الْعَوَّامِ الْقَطَّانُ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ أُسَامَةَ بْنِ شَرِيكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى";
ibnemaja.urdu = "اسامہ بن شریک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کسی جان کے جرم کی ذمے داری دوسری جان پر نہیں۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;