var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جُبَارٌ";
ibnemaja.urdu = "عمرو بن عوف مزنی رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے یہ ارشاد سنا: ’’جانور کا پہنچایا ہوا زخم ہدر(رائیکاں) ہے اور کان ہدر ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;