var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ السَّلَامِ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ عَنْ سَلَمَةَ بْنِ رَوْحِ بْنِ زِنْبَاعٍ عَنْ جَدِّهِ أَنَّهُ قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَخْصَى غُلَامًا لَهُ فَأَعْتَقَهُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمُثْلَةِ";
ibnemaja.urdu = "سلمہ بن روح بن زنباع اپنے دادا (زنباع بن روح جذامی رضی اللہ عنہ) سے روایت کرتے ہیں کہ وہ نبی ﷺ کی خدمت میں حاضر ہوئے،انہوں نے اپنے غلام کو خصی کر دیا تھا۔نبی ﷺ نے مثلے کی وجہ سے اس غلام کو آزاد کر دیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;