var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ شِبَاكٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَ قَالَ عَبْدُ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَعَفِّ النَّاسِ قِتْلَةً أَهْلَ الْإِيمَانِ";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قتل کرنے کے انداز میں بھی سب لوگوں سے زیادہ گناہ سے بچنے والے مومن ہی ہوتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2666)<br>مغیرۃ و إبراہیم النخعي عنعنا <br>وانظر الحدیث الآتي (2682)`;
ibnemaja.anwaar = [475,1];