var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ مُغِيرَةَ عَنْ شِبَاكٍ عَنْ إِبْرَاهِيمَ عَنْ هُنَيِّ بْنِ نُوَيْرَةَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَعَفَّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مومن ہی قتل کرنے کے انداز میں بھی سب لوگوں سے زیادہ گناہ سے بچنے والے ہوتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2666)`;
ibnemaja.anwaar = [475,1];