var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ حَنَشٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَيُرَدُّ عَلَى أَقْصَاهُمْ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’مسلمانوں کے خون باہم ہم مرتبہ ہیں۔وہ دوسروں (غیر مسلم دشمنوں) کے خلاف ایک ہاتھ کی طرح ہیں۔ان کا ادنیٰ بھی معاہدے کی ذمے داری اٹھا سکتا ہے۔مسلمانوں کو وہ (مجاہد) بھی غنیمت ادا کرے گا جو سب سے دور (اور دشمن سے بالکل قریب) ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;