var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ أَبُو ضَمْرَةَ عَنْ عَبْدِ السَّلَامِ بْنِ أَبِي الْجَنُوبِ عَنْ الْحَسَنِ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمُونَ يَدٌ عَلَى مَنْ سِوَاهُمْ وَتَتَكَافَأُ دِمَاؤُهُمْ";
ibnemaja.urdu = "معقل بن یسار رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مسلمان دوسروں کے خلاف ایک ہاتھ کی طرح ہیں۔اور ان کے خون باہم برابر ہیں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;