var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْحَسَنِ بْنِ عَمْرٍو عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا";
ibnemaja.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص کسی ذمی کو قتل کرے اسے جنت کی خوشبو نہیں آئے گی،حالانکہ اس کی خوشبو چالیس سال کے فاصلے سے محسوس ہوتی ہے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;