var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مَعْدِيُّ بْنُ سُلَيْمَانَ أَنْبَأَنَا ابْنُ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ مُعَاهَدًا لَهُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ عَامًا";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جس نے کسی ذمی کو قتل کیا،جس کی (حفاظت کی) ذمے داری اللہ اور اس کے رسول نے اٹھائی ہے تو وہ جنت کی خوشبو نہیں پائے گا،حالانکہ اس کی خوشبو ستر سال کے فاصلے سے محسوس ہوتی ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;