var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا حَبَّانُ بْنُ هِلَالٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ الْمُزَنِيُّ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ قَالَ لَا أَعْلَمُهُ إِلَّا عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ مَا رُفِعَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ فِيهِ الْقِصَاصُ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کے سامنے جب بھی کوئی ایسا مقدمہ پیش کیا گیا جس میں قصاص ہوتا تو رسول اللہ ﷺ نے معاف کرنے کا حکم دیا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;