var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ يُونُسَ بْنِ أَبِي إِسْحَقَ عَنْ أَبِي السَّفَرِ قَالَ قَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ رَجُلٍ يُصَابُ بِشَيْءٍ مِنْ جَسَدِهِ فَيَتَصَدَّقُ بِهِ إِلَّا رَفَعَهُ اللَّهُ بِهِ دَرَجَةً أَوْ حَطَّ عَنْهُ بِهِ خَطِيئَةً سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي";
ibnemaja.urdu = "ابو درداء رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: ’’جس کو جسم میں کوئی تکلیف پہنچے،پھر وہ اس (تکلیف پہنچانے والے) کو معاف کر دے تو اللہ تعالیٰ اس کی وجہ سے اس کا درجہ بلند کرتا ہے اور اس کا گناہ معاف کرتا ہے۔‘‘ ابو درداء رضی اللہ عنہ نے فرمایا: یہ بات میرے کانوں نے سنی اور میرے دل نے اسے یاد رکھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1393)`;
ibnemaja.anwaar = [475,1];