var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ أَبُو بَكْرٍ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِينَارًا وَلَا دِرْهَمًا وَلَا شَاةً وَلَا بَعِيرًا وَلَا أَوْصَى بِشَيْءٍ";
ibnemaja.urdu = "ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے (ترکے میں) نہ کوئی دینار چھوڑا نہ درہم،نہ کوئی بکری نہ اونٹ اور نہ آپ نے کسی چیز کے بارے میں وصیت کی۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;