var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَتْ عَامَّةُ وَصِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ حَضَرَتْهُ الْوَفَاةُ وَهُوَ يُغَرْغِرُ بِنَفْسِهِ الصَّلَاةَ وَمَا مَلَكَتْ أَيْمَانُكُمْ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جب رسول اللہ ﷺ کی وفات کا وقت آیا اور رسول اللہ ﷺ کا سانس اٹک رہا تاھ،اس وقت آپ نے سب سے زیادہ یہ وصیت کی: ’’نماز اور تمہارے مملوک۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن <br>ولحدیثہ شواھد کلھا ضعیفۃ انظر (ح 1625)<br>والحدیث الآتي (الأصل: 2698) یغني عنہ`;
ibnemaja.anwaar = [476,1];