var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا حَقُّ امْرِئٍ مُسْلِمٍ أَنْ يَبِيتَ لَيْلَتَيْنِ وَلَهُ شَيْءٌ يُوصِي فِيهِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مسلمان کا یہ حق نہیں کہ اگر اس کے پاس کوئی ایسی چیز موجود جس کے بارے میں وہ وصیت کرنا چاہتا ہو تو وہ دو راتیں بھی اس حال میں گزارے کہ اس کی وصیت اس کے بارے میں لکھی ہوئی اس کے پاس موجود نہ ہو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;