var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ إِنَّمَا كُنَّا نَحْفَظُ الْحَدِيثَ وَالْحَدِيثُ يُحْفَظُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا إِذَا رَكِبْتُمْ الصَّعْبَ وَالذَّلُولَ فَهَيْهَاتَ";
ibnemaja.urdu = "حضرت طاؤس رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے سنا،انہوں نے فرمایا: ہم حدیثیں یا کیا کرتے تھے اور اللہ کے رسول ﷺ کے حدیثیں یاد کی جاتی ہیں،لیکن جب تم نے سخت اور نرم زمین پر چلنا شروع کر دیا تو(تم پر اعتماد) دور کی بات ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;