var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا دُرُسْتُ بْنُ زِيَادٍ حَدَّثَنَا يَزِيدُ الرَّقَاشِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَحْرُومُ مَنْ حُرِمَ وَصِيَّتَهُ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’محروم وہ ہے جو اپنی وصیت کرنے سے محروم رہا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھذا إسناد ضعیف،لضعف (یزید بن أبان) الرقاشي والراوي عنہ‘‘ درست بن زیاد: ضعیف (د 3741) والرقاشي: ضعیف`;
ibnemaja.anwaar = [476,1];