var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ يَزِيدَ بْنِ عَوْفٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ عَلَى وَصِيَّةٍ مَاتَ عَلَى سَبِيلٍ وَسُنَّةٍ وَمَاتَ عَلَى تُقًى وَشَهَادَةٍ وَمَاتَ مَغْفُورًا لَهُ";
ibnemaja.urdu = "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص وصیت کر کے فوت ہوا،وہ سیدھی راہ پر اور سنت طریقے پر (عمل کرتا ہوا) فوت ہوا۔وہ تقوی اور شہادت کی موت مرا۔اور اس حال میں مرا کہ اس کی بخشش ہو چکی تھی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>یزید: مجہول،عمر بن صبح: متروک کذبہ ابن راہویہ (تقریب: 7760،4922)<br> وأسقطہ المدلس محمد بن المصفی (انظر التقریب: 6304) من السند والصواب اثباتہ بین یزید وأبی الزبیر انظر الکامل لابن عدي (1685/5)`;
ibnemaja.anwaar = [476,1];