var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ حَدَّثَنَا رَوْحُ بْنُ عَوْفٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا حَقُّ امْرِئٍ مُسْلِمٍ يَبِيتُ لَيْلَتَيْنِ وَلَهُ شَيْءٌ يُوصِي بِهِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ";
ibnemaja.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے۔نبی ﷺ نے فرمایا: ’’جس مسلمان کے پاس کوئی قابل وصیت چیز ہو،اسے یہ حق نہیں کہ دو راتیں بھی اس حال میں گزارے کہ اس کی وصیت اس کے پاس لکھی ہوئی موجود نہ ہو۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;