var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ طَلْحَةَ بْنِ عَمْرٍو عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَصَدَّقَ عَلَيْكُمْ عِنْدَ وَفَاتِكُمْ بِثُلُثِ أَمْوَالِكُمْ زِيَادَةً لَكُمْ فِي أَعْمَالِكُمْ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ نے تم پر یہ صدقہ کیا ہے کہ وفات کے وقت تمہیں تہائی مال (میں وصیت کا حق) دے دیا ہے تاکہ تمہارے نیک اعمال میں اضافہ ہو جائے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ضعفہ البوصیري من أجل طلحۃ بن عمرو: متروک <br>وتابعہ عقبۃ بن عبد اللّٰہ الأصم عن عطاء عند أبي نعیم فی الحلیۃ (322/3) وعقبۃ ضعیف (تقریب: 4642) <br>وللحدیث طرق کلھا ضعیفۃ`;
ibnemaja.anwaar = [477,1];