var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ وَدِدْتُ أَنَّ النَّاسَ غَضُّوا مِنْ الثُّلُثِ إِلَى الرُّبُعِ لِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الثُّلُثُ كَبِيرٌ أَوْ كَثِيرٌ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: مجھے یہ بات پسند ہے کہ لوگ تیسرے حصے کو کم کر کے چوتھے حصے کی وصیت کیا کریں کیونکہ رسول اللہ ﷺ نے فرمایا: ’’تیسرا حصہ ایک بڑی مقدار ہے۔‘‘ یا فرمایا: ’’تیسرا حصہ زیادہ ہے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;