var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي خُطْبَتِهِ عَامَ حِجَّةِ الْوَدَاعِ إِنَّ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ فَلَا وَصِيَّةَ لِوَارِثٍ";
ibnemaja.urdu = "ابو امامہ (صدی بن عجلان) باہل رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے حجۃ الوداع کے موقع پر رسول اللہ ﷺ کو اپنے خطبہ مبارک میں یہ فرماتے سنا: ’’اللہ تعالیٰ نے ہر حق والے کو اس کا حق دے دیا ہے،لہٰذا وارث کے لیے کوئی وصیت نہیں۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;