var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالدَّيْنِ قَبْلَ الْوَصِيَّةِ وَأَنْتُمْ تَقْرَءُونَهَا مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِهَا أَوْ دَيْنٍ وَإِنَّ أَعْيَانَ بَنِي الْأُمِّ لَيَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ";
ibnemaja.urdu = "علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے وصیت پوری کرنے سے پہلے قرض ادا کرنے کا حکم دیا اور تم یہ آیت پڑھتے ہو (السُّدُسُ مِنْۢ بَعْدِ وَصِیَّۃٍ یُّوْصِیْ بِھَآ اَوْ دَیْنٍ) ’’اس وصیت کے بعد جو وصیت کرے یا قرض کے بعد‘‘(النساء ۱۱:۴) اور سگے بھائی،ایک ماں کے بیٹے وارث ہوں گے،سوتیلے بھائی نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2094۔2095،2122) وانظر الحدیث الآتي (2739)`;
ibnemaja.anwaar = [477,1];