var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَبِي مَاتَ وَتَرَكَ مَالًا وَلَمْ يُوصِ فَهَلْ يُكَفِّرُ عَنْهُ أَنْ تَصَدَّقْتُ عَنْهُ قَالَ نَعَمْ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،ایک آدمی نے رسول اللہ ﷺ سے سوال کیا: میرا والد فوت ہوگیا ہے اور اس نے مال چھوڑا ہے،لیکن وصیت نہیں کی۔اگر میں اس کی طرف سے صدقہ کروں تو کیا اس کے گناہ معاف ہو جائیں گے؟ نبی ﷺ نے فرمایا: ’’ہاں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;