var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي افْتُلِتَتْ نَفْسُهَا وَلَمْ تُوصِ وَإِنِّي أَظُنُّهَا لَوْ تَكَلَّمَتْ لَتَصَدَّقَتْ فَلَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا وَلِيَ أَجْرٌ قَالَ نَعَمْ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے،ایک آدمی نے نبی ﷺ کی خدمت میں حاضر ہو کر عرض کیا: میری والدہ اچانک ہوت ہوگئی ہیں اور انہوں نے وصیت نہیں کی۔اور میرا خیال ہے کہ اگر انہیں بات چیت کرنے کا موقع ملتا تو صدقہ کرتیں۔اگر میں ان کی طرف سے صدقہ کروں تو کیا انہیں ثواب ملے گا۔اور کیا مجھے بھی ثواب ملے گا؟ رسول اللہ ﷺ نے فرمایا: ’’ہاں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;