var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا حَفْصُ بْنُ عُمَرَ بْنِ أَبِي الْعِطَافِ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا هُرَيْرَةَ تَعَلَّمُوا الْفَرَائِضَ وَعَلِّمُوهَا فَإِنَّهُ نِصْفُ الْعِلْمِ وَهُوَ يُنْسَى وَهُوَ أَوَّلُ شَيْءٍ يُنْزَعُ مِنْ أُمَّتِي";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’ابو ہریرہ! تم لوگ میراث کا علم سیکھو اور سکھاؤ،کیونکہ یہ آدھا علم ہے اور یہ بھلوا دیا جاتا ہے۔میری امت سے سب سے پہلے یہی علم اٹھایا جائے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>حفص بن عمر بن أبی العطاف: ضعیف (تقریب: 1418) <br>والحدیث من أجلہ ضعفہ البوصیري`;
ibnemaja.anwaar = [477,1];