var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْبَلُ اللَّهُ صَلَاةً إِلَّا بِطُهُورٍ وَلَا صَدَقَةً مِنْ غُلُولٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’اللہ تعالیٰ پاکیزگی کے بغیر نماز قبول نہیں فرماتا،اور خیانت کے مال میں سے صدقہ قبول نہیں فرماتا۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;