var ibnemaja = {};
ibnemaja.arabic = "حدثنا أبو بكر بن أبي شيبة حدثنا شبابة حدثنا يونس بن أبي إسحق عن أبي إسحق عن عمرو بن ميمون عن معقل بن يسار المزني قال سمعت النبي صلى الله عليه وسلم أتي بفريضة فيها جد فأعطاه ثلثا أو سدسا.";
ibnemaja.urdu = "معقل بن یسار مزنی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ کی خدمت میں واراثت کا ایک مسئلہ پیش کیا گیا جس میں دادا بھی تھا۔تو میں نے نبی ﷺ کو سنا کہ آپ نے اسے تیسرا حصہ یا چھٹا حصہ دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو إسحاق عنعن <br>وحدیث أبي داود (2894،2895) یغني عنہ`;
ibnemaja.anwaar = [477,1];