var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو حَاتِمٍ حَدَّثَنَا ابْنُ الطَّبَّاعِ حَدَّثَنَا هُشَيْمٌ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَدٍّ كَانَ فِينَا بِالسُّدُسِ";
ibnemaja.urdu = "معقل بن یسار رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا کہ رسول اللہ ﷺ نے ہمارے خاندان میں ایک دادے کو (اس کے پوتے کے ترکے میں سے) چھٹا حصہ دینے کا فیصلہ دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2897)`;
ibnemaja.anwaar = [477,1];