var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ عَنْ مُرَّةَ بْنِ شَرَاحِيلَ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ ثَلَاثٌ لَأَنْ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيَّنَهُنَّ أَحَبُّ إِلَيَّ مِنْ الدُّنْيَا وَمَا فِيهَا الْكَلَالَةُ وَالرِّبَا وَالْخِلَافَةُ";
ibnemaja.urdu = "مرہ بن شراحیل رحمہ اللہ سے روایت ہے کہ عمر بن خطاب رضی اللہ عنہ نے فرمایا: تین مسائل ایسے ہیں کہ اگر رسول اللہ ﷺ نے ان کی (مزید) وضاحت فرما دی ہوتی تو (یہ وضاحت) مجھے دنیا ومافیھا سے زیادہ محبوب ہوتی۔کلالہ،سود اور خلافت۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مرۃ بن شراحیل عن عمر مرسل کما قال أبو حاتم الرازي (المراسیل ص 208) <br>وأصل الحدیث متفق علیہ (البخاري: 5588،مسلم: 3032) ولم یذکرا الخلافۃ`;
ibnemaja.anwaar = [477,2];