var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ";
ibnemaja.urdu = "اسامہ بن زید رضی اللہ عہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’مسلمان کافر کا وارث نہیں ہوتا اور کافر مسلمان کا وارث نہیں ہوتا۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;