var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا أَبُو زُهَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سِنَانِ بْنِ سَعْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَقْبَلُ اللَّهُ صَلَاةً بِغَيْرِ طُهُورٍ وَلَا صَدَقَةً مِنْ غُلُولٍ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا،آپ فرما رہے تھے: ’’اللہ تعالیٰ پاکیزگی کے بغیر نماز قبول نہیں فرماتا اور خیانت کے مال میں سے صدقہ قبول نہیں فرماتا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;