var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا ابْنُ لَهِيعَةَ عَنْ خَالِدِ بْنِ يَزِيدَ أَنَّ الْمُثَنَّى بْنَ الصَّبَّاحِ أَخْبَرَهُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ";
ibnemaja.urdu = "عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دو مختلف ملتوں کے لوگ ایک دوسرے کے وارث نہیں ہوتے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;