var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو بَحْرٍ الْبَكْرَاوِيُّ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَعْيَانَ بَنِي الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ يَرِثُ الرَّجُلُ أَخَاهُ لِأَبِيهِ وَأُمِّهِ دُونَ إِخْوَتِهِ لِأَبِيهِ";
ibnemaja.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ نے یہ فیصلہ دیا تھا کہ ایک ماں کے بیٹے،یعنی سگے بھائی ایک دوسرے کے وارث ہوں گے،سوتیلے بھائی نہیں۔آدمی اپنے اس بھائی کا وارث ہے جو اس کے باپ اور اس کی ماں کا بیٹا ہے،اس کا وارث نہیں جو اس کے باپ کا بیٹا ہے (ماں کا نہیں)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (2715)`;
ibnemaja.anwaar = [478,1];