var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَقِيلٍ حَدَّثَنَا الْخَلِيلُ بْنُ زَكَرِيَّا حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْبَلُ اللَّهُ صَلَاةً بِغَيْرِ طُهُورٍ وَلَا صَدَقَةً مِنْ غُلُولٍ";
ibnemaja.urdu = "سیدنا ابو بکرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’اللہ تعالیٰ پاکیزگی کے بغیر نماز قبول نہیں فرماتا اور خیانت کے مال میں سے صدقہ قبول نہیں فرماتا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;