var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْسِمُوا الْمَالَ بَيْنَ أَهْلِ الْفَرَائِضِ عَلَى كِتَابِ اللَّهِ فَمَا تَرَكَتْ الْفَرَائِضُ فَلِأَوْلَى رَجُلٍ ذَكَرٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: اصحاب الفروض میں اللہ کی کتاب کے مطابق مال تقسیم کرو۔مقررہ حصے دینے کے بعد جو بچ جائے وہ قریب ترین مردکے لیے ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;