var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَوْسَجَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ مَاتَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَدَعْ لَهُ وَارِثًا إِلَّا عَبْدًا هُوَ أَعْتَقَهُ فَدَفَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ إِلَيْهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا:رسول اللہﷺ کے زمانے میں ایک شخص فوت ہوا اور اس نے کوئی وارث نہ چھوڑا،صرف ایک غلام تھا جسے اس نے آزاد کردیا تھا۔نبیﷺ نے اس کا ترکہ اس (آزاد کردہ غلام) کو دے دیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;