var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنَا عُمَرُ بْنُ رُؤْبَةَ التَّغْلِبِيُّ عَنْ عَبْدِ الْوَاحِدِ بْنِ عَبْدِ اللَّهِ النَّصْرِيِّ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَرْأَةُ تَحُوزُ ثَلَاثَ مَوَارِيثَ عَتِيقِهَا وَلَقِيطِهَا وَوَلَدِهَا الَّذِي لَاعَنَتْ عَلَيْهِ قَالَ مُحَمَّدُ بْنُ يَزِيدَ مَا رَوَى هَذَا الْحَدِيثَ غَيْرُ هِشَامٍ";
ibnemaja.urdu = "حضرت واثلہ بن اسقع رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: عورت تین ترکے حاصل کرتی ہے۔اپنے آزاد کردہ غلام کا،اس لاوارث بچے کا جسے اس نے پالا ہو،اوراپنے اس بچے کا جس پر اس نے لعان کیا ہو۔\nمحمد بن یزید نے کہا:اس روایت کو ہشام کے علاوہ کسی نے روایت نہیں کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2906) ترمذي (2115)`;
ibnemaja.anwaar = [478,1];