var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُفْرٌ بِامْرِئٍ ادِّعَاءُ نَسَبٍ لَا يَعْرِفُهُ أَوْ جَحْدُهُ وَإِنْ دَقَّ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے،نبیﷺ نے فرمایا: انسان کا یہ کام بھی کفر ہے کہ وہ اس نسب کا دعوی کرے یا انکار کرے جس کے بارے میں اسے یقینی علم نہیں،اگرچہ (یہ انکار یا دعویٰ) صراحت سے نہ ہو۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;