var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ عَنْ الْمُثَنَّى بْنِ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عَاهَرَ أَمَةً أَوْ حُرَّةً فَوَلَدُهُ وَلَدُ زِنًا لَا يَرِثُ وَلَا يُورَثُ";
ibnemaja.urdu = "حضرت عمرو بن شعیب اپنے والد (حضرت شعیب بن محمد) سے اور وہ اپنے دادا(حضرت عبداللہ بن عمرو رضی اللہ عنہما) سے روایت کرتے ہیں،رسو ل اللہﷺ نے فرمایا: جس نے کسی لونڈی سے یا کسی آزاد عورت سے زنا کیا تو اس کا (زنا کے نتیجے میں پیدا ہونے والے والا) بیٹا،ناجائز اولاد ہے۔وہ (اس زانی کا) وارث نہیں ہوگا،اور نہ اس کی وراثت (زانی کو) کو ملے گی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;