var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہﷺ نے ولاء کو بیچنے اور ہبہ کرنے سے منع فرمایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;