var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ عَنْ عُقَيْلٍ أَنَّهُ سَمِعَ نَافِعًا يُخْبِرُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا كَانَ مِنْ مِيرَاثٍ قُسِمَ فِي الْجَاهِلِيَّةِ فَهُوَ عَلَى قِسْمَةِ الْجَاهِلِيَّةِ وَمَا كَانَ مِنْ مِيرَاثٍ أَدْرَكَهُ الْإِسْلَامُ فَهُوَ عَلَى قِسْمَةِ الْإِسْلَامِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہﷺ نے فرمایا: جومیراث جاہلیت میں تقسیم ہوچکی،وہ جاہلیت کی تقسیم کے مطابق قائم رہے گی۔اور جس کی تقسیم سے پہلے اسلام آگیا(فوت ہونے والا اور اس کے وارث مسلمان ہوگئے) تو وہ اسلام کے اصولوں کے مطابق تقسیم ہوگی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;