var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِفْتَاحُ الصَّلَاةِ الطُّهُورُ وَتَحْرِيمُهَا التَّكْبِيرُ وَتَحْلِيلُهَا التَّسْلِيمُ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،رسو ل اللہ ﷺ نے فرمایا:’’نماز کی کنجی،پاکیزگی ہے اور نماز کی تحریک(اس میں پابندیاں لگانے والی چیز) تکبیر ہے اور نماز کی تحلیل(اس میں پابندیاں ختم کرنے والی چیز) سلام ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;