var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَهَلَّ الصَّبِيُّ صُلِّيَ عَلَيْهِ وَوَرِثَ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: جب بچہ آواز نکالے تواس کا جنازہ پڑھا جائے گا اور وہ وارث ہوگا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (1508)<br>الربیع بن بدر: متروک <br>وتابعہ سفیان الثوري و عنعن <br>وتابعہما إسماعیل بن مسلم المکي: ضعیف <br>وأبو الزبیر عنعن`;
ibnemaja.anwaar = [478,1];