var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ وَالْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرِثُ الصَّبِيُّ حَتَّى يَسْتَهِلَّ صَارِخًا قَالَ وَاسْتِهْلَالُهُ أَنْ يَبْكِيَ وَيَصِيحَ أَوْ يَعْطِسَ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ اور حضرت مسور بن مخرم رضی اللہ عنہم سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’ بچہ وارث نہیں ہوگا حتی کہ آواز کے ساتھ چیخے۔‘\nراوی نے کہا: آواز نکالنے کا مطلب ہے کہ وہ روئے یا چیخے یا چھینک مارے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;