var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ سَمِعْتُ تَمِيمًا الدَّارِيَّ يَقُولُ قُلْتُ يَا رَسُولَ اللَّهِ مَا السُّنَّةُ فِي الرَّجُلِ مِنْ أَهْلِ الْكِتَابِ يُسْلِمُ عَلَى يَدَيْ الرَّجُلِ قَالَ هُوَ أَوْلَى النَّاسِ بِمَحْيَاهُ وَمَمَاتِهِ";
ibnemaja.urdu = "حضرت تمیم داری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے کہا: اے اللہ کے رسول! اہل کتاب کے اس شخص کے بارے میں کیا قانون ہے جو ایک آدمی کے ہاتھ پر اسلام قبول کرے؟ رسول اللہ ﷺ نے فرمایا: زندگی اور موت دونوں حالتوں میں اس کا اس سے تعلق سب لوگوں سے زیادہ ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;