var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدْوَةٌ أَوْ رَوْحَةٌ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ الدُّنْيَا وَمَا فِيهَا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: اللہ کی راہ میں (گزرنے والی) ایک صبح یا ایک شام دنیا وما فیہا سے بہتر ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;