var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا زَكَرِيَّا بْنُ مَنْظُورٍ حَدَّثَنَا أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدْوَةٌ أَوْ رَوْحَةٌ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ الدُّنْيَا وَمَا فِيهَا";
ibnemaja.urdu = "حضرت سہل بن سعد ساعدیؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: اللہ کی راہ میں ایک صبح یا ایک شام دنیا سے اور جو کچھ دنیا میں ہے اس سب سے بہتر ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;