var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَغَدْوَةٌ أَوْ رَوْحَةٌ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ الدُّنْيَا وَمَا فِيهَا";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: اللہ کی راہ میں ایک صبح یا ایک شام یقیناً دنیا سے اور جو کچھ دنیا میں ہے اس سب سے بہتر ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;