var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ كَانَ لَهُ مِثْلُ أَجْرِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَجْرِ الْغَازِي شَيْئًا";
ibnemaja.urdu = "حضرت زیدبن خالد جہنی ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: جس نے اللہ کی راہ میں جنگ کرنے والے کو سامان مہیا کیا،اسے بھی اس (مجاہد) کے برابر ثواب ملے گا جب کہ مجاہد کے ثواب میں کوئی کمی نہیں ہوگی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;