var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ أَبِي سُفْيَانَ طَرِيفٍ السَّعْدِيِّ ح و حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ أَبِي سُفْيَانَ السَّعْدِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِفْتَاحُ الصَّلَاةِ الطُّهُورُ وَتَحْرِيمُهَا التَّكْبِيرُ وَتَحْلِيلُهَا التَّسْلِيمُ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’نماز کی کنجی،پاکیزگی ہے اور نماز کی تحریم(اس میں پابندیاں لگانے والے چیز)تکبیر ہے اور نماز کی تحلیل (اس میں پابندیاں ختم کرنے والے چیز سلام ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;