var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا يَحْيَى بْنُ الْحَارِثِ الذِّمَارِيُّ عَنْ الْقَاسِمِ عَنْ أَبِي أُمَامَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يَغْزُ أَوْ يُجَهِّزْ غَازِيًا أَوْ يَخْلُفْ غَازِيًا فِي أَهْلِهِ بِخَيْرٍ أَصَابَهُ اللَّهُ سُبْحَانَهُ بِقَارِعَةٍ قَبْلَ يَوْمِ الْقِيَامَةِ";
ibnemaja.urdu = "حضرت ابوامامہ ؓ سے روایت ہے نبیﷺ نے فرمایا: جس شخص نے نہ جہاد کیا،نہ کسی مجاہد کو سامان مہیا کیا اور نہ کسی مجاہد کی غیر حاضری میں اس کے گھروالوں کی اچھی طرح خبر گیری کی تو اللہ تعالی اسے قیامت سے پہلے ہی کسی آفت میں مبتلا کردے گا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;