var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا أَبُو رَافِعٍ هُوَ إِسْمَعِيلُ بْنُ رَافِعٍ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَقِيَ اللَّهَ وَلَيْسَ لَهُ أَثَرٌ فِي سَبِيلِ اللَّهِ لَقِيَ اللَّهَ وَفِيهِ ثُلْمَةٌ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: جو شخص اللہ سےاس حال میں ملتا ہے کہ اس کا اللہ کی راہ (جہاد) میں کوئی حصہ نہیں تو وہ اللہ سے عیب دار ہوکر ملتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1666)`;
ibnemaja.anwaar = [478,2];