var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَقِيمُوا وَلَنْ تُحْصُوا وَاعْلَمُوا أَنَّ خَيْرَ أَعْمَالِكُمْ الصَّلَاةَ وَلَا يُحَافِظُ عَلَى الْوُضُوءِ إِلَّا مُؤْمِنٌ";
ibnemaja.urdu = "سیدنا ثوبان رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’سیدھی راہ پر قائم رہو اور تم (کما حقہ) قائم نہیں رہ سکو گے،اور تمہیں معلوم ہونا چاہیے کہ تمہارا بہترین عمل نماز ہے اور وضو کی حفاظت مومن ہی کرتا ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;