var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِيسَى بْنُ يُونُسَ الرَّمْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ عَنْ سَعِيدِ بْنِ خَالِدِ بْنِ أَبِي الطَّوِيلِ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حَرَسُ لَيْلَةٍ فِي سَبِيلِ اللَّهِ أَفْضَلُ مِنْ صِيَامِ رَجُلٍ وَقِيَامِهِ فِي أَهْلِهِ أَلْفَ سَنَةٍ السَّنَةُ ثَلَاثُ مِائَةٍ وَسِتُّونَ يَوْمًا وَالْيَوْمُ كَأَلْفِ سَنَةٍ";
ibnemaja.urdu = "حضرت انس بن مالک ؓ بیان کرتے ہیں کہ میں نے رسول اللہﷺ سے سنا،آپ فرمارہے تھے: اللہ کی راہ میں ایک رات پہرہ دینا گھر میں ایک ہزار سال تک روزے رکھنے اور قیام کرنے سے افضل ہے جب کہ ہر سال تین سوساٹھ دن کاہو اور ہر دن ہزار سال کے برابر ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع<br>سعید بن خالد: منکر الحدیث (تقریب: 2290) وقال الھیثمي: ضعفہ الجمھور (مجمع الزوائد 14/10) <br>وقال الحاکم: روی عن أنس بن مالک أحادیث موضوعۃ (المدخل إلی الصحیح ص 141)`;
ibnemaja.anwaar = [479,1];