var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ أُوصِيكَ بِتَقْوَى اللَّهِ وَالتَّكْبِيرِ عَلَى كُلِّ شَرَفٍ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے رسول اللہﷺ نے ایک آدمی سے فرمایا: میں تجھے اللہ سے ڈرنے کی اور ہر بلندجگہ تکبیر کہنے کی وصیت کرتا ہوں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;