var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَكَّارِ بْنِ عَبْدِ الْمَلِكِ بْنِ الْوَلِيدِ بْنِ بُسْرِ بْنِ أَبِي أَرْطَاةَ حَدَّثَنَا الْوَلِيدُ حَدَّثَنِي شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے کہ نبیﷺ نے فرمایا: جب تمہیں (جہاد کےلیے) نکلنے کو کہاجائے تو نکلا کرو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;