var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي جَوْفِ عَبْدٍ مُسْلِمٍ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے نبیﷺ نےفرمایا: کسی مسلمان کے اندر اللہ کی راہ میں اڑنے والا غبار اور جہنم کا دھواں (دونوں) جمع نہیں ہوسکتے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;