var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدِ بْنِ يَزِيدَ بْنِ إِبْرَاهِيمَ التُّسْتَرِيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ شَبِيبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَاحَ رَوْحَةً فِي سَبِيلِ اللَّهِ كَانَ لَهُ بِمِثْلِ مَا أَصَابَهُ مِنْ الْغُبَارِ مِسْكًا يَوْمَ الْقِيَامَةِ";
ibnemaja.urdu = "حضرت انس بن مالکؓ سےروایت ہے،رسول اللہﷺ نے فرمایا: جو ایک بار اللہ کی راہ میں نکلا،اسے جتنا گرد و غبار پہنچے گا قیامت کے دن اسے اتنی کستوری ملے گی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>شبیب بن بشر البجلي الکوفي ضعیف ضعفہ الجمہور`;
ibnemaja.anwaar = [479,1];