var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا بَقِيَّةُ عَنْ مُعَاوِيَةَ بْنِ يَحْيَى عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ عَنْ يَحْيَى بْنِ عَبَّادٍ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غَزْوَةٌ فِي الْبَحْرِ مِثْلُ عَشْرِ غَزَوَاتٍ فِي الْبَرِّ وَالَّذِي يَسْدَرُ فِي الْبَحْرِ كَالْمُتَشَحِّطِ فِي دَمِهِ فِي سَبِيلِ اللَّهِ سُبْحَانَهُ";
ibnemaja.urdu = "حضرت ابودرداء ؓ سے روایت ہے رسول اللہﷺ نے فرمایا: سمندر میں ایک جنگ کرنا خشکی میں دس جنگیں لڑنے کے برابر ہے۔اور جس شخص کا (سمندری سفر کی وجہ سے) سمندر میں سرچکراتا ہے وہ اللہ پاک کی راہ میں اپنے خون سے آلودہ ہو کر تڑپنے والے کی طرح ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>بقیۃ عنعن <br>ولیث ضعیف مدلس <br>ومعاویۃ بن یحیی: ضعیف`;
ibnemaja.anwaar = [479,1];