var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو دَاوُدَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْوَاسِطِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ح و حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ كُلُّهُمْ عَنْ قَيْسٍ عَنْ أَبِي حُصَيْنٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ لَمْ يَبْقَ مِنْ الدُّنْيَا إِلَّا يَوْمٌ لَطَوَّلَهُ اللَّهُ عَزَّ وَجَلَّ حَتَّى يَمْلِكَ رَجُلٌ مِنْ أَهْلِ بَيْتِي يَمْلِكُ جَبَلَ الدَّيْلَمِ وَالْقُسْطَنْطِينِيَّةَ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: اگر دنیا کا صرف ایک دن بھی باقی رہ جائے،تب بھی اللہ تعالی اس دن کو لمبا کر دے گا حتی کہ میرے گھروالوں (اہل بیت) میں سے آیک آدمی (مہدی) بادشاہ بنے گا۔وہ دیلم کے پہاڑ اور قسطنطینیہ کے شہر پر قبضہ کرے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قیس بن الربیع: ضعیف`;
ibnemaja.anwaar = [480,1];