var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَقِيمُوا وَلَنْ تُحْصُوا وَاعْلَمُوا أَنَّ مِنْ أَفْضَلِ أَعْمَالِكُمْ الصَّلَاةَ وَلَا يُحَافِظُ عَلَى الْوُضُوءِ إِلَّا مُؤْمِنٌ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’سیدھی راہ پر قائم رہو،اور تم (کما حقہ) قائم نہیں رہ سکو گے،اور تمہیں معلوم ہونا چاہیے کہ تمہارا افضل عمل نماز ہے اور وضو کی حفاظت مومن ہی کرتا ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;