var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي إِسْحَقُ بْنُ أَسِيدٍ عَنْ أَبِي حَفْصٍ الدِّمَشْقِيِّ عَنْ أَبِي أُمَامَةَ يَرْفَعُ الْحَدِيثَ قَالَ اسْتَقِيمُوا وَنِعِمَّا إِنْ اسْتَقَمْتُمْ وَخَيْرُ أَعْمَالِكُمْ الصَّلَاةُ وَلَا يُحَافِظُ عَلَى الْوُضُوءِ إِلَّا مُؤْمِنٌ";
ibnemaja.urdu = "سیدنا ابو امامہ رضی اللہ عنہ سے مرفوعاً روایت ہے،رسول اللہ ﷺ نے فرمایا:’’سیدھی راہ پر قائم رہو اور کتنا اچھا ہو اگر تم قائم رہ سکو،اور تمہارا بہترین عمل نماز ہے اور وضو کی حفاظت مومن ہی کرتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إسحاق بن أسید: فیہ ضعف و شیخہ أبو حفص الدمشقي: مجہول (تقریب: 342،8057) <br>والحدیث السابق (الأصل: 277) یغني عنہ`;
ibnemaja.anwaar = [386,1];