var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَلْمِ بْنِ عَبْدِ الرَّحْمَنِ النَّخَعِيِّ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ الشِّكَالَ مِنْ الْخَيْلِ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے کہ نبیﷺ کو وہ گھوڑا پسندنہ تھا جس کے تین پاؤں سفید ہوں اور ایک سفید نہ ہو۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;