var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عُمَيْرٍ عِيسَى بْنُ مُحَمَّدٍ الرَّمْلِيُّ حَدَّثَنَا أَحْمَدُ بْنُ يَزِيدَ بْنِ رَوْحٍ الدَّارِيُّ عَنْ مُحَمَّدِ بْنِ عُقْبَةَ الْقَاضِي عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ تَمِيمٍ الدَّارِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ ارْتَبَطَ فَرَسًا فِي سَبِيلِ اللَّهِ ثُمَّ عَالَجَ عَلَفَهُ بِيَدِهِ كَانَ لَهُ بِكُلِّ حَبَّةٍ حَسَنَةٌ";
ibnemaja.urdu = "حضرت تمیم داری ؓ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہﷺ سے سنا،آپ فرما رہے تھے: جس نے اللہ کی راہ میں (جہاد کے لیے) گھوڑا باندھ رکھا،پھر اپنے ہاتھ سے اس کا چارہ تیار کیا تو اسے ہردانے کے بدلے میں ایک نیکی ملے گی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>و قال البوصیري: ’’ ھذا إسناد ضعیف،محمد (بن عقبۃ القاضي) و أبوہ و جدہ مجہولون و الجد لم یسمّ ‘‘<br> و أحمد بن یزید مستور (تقریب: 128) و حدیث البخاري (2853) و أحمد (458/6) یغني عنہ`;
ibnemaja.anwaar = [480,1];