var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ آدَمَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى حَدَّثَنَا مَالِكُ بْنُ يُخَامِرَ حَدَّثَنَا مُعَاذُ بْنُ جَبَلٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ قَاتَلَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ مِنْ رَجُلٍ مُسْلِمٍ فُوَاقَ نَاقَةٍ وَجَبَتْ لَهُ الْجَنَّةُ";
ibnemaja.urdu = "حضرت معاذبن جبل ؓ سےر وایت ہے انہوں نے نبیﷺ سے یہ ارشاد سنا: جومسلمان مرد اللہ کی راہ میں اتنی دیر لڑائی کرے،جتنا اونٹنی کا دودھ دوبار دوہنے کے درمیان وقفہ ہوتا ہے اس کےلیے جنت واجب ہے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;