var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا حَجَّاجُ بْنُ دِينَارٍ عَنْ مُحَمَّدِ بْنِ ذَكْوَانَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَيُّ الْجِهَادِ أَفْضَلُ قَالَ مَنْ أُهَرِيقَ دَمُهُ وَعُقِرَ جَوَادُهُ";
ibnemaja.urdu = "حضرت عمرو بن عبسہؓ سے روایت ہے انہوں نے فرمایا: میں نے نبیﷺ کی خدمت میں حاضر ہوکر عرض کیا: اے اللہ کے رسول! کون سا جہاد افضل ہے؟ آپ نے فرمایا: جس کا خون بہادیا گیا اوراس کا گھوڑا بھی قتل ہوگیا(اس کا جہاد بہترین ہے۔)";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;