var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُ دَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْأَحْزَابِ فَقَالَ اللَّهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ اهْزِمْ الْأَحْزَابَ اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ";
ibnemaja.urdu = "حضرت عبداللہ بن ابی اوفیٰ ؓ سے روایت ہے کہ رسول اللہﷺ کی) جماعتوں کے خلاف دعا فرمائی۔اور فرمایا:« اللہم منزل الکتاب،سریع الحساب،اہزم الاحزاب،اللہم اہزمہم وزلزہم» ’ اے اللہ! اے کتاب نازل کرنے والے! اے جلد حساب لینے والے! جماعتوں کو شکست دےدے۔اے اللہ! انہیں شکست دے اور انہیں لڑکھڑا دے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;