var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى وَأَحْمَدُ بْنُ عِيسَى الْمِصْرِيَّانِ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي أَبُو شُرَيْحٍ عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ أَنَّ سَهْلَ بْنَ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ مِنْ قَلْبِهِ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ";
ibnemaja.urdu = "حضرت سہل بن حنیف ؓ سے روایت ہے رسول اللہﷺ نے فرمایا: جوشخص اللہ تعالی سے سچے دل سے شہادت کی دعا کرتا ہے تو اللہ تعالی اسے شہیدوں کے درجات تک پہنچا دیتا ہے خواہ وہ اپنے بستر ہی پر فوت ہو۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;