var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ وَبِشْرُ بْنُ آدَمَ قَالُوا حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى أَنْبَأَنَا مُحَمَّدُ بْنُ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَجِدُ الشَّهِيدُ مِنْ الْقَتْلِ إِلَّا كَمَا يَجِدُ أَحَدُكُمْ مِنْ الْقَرْصَةِ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے رسول اللہﷺ نے فرمایا: شہید کو قتل ہوتے وقت صرف اتنی تکلیف ہوتی ہے جتنی کسی کو چیونٹی کے کاٹنے سے ہوتی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1668) نسائي (3163)`;
ibnemaja.anwaar = [480,1];