var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ الْقُرَشِيِّ عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَمَى الْعَدُوَّ بِسَهْمٍ فَبَلَغَ سَهْمُهُ الْعَدُوَّ أَصَابَ أَوْ أَخْطَأَ فَعَدْلُ رَقَبَةٍ";
ibnemaja.urdu = "حضرت عمرو بن عبسہ﷜ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہﷺ سے سنا،آپ فرمار ہے تھے: جو شخص دشمن کی طرف ایک تیر پھینکے اور وہ دشمن تک پہنچ جائے،خواہ دشمن کو لگے یا نہ لگے وہ ایک غلام آزاد کرنے کے برابر ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;