var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّ أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَى الْمِنْبَرِ وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ أَلَا وَإِنَّ الْقُوَّةَ الرَّمْيُ ثَلَاثَ مَرَّاتٍ";
ibnemaja.urdu = "حضرت عقبہ بن عامرجہنی ؓ سےر وایت ہے کہ میں رسول اللہﷺ کو منبر پر یہ آیت تلاوت کرتے سنا:﴿وَأَعِدّوا لَہُم مَا استَطَعتُم مِن قُوَّۃٍ﴾دشمن کے مقابلے کے لیے جتنی ہوسکے طاقت تیار رکھو۔پھر تین بار فرمایا: ’ خبردار! طاقت سے مرادتیر اندازی ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;