var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَهُ بْنُ يَحْيَى الْمِصْرِيُّ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابنُ لَهِيعَةَ عَنْ عُثْمَانَ بْنِ نُعَيْمٍ الرُّعَيْنِيِّ عَنْ الْمُغِيرَةِ بْنِ نَهِيكٍ أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَعَلَّمَ الرَّمْيَ ثُمَّ تَرَكَهُ فَقَدْ عَصَانِي";
ibnemaja.urdu = "حضرت عقبہ بن عامر جہنی ؓ سےر وایت ہے کہ میں نے رسول اللہﷺ سے سنا،آپ فرمارہے تھے: جس نے تیراندازی سیکھی،پھر چھوڑ دی اس نے میری نافرمانی کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عثمان بن نعیم الرعیني والمغیرۃ بن نھیک مجھولان (تقریب: 4523،6853) <br>و حدیث مسلم (1919) یغني عنہ`;
ibnemaja.anwaar = [480,1];