var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ زِيَادِ بْنِ الْحُصَيْنِ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَ مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَفَرٍ يَرْمُونَ فَقَالَ رَمْيًا بَنِي إِسْمَعِيلَ فَإِنَّ أَبَاكُمْ كَانَ رَامِيًا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے انہوں نے فرمایا: نبیﷺ کچھ افراد کے پاس سے گزرے جو تیر اندازی کررہے تھے۔آپ نے فرمایا: ’ اسماعیل کے بیٹو! تیرچلاؤ،تمہارے جدامجد بھی تیرانداز تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;