var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ الْحَارِثِ بْنِ حَسَّانَ قَالَ قَدِمْتُ الْمَدِينَةَ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمًا عَلَى الْمِنْبَرِ وَبِلَالٌ قَائِمٌ بَيْنَ يَدَيْهِ مُتَقَلِّدٌ سَيْفًا وَإِذَا رَايَةٌ سَوْدَاءُ فَقُلْتُ مَنْ هَذَا قَالُوا هَذَا عَمْرُو بْنُ الْعَاصِ قَدِمَ مِنْ غَزَاةٍ";
ibnemaja.urdu = "حضرت حارث بن حسان ؓ سے روایت ہے،انہوں نے فرمایا: میں مدینے آیاتو میں نے دیکھا کہ نبیﷺمنبر پر کھڑے ہیں اور حضرت بلال ﷜ گلے میں تلوار لٹکائے رسول اللہﷺ کے سامنے کھڑے ہیں۔مجھے ایک سیاہ جھنڈا نظرآیا۔میں نے کہا: یہ کون ہے؟ لوگوں نے بتایا: یہ حضرت عمرو بن عاص ؓ ہیں،جہاد سے آئے ہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;