var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَعَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا شَرِيكٌ عَنْ عَمَّارٍ الدُّهْنِيِّ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ يَوْمَ الْفَتْحِ وَلِوَاؤُهُ أَبْيَضُ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ ؓ سے روایت ہے کہ نبیﷺ فتح مکہ کے دن مکہ مکرمہ میں داخل ہوئے تو آپ کا جھنڈا سفید تھا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;