var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ حَجَّاجٍ عَنْ أَبِي عُمَرَ مَوْلَى أَسْمَاءَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّهَا أَخْرَجَتْ جُبَّةً مُزَرَّرَةً بِالدِّيبَاجِ فَقَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُ هَذِهِ إِذَا لَقِيَ الْعَدُوَّ";
ibnemaja.urdu = "حضرت اسماء بنت ابی بکرؓ سے روایت ہے انہوں نے ریشم کے بٹنوں والا ایک جبہ نکالا اور فرمایا: رسول اللہﷺ یہ لباس اس وقت پہنتے تھے جب (جنگ میں) دشمن کے مقابل ہوتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حجاج بن أرطاۃ ضعیف مدلس و عنعن <br>وأصل الحدیث في صحیح مسلم (2069) وغیرہ بدون ’’إذا لقي العدو‘‘ و انظر الحدیث الآتي (الأصل: 3594)`;
ibnemaja.anwaar = [480,2];