var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي عُثْمَانَ عَنْ عُمَرَ أَنَّهُ كَانَ يَنْهَى عَنْ الْحَرِيرِ وَالدِّيبَاجِ إِلَّا مَا كَانَ هَكَذَا ثُمَّ أَشَارَ بِإِصْبَعِهِ ثُمَّ الثَّانِيَةِ ثُمَّ الثَّالِثَةِ ثُمَّ الرَّابِعَةِ وَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَانَا عَنْهُ";
ibnemaja.urdu = "حضرت عمر ؓ سےر وایت ہے کہ وہ باریک ریشم اور موٹے ریشم سے منع فرماتے تھے مگر جو اتنا سا ہو،اسے جائز فرماتے تھے۔یہ کہتے ہوئے راوی(ابوعثمان ؓ) نے ایک انگلی سے اشارہ کیا،پھر دوسری انگلی سے،پھر تیسری انگلی سے پھر چوتھی انگلی سے۔حضرت عمر﷜ نے فرمایا: رسول اللہﷺ ہمیں اس سے منع فرماتےتھے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;