var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُسَاوِرٍ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ قَالَ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَيْهَا بَيْنَ كَتِفَيْهِ";
ibnemaja.urdu = "حضرت عمرو بن حریث ؓ سےروایت ہے انہوں نے فرمایا: (وہ منظر اب بھی میرے تصور میں ہے) گویا میں رسول اللہﷺ کو دیکھ رہا ہوں کہ آپ نے سیاہ عمامہ پہن رکھا ہے اور اس کے دونوں کنارے (پست کی طرف) دونوں کندھوں کے درمیان لٹک رہے ہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;