var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا أَبُو الْأَسْوَدِ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ زَبَّانَ بْنِ فَائِدٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ أُشَيِّعَ مُجَاهِدًا فِي سَبِيلِ اللَّهِ فَأَكُفَّهُ عَلَى رَحْلِهِ غَدْوَةً أَوْ رَوْحَةً أَحَبُّ إِلَيَّ مِنْ الدُّنْيَا وَمَا فِيهَا";
ibnemaja.urdu = "حضرت معاذ بن انس ؓ سےروایت ہے رسول اللہﷺ نے فرمایا: مجھے یہ بات دنیا ومافیہا سے زیادہ محبوب ہے کہ ایک صبح یا ایک شام اللہ کی راہ میں جہاد کرنے والے کو الوداع کروں اور اس کے سامان کی دیکھ بھال کروں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>زبان: ضعیف (د 1287)`;
ibnemaja.anwaar = [481,1];