var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ الْحَسَنِ بْنِ ثَوْبَانَ عَنْ مُوسَى بْنِ وَرْدَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ وَدَّعَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَسْتَوْدِعُكَ اللَّهَ الَّذِي لَا تَضِيعُ وَدَائِعُهُ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سےروایت ہے انہوں نے کہا: رسول اللہﷺ نے مجھے رخصت کرتےوقت فرمایا:«استودعک اللہ الذی لا تضیع وادئعہ» میں تجھے اللہ کے سپرد کرتا ہوں جس کے سپرد کی ہوئی چیزیں ضائع نہیں ہوتیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;