var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبَّادُ بْنُ الْوَلِيدِ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ حَدَّثَنَا أَبُو مِحْصَنٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَشْخَصَ السَّرَايَا يَقُولُ لِلشَّاخِصِ أَسْتَوْدِعُ اللَّهَ دِينَكَ وَأَمَانَتَكَ وَخَوَاتِيمَ عَمَلِكَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمررضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ جب لشکر روانہ فرماتے تھے تو روانہ ہونے والے سے فرماتے: «استودع اللہ دینک وامانتک وخواتیم عملک»’میں تیرا دین،تیری امانت اور تیرے کام کے انجام کو اللہ کی حفاظت میں دیتا ہوں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;