var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ كُنَّا نَتَحَدَّثُ أَنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا يَوْمَ بَدْرٍ ثَلَاثَ مِائَةٍ وَبِضْعَةَ عَشَرَ عَلَى عِدَّةِ أَصْحَابِ طَالُوتَ مَنْ جَازَ مَعَهُ النَّهَرَ وَمَا جَازَ مَعَهُ إِلَّا مُؤْمِنٌ";
ibnemaja.urdu = "حضرت براء بن عازب ؓ سےروایت ہے انہوں نے فرمایا: ہم لوگ باتیں کیا کرتے تھے کہ جنگ بدر میں رسول اللہﷺ کے ساتھی تین سودس سے کچھ زیادہ تھے جتنی تعداد طالوت کےساتھ نہر پار کرنے والوں کی تھی۔ان کے ساتھ صرف ایمان رکھنے والےنہرسےپار پہنچے تھے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;