var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ ابْنِ لَهِيعَةَ أَخْبَرَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ لَهِيعَةَ بْنِ عُقْبَةَ قَالَ سَمِعْتُ أَبَا الْوَرْدِ صَاحِبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِيَّاكُمْ وَالسَّرِيَّةَ الَّتِي إِنْ لَقِيَتْ فَرَّتْ وَإِنْ غَنِمَتْ غَلَّتْ";
ibnemaja.urdu = "حضرت ابوورد ؓ سےروایت ہےانہوں نے فرمایا: ایسا لشکر مت بنو جو جنگ کا موقع آئے تو(میدان چھوڑ کر) بھاگ جائے اور اگر اسے غنیمت ملے تو خیانت کرے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br> لہیعۃبن عقبۃ مستور (تقریب: 5682) وقال البوصیري: ’’ ھذا إسناد ضعیف موقوف‘‘`;
ibnemaja.anwaar = [481,1];