var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ نِيَارٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا لَا نَسْتَعِينُ بِمُشْرِكٍ قَالَ عَلِيٌّ فِي حَدِيثِهِ عَبْدُ اللَّهِ بْنُ يَزِيدَ أَوْ زَيْدٍ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہےرسول اللہﷺ نے فرمایا: ہم مشرک سے مدد نہیں لیتے۔\n(امام ابن ماجہ کے استاذ) علی بن محمد نے اپنی حدیث میں راوی کےبارے میں تردد کا اظہار کیا ہے کہ وہ عبداللہ بن یزید ہے یا عبداللہ بن زید ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;