var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَبُو الْعُمَيْسِ وَعِكْرِمَةُ بْنُ عَمَّارٍ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ بَارَزْتُ رَجُلًا فَقَتَلْتُهُ فَنَفَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَبَهُ";
ibnemaja.urdu = "حضرت سلمہ بن اکوعؓ سے روایت ہے انھوں نے فرمایا:میں نے ایک آدمی کا مقابلہ کیا اور اسے قتل کردیا تو نبی ﷺ نے اس کا سامان مجھے دلوایا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;