var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ عَنْ ابْنِ سَمُرَةَ بْنِ جُنْدَبٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ فَلَهُ السَّلَبُ";
ibnemaja.urdu = "حضرت سمرہ بن جندب ؓ سے روایت ہےرسول اللہ ﷺنے فرمایا:جوشخص (جنگ میں کسی کافر کو)قتل کرے تواس (مقتول) کا ذاتی سامان اس(قاتل) کا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;