var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ حَدَّثَنَا الصَّعْبُ بْنُ جَثَّامَةَ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَهْلِ الدَّارِ مِنْ الْمُشْرِكِينَ يُبَيَّتُونَ فَيُصَابُ النِّسَاءُ وَالصِّبْيَانُ قَالَ هُمْ مِنْهُمْ";
ibnemaja.urdu = "صعب بن جثاثہؓ سے روایت ہےنبیﷺ سوال کیا گیااگر مشرکین کی بستی پر شب خون مارا جائےاور اس دوران عورتوں اور بچوں کو نقصان پہنچے(وہ زخمی یا قتل ہوجائیں تو کیا حکم ہے؟)";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;