var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ سَمُرَةَ حَدَّثَنَا وَكِيعٌ عَنْ صَالِحِ بْنِ أَبِي الْأَخْضَرِ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى قَرْيَةٍ يُقَالُ لَهَا أُبْنَى فَقَالَ ائْتِ أُبْنَى صَبَاحًا ثُمَّ حَرِّقْ";
ibnemaja.urdu = "حضرت اسامہ بن زیدؓ سے روایت ہے انھوں نے کہا:رسول اللہﷺ نے مجھے ابنیٰ نامی بستی کی طرف بھیجاتو فرمایا: صبح کے وقت ابنیٰ جاؤ اسے نذر آتش کر دو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2616)`;
ibnemaja.anwaar = [481,1];