var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّقَ نَخْلَ بَنِي النَّضِيرِ وَقَطَعَ وَفِيهِ يَقُولُ شَاعِرُهُمْ فَهَانَ عَلَى سَرَاةِ بَنِي لُؤَيٍّ حَرِيقٌ بِالْبُوَيْرَةِ مُسْتَطِيرُ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے کہ بنی ﷺ نےبنو نضیر کے کھجوروں کے درخت جلائے اور کاٹے اور اسی کے بارے میں شاعر نے کہا:\nبنولؤی (قریش) کے سرداروں کےگیا کہ بویرہ میں ہر طرف پھیلی ہوئی آگ لگی ہو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;