var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ الزُّرَقِيِّ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ مَكْحُولٍ عَنْ أَبِي سَلَّامٍ الْأَعْرَجِ عَنْ أَبِي أُمَامَةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَّلَ فِي الْبَدْأَةِ الرُّبُعَ وَفِي الرَّجْعَةِ الثُّلُثَ";
ibnemaja.urdu = "حضرت عبادہ بن صامت ؓ سے روایت ہے کہ نبیﷺ نے شروع میں چوتھا حصہ اور واپسی میں تیسرا حصہ بطور انعام دیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;