var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْهَمَ يَوْمَ خَيْبَرَ لِلْفَارِسِ ثَلَاثَةَ أَسْهُمٍ لِلْفَرَسِ سَهْمَانِ وَلِلرَّجُلِ سَهْمٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے کہ نبی ﷺ نے غزوہ خیبر کے موقع پر سوار کو تین حصے عطا فرمائے دو حصے گھوڑے کا ایک حصہ آدمی کا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;