var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ هِشَامٍ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ الْأَنْصَارِيَّةِ قَالَتْ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍ أَخْلُفُهُمْ فِي رِحَالِهِمْ وَأَصْنَعُ لَهُمْ الطَّعَامَ وَأُدَاوِي الْجَرْحَى وَأَقُومُ عَلَى الْمَرْضَى";
ibnemaja.urdu = "حضرت ام عطیہ انصاریہؓ سے روایت ہے انھوں نے فرمایا:رسول اللہ ﷺ کی معیت میں سات جنگوں میں حصہ لیا۔(صحابہ کے جنگ کے چلے جانے پر)میں خیموں میں رہتی (سامان کی حفاظت کرتی)ان کے لیے کھانا تیار کرتی زخمیو ں کا علاج کرتی اور بیماروں کا دیکھ بھال کرتی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;