var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ وَمَنْ أَطَاعَ الْإِمَامَ فَقَدْ أَطَاعَنِي وَمَنْ عَصَى الْإِمَامَ فَقَدْ عَصَانِي";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہےرسول اللہ ﷺ فرمایا:جس نےمیر ی اطاعت کی اس نے اللہ کی اطاعت کی۔اور جس نے میری نافرمانی کی اس نے اللہ کی نافرمانی کی۔جس نے امام کی اطا عت کی اس نے میری اطا عت کی۔جس نے امام کی نافرمانی کی اس نے میری نافرمانی کی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;