var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَأَبِي عَنْ الْأَعْمَشِ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ وَحُصَيْنٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ يَتَهَجَّدُ يَشُوصُ فَاهُ بِالسِّوَاكِ";
ibnemaja.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جب رات کو نماز تہجد کے لیے بیدار ہوتے تھے تو مسواک کے ساتھ اپنا منہ صاف کرتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;