var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي أَبُو التَّيَّاحِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمَعُوا وَأَطِيعُوا وَإِنْ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ كَأَنَّ رَأْسَهُ زَبِيبَةٌ";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہےرسول اللہﷺ نے فرمایا:سنو اوراطاعت کرو اگرچے تم پرایک حبشی غلام کو حاکم بنادیا جائے جس کا سر متقے جیسا ہو۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;