var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ عَنْ شُعْبَةَ عَنْ يَحْيَى بْنِ الْحُصَيْنِ عَنْ جَدَّتِهِ أُمِّ الْحُصَيْنِ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ مُجَدَّعٌ فَاسْمَعُوا لَهُ وَأَطِيعُوا مَا قَادَكُمْ بِكِتَابِ اللَّهِ";
ibnemaja.urdu = "حضرت ام حصین (بنت اسحاق) ؓ سےروایت ہے انھوں نےفرمایا:میں نے رسول اللہ ﷺ سے سناآپ فرمارہے تھے:اگر تم پر ایک ناک کان کٹا حبشی غلام بھی امیر مقرر کیا جائےتو اس کی بات سنواور تسلیم کرو جب تک تمھیں اللہ کی کتاب کے مطابق لے کرچلے-";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;