var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ عَنْ عَتَّابٍ مَوْلَى هُرْمُزَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ بَايَعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ فَقَالَ فِيمَا اسْتَطَعْتُمْ";
ibnemaja.urdu = "حضرت انس بن مالک ؓسے رویت ہے انھوں نےفرمایاہم نے سمع وطاعت (حکم کوتوجہ سے سن کرپوری طرح اطاعت کرنے)پررسوال اللہ ﷺ بیعت کی۔رسول اللہ ﷺ نے فرمایا تم سے جس قدر ممکن ہو۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;