var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْصَبُ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ فَيُقَالُ هَذِهِ غَدْرَةُ فُلَانٍ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود ؓ سے روایت ہے رسول اللہﷺ نے فرمایا:ہر عہد شکن کے لیے قیامت کےدن جھنڈا نصب کیا جائےگا اور کہا جائے گا یہ فلاں کی عہد شکنی ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;