var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ أَنْبَأَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا إِنَّهُ يُنْصَبُ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ بِقَدْرِ غَدْرَتِهِ";
ibnemaja.urdu = "حضرت ابوسعید خدری ؓ سے روایت ہےرسول اللہ ﷺنےفرمایا: قیامت کے دن ہر عہدشکن کےلیے اس کی عہد شکنی کے مطابق جھنڈا نصب کیا جائے گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;