var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ الْمُنْكَدِرِ قَالَ سَمِعْتُ أُمَيْمَةَ بِنْتَ رُقَيْقَةَ تَقُولُ جِئْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ نُبَايِعُهُ فَقَالَ لَنَا فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ إِنِّي لَا أُصَافِحُ النِّسَاءَ";
ibnemaja.urdu = "حضرت امیمہ بنت رقیقہ ؓ سے روایت ہےانھوں نے کہا:میں کچھ خواتین کے ساتھ بیعت کرنے کےلیے نبیﷺ خدمت میں حاضر ہوئی توآپ ﷺنےہمیں فرمایا:جن کاموں کی تمھیں استطاعت اورطاقت ہو(ان میں میرے حکم کی تعمیل ضروری ہے۔)میں عورتوں سے مصافحہ نہیں کرتا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;