var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا سُفْيَانُ بْنُ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْخَلَ فَرَسًا بَيْنَ فَرَسَيْنِ وَهُوَ لَا يَأْمَنُ أَنْ يَسْبِقَ فَلَيْسَ بِقِمَارٍ وَمَنْ أَدْخَلَ فَرَسًا بَيْنَ فَرَسَيْنِ وَهُوَ يَأْمَنُ أَنْ يَسْبِقَ فَهُوَ قِمَارٌ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے رسول اللہﷺ نے فرمایا جس نے دو گھوڑوں(کی دوڑ)میں گھوڑا شامل کیااور اس کو یقین نہیں وہ آگے بڑھ جائے گاتویہ(عمل)جوا نہیں۔اور جس نےدوگھوڑوں میں گھوڑا شامل کیا اور اسے یقین ہے کہ وہ آگے بڑھ جائے گا تویہ جوا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2579)`;
ibnemaja.anwaar = [481,1];