var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ ضَمَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَيْلَ فَكَانَ يُرْسِلُ الَّتِي ضُمِّرَتْ مِنْ الْحَفْيَاءِ إِلَى ثَنِيَّةِ الْوَدَاعِ وَالَّتِي لَمْ تُضَمَّرْ مِنْ ثَنِيَّةِ الْوَدَاعِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہےانھوں نے فرمایا:رسول اللہ ﷺنے گھوڑوں کی تضمیر کی-آب تضمیر شدہ گھوڑوں کو حفیاءسے ثنیۃ الوداع تک دوڑاتےتھے۔اور غیر تضمیرشدہ گھوڑوں کوثنیۃ الوداع سے مسجد بنی زریق تک۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;