var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَأَبُو عُمَرَ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ مَخَافَةَ أَنْ يَنَالَهُ الْعَدُوُّ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے کہ رسول اللہ ﷺنے فرمایا دشمن کے علاقے میں قرآن لے کر سفر کرنے سے منع فرمایااس خطرےسے کہ وہ دشمن ہاتھ میں آجائے گا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;