var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَنْهَى أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ مَخَافَةَ أَنْ يَنَالَهُ الْعَدُوُّ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ نے رسول اللہ ﷺسےروایت کیا ہےآپ دشمن کے علاقے میں قرآن لے کر سفر کرنے سے منع فرماتےاس خطرےسے کہ وہ دشمن ہاتھ میں آجائےگا";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;