var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْمَعِيلُ أَبُو إِسْرَائِيلَ عَنْ فُضَيْلِ بْنِ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ أَوْ أَحَدِهِمَا عَنْ الْآخَرِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَرَادَ الْحَجَّ فَلْيَتَعَجَّلْ فَإِنَّهُ قَدْ يَمْرَضُ الْمَرِيضُ وَتَضِلُّ الضَّالَّةُ وَتَعْرِضُ الْحَاجَةُ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس یاحضرت فضل بن عباس ؓ سے روایت ہےرسول اللہ ﷺنے فرمایا:جو شخص حج کا ارادہ رکھتاہواسے چاہیے کہ جلدی کرے کیونکہ ممکن ہےآدمی بیمار ہوجائےیا اس کی سواری گم ہوجائے یا کوئی اورضرورت پیش آجائے۔(جس کی وجہ سے وہ حج نہ کر سکے)۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;