var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا سُفْيَانُ بْنُ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سِنَانٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ الْأَقْرَعَ بْنَ حَابِسٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ الْحَجُّ فِي كُلِّ سَنَةٍ أَوْ مَرَّةً وَاحِدَةً قَالَ بَلْ مَرَّةً وَاحِدَةً فَمَنْ اسْتَطَاعَ فَتَطَوَّعَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے کہ حضرت اقرع بن حابس ﷜ نے نبی ﷺ سے سوال کیا اور کہا: اے اللہ کے رسول: کیا حج ہر سال(ادا رنا فرض) ہےیا(زندگی میں)ایک ہی بار؟رسول اللہ ﷺ فرمایا:بلکہ ایک ہی بار(فرض ہے)پھر جسے طاقت ہو تو وہ نفلی حج ادا کرلے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;