var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةُ مَا بَيْنَهُمَا وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلَّا الْجَنَّةُ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے نبیﷺ نےفرمایا:ایک عمرے کےبعددوسرا عمرادونوں کی درمیانی مدت کے گناہ کفارہ ہوجاتا ہے۔اور حج مبرور(نیکیوں والے حج) کا بدلہ محض جنت ہے";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;