var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ وَسُفْيَانُ عَنْ مَنْصُورٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَجَّ هَذَا الْبَيْتَ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَمَا وَلَدَتْهُ أُمُّهُ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے رسول اللہﷺ نےفرمایا:جوشخص اس گھر(کعبہ شریف) کاحج کرے اور(حج کےدوران میں)بے ہودہ گوئی نہ کرے اورگناہ نہ کرےوہ واپس آتا ہے اس طرح(گناہوں سے پاک) ہوتا ہے جیسے وہ اپنی ماں سے پیدا ہوتے وقت تھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;