var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الرَّبِيعِ بْنِ صَبِيحٍ عَنْ يَزِيدَ بْنِ أَبَانَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ حَجَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَحْلٍ رَثٍّ وَقَطِيفَةٍ تُسَاوِي أَرْبَعَةَ دَرَاهِمَ أَوْ لَا تُسَاوِي ثُمَّ قَالَ اللَّهُمَّ حَجَّةٌ لَا رِيَاءَ فِيهَا وَلَا سُمْعَةَ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:نبیﷺ نے ایک کجاوے پر اور ایک ایسی (معمولی)چادر اوڑھ کر حج ادا کیا جس کی قیمت چار درھم کے برابر بھی نہ تھی۔اور فرمایا:’’حج(کے فرض کی ادئیگی مقصود)ہے‘دکھلاوا اور شہرت گ(مقصود)نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>یزید بن أبان الرقاشي ضعیف <br>ولہ شاھد ضعیف عند ابن خزیمۃ (2836) <br>وللحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [482,1];