var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ بْنِ صَالِحٍ مَوْلَى بَنِي عَامِرٍ حَدَّثَنِي يَعْقُوبُ بْنُ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ الْحُجَّاجُ وَالْعُمَّارُ وَفْدُ اللَّهِ إِنْ دَعَوْهُ أَجَابَهُمْ وَإِنْ اسْتَغْفَرُوهُ غَفَرَ لَهُمْ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’حج اور عمرہ کرنے والے اللہ تعالیٰ کے ملاقاتی (اور مہمان) ہیں۔اگر وہ اللہ سے دعا کریں تو اللہ ان کی دعا قبول کرتا ہے اور اگر وہ بخشش مانگیں تو انھیں بخش دیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>صالح بن عبد اللّٰہ بن صالح: منکر الحدیث،قالہ البخاري (التاریخ الکبیر 285/4)`;
ibnemaja.anwaar = [482,1];