var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا عِمْرَانُ بْنُ عُيَيْنَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغَازِي فِي سَبِيلِ اللَّهِ وَالْحَاجُّ وَالْمُعْتَمِرُ وَفْدُ اللَّهِ دَعَاهُمْ فَأَجَابُوهُ وَسَأَلُوهُ فَأَعْطَاهُمْ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے‘نبیﷺ نے فرمایا:’’اللہ کی راہ میں جنگ کرنے والا(مجاہد)‘حاجی اور عمرہ کرنے والا اللہ کے مہمان ہیں۔اس نے انھیں بلایا تو انھوں نے تعمیل کی۔انہوں نے اللہ سے مانگا تو اللہ نے دے دیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عطاء بن السائب اختلط وحدیث النسائي (5/ 113 ح 2626،6/ 16ح 3123) یغني عنہ`;
ibnemaja.anwaar = [482,1];