var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ أَنَّهُ اسْتَأْذَنَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعُمْرَةِ فَأَذِنَ لَهُ وَقَالَ لَهُ يَا أُخَيَّ أَشْرِكْنَا فِي شَيْءٍ مِنْ دُعَائِكَ وَلَا تَنْسَنَا";
ibnemaja.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے کہ انھوں نے نبیﷺ سے عمرہ کرنے کی اجازت چاہی تو نبیﷺ نے اجازت دے دی ‘اور فرمایا:’’بھائی!اپنی کسی دعا میں ہمیں بھی شریک کر لینا اور (دعامیں)ہمیں نہ بھلانا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1498) ترمذي (3562)`;
ibnemaja.anwaar = [482,1];