var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ الْقُرَشِيُّ عَنْ ابْنِ جُرَيْجٍ قَالَ وَأَخْبَرَنِيهِ أَيْضًا عَنْ ابْنِ عَطَاءٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الزَّادُ وَالرَّاحِلَةُ يَعْنِي قَوْلَهُ مَنْ اسْتَطَاعَ إِلَيْهِ سَبِيلًا(آل عمران:97)";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اللہ تعالیٰ کے فرمانمَنِ اسْتَطَاعَ إِلَیْہِ سَبِیلًا’’جس کو بیت اللہ تک راستہ طے کرنے کی طاقت ہو۔‘‘کی وضاحت میں فرمایا: (اس طاقت سے مراد ہے)’’سفر خرچ اور سواری۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عمر بن عطاء بن وراز: ضعیف <br>ہشام بن سلیمان: مقبول (تقریب: 7296) أي مجہول الحال و سویدبن سعید: ضعیف <br>وللحدیث طریق موقوف عند البیہقي (331/4) وسندہ ضعیف`;
ibnemaja.anwaar = [482,2];