var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُسَافِرُ الْمَرْأَةُ سَفَرًا ثَلَاثَةَ أَيَّامٍ فَصَاعِدًا إِلَّا مَعَ أَبِيهَا أَوْ أَخِيهَا أَوْ ابْنِهَا أَوْ زَوْجِهَا أَوْ ذِي مَحْرَمٍ";
ibnemaja.urdu = "حضرت ابو سعید خدری رضی االلہ عنہ سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’کوئی عورت تین دن یا زیادہ کا سفر نہ کرے مگر اپنے باپ ‘بھائی‘بیٹے ‘خاوند یا کسی اور محرم کی معیت میں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;