var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُسَافِرَ مَسِيرَةَ يَوْمٍ وَاحِدٍ لَيْسَ لَهَا ذُو حُرْمَةٍ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے‘نبی ﷺ نے فرمایا:’’جو عورت اللہ اور قیامت کے دن پر ایمان رکھتی ہے اس کے لیے ایک دن کا سفر کرنا حلال نہیں جب کہ اس کے ساتھ محرم نہ ہو‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;