var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَ صَحِبْتُ سَعْدَ بْنَ مَالِكٍ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَمَا سَمِعْتُهُ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحَدِيثٍ وَاحِدٍ";
ibnemaja.urdu = "حضرت سائب بن یزید رحمہ اللہ سے روایت ہے انہوں نے فرمایا: میں مدینہ منورہ سے مکہ مکرمہ تک حضرت سعد بن مالک رضی اللہ عنہ کا ہم سفر رہا۔(پورے سفر میں) میں نے آپ کو نبی ﷺ سے ایک حدیث بھی روایت کرتے نہیں سنا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;