var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ الْمِقْدَامِ بْنِ شُرَيْحِ بْنِ هَانِئٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَ قُلْتُ أَخْبِرِينِي بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْدَأُ إِذَا دَخَلَ عَلَيْكِ قَالَتْ كَانَ إِذَا دَخَلَ يَبْدَأُ بِالسِّوَاكِ";
ibnemaja.urdu = "سیدنا شریح بن ہانی رحمہ اللہ سے روایت ہے،انہوں نے سیدہ عائشہ رضی اللہ عنہا سے عرض کیا: مجھے یہ بتایئے کہ رسول ﷺ جب(باہر سے) آپ کے پاس آتے تو سب سے پہلے کیا کرتے تھے؟ ام المؤمنین رضی اللہ عنہا نے فرمایا: نبی ﷺ جب گھر میں تشریف لاتے تو سب سے پہلے مسواک کرتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;