var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَقَ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ أَبَا مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي اكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا وَامْرَأَتِي حَاجَّةٌ قَالَ فَارْجِعْ مَعَهَا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے‘ انھوں نے فرمایا: ایک اعرابی نبی ﷺ کی خدمت میں حاضر ہوا اور عرض کیا: میرا نام فلاں فلاں غزوے میں لکھا گیا ہے اور میری عورت حج کے لیے روانہ ہو چکی ہے۔آپﷺ نے فرمایا:’’اس کے ساتھ چلا جا۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;