var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ عَلَى النِّسَاءِ جِهَادٌ قَالَ نَعَمْ عَلَيْهِنَّ جِهَادٌ لَا قِتَالَ فِيهِ الْحَجُّ وَالْعُمْرَةُ";
ibnemaja.urdu = "حضر ت عائشہ رضی اللہ عنہا سے روایت ہے‘ انھوں نے فرمایا:میں نے کہا:اے اللہ کے رسول!عورتوں پر جہاد فرض ہے؟ رسول اللہ ﷺ نے فرمایا:’’ہاں!ا ن پر ایسا جہاد فرض ہے جس میں جنگ نہیں ہوتی۔وہ حج اور عمرہ ہے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;