var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ ابْنِ عَبَّاسٍ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحُجُّ عَنْ أَبِي قَالَ نَعَمْ حُجَّ عَنْ أَبِيكَ فَإِنْ لَمْ تَزِدْهُ خَيْرًا لَمْ تَزِدْهُ شَرًّا";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ سے روایت ہے کہ ایک آدمی نےنبیﷺ کی خدمت میں حاضر ہو کر عرض کیا:کیا میں اپنے والد کی طرف سے حج کر سکتا ہوں؟نبیﷺ نے فرمایا:’’ہاں‘اپنے والد کی طرف سے حج کر۔اگر تو اس کے لیے بھلائی میں اضافہ نہیں کرے گا تو برائی میں بھی اضافہ نہیں کرے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سفیان الثوري عنعن`;
ibnemaja.anwaar = [483,1];