var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ النُّعْمَانِ بْنِ سَالِمٍ عَنْ عَمْرِو بْنِ أَوْسٍ عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ الْحَجَّ وَلَا الْعُمْرَةَ وَلَا الظَّعْنَ قَالَ حُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ";
ibnemaja.urdu = "حضرت ابو زرین عقیلی رضی اللہ عنہ سے روایت ہے ‘انھوں نے نبیﷺ کی خدمت میں حاضر ہو کر عرض کیا:اے اللہ کے رسول!میرے والد بہت بوڑھے ہیں‘نہ حج اور عمر ہ ادا کر سکتے ہیں اور نہ سواری پر سوار ہو سکتے ہیں۔آپ نے فرمایا:’’اپنے والد کی طرف سے حجو عمرہ کرو۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;