var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ حَدَّثَنَا مُحَمَّدُ بْنُ كُرَيْبٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ أَخْبَرَنِي حُصَيْنُ بْنُ عَوْفٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبِي أَدْرَكَهُ الْحَجُّ وَلَا يَسْتَطِيعُ أَنْ يَحُجَّ إِلَّا مُعْتَرِضًا فَصَمَتَ سَاعَةً ثُمَّ قَالَ حُجَّ عَنْ أَبِيكَ";
ibnemaja.urdu = "حضرت حصین بن عوف رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:میں نے کہا:اے اللہ کے رسول!میرے والد پر حج فرض ہو گیا ہے۔وہ حج نہیں کر سکتے سوائے اس کے کہ انھیں سواری پر باندھ دیا جائے۔نبیﷺ کچھ دیر خاموش رہے‘پھر فرمایا:’’اپنے والد کی طرف سے حج کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>محمد بن کریب:ضعیف (تقریب: 6256) <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [483,1];