var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا بَحْرُ بْنُ كَنِيزٍ عَنْ عُثْمَانَ بْنِ سَاجٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ إِنَّ أَفْوَاهَكُمْ طُرُقٌ لِلْقُرْآنِ فَطَيِّبُوهَا بِالسِّوَاكِ";
ibnemaja.urdu = "سیدنا علی بن ابو طالب رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: تمہارے منہ قرآن کے راستے ہیں،لہٰذا انہیں مسواک کے ذریعے سے پاک صاف رکھا کرو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>بحربن کنیز السقاء: ضعیف (تقریب: 637) <br>وللحدیث شاہد ضعیف (انظر التلخیص الحبیر 70/1 ح 69)`;
ibnemaja.anwaar = [386,1];