var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ طَرِيفٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنِي مُحَمَّدُ بْنُ سُوقَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ رَفَعَتْ امْرَأَةٌ صَبِيًّا لَهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّتِهِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:حج (کے سفر)کے دوران میں ایک عورت نے اپنا بچہ بلند کر کے نبیﷺ کو دکھایا اور کہا:ہے اللہ کے رسول!کیا اس بچے کا بھی حج ہے؟آپ نے فرمایا:’’ہاں‘اور تجھے ثواب ہے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;