var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ نُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِالشَّجَرَةِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ أَنْ يَأْمُرَهَا أَنْ تَغْتَسِلَ وَتُهِلَّ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:مقام شجرہ(ذوالحلیفہ کے مقام)پرحضرت اسماء بنت عمیس رضی اللہ عنہا کے ہاں ولادت ہو گئی۔رسول اللہﷺ نے حضرت ابو بکر رضی اللہ عنہ سے کہا کہ انھیں غسل کرنے اور احرام باندھنے کا حکم دیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;