var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَ نُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَغْتَسِلَ وَتَسْتَثْفِرَ بِثَوْبٍ ثُمَّ تُهِلَّ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا: حضرت اسما بنت عمیس رضی اللہ عنہا کے ہاں محمد بن ابی بکر رضی اللہ عنہ پیدا ہوئے تو انھو ں نے (مسئلہ معلوم کرنے کے لیے)نبیﷺ کو پیغام بھیجا(کہ اب کیا کرو ں؟)آپ نے حکم دیا کہ غسل کریں اور ایک کپڑے کو لنگوٹ کی طرح باندھ لیں اور لبیک پکاریں(احرام باندھ لیں۔)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;