var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفِطْرَةُ خَمْسٌ أَوْ خَمْسٌ مِنْ الْفِطْرَةِ الْخِتَانُ وَالِاسْتِحْدَادُ وَتَقْلِيمُ الْأَظْفَارِ وَنَتْفُ الْإِبِطِ وَقَصُّ الشَّارِبِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’فطرت پانچ چیزیں ہیں،یا فرمایا: پانچ چیزیں فطرت میں سے ہیں: ختنہ،(زیر ناف بالوں کی صفائی کے لئے) لوہے کی چیز استعمال کرنا،ناخن تراشنا بغلوں کے بال اکھاڑنا اور مونچھیں کاٹنا۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;