var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي تَلْبِيَتِهِ لَبَّيْكَ إِلَهَ الْحَقِّ لَبَّيْكَ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ سے روایت ہے کہ:رسول اللہ ﷺ نے اپنے تلبیے میں فرمایا] لَبَّیْکَ إِلَہَ الْحَقِّ،لَبَّیْکَ[’’حاضر ہوں‘اے سچے معبود!میں حاضر ہوں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;