var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ الْأَنْصَارِيُّ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ مُلَبٍّ يُلَبِّي إِلَّا لَبَّى مَا عَنْ يَمِينِهِ وَشِمَالِهِ مِنْ حَجَرٍ أَوْ شَجَرٍ أَوْ مَدَرٍ حَتَّى تَنْقَطِعَ الْأَرْضُ مِنْ هَاهُنَا وَهَاهُنَا";
ibnemaja.urdu = "حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’جو بھی تلبیہ کہنے والا لبیک پکارتا ہے‘اس کے دائیں بائیں دونوں طرف زمین کی انتہا تک ہر پتھر ‘درخت اور اینٹ(ہر چیز)لبیک پکارتی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;