var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ حَدَّثَهُ عَنْ خَلَّادِ بْنِ السَّائِبِ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَانِي جِبْرِيلُ فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالْإِهْلَالِ";
ibnemaja.urdu = "حضرت خلاد بن سائب رحمہ اللہ نے اپنے والد(حضرت سائب بن خلاد بن سوید رضی اللہ عنہ)سے روایت کیا کہ نبی ﷺ نے فرمایا:’’حضرت جبریل علیہ السلام نے میرے پاس آ کر مجھے کہا کہ میں اپنے ساتھیوں کو حکم دوں کہ لبیک بلند آواز سے پکاریں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;