var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ عَنْ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ عَنْ خَلَّادِ بْنِ السَّائِبِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَنِي جِبْرِيلُ فَقَالَ يَا مُحَمَّدُ مُرْ أَصْحَابَكَ فَلْيَرْفَعُوا أَصْوَاتَهُمْ بِالتَّلْبِيَةِ فَإِنَّهَا مِنْ شِعَارِ الْحَجِّ";
ibnemaja.urdu = "حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت ہے‘رسو ل اللہ ﷺ نے فرمایا:’’میرے پاس جبریل علیہ السلام تشریف لائے اور فرمایا:اے محمد(ﷺ)!اپنے ساتھیوں کو حکم دیجیے کہ لبیک بلند آواز سے پکارا کریں کیونکہ یہ حج کے شعار (امتیازی اعمال)میں شامل ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;