var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ الْعَجُّ وَالثَّجُّ";
ibnemaja.urdu = "حضرت ابو بکر صدیق رضی اللہ عنہ سے روایت ہے‘ رسول اللہ ﷺ سے دریافت کیا گیا:کون سا عمل افضل ہے؟آپ نے فرمایا:’’آواز بلند کرنا(لبیک بلند آواز سے کہنا)اور خون بہانا(قربانی کرنا)۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (827)`;
ibnemaja.anwaar = [483,1];