var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ جَمِيعًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِحِلِّهِ قَبْلَ أَنْ يُفِيضَ قَالَ سُفْيَانُ بِيَدَيَّ هَاتَيْنِ";
ibnemaja.urdu = "ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:’’میں نے رسول اللہ ﷺ کو آپ کے احرام باندھنے سے پہلے خوشبو لگائی اوراحرام کھولنے کے وقت طواف افاضہ کرنے یے پہلے بھی۔‘‘ سفیان کی روایت میں یہ الفاظ ہیں(میں نے) اپنے دونو ں ہاتھوں سے (نبیﷺکو خوشبو لگائی۔)";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;