var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَأَنِّي أَرَى وَبِيصَ الطِّيبِ فِي مَفْرِقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ثَلَاثَةٍ وَهُوَ مُحْرِمٌ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:’’گویا میں رسول اللہ ﷺ کی مانگ میں خوشبو کی چمک دیکھ رہی ہوں جب کہ آپ کو احرام باندھے تین دن ہو چکے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `سندہ ضعیف <br>نسائي (2704)`;
ibnemaja.anwaar = [535,1];