var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِوَرْسٍ أَوْ زَعْفَرَانٍ";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے ‘انھوں نے فرمایا:’’رسول اللہ ﷺ نے احرام باندھنے والے کو ورس یا زعفران سے رنگا ہوا کپڑا پہننے سے منع فرمایا۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;