var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ وَعَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنْ الْكَعْبَيْنِ";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’جسے جوتے میسر نہ ہوں‘وہ موزے پہن لے اور انہیں ٹخنوں کے نیچے سے کاٹ لے(تاکہ جوتوں کی طرح بن جائیں)۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;