var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ وَوَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ ضُبَاعَةَ قَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا شَاكِيَةٌ فَقَالَ أَمَا تُرِيدِينَ الْحَجَّ الْعَامَ قُلْتُ إِنِّي لَعَلِيلَةٌ يَا رَسُولَ اللَّهِ قَالَ حُجِّي وَقُولِي مَحِلِّي حَيْثُ تَحْبِسُنِي";
ibnemaja.urdu = "حضرت ضباعہ ؓ سے روایت ہے’انہوں نے فرما یا:رسول اللہ ﷺمیرے پاس تشریف لائے جبکہ میں بیمار تھی۔آپﷺ نے فرمایا:’’کیا اس سال تمہارا حج کرنے کا اراداہ نہیں ہے؟‘‘میں نے کہا:اللہ کے رسول!میں بیمار ہوں:آپ نےفرمایا:’’حج کرواور کہ دو(اے اللہ)میں وہاں احرام کھول دوں گی جہاں تو مجھے روک دے۔‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;