var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ صَبِيحٍ حَدَّثَنَا مُبَارَكُ بْنُ حَسَّانَ أَبُو عَبْدِ اللَّهِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ كَانَتْ الْأَنْبِيَاءُ تَدْخُلُ الْحَرَمَ مُشَاةً حُفَاةً وَيَطُوفُونَ بِالْبَيْتِ وَيَقْضُونَ الْمَنَاسِكَ حُفَاةً مُشَاةً";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے ‘انھوں نے فرمایا:انبیاء کرام چلتے ہوے (سواری کے بغیر)اور ننگےپاؤں حرم میں د خل ہوا کر تے تھے اور(اسی طرح)بیت اللہ کا طواف کرتے تھے۔وہ تمام منا سک (اوراعمال)پیدل اور ننگے پاؤں ادا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مبارک بن حسان: لین الحدیث`;
ibnemaja.anwaar = [483,1];