var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْخُلُ مَكَّةَ مِنْ الثَّنِيَّةِ الْعُلْيَا وَإِذَا خَرَجَ خَرَجَ مِنْ الثَّنِيَّةِ السُّفْلَى";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے کہ رسول اللہﷺمکہ میں ثنیہ علیا سے دا خل ہوتے تھے۔اور جب (مکہ شریف سے)با ہر نکلتے توثنیہ سفلیٰ س ے باہر نکلتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;