var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الرَّحِيمِ الرَّازِيُّ عَنْ ابْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَأْتِيَنَّ هَذَا الْحَجَرُ يَوْمَ الْقِيَامَةِ وَلَهُ عَيْنَانِ يُبْصِرُ بِهِمَا وَلِسَانٌ يَنْطِقُ بِهِ يَشْهَدُ عَلَى مَنْ يَسْتَلِمُهُ بِحَقٍّ";
ibnemaja.urdu = "حضرت عبداللہ بن عباسؓ سے روایت ہے‘رسول اللہﷺنے فرمایا:’’قیامت کے دن یہ پتھر(حجر اسود)ضرور اس حال میں حاضرہو گا کہ اس کی دو آنکھیں ہوں گی جن سے وہ د یکھے گا ‘اوراس کی زبان ہو گی جس سے وہ بولے گا۔جس نے اسے حق کے ساتھ چوما ہو گا اس کے حق میں گواہی دے گا۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;