var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُ مِنْ أَرْكَانِ الْبَيْتِ إِلَّا الرُّكْنَ الْأَسْوَدَ وَالَّذِي يَلِيهِ مِنْ نَحْوِ دُورِ الْجُمَحِيِّينَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے‘انہوں نے فرما یا:رسول اللہﷺبیت اللہ کےکونوں میں سے صرف حجر اسودکا اوربنو جمح کے گروں واقع حجر اسودسے متصل کونے(رکم یمانی)کااستلام کرتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;