var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے کہ حجۃ الوداع کے دوران میں نبی ﷺنے اونٹ پر سوار ہو کر طواف کیااور چھڑی سے حجرراسود کا استلام کرتے رہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;