var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى قَالَا حَدَّثَنَا مَعْرُوفُ بْنُ خَرَّبُوذَ الْمَكِّيُّ قَالَ سَمِعْتُ أَبَا الطُّفَيْلِ عَامِرَ بْنَ وَاثِلَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطُوفُ بِالْبَيْتِ عَلَى رَاحِلَتِهِ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنِهِ وَيُقَبِّلُ الْمِحْجَنَ";
ibnemaja.urdu = "حضرت ابوطفیل عامر بن واثلہ ؓ سے روایت ہے‘انھوں نے نبیﷺکودیکھا کہ چھڑی کے ساتھ حجراسودکا استلام کرتے اور چھڑی کو بوسہ دیتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;