var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ وُقِّتَ لَنَا فِي قَصِّ الشَّارِبِ وَحَلْقِ الْعَانَةِ وَنَتْفِ الْإِبِطِ وَتَقْلِيمِ الْأَظْفَارِ أَنْ لَا نَتْرُكَ أَكْثَرَ مِنْ أَرْبَعِينَ لَيْلَةً";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا: مونچھیں کاٹنے،زیر ناف بال مونڈنے،بغلوں کے بال اکھاڑنے اور ناخن کاٹنے کے لیے ہمارے لئے یہ حد مقرر کی گئی ہے کہ انہیں چالس راتوں سے زیادہ نہ چھوڑیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;