var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَحْمَدُ بْنُ بَشِيرٍ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا طَافَ بِالْبَيْتِ الطَّوَافَ الْأَوَّلَ رَمَلَ ثَلَاثَةً وَمَشَى أَرْبَعَةً مِنْ الْحِجْرِ إِلَى الْحِجْرِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سےروایت ہے کہ رسول اللہﷺ جب پہلی باربیت اللہ کا طواف کرتے تو تین چکروںمیں رمل کرتے اورچار چکروں میں (عام رفتارسے)چلتے‘‘حجرسے حجر تک۔(نافع نے فرما یا)حضرت عمر ؓ بھی اسی طرح کرتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح، صحیح بخاری";
ibnemaja.description = ``;