var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُمَرَ يَقُولُ فِيمَ الرَّمَلَانُ الْآنَ وَقَدْ أَطَّأَ اللَّهُ الْإِسْلَامَ وَنَفَى الْكُفْرَ وَأَهْلَهُ وَايْمُ اللَّهِ مَا نَدَعُ شَيْئًا كُنَّا نَفْعَلُهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "حضرت عمر ؓ سے روایت ہے ‘انہوں نے فرما یا:اب رمل کا کیا فا ئدہ ہے جب کہ اللہ تعالیٰ نے اسلام کو مستحکم کردیا ہے اورکفر اہل کفر کو ملک (عرب)سے نکال مدیا ہے؟اورقسم ہے اس اللہ کی!ہم وہ کام نہیں چھوڑیں گے جو رسول اللہﷺکے زمانے میں کیا کرتے تھے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;