var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ وَقَبِيصَةُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَبْدِ الْحَمِيدِ عَنْ ابْنِ يَعْلَى بْنِ أُمَيَّةَ عَنْ أَبِيهِ يَعْلَى أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ مُضْطَبِعًا قَالَ قَبِيصَةُ وَعَلَيْهِ بُرْدٌ";
ibnemaja.urdu = "حضرت یعلیٰ بن امیہ ؓ سے روایت ہے کہ نبی ﷺنے اضطباع کی حالت میں طواف کیا۔\n(راوی حدیث)قبیصہ نے کہا:آپ نے ایک چادر اوڑھی ہوئی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1883) ترمذي (859)`;
ibnemaja.anwaar = [484,1];