var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ عَنْ الْعَلَاءِ بْنِ الْمُسَيَّبِ عَنْ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ طَافَ بِالْبَيْتِ وَصَلَّى رَكْعَتَيْنِ كَانَ كَعِتْقِ رَقَبَةٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سےروایت ہے ‘انہوں نے فرما یا:میں نے رسول اللہﷺسے یہ فرمان سنا:’’جو شخص بیت اللہ کا طواف کے اور دو رکعت نماز پڑھے‘(اس کا)یہ (عمل)ایک انسان آزاد کرنے کی طرح ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;