var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ مُحَمَّدِ بْنِ ثَابِتٍ الْعَبْدِيِّ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ فَطَافَ بِالْبَيْتِ سَبْعًا ثُمَّ صَلَّى رَكْعَتَيْنِ قَالَ وَكِيعٌ يَعْنِي عِنْدَ الْمَقَامِ ثُمَّ خَرَجَ إِلَى الصَّفَا";
ibnemaja.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے کہ رسول اللہ ﷺنے کعبہ کے گرد سات چکر لگائے‘پھردو رکعتیں پڑھیں۔(امام) وکیع نے فرما یا:مقام ابراہیم کے پاس۔پھر(مسجد سے) نکل کر صفا کی طرف تشریف لے گئے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;