var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ أَبِي الْأَسْوَدِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ وَكَانَ يَتِيمًا فِي حِجْرِ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْرَدَ الْحَجَّ";
ibnemaja.urdu = "ام المومنین حضرت عا ئشہ ؓ رضی اللہ عنھا سے روایت ہے کے رسول اللہ ﷺ نے مفرد کیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;