var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ فَسَمِعْتُهُ يَقُولُ لَبَّيْكَ عُمْرَةً وَحِجَّةً";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے انھوں نے فرمایا:ہم لوگ رسول اللہ ﷺ نے ساتھ مکہ کی طرف روانہ ہوئے۔میں نے رسول اللہ ﷺ کو فرماتے سنا:(لَبَّیْکَ عُمْرَۃً وَحِجَّۃً)’’عمرہ اور حج کے لیے حاضر ہوں‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;