var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَكَمُ بْنُ بَشِيرِ بْنِ سَلْمَانَ حَدَّثَنَا خَلَّادٌ الصَّفَّارُ عَنْ الْحَكَمِ النَّصَرِيِّ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي جُحَيْفَةَ عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتْرُ مَا بَيْنَ الْجِنِّ وَعَوْرَاتِ بَنِي آدَمَ إِذَا دَخَلَ الْكَنِيفَ أَنْ يَقُولَ بِسْمِ اللَّهِ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’بنی آدم(انسانوں) کے پردے کے اعضاء اور جنوں کی نظروں کے درمیان یہ چیز پردہ بن جاتی ہے کہ جب کوئی بیت الخلاء میں داخل ہو تو بِسْمِ اللہ کہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (606)`;
ibnemaja.anwaar = [386,1];