var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا حَجَّاجٌ عَنْ الْحَسَنِ بْنِ سَعْدٍ عَنْ ابْنِ عَبَّاسٍ أَخْبَرَنِي أَبُو طَلْحَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَنَ الْحَجَّ وَالْعُمْرَةَ";
ibnemaja.urdu = "حضرت ابو طلحہ (زید سہل انصاری)رضی اللہ عنہ سے روایت ہے کے رسول اللہ ﷺنے حج اور عمرہ کو ملا کر (حج قران) کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حجاج بن أرطاۃ ضعیف مدلس <br>و الحدیث السابق (الأصل: 2968) یغني عنہ`;
ibnemaja.anwaar = [484,1];