var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى بْنِ حَارِثٍ الْمُحَارِبِيُّ حَدَّثَنَا أَبِي عَنْ غَيْلَانَ بْنِ جَامِعٍ عَنْ لَيْثٍ عَنْ عَطَاءٍ وَطَاوُسٍ وَمُجَاهِدٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ وَابْنِ عُمَرَ وَابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَطُفْ هُوَ وَأَصْحَابُهُ لِعُمْرَتِهِمْ وَحَجَّتِهِمْ حِينَ قَدِمُوا إِلَّا طَوَافًا وَاحِدًا";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ حضرت عبد اللہ عمر اور حضرت عبد اللہ بن عبا س رضی اللہ عنہم سے روایت ہے کے رسول اللہ ﷺاور آپ کےصحابہ رضی اللہ جب (مکہ مکرمہ)تشریف لائے تو انھوں نے اپنے حج اور عمرے (دونوں)کے لئے صرف ایک ہی طواف کیا تھا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;