var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ الزَّنْجِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ قَدِمَ قَارِنًا فَطَافَ بِالْبَيْتِ سَبْعًا وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ قَالَ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "حضر ت عبداللہ بن عمر ؓسے روایت ہے کے وہ حج قرآن کی نیت سے تشریف لائے تو بیت اللہ کے طواف کے ساتھ چکر لگائے اور صفا اور مروہ کے درمیان سعی کی پھر فرمایا: رسول اللہ ﷺ نے اسی طر ح کیا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مسلم بن خالد الزنجي ضعیف <br>و حدیث البخاري (1640) و مسلم (1230) و النسائي (5/ 225۔226ح 2935) یغني عنہ`;
ibnemaja.anwaar = [484,1];