var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحْرَمَ بِالْحَجِّ وَالْعُمْرَةِ كَفَى لَهُمَا طَوَافٌ وَاحِدٌ وَلَمْ يَحِلَّ حَتَّى يَقْضِيَ حَجَّهُ وَيَحِلَّ مِنْهُمَا جَمِيعًا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓسے روایت ہے رسو ل اللہ ﷺ نے فرمایا:جس نے حج اور عمرے کا اکٹھا احرام باندھا اسے ان دونوں کیلئے ایک ہی طواف کافی ہے۔اور وہ احرام نہیں کھو لے گا حتی کے حج پورا کر لےاور دونوں سے اکٹھا احرام کھولے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;