var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنْ طَاوُسٍ عَنْ سُرَاقَةَ بْنِ جُعْشُمٍ قَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا فِي هَذَا الْوَادِي فَقَالَ أَلَا إِنَّ الْعُمْرَةَ قَدْ دَخَلَتْ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ";
ibnemaja.urdu = "حضرت سراقہ بن جعشم ؓ سے روایت ہے انھوں نے فرمایا: رسول اللہ ﷺ نے اس وادی میں کھڑے ہو کر خطبہ دیا اور فرمایا: سنو!عمرہ قیامت تک کے لئے حج میں داخل ہو گیا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;