var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ قَالَ أَعُوذُ بِاللَّهِ مِنْ الْخُبُثِ وَالْخَبَائِثِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب بیت الخلاء میں داخل ہوتے تو کہتے تھے:﴿َ أَعُوذُ بِاللہ ِ مِنَ الْخُبُثِ وَالْخَبَائِثِ﴾ ’’میں ناپاک جنوں اور ناپاک جنّیوں سے اللہ کی پناہ میں آتا ہوں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;