var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ الْحَارِثِ بْنِ بِلَالِ بْنِ الْحَارِثِ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ فَسْخَ الْحَجِّ فِي الْعُمْرَةِ لَنَا خَاصَّةً أَمْ لِلنَّاسِ عَامَّةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلْ لَنَا خَاصَّةً";
ibnemaja.urdu = "حضرت بلا ل بن حارث ؓ سے روایت ہے انھوں نے فر ما یا: میں نے عرض کیا: اے اللہ کے رسو ل! کیا حج (کی نیت) کو فسخ کر کے عمر ہ بنا دیناصرف ہمارے لئے خا ص حکم ہے یا سب لوگوں کے لیے عام حکم ہے؟ رسول اللہ ﷺ نے فرما یا: بلکہ خا ص طو ر پر ہما رے لیے ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;