var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أُمِّ وَلَدٍ لِشَيْبَةَ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ وَهُوَ يَقُولُ لَا يُقْطَعُ الْأَبْطَحُ إِلَّا شَدًّا";
ibnemaja.urdu = "حضرت صفیہ بنت شیبہ ؓنے حضرت شیبہ (بن عثما ن) کی ام ولد ؓؓ سے ر وایت کی کے انھوں نے کہا: میں نے رسول اللہ ﷺ کو صفا اور مر وہ کے درمیا ن سعی کرتے دیکھا جبکہ آپ فر ما رہے تھٖے: سنگریز وں والی زمین صرف دوڑ کر ہی طے کی جائے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;