var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْحَسَنُ بْنُ يَحْيَى الْخُشَنِيُّ حَدَّثَنَا عُمَرُ بْنُ قَيْسٍ أَخْبَرَنِي طَلْحَةُ بْنُ يَحْيَى عَنْ عَمِّهِ إِسْحَقَ بْنِ طَلْحَةَ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْحَجُّ جِهَادٌ وَالْعُمْرَةُ تَطَوُّعٌ";
ibnemaja.urdu = "حضرت طلحہ بن عبید اللہ ؓ سے روایت ہے کے انھو ں نے رسول اللہ ﷺ کو سنا آپ فرما رہے تھے: حج جہا د ہے او ر عمرہ نفلی عبادت ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عمر بن قیس سندل: متروک (تقریب: 4959) والراوي عنہ الحسن بن یحیی الخشني: ضعیف <br>والسند ضعفہ البوصیري من أجلھما`;
ibnemaja.anwaar = [484,2];