var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ اعْتَمَرَ فَطَافَ وَطُفْنَا مَعَهُ وَصَلَّى وَصَلَّيْنَا مَعَهُ وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ لَا يُصِيبُهُ أَحَدٌ بِشَيْءٍ";
ibnemaja.urdu = "حضرت عبد اللہ بن ابی اوفی ؓ سے روایت ہے انھوں نےفرما یا: جب رسو ل اللہ ﷺ نے عمرہ کیا تو ہم لوگ آپ ﷺ کے ساتھ تھے چنا چہ آپ نے طواف کبا اور ہم نے بھی آپ کے سا تھ طواف کیا۔آ پ نے نماز پڑھی اور ہم نے بھی آپ کے ساتھ نماز پڑھی۔ہم مکہ والوں سے آپ ﷺ کی (حفا ظت کے لئے) آڑ بنتےتھے تا کہ کوئی آ پ کو کسی قسم کی گزند نہ پہنچا ئے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;