var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ جَمِيعًا عَنْ دَاوُدَ بْنِ يَزِيدَ الزَّعَافِرِيِّ عَنْ الشَّعْبِيِّ عَنْ هَرِمِ بْنِ خَنْبَشٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً";
ibnemaja.urdu = "حضرت ہرم بن خنبش ؓ سے روایت ہے رسو ل اللہ ﷺ نے فرما یا: رمضان میں ایک عمر ہ ایک حج کے برابر ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;