var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ بْنِ عُثْمَانَ بْنِ شَافِعٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ أَخْبَرَنِي عَمْرُو بْنُ أَوْسٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ فَيُعْمِرَهَا مِنْ التَّنْعِيمِ";
ibnemaja.urdu = "حضرت عبدالرحمان بن ابی بکر رضی اللہ عنہما سے روایت ہے نبیﷺنے انھیں حکم دیا کہ عائشہ رضی اللہ عنہا کو اپنے پیچھے سواری پر بٹھا کر تنعیم سے عمرہ کرا دیں-";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;