var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَسُوَيْدُ بْنُ سَعِيدٍ وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ وَإِسْمَعِيلُ بْنُ مُوسَى قَالُوا حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘جس نے جان بوجھ کر مجھ پر جھوٹ باندھا،اسے چاہیئے کہ(جہنم کی) آگ میں اپنا ٹھکانا بنالے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;