var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَحْيَى بْنِ أَبِي سُفْيَانَ عَنْ أُمِّهِ أُمِّ حَكِيمٍ بِنْتِ أُمَيَّةَ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَهَلَّ بِعُمْرَةٍ مِنْ بَيْتِ الْمَقْدِسِ كَانَتْ لَهُ كَفَّارَةً لِمَا قَبْلَهَا مِنْ الذُّنُوبِ قَالَتْ فَخَرَجْتُ أَيْ مِنْ بَيْتِ الْمَقْدِسِ بِعُمْرَةٍ";
ibnemaja.urdu = "رسول اللہ ﷺ کی زوجہ محترمہ حضرت ام سلمہ رضی اللہ عنہا سے روایت ہے رسول اللہ ﷺنے فرمایا: جس نے بیت المقدس سے احرام باندھ کر عمرہ کیا وہ اس کے سابقہ گناہوں کا کفارہ ہو جاتا ہے۔ام المؤمنین نے فرمایا:چنانچہ میں (بیت المقدس سے)عمرے کے لیے روانہ ہوئی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `۔3002] إسنادہ ضعیف <br>سنن أبي داود (1741)`;
ibnemaja.anwaar = [485,1];