var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ إِسْمَعِيلَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِمِنًى يَوْمَ التَّرْوِيَةِ الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ غَدَا إِلَى عَرَفَةَ";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ نے ترویہ کے دن (8 ذوالحجہ کو)ظہر عصر مغرب عشاء اور فجر(9 ذوالحجہ کو)منیٰ میں ادا کیں پھر عرفہ کی طرف روانہ ہوئے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;