var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يُصَلِّي الصَّلَوَاتِ الْخَمْسَ بِمِنًى ثُمَّ يُخْبِرُهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ";
ibnemaja.urdu = "حضرت نافع رحمہ اللہ سے روایت ہے کہ حضرت عبد اللہ بن عمر رضی اللہ عنہ منیٰ میں پانچ نمازیں پڑھتے تھے پھر لوگوں کو بتاتے کہ رسول اللہ ﷺ بھی اسی طرح کرتے تھے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = `ولحدیثہ شواہد عند مسلم (۱۲۱۸) وغیرہ`;