var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ أُمِّهِ مُسَيْكَةَ عَنْ عَائِشَةَ قَالَتْ قُلْنَا يَا رَسُولَ اللَّهِ أَلَا نَبْنِي لَكَ بِمِنًى بَيْتًا يُظِلُّكَ قَالَ لَا مِنًى مُنَاخُ مَنْ سَبَقَ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے انھوں نے فرمایا:میں نے عرض کیا:اے اللہ کے رسول!کیا ہم آپ کے لیے منیٰ میں ایک گھر نہ بنا دیں جہاں آپ کو سایہ حاصل ہو؟رسو ل اللہ ﷺ نے فرمایا: نہیں منیٰ اس شخص کے لیے اونٹ بٹھانے (اور قیام کرنے)کی جگہ ہے جو پہلے(وہاں)پہنچ جائے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;