var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ الْحَسَنِ وَقَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مِنْ الْخَلَاءِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنِّي الْأَذَى وَعَافَانِي";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ جب بیت الخلاء سے باہرتشریف لاتے تو فرماتے: ﴿الْحَمْدُ لِلَّہِ الَّذِی أَذْہَبَ عَنِّی الأَذَی وَعَافَانِی ﴾’’اللہ کا شکر ہے جس نے مجھ سے نجاست (یا تکلیف دہ چیز) کو دور کر دیا اور مجھے عافیت بخشی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>إسماعیل بن مسلم المکي: ضعیف الحدیث <br>وللحدیث شاہد ضعیف عند ابن السني(22) <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [387,1];