var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ عَنْ زَيْدِ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيٍّ قَالَ وَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَقَالَ هَذَا الْمَوْقِفُ وَعَرَفَةُ كُلُّهَا مَوْقِفٌ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے انھوں نے فرمایا:رسول اللہﷺ عرفات میں ٹھہرے تو فرمایا: یہ ٹھہرنے کی جگہ ہےاور غرفات سب کے ٹھہرنے کی جگہ ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (1935) ترمذي (885)`;
ibnemaja.anwaar = [485,1];