var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْقَاسِمُ بْنُ عَبْدِ اللَّهِ الْعُمَرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ عَرَفَةَ مَوْقِفٌ وَارْتَفِعُوا عَنْ بَطْنِ عَرَفَةَ وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ وَارْتَفِعُوا عَنْ بَطْنِ مُحَسِّرٍ وَكُلُّ مِنًى مَنْحَرٌ إِلَّا مَا وَرَاءَ الْعَقَبَةِ";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ رضی اللہ عنہما سے روایت ہے رسول اللہﷺ نے فرمایا: عرفات سب کا سب ٹھہرنے کی جگہ ہے البتہ عرنہ کے نشیبی حصے سے اوپر رہو۔مزدلفہ سب کا سب ٹھہرنے کی جگہ ہےالبتہ وادئ محسر کی نشیب سے اوپر رہو۔منیٰ سب کا سب قربانی کی جگہ ہے سوائے اس کے جو گھاٹی کے پیچھے ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>القاسم بن عبد اللّٰہ: متروک (تقریب: 5468) <br>وأصل الحدیث صحیح إلا ’’ ماوراء العقبۃ ‘‘ انظر صحیح مسلم (1218)`;
ibnemaja.anwaar = [485,1];