var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ أُسَامَةَ بْنِ زَيْدٍ،أَنَّهُ سُئِلَ: كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ حِينَ دَفَعَ مِنْ عَرَفَةَ؟ قَالَ: «كَانَ يَسِيرُ الْعَنَقَ،فَإِذَا وَجَدَ فَجْوَةً،نَصَّ» قَالَ وَكِيعٌ: يَعْنِي فَوْقَ الْعَنَقِ";
ibnemaja.urdu = "حضرت اسامہ بن زید رضی اللہ عنہما سے روایت ہے‘ان سے سوال کیا گیا:رسول اللہﷺجب عرفات سے روانہ تھے تو کس طرح چلتے تھے؟ انھوں نے فرمایا:درمیانی رفتار سے چلتے تھے۔جب کھلی جگہ ملتی تو رفتار تیز کر دیتے۔\nراوئ حدیث وکیع رحمہ اللہ نے کہا:یعنی آپ درمیانی رفتار سے تھوڑا تیز چلتے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;