var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَنْبَأَنَا الثَّوْرِيُّ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: ’’قَالَتْ قُرَيْشٌ: نَحْنُ قَوَاطِنُ الْبَيْتِ،لَا نُجَاوِزُ الْحَرَمَ،فَقَالَ اللَّهُ عَزَّ وَجَلَّ: ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ [البقرة: 199]‘‘";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:قریش کہتے تھے:ہم بیت اللہ کے پاس رہنے والے ہیں۔ہم حرم (کی حدود)سے آگے نہیں جائیں گے‘اس لیے اللہ نے فرمایا: ثُمَّ أَفِیضُوا مِنْ حَیْثُ أَفَاضَ النَّاسُ’’پھر وہاں سے واپس آؤ جہاں سے(دوسرے)لوگ واپس آئیں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;