var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ،أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ،يَقُولُ: «صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ وَالْعِشَاءَ فِي حَجَّةِ الْوَدَاعِ بِالْمُزْدَلِفَةِ»";
ibnemaja.urdu = "حضرت ابو ایوب انصاری رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:میں نے حجۃ الوداع میں رسول اللہﷺ کے ساتھ مغرب اور عشاء کی نمازیں مزدلفہ میں ادا کیں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;