var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «صَلَّى الْمَغْرِبَ بِالْمُزْدَلِفَةِ» فَلَمَّا أَنَخْنَا قَالَ: «الصَّلَاةُ،بِإِقَامَةٍ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبیﷺنے مزدلفہ میں مغرب کی نماز ادا کی۔جب ہم نے اپنے اونٹ بٹھائے تو رسول اللہﷺ نے فرمایا:’’نماز اقامت کے ساتھ ہوتی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;