var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ قَالَ: حَدَّثَنَا عَمْرٌو،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ قَالَ: «كُنْتُ فِيمَنْ قَدِمَ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ضَعَفَةِ أَهْلِهِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے‘ انھوں نے فرمایا:رسول اللہﷺ نے اپنے گھر کے جو کمزور افراد (عورتیں اور بچے‘قوت والے لوگوں سے)پہلے(مزدلفہ سے منیٰ)بھیجے تھے‘میں بھی ان میں شامل تھا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;