var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ،كَانَتِ امْرَأَةً ثَبْطَةً،فَاسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ تَدْفَعَ مِنْ جَمْعٍ،قَبْلَ دَفْعَةِ النَّاسِ،«فَأَذِنَ لَهَا»";
ibnemaja.urdu = "ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ ام المؤمنین حضرت سودہ بنت زمعہ رضی اللہ عنہا بھاری بدن والی خاتون تھیں۔انھوں نے رسول اللہﷺ سے اجازت چاہی کہ مزدلفہ سے لوگو ں کے روانہ ہونے سے پہلے ہی روانہ ہو جائیں‘تو آپ ﷺ نے انھیں اجازت دے دی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;