var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ،عَنْ أُمِّهِ،قَالَتْ: رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَوْمَ النَّحْرِ،عِنْدَ جَمْرَةِ الْعَقَبَةِ،وَهُوَ رَاكِبٌ عَلَى بَغْلَةٍ،فَقَالَ: «يَا أَيُّهَا النَّاسُ إِذَا رَمَيْتُمُ الْجَمْرَةَ،فَارْمُوا،بِمِثْلِ حَصَى الْخَذْفِ»";
ibnemaja.urdu = "حضرت سلیمان بن عمرو بن احوص رحمہ اللہ اپنی والدہ(حضرت ام جندب ازدیہ رضی اللہ عنہ)سے روایت کرتے ہیں‘انھوں نے فرمایا:میں نے قربانی کے دن نبیﷺ کو جمرۂ عقبہ(بڑے جمرے)کے پاس دیکھا جب کہ آپ خچر پر سوار تھے۔رسول اللہ ﷺ نے فرمایا:’’لوگو!جب تم جمرے پر کنکریاں مارو تو چھوٹی کنکریاں مارو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (1966) انظر الحدیث الآتي (3031،3532)`;
ibnemaja.anwaar = [485,1];