var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلَاءَ وَضَعَ خَاتَمَهُ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہےکہ نبی ﷺ جب بیت الخلاء میں داخل ہوتے تو انگوٹھی اتار دیتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (19) ترمذي (1746) نسائي (5216)`;
ibnemaja.anwaar = [387,1];