var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى،عَنْ يُونُسَ بْنِ يَزِيدَ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،أَنَّهُ «رَمَى جَمْرَةَ الْعَقَبَةِ،وَلَمْ يَقِفْ عِنْدَهَا،وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَعَلَ مِثْلَ ذَلِكَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ انھوں نے جمرۂ عقبہ کو کنکریاں ماریں اور اس کے پاس نہ رکے اور بتایا کہ نبیﷺنے بھی اسی طرح کیا تھا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;