var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنِ الْحَجَّاجِ،عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ،عَنْ مِقْسَمٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «إِذَا رَمَى جَمْرَةَ الْعَقَبَةِ مَضَى،وَلَمْ يَقِفْ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے ‘ انھوں نےفرمایا:رسول اللہﷺ جب جمرۂ عقبہ (بڑے جمرے)کو رمی کرتے تو چلتے جاتے تھے‘ٹھہرتے نہیں تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;