var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ أَيْمَنَ بْنِ نَابِلٍ،عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ الْعَامِرِيِّ،قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «رَمَى الْجَمْرَةَ يَوْمَ النَّحْرِ،عَلَى نَاقَةٍ لَهُ صَهْبَاءَ،لَا ضَرْبَ وَلَا طَرْدَ،وَلَا إِلَيْكَ إِلَيْكَ»";
ibnemaja.urdu = "حضرت قدامہ بن عبداللہ عامری رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:میں نے قربانی کے دن نبیﷺ کو دیکھا کہ آپ نے جمرے کو رمی کی۔آپ اپنی ایک سرخ وسفیدرنگ کی اونٹنی پرسوار تھے۔نہ کسی کو مارا جاتا تھا‘نہ دور ہٹایا جاتا تھا‘اور نہ ہٹو بچو کی آوازیں تھیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;