var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ،عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ،عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمٍ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «رَخَّصَ لِلرِّعَاءِ،أَنْ يَرْمُوا يَوْمًا،وَيَدَعُوا يَوْمًا»";
ibnemaja.urdu = "حضرت ابو بداح عدی بن عاصم رحمہ اللہ اپنے والد(عاصم بن عدی بن جد رضی اللہ عنہ)سے روایت کرتے ہیں کہ نبیﷺنے چرواہوں کو اجازت دی کہ وہ ایک دن رمی کریں اور ایک دن چھوڑ دیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;