var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ أَشْعَثَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: «حَجَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَمَعَنَا النِّسَاءُ وَالصِّبْيَانُ،فَلَبَّيْنَا عَنِ الصِّبْيَانِ،وَرَمَيْنَا عَنْهُمْ»";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:ہم نے رسول اللہﷺ کے ساتھ حج کیا اور ہمارے ساتھ عورتیں اور بچے بھی تھے۔ہم نے بچوں کی طرف سے لبیک کہا اور ان کی طرف سے رمی بھی کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (927)`;
ibnemaja.anwaar = [485,1];