var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ قَالَ: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ خُصَيْفٍ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ الْفَضْلُ بْنُ عَبَّاسٍ: «كُنْتُ رِدْفَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَمَا زِلْتُ أَسْمَعُهُ يُلَبِّي،حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ،فَلَمَّا رَمَاهَا،قَطَعَ التَّلْبِيَةَ»";
ibnemaja.urdu = "حضرت فضل بن عباس رضی اللہ عنہما سے روایت ہے‘انھوں نے فرمایا:میں سواری پر نبیﷺکے پیچھے سوار تھا‘چنانچہ میں آپ کو لبیک پکارتے سنتا رہا حتیٰ کہ ٖآپ نے جمرۂ عقبہ (بڑے جمرے)کو کنکریاں ماریں۔جب آپ نے اس کی رمی کر لی تو لبیک پکارنا بند کر دیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;