var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا خَالِي مُحَمَّدٌ،وَأَبُو مُعَاوِيَةَ،وَأَبُو أُسَامَةَ،عَنْ عُبَيْدِ اللَّهِ،عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ،عَنْ عَائِشَةَ،قَالَتْ: «طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،لِإِحْرَامِهِ حِينَ أَحْرَمَ،وَلِإِحْلَالِهِ حِينَ أَحَلَّ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:میں نے رسول اللہﷺ کو احرام کے لیے خوشبو لگائی جب آپ نے احرام باندھا اور احرام کھولنے پر خوشبو لگائی جب احرام کھولا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;