var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ قَالَ: حَدَّثَنَا ابْنُ إِسْحَاقَ قَالَ: حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ لِمَ ظَاهَرْتَ لِلْمُحَلِّقِينَ ثَلَاثًا،وَلِلْمُقَصِّرِينَ وَاحِدَةً؟ قَالَ: «إِنَّهُمْ لَمْ يَشُكُّوا»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ عرض کیا گیا:اے اللہ کے رسول!آپ نے سر کے بال منڈوانے والوں کی تین بار تائید فرمائی اور کٹوانے والوں کی ایک بار؟آپ نے فرمایا:’’انھوں نے شک نہیں کیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبد اللّٰہ ابن أبي نجیح عنعن وھو مدلس`;
ibnemaja.anwaar = [486,1];