var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ،عَنْ عَطَاءٍ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مِنًى كُلُّهَا مَنْحَرٌ،وَكُلُّ فِجَاجِ مَكَّةَ،طَرِيقٌ وَمَنْحَرٌ،وَكُلُّ عَرَفَةَ مَوْقِفٌ،وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ»";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ رضی اللہ عنہما سے روایت ہے‘رسول اللہﷺ نے فرمایا:’’منیٰ سب کا سب قربانی کی جگہ ہے۔اور مکہ کا ہر راستہ (یہاں آنے کی)راہ بھی ہے اور قربانی کی جگہ بھی۔اور پورا عرفات ٹھہرنے کی جگہ ہے۔اور پورا مزدلفہ ٹھہرنے کی جگہ ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;