var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: مَا سُئِلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَمَّنْ قَدَّمَ شَيْئًا،قَبْلَ شَيْءٍ،إِلَّا يُلْقِي بِيَدَيْهِ كِلْتَيْهِمَا «لَا حَرَجَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے ‘انھوں نے فرمایا:رسول اللہ ﷺ سے جس شخص کے بارہ میں بھی سوال کیا گیا کہ اس نے ایک کام سے پہلے دوسرا کام کر لیا ہے‘(تو اس کے جواب میں)رسول اللہﷺنے دونوں ہاتھوں سے اشارہ کر کےیہی فرمایا:’’کوئی حرج نہیں۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;