var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ عِيسَى بْنِ طَلْحَةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَمَّنْ ذَبَحَ،قَبْلَ أَنْ يَحْلِقَ،أَوْ حَلَقَ،قَبْلَ أَنْ يَذْبَحَ قَالَ: «لَا حَرَجَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہ روایت ہے‘سے پوچھا گیا کہ کسی نے سر منڈوانے سے پہلےذبح کر لیا یا ذبح کرنے سے پہلے سر منڈوا لیا تو آپ ﷺ نے فرمایا:’’کوئی حرج نہیں۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;