var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «رَمَى جَمْرَةَ الْعَقَبَةِ ضُحًى،وَأَمَّا بَعْدَ ذَلِكَ،فَبَعْدَ زَوَالِ الشَّمْسِ»";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:میں نے دیکھا کہ رسول اللہﷺنے(دس تاریخ کو)بڑے جمرے کو چاشت کے وقت(دھوپ چڑھے)رمی کی۔اس کے بعد کے دنوں میں سورج ڈھلنے کے بعد رمی کی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;