var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ بْنِ أَبِي شَيْبَةَ أَبُو شَيْبَةَ،عَنِ الْحَكَمِ،عَنْ مِقْسَمٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ «يَرْمِي الْجِمَارَ،إِذَا زَالَتِ الشَّمْسُ،قَدْرَ مَا إِذَا فَرَغَ مِنْ رَمْيِهِ،صَلَّى الظُّهْرَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہےکہ رسول اللہ ﷺسورج ڈھلنے سے اتنی دیر بعدجمرات پر کنکریاں مارتے تھے کہ جب رمی سے فارغ ہوتے تو ظہر کی نماز پڑھ لیتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>جبارۃضعیف جدًا <br>وأبو شیبۃ إبراہیم بن عثمان: متروک الحدیث <br>وللحدیث شواہد دون قولہ ’’ قدر ما إذا فرغ من رمیہ صلی الظہر ‘‘ راجع سنن الترمذي (898)`;
ibnemaja.anwaar = [486,1];