var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا سُفْيَانُ قَالَ: حَدَّثَنِي مُحَمَّدُ بْنُ طَارِقٍ،عَنْ طَاوُسٍ،وَأَبُو الزُّبَيْرِ،عَنْ عَائِشَةَ،وَابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَخَّرَ طَوَافَ الزِّيَارَةِ،إِلَى اللَّيْلِ»";
ibnemaja.urdu = "حضرت عائشہ اور عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ نے طواف زیارت رات تک مؤخر فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2000) ترمذي (920)<br>محمد بن طارق عن طاوس مرسل (تحفۃ الأشراف 13 / 239) وحدیث أبی الزبیر مسند لکنہ عنعن (انظر الحدیث السابق: 92) وعلقہ البخاري في صحیحہ (قبل: 1732)`;
ibnemaja.anwaar = [486,1];