var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَنْبَأَنَا ابْنُ جُرَيْجٍ،عَنْ عَطَاءٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «لَمْ يَرْمُلْ فِي السَّبْعِ،الَّذِي أَفَاضَ فِيهِ» قَالَ عَطَاءٌ: وَلَا رَمَلَ فِيهِ";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبیﷺنے طواف افاضہ کے سات چکروں میں رمل نہیں کیا۔\nجناب عطاء رحمہ اللہ بیان کرتے ہیں:اس(طواف)میں رمل نہیں ہوتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;