var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،قَالَ: قَالَ عَبْدُ اللَّهِ بْنُ الْمُؤَمَّلِ أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ،يَقُولُ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: سَمِعْتُ رَسُول اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَاءُ زَمْزَمَ،لِمَا شُرِبَ لَهُ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ سے روایت ہے،رسول اللہ ﷺنے فرمایا:زمزم کاپانی اس (مقصد) کے لے ہے جس کے لے وہ پیا جائے-‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد اللّٰہ بن مؤمل ضعیف <br>و قیل: تابعہ إبراھیم بن طھمان عند البیھقي (5/ 202) و لکن سندہ ضعیف،فیہ أحمد بن إسحاق بن شیبان البغدادي ولم أجد لہ ترجمۃ<br>و للحدیث شواھد ضعیفۃ عند الطبراني (الأوسط: 3827) وغیرہ`;
ibnemaja.anwaar = [486,1];