var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: «اسْتَأْذَنَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيتَ بِمَكَّةَ،أَيَّامَ مِنًى،مِنْ أَجْلِ سِقَايَتِهِ،فَأَذِنَ لَهُ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر ؓ سے روایت ہے کہ حضرت عباس بن عبدالمطلب ؓ نے پانی پلانے کے فریضہ کی ادائیگی کےلے رسول اللہﷺسے اجازت چاھی کہ منیٰ کے ایام میں رات کو مکہ میں رہیں‘ چنانچہ آپﷺ نے انھیں اجازت دے دی-";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;