var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَهَنَّادُ بْنُ السَّرِيِّ،قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «لَمْ يُرَخِّصِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَحَدٍ،يَبِيتُ بِمَكَّةَ،إِلَّا لِلْعَبَّاسِ،مِنْ أَجْلِ السِّقَايَةِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے ‘انھوں نے فرمایا:نبیﷺ نے کسی (حاجی)کو مکہ میں رات گزارنے کی اجازت نہیں دی‘سواے حضرت عباس کے‘(جنھیں)ان کے منصب سقایت کی وجہ سے (رات کو مکہ میں رہنے کی اجازت دی-)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ضعفہ البوصیري من أجل إسماعیل بن مسلم ضعیف`;
ibnemaja.anwaar = [486,1];