var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،عَنْ عَمَّارِ بْنِ رُزَيْقٍ،عَنِ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: «ادَّلَجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ النَّفْرِ،مِنَ الْبَطْحَاءِ ادِّلَاجًا»";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ سے روایت ہے‘انھوں نے فرمایا: نبی-ﷺ واپسی کی رات بطحاء سے رات کے آخری حصے میں روانہ ہوے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;