var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَنْبَأَنَا عُبَيْدُ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ،وَعُمَرُ،وَعُثْمَانُ يَنْزِلُونَ بِالْأَبْطَحِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر سے روایت ہے کہ رسول اللہ ﷺ‘حضرت ابوبکر ‘اور حضرت عمر اور حضرت عثمان بطح کے مقام پر قیام فر ماتے تھے-";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;