var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَسُوَيْدُ بْنُ سَعِيدٍ وَإِسْمَعِيلُ بْنُ مُوسَى السُّدِّيُّ قَالُوا حَدَّثَنَا شَرِيكٌ عَنْ الْمِقْدَامِ بْنِ شُرَيْحِ بْنِ هَانِئٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ مَنْ حَدَّثَكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ قَائِمًا فَلَا تُصَدِّقْهُ أَنَا رَأَيْتُهُ يَبُولُ قَاعِدًا";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: جو شخص تمہیں یہ بات بتائے کہ اللہ کے رسول ﷺ نے کھڑے ہو کر پیشاب کیا،اس کی تصدیق نہ کرنا،میں نے آپ ﷺ کو(ہمیشہ) بیٹھ کر پیشاب کرتے دیکھا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;