var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ سُلَيْمَانَ،عَنْ طَاوُسٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: كَانَ النَّاسُ يَنْصَرِفُونَ كُلَّ وَجْهٍ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْفِرَنَّ أَحَدٌ،حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس سے روایت ہے ‘انھوں نے فرمایا: لوگ(حج کے اعمال سے فارغ ہو کر منیٰ ہی سے)ہر طرف واپسی(اپنے وطن کو)چلےجاتے تھے‘چنانچہ رسول اللہﷺ نے فرمایا:‘‘کوئی شخص کوچ نہ کرےجب تک وہ (روانگی سے پہلے)آخری وقت بیت اللہ کے پاس(طواف میں)نہ گزارے‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;