var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي أُمَيَّةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ قَالَ رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبُولُ قَائِمًا فَقَالَ يَا عُمَرُ لَا تَبُلْ قَائِمًا فَمَا بُلْتُ قَائِمًا بَعْدُ";
ibnemaja.urdu = "سیدنا عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے مجھے کھڑے ہو کر پیشاب کرتے یکھا تو فرمایا: ’’عمر! کھڑے ہو کر پیشاب نہ کرو۔‘‘ (سیدنا عمر رضی اللہ عنہ نے فرمایا:) اس کے بعد میں نے کبھی کھڑے ہو کر پیشاب نہیں کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>قال البوصیري: ’’ ھذا إسناد ضعیف،عبدالکریم متفق علی تضعیفہ‘‘ (وانظر ضعیف سنن الترمذي: 12)`;
ibnemaja.anwaar = [387,1];