var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ،عَنْ أُسَامَةَ بْنِ زَيْدٍ،عَنْ مُحَمَّدِ بْنِ كَعْبٍ،عَنْ كَعْبِ بْنِ عُجْرَةَ،قَالَ: «أَمَرَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،حِينَ آذَانِي الْقَمْلُ،أَنْ أَحْلِقَ رَأْسِي،وَأَصُومَ ثَلَاثَةَ أَيَّامٍ أَوْ أُطْعِمَ سِتَّةَ مَسَاكِينَ،وَقَدْ عَلِمَ أَنْ لَيْسَ عِنْدِي مَا أَنْسُكُ»";
ibnemaja.urdu = "حضرت کعب بن عجرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے جب جوؤں سے تکلیف پہنچی تو نبی ﷺ نے مجھے حکم دیا کہ میں سر منڈا دوں اور تین دن روزے رکھوں یا چھ مسکینوں کو کھانا کھلا دوں۔رسول اللہ ﷺ کو معلوم تھا کہ میرے پاس قربانی دینے کی گنجائش نہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;