var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ مِقْسَمٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «احْتَجَمَ،وَهُوَ صَائِمٌ مُحْرِمٌ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے روزے اور احرام کی حالت میں سینگی لگوائی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث السابق (1682)`;
ibnemaja.anwaar = [487,1];