var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الضَّيْفِ،عَنِ ابْنِ خُثَيْمٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «احْتَجَمَ،وَهُوَ مُحْرِمٌ عَنْ رَهْصَةٍ أَخَذَتْهُ»";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے احرام کی حالت میں سینگی لگوائی کیونکہ آپ کو ردر ہو گیا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3863) نسائي (2851)`;
ibnemaja.anwaar = [487,1];