var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمَّارٍ،عَنْ جَابِرٍ،قَالَ: «جَعَلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الضَّبُعِ يُصِيبُهُ الْمُحْرِمُ،كَبْشًا،وَجَعَلَهُ مِنَ الصَّيْدِ»";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اگر احرام والا آدمی لگڑ بھگا (بھیڑے جیسا ایک خونخوار جانور) مار دے تو رسول اللہ ﷺ نے اس پر ایک مینڈھے کی قربانی دینا لازم کیا ہے اور اس جانور کو شکار قرار دیا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;