var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَمُحَمَّدُ بْنُ بَشَّارٍ،وَمُحَمَّدُ بْنُ الْمُثَنَّى،وَمُحَمَّدُ بْنُ الْوَلِيدِ،قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: سَمِعْتُ قَتَادَةَ،يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: خَمْسٌ فَوَاسِقُ،يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ: الْحَيَّةُ،وَالْغُرَابُ الْأَبْقَعُ،وَالْفَأْرَةُ،وَالْكَلْبُ الْعَقُورُ،وَالْحِدَأَةُ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: پانچ جانور فاسق ہیں،انہیں حرم سے باہر اور حرم کے اندر (ہر جگہ) قتل کیا جا سکتا ہے: سانپ،چتکبرا کوا،چوہا،کاٹنے والا کتا اور چیل۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;