var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ مِنَ الدَّوَابِّ،لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ-أَوْ قَالَ فِي قَتْلِهِنَّ-وَهُوَ حَرَامٌ: الْعَقْرَبُ،وَالْغُرَابُ،وَالْحِدَأَةُ،وَالْفَأْرَةُ،وَالْكَلْبُ الْعَقُورُ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: پانچ جانور ہیں جن کے قتل کرنے والے پر (یا فرمایا: جن کے قتل کرنے میں) کوئی گناہ نہیں اور وہ حرام ہیں: بچھو،کوا،چوہا اور کاٹنے والا کتا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;