var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عِمْرَانُ بْنُ مُحَمَّدِ بْنِ أَبِي لَيْلَى،عَنْ أَبِيهِ،عَنْ عَبْدِ الْكَرِيمِ،عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ،عَنِ ابْنِ عَبَّاسٍ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،قَالَ: «أُتِيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِلَحْمِ صَيْدٍ،وَهُوَ مُحْرِمٌ،فَلَمْ يَأْكُلْهُ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ نے حضرت علی رضی اللہ عنہ سے روایت کیا،انہوں نے فرمایا: نبی ﷺ کی خدمت میں شکار کا گوشت پیش کیا گیا جب کہ آپ احرام میں تھے تو آپ نے وہ نہ کھایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;