var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ،عَنْ عِيسَى بْنِ طَلْحَةَ،عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَعْطَاهُ حِمَارَ وَحْشٍ،وَأَمَرَهُ أَنْ يُفَرِّقَهُ فِي الرِّفَاقِ،وَهُمْ مُحْرِمُونَ»";
ibnemaja.urdu = "حضرت طلحہ بن عبید اللہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے انہیں گورخر (کا گوشت) دیا،اور حکم دیا کہ اسے ساتھیوں میں تقسیم کر دیں جب کہ وہ سب احرام باندھے ہوئے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سفیان بن عینۃ عنعن <br>والصحیح ما رواہ النسائي (183/5 ح 2820) وغیرہ بغیر ھذا اللفظ`;
ibnemaja.anwaar = [487,1];