var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنِ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ،وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ،أَنَّ عَائِشَةَ،زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُهْدِي مِنَ الْمَدِينَةِ،فَأَفْتِلُ قَلَائِدَ هَدْيِهِ،ثُمَّ لَا يَجْتَنِبُ شَيْئًا،مِمَّا يَجْتَنِبُ الْمُحْرِمُ»";
ibnemaja.urdu = "نبی ﷺ کی زوجہ محترمہ حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ مدینہ سے یدہ (قربانی کے جانور) بھیجتے تھے۔میں آپ کی ہدی کے جانوروں کے قلادے بٹ کر تیار کرتی تھی،پھر رسول اللہ ﷺ کسی ایسے کام سے پرہیز نہیں کرتے تھے جس سے احرام والا پرہیز کرتا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;