var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ قَالَتْ: «أَهْدَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّةً غَنَمًا إِلَى الْبَيْتِ فَقَلَّدَهَا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: ایک بار رسول اللہ ﷺ نے کچھ بکریاں ہدی کے طور پر بیت اللہ بھیجیں تو انہیں قلادے پہنائے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;