var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ هِشَامٍ الدَّسْتُوَائِيِّ،عَنْ قَتَادَةَ،عَنْ أَبِي حَسَّانَ الْأَعْرَجِ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَشْعَرَ الْهَدْيَ فِي السَّنَامِ الْأَيْمَنِ،وَأَمَاطَ عَنْهُ الدَّمَ» وَقَالَ عَلِيٌّ فِي حَدِيثِهِ: بِذِي الْحُلَيْفَةِ،وَقَلَّدَ نَعْلَيْنِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے ہدی کے جانور کی کوہان پر دائیں طرف اشعار کیا اور اس کا خون پونچھ دیا۔\n(راؤی حدیث) علی بن محمد اپنی حدیث میں بیان کرتے ہیں: ذوالحلیفہ میں (اشعار کیا) اور (جانور کے) گلے میں دو جوتیاں ڈالیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;