var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ،عَنْ أَفْلَحَ،عَنِ الْقَاسِمِ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «قَلَّدَ،وَأَشْعَرَ وَأَرْسَلَ بِهَا،وَلَمْ يَجْتَنِبْ،مَا يَجْتَنِبُ الْمُحْرِمُ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ نے (ہدی کے جانوروں کو) قلادہ پہنایا،اشعار کیا،اور انہیں (مکہ) بھیج دیا۔آپ نے ان چیزوں سے پرہیز نہیں کیا جن سے احرام باندھنے والا پرہیز کیا کرتا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;