var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الْكَرِيمِ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ أَبِي لَيْلَى،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،قَالَ: أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُومَ عَلَى بُدْنِهِ،وَأَنْ أَقْسِمَ جِلَالَهَا وَجُلُودَهَا،وَأَنْ لَا أُعْطِيَ الْجَازِرَ مِنْهَا شَيْئًا،وَقَالَ: «نَحْنُ نُعْطِيهِ»";
ibnemaja.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ نے مجھے حکم دیا کہ آپ کے اونٹوں (کو ذبح وغٰرہ کرنے) کا بندوبست کروں،اور ان کی جھولیں اور کھالیں تقسیم کر دوں،اور قصاب کو ان میں سے کچھ نہ دوں۔حضرت علی رضی اللہ عنہ نے فرمایا: اس (قصاب) کو ہم (اپنے پاس سے) دیتے ہیں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;