var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ وَإِسْمَعِيلُ بْنُ مُوسَى قَالَا حَدَّثَنَا شَرِيكٌ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكْذِبُوا عَلَيَّ فَإِنَّ الْكَذِبَ عَلَيَّ يُولِجُ النَّارَ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘مجھ پر جھوٹ نہ باندھو،جھوٹی بات میرے ذمے لگانا آگ (جہنم) میں داخل کردیتا ہے۔’’";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;