var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنِ ابْنِ أَبِي لَيْلَى،عَنِ الْحَكَمِ،عَنْ مِقْسَمٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَهْدَى فِي بُدْنِهِ،جَمَلًا لِأَبِي جَهْلٍ،بُرَتُهُ مِنْ فِضَّةٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے اپنے اونٹوں میں ہدی کے طور پر ابو جہل کا اونٹ بھی شامل کیا،اس (کی تکمیل) کا حلقہ چاندی کا تھا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;