var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ الثَّوْرِيِّ،عَنْ أَبِي الزِّنَادِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ: «ارْكَبْهَا» قَالَ: إِنَّهَا بَدَنَةٌ،قَالَ: «ارْكَبْهَا وَيْحَكَ»";
ibnemaja.urdu = "حضرت ابو ہریرہ سے روایت ہے کہ نبی ﷺ نے ایک آدمی کو دیکھا جو ہدی کے جانور (اونٹ یااونٹنی) ہانکے لیے جارہا تھا۔آپ نے فرمایا: ’’اس پر سوار ہو جاؤ۔‘‘ اس نے کہا: یہ تو ہدی کا جانور ہے۔نبی ﷺ نے فرمایا: ’’’’اس پر سوار ہو جا۔تیرا بھلا ہو۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;