var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عِيسَى بْنُ يُونُسَ،عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ،عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ،عَنْ عَلْقَمَةَ بْنِ نَضْلَةَ،قَالَ: «تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَأَبُو بَكْرٍ،وَعُمَرُ،وَمَا تُدْعَى رِبَاعُ مَكَّةَ،إِلَّا السَّوَائِبَ،مَنِ احْتَاجَ سَكَنَ،وَمَنِ اسْتَغْنَى أَسْكَنَ»";
ibnemaja.urdu = "حضرت علقمہ بن نضلہ رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ فوت ہوئے،پھر حضرت ابوبکر اور حضرت عمر بھی فوت ہو گئے اور (ان سب کے زمانے میں یہ کیفیت تھی کہ) مکہ کے مکانات وقف کہلاتے تھے۔جس کو ضرورت نہ ہوتی کسی اورکو (ان میں) ٹھرادیتا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>صححہ البوصیري علی شرط مسلم (!) وضعفہ الدمیري وقال: ’’ علقمۃ بن نضلۃ لا یصح لہ صحبۃ ‘‘ وقولہ ھو الصواب،وقال ابن حجر: ’’ تابعي صغیر،أخطأ من عدہ فی الصحابۃ ‘‘ (تقریب:4683)`;
ibnemaja.anwaar = [487,1];