var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الصَّلْتُ بْنُ دِينَارٍ عَنْ عُقْبَةَ بْنِ صُهْبَانَ قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ يَقُولُ مَا تَغَنَّيْتُ وَلَا تَمَنَّيْتُ وَلَا مَسِسْتُ ذَكَرِي بِيَمِينِي مُنْذُ بَايَعْتُ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عثمان بن عفان رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا: میں نے نہ کبھی گانا گایا،نہ جھوٹ بولا،اور نہ عضو خاص کو دائیں ہاتھ سے چھوا،جب سے میں نے اس(ہاتھ) سے رسول اللہ ﷺ کی بیعت کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>الصلت بن دینار: متروک ناصبي`;
ibnemaja.anwaar = [387,1];