var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،وَابْنُ الْفُضَيْلِ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ قَالَ: أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ سَابِطٍ،عَنْ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَزَالُ هَذِهِ الْأُمَّةُ بِخَيْرٍ،مَا عَظَّمُوا هَذِهِ الْحُرْمَةَ،حَقَّ تَعْظِيمِهَا،فَإِذَا ضَيَّعُوا ذَلِكَ،هَلَكُوا»";
ibnemaja.urdu = "حضرت عیاش بن ابی ربیعہ مخزومی سے روایت ہے،رسول اللہ ﷺ نے فرمایا: یہ امت اس وقت تک خیر پر رہے گی جب تک (حرمین کی) اس حرمت کی عظمت کا کماحقہ خیال رکھے گی۔جب وہ اس فریضے (تعظیم حرمین) ضائع کریں گے تو تباہ ہو جائیں گے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>یزید بن أبي زیاد: ضعیف مشہور`;
ibnemaja.anwaar = [487,1];