var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،وَأَبُو أُسَامَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ حَفْصِ بْنِ عَاصِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ،كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا»";
ibnemaja.urdu = "حضرت ابو ہریرہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا،’’ایمان مدینے کی طرف اسی طرج سمٹ آئے گا جس طرح سانپ سمٹ کر اپنے بل کی طرف آجاتا ہے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;