var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا أَبِي،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَمُوتَ بِالْمَدِينَةِ،فَلْيَفْعَلْ،فَإِنِّي أَشْهَدُ لِمَنْ مَاتَ بِهَا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر سے روایت ہے،رسول اللہ ﷺ نے فرمایا: تم میں سے جو شخص یہ کرسکے کہ مدینہ میں مرے تو ضرور یہ کرے۔جو شخص یہاں فوت ہوگا،میں اس کے حق میں گواہی دوں گا۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;