var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَرَادَ أَهْلَ الْمَدِينَةِ بِسُوءٍ،أَذَابَهُ اللَّهُ،كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ سے روایت ہے،رسول اللہ نے فرمایا:جو شخص مدینے والوں کے ساتھ برائی کا ارادہ کرے گا،اللہ تعالی اسے اس طرح گھلادے گا جس طرح پانی میں نمک گھل جاتا ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;