var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ قَالَ: حَدَّثَنَا عَبْدَةُ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ عَبْدِ اللَّهِ بْنِ مِكْنَفٍ،قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أُحُدًا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ،وَهُوَ عَلَى تُرْعَةٍ مِنْ تُرَعِ الْجَنَّةِ،وَعَيْرٌ عَلَى تُرْعَةٍ مِنْ تُرَعِ النَّارِ»";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: احد پہاڑ ہے جسے ہم سے محبت ہے اور ہمیں اس سے محبت ہے،اور وہ جنت کے ایک ٹیلے پر ہے۔اور ہیر (پہاڑ) جہنم کے ایک ٹیلے پر ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن إسحاق عنعن <br>وشیخہ عبد اللّٰہ بن مکنف:مجہول (تقریب: 3639) وضعفہ البخاري وغیرہ وشطر الحدیث ((إن أحدًا جبل یحبنا ونحبہ)) صحیح متفق علیہ (البخاري 4083،مسلم 1393/504)`;
ibnemaja.anwaar = [487,2];