var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ حَفْصٍ الْأُبُلِّيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ،عَنْ حَمْزَةَ بْنِ حَبِيبٍ الزَّيَّاتِ،عَنْ حُمْرَانَ بْنِ أَعْيَنَ،عَنْ أَبِي الطُّفَيْلِ،عَنْ أَبِي سَعِيدٍ،قَالَ: حَجَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ مُشَاةً مِنَ الْمَدِينَةِ،إِلَى مَكَّةَ وَقَالَ: «ارْبُطُوا أَوْسَاطَكُمْ،بِأُزُرِكُمْ،وَمَشَى خِلْطَ الْهَرْوَلَةِ»";
ibnemaja.urdu = "حضرت ابو سعید ؓسےروایت ہے،انہوں نے فرمایا: نبی ﷺ اور آپ کے صحابہ کرام نےمدینہ سے مکہ تک پیدل چل کر حج کیا۔آپ نے فرمایا: ’’اپنی کمروں پر تہبند اچھی طرح باندھ لو۔(کمریں کس لو۔‘‘) اور رسول اللہ ﷺ ایسی رفتار سے چلے جس میں کچھ دوڑنا بھی شامل تھا (اتنی تیزی سے چلے کہ دوڑنے کے قریب ہوگئے)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حمران بن أعین: ضعیف رمي بالرفض (تقریب: 1514) <br>ومن أجلہ ضعفہ البوصیري والصواب معہ دون الحاکم والذہبي (442/1)`;
ibnemaja.anwaar = [488,1];