var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ وَعَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَطَابَ أَحَدُكُمْ فَلَا يَسْتَطِبْ بِيَمِينِهِ لِيَسْتَنْجِ بِشِمَالِهِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’تم میں سے کوئی شخص جب استنجا کرے تو دائیں ہاتھ سے استنجا نہ کرے،اسے اپنے بائیں ہاتھ سے استنجا کرنا چاہیے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;