var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَيَّاشٍ،عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ لَهُ سَعَةٌ،وَلَمْ يُضَحِّ،فَلَا يَقْرَبَنَّ مُصَلَّانَا»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسو ل اللہ ﷺ نے فرمایا:جسکے پاس (قربانی کرنے کی)گنجائش ہو اور وہ قربانی نہ کرے تو اسے چاہیے کہ ہماری عید گاہ کے قریب بھی نہ آئے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;