var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ،قَالَ: «ضَحَّى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،بِكَبْشٍ أَقْرَنَ فَحِيلٍ،يَأْكُلُ فِي سَوَادٍ،وَيَمْشِي فِي سَوَادٍ،وَيَنْظُرُ فِي سَوَادٍ»";
ibnemaja.urdu = "حضرت ابو سعید ؓ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے سینگوں والے نر مینڈھے کی قربانی دی۔وہ سیاہی کھاتا،سیاہی میں چلتا اور سیاہی میں دیکھتا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `سندہ ضعیف <br>سنن أبي داود (2796) ترمذي (1496) نسائي (4395)<br>`;
ibnemaja.anwaar = [535,1];