var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا أَبُو عَائِذٍ،أَنَّهُ سَمِعَ سُلَيْمَ بْنَ عَامِرٍ،يُحَدِّثُ عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خَيْرُ الْكَفَنِ الْحُلَّةُ،وَخَيْرُ الضَّحَايَا،الْكَبْشُ الْأَقْرَنُ»";
ibnemaja.urdu = "حضرت ابو امامہ باہلی ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بہترین کفن وہ ہے جو ایک رنگ کی دو چادروں پر مشتمل ہو اور بہترین قربانی سینگوں والا مینڈھا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1517) ابن ماجہ (3128)`;
ibnemaja.anwaar = [489,1];