var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ قَالَ: أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى قَالَ: أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ،عَنْ عِلْبَاءَ بْنِ أَحْمَرَ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ،فَحَضَرَ الْأَضْحَى،فَاشْتَرَكْنَا فِي الْجَزُورِ،عَنْ عَشَرَةٍ،وَالْبَقَرَةِ،عَنْ سَبْعَةٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے،انہوں نے فرمایا: ہم لوگ ایک سفر میں رسول اللہ ﷺ کے ہمراہ تھے کہ عیدالاضحی آگئی،چنانچہ ہم نے دس دس آدمیوں کی طرف سے ایک ایک اونٹ اور سات سات آجمیوں کی طرف سےایک ایک گائے مشترکہ طور پر ذبح کی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;