var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَالِكِ بْنِ أَنَسٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: «نَحَرْنَا بِالْحُدَيْبِيَةِ،مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،الْبَدَنَةَ،عَنْ سَبْعَةٍ،وَالْبَقَرَةَ،عَنْ سَبْعَةٍ»";
ibnemaja.urdu = "حضرت جابر ؓ سے روایت ہے،انہوں نے فرمایا: ہم نے حدیبیہ میں نبی ﷺ کے ہمراہ ایک اونٹ سات افراد کی طرف سے ارو ایک گائے سات افراد کی طرف سے ذبح کی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;