var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ قَالَ: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ عَمْرِو بْنِ مَيْمُونٍ،عَنْ أَبِي حَاضِرٍ الْأَزْدِيِّ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «قَلَّتِ الْإِبِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَأَمَرَهُمْ،أَنْ يَنْحَرُوا الْبَقَرَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس ؓ سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ کےزمانے میں (ایک بار)اونٹوں کی قلت ہوگئی تو رسول اللہ ﷺ نے گایوں کو قربان کرنے کا حکم دیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;