var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ أَبُو طَاهِرٍ قَالَ: أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ: أَنْبَأَنَا يُونُسُ،عَنِ ابْنِ شِهَابٍ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَحَرَ عَنْ آلِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بَقَرَةً وَاحِدَةً»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہےکہ رسول اللہ ﷺ نے حجۃ الوداع میں آل محمد ﷺ کی طرف سے ایک گائے ذبح کی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;