var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ،قَالَ: قَالَ عَطَاءٌ الْخُرَاسَانِيُّ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَتَاهُ رَجُلٌ فَقَالَ: إِنَّ عَلَيَّ بَدَنَةً،وَأَنَا مُوسِرٌ بِهَا،وَلَا أَجِدُهَا،فَأَشْتَرِيَهَا «فَأَمَرَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبْتَاعَ،سَبْعَ شِيَاهٍ،فَيَذْبَحَهُنَّ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس ؓ سے روایت ہے کہ ایک آدمی نے نبی ﷺ کی خدمت میں حاضر ہو کر عرض کیا: میرے ذمے ایک اونٹ ہے (میں نے اسے ذبح کرنے کی نذرمانی ہے) اورمیں (مالی طور پر) اسکی طاقت بھی رکھتا ہوں لیکن مجھے وہ ملتا نہیں کہ خرید لوں۔نبی ﷺ نے سے حکم دیا کہ سات بکریاں خرید کر ذبح کردے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عطاء الخراساني عنعن`;
ibnemaja.anwaar = [489,1];