var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ أَبِي الْخَيْرِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا،فَقَسَمَهَا عَلَى أَصْحَابِهِ ضَحَايَا،فَبَقِيَ عَتُودٌ،فَذَكَرَهُ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: «ضَحِّ بِهِ أَنْتَ»";
ibnemaja.urdu = "حضرت عقبہ بن عامر جہنی ؓ سے روایت ہے کہ رسول اللہ ﷺ نے انہیںکچھ بکریاں دیں جو انہوں نے قربانی کے لیے (رسول اللہ ﷺکے حکم سے) صحابہ میں تقسیم کردیں۔(ان کےپاس)بکری کا ایک سالہ بچہ (باقی)رہ گیا۔انہوں نے رسول اللہ ﷺ کو خبر دی تو آپ نے فرمایا:’’اسکی تم قربانی دے دو۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;