var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ قَالَ: حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي يَحْيَى،مَوْلَى الْأَسْلَمِيِّينَ،عَنْ أُمِّهِ،قَالَتْ: حَدَّثَتْنِي أُمُّ بِلَالٍ بِنْتُ هِلَالٍ،عَنْ أَبِيهَا،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَجُوزُ الْجَذَعُ مِنَ الضَّأْنِ،أُضْحِيَّةً»";
ibnemaja.urdu = "حضرت ام ہلال بنت ہلال رحمہ اللہ نے اپنے والد سے روایت کی کہ رسو ل اللہ ﷺ نے فرمایا: ’’بھی. کے جذعہ کی قربانی جائز ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أم محمد والدۃ محمد بن أبي یحیی: مقبولۃ (أي مستورۃ۔مجھولۃ الحال) کما فی التقریب (7869) <br>والحدیث الآتي (الأصل: 3140) یغني عنہ`;
ibnemaja.anwaar = [489,1];