var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ حَيَّانَ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ قَالَ: أَنْبَأَنَا زُهَيْرٌ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَذْبَحُوا،إِلَّا مُسِنَّةً،إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ،فَتَذْبَحُوا جَذَعَةً،مِنَ الضَّأْنِ»";
ibnemaja.urdu = "حضرت جابرؓ سےروایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دودانتے کےسوا کوئی جانور (قربانی میں) ذبح نہ کرو،سوائے اسکے کہ تمہائے لیے (دو دانتاجانور تلاش کرنا)مشکل ہو جائے تو بھیڑ کاجذعہ ذبح کردو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;