var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ أَبِي إِسْحَاقَ،عَنْ شُرَيْحِ بْنِ النُّعْمَانِ،عَنْ عَلِيٍّ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُضَحَّى بِمُقَابَلَةٍ،أَوْ مُدَابَرَةٍ،أَوْ شَرْقَاءَ،أَوْ خَرْقَاءَ،أَوْ جَدْعَاءَ»";
ibnemaja.urdu = "حضرت علیؓ سے روایت ہے،انہوں ے فرمایا: رسول اللہ ﷺ نے اس جانور کو ذبح کرنے سے منع فرمایا ہے جس کا کان آگے سے کٹا ہوا ہو،یا جس کا کان پیچھے سے کٹا ہوا ہو،یا جس کا کان چرا ہو،یاجس کےکام میں (گول) سراخ ہو،یااسکا ہونٹ کٹا ہوا ہو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2804) ترمذي (1498) نسائي (4377۔4380)`;
ibnemaja.anwaar = [489,1];