var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا (عُثمانً) بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ،عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،عَنْ حُجَيَّةَ بْنِ عَدِيٍّ،عَنْ عَلِيٍّ،قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ،وَالْأُذُنَ»";
ibnemaja.urdu = "حضرت علی ؓ سے روایت ہے،انہوں ے فرمایا: ہمیں رسول اللہ ﷺ نےحکم دیا کہ ہم (قربانی کے جانور کی)آنکھیں اورکان اچھی طرح دیکھ لیا کریں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;