var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ: حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،أَنَّهُ ذَكَرَ أَنَّهُ سَمِعَ جُرَيَّ بْنَ كُلَيْبٍ،يُحَدِّثُ أَنَّهُ سَمِعَ عَلِيًّا،يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «نَهَى أَنْ يُضَحَّى بِأَعْضَبِ الْقَرْنِ،وَالْأُذُنِ»";
ibnemaja.urdu = "حضرت علیؓ سے روایت ہے کہ رسول اللہ ﷺ نے اس جانور کی قربانی دینے سےمنع فرمایا جسکا سینگ ٹوٹا ہوا یا کان کٹا ہوا ہو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;