var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ أَبُو بَكْرٍ،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنِ الثَّوْرِيِّ،عَنْ جَابِرِ بْنِ يَزِيدَ،عَنْ مُحَمَّدِ بْنِ قَرَظَةَ الْأَنْصَارِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: ابْتَعْنَا كَبْشًا نُضَحِّي بِهِ،فَأَصَابَ الذِّئْبُ مِنْ أَلْيَتِهِ،أَوْ أُذُنِهِ،فَسَأَلْنَا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «فَأَمَرَنَا،أَنْ نُضَحِّيَ بِهِ»";
ibnemaja.urdu = "حضرت ابو سعید خدریؓ سے روایت ہے،انہوں نے فرمایا: ہم نے قربانی کے لیے ایک مینڈھا خریدا۔بھیڑیا اس کےسرینوں (چوتڑوں) اور کان سے کچھ حصہ کاٹ کر لے گیا۔ہم نے نبی ﷺ سے مسئلہ دریافت کیا توآپ نے ہمیں حکم دیا کہ اس کی قربانی کردیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>وفي روایۃ أحمد (78/3،86) ’’ سمعہ من أبي سعید،محمد ؟ قال: لا ‘‘ وجابر الجعفي: ضعیف مشہور`;
ibnemaja.anwaar = [489,1];