var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أُمِّ سَلَمَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دَخَلَ الْعَشْرُ،وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ،فَلَا يَمَسَّ مِنْ شَعَرِهِ،وَلَا بَشَرِهِ شَيْئًا»";
ibnemaja.urdu = "ام المومنین حضرت ام سلمہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب ذوالحجہ کا (پہلا) عشرہ شروع ہو جائے اور تم میں سے کوئی قربانی کرنے کا ارادہ رکھتا ہو تو اسے چاہیے کہ اپنے بالوں یا اپنی جلد سے کسی چیز کو ہاتھ نہ لگائے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;