var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِي خُزَيْمَةَ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الِاسْتِنْجَاءِ ثَلَاثَةُ أَحْجَارٍ لَيْسَ فِيهَا رَجِيعٌ";
ibnemaja.urdu = "سیدنا خزیمہ بن ثابت رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’استنجا میں تین پتھر(استعمال) ہوتے ہیں،ان میں گوبر،لید نہ ہو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (41)`;
ibnemaja.anwaar = [387,1];