var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ،عَنْ أَيُّوبَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَنَسِ بْنِ مَالِكٍ،«أَنَّ رَجُلًا ذَبَحَ يَوْمَ النَّحْرِ،يَعْنِي قَبْلَ الصَّلَاةِ،» فَأَمَرَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے کہ ایک آدمی نے قربانی کے دن نماز سےپہلے (قربانی کاجانور) ذبح کر دیا۔نبی ﷺ نے اسے حکم دیا کہ وہ دوبارہ (قربانی) کرے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;