var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،قَالَ: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ عَبَّادِ بْنِ تَمِيمٍ،عَنْ عُوَيْمِرِ بْنِ أَشْقَرَ،أَنَّهُ ذَبَحَ قَبْلَ الصَّلَاةِ،فَذَكَرَهُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: «أَعِدْ أُضْحِيَّتَكَ»";
ibnemaja.urdu = "حضرت عویمر بن اشقر سے روایت ہے کہ انہوں نے نماز سے پہلے (قربانی کاجانور)ذبح کرلیا،پھر انہوں نبی ﷺ کو بتایاتو آپ فرمایا:’’دوبارہ قربانی دو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;