var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْبَحُ أُضْحِيَّتَهُ بِيَدِهِ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهَا";
ibnemaja.urdu = "حضرت انس بن مالکؓ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا کہ اپنی قربانی اپنے ہاتھ سے ذبح کررہے تھے اور اپنا قدم مبارک اس کی گردن پر رکھا ہوا تھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;