var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ،مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: حَدَّثَنِي أَبِي،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «ذَبَحَ أُضْحِيَّتَهُ،عِنْدَ طَرَفِ الزُّقَاقِ،طَرِيقِ بَنِي زُرَيْقٍ بِيَدِهِ،بِشَفْرَةٍ»";
ibnemaja.urdu = "رسول اللہﷺ کے مؤذن حضرت سعدؓ سے روایت ہےکہ رسول اللہ ﷺ نےقبیلۂ بنوزریق کے محلے کی طرف جانے والے راستے پر گلی کے کنارے اپنی قربانی اپنے ہاتھ سے چھری کے ساتھ ذبح کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br> عبد الرحمٰن بن سعد: ضعیف`;
ibnemaja.anwaar = [490,1];