var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ قَالَ: أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ: أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ،أَنَّ مُجَاهِدًا،أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى،أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَمَرَهُ أَنْ يَقْسِمَ بُدْنَهُ كُلَّهَا،لُحُومَهَا وَجُلُودَهَا وَجِلَالَهَا،لِلْمَسَاكِينِ»";
ibnemaja.urdu = "حضرت علی بن ابی طالب ؓ سے روایت ہے کہ رسول اللہ ﷺ نےانہیں حکم دیا کہ وہ آپ کے (قربانی کے)تمام اونٹوں کا گوشت،ان کی کھالیں اور جھولیں غریبوں میں تقسیم کردیں۔";
ibnemaja.hukam = "إسنادہ صحیح، متفق علیہ";
ibnemaja.description = ``;