var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،عَنْ أَبِيهِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَمَرَ مِنْ كُلِّ جَزُورٍ بِبَضْعَةٍ،فَجُعِلَتْ فِي قِدْرٍ،فَأَكَلُوا مِنَ اللَّحْمِ،وَحَسَوْا مِنَ الْمَرَقِ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ کے حکم سےہر اونٹ کی ایک ایک بوٹی لے کر ہنڈیا میں ڈالی (اور پکائی گئی۔) تب انہوں نے (رسول اللہ ﷺ اور آپ کے ساتھیوں نے) کچھ گوشت کھایا اور کچھ شوربہ پیا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;