var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: إِنَّمَا «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ لُحُومِ الْأَضَاحِيِّ،لِجَهْدِ النَّاسِ،ثُمَّ رَخَّصَ فِيهَا»";
ibnemaja.urdu = "ام المؤمین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے قربانی کا گوشت سنبھال رکھنے سے لوگوں کے فقر و فاقہ کی وجہ سےمنع فرمایاتھا،پھر اجازت دےدی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;