var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ أَبِي الْمَلِيحِ،عَنْ نُبَيْشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ،فَوْقَ ثَلَاثَةِ أَيَّامٍ،فَكُلُوا،وَادَّخِرُوا»";
ibnemaja.urdu = "حضرت نبیشہ (بن عبداللہ ہذلی)ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:میں نے تم کو قربانی کے گوشت تین دن سے زیادہ رکھنے سے منع کیا تھا۔اب کھاؤ اورذخیرہ کرو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;