var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَهِشَامُ بْنُ عَمَّارٍ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ،عَنْ أَبِيهِ،عَنْ سِبَاعِ بْنِ ثَابِتٍ،عَنْ أُمِّ كُرْزٍ،قَالَتْ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «عَنِ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ،وَعَنِ الْجَارِيَةِ شَاةٌ»";
ibnemaja.urdu = "حضرت ام کرز ؓ سے روایت ہے،انہوں نےفرمایا: میں نے نبی سے سنا،آپ فرمارہے تھے:’’لڑکے کی طرف سے دو ایک جیسی بکریاں اور لڑکی کی طرف سے ایک بکری (عقیقہ کے طور پر ذبح کی جائے۔‘‘)";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;