var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَفَّانُ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ،عَنْ يُوسُفَ بْنِ مَاهَكَ،عَنْ حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ،عَنْ عَائِشَةَ،قَالَتْ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنْ نَعُقَّ عَنِ الْغُلَامِ شَاتَيْنِ،وَعَنِ الْجَارِيَةِ شَاةً»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نےفرمایا: رسول اللہ ﷺ نے ہمیں حکم دیا کہ ہم لڑکے کی طرف سے دو بکریاں اور لڑکی طرف سے ایک بکری عقیقہ کے طور پر ذبح کریں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;