var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ: حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ،عَنْ حَفْصَةَ بِنْتِ سِيرِينَ،عَنْ سَلْمَانَ بْنِ عَامِرٍ،أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ مَعَ الْغُلَامِ عَقِيقَةً،فَأَهْرِيقُوا عَنْهُ دَمًا،وَأَمِيطُوا عَنْهُ الْأَذَى»";
ibnemaja.urdu = "حضرت سلمان بن عامر ؓ سے روایت ہے انہوں نے نبی ﷺ سے سنا،آپ فرما رہے تھے: ’’بچے کے ساتھ عقیقہ ہے،چناچہ اس کی طرف سے خون بہاؤ اور اس کا میل کچیل دور کرو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;