var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ غُلَامٍ مُرْتَهَنٌ بِعَقِيقَتِهِ،تُذْبَحُ عَنْهُ يَوْمَ السَّابِعِ،وَيُحْلَقُ رَأْسُهُ،وَيُسَمَّى»";
ibnemaja.urdu = "حضرت سمرہ ؓ سے روایت ہے،نبی ﷺ نےفرمایا: ہرلڑکا اپنے عقیقے کے بدلےگروی ہے۔ساتویں دن اس کی طرف سے (عقیقے کاجانور)ذبح کیا جائے اور اس کے سر کے بال اتارے جائیں اور اسکا نام رکھا جائے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;