var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ،عَنْ أَيُّوبَ بْنِ مُوسَى،أَنَّهُ حَدَّثَهُ أَنَّ يَزِيدَ بْنَ عَبْدٍ الْمُزَنِيَّ حَدَّثَهُ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يُعَقُّ عَنِ الْغُلَامِ،وَلَا يُمَسُّ رَأْسُهُ بِدَمٍ»";
ibnemaja.urdu = "حضرت یزید بن عبدمزنی سے روایت ہے،نبی ﷺ نے فرمایا:’’لڑکے کی طرف سےعقیقہ کیا جائے،اور اس کے سرکوخون نہ لگا یا جائے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;