var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَهِشَامُ بْنُ عَمَّارٍ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا فَرَعَةَ،وَلَا عَتِيرَةَ» قَالَ هِشَامٌ فِي حَدِيثِهِ: وَالْفَرَعَةُ: أَوَّلُ النَّتَاجِ،وَالْعَتِيرَةُ: الشَّاةُ يَذْبَحُهَا أَهْلُ الْبَيْتِ فِي رَجَبٍ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓسےروایت ہے،نبی ﷺ نے فرمایا: ’’کوئی فرعہ نہیں اور کوئی عتیرہ نہیں۔‘‘\n(ابن ماجہ کےاستاذ)ہشام بن عمار رحمہ اللہ بیان کرتے ہیں:فرعہ (جانور کا) پہلا بچہ ہوتا تھا اور عتیرہ اس بکری کو کہتے تھے جو گھر والے رجب میں ذبح کرتے تھے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;