var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِيهِ،عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا فَرَعَةَ،وَلَا عَتِيرَةَ» قَالَ ابْنُ مَاجَةَ: هَذَا مِنْ فَرَائِدِ الْعَدَنِيِّ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر سےروایت ہے،نبی ﷺ نے فرمایا: ’’کوئی فرعہ نہیں اور کوئی عتیرہ نہیں۔‘‘\nابن ماجہ رحمہ اللہ نے فرمایا: یہ حدیث عدنی کی نادر حدیثوں میں سے ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;