var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيَّ يَقُولُ أَنَا أَوَّلُ مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَبُولَنَّ أَحَدُكُمْ مُسْتَقْبِلَ الْقِبْلَةِ وَأَنَا أَوَّلُ مَنْ حَدَّثَ النَّاسَ بِذَلِكَ";
ibnemaja.urdu = "سیدنا عبداللہ بن حارث بن جزء زبیدی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: سب سے پہلے میں نے ہی رسول اللہ ﷺ کو فرماتے ہوئے سنا:’’تم میں سے کوئی قبلہ کی طرف منہ کر کے پیشاب نہ کرے۔‘‘ اور سب سے پہلے میں نے ہی لوگوں کو یہ حدیث سنائی۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;