var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ،عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ قَالَ: أَخْبَرَنِي أَبِي،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: مَرَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ،وَهُوَ يَجُرُّ شَاةً بِأُذُنِهَا،فَقَالَ: «دَعْ أُذُنَهَا،وَخُذْ بِسَالِفَتِهَا»";
ibnemaja.urdu = "حضرت ابو سعید خدریؓ سے روایت ہے کہ نبی ﷺ نے ایک آدمی کے پاس سےگزرے جو ایک بکری کو کان سے پکڑکر کھنچے لیے جارہا تھا۔آپ نے فرمایا: ’’اسکا کان چھوڑ دے۔گردن سے پکڑ لے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال أبو حاتم الرازي: ’’ ھذہ أحادیث منکرۃ کأنھا موضوعۃ،وموسی(بن محمد بن إبراہیم التیمي): ضعیف الحدیث جدًا و أبوہ …… لم یسمع من جابر ولا أبي سعید ‘‘ (علل الحدیث 241/2 ح 2214) <br>وانظر الحدیث الآتي (3185)`;
ibnemaja.anwaar = [490,1];