var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ،أَنَّ قَوْمًا قَالُوا: يَا رَسُولَ اللَّهِ إِنَّ قَوْمًا يَأْتُونَا بِلَحْمٍ لَا نَدْرِي ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ أَمْ لَا؟ قَالَ: «سَمُّوا أَنْتُمْ وَكُلُوا» وَكَانُوا حَدِيثَ عَهْدٍ بِالْكُفْرِ";
ibnemaja.urdu = "ام المؤمنین سیدہ عائشہؓ سے روایت ہے کہ بعض افراد نے عرض کیا: اے اللہ کے رسول! کھ لوگ ہمارے پاس گوشت لے کر آتے ہیں،ہمیں معلوم نہیں ہوتا کہ (ذبح کرے وقت) اس پر اللہ کا نام لیا گیا ہے یا نہیں (تو ہم کیا کریں)؟ آپ نے فرمایا: ’’تم اللہ کانام لے لو اور کھالو۔‘‘ یہ لوگ نئے نئے کفر سے اسلام میں داخل ہوئے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;