var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ عَاصِمٍ،عَنِ الشَّعْبِيِّ،عَنْ مُحَمَّدِ بْنِ صَيْفِيٍّ،قَالَ: ذَبَحْتُ أَرْنَبَيْنِ بِمَرْوَةٍ،فَأَتَيْتُ بِهِمَا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«فَأَمَرَنِي بِأَكْلِهِمَا»";
ibnemaja.urdu = "حضرت محمد بن مصطفی ؓ سے روایت ہے،انہوں نےفرمایا: میں نے دوخرگوش پتھر سے ذبح کیے او رانہیں لے کر نبی ﷺ کی خدمت میں حاضر ہوگیا تو آپ نےمجھے ان کو کھالینے کا حکم دیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;