var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا غُنْدَرٌ قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: سَمِعْتُ حَاضِرَ بْنَ مُهَاجِرٍ،يُحَدِّثُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ زَيْدِ بْنِ ثَابِتٍ،أَنَّ ذِئْبًا نَيَّبَ فِي شَاةٍ،فَذَبَحُوهَا بِمَرْوَةٍ «فَرَخَّصَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي أَكْلِهَا»";
ibnemaja.urdu = "حضرت زید بن ثابت ؓ روایت ہے کہ کسی بھیڑیے نے ایک بکری میں دانت گاڑدیے (اور اسے زخمی کردیا) تو مالکوں نے اسے پتھرسےذبح کرلیا۔رسول اللہ ﷺ نے انہیں اسے کھا لینے کی اجازت دے دی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;