var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ مُرِّيِّ بْنِ قَطَرِيٍّ،عَنْ عَدِيِّ ابْنِ حَاتِمٍ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا نَصِيدُ الصَّيْدَ،فَلَا نَجِدُ سِكِّينًا،إِلَّا الظِّرَارَةَ،وَشِقَّةَ الْعَصَا،قَالَ: «أَمْرِرِ الدَّمَ بِمَا شِئْتَ،وَاذْكُرِ اسْمَ اللَّهِ عَلَيْهِ»";
ibnemaja.urdu = "حضرت عدی بن حاتم طائیؓ سے روایت ہے کہ انہوں نے کہا: میں نے عرض کیا: اے اللہ کے رسول! ہم لوگ شکار کرتے ہیں (بعض اوقات) ہمیں ذبح کرنے لیے)تیز پتھر یا ڈنڈے کی کھنچی کے سوا کچہ نہیں ملتا۔رسول اللہ ﷺ نے فرمایا:’’جس چیز کے ساتھ چاہو مرضی خون بہالو،اور اس پر (ذبح کرتے وقت) اللہ کانام لو۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;