var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَقْبِلَ الَّذِي يَذْهَبُ إِلَى الْغَائِطِ الْقِبْلَةَ وَقَالَ شَرِّقُوا أَوْ غَرِّبُوا";
ibnemaja.urdu = "سیدنا ابو ایوب انصاری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے قضائے حاجت کے لئے جانے والے کو قبلہ کی طرف منہ کرنے سے منع کیا اور فرمایا:’’مشرق یا مغرب کی طرف منہ کیا کرو۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;