var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ قَالَ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ،عَنْ أَبِيهِ،أَنَّ امْرَأَةً ذَبَحَتْ شَاةً بِحَجَرٍ،فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «فَلَمْ يَرَ،بِهِ بَأْسًا»";
ibnemaja.urdu = "حضرت کعب بن مالک ؓ سے روایت ہے کہ ایک عورت نے پتھر کے ساتھ بکری ذبح کرلی۔یہ بات رسول اللہ ﷺ کی خدمت میں عرض کی گئی تو آپ نے اس میں کوئی حرج نہیں سمجھا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;