var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ أَبِي الْعُشَرَاءِ،عَنْ أَبِيهِ،قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ مَا تَكُونُ الذَّكَاةُ،إِلَّا فِي الْحَلْقِ،وَاللَّبَّةِ قَالَ: «لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَكَ»";
ibnemaja.urdu = "حضرت ابو العشراء (اسامہ بن مالک) رحمہ اللہ اپنے والد (مالک بن قبطم) سے روایت کرتے ہیں کہ انہوں نے فرمایا: اے اللہ کے رسول! کیا ذبح صرف حلق اور گردن ہی سے ہوتا ہے؟ آپ نے فرمایا:’’اگر تو اس کی ران میں نیزہ مار دے،تب بھی حلق کافی ہو گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2825) ترمذي (1481) نسائي (4413)`;
ibnemaja.anwaar = [490,1];