var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،قَالَا حَدَّثَنَا سُفْيَانُ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَتَّخِذُوا شَيْئًا،فِيهِ الرُّوحُ،غَرَضًا»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سےروایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس چیز میں روح موجود ہو،اسے (مشق کے لیے تیروں وغیرہ کا) نشانہ نہ بناؤ۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;