var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ: أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ: حَدَّثَنَا أَبُو الزُّبَيْرِ،أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْتَلَ شَيْءٌ مِنَ الدَّوَابِّ،صَبْرًا";
ibnemaja.urdu = "حضرت جابر بن عبداللہ ؓ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ نے اس بات سے منع فرمایا کہ کسی جانور کو باندھ کر قتل کیا جائے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;