var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنِ ابْنِ أَبِي نَجِيحٍ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عُمَرَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ لُحُومِ الْجَلَّالَةِ،وَأَلْبَانِهَا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے نجاست کھانے والے جانور کےگوشت اور دودھ سےمنع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>سنن أبي داود (3185) ترمذي (1824)`;
ibnemaja.anwaar = [490,2];