var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى الْمَازِنِيُّ عَنْ أَبِي زَيْدٍ مَوْلَى الثَّعْلَبِيِّينَ عَنْ مَعْقِلِ بْنِ أَبِي مَعْقِلٍ الْأَسَدِيِّ وَقَدْ صَحِبَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَقْبِلَ الْقِبْلَتَيْنِ بِغَائِطٍ أَوْ بَوْلٍ";
ibnemaja.urdu = "سیدنا معقل بن ابو معقل اسدی رضی اللہ عنہ سے روایت ہے جو نبی ﷺ کے صحابی ہیں،انہوں نے فرمایا: رسول اللہ ﷺ نے پاخانہ پیشاب کرتے وقت دونوں قبلوں(کعبہ اور بیت المقدس) کی طرف منہ کرنے سے ہمیں منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (10)`;
ibnemaja.anwaar = [387,1];