var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ،عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ،قَالَتْ: «نَحَرْنَا فَرَسًا،فَأَكَلْنَا مِنْ لَحْمِهِ،عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
ibnemaja.urdu = "حضرت اسماء بنت ابی بکر رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ کےزمانے میں ہم نے اپنا گھوڑا ذبح کرکے اس کا گوشت کھایا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;