var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ قَالَ: حَدَّثَنِي الْحَسَنُ بْنُ جَابِرٍ،عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ الْكِنْدِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «حَرَّمَ أَشْيَاءَ،حَتَّى ذَكَرَ الْحُمُرَ الْإِنْسِيَّةَ»";
ibnemaja.urdu = "حضرت مقدام بن معدی کرب کندی ؓ سے روایت ہے کہ رسول اللہ ﷺ نے متعدد اشیاء کی حرمت بیان فرمائی حتی کہ پالتو گدھوں کا بھی ذکر فرمایا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;