var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ عَاصِمٍ،عَنِ الشَّعْبِيِّ،عَنِ الْبَرَاءِ بْنِ عَازِبٍ،قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نُلْقِيَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ،نِيئَةً،وَنَضِيجَةً،ثُمَّ لَمْ يَأْمُرْنَا بِهِ بَعْدُ»";
ibnemaja.urdu = "حضرت براء بن عازبؓ سے روایت ہے،انہوں نےفرمایا: رسول اللہ ﷺ نے ہیمں پالتو گدھوں کا کچا اور پکا ہوا (دونوں طرح کا) گوشت پھینک دینے کا حکم دیا،پھر اس کے بعد (کبھی) اس (کو کھانے) کا حکم نہیں دیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;