var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنْ أَيُّوبَ،عَنِ ابْنِ سِيرِينَ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ مُنَادِيَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: نَادَى «إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ،فَإِنَّهَا رِجْسٌ»";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے کہ نبی ﷺ کے اعلان کرنے والے نے اعلان کیا: اللہ تعالی اور اللہ کے رسول ﷺ تمہیں پالتو گدھوں کے گوشت (کے کھانے) سے منع کرتے ہیں کیونکہ وہ ناپاک ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;