var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ عَلَيَّ حَسِبْتُهُ قَالَ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ";
ibnemaja.urdu = "روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘جس نے مجھ پر جھوٹ بولا۔۔۔۔میرا گمان ہے آپ نے یہ بھی فرمایا: جان بوجھ کر۔۔۔تو اسے چاہیئے کہ(جہنم کی) آگ میں اپنا ٹھکانا بنالے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;