var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ،أَنَّهُ شَهِدَ عَلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ «نَهَى أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِغَائِطٍ أَوْ بَوْلٍ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے رسول اللہ ﷺ کے بارے میں گواہی دی کہ آپ ﷺ نے پیشاب یا پاخانہ کے وقت قبلہ کی طرف منہ کرنے سے منع فرمایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;