var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا شَبَابَةُ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي التَّيَّاحِ،قَالَ: سَمِعْتُ مُطَرِّفًا،يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَمَرَ بِقَتْلِ الْكِلَابِ» ثُمَّ قَالَ: «مَا لَهُمْ،وَلِلْكِلَابِ؟» ثُمَّ رَخَّصَ لَهُمْ فِي كَلْبِ الصَّيْدِ";
ibnemaja.urdu = "حضرت عبد اللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے کتوں کو قتل کرنے کا حکم دیا،پھر فرمایا: ’’ان لوگوں کو کتوں سے کیا تعلق؟‘‘ پھر (بعد میں) شکاری کتا رکھنے کی اجازت دے دی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;