var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو طَاهِرٍ قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي يُونُسُ،عَنِ ابْنِ شِهَابٍ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: رَافِعًا صَوْتَهُ،«يَأْمُرُ بِقَتْلِ الْكِلَابِ،وَكَانَتِ الْكِلَابُ،تُقْتَلُ،إِلَّا كَلْبَ صَيْدٍ،أَوْ مَاشِيَةٍ»";
ibnemaja.urdu = "حضرت ابن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہﷺ کو بلند آواز کے ساتھ کتوں کے قتل کرنے کا حکم دیتے ہوئے سنا،چنانچہ شکار یا مویشیوں کے کتے کے سوا تمام کتے قتل کر دیے جاتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;