var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ: حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَنَى كَلْبًا،فَإِنَّهُ يَنْقُصُ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ،إِلَّا كَلْبَ حَرْثٍ أَوْ مَاشِيَةٍ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سےروایات ہے رسول اللہﷺ نے فرمایا: ’’جس نے کتا رکھا،اس کے عملوں سے روزانہ ایک قیراط ثواب کم ہو جائے گا۔سوائے اس کے کہ کھیتی یا مویشیوں (کی حفاظت) کا کتا ہو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;