var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ شَرِيكٍ،عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،عَنِ الْقَاسِمِ بْنِ أَبِي بَزَّةَ،عَنْ سُلَيْمَانَ الْيَشْكُرِيِّ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: «نُهِينَا عَنْ صَيْدِ كَلْبِهِمْ،وَطَائِرِهِمْ،يَعْنِي الْمَجُوسَ»";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ رضی اللہ عنہما سے روایت ہے،نہوں نے فرمایا: ہمیں ان،یعنی مجوسیوں کے کتے اور پرندے کے کیے ہوئے شکار سے منع کیا گیا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1466)`;
ibnemaja.anwaar = [491,1];