var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ،عَنْ حُمَيْدِ بْنِ هِلَالٍ،عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ،عَنْ أَبِي ذَرٍّ،قَالَ: سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْكَلْبِ الْأَسْوَدِ الْبَهِيمِ،فَقَالَ: «شَيْطَانٌ»";
ibnemaja.urdu = "حضرت ابو ذر رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہﷺ سے کالے سیاہ کتے کے بارے میں پوچھا تو آپ نے فرمایا: ’’وہ شیطان ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;