var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عُمَيْرٍ عِيسَى بْنُ مُحَمَّدٍ النَّحَّاسُ،وَعِيسَى بْنُ يُونُسَ الرَّمْلِيُّ،قَالَا: حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ،عَنِ الْأَوْزَاعِيِّ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلْ مَا رَدَّتْ،عَلَيْكَ قَوْسُكَ»";
ibnemaja.urdu = "حضرت ابو ثعلبہ خشنی رضی اللہ عنہ سے روایت ہے نبیﷺ نے فرمایا: ’’جو شکار کمان کے ذریعے سے حاصل ہو وہ کھالے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;