var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ: حَدَّثَنَا مُجَالِدُ بْنُ سَعِيدٍ،عَنْ عَامِرٍ،عَنْ عَدِيِّ ابْنِ حَاتِمٍ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا قَوْمٌ نَرْمِي،قَالَ: «إِذَا رَمَيْتَ وَخَزَقْتَ،فَكُلْ مَا خَزَقْتَ»";
ibnemaja.urdu = "حضرت عدی بن حاتم (طائی) رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے کہا: اے اللہ کے رسول! ہم لوگ تیر چلاتے ہیں (شکار کے عادی ہیں) رسول اللہﷺ نے فرمایا: ’’جب تو تیر چلا کر پھاڑ ڈالے تو جسے تو نے پھاڑ ا ہے،اسے کھالے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;