var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنْ عَاصِمٍ،عَنِ الشَّعْبِيِّ،عَنْ عَدِيِّ بْنِ حَاتِمٍ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ،فَيَغِيبُ عَنِّي لَيْلَةً؟ قَالَ: «إِذَا وَجَدْتَ فِيهِ سَهْمَكَ،وَلَمْ تَجِدْ فِيهِ شَيْئًا غَيْرَهُ،فَكُلْهُ»";
ibnemaja.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے عرض کیا: اے اللہ کے رسولﷺ! میں شکار پر تیر چلاتا ہوں،وہ رات بھر مجھ سے غائب رہتا ہے۔(اگلے دن ملتا ہے تو اس کا کیا حکم ہے؟) آپ نے فرمایا: ’’جب تجھے اس میں اپنا تیر لگا ہوا ملے اور اس میں تجھے اس کے سوا کچھ اور نہ ملے تو کھالے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;