var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا وَكِيعٌ،ح وحَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،قَالَا: حَدَّثَنَا زَكَرِيَّا بْنُ أَبِي زَائِدَةَ،عَنْ عَامِرٍ،عَنْ عَدِيِّ بْنِ حَاتِمٍ،قَالَ: سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الصَّيْدِ بِالْمِعْرَاضِ قَالَ: «مَا أَصَبْتَ بِحَدِّهِ،فَكُلْ،وَمَا أَصَبْتَ بِعَرْضِهِ،فَهُوَ وَقِيذٌ»";
ibnemaja.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہﷺ سے معراض سے کیے ہوئے شکار کے بارے میں دریافت کیا تو آپ نے فرمایا: ’’جو اس کی نوک سے مرے،وہ کھا لے،اور جو اس کے چوڑائی کے رخ لگنے سے مرے،اسے نہ کھا،کیونکہ وہ چوٹ سے مرا ہوا جانور ہے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;