var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ أَبِيهِ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ،عَنْ هَمَّامِ بْنِ الْحَارِثِ النَّخَعِيِّ،عَنْ عَدِيِّ بْنِ حَاتِمٍ،قَالَ: سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمِعْرَاضِ،فَقَالَ: «لَا تَأْكُلْ،إِلَّا أَنْ يَخْزِقَ»";
ibnemaja.urdu = "حضرت عدی بن حاتم رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہﷺ سے معراض کے بارے میں دریافت کیا تو آپ نے فرمایا: نہ کھا،سوائے اس کے کہ وہ پھاڑ دے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;