var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا مَعْنُ بْنُ عِيسَى،عَنْ هِشَامِ بْنِ سَعْدٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا قُطِعَ مِنَ الْبَهِيمَةِ وَهِيَ حَيَّةٌ،فَمَا قُطِعَ مِنْهَا،فَهُوَ مَيْتَةٌ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے،نبیﷺ نے فرمیا: ’’اگر جانور سے کچھ کاٹ لیا جائے جب کہ وہ زندہ ہو تو جو کچھ اس کاٹا گیا،وہ مردار ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;