var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ الْهُذَلِيُّ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ تَمِيمٍ الدَّارِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ فِي آخِرِ الزَّمَانِ،قَوْمٌ يَجُبُّونَ أَسْنِمَةَ الْإِبِلِ،وَيَقْطَعُونَ أَذْنَابَ الْغَنَمِ،أَلَا،فَمَا قُطِعَ مِنْ حَيٍّ،فَهُوَ مَيِّتٌ»";
ibnemaja.urdu = "حضرت تمیم داری رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’آخری زمانے میں کچھ لوگ ہوں گےجو اونٹوں کے کوہان کاٹ لیا کریں گے اور بھیڑ بکریوں کی دمیں (مثلا:دنبے کی چکتی) کاٹ لیا کریں گے۔سنو! زندہ کا جو حصہ کاٹا جائے،وہ مردار (کے حکم میں) ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>أبو بکر الہذلي: متروک`;
ibnemaja.anwaar = [491,1];