var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: أُحِلَّتْ لَنَا مَيْتَتَانِ: الْحُوتُ،وَالْجَرَادُ";
ibnemaja.urdu = "حضرت عبد اللہ بن عمررضی اللہ عنہما سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ہمارے لیے دو مری ہوئی چیزیں حلال کر دی گئی ہیں؛ مچھلی اور ٹڈی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>انظر الحدیث الآتي (3314)<br>عبد الرحمٰن بن زید بن أسلم ضعیف <br>وتابعہ أخواہ: أسامۃ وعبد اللّٰہ (السنن الکبری للبیہقي 254/1) وھما ضعیفان وسندہ ضعیف <br>و قال ابن الترکماني في عبد اللّٰہ بن زید بن أسلم: ضعفہ الجمھور (الجوہر النقي 4/ 171) <br>و قال الھیثمي: و ضعفہ الجمھور (185/5) <br>وأخرج البیھقي بإسناد صحیح عن عبد اللّٰہ بن عمر رضي اللّٰہ عنہ قال: ’’ أحلت لنا میتتان ودمان: الجراد والحیتان والکبد والطحال ‘‘ وھذا الأثر لہ حکم الرفع`;
ibnemaja.anwaar = [491,1];