var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ،وَنَصْرُ بْنُ عَلِيٍّ،قَالَا: حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى بْنِ عُمَارَةَ قَالَ: حَدَّثَنَا أَبُو الْعَوَّامِ،عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ،عَنْ سَلْمَانَ،قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْجَرَادِ؟ فَقَالَ: «أَكْثَرُ جُنُودِ اللَّهِ،لَا آكُلُهُ،وَلَا أُحَرِّمُهُ»";
ibnemaja.urdu = "حضرت سلمان رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ سے ٹڈی دل کے بارے میں سولا کیا گیا تو آپ نے فرمایا: ’’یہ اللہ کا سب سے زیادہ تعداد ولا لشکر ہے۔میں اسے نہ کھاتا ہوں،نہ حرام کہتا ہوں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3814)`;
ibnemaja.anwaar = [491,1];