var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي سَعْدٍ الْبَقَّالِ،أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: «كُنَّ أَزْوَاجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَهَادَيْنَ الْجَرَادَ،عَلَى الْأَطْبَاقِ»";
ibnemaja.urdu = "حضر انس بن مالک رضی اللہ عنہ سے روایت ہے،نہوں نے فرمایا: نبیﷺ کی ازواج مطہرات (رضی اللہ عنہنَّ) ایک دوسری کو ٹڈیوں کی پلیٹیں تحفے کے طور پر بھیجا کرتی تھیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو سعد البقال: ضعیف مدلس <br>ولابن عینۃ <br>لون آخر في مصنف عبدالرزاق (533/4 ح 8763)`;
ibnemaja.anwaar = [491,2];