var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ أَبِي الْمُهَزِّمِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةٍ،أَوْ عُمْرَةٍ،فَاسْتَقْبَلَنَا رِجْلٌ مِنْ جَرَادٍ،أَوْ ضَرْبٌ مِنْ جَرَادٍ،فَجَعَلْنَا نَضْرِبُهُنَّ بِأَسْوَاطِنَا،وَنِعَالِنَا،فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُوهُ،فَإِنَّهُ مِنْ صَيْدِ الْبَحْرِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ نبیﷺ کے ہمراہ حج یا عمرے کے لیے روانہ ہوئے۔(راستے میں) ٹڈ کی ایک ٹکڑی سامنے سے آگئی۔ہم انہیں اپنے کوڑوں اور جوتوں سے مارنے لگے تو نبیﷺ نے فرمایا: ’’اسے کھاؤ،یہ بھی سمندر کے شکار میں شامل ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>سنن أبي داود (1854) ترمذي (850)`;
ibnemaja.anwaar = [492,1];