var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَعَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ،قَالَا: حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْفَضْلِ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِ الصُّرَدِ،وَالضِّفْدَعِ،وَالنَّمْلَةِ،وَالْهُدْهُدِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ نے ممولا،مینڈک،چیونٹی اور ہد ہد کے مارنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ضعفہ البوصیري لضعف إبراہیم بن الفضل:متروک`;
ibnemaja.anwaar = [492,1];