var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِ أَرْبَعٍ مِنَ الدَّوَابِّ،النَّمْلَةِ،وَالنَّحْلَةِ،وَالْهُدْهُدِ،وَالصُّرَدِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہﷺ نے چارو جانوروں کو قتل کرنے سے منع فرمایا،چیونٹی،شہد کی مکھی،ہد ہد اور ممولا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (5267)`;
ibnemaja.anwaar = [492,1];