var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عُبَيْدُ بْنُ سَعِيدٍ،ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،قَالَا: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ عُقْبَةَ بْنِ صُهْبَانَ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ،قَالَ: نَهَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْخَذْفِ،وَقَالَ: «إِنَّهَا لَا تَقْتُلُ الصَّيْدَ،وَلَا تَنْكِي الْعَدُوَّ،وَلَكِنَّهَا تَفْقَأُ الْعَيْنَ،وَتَكْسِرُ السِّنَّ»";
ibnemaja.urdu = "حضرت عبد اللہ بن مغفل رضی اللہ عنہ سے روایت ہے،نہوں نے فرمایا: نبیﷺ نے کنکری پھینکنے سے منع کیا اور فرمایا: ’’یہ نہ شکار ماتی ہے،نہ دشمن کو زخمی کرتی ہے لیکن آنکھ پھوڑ دیتی ہے اور دانت توڑ دیتی ہے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;