var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ قَالَ: أَخْبَرَنِي أَبُو إِدْرِيسَ،عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَهَى عَنْ أَكْلِ،كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ» قَالَ الزُّهْرِيُّ: وَلَمْ أَسْمَعْ بِهَذَا،حَتَّى دَخَلْتُ الشَّامَ";
ibnemaja.urdu = "حضرت ثعلبہ خشنی رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے ہر کچلی والے درندے کے کھانے سے منع فرمایا۔\nامام زہری رحمۃ اللہ علیہ بیان کرتے ہیں: میں نےشام میں داخل ہونے تک یہ حدیث نہیں سنی تھی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;