var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،ح وحَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ،وَإِسْحَاقُ بْنُ مَنْصُورٍ،قَالَا: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،قَالَا: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ،عَنْ عَبِيدَةَ بْنِ سُفْيَانَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَكْلُ،كُلِّ ذِي نَابٍ،مِنَ السِّبَاعِ،حَرَامٌ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’ہر کچلی والے درندے کا کھانا حرام ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;