var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ سَعِيدٍ،عَنْ عَلِيِّ بْنِ الْحَكَمِ،عَنْ مَيْمُونِ بْنِ مِهْرَانَ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَوْمَ خَيْبَرَ،عَنْ أَكْلِ،كُلِّ ذِي نَابٍ،مِنَ السِّبَاعِ،وَعَنْ كُلِّ ذِي مِخْلَبٍ،مِنَ الطَّيْرِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ نے جنگ خیبر کے موقع پر ہر کچلی والے درندے اور ہر ناخل دار پنجے (شے شکار کرنے) والے پرندے کو کھانے سے منع فرما دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3805) نسائي (4353)`;
ibnemaja.anwaar = [492,1];