var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَحْيَى بْنُ وَاضِحٍ،عَنِ ابْنِ إِسْحَاقَ،عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ،عَنْ حِبَّانَ بْنِ جَزْءٍ،عَنْ خُزَيْمَةَ بْنِ جَزْءٍ،قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ مَا تَقُولُ فِي الضَّبُعِ؟ قَالَ: «وَمَنْ يَأْكُلُ الضَّبُعَ؟»";
ibnemaja.urdu = "حضرت خزیمہ بن جزء رضی اللہ عنہ سے روایت ہے،نہوں نے فرمایا: میں نے عرض کیا: اے اللہ کے رسول! آپ لگڑ بگڑ کے بارے میں کیا فرماتے ہیں؟ نبیﷺ نے فرمایا: ’’لگڑ بگڑ کو کون کھاتا ہے؟‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث السابق (3235)`;
ibnemaja.anwaar = [492,1];