var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ أُمَيَّةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا أَلْقَى الْبَحْرُ،أَوْ جَزَرَ عَنْهُ،فَكُلُوهُ،وَمَا مَاتَ فِيهِ فَطَفَا،فَلَا تَأْكُلُوهُ»";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ ؓسے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جس چیز کو سمندر باہر پھینک دے،یا پانی اس سے پیچھے ہٹ جائے (اور وہ پانی سے باہر جانے کی وجہ سے مر جائے)،اسے کھالو اور جواس میں مر کر تیر آئے اسے نہ کھاؤ۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3815)`;
ibnemaja.anwaar = [493,1];