var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ النَّيْسَابُورِيُّ قَالَ: حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنِ ابْنِ عُمَرَ،قَالَ: مَنْ يَأْكُلُ الْغُرَابَ؟ وَقَدْ سَمَّاهُ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فَاسِقًا،وَاللَّهِ مَا هُوَ مِنَ الطَّيِّبَاتِ";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: کوے کو کون کھا سکتا ہے جب کہ رسول اللہﷺ نے اس کا نام ’’فاسق‘‘ رکھ دیا ہے؟ اللہ کی قسم! وہ پاک چیزوں میں شامل نہیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;