var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ عَنْ أَبَانَ بْنِ صَالِحٍ عَنْ مُجَاهِدٍ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِبَوْلٍ فَرَأَيْتُهُ قَبْلَ أَنْ يُقْبَضَ بِعَامٍ يَسْتَقْبِلُهَا";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں پیشاب کرتے وقت قبلہ کی طرف منہ کرنے سے منع فرمایا تھا۔پھر میں نے آپ ﷺ کو وفات سے ایک سال پہلے اس طرح منہ کرتے دیکھا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;