var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْأَزْدِيُّ قَالَ: حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،عَنِ ابْنِ جُرَيْجٍ،قَالَ: سُلَيْمَانُ بْنُ مُوسَى قَالَ: حَدَّثَنَا عَنْ نَافِعٍ،أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ،كَانَ يَقُولُ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «أَفْشُوا السَّلَامَ،وَأَطْعِمُوا الطَّعَامَ،وَكُونُوا إِخْوَانًا،كَمَا أَمَرَكُمُ اللَّهُ عَزَّ وَجَلَّ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’سلام عام کرو،کھانا کھلاؤ،اور جس طرح اللہ عزو جل نے تمہیں حکم دیا ہے اس طرح بھائی بھائی بن کر رہو۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;