var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ أَبِي الْخَيْرِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ رَجُلًا،سَأَلَ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: يَا رَسُولَ اللَّهِ أَيُّ الْإِسْلَامِ خَيْرٌ؟ قَالَ: «تُطْعِمُ الطَّعَامَ،وَتَقْرَأُ السَّلَامَ،عَلَى مَنْ عَرَفْتَ،وَمَنْ لَمْ تَعْرِفْ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے،ایک آدمی نے رسول اللہﷺ سے سولا کیا: اے اللہ کے رسو! اسلام کا کون سا عمل بہتر ہے؟ نبیﷺ نے فرمایا: ’’یہ کہ تو کھانا کھلائے اورجسے تو جانتا ہےاسے بھی سلام کرے اور جسے تو نہیں جانتا اسے بھی سلام کرے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;