var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ زِيَادٍ الْأَسَدِيُّ قَالَ: أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ: أَنْبَأَنَا أَبُو الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «طَعَامُ الْوَاحِدِ،يَكْفِي الِاثْنَيْنِ،وَطَعَامُ الِاثْنَيْنِ،يَكْفِي الْأَرْبَعَةَ،وَطَعَامُ الْأَرْبَعَةِ،يَكْفِي الثَّمَانِيَةَ»";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ رضی اللہ عنہما سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ایک آدمی کا کھانا دو کے لیے کافی ہوتا ہے۔دو آدمیوں کا کھان چار افراد کے لیے کافی ہوتا ہے۔اور چار افراد کا کھانا آٹھ افراد کے لیے کافی ہوتا ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;