var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ قَالَ: حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ: حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ قَالَ: حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ،قَهْرَمَانُ آلِ الزُّبَيْرِ قَالَ: سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ،عَنْ أَبِيهِ،عَنْ جَدِّهِ عُمَرَ بْنِ الْخَطَّابِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ طَعَامَ الْوَاحِدِ،يَكْفِي الِاثْنَيْنِ،وَإِنَّ طَعَامَ الِاثْنَيْنِ،يَكْفِي الثَّلَاثَةَ وَالْأَرْبَعَةَ،وَإِنَّ طَعَامَ الْأَرْبَعَةِ،يَكْفِي الْخَمْسَةَ وَالسِّتَّةَ»";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’ایک آدمی کا کھانا دو کے لیے کافی ہوتا ہے اور دو افراد کا کھانا تین اور چار کے لیے کافی ہوتا ہے اور چار آدمیوں کا کھانا پانچ چھ افراد کے لیے کافی ہوتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عمرو بن دینار قھرمان آل الزبیر ضعیف <br>و الحدیث السابق (الأصل: 3255) یغني عنہ`;
ibnemaja.anwaar = [493,1];