var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَفَّانُ،ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،قَالَا: حَدَّثَنَا شُعْبَةُ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ،وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’مومن ایک آنت میں کھاتا ہے اور کافر سات آنتوں میں کھاتا ہے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;