var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «الْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ،وَالْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے،نبیﷺ نے فرمایا: ’’کافر سات آنتوں میں کھاتا ہے اور مومن ایک آنت میں کھاتا ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;