var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ،عَنْ جَدِّهِ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ،وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ»";
ibnemaja.urdu = "حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’مومن ایک آنت میں کھاتا ہے اور کافر سات آنتوں میں کھاتا ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;