var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحَبَّ أَنْ يُكْثِرَ اللَّهُ خَيْرَ بَيْتِهِ،فَلْيَتَوَضَّأْ إِذَا حَضَرَ غَدَاؤُهُ،وَإِذَا رُفِعَ»";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسو اللہﷺ نے فرمایا: ’’جس کو یہ بات پسند ہو کہ اللہ تعالیٰ اس کے گھر میں زیادہ برکت دے،اسے چاہیے کہ جب کھانا پیش کیا جائے اور جب (فارغ ہونے کے بعد) کھانا اٹھایا جائے تو وضو کرے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>کثیر بن سلیم: ضعیف <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [493,1];