var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ،قَالَ: قَالَ لِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا آكُلُ: «سَمِّ اللَّهَ عَزَّ وَجَلَّ»";
ibnemaja.urdu = "حضرت عمر بن ابو سلمہ رضی اللہ عنہما سےر وایت ہے،انہوں نے فرمایا: میں کھانا کھا رہا تھا تو مجھ سے نبیﷺ نے فرمایا: ’’اللہ عزوجل کا نام لے (بسم اللہ پڑھ۔)‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;