var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى التَّوْأَمِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ انْطَلَقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبُولُ فَاتَّبَعَهُ عُمَرُ بِمَاءٍ فَقَالَ مَا هَذَا يَا عُمَرُ قَالَ مَاءٌ قَالَ مَا أُمِرْتُ كُلَّمَا بُلْتُ أَنْ أَتَوَضَّأَ وَلَوْ فَعَلْتُ لَكَانَتْ سُنَّةً";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ پیشاب کے لئے(باہر) تشریف لے گئے۔سیدنا عمر رضی اللہ عنہ پانی لے کر آپ کے پیچھے چلے تو آپ نے فرمایا:’’عمر یہ کیا ہے؟‘‘ انہوں نے کہا پانی۔آپ نے فرمایا:’’مجھے یہ حکم نہیں دیا گیا کہ جب بھی پیشاب کروں،تو وضو کروں۔اگر میں ایسا کروں گا تو یہ(لازمی) سنت بن جائے گی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (42)`;
ibnemaja.anwaar = [388,1];