var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَ: أَنْبَأَنَا أَبُو دَاوُدَ الْحَفَرِيُّ،عَنْ سُفْيَانَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَمْسَحْ أَحَدُكُمْ يَدَهُ حَتَّى يَلْعَقَهَا،فَإِنَّهُ لَا يَدْرِي فِي أَيِّ طَعَامِهِ الْبَرَكَةُ»";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’کوئی شخص اپنا ہاتھ نہ پونچھے جب تک اسے چاٹ نہ لے کیونکہ اسے معلوم نہیں کہ کھانے کے کس حصے میں برکت ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;