var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ: أَنْبَأَنَا أَبُو الْيَمَانِ الْبَرَّاءُ،قَالَ: حَدَّثَتْنِي جَدَّتِي أُمُّ عَاصِمٍ،قَالَتْ: دَخَلَ عَلَيْنَا نُبَيْشَةُ،مَوْلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَنَحْنُ نَأْكُلُ فِي قَصْعَةٍ،فَقَالَ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَكَلَ فِي قَصْعَةٍ،فَلَحِسَهَا،اسْتَغْفَرَتْ لَهُ الْقَصْعَةُ»";
ibnemaja.urdu = "حضر ام عاص م رضی اللہ عنہا سے روایت ہے،انہوں نے کہا: رسول اللہﷺ کے آزاد کردہ حضرت نبیثہ بن عبد اللہ رضی اللہ عنہ ہمارے ہاں تشریف لائے جب کہ ہم ایک پیالے میں کھانا کھارہے تھے۔انہوں نے کہا: نبیﷺ نے فرمایا: ’’جو شخص پیالے میں کھانا کھائے،پھر اس(پیالے) کو چاٹ لےتو پیالہ اس کے لیے مغفرت کی دعا کرتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `[3271۔3272] إسنادہ ضعیف<br>ترمذي (1804)`;
ibnemaja.anwaar = [493,1];