var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَتِ الْمَائِدَةُ،فَلْيَأْكُلْ مِمَّا يَلِيهِ،وَلَا يَتَنَاوَلْ مِنْ بَيْنِ يَدَيْ جَلِيسِهِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جب دستر خوان پر کھانا لگا دیا جائے تو آدمی کو اپنے سامنے سے کھانا چاہیے،اپنےساتھی کے آگے سے نہ کھائے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث الآتي (3295)<br>عبد الأعلی بن أعین: ضعیف (تقریب: 3729)`;
ibnemaja.anwaar = [493,1];