var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ قَالَ: حَدَّثَنَا أَبِي قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عِرْقٍ الْيَحْصَبِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُسْرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أُتِيَ بِقَصْعَةٍ،فَقَالَ: رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا مِنْ جَوَانِبِهَا،وَدَعُوا ذُرْوَتَهَا،يُبَارَكْ فِيهَا»";
ibnemaja.urdu = "حضرت عبد اللہ بن بسر رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ کی خدمت میں ایک پیالہ پیش کیا گیا تو رسول اللہﷺ نے فرمایا: ’’اس کے کناروں سے کھاؤ۔اس کی چوٹی چھوڑ دو،اس میں برکت ڈالی جائے گی۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;