var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا أَبُو حَفْصٍ عُمَرُ بْنُ الدَّرَفْسِ قَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي قَسِيمَةَ،عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ اللَّيْثِيِّ،قَالَ: أَخَذَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِرَأْسِ الثَّرِيدِ،فَقَالَ: «كُلُوا بِسْمِ اللَّهِ مِنْ حَوَالَيْهَا،وَاعْفُوا رَأْسَهَا،فَإِنَّ الْبَرَكَةَ،تَأْتِيهَا مِنْ فَوْقِهَا»";
ibnemaja.urdu = "حضرت واثلہ بن اسقع لیثی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ نے ثرید کی چوٹی پر ہاتھ رکھ کر فرمایا: ’’اللہ کا نام لے کر اس کے کناروں سے کھاؤ اور اس کا اونچا(درمیان) حصہ رہنے دو (بعد میں کھانا) کیونکہ اس میں برکت اور سے آتی ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;