var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ: حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَ الطَّعَامُ،فَخُذُوا مِنْ حَافَتِهِ،وَذَرُوا وَسَطَهُ،فَإِنَّ الْبَرَكَةَ،تَنْزِلُ فِي وَسَطِهِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جب کھانا رکھا جائے تو اس کے کنارے سے لواور اس کا درمیان چھوڑ دو کیونکہ برکت اس کے وسط میں نازل ہوتی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;