var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وَقَعَتِ اللُّقْمَةُ مِنْ يَدِ أَحَدِكُمْ،فَلْيَمْسَحْ مَا عَلَيْهَا مِنَ الْأَذَى،وَلْيَأْكُلْهَا»";
ibnemaja.urdu = "حضرت جابررضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جب تم میں سے کسی کےہاتھ سے لقمہ گر پڑے تو وہ اس پر لگے گرد و غبار کو صاف کرے اور اسے کھالے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;