var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَنْبَأَنَا مُسْلِمُ بْنُ خَالِدٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ،أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ،كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’عورتوں پر عائشہ رضی اللہ عنہا کی فضلیت ایسے ہی ہے،جیسے دوسرے کھانوں پر ثرید کی فضیلت ہوتی ہے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;