var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ حَجَّاجٍ،عَنْ رِيَاحِ بْنِ عَبِيدَةَ،عَنْ مَوْلًى لِأَبِي سَعِيدٍ،عَنْ أَبِي سَعِيدٍ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِذَا أَكَلَ طَعَامًا قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا،وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ»";
ibnemaja.urdu = "حضرت ابو سعید رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ جب کھانا کھاتے تھے تو فرماتے تھے: [الحمد للہ الّذی أطعمنا وسقانا وجعلنا مسلمین] ’’اللہ کا شکر ہے جس نے ہمیں کھلایا،پلایا اور ہمیں مسلمان بنایا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3457)`;
ibnemaja.anwaar = [494,1];