var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَدَاوُدُ بْنُ رُشَيْدٍ،وَمُحَمَّدُ بْنُ الصَّبَّاحِ،قَالُوا: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا وَحْشِيُّ بْنُ حَرْبِ بْنِ وَحْشِيِّ بْنِ حَرْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ وَحْشِيٍّ،أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ إِنَّا نَأْكُلُ،وَلَا نَشْبَعُ،قَالَ: «فَلَعَلَّكُمْ تَأْكُلُونَ مُتَفَرِّقِينَ؟» قَالُوا: نَعَمْ،قَالَ: «فَاجْتَمِعُوا عَلَى طَعَامِكُمْ،وَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهِ،يُبَارَكْ لَكُمْ فِيهِ»";
ibnemaja.urdu = "حضرت وحشی بن حرب رضی اللہ عنہ سے روایت ہے،صحابہ رضی اللہ عنہم نے عرض کیا: اے اللہ کے رسول! ہم کھانا کھاتے ہیں تو سیر نہیں ہوتے۔آپ نے فرمایا: ’’شاید تم لوگ الگ الگ کھاتے ہو؟‘‘ انہوں نے کہا: جی ہاں۔آپؐ نے فرمایا: ’’مل کر کھانا کھایا کرو اور اس پر اللہ کا نام لو،تمہارے لیے اس میں برکت ہو جائے گی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3764)`;
ibnemaja.anwaar = [494,1];