var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ قَالَ: حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ: حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ قَالَ: حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ،قَهْرَمَانُ آلِ الزُّبَيْرِ قَالَ: سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: سَمِعْتُ أَبِي،يَقُولُ،سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا جَمِيعًا،وَلَا تَفَرَّقُوا،فَإِنَّ الْبَرَكَةَ مَعَ الْجَمَاعَةِ»";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سےروایت ہے،رسول اللہﷺ نے فرمایا: ’’مل کر کھاؤ،الگ الگ نہ کھاؤ،کیونکہ برکت جماعت (اور اجتماعیت) کے ساتھ ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث السابق (3255)`;
ibnemaja.anwaar = [494,1];