var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ عَبْدِ الرَّحْمَنِ الْمُحَارِبِيُّ قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ عَبْدِ الْكَرِيمِ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَنْفُخُ فِي طَعَامٍ،وَلَا شَرَابٍ،وَلَا يَتَنَفَّسُ فِي الْإِنَاءِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہﷺ کھانے پیبے کی چیز میں پھونک نہیں مارتے تھے اور برتن میں سانس نہیں لیتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>شریک بن عبد اللّٰہ القاضي عنعن <br>و رواہ أبو داود (3728) والحمیدي (526) من طریق آخر عن عبدالکریم الجزري بہ بلفظ: ’’ نھی رسول اللّٰہ ﷺ أن یتنفس فی الإناء أو ینفخ فیہ ‘‘ و سندہ صحیح وھو یغني عنہ`;
ibnemaja.anwaar = [494,1];