var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا أَبِي قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ،عَنْ أَبِيهِ قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا جَاءَ أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ،فَلْيُجْلِسْهُ،فَلْيَأْكُلْ مَعَهُ،فَإِنْ أَبِي،فَلْيُنَاوِلْهُ مِنْهُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جب کسی کے پاس اس کا خادم اس کا کھانا لے کر آئے تو اسے چاہیے کہ اسے اپنےساتھ بٹھائے اور وہ (خادم) اس (مالک) کے ساتھ کھائے۔۔اگر ایسے نہیں کر سکتا تو اسے اس میں سے کچھ (کھانا) دے دے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;