var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ عَنْ زُهَيْرٍ قَالَ قَالَ سَالِمٌ سَمِعْتُ الْحَسَنَ يَقُولُ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّاكُمْ وَالتَّعْرِيسَ عَلَى جَوَادِّ الطَّرِيقِ وَالصَّلَاةَ عَلَيْهَا فَإِنَّهَا مَأْوَى الْحَيَّاتِ وَالسِّبَاعِ وَقَضَاءَ الْحَاجَةِ عَلَيْهَا فَإِنَّهَا مِنْ الْمَلَاعِنِ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’راستے کے درمیان (رات کو آرام کرنے اور سونے کے لیے نہ ٹھہراؤ اور وہاں نماز نہ پڑھو کیوں یہ سانپوں اور درندوں کا ٹھکانا ہے،اور وہاں قضائے حاجت نہ کرو کیوں کہ یہ لعنت کا باعث ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>عمرو بن أبي سلمۃ الشامي یروي عن زہیر بن محمد أحادیث مناکیر (انظر ضعیف سنن الترمذي: 296 وضعیف سنن أبي داود: 4877)`;
ibnemaja.anwaar = [388,1];