var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ الْهَجَرِيُّ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا جَاءَ خَادِمُ أَحَدِكُمْ بِطَعَامِهِ،فَلْيُقْعِدْهُ مَعَهُ،أَوْ لِيُنَاوِلْهُ مِنْهُ،فَإِنَّهُ هُوَ الَّذِي وَلِيَ حَرَّهُ وَدُخَانَهُ»";
ibnemaja.urdu = "حضرت عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’جب تم میں سے کسی کا خادم اس کا کھانا لائے تو اسے چاہیے کہ اسے پانے ساتھ بٹھائے یا اسے تھوڑا سا کھانا دے دے کیونکہ اس نے اس کی گرمی اور دھواں برداشت کیا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;