var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا أَبِي،عَنْ يُونُسَ بْنِ أَبِي الْفُرَاتِ الْإِسْكَافِ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: مَا أَكَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى خِوَانٍ،وَلَا فِي سُكُرُّجَةٍ،قَالَ: فَعَلَامَ كَانُوا يَأْكُلُونَ،قَالَ «عَلَى السُّفَرِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے کبھی میز پر رکھ کر کھانا نہیں کھایا،اور نہ طشتری اور تھالی میں۔قتادہ رحمۃ اللہ نے کہا: پھر لوگ کس چیز پر رکھ کر کھانا کھاتے تھے؟ انہوں نے فرمایا: دستر خوان پر۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;