var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ يُوسُفَ الْجُبَيْرِيُّ قَالَ: حَدَّثَنَا أَبُو بَحْرٍ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ قَالَ: حَدَّثَنَا قَتَادَةُ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: «مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَكَلَ عَلَى خِوَانٍ،حَتَّى مَاتَ»";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہﷺ کو کبھی میز پر رکھ کر کھانا کھاتے نہیں دیکھا حتیٰ کہ آپ انتقال فرماگئے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;