var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ بَشِيرِ بْنِ ذَكْوَانَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ مُنِيرِ بْنِ الزُّبَيْرِ،عَنْ مَكْحُولٍ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَهَى أَنْ يُقَامَ عَنِ الطَّعَامِ،حَتَّى يُرْفَعَ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہﷺ نے کھانا اٹھائے جانے سے پہلے اٹھنے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الولید بن مسلم عنعن <br>ومنیر بن الزبیر الشامي: ضعیف (تقریب: 6920) ومکحول عن عائشۃ: منقطع والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [494,1];