var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا عُبَيْدُ بْنُ وَسِيمٍ الْجَمَّالُ قَالَ: حَدَّثَنِي الْحَسَنُ بْنُ الْحَسَنِ،عَنْ أُمِّهِ فَاطِمَةَ بِنْتِ الْحُسَيْنِ،عَنِ الْحُسَيْنِ بْنِ عَلِيٍّ،عَنْ أُمِّهِ فَاطِمَةَ ابْنَةِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا لَا يَلُومَنَّ امْرُؤٌ،إِلَّا نَفْسَهُ،يَبِيتُ وَفِي يَدِهِ رِيحُ غَمَرٍ»";
ibnemaja.urdu = "حضرت فاطمہ رضی اللہ عنہا بنت رسول اللہﷺ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’اس آدمی کو صرف خود ہی کو ملامت کرنی چاہیے جو اس حال میں رات گزارتا ہے کہ اس کے ہاتھ میں چکنائی کی بو ہو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;