var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ قَالَ: حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا نَامَ أَحَدُكُمْ،وَفِي يَدِهِ رِيحُ غَمَرٍ،فَلَمْ يَغْسِلْ يَدَهُ،فَأَصَابَهُ شَيْءٌ،فَلَا يَلُومَنَّ،إِلَّا نَفْسَهُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبیﷺ نے فرمایا: ’’اگر کوئی شخص اس حال میں سو گیا کہ اس کے ہاتھ میں چکنائی کی بو تھی اور اس نے ہاتھ نہیں دھویا تھا،پھر اسے کوئی تکلیف پہنچ گئی تو وہ اپنے سوا کسی کوملامت نہ کرے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;