var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنِ ابْنِ أَبِي حُسَيْنٍ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ،قَالَتْ: أُتِيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بِطَعَامٍ،فَعَرَضَ عَلَيْنَا،فَقُلْنَا لَا نَشْتَهِيهِ،فَقَالَ: «لَا تَجْمَعْنَ جُوعًا،وَكَذِبًا»";
ibnemaja.urdu = "حضرت اسماء بنت یزید انصاریہ رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبیﷺ کی خدمت میں کھانا حاضر کیا گیا۔آپ نے ہمیں کھانے کی پیش کش کی۔ہم نے کہا: ہمیں خواہش نہیں (بھوک نہیں ہے۔) آپ نے فرمایا: ’’بھوک اور جھوٹ کو اکٹھا نہ کیا کرو۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;