var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ قُرَّةَ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُصَلَّى عَلَى قَارِعَةِ الطَّرِيقِ أَوْ يُضْرَبَ الْخَلَاءُ عَلَيْهَا أَوْ يُبَالَ فِيهَا";
ibnemaja.urdu = "حضٰرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے راستے میں نماز پڑھنے سے یا قضائے حاجت کرنے سے یا پیشاب کرنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ابن لہیعۃ عنعن واختلط <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [388,1];