var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ،وَحَرْمَلَةُ بْنُ يَحْيَى،قَالَا: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ قَالَ: حَدَّثَنِي سُلَيْمَانُ بْنُ زِيَادٍ الْحَضْرَمِيُّ،أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيَّ،يَقُولُ: «كُنَّا نَأْكُلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ الْخُبْزَ وَاللَّحْمَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن حارث بن جزء زبیدی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ رسول اللہﷺ کے زمانۂ مبارک میں مسجد میں گوشت روٹی کھا لیا کرتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;