var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: كُنَّا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: نَأْكُلُ وَنَحْنُ نَمْشِي،وَنَشْرَبُ،وَنَحْنُ قِيَامٌ";
ibnemaja.urdu = "حضرت عبد اللہ بن عمررضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:ہم رسول اللہﷺ کے زمانے میں چلتے چلتے کھا لیا کرتے تھے اور کھڑے ہو کر پانی پی لیا کرتے تھے-";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;