var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ،عَنْ حَكِيمِ بْنِ جَابِرٍ،عَنْ أَبِيهِ،قَالَ: دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهِ،وَعِنْدَهُ هَذَا الدُّبَّاءُ،فَقُلْتُ أَيُّ شَيْءٍ هَذَا قَالَ: «هَذَا الْقَرْعُ،هُوَ الدُّبَّاءُ نُكْثِرُ بِهِ طَعَامَنَا»";
ibnemaja.urdu = "حضرت حکیم بن جابر رحمہ اللہ اپنے والد (حضرت جابر بن طارق احمسی رضی اللہ عنہ)سے روایت کرتے ہیں‘انھوں نے فرمایا:میں نبیﷺ کے گھر میں داخل ہوا۔آپ کے پاس کدو تھا۔میں نے کہا:یہ قرع ہے‘یہ کدو ہے۔ہم اس کے ساتھ اپنے کھانے(سالن)میں اضافہ کرتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>شمائل الترمذی(160)<br>إسماعیل بن أبي خالد عنعن`;
ibnemaja.anwaar = [494,1];