var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الْخَلَّالُ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ قَالَ: حَدَّثَنِي سُلَيْمَانُ بْنُ عَطَاءٍ الْجَزَرِيُّ قَالَ: حَدَّثَنِي مَسْلَمَةُ بْنُ عَبْدِ اللَّهِ الْجُهَنِيُّ،عَنْ عَمِّهِ أَبِي مَشْجَعَةَ،عَنْ أَبِي الدَّرْدَاءِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَيِّدُ طَعَامِ أَهْلِ الدُّنْيَا،وَأَهْلِ الْجَنَّةِ اللَّحْمُ»";
ibnemaja.urdu = "حضرت ابو درداء رضی اللہ عنہ سے روایت ہے‘رسول اللہﷺ نے فرمایا:’’گوشت دنیا والوں کے اور جنت والوں کے کھانوں کا سردار ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>سلیمان بن عطاء الجزري: منکر الحدیث (تقریب: 2594) <br>وأوردہ ابن الجوزي فی الموضوعات (302/2)`;
ibnemaja.anwaar = [494,2];