var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ قَالَ: حَدَّثَنَا سُلَيْمَانُ بْنُ عَطَاءٍ الْجَزَرِيُّ قَالَ: حَدَّثَنَا مَسْلَمَةُ بْنُ عَبْدِ اللَّهِ الْجُهَنِيُّ،عَنْ عَمِّهِ أَبِي مَشْجَعَةَ،عَنْ أَبِي الدَّرْدَاءِ،قَالَ: «مَا دُعِيَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،إِلَى لَحْمٍ قَطُّ،إِلَّا أَجَابَ،وَلَا أُهْدِيَ لَهُ لَحْمٌ قَطُّ،إِلَّا قِبَلَهُ»";
ibnemaja.urdu = "حضرت ابو درداء رضی اللہ عنہ سے روایت ہےکہ رسول اللہﷺ کو جب بھی گوشت کی دعوت دی گئی‘آپ نے قبول فرمائی۔اور جب بھی آپ کی خدمت میں گوشت بطور ہدیہ پیش کیا گیا‘آپ نے قبول فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>انظر الحدیث السابق (3305)`;
ibnemaja.anwaar = [495,1];