var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ،ح وحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،قَالَا: حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ،عَنْ أَبِي زُرْعَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «أُتِيَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ بِلَحْمٍ،فَرُفِعَ إِلَيْهِ الذِّرَاعُ،وَكَانَتْ تُعْجِبُهُ،فَنَهَسَ مِنْهَا»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:ایک دن رسول اللہﷺ کی خدمت میں گوشت لایا گیا۔آپ کو (اس میں سے)ذراع (دستی)کا گوشت پیش کیا گیا جو آپ کو بہت پسند تھا۔آپ نے اس میں سے دانتوں سے نوچ کر کھایا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;