var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: «مَا أَعْلَمُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،رَأَى شَاةً سَمِيطًا،حَتَّى لَحِقَ بِاللَّهِ عَزَّ وَجَلَّ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:میں نہیں جانتا کہ رسول اللہ ﷺنے کبھی سالم بھنی ہوئی بکری دیکھی ہو یہاں تک کہ آپ اللہ عزوجل کے پاس چلے گئے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;