var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: «مَا رُفِعَ مِنْ بَيْنِ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَضْلُ شِوَاءٍ قَطُّ،وَلَا حُمِلَتْ مَعَهُ طِنْفِسَةٌ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:رسول اللہﷺ کے سامنے سے کبھی بچا ہوا بھنا گوشت نہیں اٹھا یا گیا۔(ساتھ کھانے والے اصحاب ہوتے تھے۔گوشت اتنا ہی ہوتا تھا جو اس وقت کھا لیا جائے۔)اور نہ کبھی آپ کے ساتھ بچھانے کے لیے قالین اور غالیجہ لے جایا گیا(کہ جہاں تشریف رکھنا چاہیں‘اس پر رکھیں‘بلکہ وقت پر جیسا بچھونا میسر ہوتا سادہ یا عمدہ‘اس پر تشریف رکھتے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جبارۃ وکثیر بن سلیم مجروحان <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [495,1];