var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ: حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ: أَخْبَرَنِي سُلَيْمَانُ بْنُ زِيَادٍ الْحَضْرَمِيُّ،عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ الْجَزْءِ الزُّبَيْدِيِّ،قَالَ: «أَكَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ طَعَامًا فِي الْمَسْجِدِ،لَحْمًا قَدْ شُوِيَ،فَمَسَحْنَا أَيْدِيَنَا بِالْحَصْبَاءِ،ثُمَّ قُمْنَا نُصَلِّي،وَلَمْ نَتَوَضَّأْ»";
ibnemaja.urdu = "حضرت عبد اللہ بن حارث بن جزء زبیدی رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:ہم نے رسول اللہﷺ کے ہمراہ مسجد میں کھانا کھایا جو بھنا ہوا گوشت تھا۔پھر ہم(زمین پر بچھی ہوئی)کنکریوں سے ہاتھ پونچھ کر نماز پڑھنے کھڑے ہوئے ہم نے (نیا) وضو نہیں کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن لھیعۃ اختلط و لم یحدث بھذا اللفظ قبل اختلاطہ <br>والحدیث السابق (الأصل: 3300) یغني عنہ`;
ibnemaja.anwaar = [495,1];