var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ قَالَ: أَخْبَرَنِي أَبِي،عَنْ عَائِشَةَ،قَالَتْ: «لَقَدْ كُنَّا نَرْفَعُ الْكُرَاعَ،فَيَأْكُلُهُ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ خَمْسَ عَشْرَةَ مِنَ الْأَضَاحِيِّ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:ہم لوگ (گائے یا بکری کے) پائے سنبھال رکھتے تھے‘رسول اللہ ﷺقربانی سے پندرہ دن بعد انھیں تناول فرماتے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;