var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أُحِلَّتْ لَكُمْ مَيْتَتَانِ وَدَمَانِ،فَأَمَّا الْمَيْتَتَانِ،فَالْحُوتُ وَالْجَرَادُ،وَأَمَّا الدَّمَانِ،فَالْكَبِدُ وَالطِّحَالُ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے‘رسول اللہ ﷺ نے فرمایا: ہمارے لیے دو مری ہوئی چیزیں اور دو خون حلال ہیں۔مردہ چیزیں تو مچھلی اور ٹڈی ہیں اور دو خون کلیجی اور تلی ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (3218)`;
ibnemaja.anwaar = [495,1];