var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ قَالَ: حَدَّثَنَا عِيسَى بْنُ أَبِي عِيسَى،عَنْ رَجُلٍ،أُرَاهُ مُوسَى،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَيِّدُ إِدَامِكُمُ الْمِلْحُ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘رسول اللہ ﷺنے فرمایا:’’تمہارے سالن کا سردار نمک ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عیسی الحناط:متروک <br>والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [495,1];