var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَنْبَأَنَا مَعْمَرٌ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِيهِ،عَنْ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْتَدِمُوا بِالزَّيْتِ،وَادَّهِنُوا بِهِ،فَإِنَّهُ مِنْ شَجَرَةٍ مُبَارَكَةٍ»";
ibnemaja.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے‘رسول اللہﷺ نے فرمایا:’’زیتون کا تیل سالن کے طور پر استعمال کرو اور اسے(سر اور بدن میں)لگاؤ۔یہ مبارک درخت سے حاصل ہوتا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;