var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ الْمُثَنَّى عَنْ عَطَاءٍ الْخُرَاسَانِيِّ عَنْ أَنَسٍ قَالَ كُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَتَنَحَّى لِحَاجَتِهِ ثُمَّ جَاءَ فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں ایک سفر میں نبی ﷺ کے ساتھ تھا۔آپ قضائے حاجت کے لئے دور تشریف لے گئے،پھر واپس آکر وضو کے لئے پانی طلب فرمایا اور وضو کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف لضعف (عمر بن المثنی) الأشجعي وقال أبو زرعۃ: عطاء لم یسمع من أنس ‘‘`;
ibnemaja.anwaar = [388,1];