var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ قَالَ: حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ،عَنْ جَدِّهِ،قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا الزَّيْتَ،وَادَّهِنُوا بِهِ،فَإِنَّهُ مُبَارَكٌ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے‘رسول اللہﷺ نے فرمایا:’’زیتون کا تیل کھاؤ(خوراک میں استعال کرو)اور اسے (سر اور بدن میں)لگاؤ کیونکہ یہ مبارک (برکت والا) ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عبد اللّٰہ بن سعید المقبري: متروک`;
ibnemaja.anwaar = [495,2];