var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،عَنْ جَعْفَرِ بْنِ بُرْدٍ الرَّاسِبِيِّ قَالَ: حَدَّثَتْنِي مَوْلَاتِي أُمُّ سَالِمٍ الرَّاسِبِيَّةُ،قَالَتْ: سَمِعْتُ عَائِشَةَ،تَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِلَبَنٍ،قَالَ: «بَرَكَةٌ أَوْ بَرَكَتَانِ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:رسول اللہ ﷺ کی خدمت میں جب دودھ پیش کیا جاتا تو فرماتے:’’ایک برکت یا دو برکتیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أم سالم: مجہولۃ (التحریر: 8733)`;
ibnemaja.anwaar = [496,1];