var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ،وَإِسْمَاعِيلُ بْنُ مُوسَى،قَالَا: حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ،قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَأْكُلُ الْقِثَّاءَ،بِالرُّطَبِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن جعفر (بن ابی طالب)رضی اللہ عنہما سے روایت ہے‘انھوں نے فرمایا:میں نے رسول اللہﷺ کو تازہ کھجور کے ساتھ ککڑی کھاتے دیکھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;