var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي الْحَوَارِيِّ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بَيْتٌ لَا تَمْرَ فِيهِ،جِيَاعٌ أَهْلُهُ»";
ibnemaja.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے‘رسو ل اللہ ﷺ نے فرمایا:’’جس گھر میں کھجوریں نہ ہوں‘اس گھر والے بھوکے ہیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;