var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ قَالَ: حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ،عَنْ جَدَّتِهِ سَلْمَى،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بَيْتٌ لَا تَمْرَ فِيهِ،كَالْبَيْتِ لَا طَعَامَ فِيهِ»";
ibnemaja.urdu = "حضرت سلمیٰ رضی اللہ عنہا سے روایت ہے‘نبیﷺ نے فرمایا:’’جس گھر میں کھجوریں نہ ہوں‘وہ اس گھر کی طرح ہے جس میں کوئی کھانا نہ ہو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;