var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ قَيْسٍ الْمَدَنِيُّ قَالَ: حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا الْبَلَحَ بِالتَّمْرِ،كُلُوا الْخَلَقَ بِالْجَدِيدِ،فَإِنَّ الشَّيْطَانَ يَغْضَبُ،وَيَقُولُ بَقِيَ ابْنُ آدَمَ،حَتَّى أَكَلَ الْخَلَقَ بِالْجَدِيدِ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘رسو ل اللہ ﷺ نے فرمایا:’’تازہ پکی ہوئی کھجور خشک کھجور کے ساتھ ملا کر کھایا کرو۔پرانے (پھل) کو نئے کے ساتھ ملا کر کھاؤ۔(اس سے) شیطان کو غصہ آتا ہے اور وہ کہتا ہے:آدم کا بیٹا جیتا رہا حتی کہ اس نے نئی چیز کے ساتھ پرانی چیز بھی کھائی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد فیہ أبو زکیر یحیی بن محمد بن قیس وھو ضعیف ‘‘ وھو: ضعیف یعتبر بہ (التحریر: 7639)`;
ibnemaja.anwaar = [496,1];