var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ جَبَلَةَ بْنِ سُحَيْمٍ قَالَ: سَمِعْتُ ابْنَ عُمَرَ،يَقُولُ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْرِنَ الرَّجُلُ بَيْنَ التَّمْرَتَيْنِ،حَتَّى يَسْتَأْذِنَ أَصْحَابَهُ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمررضی اللہ عنہ سے روایت ہے‘انھوں نے کہا:رسول اللہﷺ نے اس بات سے منع فرمایا کہ آدمی اپنے ساتھیو ں سے اجازت لیے بغیر دو دو کھجوریں ملا کر کھائے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;