var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا أَبُو دَاوُدَ قَالَ: حَدَّثَنَا أَبُو عَامِرٍ الْخَزَّازُ،عَنِ الْحَسَنِ،عَنْ سَعْدٍ،مَوْلَى أَبِي بَكْرٍ،وَكَانَ سَعْدٌ يَخْدُمُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَكَانَ يُعْجِبُهُ حَدِيثُهُ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَهَى عَنِ الْإِقْرَانِ» يَعْنِي فِي التَّمْرِ";
ibnemaja.urdu = "حضرت ابو بکر رضی اللہ عنہ کے آزاد کردہ حضرت سعد رضی اللہ عنہ ‘جو نبیﷺ کی خدمت کیا کرتے تھے‘اور نبیﷺ کو ان کی باتیں اچھی لگتی تھیں‘ان سے روایت ہے کہ آپ ﷺ نے دو دو کھجوریں ملا کے کھانے سے منع فرمایا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;