var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا أَبُو قُتَيْبَةَ،عَنْ هَمَّامٍ،عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: «رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أُتِيَ بِتَمْرٍ عَتِيقٍ،فَجَعَلَ يُفَتِّشُهُ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:میں نے دیکھا کہ رسول اللہﷺ کی خدمت میں پرانی کھجوریں پیش کی گئیں تو آپ ان کو (اندر سے)صاف کرنے لگے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;