var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ أَبُو الْجُمَاهِرِ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ قَالَ: حَدَّثَنَا قَتَادَةُ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: «مَا رَأَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَغِيفًا مُحَوَّرًا،بِوَاحِدٍ مِنْ عَيْنَيْهِ،حَتَّى لَحِقَ بِاللَّهِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:رسول اللہ ﷺ نے میدے کی روٹی(کھانا تو درکنار)اپنی آنکھ سے بھی نہیں دیکھی یہاں تک کہ آپ اللہ کے پاس چلے گئے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سعید بن بشیر:ضعیف <br>وقتادۃ عنعن إن صح السند إلیہ`;
ibnemaja.anwaar = [496,1];