var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عُمَيْرٍ عِيسَى بْنُ مُحَمَّدٍ النَّحَّاسُ الرَّمْلِيُّ قَالَ: حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ،عَنِ ابْنِ عَطَاءٍ،عَنْ أَبِيهِ،قَالَ: زَارَ أَبُو هُرَيْرَةَ قَوْمَهُ-يَعْنِي قَرْيَةً،أَظُنُّهُ قَالَ يُبْنَى-فَأَتَوْهُ بِرُقَاقٍ مِنْ رُقَاقِ الْأُوَلِ،فَبَكَى،وَقَالَ: «مَا رَأَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هَذَا بِعَيْنِهِ قَطُّ»";
ibnemaja.urdu = "حضرت عطا رحمہ اللہ سے روایت ہے ‘انھوں نے کہا:حضرت ابو ہریرہ رضی اللہ عنہ اپنے لوگوں سے ملتے(غالبا ً یُنَا بستی میں)گئے۔ان لوگوں نے آپ کی خدمت میں پہلے پکی ہوئی بڑی بڑی روٹیاں پیش کیں تو آپ رو دیے اور فرمایا:رسول اللہﷺ نے یہ روٹی کبھی اپنی آنکھوں سے دیکھی بھی نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ضعفہ البوصیري من أجل عثمان بن عطاء بن أبي مسلم الخراساني`;
ibnemaja.anwaar = [496,1];