var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ أَبِي جَعْفَرٍ الْخَطْمِيِّ قَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاسْمُهُ عُمَيْرُ بْنُ يَزِيدَ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ وَالْحَارِثُ بْنُ فُضَيْلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي قُرَادٍ قَالَ حَجَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَهَبَ لِحَاجَتِهِ فَأَبْعَدَ";
ibnemaja.urdu = "سیدنا عبدالرحمٰن بن ابو قراد رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کے ہمراہ حج کیا۔(راستے میں) آپ قضائے حاجت کے لئے گئے تو(لوگوں سے) دور تشریف لے گئے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;