var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ،عَنْ يَزِيدَ بْنِ كَيْسَانَ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّهُ قَالَ: «وَالَّذِي نَفْسِي بِيَدِهِ مَا شَبِعَ نَبِيُّ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ أَيَّامٍ،تِبَاعًا مِنْ خُبْزِ الْحِنْطَةِ،حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے!اللہ کےنبیﷺ نے کبھی تین دن مسلسل گندم کی روٹی پیٹ بھر کر نہیں کھائی حتی کہ اللہ عزوجل نے آپ کو وفات دے دی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;