var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو قَالَ: حَدَّثَنَا زَائِدَةُ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: «مَا شَبِعَ آلُ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُنْذُ قَدِمُوا الْمَدِينَةَ،ثَلَاثَ لَيَالٍ تِبَاعًا،مِنْ خُبْزِ بُرٍّ،حَتَّى تُوُفِّيَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
ibnemaja.urdu = "ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:حضرت محمد کے اہل خانہ نے(ہجرت کر کے)مدینہ آنے سے لے کر آپ کی وفات تک کبھی مسلسل تین راتیں گندم کی روٹی سیر ہو کر نہیں کھائی۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;