var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ قَالَ: حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: «لَقَدْ تُوُفِّيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَمَا فِي بَيْتِي مِنْ شَيْءٍ،يَأْكُلُهُ ذُو كَبِدٍ،إِلَّا شَطْرُ شَعِيرٍ،فِي رَفٍّ لِي،فَأَكَلْتُ مِنْهُ،حَتَّى طَالَ عَلَيَّ،فَكِلْتُهُ فَفَنِيَ»";
ibnemaja.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا: نبیﷺ فوت ہوئے تو میرے گھر میں انسان کے کھانے کی کوئی جیز نہ تھی مگر تھوڑے سے جو میرے ٹانڈ پر پڑے ہوئے تھے۔میں اس میں سے (لے لے کر)کھاتی رہی حتی کہ کافی مدت گزر گئی۔(آخر)میں نے انھیں ماپ لیا تو وہ (جلد ہی)ختم ہو گئے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;