var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي إِسْحَاقَ،سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ،يُحَدِّثُ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: «مَا شَبِعَ آلُ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،مِنْ خُبْزِ الشَّعِيرِ،حَتَّى قُبِضَ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا: حضرت محمد ﷺ کے اہل خانہ نے کبھی جو کی روٹی سیر ہو کر نہیں کھائی حتی کہ آپ ﷺ فوت ہو گئے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;