var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ قَالَ: حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ،عَنْ هِلَالِ بْنِ خَبَّابٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَبِيتُ اللَّيَالِي الْمُتَتَابِعَةَ طَاوِيًا،وَأَهْلُهُ لَا يَجِدُونَ الْعَشَاءَ،وَكَانَ عَامَّةَ خُبْزِهِمْ،خُبْزُ الشَّعِيرِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہ سے روایت ہے‘ انھو ں نے فرمایا:رسو ل اللہﷺ پر مسلسل کئی کئی راتیں آتی تھیں کہ آپ خالی پیٹ رات گزارتے تھے‘اور آپ کے گھر والوں کو بھی رات کا کھانا میسر نہیں ہوتا تھا‘جبکہ اس وقت لوگوں کی عام غذا جو کی روٹی ہوتی تھی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;