var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَنْبَأَنَا إِسْمَعِيلُ بْنُ عَبْدِ الْمَلِكِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَأْتِي الْبَرَازَ حَتَّى يَتَغَيَّبَ فَلَا يُرَى";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم لوگ رسول اللہ ﷺ کے ساتھ ایک سفر میں روانہ ہوئے۔(سفر کے دوران میں) رسول اللہ ﷺ اس وقت تک قضائے حاجت نہیں کرتے تھے جب تک کہ نظروں سے اوجھل نہ ہو جاتے اور کسی کو نظر نہ آتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (2)`;
ibnemaja.anwaar = [389,1];