var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ أَبُو يَحْيَى،عَنْ يَحْيَى الْبَكَّاءِ،عَنِ ابْنِ عُمَرَ،قَالَ: تَجَشَّأَ رَجُلٌ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «كُفَّ جُشَاءَكَ عَنَّا،فَإِنَّ أَطْوَلَكُمْ جُوعًا،يَوْمَ الْقِيَامَةِ،أَكْثَرُكُمْ شِبَعًا فِي دَارِ الدُّنْيَا»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمررضی اللہ عنہ سے روایت ہے کہ نبیﷺ کی موجودگی میں ایک آدمی نے ڈکا ر لی تو آپ نے فرمایا:’’اپنی ڈکاریں روک لو۔قیامت کے دن وہی زیادہ طویل بھوک برداشت کریں گے جو دنیا میں زیادہ سیر ہوتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2478)`;
ibnemaja.anwaar = [497,1];