var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا دَاوُدُ بْنُ سُلَيْمَانَ الْعَسْكَرِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ،قَالَ: حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الثَّقَفِيُّ،عَنْ مُوسَى الْجُهَنِيِّ،عَنْ زَيْدِ بْنِ وَهْبٍ،عَنْ عَطِيَّةَ بْنِ عَامِرٍ الْجُهَنِيِّ،قَالَ: سَمِعْتُ سَلْمَانَ،وَأُكْرِهَ عَلَى طَعَامٍ يَأْكُلُهُ،فَقَالَ: حَسْبِي،إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ أَكْثَرَ النَّاسِ شِبَعًا فِي الدُّنْيَا،أَطْوَلُهُمْ جُوعًا يَوْمَ الْقِيَامَةِ»";
ibnemaja.urdu = "حضرت سلمان رضی اللہ عنہ سے روایت ہے‘ان سے ایک کھانا کھانے پر اصرار کیا گیا تو انھون نے فرمایا:(جتنا کھا لیا وہی)کافی ہے۔میں نے رسول اللہ ﷺسے یہ ارشاد مبارک سنا ہے:’’دنیا میں زیادہ سیر ہونے والے لوگ قیامت کے دن زیادہ طویل عرصے تک بھو کے رہیں گے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>سعید بن محمد الوراق: ضعیف <br>وفیہ علۃ أخری <br>وللحدیث شواھد منھا ما أخرجہ صاحب الحلیۃ (3/ 346) وسندہ ضعیف`;
ibnemaja.anwaar = [497,1];