var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَسُوَيْدُ بْنُ سَعِيدٍ،وَيَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ،قَالُوا: حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ قَالَ: حَدَّثَنَا يُوسُفُ بْنُ أَبِي كَثِيرٍ،عَنْ نُوحِ بْنِ ذَكْوَانَ،عَنِ الْحَسَنِ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنَ السَّرَفِ،أَنْ تَأْكُلَ كُلَّ مَا اشْتَهَيْتَ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’یہ بھی فضول خرچی ہے کہ تو ہر وہ چیز کھائے جس کی تجھے خواہش ہو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>یوسف بن أبي کثیر: مجھول ونوح بن ذکوان: ضعیف`;
ibnemaja.anwaar = [497,1];