var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ يُوسُفَ الْفِرْيَابِيُّ قَالَ: حَدَّثَنَا وَسَّاجُ بْنُ عُقْبَةَ بْنِ وَسَّاجٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُحَمَّدٍ الْمُوَقَّرِيُّ قَالَ: حَدَّثَنَا الزُّهْرِيُّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،قَالَتْ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ،فَرَأَى كِسْرَةً مُلْقَاةً،فَأَخَذَهَا فَمَسَحَهَا،ثُمَّ أَكَلَهَا،وَقَالَ: «يَا عَائِشَةُ أَكْرِمِي كَرِيمًا،فَإِنَّهَا مَا نَفَرَتْ عَنْ قَوْمٍ قَطُّ،فَعَادَتْ إِلَيْهِمْ»";
ibnemaja.urdu = "ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا سے روایت ہے‘انھوں نے فرمایا:نبیﷺ گھر تشریف لائے تو(روٹی کا)ایک ٹکڑا(زمین پر)گرا ہوا دیکھا۔آپ نے اسے اٹھایا‘صاف کیا اور کھا لیا۔پھر فرمایا:’’اے عائشہ!عزت والے(رزق)کا احترام کر۔یہ جن لوگوں کے پاس سے چلا جاتا ہے ‘دوبارہ ان کے پاس نہیں آتا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>الولید الموقري: متروک <br>ولہ متابعات مردودۃ وللحدیث شواہد ضعیفۃ جدًا`;
ibnemaja.anwaar = [497,1];