var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ السَّلَامِ بْنِ عَبْدِ اللَّهِ بْنِ بَابَاهُ الْمَخْزُومِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَيْمُونٍ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَدَعُوا الْعَشَاءَ،وَلَوْ بِكَفٍّ مِنْ تَمْرٍ،فَإِنَّ تَرْكَهُ يُهْرِمُ»";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ رضی اللہ عنہما سے روایت ہے‘رسو ل اللہ ﷺ نے فرمایا:’’رات کا کھانا مت چھوڑو‘خواہ مٹھی بھر کھجوریں ہی سہی‘اس لیے کہ اس کا چھوڑ دینا(آدمی کو جلد)بوڑھا کر دیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>إبراہیم بن عبدالسلام: ضعیف وشیخہ عبد اللّٰہ بن میمون القداح:متروک (تقریب: 209،3654) <br>وللحدیث شواہد ضعیفۃ جدًا عند الترمذي (1856) وغیرہ`;
ibnemaja.anwaar = [497,1];