var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْخَيْرُ أَسْرَعُ إِلَى الْبَيْتِ الَّذِي يُغْشَى،مِنَ الشَّفْرَةِ إِلَى سَنَامِ الْبَعِيرِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے‘رسول اللہﷺنے فرمایا:’’جس گھر میں مہمان آتے ہیں اس میں بھلائی اس سے بھی جلدی آتی ہے جتنی جلدی چھری اونٹ کے کوہان پر چلتی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>کثیر بن سلیم وجبارۃ: مجروحان`;
ibnemaja.anwaar = [497,1];