var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا الْمُحَارِبِيُّ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ نَهْشَلٍ،عَنِ الضَّحَّاكِ بْنِ مُزَاحِمٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْخَيْرُ أَسْرَعُ إِلَى الْبَيْتِ الَّذِي يُؤْكَلُ فِيهِ،مِنَ الشَّفْرَةِ إِلَى سَنَامِ الْبَعِيرِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہ سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’جس گھرمیں مہمان کھانا کھاتے ہیں‘اس میں بھلائی اس سے بھی جلدی آتی ہے جتنی جلدی چھری اونٹ کے کوہان پر چلتی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جبارۃ: ضعیف جدًا <br>والصواب: ’’ المحاربي عبد الرحمٰن عن نہشل وھو ابن سعید ‘‘ <br>ونہشل: متروک <br>والضحاک لم یلق ابن عباس (جامع التحصیل للعلائي ص 199)`;
ibnemaja.anwaar = [498,1];