var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ قَالَ: حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ عَلِيِّ بْنِ عُرْوَةَ،عَنْ عَبْدِ الْمَلِكِ،عَنْ عَطَاءٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنَ السُّنَّةِ،أَنْ يَخْرُجَ الرَّجُلُ مَعَ ضَيْفِهِ،إِلَى بَابِ الدَّارِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے‘رسول اللہﷺ نے فرمایا:’’یہ بھی سنت ہے کہ آدمی مہمان کے ساتھ(اسے رخصت کرتے وقت)گھر کے دروازے تک آئے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>علي بن عروۃ <br>وللحدیث شاہد موضوع عند ابن عدي (1173/3) !`;
ibnemaja.anwaar = [498,1];