var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ هِشَامٍ الدَّسْتُوَائِيِّ،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ عَلِيٍّ،قَالَ: صَنَعْتُ طَعَامًا،فَدَعَوْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَجَاءَ فَرَأَى فِي الْبَيْتِ،تَصَاوِيرَ،فَرَجَعَ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے‘انھوں نے فرمایا:میں نے کھانا تیار کیا اور رسول اللہﷺکو دعوت دی۔رسول اللہﷺتشریف لائے تو گھر میں تصویریں نظر آئیں‘چنانچہ آپ ﷺ واپس چلے گئے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;