var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ كَثِيرِ بْنِ جَعْفَرٍ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ الْمُزَنِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ بِلَالِ بْنِ الْحَارِثِ الْمُزَنِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ الْحَاجَةَ أَبْعَدَ";
ibnemaja.urdu = "سیدنا بلال بن حارث مزنی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب قضائے حاجت کے لئے جاتے تو دور چلے جاتے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;