var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ: حَدَّثَنَا أَبُو عَامِرٍ الْخَزَّازُ،عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ،عَنْ أَبِي ذَرٍّ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا عَمِلْتَ مَرَقَةً،فَأَكْثِرْ مَاءَهَا،وَاغْتَرِفْ لِجِيرَانِكَ مِنْهَا»";
ibnemaja.urdu = "حضرت ابو ذر سے رویت ہے ‘نبی ﷺنے فر مایا:’’جب تو شوربہ تیار کرے تو اس میں پانی زیادہ ڈال لیا کرو۔اوراس میں سے کچھ شوربہ اپنے پڑوسیوں کودے دیا کرو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;