var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ،عَنْ أَبِيهِ،عَنْ أُمِّ أَيُّوبَ،قَالَتْ: صَنَعْتُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ طَعَامًا فِيهِ،مِنْ بَعْضِ الْبُقُولِ،فَلَمْ يَأْكُلْ،وَقَالَ: «إِنِّي أَكْرَهُ أَنْ أُوذِيَ صَاحِبِي»";
ibnemaja.urdu = "حضرت ام ایوب انصار یہ سے روایت ہے ‘انہوں نے فرمایا:میں نے نبیﷺکے لیے کھانا تیار کیا۔اس میں کوئی (نا گواربو والی)سبزی تھی۔رسول اللہﷺنے (وہ کھانا)نہ کھایا۔اور فرمایا:’’میں اپنے ساتھی(جبریل)کو تکلیف دینا پسند نہیں کرتا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;