var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَنْبَأَنَا أَبُو شُرَيْحٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ نِمْرَانَ الْحَجْرِيِّ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ نَفَرًا،أَتَوُا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَوَجَدَ مِنْهُمْ رِيحِ الْكُرَّاثِ،فَقَالَ: «أَلَمْ أَكُنْ نَهَيْتُكُمْ عَنْ أَكْلِ هَذِهِ الشَّجَرَةِ،إِنَّ الْمَلَائِكَةَ تَتَأَذَّى مِمَّا يَتَأَذَّى مِنْهُ الْإِنْسَانُ»";
ibnemaja.urdu = "حضرت جابر سے روایت ہےکہ چند افراد نبیﷺکی خدمت میں حاضر ہوے۔آپﷺکو ان افراد سے گندنے کی بو محسوس ہوئی۔آپ نے فر مایا:’’کیا میں تمہیں یہ پودا کھانے سے منع نہیں کیا تھا؟جس چیز سے انسان کو ایذا پہنچتی ہے اس سے فرشتے بھی ایذا محسوس کرتے ہیں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;