var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يُحْيَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي ابْنُ لَهِيعَةَ،عَنْ عُثْمَانَ بْنِ نُعَيْمٍ،عَنِ الْمُغِيرَةِ بْنِ نَهِيكٍ،عَنْ دُخَيْنٍ الْحَجْرِيِّ،أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ،يَقُولُ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَصْحَابِهِ: «لَا تَأْكُلُوا الْبَصَلَ» ثُمَّ قَالَ: كَلِمَةً خَفِيَّةً النِّيءَ";
ibnemaja.urdu = "حضرت عقبہ بن عامر جہنی روایت ہے ‘انہوں نے کہا: رسول اللہﷺنے اپنے صحابہ سے فرمایا:’’پیاز نہ کھایا کرو۔‘‘پھر آہستہ سے یہ لفظ فرمایا:’’کچا نہ کھاؤ۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عثمان بن نعیم والمغیرۃ بن نہیک: مجہولان (تقریب: 4523،6853) وابن لہیعۃ عنعن`;
ibnemaja.anwaar = [498,1];