var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى السُّدِّيُّ قَالَ: حَدَّثَنَا سَيْفُ بْنُ هَارُونَ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ،عَنْ سَلْمَانَ الْفَارِسِيِّ،قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ السَّمْنِ،وَالْجُبْنِ،وَالْفِرَاءِ قَالَ: «الْحَلَالُ مَا أَحَلَّ اللَّهُ فِي كِتَابِهِ،وَالْحَرَامُ مَا حَرَّمَ اللَّهُ فِي كِتَابِهِ،وَمَا سَكَتَ عَنْهُ،فَهُوَ مِمَّا عَفَا عَنْهُ»";
ibnemaja.urdu = "حضرت سلمان فارسی سے روایت ہےکہ رسول اللہ ﷺسے گھی‘پنیر اور پوستین کے بارے میں سوال کیا گیا‘آپ نے فرمایا:حلال وہ ہے جو اللہ نے اپنی کتاب میں حلال کیا ہے اور حرام زہ ہے جو اللہ نے اپنی کتا ب میں حرام کیا ہے۔اورجس کے بارے میں خاموشی اختیارفرمائی ہے‘وہ ان چیزوں میں شامل ہیں جن کے بارے میں اللہ نے معافی دےدی ہے۔‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1726)`;
ibnemaja.anwaar = [498,1];