var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُحَمَّدٍ الطَّلْحِيُّ قَالَ: حَدَّثَنَا نُقَيْبُ بْنُ حَاجِبٍ،عَنْ أَبِي سَعِيدٍ،عَنْ عَبْدِ الْمَلِكِ الزُّبَيْرِيِّ،عَنْ طَلْحَةَ،قَالَ: دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: وَبِيَدِهِ سَفَرْجَلَةٌ فَقَالَ: «دُونَكَهَا،يَا طَلْحَةُ،فَإِنَّهَا تُجِمُّ الْفُؤَادَ»";
ibnemaja.urdu = "حضرت طلحہ ؓ سے روایت ہے ‘انہوں نے فرمایا:میں رسول اللہﷺکی خدمت میں حاضر ہوا اور آپ کے ہاتھ میں سفرجل(بہی کا پھل)تھا۔آپنے فرمایا:اے ابو طلحہ!یہ لے لو ‘اس سے دل کو راحت(اورقوت) حاصل ہوتی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>نقیب بن حاجب و أبو سعید و عبدالملک الزبیري:مجہولون (تقریب: 7185،8134،4230) <br>وللحدیث شواہد ضعیفۃ فی العلل المتناہیۃ (165/2،166)`;
ibnemaja.anwaar = [498,1];