var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنْ يَأْكُلَ الرَّجُلُ،وَهُوَ مُنْبَطِحٌ عَلَى وَجْهِهِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر سے روایت ہے ‘انہوں نے کہا:رسول اللہﷺ نے اس بات سےمنع کہ آدمی چہرے کے بل لیٹے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3774)`;
ibnemaja.anwaar = [498,2];