var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْوَهَّابِ،جَمِيعًا عَنْ رَاشِدٍ أَبِي مُحَمَّدٍ الْحِمَّانِيِّ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أُمِّ الدَّرْدَاءِ،عَنْ أَبِي الدَّرْدَاءِ،قَالَ: أَوْصَانِي خَلِيلِي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَشْرَبِ الْخَمْرَ،فَإِنَّهَا مِفْتَاحُ كُلِّ شَرٍّ»";
ibnemaja.urdu = "حضرت ابو درداء ؓ سے روایت ہے ‘انہوں نےٰ کہا:مجھے میرے خلیل ﷺنے نصیحت کرتے ہوئے فرمایا:’’شراب نہ پینا کیو نکہ وہ ہر برائی کی کنجی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;