var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا مُنِيرُ بْنُ الزُّبَيْرِ،أَنَّهُ سَمِعَ عُبَادَةَ بْنَ نُسَيٍّ،يَقُولُ سَمِعْتُ خَبَّابَ بْنَ الْأَرَتِّ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِيَّاكَ وَالْخَمْرَ،فَإِنَّ خَطِيئَتَهَا تَفْرَعُ الْخَطَايَا،كَمَا أَنَّ شَجَرَتَهَا،تَفْرَعُ الشَّجَرَ»";
ibnemaja.urdu = "حضرت خباب بن ارت ؓسے روایت ہے ‘رسول اللہ ﷺنے فرمایا:شراب سے پر ہیز کرو۔اس کا گناہ (دوسرے تمام)گناہوں سے اسی طرح بڑھ کر ہے جس طرح اس کا پودا درختوں سے بلند ہے۔‘‘(انگور کی بیل جس طرح درخت پر چڑھتی ہے ‘اس سے بلند نظر آتی ہے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>منیر بن الزبیر: ضعیف`;
ibnemaja.anwaar = [499,1];