var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا،لَمْ يَشْرَبْهَا فِي الْآخِرَةِ،إِلَّا أَنْ يَتُوبَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر ؓ سے روایت ہے ‘رسول اللہ ﷺنے فرمایا:جو شخص دنیا میں شراب پیئے گا ‘ وہ آخرت میں نہیں پی سکے گا ‘سوائے اس صورت کے کہ وہ (شراب نوشی سے)توبہ کر لے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;