var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ،قَالَ: حَدَّثَنِي زَيْدُ بْنُ وَاقِدٍ،أَنَّ خَالِدَ بْنَ عَبْدِ اللَّهِ بْنِ حُسَيْنٍ،حَدَّثَهُ قَالَ: حَدَّثَنِي أَبُو هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا،لَمْ يَشْرَبْهَا فِي الْآخِرَةِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے ‘وسول اللہ ﷺنے فرما یا:جو شخص دنیا میں شراب پیئے گا وہ آخرت میں نہیں پی سکے گا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;