var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَمُحَمَّدُ بْنُ الصَّبَّاحِ،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ بْنِ الْأَصْبَهَانِيِّ،عَنْ سُهَيْلٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مُدْمِنُ الْخَمْرِ،كَعَابِدِ وَثَنٍ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓسے روایت ہے ‘رسول اللہ ﷺنے فروما یا:ہمیشہ شراب پینے والا ‘بت پوجنے والے کی طرح ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;