var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ الْيَمَامِيُّ قَالَ: حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا أَبُو كَثِيرٍ السُّحَيْمِيُّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ: النَّخْلَةِ،وَالْعِنَبَةِ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓسے روایت ہے ‘رسول اللہﷺ نے فرما یا:شراب ان دو نبا تات سے بنتی ہے کھجور اور انگور۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;