var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،أَنَّ خَالِدَ بْنَ كَثِيرٍ الْهَمْدَانِيَّ،حَدَّثَهُ أَنَّ السَّرِيَّ بْنَ إِسْمَاعِيلَ،حَدَّثَهُ أَنَّ الشَّعْبِيَّ،حَدَّثَهُ أَنَّهُ سَمِعَ النُّعْمَانَ بْنَ بَشِيرٍ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنَ الْحِنْطَةِ خَمْرًا،وَمِنَ الشَّعِيرِ خَمْرًا،وَمِنَ الزَّبِيبِ خَمْرًا،وَمِنَ التَّمْرِ خَمْرًا،وَمِنَ الْعَسَلِ خَمْرًا»";
ibnemaja.urdu = "حضرت نعمان بن بشیر ؓ سے روایت ہے‘رسول اللہ ﷺنے فرمایا:’’گندم کی شراب ہو تی ہے ‘جو کی شراب ہوتی ہے ‘منقیٰ سے (بنی ہوئی نشہ آورچیز)شراب ہوتی ہے اور شہد سے (بنی ہوئی نشہ آور چیز)شراب ہوتی ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;