var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ مُسْلِمٍ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ قَالَتْ: لَمَّا نَزَلَتِ الْآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي الرِّبَا،خَرَجَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَحَرَّمَ التِّجَارَةَ فِي الْخَمْرِ»";
ibnemaja.urdu = "حضرت عا ئشہ رضی اللہ عنہا سے روایت ہے ‘انہوں نے فرمایا:جب سود کے بارے میں سورۃ بقرہ کے اخیر والی آیات نازل ہو ئیں تو رسول اللہﷺ(گھر سے)باہر تشر یف لے گئے اور شراب کی حرام ہونے کا اعلان فر ما دیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;