var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ طَاوُسٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: بَلَغَ عُمَرَ أَنَّ سَمُرَةَ بَاعَ خَمْرًا،فَقَالَ: قَاتَلَ اللَّهُ سَمُرَةَ أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ الْيَهُودَ،حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ،فَجَمَلُوهَا،فَبَاعُوهَا»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس ؓ سے روایت ہے‘حضرت عمر کو اطلاع ملی کہ سمرہ نے شراب فروخت کی ہے تو انہوں نے فرمایا:اللہ سمرہ کو تباہ کرے۔کیا اسے معلوم نہیں کہ رسول اللہ ﷺنے فرمایا:اللہ تعالیٰ یہودیوں پر لعنت نازل فرماے!ان پر چربی حرام کی گئی تو انہوں نے اسے پگلا کر بیچ دیا۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;