var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ عَبْدِ الْقُدُّوسِ قَالَ: حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَذْهَبُ اللَّيَالِي وَالْأَيَّامُ،حَتَّى تَشْرَبَ فِيهَا،طَائِفَةٌ مِنْ أُمَّتِي الْخَمْرَ،يُسَمُّونَهَا بِغَيْرِ اسْمِهَا»";
ibnemaja.urdu = "حضرت ابو امامہ باہلی ؓ سے روایت ہے ‘رسو ل اللہ ﷺنے فرمایا:رات دن کا نظام ختم نہیں ہو گا حتیٰ کہ میری امت کے کچھ لوگ شراب پیں گے لیکن اسے اس کے نام (شراب)کے سوا دوسرے نام سے پکاریں گے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;