var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنَا ابْنُ جُرَيْجٍ،عَنْ أَيُّوبَ بْنِ هَانِئٍ،عَنْ مَسْرُوقٍ،عَنِ ابْنِ مَسْعُودٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ مُسْكِرٍ،حَرَامٌ» قَالَ ابْنُ مَاجَةَ: هَذَا حَدِيثُ الْمِصْرِيِّينَ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود ﷺسے ر وایت ہے ‘رسول اللہ نے فرما یا:’’ہر نشہ آور چیز حرام ہے۔‘‘\nامام ابن ماجہ رحمہ اللہ بیان کرتے ہیں:یہ اہل مصر کی حدیث ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;