var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ قَالَ: حَدَّثَنَا خَالِدُ بْنُ حَيَّانَ،عَنْ سُلَيْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ الزِّبْرِقَانِ،عَنْ يَعْلَى بْنِ شَدَّادِ بْنِ أَوْسٍ،سَمِعْتُ مُعَاوِيَةَ،يَقُولُ: سَمِعْتُ رَسُول اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «كُلُّ مُسْكِرٍ،حَرَامٌ عَلَى كُلِّ مُؤْمِنٍ» وَهَذَا حَدِيثُ الرَّقِّيِّينَ";
ibnemaja.urdu = "حضرت معاویہؓ سے روایت ہے‘رسول اللہ ﷺنے فرمایا:’’ہر نشہ آور چیز مومن پر حرام ہے۔(امام ابن ماجہ رحمہ اللہ بیان کرتے ہیں)یہ رقہ والوں کی حدیث ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سلیمان بن عبد اللّٰہ بن الزبرقان: لین الحدیث <br>و الحدیث الآتي (الأصل: 3390) یغني عنہ`;
ibnemaja.anwaar = [499,1];