var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ قَالَ: حَدَّثَنَا أَبُو يَحْيَى زَكَرِيَّا بْنُ مَنْظُورٍ،عَنْ أَبِي حَازِمٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مُسْكِرٍ،حَرَامٌ،وَمَا أَسْكَرَ كَثِيرُهُ،فَقَلِيلُهُ حَرَامٌ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر سے روایت ہے‘رسول اللہﷺنے فرمایا:ہر نشہ آور چیز حرام ہے۔اور جس چیزکی زیادہ مقدار سےنشہ آئے ‘اس کی تھوڑی مقدار بھی حرام ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;