var ibnemaja = {};
ibnemaja.arabic = "َدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ قَالَ: حَدَّثَنِي دَاوُدُ بْنُ بَكْرٍ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَا أَسْكَرَ كَثِيرُهُ،فَقَلِيلُهُ حَرَامٌ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ سے روایت ہے‘رسول اللہﷺنے فر مایا:جس چیز کی زیادہ مقدار سے نشہ آئے ‘اس کی تھوڑی مقدار بھی حرام ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;