var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أَسْكَرَ كَثِيرُهُ،فَقَلِيلُهُ حَرَامٌ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے ‘رسول اللہ ﷺنے فرمایا: ’’جس چیز کی زیادہ مقدار سے نشہ آئے اس کی تھوڑی مقدار بھی حرام ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;