var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ الْيَمَامِيُّ قَالَ: حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ،عَنْ أَبِي كَثِيرٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَنْبِذُوا التَّمْرَ وَالْبُسْرَ جَمِيعًا،وَانْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’خشک کھجوریں اور نیم پختہ کھجوروں کو ملا کر نبیذ نہ بناؤ۔دونوں میں سے ہر ایک کی علیحدہ علیحدہ نبیذ بنا لیا کرو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;