var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ،عَنْ أَبِيهِ،أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَجْمَعُوا بَيْنَ الرُّطَبِ،وَالزَّهْوِ،وَلَا بَيْنَ الزَّبِيبِ،وَالتَّمْرِ،وَانْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ»";
ibnemaja.urdu = "حضرت ابو قتادہ (حارث بن ربعی سلمی انصاری)ؓ سے روایت ہے ‘رسول ا للہﷺ نے فرمایا:تازہ پکی ہوئی کھجوروں اور نیم پختہ (گدر)کھجوروں کو (نبیذ بنا نے کر لیے)اکٹھا نہ کرو‘اور نہ منقیٰ اور خشک کھجور کو ملاؤ۔ان میں سے ہر ایک کو جدا جدا بنا لو۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;