var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،عَنْ إِسْمَاعِيلَ بْنِ صَبِيحٍ،عَنْ أَبِي إِسْرَائِيلَ،عَنْ أَبِي عُمَرَ الْبَهْرَانِيِّ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَيَشْرَبُهُ يَوْمَهُ ذَلِكَ،وَالْغَدَ،وَالْيَوْمَ الثَّالِثَ،فَإِنْ بَقِيَ مِنْهُ شَيْءٌ،أَهْرَاقَهُ،أَوْ أَمَرَ بِهِ،فَأُهْرِيقَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے ‘انہوں نے فرمایا:رسول اللہﷺکے لیے نبیذ تیار کی جاتی تھی۔آپ اسے اس دن بھی نوش فرماتے اور دوسرے دن بھی۔پھر اگر (تیسرے دن)اس میں سے کچھ بچ جاتی تو اسے گرا دیتے یا ٖ آپ کے حکم سے اسے گرا دیا جاتا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;