var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ عَنْ الْحَسَنِ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ كَانَ أَحَبَّ مَا اسْتَتَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَتِهِ هَدَفٌ أَوْ حَائِشُ نَخْلٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن جعفر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ قضائے حاجت کے موقع پر کسی ٹیلے یا کھجوروں کے جھنڈ کی آڑ لینا زیادہ پسند فرماتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;