var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو قَالَ: حَدَّثَنَا أَبُو سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنْ يُنْبَذَ فِي النَّقِيرِ،وَالْمُزَفَّتِ،وَالدُّبَّاءِ،وَالْحَنْتَمَةِ» وَقَالَ: «كُلُّ مُسْكِرٍ حَرَامٌ»";
ibnemaja.urdu = "حضرت ابو ہر یر ہ ؓ سے رو ایت ہے ’ انھوں نے فر مایا: رسول اللہ ﷺ نے لکڑی کے برتن میں ’ تا ر کول لگے برتن میں ’ کدو سے بنے ہوئے برتن (تو نبے) میں اور (سبز) ر وغنی گھڑے میں نبیذ بنا نے سے منع فرما یا۔اورفرما یا: ’’ہر نشہ آور چیز حرام ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;