var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا أَبِي،عَنِ الْمُثَنَّى بْنِ سَعِيدٍ،عَنْ أَبِي الْمُتَوَكِّلِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَنِ الشُّرْبِ فِي الْحَنْتَمِ،وَالدُّبَّاءِ،وَالنَّقِيرِ»";
ibnemaja.urdu = "حضرت ابو سعید خد ری ؓ سے رو ایت ہے ’انھوں نے فرما یا: رسو ل اللہ ﷺ نےروغنی گھڑے میں ’ کدو سے بنےہوئے برتن میں اور لکڑ ی سے بنے ہوئے میں پینے سے منع فرما یا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;