var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ،وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ،قَالَا: حَدَّثَنَا شَبَابَةُ،عَنْ شُعْبَةَ،عَنْ بُكَيْرِ بْنِ عَطَاءٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَنِ الدُّبَّاءِ،وَالْحَنْتَمِ»";
ibnemaja.urdu = "حضرت عبدالرحمٰن بن یعمر ( دیلی) رضی اللہ عنہ سے روایت ہے ’انھوں نے فرما یا: رسول اللہ ﷺ نے کدو سے بنے ہوئے برتن اور روغنی گھڑے (میں نبیذ بنانے) سے منع فرما یا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;