var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ،عَنْ شَرِيكٍ،عَنْ سِمَاكٍ،عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ،عَنِ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُنْتُ نَهَيْتُكُمْ عَنِ الْأَوْعِيَةِ،فَانْتَبِذُوا فِيهِ،وَاجْتَنِبُوا كُلَّ مُسْكِرٍ»";
ibnemaja.urdu = "حضرت عبد اللہ بن بر یدہ رحمہ اللہ اپنے والد (حضرت بریدہ بن حصیب اسلمی) رضی اللہ عنہ سے روایت کرتے ہیں کے نبیﷺ نےفرما یا: میں نےتمھیں کچھ برتنو ں سے منع کیا تھا ’ اب ان میں نبیذ بنا لیا کرو ’ اور ہر نشہ آ ور مشر وب سے پر ہیز کر و۔’’";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;