var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَنْبَأَنَا ابْنُ جُرَيْجٍ،عَنْ أَيُّوبَ بْنِ هَانِئٍ،عَنْ مَسْرُوقِ بْنِ الْأَجْدَعِ،عَنِ ابْنِ مَسْعُودٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ نَبِيذِ الْأَوْعِيَةِ،أَلَا وَإِنَّ وِعَاءً لَا يُحَرِّمُ شَيْئًا،كُلُّ مُسْكِرٍ حَرَامٌ»";
ibnemaja.urdu = "حضرت عبد اللہ بن مسعود ؓ سے روایت ہے ’رسول اللہ ﷺ نے فرمایا:‘‘ میں نے تمھیں (کچھ) برتنو ں میں بنی ہو ئی نبیذ سے منع کیا تھا۔سنو! برتن کسی چیز کو حر ام نہیں کرتا۔(البتہ) ہر نشہ آ ور چیز حرام ہے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;