var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ،عَنْ أَبِيهِ قَالَ: حَدَّثَتْنِي رُمَيْثَةُ،عَنْ عَائِشَةَ،أَنَّهَا قَالَتْ: أَتَعْجِزُ إِحْدَاكُنَّ أَنْ تَتَّخِذَ،كُلَّ عَامٍ،مِنْ جِلْدِ أُضْحِيَّتِهَا سِقَاءً؟ ثُمَّ قَالَتْ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنْ يُنْبَذَ فِي الْجَرِّ،وَفِي كَذَا،وَفِي كَذَا،إِلَّا الْخَلَّ»";
ibnemaja.urdu = "ام المو منین سید ہ عا ئشہ صدیقہ ؓ سے روایت ہے ’ انھوں نے فرما یا:کیا کو ئی عو رت ایسے نہیں کر سکتی کہ ہر سال اپنے قربا نی کے جا نور کی کھال سے مشکزہ بنا لیا کر ے؟(عورت کو یہ کام کرنا چا ہیے۔) پھر فر ما یا: رسو ل اللہ ﷺ نے مٹکے میں اور فلا ں فلاں چیز میں نبیذ بنا نے سے منع فر مایا ہے ’ البتہ سر کہ رکھا جا سکتا ہے۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سوید بن سعید:ضعیف <br>و رمیثۃ لا تعرف (تقریب: 8591)`;
ibnemaja.anwaar = [499,1];