var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الْخَطْمِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنْ يُنْبَذَ فِي الْجِرَارِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے رو ایت ہے ’ انھوں نے فر ما یا: رسو ل اللہ ﷺ نے مٹکوں میں نبیذ بنا نے سے منع فرما یا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;