var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى قَالَ: حَدَّثَنَا الْوَلِيدُ،عَنْ صَدَقَةَ أَبِي مُعَاوِيَةَ،عَنْ زَيْدِ بْنِ وَاقِدٍ،عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: أُتِيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَبِيذِ جَرٍّ يَنِشُّ فَقَالَ: «اضْرِبْ بِهَذَا،الْحَائِطَ،فَإِنَّ هَذَا شَرَابُ،مَنْ لَا يُؤْمِنُ بِاللَّهِ،وَالْيَوْمِ الْآخِرِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے رو ایت ہے کے نبی ﷺ کی خدمت میں گھڑ ے میں بنی ہوئی نبیذ پیش کی گئی جس میں ابال پید ا ہو گیا تھا ( اور جھاگ آگیا تھا۔) آپﷺ نے فرما یا: اسے دیو ار پر دے ما رو۔یہ تو ایسے شخص کا مشروب ہے جو اللہ پر اور آخرت کے دن پر ایما ن نہیں رکھتا۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;