var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَقِيلِ بْنِ خُوَيْلِدٍ حَدَّثَنِي حَفْصُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مُحَمَّدِ بْنِ ذَكْوَانَ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ عَدَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الشِّعْبِ فَبَالَ حَتَّى أَنِّي آوِي لَهُ مِنْ فَكِّ وَرِكَيْهِ حِينَ بَالَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ راستے سے ہٹ کر گھاٹی کی طرف چلے گئے اور(وہاں جاکر) پیشاب کیا۔جب آپ نے پیشاب کیا تو میں آپ کے قریب(منہ دوسری طرف کر کے کھڑا) تھا تاکہ آپ کی پشت ظاہر نہ ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>محمد بن ذکوان:ضعیف (تقریب: 5871) <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [389,1];