var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ،عَنْ سُهَيْلٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،بِتَغْطِيَةِ الْإِنَاءِ،وَإِيكَاءِ السِّقَاءِ،وَإِكْفَاءِ الْإِنَاءِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے انھوں نے فرما یا: رسول اللہ ﷺنے ہمیں برتن ڈھا نپنے کا ’ مشک کا منہ باند ھنے کا اور برتن او ند ھے کر کےرکھنےکا حکم دیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;