var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِصْمَةُ بْنُ الْفَضْلِ قَالَ: حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ بْنِ أَبِي حَفْصَةَ قَالَ: حَدَّثَنَا حَرِيشُ بْنُ خِرِّيتٍ قَالَ: أَنْبَأَنَا ابْنُ أَبِي مُلَيْكَةَ،عَنْ عَائِشَةَ قَالَتْ: «كُنْتُ أَصْنَعُ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ آنِيَةٍ مِنَ اللَّيْلِ مُخَمَّرَةً،إِنَاءً لِطَهُورِهِ،وَإِنَاءً لِسِوَاكِهِ،وَإِنَاءً لِشَرَابِهِ»";
ibnemaja.urdu = "حضرت عائشہ ؓ سے روایت ہے ’ انھوں نے فرما یا: میں رات کو رسول اللہ ﷺ کے لئے (پا نی کے) بر تن ڈھا نپ کر رکھتی تھی۔ایک برتن آ پ کے استنجا کے لیے ’ ایک برتن آپ کی مسواک (اور وضو) کے لیے اور ایک برتن آپ کے پینے کے لیے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>انظر الحدیث السابق (361)`;
ibnemaja.anwaar = [499,1];