var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ نَافِعٍ،عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ،عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ،عَنْ أُمِّ سَلَمَةَ،أَنَّهَا أَخْبَرَتْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الَّذِي يَشْرَبُ فِي إِنَاءِ الْفِضَّةِ،إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ،نَارَ جَهَنَّمَ»";
ibnemaja.urdu = "ام المو منین سیدہ ام سلمہ ؓسے روایت ہے ’ رسول اللہ نے فرما یا:‘‘ جو شخص چا ندی کے برتن میں (پا نی یا کو ئی اور مشروب) پیتا ہے ’ وہ اپنے پیٹ میں جہنم کی آگ غٹ ڈال رہا ہے۔’’";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;