var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي بِشْرٍ،عَنْ مُجَاهِدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى،عَنْ حُذَيْفَةَ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الشُّرْبِ،فِي آنِيَةِ الذَّهَبِ،وَالْفِضَّةِ،وَقَالَ: «هِيَ لَهُمْ فِي الدُّنْيَا،وَهِيَ لَكُمْ فِي الْآخِرَةِ»";
ibnemaja.urdu = "حضرت حذیفہ ؓ سے روایت ہے انھوں نے فرما یا: رسول اللہ ﷺ نے سو نے اور چا ندی کے برتنو ں میں پینے سے منع فرما یا ’ اور فرما یا:‘‘وہ دنیا میں ان (کا فروں) کے لیے ہیں اور آخرت میں تمھارے لیے۔’’";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;