var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا غُنْدَرٌ،عَنْ شُعْبَةَ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،عَنْ نَافِعٍ،عَنِ امْرَأَةِ ابْنِ عُمَرَ،عَنْ عَائِشَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَنْ شَرِبَ فِي إِنَاءِ فِضَّةٍ،فَكَأَنَّمَا يُجَرْجِرُ فِي بَطْنِهِ،نَارَ جَهَنَّمَ»";
ibnemaja.urdu = "ام المو منین حضرت عا ئشہ ؓ سے رو ایت ہے ’نبی ﷺ نے فرما یا:‘‘ جو شخص چا ندی کے برتن میں پیتا ہے ’ وہ اپنے پیٹ میں جہنم کی آ گ غٹ ڈال رہا ہے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;