var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا ابْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ،عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ،عَنْ أَنَسٍ،أَنَّهُ كَانَ: يَتَنَفَّسُ فِي الْإِنَاءِ،ثَلَاثًا وَزَعَمَ أَنَسٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ «يَتَنَفَّسُ فِي الْإِنَاءِ،ثَلَاثًا»";
ibnemaja.urdu = "حضرت انس ؓ سے روایت ہے کے وہ برتن میں تین بار سا نس لیتے تھے۔اور انس ؓ نے بیا ن فرما یا کہ رسو ل اللہ برتن میں تین بار سانس لیتے تھے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;