var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَمُحَمَّدُ بْنُ الصَّبَّاحِ،قَالَا: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ قَالَ: حَدَّثَنَا رِشْدِينُ بْنُ كُرَيْبٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «شَرِبَ،فَتَنَفَّسَ فِيهِ مَرَّتَيْنِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عبا س ؓ سے رو ایت ہے کہ نبی ﷺ نے (پا نی) پیا تو اس میں دو با ر سا نس لیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1886)`;
ibnemaja.anwaar = [499,1];