var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ يُونُسَ،عَنِ ابْنِ شِهَابٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:’’نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَنِ اخْتِنَاثِ الْأَسْقِيَةِ: أَنْ يُشْرَبَ مِنْ أَفْوَاهِهَا‘‘";
ibnemaja.urdu = "حضرت ابو سعید خدری ؓسے رو ایت ہے کے رسول اللہ ﷺ نے مشکیزوں کے منہ اوپر کی طرف مو ڑ کر ان کے مو نہوں سے پا نی پینے سے منع فرمایا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;