var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ عَاصِمٍ،عَنِ الشَّعْبِيِّ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «سَقَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ زَمْزَمَ،فَشَرِبَ قَائِمًا» فَذَكَرْتُ ذَلِكَ لِعِكْرِمَةَ فَحَلَفَ بِاللَّهِ،مَا فَعَلَ";
ibnemaja.urdu = "اما م شعبی رحمتہ اللہ علیہ نے حضرت عبد اللہ بن عبا س ؓ سے روایت کی کہ انھوں نے فرما یا: میں نےنبی ﷺ کو زمزم کا پانی پیش کیا تو آپ نے کھڑے کھڑے پی لیا۔شعبی رحمتہ اللہ علیہ فرما تے ہیں: میں نے عکرمہ ؓؓ کو یہ حدیث سنا ئی تو انھوں نے اللہ کی قسم کھا کر فرما یا کہ نبی ﷺ نے ایسے نہیں کیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;