var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنِ الزُّهْرِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ،وَعَنْ يَمِينِهِ أَعْرَابِيٌّ،وَعَنْ يَسَارِهِ أَبُو بَكْرٍ،فَشَرِبَ ثُمَّ أَعْطَى الْأَعْرَابِيَّ،وَقَالَ: «الْأَيْمَنُ،فَالْأَيْمَنُ»";
ibnemaja.urdu = "حضرت انس بن ما لک ؓ سے ےروایت ہے کہ رسو ل اللہ ﷺ کی خدمت میں دودھ پیش کیا گیا جس میں پانی ملا یا گیا تھا۔نبی ﷺ کے داہیں طرف ایک اعرابی صحابی تھے اور با ہیں طرف ابو بکر ؓؓ تھے۔نبی ﷺانے پی کر اعرابی صحابی کو عطا کیا اور فرما یا:‘‘ داہیں طرف والا (زیادہ حق دار ہے) ’ پھر اس کے بعد داہیں طرف والا۔’’";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;