var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ اللَّهِ،عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ،عَنِ الْحَارِثِ بْنِ أَبِي ذُبَابٍ،عَنْ عَمِّهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا شَرِبَ أَحَدُكُمْ،فَلَا يَتَنَفَّسْ فِي الْإِنَاءِ،فَإِذَا أَرَادَ أَنْ يَعُودَ،فَلْيُنَحِّ الْإِنَاءَ،ثُمَّ لِيَعُدْ إِنْ كَانَ يُرِيدُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓسے روایت ہے’ رسو ل اللہ نے فرما یا:‘‘ جب کو ئی شخص (پانی وغیرہ) پیےتو اسے برتن میں سا نس نہیں لینا چاہیے۔اگر دو بارہ پینے چا ہے تو برتن(منہ سے) ہٹا ئے ’ پھر چا ہے تو دوبارہ (مزید) پی لے۔’’";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;