var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ الْكَرِيمِ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنْ يُنْفَخَ فِي الْإِنَاءِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عبا س ؓ سے روایت ہے ’ انھوں نے فرما یا: رسول اللہ ﷺ نے پینے پھونک ما رنے سے منع فرما یا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث (3288)`;
ibnemaja.anwaar = [500,1];