var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا ابْنُ فُضَيْلٍ،عَنْ لَيْثٍ،عَنْ سَعِيدِ بْنِ عَامِرٍ،عَنِ ابْنِ عُمَرَ،قَالَ: مَرَرْنَا عَلَى بِرْكَةٍ،فَجَعَلْنَا نَكْرَعُ فِيهَا،فَقَالَ: رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَكْرَعُوا،وَلَكِنِ اغْسِلُوا أَيْدِيَكُمْ،ثُمَّ اشْرَبُوا فِيهَا،فَإِنَّهُ لَيْسَ إِنَاءٌ أَطْيَبَ مِنَ الْيَدِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر ؓ سے روایت ہے ’انھوں نے فرما یا: ہم ایک تالاب کےپاس سے گزرے تو اس سے منہ لگا کر پانی پینےلگے۔رسول اللہ ﷺ نے فرمایا:‘‘منہ لگا کر پانی نہ پیو لیکن اپنے ہا تھ سے زیادہ پاکیزہ کو ئی بر تن نہیں۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>لیث بن أبي سلیم: ضعیف مدلس و عنعن`;
ibnemaja.anwaar = [500,1];