var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ،وَسُوَيْدُ بْنُ سَعِيدٍ،قَالَا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ ثَابِتٍ الْبُنَانِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ،عَنْ أَبِي قَتَادَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَاقِي الْقَوْمِ،آخِرُهُمْ شُرْبًا»";
ibnemaja.urdu = "حضرت ا بو قتا دہ ؓ سے روایت ہے ’رسول اللہ ﷺ نے فرما یا:‘‘لوگوں کو پانی پلا نے والا آخر میں پیا کرتا ہے۔’’";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;