var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنَا مَنْدَلُ بْنُ عَلِيٍّ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «كَانَ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَدَحُ قَوَارِيرَ يَشْرَبُ فِيهِ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس ؓ سے روایت ہے کے رسول اللہ ﷺ کے پاس شیشے کا ایک پیا لہ تھا۔\nآپ اس میں پانی وغیرہ پیا کرتے تھے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن إسحاق عنعن <br>ومندل: ضعیف`;
ibnemaja.anwaar = [500,1];