var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنِ ابْنِ أَبِي خِزَامَةَ،عَنْ أَبِي خِزَامَةَ،قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَرَأَيْتَ أَدْوِيَةً نَتَدَاوَى بِهَا،وَرُقًى نَسْتَرْقِي بِهَا،وَتُقًى نَتَّقِيهَا،هَلْ تَرُدُّ مِنْ قَدَرِ اللَّهِ شَيْئًا؟ قَالَ: «هِيَ مِنْ قَدَرِ اللَّهِ»";
ibnemaja.urdu = "حضرت ابو خزامہؓ سے روایت ہے،انہوں نےفرمایا: رسول اللہ ﷺ سے سوال کیا گیا: ہم دواؤں کے ذریعے سے علاج کرتے ہیں،اور دعاؤں کے ساتھ دم کرتے ہیں،اور دفاعی اسیاء کے ذریعے سے اپنا بچاؤ کرتے ہیں،کیا یہ چیزیں اللہ کی تقدیر میں سے کسی چیز کو روک سکتی ہیں؟ رسول اللہﷺ نے فرمایا: ’’یہ بھی اللہ کی تقدیر میں شامل ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2065)`;
ibnemaja.anwaar = [500,1];