var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ،قَالَا: حَدَّثَنَا أَبُو أَحْمَدَ،عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ قَالَ: حَدَّثَنَا عَطَاءٌ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا أَنْزَلَ اللَّهُ دَاءً،إِلَّا أَنْزَلَ لَهُ شِفَاءً»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،نبی ﷺ نے فرمایا: ’’اللہ نے جو بھی بیماری نازل کی ہے،اسکی شفا(دوا)بھی ضرور نازل کی ہے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;