var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ قَالَ: حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ،عَنِ الْأَعْمَشِ،عَنْ يَزِيدَ الرَّقَاشِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَلَى مَرِيضٍ يَعُودُهُ،قَالَ: «أَتَشْتَهِي شَيْئًا» قَالَ: أَشْتَهِي كَعْكًا،قَالَ: «نَعَمْ» فَطَلَبُوا لَهُ";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے کہ نبی ﷺ ایک بیمار کی عیادت کے لیے اس کے پاس تشریف لے گئے۔آپ ﷺ نے فرمایا: ’’کیا تمہیں کسی چیز کی خواہش ہے؟ کیا تمہارا جی کیک کھانے کو چاہتا ہے؟‘‘ اس نے کہا: ہاں،چنانچہ اس کے لیے کیک منگوایا گیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1440)`;
ibnemaja.anwaar = [500,1];