var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا بَكْرُ بْنُ يُونُسَ بْنِ بُكَيْرٍ،عَنْ مُوسَى بْنِ عَلِيِّ بْنِ رَبَاحٍ،عَنْ أَبِيهِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ وَالشَّرَابِ،فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ»";
ibnemaja.urdu = "حضرت عقبہ بن عامر جہنی ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اپنے مریضوں کو کھانے پینے پر مجبور نہ کیا کرو،انہیں اللہ تعالی کھلاتا اور پلاتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2040)`;
ibnemaja.anwaar = [500,2];