var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ،وَمُحَمَّدُ بْنُ الْحَارِثِ الْمِصْرِيَّانِ،قَالَا: حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ عُقَيْلٍ،عَنِ ابْنِ شِهَابٍ قَالَ: أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ،وَسَعِيدُ بْنُ الْمُسَيِّبِ،أَنَّ أَبَا هُرَيْرَةَ،أَخْبَرَهُمَا أَنَّهُ،سَمِعَ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءً مِنْ كُلِّ دَاءٍ،إِلَّا السَّامَ،وَالسَّامُ الْمَوْتُ،وَالْحَبَّةُ السَّوْدَاءُ،الشُّونِيزُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کالے دانے میں سام کے سوا ہر مرض کی شفا ہے۔‘‘ سام کا مطلب موت ہے،اور کالادانہ کلونجی ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;