var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ قَالَ: حَدَّثَنَا أَبُو عَاصِمٍ،عَنْ عُثْمَانَ بْنِ عَبْدِ الْمَلِكِ،قَالَ: سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ،يُحَدِّثُ عَنْ أَبِيهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَلَيْكُمْ بِهَذِهِ الْحَبَّةِ السَّوْدَاءِ،فَإِنَّ فِيهَا شِفَاءً مِنْ كُلِّ دَاءٍ،إِلَّا السَّامَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اس کالے دانے(کلونجی) کو اختیار کرو۔اس میں موت کے سوا ہر مرض کی شفا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;