var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنَا ابْنُ أَبِي فَرْوَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ النَّاقِعِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’کوئی شخص ٹھہرے ہوئے پانی میں ہرگز پیشاب نہ کرے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال البوصیري: ’’ ھذا إسناد ضعیف،ابن أبي فروۃ،اسمہ إسحاق: متفق علی ترکہ ‘‘ وھو متروک (تقریب: 368)`;
ibnemaja.anwaar = [389,1];