var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خِدَاشٍ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ زَكَرِيَّاءَ الْقُرَشِيُّ قَالَ: حَدَّثَنَا الزُّبَيْرُ بْنُ سَعِيدٍ الْهَاشِمِيُّ،عَنْ عَبْدِ الْحَمِيدِ بْنِ سَالِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَعِقَ الْعَسَلَ ثَلَاثَ غَدَوَاتٍ،كُلَّ شَهْرٍ،لَمْ يُصِبْهُ عَظِيمٌ مِنَ الْبَلَاءِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص مہینے میں تین دن صبح کے وقت شہد چاٹ لے،اسے کوئی بڑی آفت (بیماری) نہیں آئے گی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الزبیر بن سعید: لین الحدیث،و عبد الحمید:مجہول (تقریب: 1995،3761)`;
ibnemaja.anwaar = [501,1];