var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا عُمَرُ بْنُ سَهْلٍ قَالَ: حَدَّثَنَا أَبُو حَمْزَةَ الْعَطَّارُ،عَنِ الْحَسَنِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: أُهْدِيَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَسَلٌ،فَقَسَمَ بَيْنَنَا لُعْقَةً،لُعْقَةً،فَأَخَذْتُ لُعْقَتِي،ثُمَّ قُلْتُ: يَا رَسُولَ اللَّهِ،أَزْدَادُ أُخْرَى؟ قَالَ: «نَعَمْ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ ؓ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ کی خدمت میں شہد کا ہدیہ پیش کیا گیا۔آپ نے ہمارے درمیان ایک ایک چمچ تقسیم فرمایا۔میں نے اپنا حصہ لے لیا،پھر عرض کیا: اللہ کے رسول! مزید ایک چمچ لے لوں؟ فرمایا: ’’ہاں (لے لو)‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو حمزۃ إسحاق بن الربیع ضعفہ الجمہور و مع ذلک قال الحافظ: ’’ صدوق تکلم فیہ للقدر ‘‘ (تقریب: 352) <br>وضعفہ راجح والحسن عنعن`;
ibnemaja.anwaar = [501,1];