var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ سَلَمَةَ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: عَلَيْكُمْ بِالشِّفَاءَيْنِ: الْعَسَلِ،وَالْقُرْآنِ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دو شفا والی چیزیں اختیار کرو شہد اور قرآن۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو إسحاق عنعن <br>وأخرج الخطیب (385/11) بإسناد ضعیف منکر عن زید بن الحباب عن شعبۃ عن أبي إسحاق بہ !`;
ibnemaja.anwaar = [501,1];