var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ،سَمِعَ عَمْرَو بْنَ حُرَيْثٍ،يَقُولُ: سَمِعْتُ سَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ،يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَّ الْكَمْأَةَ مِنَ الْمَنِّ،الَّذِي أَنْزَلَ اللَّهُ عَلَى بَنِي إِسْرَائِيلَ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ»";
ibnemaja.urdu = "حضرت سعید بن زید بن عمرو بن نفیل ؓ سے روایت ہے،نبی ﷺ نے فرمایا: ’’کھمبی اس من سے جو اللہ بنی اسرائیل پر نازل کیا تھا۔اور اسکا پانی آنکھ کے لیے شفا ہے۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;