var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ: حَدَّثَنَا الْمُشْمَعِلُّ بْنُ إِيَاسٍ الْمُزَنِيُّ قَالَ: حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ،قَالَ سَمِعْتُ رَافِعَ بْنَ عَمْرٍو الْمُزَنِيَّ،قَالَ: سَمِعْتُ رَسُول اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْعَجْوَةُ وَالصَّخْرَةُ،مِنَ الْجَنَّةِ» قَالَ: عَبْدُ الرَّحْمَنِ: «حَفِظْتُ الصَّخْرَةَ مِنْ فِيهِ»";
ibnemaja.urdu = "حضرت رافع بن عمرو مزنیؓ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے یہ ارشاد سنا ’’عجوہ اور صخرہ جنت سے (آئے) ہیں۔‘‘\nحضرت عبدالرحمٰن بن مہدی ﷫ نے کہا: میں نے صخرہ کا لفظ خود اپنے استاد(مشمعل بن ایاس مزنی ؓ)کےمنہ سے سنا ہے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;