var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ شَرِبَ سُمًّا،فَقَتَلَ نَفْسَهُ،فَهُوَ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ،خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جس نے زہر پی کر خود کشی کر لی وہ جہنم میں ہمیشہ ہمیشہ ابد تک زہر پیتا رہے گا۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;