var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَرَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ،قَالَا: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ قَالَ: حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ،أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: سَمِعْتُ رَسُول اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «شِفَاءُ عِرْقِ النَّسَا،أَلْيَةُ شَاةٍ أَعْرَابِيَّةٍ تُذَابُ،ثُمَّ تُجَزَّأُ ثَلَاثَةَ أَجْزَاءٍ،ثُمَّ يُشْرَبُ عَلَى الرِّيقِ،فِي كُلِّ يَوْمٍ جُزْءٌ»";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے: رسول اللہ ﷺ نے فرمایا: عرق النساکا علاج یہ ہے کہ جنگلی بھیڑ(یا جنگلی نبے) کی چکتی کو لے کر پگلالیا جائے،پھر اس کےتین حصے کر لیے جائیں،پھر روزانہ ایک حصہ نہار منہ پی لیا جائے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;