var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَرَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ،قَالَا: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَطَبَّبَ،وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ،فَهُوَ ضَامِنٌ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمروؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص علاج کرے،حالانکہ اس سے پہلے وہ طبیب کےطور پر معروف نہیں تو وہ ذمہ دار ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (4586) نسائي (4834)`;
ibnemaja.anwaar = [502,1];