var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ قَالَ: حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَيْمُونٍ قَالَ: حَدَّثَنِي أَبِي،عَنْ زَيْدِ بْنِ أَرْقَمَ،قَالَ: «نَعَتَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ ذَاتِ الْجَنْبِ،وَرْسًا،وَقُسْطًا،وَزَيْتًا،يُلَدُّ بِهِ»";
ibnemaja.urdu = "حضرت زید بن ارقمؓ سےروایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ذاب الجنب (پسلی کے درد) کاعلاج یہ تجوز فرمایاکہ ورس،عود ہندی اورزیتون کےتیل کالدود کیا جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2078)`;
ibnemaja.anwaar = [502,1];