var ibnemaja = {};
ibnemaja.arabic = "أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ مُوسَى بْنِ عُبَيْدَةَ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: ذُكِرَتِ الْحُمَّى عِنْدَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَسَبَّهَا رَجُلٌ،فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسُبَّهَا،فَإِنَّهَا تَنْفِي الذُّنُوبَ،كَمَا تَنْفِي النَّارُ،خَبَثَ الْحَدِيدِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ کی مجلس میں بخار کا ذکر ہوا تو ایک آدمی نے اسے برا بھلا کہا۔نبی نے فرمایا:اس (بخار) کوبرا نہ کہو۔اس سے گناہ اس طرح دور ہو جاتے ہیں جس طرح آگ سے لوہے کی میل کچیل دور ہو جاتی ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;