var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَبْرَيْنِ جَدِيدَيْنِ فَقَالَ إِنَّهُمَا لَيُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا أَحَدُهُمَا فَكَانَ لَا يَسْتَنْزِهُ مِنْ بَوْلِهِ وَأَمَّا الْآخَرُ فَكَانَ يَمْشِي بِالنَّمِيمَةِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ دو نئی قبروں کے پاس سے گزرے تو فرمایا:’’ان دونوں(آدمیوں) کو عذاب ہو رہا ہے اور کسی بڑی وجہ سے عذاب نہیں ہو رہا۔ان میں سے ایک تو اپنے پیشاب سے نہیں بچتا تھا اور دوسرا چغل خوری کا عادی تھا۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;