var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ،فَابْرُدُوهَا بِالْمَاءِ»";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا:’’بخار جہنم کی بھاپ سے ہے: لہذا اس پانی کے ذریعےسے ٹھنڈا کرو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;