var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: «إِنَّ شِدَّةَ الْحُمَّى،مِنْ فَيْحِ جَهَنَّمَ،فَابْرُدُوهَا بِالْمَاءِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہاہ سے روایت ہے،نبی ﷺ نے فرمایا:’’بخار جہنم کی بھاپ میں سے (ایک قسم)ہے: لہذا اس پانی کے ذریعےسے ٹھنڈا کرو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;