var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «الْحُمَّى كِيرٌ مِنْ كِيرِ جَهَنَّمَ،فَنَحُّوهَا عَنْكُمْ بِالْمَاءِ الْبَارِدِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’بخار جہنم کی ایک دھونکنی ہے۔اسےٹھنڈے پانی کے ذریعے سے دور ہٹاؤ۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;