var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ:: إِنْ كَانَ فِي شَيْءٍ مِمَّا تَدَاوَوْنَ بِهِ خَيْرٌ،فَالْحِجَامَةُ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،نبی ﷺ نے فرمایا:’’جن چیزوں سے تم علاج کرتے ہو،اگر ان میں سے کسی میں بھلائی (اور فائدہ ہے) تو وہ (سینگی لگوانے میں) ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;