var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ قَالَ: حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ قَالَ: حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَا مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي،بِمَلَإٍ مِنَ الْمَلَائِكَةِ،إِلَّا كُلُّهُمْ يَقُولُ لِي: عَلَيْكَ،يَا مُحَمَّدُ بِالْحِجَامَةِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس رات مجھے سیر کرائی گئی (اورمعراج ہوئی)،میں فرشتوں کی جس جماعت کے پاس سےگزرا،وہ سب مجھے یہی کہتے رہے: حضرت محمد ﷺ سینگی لگوایا کریں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2053)`;
ibnemaja.anwaar = [502,1];