var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ: حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الْعَبْدُ الْحَجَّامُ،يَذْهَبُ بِالدَّمِ،وَيُخِفُّ الصُّلْبَ،وَيَجْلُو الْبَصَرَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’سینگی لگانے والا اچھا بندہ ہے۔خون لے جاتا ہے،کمر کو ہلکا کرتاہے اور بینائی کو تیز کرتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2053)`;
ibnemaja.anwaar = [502,1];