var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَا مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي بِمَلَإٍ،إِلَّا قَالُوا: يَا مُحَمَّدُ،مُرْ أُمَّتَكَ بِالْحِجَامَةِ";
ibnemaja.urdu = "حضرت انس بن مالک سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جس رات مجھے سیر کرائی گئی (اورمعراج ہوئی)،میں فرشتوں کی جس جماعت کے پاس سےگزرا،وہ سب مجھے یہی کہتے رہے: حضرت محمد ﷺ سینگی لگوایا کریں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>جبارۃ وکثیر بن سلیم مجروحان`;
ibnemaja.anwaar = [502,1];