var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرُ عَذَابِ الْقَبْرِ مِنْ الْبَوْلِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’عذاب قبر زیادہ تر پیشاب(سے احتیاط نہ کرے) کی وجہ سے ہوتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سلیمان الأعمش عنعن <br>و للحدیث شواھد ضعیفۃ منھا ما ذکرہ ابن أبي حاتم في علل الحدیث (26/1 ح 42) <br>و لم یذکر سندہ إلی حبان بن ھلال و حرمي و إبراھیم بن الحجاج و ھو ولد بعد وفاتھم سنۃ 240ھ فالخبر بلا سند وھو مردود و حدیث النسائي (1346،وسندہ حسن) یغني عنہ`;
ibnemaja.anwaar = [389,1];