var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ قَالَ: حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ قَالَ: حَدَّثَنِي عَلْقَمَةُ بْنُ أَبِي عَلْقَمَةَ،قَالَ: سَمِعْتُ عَبْدَ الرَّحْمَنِ الْأَعْرَجَ،قَالَ: سَمِعْتُ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ،يَقُولُ: «احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،بِلَحْيِ جَمَلٍ،وَهُوَ مُحْرِمٌ،وَسَطَ رَأْسِهِ»";
ibnemaja.urdu = "حضرت عبداللہ (بن مالک) ابن بحینہ ؓ سے روایت ہے،انہوں نے فرمایا: رسول اللہ نے لحی جمل کے مقام پر احرام کی حالت میں سر کے درمیان (تالو میں)سینگی لگوائی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;