var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ سَعْدٍ الْإِسْكَافِ،عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ،عَنْ عَلِيٍّ قَالَ: «نَزَلَ جِبْرِيلُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،بِحِجَامَةِ الْأَخْدَعَيْنِ،وَالْكَاهِلِ»";
ibnemaja.urdu = "حضرت علی ؓ سے روایت ہے،انہوں نے فرمایا: حضرت جبریل نےنازل ہو کر نبی ﷺ کو گردن کی رگوں پر اور دونوں کندھوں کےدرمیان (گردن کے قریب،سینگی لگوانے کی ہدایت کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>الأصبغ بن نباتۃ وسعد الأسکاف: متروکان (تقریب: 537،2241) ورمیا بالرفض`;
ibnemaja.anwaar = [502,1];