var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا ابْنُ ثَوْبَانَ،عَنْ أَبِيهِ،عَنْ أَبِي كَبْشَةَ الْأَنْمَارِيِّ،أَنَّهُ حَدَّثَهُ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،كَانَ يَحْتَجِمُ عَلَى هَامَتِهِ،وَبَيْنَ كَتِفَيْهِ،وَيَقُولُ: «مَنْ أَهْرَاقَ مِنْهُ هَذِهِ الدِّمَاءَ،فَلَا يَضُرُّهُ أَنْ لَا يَتَدَاوَى بِشَيْءٍ،لِشَيْءٍ»";
ibnemaja.urdu = "حضرت ابو کبشہ (سعید بن عمرو انماری) ؓ سے روایت ہے،انہوں نے فرمایا:نبی ﷺ سر پر اور کندھوں کے درمیان سینگی لگواتے تھے اور فرماتے تھے: ’’جو شخص اپنے جسم سے اس طرح (سینگی لگواکر) خون نکلواتا ہے،وہ اگر کسی بیماری کا کوئی اور علاج نہ کرےتو کوئی نقصان نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3859)`;
ibnemaja.anwaar = [502,1];