var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَقَطَ عَنْ فَرَسِهِ عَلَى جِذْعٍ،فَانْفَكَّتْ قَدَمُهُ» قَالَ وَكِيعٌ: يَعْنِي أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَيْهَا مِنْ وَثْءٍ";
ibnemaja.urdu = "حضرت جابر ؓسےروایت ہے کہ نبیﷺ نے فرمایا: گھوڑے سے کھجور درخت کے (کٹے ہوئے) تنے پرگر پڑے،اس سے آپ کے پاؤں کا جوڑ متاثر ہوگیا۔امام وکیع ﷫ نے فرمایا: حدیث کا مطلب یہ ہے کہ نبی ﷺ نے تکلیف کی وجہ سے پاؤں پر سینگی لگوائی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (602)`;
ibnemaja.anwaar = [502,1];