var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عُثْمَانُ بْنُ مَطَرٍ،عَنْ زَكَرِيَّا بْنِ مَيْسَرَةَ،عَنِ النَّهَّاسِ بْنِ قَهْمٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَنْ أَرَادَ الْحِجَامَةَ،فَلْيَتَحَرَّ سَبْعَةَ عَشَرَ،أَوْ تِسْعَةَ عَشَرَ،أَوْ إِحْدَى وَعِشْرِينَ،وَلَا يَتَبَيَّغْ بِأَحَدِكُمُ الدَّمُ فَيَقْتُلَهُ»";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص سینگی لگوانا چاہے،اسے چاہیے کہ (چاند کی)ستر ہ،انیس یااکیس تاریخ کو سینگی لگوانے کی کوشش کرے۔ایسا نہ ہو کہ دوران خون میں خلل واقع ہو اور وفات ہوجائے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>نہاس بن قھم: ضعیف <br>وتلمیذہ زکریا بن میسرۃ مستور،و عثمان بن مطر: ضعیف (تقریب: 2027،4519) <br>والراوي عنہ سوید بن سعید ضعیف <br>فالسند ظلمات`;
ibnemaja.anwaar = [503,1];