var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ،عَنْ لَيْثٍ،عَنْ مُجَاهِدٍ،عَنْ عَقَّارِ بْنِ الْمُغِيرَةِ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اكْتَوَى،أَوِ اسْتَرْقَى،فَقَدْ بَرِئَ مِنَ التَّوَكُّلِ»";
ibnemaja.urdu = "حضرت عقار رحمہ اللہ اپنے والد (حضرت مغیرہ بن شعبہ ؓ) روایت کرتے ہیں،نبی ﷺ نے فرمایا:’’جس نے خود کو داغا،یادام کروایا،وہ توکل سے محروم ہوگیا۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;