var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَسْوَدُ بْنُ شَيْبَانَ حَدَّثَنِي بَحْرُ بْنُ مَرَّارٍ عَنْ جَدِّهِ أَبِي بَكْرَةَ قَالَ مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَبْرَيْنِ فَقَالَ إِنَّهُمَا لَيُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا أَحَدُهُمَا فَيُعَذَّبُ فِي الْبَوْلِ وَأَمَّا الْآخَرُ فَيُعَذَّبُ فِي الْغَيْبَةِ";
ibnemaja.urdu = "سیدنا ابو بکرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ دو قبروں کے پاس سے گزرے تو فرمایا: ان دو شخصوں کو عذاب ہو رہا ہے۔اور عذاب بھی کسی بڑے کام کی وجہ سے نہیں ہو رہا۔ایک کو تو پیشاب کی وجہ سے عذاب ہو رہا ہے اور دوسرے کو غیبت کی سزا مل رہی ہے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;