var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا هُشَيْمٌ،عَنْ مَنْصُورٍ،وَيُونُسُ،عَنِ الْحَسَنِ،عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَنِ الْكَيِّ،فَاكْتَوَيْتُ،فَمَا أَفْلَحْتُ،وَلَا أَنْجَحْتُ»";
ibnemaja.urdu = "حضرت عمران بن حصین ؓ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے داغنے سے منع فرمایا: میں نے خود کو داغا تو مجھے فائدہ نہ ہوا اور میں کامیاب نہ ہوا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;