var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ قَالَ: حَدَّثَنَا سَالِمٌ الْأَفْطَسُ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: الشِّفَاءُ فِي ثَلَاثٍ: شَرْبَةِ عَسَلٍ،وَشَرْطَةِ مِحْجَمٍ،وَكَيَّةٍ بِنَارٍ،وَأَنْهَى أُمَّتِي عَنِ الْكَيِّ رَفَعَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’شفا تین چیزوں میں ہے: شہد پینے میں،سینگی کے زخم میں اور آگ کے ساتھ داغنے میں۔اور میں اپنی امت کو داغنے سےمنع کرتا ہوں۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;