var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ،عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،قَالَ: «مَرِضَ أُبَيُّ بْنُ كَعْبٍ مَرَضًا،فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،طَبِيبًا،فَكَوَاهُ عَلَى أَكْحَلِهِ»";
ibnemaja.urdu = "حضرت جابر ؓ سے روایت ہے،انہوں نے فرمایا: حضرت ابی بن کعب بیمار ہوگئے۔نبی ﷺ نے این کے پاس ایک طبیب بھیجا۔اس نے ان کی رگ اکحل پر داغ پر دیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;