var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ قَالَ: حَدَّثَنَا أَبُو عَاصِمٍ قَالَ: حَدَّثَنِي عُثْمَانُ بْنُ عَبْدِ الْمَلِكِ،قَالَ: سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ،يُحَدِّثُ عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بِالْإِثْمِدِ،فَإِنَّهُ يَجْلُو الْبَصَرَ،وَيُنْبِتُ الشَّعَرَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اثمد سرمہ (آنکھوں میں لگانا) اپنےاوپر لازم کرلو کیونکہ وہ نظر کو تیز کرتا اور (پلکوں کے) بال اگاتاہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;