var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَحْيَى بْنُ آدَمَ،عَنْ سُفْيَانَ،عَنِ ابْنِ خُثَيْمٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ أَكْحَالِكُمُ الْإِثْمِدُ،يَجْلُو الْبَصَرَ،وَيُنْبِتُ الشَّعَرَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:تمہارا بہترین سرمہ اثمد ہے۔وہ نظر کو تیز کرتااو ر(پلکوں کے) بال اگاتاہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;