var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُمَرَ قَالَ: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ،عَنْ ثَوْرِ بْنِ يَزِيدَ،عَنْ حُصَيْنٍ الْحِمْيَرِيِّ،عَنْ أَبِي سَعْدِ الْخَيْرِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَنِ اكْتَحَلَ فَلْيُوتِرْ،مَنْ فَعَلَ،فَقَدْ أَحْسَنَ،وَمَنْ لَا،فَلَا حَرَجَ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جو سرمہ لگائے،وہ طاق(ایک یا تین بار) لگائے،جس نے یہ کام کیا،اس نے اچھا کیا اور جس نےنہ کیااس پر کوئی حرج نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (337)`;
ibnemaja.anwaar = [503,1];