var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ عَبَّادِ بْنِ مَنْصُورٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «كَانَتْ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُكْحُلَةٌ،يَكْتَحِلُ مِنْهَا ثَلَاثًا،فِي كُلِّ عَيْنٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ کے پاس ایک سرمے دانی تھی۔آپ اس سے ہر آنکھ میں تین بار سرمہ لگاتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (1757)`;
ibnemaja.anwaar = [503,1];