var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عُتْبَةَ بْنِ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ قَالَ: حَدَّثَنَا سَعَّادُ بْنُ سُلَيْمَانَ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ الدَّوَاءِ الْقُرْآنُ»";
ibnemaja.urdu = "حضرت علی ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بہترین دوا قرآن ہے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث الآتي (3533)<br>فی الحدیث علل منہا ضعف الحارث الأعور: ضعیف`;
ibnemaja.anwaar = [503,1];