var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنَا فَائِدٌ،مَوْلَى عُبَيْدِ اللَّهِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ قَالَ: حَدَّثَنِي مَوْلَايَ عُبَيْدُ اللَّهِ قَالَ: حَدَّثَتْنِي جَدَّتِي سَلْمَى أُمُّ رَافِعٍ،مَوْلَاةُ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: «كَانَ لَا يُصِيبُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَرْحَةٌ،وَلَا شَوْكَةٌ،إِلَّا وَضَعَ عَلَيْهِ الْحِنَّاءَ»";
ibnemaja.urdu = "رسول اللہ کس آرزو کردہ خادمہ حضرت ام رافع سلمی رضی اللہ عنہا سے روایت ہے،انہوں نے کہا: نبی ﷺ کو جب بھی کوئی زخم آجاتا کا نٹا چبھ جاتا تو آپ اس پر منہدی لگاتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3858) ترمذي (2054)`;
ibnemaja.anwaar = [503,1];