var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ: حَدَّثَنَا حُمَيْدٌ،عَنْ أَنَسٍ،أَنَّ نَاسًا مِنْ عُرَيْنَةَ،قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَاجْتَوَوْا الْمَدِينَةَ،فَقَالَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ خَرَجْتُمْ إِلَى ذَوْدٍ لَنَا،فَشَرِبْتُمْ مِنْ أَلْبَانِهَا،وَأَبْوَالِهَا» فَفَعَلُوا";
ibnemaja.urdu = "حضرت انس ؓ سےروایت ہے کہ قبیلۂ عرینہ کے کچھ افراد اللہ کے رسول کی خدمت میں حاضر ہوئے۔انہیں مدینہ منورہ کی آب و ہوا موافق نہ آئی،چنانچہ آپ ﷺ نے ان سے فرمایا::’’اگر تم ہمارے اونٹوں کے ریوڑ میں چلے جاؤ او ران کا دودھ او رپیشاب پیو (تو صحت یاب ہو جاؤ گے)‘‘ چنانچہ انہوں نے ایسے ہی کیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;