var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنِ ابْنِ أَبِي ذِئْبٍ،عَنْ سَعِيدِ بْنِ خَالِدٍ،عَنْ أَبِي سَلَمَةَ قَالَ: حَدَّثَنِي أَبُو سَعِيدٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «فِي أَحَدِ جَنَاحَيِ الذُّبَابِ سُمٌّ،وَفِي الْآخَرِ شِفَاءٌ،فَإِذَا وَقَعَ فِي الطَّعَامِ،فَامْقُلُوهُ فِيهِ،فَإِنَّهُ يُقَدِّمُ السُّمَّ،وَيُؤَخِّرُ الشِّفَاءَ»";
ibnemaja.urdu = "حضرت ابو سعید ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مکھی کے ایک پر میں زہر اور دوسرےمیں شفا ہے۔جب وہ کھانے (یاپینے)گر پڑے تو اسے اس میں ڈبو دو،(پھر نکال کر پھینک دو) کیونکہ وہ زہر (والاپر) آگے اور شفا (والاپر) پیچھے رکھتی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;