var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ،عَنْ عُتْبَةَ بْنِ مُسْلِمٍ،عَنْ عُبَيْدِ بْنِ حُنَيْنٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِذَا وَقَعَ الذُّبَابُ فِي شَرَابِكُمْ،فَلْيَغْمِسْهُ فِيهِ،ثُمَّ لِيَطْرَحْهُ،فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً،وَفِي الْآخَرِ شِفَاءً»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،نبی ﷺ نے فرمایا:’’جب تمہارے (کسی) کے مشروب میں مکھی گر پڑے تو اسے چاہیے کہ اس میں ڈبو دے،پھر(باہر نکل کر) پھینک دے کیونکہ اس کے ایک پر میں بیماری اور دوسرے میں شفا ہے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;