var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ،عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى،عَنْ أُمَيَّةَ بْنِ هِنْدٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «الْعَيْنُ حَقٌّ»";
ibnemaja.urdu = "حضرت عامر بن ربیعہ ؓ سے روایت ہے،نبی ﷺ نے فرمایا: ’’نظر کالگنا حقیقت ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;