var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ قَالَ: حَدَّثَنَا وُهَيْبٌ،عَنْ أَبِي وَاقِدٍ،عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اسْتَعِيذُوا بِاللَّهِ،فَإِنَّ الْعَيْنَ حَقٌّ»";
ibnemaja.urdu = "حضرت عائشہ ؓ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’(نظر سے) اللہ کی پناہ مانگو کیونکہ نظر کا لگنا ایک حقیقت ہے‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو واقد صالح بن محمد بن زائدۃ: ضعیف <br>والحدیث السابق (الأصل: 3507) یغني عنہ`;
ibnemaja.anwaar = [503,2];