var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مَسْلَمَةُ بْنُ عَلِيٍّ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ مَرَّ رَجُلٌ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ فَلَمَّا فَرَغَ ضَرَبَ بِكَفَّيْهِ الْأَرْضَ فَتَيَمَّمَ ثُمَّ رَدَّ عَلَيْهِ السَّلَامَ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ پیشاب کر رہے تھے کہ ایک آدمی پاس سے گزرا،اس نے آپ ﷺ پر سلام کیا۔نبی ﷺ نے جواب نہ دیا۔جب آپ فارغ ہوئے تو زمین پر دونوں ہاتھ مار کر تیمّم کیا،پھر اس کے سلام کا جواب دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>مسلمۃ بن علي: متروک (تقریب: 6662) <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [389,2];