var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ عُرْوَةَ بْنِ عَامِرٍ،عَنْ عُبَيْدِ بْنِ رِفَاعَةَ الزُّرَقِيِّ،قَالَ: قَالَتْ أَسْمَاءُ يَا رَسُولَ اللَّهِ إِنَّ بَنِي جَعْفَرٍ تُصِيبُهُمُ الْعَيْنُ،فَأَسْتَرْقِي لَهُمْ قَالَ: «نَعَمْ،فَلَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرَ،سَبَقَتْهُ الْعَيْنُ»";
ibnemaja.urdu = "حضرت عبید بن رفاعہ زرقی ؓ سے روایتہے،حضرت اسماء رضی اللہ عنہا نے ہا:اللہ کے رسول! جعفر کےبیٹوں کونظر لگ جاتی ہے،میں انہیں دم کروالیا کروں؟ رسول اللہ ﷺ نے فرمایا: ’’ہاں،اگر کوئی چیز تقدیر کامقابلہ کرسکتی تو نظر اس (تقدیر)سے آگے بڑھ جاتی۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;