var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ،عَنْ عَبَّادٍ،عَنِ الْجُرَيْرِيِّ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي سَعِيدٍ،قَالَ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ عَيْنِ الْجَانِّ،ثُمَّ أَعْيُنِ الْإِنْسِ،فَلَمَّا نَزَلَتِ الْمُعَوِّذَتَانِ،أَخَذَهُمَا وَتَرَكَ مَا سِوَى ذَلِكَ»";
ibnemaja.urdu = "حضرت ابو سعید ؓ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جنوں اور انسانوں کو نظر سے پناہ ملنے کی دعا کیا کرتے تھے۔جب معوذتین (سورۃ فلق اور سورۃ الناس) نازل ہوئیں تو نبی ﷺ نے انہیں اختیار فرمالیااور ان کے علاوہ دوسری چیزیں چھوڑ دیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2058) نسائي (5496)`;
ibnemaja.anwaar = [504,1];