var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ،عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ،عَنْ حُصَيْنٍ،عَنْ الشَّعْبِيِّ،عَنْ بُرَيْدَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ،أَوْ حُمَةٍ»";
ibnemaja.urdu = "حضرت بریدہ ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دم تو صرف نظر سے یا ڈنک مارنے والی چیز (بچھو وغیرہ کے ڈسنے کی وجہ) سے ہوتا ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;