var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنْ مُحَمَّدِ بْنِ عُمَارَةَ،عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ،أَنَّ خَالِدَةَ بِنْتَ أَنَسٍ أُمَّ بَنِي حَزْمٍ السَّاعِدِيَّةَ،جَاءَتْ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَعَرَضَتْ عَلَيْهِ الرُّقَى،فَأَمَرَهَا بِهَا»";
ibnemaja.urdu = "حضرت ابو بکر بن محمد رحمہ اللہ سے روایت ہے،کہ حضرت خالدہ بنت انس ام بنی حزم ساعدیہ رضی اللہ عنہا نبی ﷺ کی خدمت میں حاضر ہوئیں اور آپ کو کچھ دم سنائے (اور دریافت کیا کہ یہ جائز ہیں یہ نہیں؟) نبی ﷺ نے انہیں ان کے ساتھ دم کرنے کا حکم دیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;