var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَاصِمٍ،عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رَخَّصَ فِي الرُّقْيَةِ مِنَ الْحُمَةِ،وَالْعَيْنِ،وَالنَّمْلَةِ»";
ibnemaja.urdu = "حضرت انس ؓ سے روایت ہے کہ نبی ﷺ نے (زہریلی چیزوں کے) ڈنک کا،نظر کا اور نملہ کا دم کرنے کی اجازت دی ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;