var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،وَهَنَّادُ بْنُ السَّرِيِّ،قَالَا: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ مُغِيرَةَ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: «رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فِي الرُّقْيَةِ مِنَ الْحَيَّةِ،وَالْعَقْرَبِ»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا:کہ رسول اللہ ﷺ نے سانپ اور بچھو کے دم کی اجازت دی ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;