var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَفَّانُ قَالَ: حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ قَالَ: حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ قَالَ: حَدَّثَنِي أَبُو بَكْرِ بْنُ عَمْرِو بْنِ حَزْمٍ،عَنْ عَمْرِو بْنِ حَزْمٍ،قَالَ: «عَرَضْتُ النَّهْشَةَ مِنَ الْحَيَّةِ عَلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَأَمَرَ بِهَا»";
ibnemaja.urdu = "حضرت عمرو بن حزم ؓ سے روایت ہے،انہوں نے فرمایا:میں نے رسو ل اللہ ﷺ کو سانپ کے کاٹے کاایک دم سنایا،یا آپ کے سانپ کے کاٹے کا ایک دم سنایا گیاتو رسو ل اللہ ﷺ نے اسے پڑھنے (اور مریض پر دم کرنے) کاحکم دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو بکر لم یدرک جدہ (تحفۃ الأشراف 149/8 ح 10729)`;
ibnemaja.anwaar = [504,1];