var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ هَاشِمِ بْنِ الْبَرِيدِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا مَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَسَلَّمَ عَلَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتَنِي عَلَى مِثْلِ هَذِهِ الْحَالَةِ فَلَا تُسَلِّمْ عَلَيَّ فَإِنَّكَ إِنْ فَعَلْتَ ذَلِكَ لَمْ أَرُدَّ عَلَيْكَ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ پیشاب کر رہے تھے کہ ایک آدمی پاس سے گزرا تو اس نے سلام کہا۔رسول اللہ ﷺ نے اس سے فرمایا:’’جب تم مجھے اس حالت میں دیکھو تو سلام نہ کہا کرو۔اگر تم ایسا کرو گے تو میں تمہیں جواب نہیں دوں گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن محمد بن عقیل ضعیف <br>والحدیث الآتي (الأصل: 353) یغني عنہ`;
ibnemaja.anwaar = [390,1];