var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ رَبِّهِ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،كَانَ مِمَّا يَقُولُ لِلْمَرِيضِ بِبُزَاقِهِ بِإِصْبَعِهِ «بِسْمِ اللَّهِ،تُرْبَةُ أَرْضِنَا،بِرِيقَةِ بَعْضِنَا،لِيُشْفَى سَقِيمُنَا بِإِذْنِ رَبِّنَا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہاسےروایت ہے کہ نبی ﷺ مریض کی شفا یابی کے لیے انگلی پر لعاب دہن لگا کر یوں کہتے تھے: «بِسْمِ اللَّہِ تُرْبَۃُ أَرْضِنَا بِرِیقَۃِ بَعْضِنَا یُشْفَی سَقِیمُنَا بِإِذْنِ رَبِّنَا))\nاللہ کے نام سے،ہماری زمین کی مٹی،ہم میں سےبعض کےلعاب دہن سے مل کر،ہمارے رب کےحکم سے،ہمارے مریض کی شفا یابی کا ذریعہ ہوگی۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;