var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ قَالَ: حَدَّثَنَا مَعْنُ بْنُ عِيسَى،ح وحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا بِشْرُ بْنُ عُمَرَ قَالَا: حَدَّثَنَا مَالِكٌ،عَنِ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ،فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ،وَأَمْسَحُ عَلَيْهِ بِيَدِهِ،رَجَاءَ بَرَكَتِهَا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سےروایت ہے کہ انہوں نے فرمایا:نبی ﷺجب بیمار ہوجاتے تومعوذات آپ کا مرض شدت اختیار کر گیاتو میں نبی ﷺ پر (یہ سورتیں)پڑھتی تھی،اور آپ کاہاتھ اس سے برکت کی امید پر (آپ کے جسم پر)پھیرتی تھی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;