var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ وَالْحُسَيْنُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلَانِيُّ قَالَا حَدَّثَنَا أَبُو دَاوُدَ عَنْ سُفْيَانَ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ مَرَّ رَجُلٌ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ پیشاب کر رہے تھے کہ ایک آدمی پاس سے گزرا۔اس نے سلام کہا تو آپ نے جواب نہ دیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;