var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ مُبَارَكٍ،عَنِ الْحَسَنِ،عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: رَأَى رَجُلًا فِي يَدِهِ حَلْقَةٌ مِنْ صُفْرٍ فَقَالَ: «مَا هَذِهِ الْحَلْقَةُ؟» قَالَ: هَذِهِ مِنَ الْوَاهِنَةِ. قَالَ: «انْزِعْهَا فَإِنَّهَا لَا تَزِيدُكَ إِلَّا وَهْنًا»";
ibnemaja.urdu = "حضرت عمران بن حصین ؓ سےروایت ہے کہ نبی ﷺ نے ایک شخص کے ہاتھ میں پیتل کا حلقہ (چھلایاکڑا) دیکھا تو فرمایا: ’’یہ حلقہ کیسا ہے؟‘‘ اس نے کہا: یہ واہنہ کی بیماری کی وجہ سے ہے۔آپ نے فرمایا: اسے اتار دےاس سے تیری کمزوری میں اضافہ ہی ہوگا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مبارک بن فضالۃ مدلس و عنعن <br>وصرح بسماع الحسن من عمران وھو شاذ،وسندہ ضعیف من أجل عنعنۃ مبارک والحسن البصري`;
ibnemaja.anwaar = [504,1];