var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ قَالَ: حَدَّثَنَا سَعَّادُ بْنُ سُلَيْمَانَ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ الدَّوَاءِ الْقُرْآنُ»";
ibnemaja.urdu = "حضرت علی ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’سب سےبہتردوا قرآن ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (3501)`;
ibnemaja.anwaar = [504,1];