var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي يُونُسُ،عَنِ ابْنِ شِهَابٍ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اقْتُلُوا الْحَيَّاتِ،وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ،وَالْأَبْتَرَ فَإِنَّهُمَا يَلْتَمِسَانِ الْبَصَرَ،وَيُسْقِطَانِ الْحَبَلَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے،رسول اللہ ﷺ ہے فرمایا: ’’سانپوں کو قتل کرو،اور دو لکیروں والے سانپ کو اور دم کٹے سانپ کو قتل کر دو کیونکہ یہ بینائی ضائع کردیتے ہیں اور حمل گرا دیتے ہیں۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;