var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ سَلَمَةَ،عَنْ عِيسَى بْنِ عَاصِمٍ،عَنْ زِرٍّ،عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الطِّيَرَةُ شِرْكٌ وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بدفالی شرک ہے۔اور ہم میں سے ہر کسی کو کوئی نہ کوئی وہم ہو ہی جاتا ہے،لیکن اللہ تعالی توکل کی وجہ سے اسے دفع کردیتاہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;