var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى،وَلَا طِيَرَةَ،وَلَا هَامَةَ،وَلَا صَفَرَ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جھوٹ کی کوئی حقیقت نہیں،بدشگونی کی کوئی حقیقت نہیں،کھوپڑی کے الو کی کوئی حقیقت اور صفر کی کوئی حقیقت نہیں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;