var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ غَائِطٍ قَطُّ إِلَّا مَسَّ مَاءً";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں نے نہیں دیکھا کہ رسول اللہ ﷺ کبھی بیت الخلاء سے تشریف لائے ہوں اور پانی استعمال نہ کیا ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>إبراہیم النخعي کان یدلس وعنعن`;
ibnemaja.anwaar = [390,1];