var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ،وَمُجَاهِدُ بْنُ مُوسَى،وَمُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ قَالُوا: حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا مُفَضَّلُ بْنُ فَضَالَةَ،عَنْ حَبِيبِ بْنِ الشَّهِيدِ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَخَذَ بِيَدِ رَجُلٍ مَجْذُومٍ فَأَدْخَلَهَا مَعَهُ فِي الْقَصْعَةِ،ثُمَّ قَالَ: «كُلْ،ثِقَةً بِاللَّهِ وَتَوَكُّلًا عَلَى اللَّهِ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ ؓ سے روایت ہے کہ رسول اللہﷺ نے ایک کوڑھی کا ہاتھ پکڑکر اپنے ساتھ پیالے میں ڈال دیا (اور اسے کھانے میں شریک کر لیا۔) پھر فرمایا:’’کھا،اللہ پر اعتماد کرتے ہوئے او راللہ پر توکل کرتے ہوئے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (3925) ترمذي (1817)`;
ibnemaja.anwaar = [504,1];