var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا هُشَيْمٌ،عَنْ يَعْلَى بْنِ عَطَاءٍ،عَنْ رَجُلٍ مِنْ آلِ الشَّرِيدِ يُقَالُ لَهُ: عَمْرٌو عَنْ أَبِيهِ قَالَ: كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ،فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «ارْجِعْ فَقَدْ بَايَعْنَاكَ»";
ibnemaja.urdu = "حضرت عمرو رحمہ اللہ اپنے والد حضرت شرید ثقفی سے روایت کرتے ہیں،انہوں نے فرمایا: قبیلۂ ثقیف کے وفد میں ایک مجذوم آدمی تھا۔نبی ﷺ نے اسے پیغام بھیجا: ’’واپس جا،ہم نے تیری بیعت لے لی۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;