var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خَمِيصَةٍ لَهَا أَعْلَامٌ فَقَالَ شَغَلَنِي أَعْلَامُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَأْتُونِي بِأَنْبِجَانِيَّتِهِ";
ibnemaja.urdu = "حضرت عائشہ ؓ سے روایت ہے،انھوں نے فرمایا : رسول اللہ ﷺ نے چادر اوڑھ کر نماز پڑھی جس میں نقش و نگار تھے۔پھر فرمایا مجھے اس کے نقش و نگار نے مشغول کر دیا۔اسے ابو جہم ؓکے پاس لے جاؤ اور ان سے ان سے ان کی سادہ چادر لے آؤ";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;