var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ أَخْبَرَنِي سُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ أَبِي بُرْدَةَ قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَأَخْرَجَتْ لِي إِزَارًا غَلِيظًا مِنْ الَّتِي تُصْنَعُ بِالْيَمَنِ وَكِسَاءً مِنْ هَذِهِ الْأَكْسِيَةِ الَّتِي تُدْعَى الْمُلَبَّدَةَ وَأَقْسَمَتْ لِي لَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمَا";
ibnemaja.urdu = "حضرت ابوہرہ ؓ سے روایت ہے انھوں نے فرمایا: میں الم المومنین حضرت عائشہؓ کی خدمت میں حاضر ہوا۔انھوں نے ایک موٹا تہ بند دکھایا جو یمن میں بنایا جاتا ہے اور ایک چادر دکھائی جسے ملبدہ کہتے ہیں۔انھوں نےقسم کھا کر فرمایا: رسول اللہ ﷺ ان دو کپڑوں میں فوت ہوئے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;