var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الْأَحْوَصِ بْنِ حَكِيمٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي شَمْلَةٍ قَدْ عَقَدَ عَلَيْهَا";
ibnemaja.urdu = "حضرت عبادہ بن صامت ؓ سے روایت ہے کہ رسول اللہ ﷺ نے ایک چادر میں نماز پڑھی جس پر گرہ لگی ہوئی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>خالد بن معدان لم یسمع من عبادۃ کما في أطراف المسند (647/2) <br>والأحوص بن حکیم: ضعیف`;
ibnemaja.anwaar = [505,1];