var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا مَالِكٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ رِدَاءٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ";
ibnemaja.urdu = "انس بن مالک ؓ سے روایت ہے انھوں نے فرمایا: میں نبی ﷺ کے ہمراہ تھا جبکہ آپ موٹے کنارے والی نجرانی چادر اوڑھ رکھی تھی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;