var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الْأَسْوَدِ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَائِشَةَ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسُبُّ أَحَدًا وَلَا يُطْوَى لَهُ ثَوْبٌ";
ibnemaja.urdu = "حضرت عائشہ سے روایت ہے انھوں نے فرمایا: میں نے رسول اللہ ﷺ کو کبھی کسی گالی دیتے نہیں دیکھا اور نہ آپ کے لئے کپڑا لپیٹ کر رکھا جاتا تھا۔(ایک ہی جوڑا ہو ہوتا تھا۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن لہیعۃ: ضعیف من جھۃ سوء حفظہ`;
ibnemaja.anwaar = [505,1];