var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ مَهْدِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى عُمَرَ قَمِيصًا أَبْيَضَ فَقَالَ ثَوْبُكَ هَذَا غَسِيلٌ أَمْ جَدِيدٌ قَالَ لَا بَلْ غَسِيلٌ قَالَ الْبَسْ جَدِيدًا وَعِشْ حَمِيدًا وَمُتْ شَهِيدًا";
ibnemaja.urdu = "حضر ت عبداللہ بن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے حضرت عمر ؓ کو سفید قمیض پہنے دیکھا تو فرمایا: تمھارا یہ لباس دھلا ہوا ہے یا نیا ہے؟ انھوں نے کہا: بلکہ دھلا ہوا ہے۔آپ نے فرمایا: [الیس جدیدا وعش حمید ا ومت شھید ا] تمھیں نیا لباس قابل تعریف زندگی اور شہادت کی موت نصیب ہو";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الزھري عنعن <br>ولہ شاھد ضعیف عند ابن أبي شیبۃ (8/ 265۔266،10 / 402)`;
ibnemaja.anwaar = [505,1];