var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لِبْسَتَيْنِ فَأَمَّا اللِّبْسَتَانِ فَاشْتِمَالُ الصَّمَّاءِ وَالِاحْتِبَاءُ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَيْءٌ";
ibnemaja.urdu = "حضرت ابو سعید خدری ؓ سے روایت ہے نبی ﷺ نے دو طرح لباس پہنے پہنے ہو منع فرمایا ہے۔لباس پہنے کے یہ دو ممنوع انداز یہ ہیں: چادر کو جسم پر اس انداز سے لپیٹنا کہ ہاتھوں اور بازؤں کو حرکت دینا مشکل ہو جائے۔اور ایک کپڑے میں اس طرح بیٹھنا کہ اعضائے مشتور ظاہر ہونے کا اندیشہ ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;