var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنْ جَابِرٍ عَنْ زَيْدٍ الْعَمِّيِّ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْسِلُ مَقْعَدَتَهُ ثَلَاثًا قَالَ ابْنُ عُمَرَ فَعَلْنَاهُ فَوَجَدْنَاهُ دَوَاءً وَطُهُورًا قَالَ أَبُو الْحَسَنِ بْنُ سَلَمَةَ حَدَّثَنَا أَبُو حَاتِمٍ وَإِبْرَاهِيمُ بْنُ سُلَيْمَانَ الْوَاسِطِيُّ قَالَا حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ نَحْوَهُ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ (استنجا کرتے وقت پشت تین بار دھوتے تھے۔سیدنا عبداللہ بن عمر رضی اللہ عنہما نے فرمایا: ہم نے اس عمل کو اختیار کیا تو اسے علاج بھی پایا اور پاکیزگی کا باعث بھی۔\nابو الحسن بن سلمہ قطان نے اپنی سند سے بھی مذکورہ روایت کی طرح بیان کیا ہے-";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال البوصیري: ’’ فیہ زید العمي وھو ضعیف ‘‘ زید العمي: ضعیف <br>وجابر الجعفي ضعیف رافضي`;
ibnemaja.anwaar = [390,1];