var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لِبْسَتَيْنِ عَنْ اشْتِمَالِ الصَّمَّاءِ وَعَنْ الِاحْتِبَاءِ فِي الثَّوْبِ الْوَاحِدِ يُفْضِي بِفَرْجِهِ إِلَى السَّمَاءِ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ ﷺ نے دو انداز سے لباس پہنے سے منع فرمایا : اشتمال صماء سے اور ایک کپڑے کے ساتھ اس طرح احتباء کرنے سے کے آسمان کی طرف اس کا ستر کھلا ہوا ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;