var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ سَعْدِ بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لِبْسَتَيْنِ اشْتِمَالِ الصَّمَّاءِ وَالِاحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْتَ مُفْضٍ فَرْجَكَ إِلَى السَّمَاءِ";
ibnemaja.urdu = "حضرت عائشہؓ سے روایت ہے انھوں نے فرمایا: رسول اللہ ﷺ نے دو انداز سے لباس پہنے سے منع فرمایا: اشتمال صماء سے اور ایک کپڑے کہ ساتھ اس طرح اجتباء کرنے سے کہ تمھارا ستر آسمان کی طرف کھلا ہو۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;