var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ قَالَ قَالَ لِي يَا بُنَيَّ لَوْ شَهِدْتَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصَابَتْنَا السَّمَاءُ لَحَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ";
ibnemaja.urdu = "حضر ت ابوبردہ رحمہ اللہ اپنے والد ابو موسیٰ اشعری ؓسے روایت کرتے ہوئے فرماتے ہیں کہ انھوں نے مجھ سے فرمایا: بیٹا!کاش تم نے ہمیں اس وقت دیکھا ہوتا جب ہم نبی ﷺ کے ساتھ ہوتےتھے ہم پر بارش ہوجاتی (تو ایسی بو پیداہوتی) ہماری بو کو بیھڑون کی بو سمھجتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4033) ترمذي (2479)`;
ibnemaja.anwaar = [505,2];