var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ كَرَامَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا الْأَحْوَصُ بْنُ حَكِيمٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ وَعَلَيْهِ جُبَّةٌ رُومِيَّةٌ مِنْ صُوفٍ ضَيِّقَةُ الْكُمَّيْنِ فَصَلَّى بِنَا فِيهَا لَيْسَ عَلَيْهِ شَيْءٌ غَيْرُهَا";
ibnemaja.urdu = "حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک دن رسول اللہ ﷺ(گھر سے)ہمارے پاس تشریف لاءے تو آپ نے اون کا بنا ہوا،تنگ آستینوں والا ایک رومی جبہ پہن رکھا تھا۔آپ ﷺ نے اسی لباس میں ہمیں نماز پڑحائی جبکہ آپ کے جسم مبارک پر اور کوئی کپڑا نہ تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>خالد بن معدان: لم یسمع من عبادۃ،والأحوص ضعیف`;
ibnemaja.anwaar = [506,1];