var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ وَأَحْمَدُ بْنُ الْأَزْهَرِ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا يَزِيدُ بْنُ السِّمْطِ حَدَّثَنِي الْوَضِينُ بْنُ عَطَاءٍ عَنْ مَحْفُوظِ بْنِ عَلْقَمَةَ عَنْ سَلْمَانَ الْفَارِسِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَقَلَبَ جُبَّةَ صُوفٍ كَانَتْ عَلَيْهِ فَمَسَحَ بِهَا وَجْهَهُ";
ibnemaja.urdu = "حضرت سلمان فارسیؓ سے روایت ہے کہ رسول اللہ ﷺ نے وضو کیا،پھر جسم مبارک پر پہنا ہوا اونی جبہ الٹا کر اس سے چہر ہ مبارک پونچھ لیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (468)`;
ibnemaja.anwaar = [506,1];