var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا مُوسَى بْنُ الْفَضْلِ عَنْ شُعْبَةَ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِمُ غَنَمًا فِي آذَانِهَا وَرَأَيْتُهُ مُتَّزِرًا بِكِسَاءٍ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سےروایت ہے،انہوں نے فرمایا: میں رسول اللہ ﷺکو دیکھاکہ آپ بکریوں کے کانوں پر نشان لگارہے تھے اور میں نے آپ ﷺ کو ایک چادر تہ بند کے طور پر باندھے ہوئے دیکھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;