var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ عَنْ ابْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ ثِيَابِكُمْ الْبَيَاضُ فَالْبَسُوهَا وَكَفِّنُوا فِيهَا مَوْتَاكُمْ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے رسول اللہ ﷺ نے فرمایا: تمھارے بہترین کپڑے سفید ہیں انھیں پہنا کرو اور فوت ہونے والوں کو ان میں کفن دیا کرو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;