var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ الْأَزْرَقُ حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ أَبِي رَوَّادٍ حَدَّثَنَا مَرْوَانُ بْنُ سَالِمٍ عَنْ صَفْوَانَ بْنِ عَمْرٍو عَنْ شُرَيْحِ بْنِ عُبَيْدٍ الْحَضْرَمِيِّ عَنْ أَبِي الدَّرْدَاءِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا زُرْتُمْ اللَّهَ بِهِ فِي قُبُورِكُمْ وَمَسَاجِدِكُمْ الْبَيَاضُ";
ibnemaja.urdu = "حضرت ابودرداء ؓ سے روایت ہے رسول اللہ ﷺ نے فرمایا: بہتریں لباس جس میں تم اپنی قبروں اور اپنی مسجدوں میں اللہ سے ملتے ہو،سفید لباس ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>مروان بن سالم: متروک <br>وشریح لم یسمع من أبی الدرداء (تہذیب التہذیب 289/4)`;
ibnemaja.anwaar = [506,1];