var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ جَمِيعًا عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الَّذِي يَجُرُّ ثَوْبَهُ مِنْ الْخُيَلَاءِ لَا يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے رسول اللہ ﷺ نے فرمایا: جوشخص تکبر کے ساتھ اپنا کپڑا گھسیٹ کر چلتا ہے قیامت کے دن اللہ تعالیٰ اس کی طرف (رحمت کی) نظر نہیں فرمائے گا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;