var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا شَرِيكٌ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ حُصَيْنِ بْنِ قَبِيصَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا سُفْيَانَ بْنَ سَهْلٍ لَا تُسْبِلْ فَإِنَّ اللَّهَ لَا يُحِبُّ الْمُسْبِلِينَ";
ibnemaja.urdu = "حضرت مغیرہ بن شعبہ ؓ سے روایت ہے رسول اللہ ﷺ نے فرمایا: اے سفیان بن سہل! کپڑا (جائز حد سے زیادہ) نہ لٹکا اللہ تعالیٰ کپڑا لٹکانے والوں کو پسند نہیں فرماتا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>شریک القاضي و عبد الملک بن عمیر عنعنا <br>و الحدیث السابق (الأصل: 3573) یغني عنہ`;
ibnemaja.anwaar = [506,1];