var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ عَنْ ابْنِ أَبِي رَوَّادٍ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِسْبَالُ فِي الْإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مَنْ جَرَّ شَيْئًا خُيَلَاءَ لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ قَالَ أَبُو بَكْرٍ مَا أَغْرَبَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے نبی ﷺ نے فرمایا: (جائز حد سے زیادہ) لٹکانا تہبند میں بھی ہوتا ہے قمیص میں بھی اور پگڑی میں جو شخص تکبر کے طور پر کسی بھی چیز کو لٹکائے قیامت کے دن اللہ تعالیٰ اس کی طرف (نظر رحمت سے) نہیں دیکھا گا۔(امام ابن ماجہ رحمہ اللہ کے استاد) ابوبکر بن ابی شیبہ رحمہ اللہ نے فرمایا: یہ کیسی نادر حدیث ہے!";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;