var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الْأَوْدِيُّ حَدَّثَنَا أَبُو غَسَّانَ وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عُبَيْدُ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا حَسَنُ بْنُ صَالِحٍ ح و حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ مُسْلِمٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُ قَمِيصًا قَصِيرَ الْيَدَيْنِ وَالطُّولِ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس ؓ سے روایت ہے انھوں نے فرمایا: رسول اللہ ﷺ ایسی قمیص پہنتے تھے جس کی آستینیں بھی چھوٹی ہوتی تھیں اور لمبائی بھی کم ہوتی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>مسلم بن کیسان الأعور الملائي: ضعیف`;
ibnemaja.anwaar = [506,1];