var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى وَعَبْدُ الرَّحْمَنِ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ قَالَ أَتَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَاوَمَنَا سَرَاوِيلَ";
ibnemaja.urdu = "حضرت سوید بن قیس ؓ سے روایت ہے انھوں نے فرمایا: بنی ﷺ ہمارے پاس تشریف لائے اور سے شلوار کا سودا کیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;