var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمْ تَجُرُّ الْمَرْأَةُ مِنْ ذَيْلِهَا قَالَ شِبْرًا قُلْتُ إِذًا يَنْكَشِفُ عَنْهَا قَالَ ذِرَاعٌ لَا تَزِيدُ عَلَيْهِ";
ibnemaja.urdu = "ام المومنین حضرت ام سلمہ ؓ سے روایت ہے رسول اللہ ﷺ سے دریافت کیا گیا: عورت اپنا دامن کتنا لٹکائے؟ آپ نے فرمایا: ایک بالشت۔میں نے کہا:تب اس (قدموں یا پنڈلیوں) سے کپڑاہٹ جائے گا۔تو رسول اللہ ﷺ نے فرمایا: ایک ہاتھ۔اس سے زیادہ نہ لٹکائے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;