var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ زَيْدٍ الْعَمِّيِّ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ ابْنِ عُمَرَ أَنَّ أَزْوَاجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُخِّصَ لَهُنَّ فِي الذَّيْلِ ذِرَاعًا فَكُنَّ يَأْتِيَنَّا فَنَذْرَعُ لَهُنَّ بِالْقَصَبِ ذِرَاعًا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے انھوں نے فرمایا: نبی ﷺ کی ازواج مطہراتؓ کو ایک ہاتھ دامن کی اجازت دی گئی تھی۔وہ ہمارے پاس آتیں تو ہم انھیں سر کنڈے سے ایک ہاتھ ماپ دیتے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4119)`;
ibnemaja.anwaar = [506,1];