var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْمُهَزِّمِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِفَاطِمَةَ أَوْ لِأُمِّ سَلَمَةَ ذَيْلُكِ ذِرَاعٌ";
ibnemaja.urdu = "حضرت ابوہریرہؓ سے روایت ہے کہ بنی ﷺ نے حضرت فاطمہ ؓ سے یا حضرت ام سلمہ ؓ سے فرمایا: تمھارا دامن ایک ہاتھ ہونا چاہیے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>ضعفہ البوصیري من أجل أبی المھزم: متروک <br>والحدیث السابق (الأصل:3580) یغني عنہ`;
ibnemaja.anwaar = [506,1];