var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ عَنْ أَبِي الْمُهَزِّمِ عَنْ أَبِي هُرَيْرَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي ذُيُولِ النِّسَاءِ شِبْرًا فَقَالَتْ عَائِشَةُ إِذًا تَخْرُجَ سُوقُهُنَّ قَالَ فَذِرَاعٌ";
ibnemaja.urdu = "حضرت ابوہریرہ ؓ نے فرمایا ام المومنین حضرت عائشہ ؓ سے روایت کی ہے بنی ﷺ نے عورت کے دامن کے بارے میں فرمایا: تب تو ان کی پنڈلیاں ظاہر ہوجائیں گی۔آپ ﷺ نے فرمایا: تب ایک ہاتھ(کافی ہے)۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>انظر الحدیث السابق (3582)`;
ibnemaja.anwaar = [506,1];