var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُسَاوِرٍ الْوَرَّاقِ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ";
ibnemaja.urdu = "حضرت عمر بن حریث ؓ سے روایت ہے انھوں نے فرمایا: میں نے نبی ﷺ کو منبر پر خطبہ ارشاد فرماتے دیکھا جبکہ آپ نے سیاہ عمامہ باندھ رکھا تھا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;