var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُسَاوِرٍ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ قَالَ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَيْهَا بَيْنَ كَتِفَيْهِ";
ibnemaja.urdu = "حضرت عمرو بن حریث رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: گویا میں رسول اللہ ﷺ کو دیکھ رہا ہوں جبکہ آپ کے سر پر سیاہ امامہ ہے اور آپ نے اس کے دونوں سرے اپنے کندھوں کے درمیان لٹکائے ہوئے ہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;