var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ عَنْ الْبَرَاءِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدِّيبَاجِ وَالْحَرِيرِ وَالْإِسْتَبْرَقِ";
ibnemaja.urdu = "حضرت براء رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسو ل اللہ ﷺ نے ریشمی کپڑے سے،عام ریشم سے اور موٹے ریشم سے منع فرمایا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;