var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي إِبْرَاهِيمُ بْنُ جَرِيرٍ عَنْ أَبِيهِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْغَيْضَةَ فَقَضَى حَاجَتَهُ فَأَتَاهُ جَرِيرٌ بِإِدَاوَةٍ مِنْ مَاءٍ فَاسْتَنْجَى مِنْهَا وَمَسَحَ يَدَهُ بِالتُّرَابِ";
ibnemaja.urdu = "سیدنا جریر بن عبداللہ بجلی رضی اللہ عنہ سے روایت ہے کہ اللہ کے نبی ﷺ درختوں کے ایک جھنڈ میں داخل ہوئے اور قضائے حاجت کی۔سیدنا جریر رضی اللہ عنہ نے پانی کا برتن حاضر کیا۔چنانچہ آپ نے اس سے استنجا فرمایا اور ہاتھ کو مٹی سے رگڑا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>إبراہیم بن جریر صدوق لکنہ لم یسمع من أبیہ <br>و الحدیث السابق (الأصل: 358) یغني عنہ`;
ibnemaja.anwaar = [390,1];