var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ حُذَيْفَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْحَرِيرِ وَالذَّهَبِ وَقَالَ هُوَ لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الْآخِرَةِ";
ibnemaja.urdu = "حضرت حذیفہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: اللہ کے رسول ﷺ نے ریشم اور سونا پہننے سے منع کیا اور فرمایا: وہ دنیا میں ان (کافروں)کے لئے ہے اور آخرت میں ہمارے لئے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;