var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ عُمَرَ أَنَّهُ كَانَ يَنْهَى عَنْ الْحَرِيرِ وَالدِّيبَاجِ إِلَّا مَا كَانَ هَكَذَا ثُمَّ أَشَارَ بِإِصْبَعِهِ ثُمَّ الثَّانِيَةِ ثُمَّ الثَّالِثَةِ ثُمَّ الرَّابِعَةِ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَانَا عَنْهُ";
ibnemaja.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے کہ وہ باریک اور موٹے ریشم (کا کپڑا پہننے)سے منع کرتے تھے،مگر جو اتنا سا ہو۔پھر(حضرت عمر رضی اللہ عنہ نے)ایک انگلی سے اشارہ کیا،پھر دوسری سے،پھر تیسری سے پھر چوتھی سے اور فرمایا: رسول اللہ ﷺ ہمیں اس سے منع فرمایا کرتے تھے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;