var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ الْإِفْرِيقِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي إِحْدَى يَدَيْهِ ثَوْبٌ مِنْ حَرِيرٍ وَفِي الْأُخْرَى ذَهَبٌ فَقَالَ إِنَّ هَذَيْنِ مُحَرَّمٌ عَلَى ذُكُورِ أُمَّتِي حِلٌّ لِإِنَاثِهِمْ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓسے روایت ہے انھوں نے فرمایا: رسول اللہ ﷺ ہمارے پاس (گھر سے) باہر تشریف لائے۔آپ کے ایک ہاتھ میں ریشمی کپڑا تھا اور دوسرے ہاتھ میں سونا تھا۔آپ نے فرمایا: یہ دونوں چیزیں میری امت کے مردوں پر حرام اور ان کی عورتوں کے لیے حلال ہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;