var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ الْقَاضِي عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ مَا رَأَيْتُ أَجْمَلَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَرَجِّلًا فِي حُلَّةٍ حَمْرَاءَ";
ibnemaja.urdu = "حضرت براء ؓ سے روایت ہے انھوں نے فرمایا: میں نے کسی کو رسول اللہ ﷺ سے زیادہ صاحب جمال نہیں دیکھا جب کہ آپ نے (بالوں میں) کنگھی کی ہوئی تھی اور سرخ چادریں (تہبند اور چادر)پہن رکھی تھیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;