var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَمَرَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُوكِيَ أَسْقِيَتَنَا وَنُغَطِّيَ آنِيَتَنَا";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے ہمیں حکم دیا ہے کہ ہم اپنے مشکیزوں کا منہ باندھ دیا کریں اور برتنوں کو ڈھانک دیا کریں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;