var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ الْحَسَنِ بْنِ سُهَيْلٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُفَدَّمِ قَالَ يَزِيدُ قُلْتُ لِلْحَسَنِ مَا الْمُفَدَّمُ قَالَ الْمُشْبَعُ بِالْعُصْفُرِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے گہرے رنگ سے منع فرمایا۔(حدیث کے راوی)یزید بیان کرتے ہیں (ابن عمر رضی اللہ عنہ کے شاگرد)حضرت حسن بن سہل رحمہ اللہ سے دریافت کیا گیا:[مُفَدَّمَ]سے کیا مراد ہے؟انہوں نے فرمایا: جو عُصفُر(کسم)سے خوب رنگا گیا ہو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;