var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ قَالَ سَمِعْتُ عَلِيًّا يَقُولُ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا أَقُولُ نَهَاكُمْ عَنْ لُبْسِ الْمُعَصْفَرِ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ نے مجھے عصفر (کسم)کا رنگا ہوا کپڑا پہننے سے منع فرمایا۔اور میں نہیں کہتا:تمہیں منع فرمایا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;