var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي لَيْلَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ شُرَحْبِيلَ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَ أَتَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعْنَا لَهُ مَاءً يَتَبَرَّدُ بِهِ فَاغْتَسَلَ ثُمَّ أَتَيْتُهُ بِمِلْحَفَةٍ صَفْرَاءَ فَرَأَيْتُ أَثَرَ الْوَرْسِ عَلَى عُكَنِهِ";
ibnemaja.urdu = "حضرت قیس بن سعد رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:نبی ﷺ ہمارے ہاں تشریف لائے۔ہم نے آپ کے نہانے کے لئے پانی رکھاتو آپ نے غسل فرمایا۔پھر میں نے آپ کی خدمت میں زرد چادر پیش کی۔(آپ نے اوڑھ لی)میں نے آپ کے شکم مبارک کی سلوٹ پرورس کا نشان دیکھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (466)`;
ibnemaja.anwaar = [507,1];