var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوا وَاشْرَبُوا وَتَصَدَّقُوا وَالْبَسُوا مَا لَمْ يُخَالِطْهُ إِسْرَافٌ أَوْ مَخِيلَةٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمروبن عاص سے روایت ہے،رسول اللہﷺ نے فرمایا: کھاؤ،پیو،صدقہ کرو اور پہنو،جب تک اس میں فضول خرچی یا تکبر کی آمیزش نہ ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نسائي (2560)`;
ibnemaja.anwaar = [507,1];