var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْوَاسِطِيَّانِ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا شَرِيكٌ عَنْ عُثْمَانَ بْنِ أَبِي زُرْعَةَ عَنْ مُهَاجِرٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَلْبَسَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ثَوْبَ مَذَلَّةٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص شہرت والا لباس پہنے گا،اللہ تعالیٰ قیامت کے دن اسے ذلت کا لباس پہنائے گا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;