var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ الْبَحْرَانِيُّ حَدَّثَنَا وَكِيعُ بْنُ مُحْرِزٍ النَّاجِيُّ حَدَّثَنَا عُثْمَانُ بْنُ جَهْمٍ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَعْرَضَ اللَّهُ عَنْهُ حَتَّى يَضَعَهُ مَتَى وَضَعَهُ";
ibnemaja.urdu = "حضرت ابو ذر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جس نے شہرت کا لباس پہنا،اللہ تعالیٰ اس سے (ناراض ہوکر)منہ پھیر لے گا حتی کہ اسے ذلیل کردے گا جب بھی ذلیل کرے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عثمان بن جہم: مجہول (التحریر: 4454) <br>لم یوثقہ غیر ابن حبان ولبعضہ شواہد`;
ibnemaja.anwaar = [507,1];