var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ میں نے رسول اللہ ﷺ سے یہ ارشاد سنا: جو بھی چمڑارنگ لیا جائے وہ پاک ہوجاتا ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;