var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِصْمَةُ بْنُ الْفَضْلِ وَيَحْيَى بْنُ حَكِيمٍ قَالَا حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ بْنِ أَبِي حَفْصَةَ حَدَّثَنَا حَرِيشُ بْنُ الْخِرِّيتِ أَنْبَأَنَا ابْنُ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَضَعُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ آنِيَةٍ مِنْ اللَّيْلِ مُخَمَّرَةً إِنَاءً لِطَهُورِهِ وَإِنَاءً لِسِوَاكِهِ وَإِنَاءً لِشَرَابِهِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے وہ بیان کرتی ہیں کہ میں رات کے وقت رسول اللہ ﷺ کے لیے تین ڈھانکے ہوئے برتن تیار رکھتی تھی۔ایک برتن آپ کے وضو کے لئے ایک آپ کے مسواک کے لئے اور ایک آپ کے پینے کے لئے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث الآتي (3412)<br>قال البوصیري: ’’ ھذا إسناد ضعیف<br>حریش بن الخریت متفق علی ضعفہ ‘‘ وقال الحافظ: ضعیف (تقریب: 1187)`;
ibnemaja.anwaar = [390,1];