var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ لَيْثٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ سَلْمَانَ قَالَ كَانَ لِبَعْضِ أُمَّهَاتِ الْمُؤْمِنِينَ شَاةٌ فَمَاتَتْ فَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهَا فَقَالَ مَا ضَرَّ أَهْلَ هَذِهِ لَوْ انْتَفَعُوا بِإِهَابِهَا";
ibnemaja.urdu = "حضرت سلمان رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:امہات المؤمنین میں سے کسی کی ایک بکری تھی،وہ مرگئی۔رسول اللہ ﷺ اس کے پاس سے گزرے تو فرمایا: اگر اس کے مالک اس کے چمڑے سے فائدہ اٹھالیتے تو ان کا کیا نقصان تھا؟";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>لیث بن أبي سلیم ضعیف <br>و للحدیث شاھد ضعیف عند الطبراني فی الکبیر (212/7 ح 576) <br>و الحدیث السابق (الأصل: 3610) یغني عنہ`;
ibnemaja.anwaar = [507,1];