var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ يَزِيدَ بْنِ قُسَيْطٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا:رسول اللہ ﷺ نے مردہ جانور کے چمڑے سے فائدہ اٹھانے کا حکم دیا جب اسے رنگ لیا جائے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = `مشکوۃ المصابیح: 509
أم محمد بن عبد الرحمٰن بن ثوبان: وثقھا ابن حبان و ابن عبد البر و یعقوب بن سفیان الفارسي (المعرفۃ والتاریخ 349/1۔ 350، 425) فالسند حسن`;