var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ ح و حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ كُلُّهُمْ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ قَالَ أَتَانَا كِتَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا تَنْتَفِعُوا مِنْ الْمَيْتَةِ بِإِهَابٍ وَلَا عَصَبٍ";
ibnemaja.urdu = "حضر ت عبداللہ بن عکیم رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:ہمارے پاس نبی ﷺ کا خط آیا (جس میں یہ تحریر تھا) مردار کے چمڑے سے یا پٹھے سے فائدہ نہ اٹھاؤ۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;