var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ قَالَ كَانَ لِنَعْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَالَانِ مَثْنِيٌّ شِرَاكُهُمَا";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہو ں نے فرمایا:نبی ﷺ کے جوتے کی دو پٹیاں تھیں جن کے تسمے دہرے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (فی الشمائل: 75)<br>سفیان الثوري عنعن <br>و الحدیث الآتي (الأصل: 3615) یغني عنہ`;
ibnemaja.anwaar = [507,1];