var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَمْشِي أَحَدُكُمْ فِي نَعْلٍ وَاحِدٍ وَلَا خُفٍّ وَاحِدٍ لِيَخْلَعْهُمَا جَمِيعًا أَوْ لِيَمْشِ فِيهِمَا جَمِيعًا";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سےرو ایت ہے،رسول اللہ ﷺ نے فرمایا: کوئی شخص ایک جوتا یا ایک موزہ پہن کر نہ چلے،چاہئیے کہ دونوں(جوتے یا موزے)اتارلے یا دونوں پہن کر چلے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;