var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے کھڑے ہوکر جوتے پہننے سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن <br>والحدیث ضعیف من جمیع طرقہ ولم یصب من صححہ`;
ibnemaja.anwaar = [507,1];