var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَدْرٍ عَبَّادُ بْنُ الْوَلِيدِ حَدَّثَنَا مُطَهَّرُ بْنُ الْهَيْثَمِ حَدَّثَنَا عَلْقَمَةُ بْنُ أَبِي جَمْرَةَ الضُّبَعِيُّ عَنْ أَبِيهِ أَبِي جَمْرَةَ الضُّبَعِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَكِلُ طُهُورَهُ إِلَى أَحَدٍ وَلَا صَدَقَتَهُ الَّتِي يَتَصَدَّقُ بِهَا يَكُونُ هُوَ الَّذِي يَتَوَلَّاهَا بِنَفْسِهِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ اپنی پاکیزگی (وضو وغیرہ) اور اپنا صدقہ جو کسی کو دینا ہوتا تھا،کسی کے سپرد نہیں کرتے تھے بلکہ یہ کام خود کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال البوصیري: ’’ ھذا إسناد ضعیف،علقمۃ بن أبي جمرۃ: مجہول،ومطہر بن الہیثم: ضعیف ‘‘ <br>وقال الحافظ في مطھر: متروک (تقریب: 6713)`;
ibnemaja.anwaar = [390,1];