var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا دَلْهَمُ بْنُ صَالِحٍ الْكِنْدِيُّ عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ الْكِنْدِيِّ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّجَاشِيَّ أَهْدَى لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ سَاذَجَيْنِ أَسْوَدَيْنِ فَلَبِسَهُمَا";
ibnemaja.urdu = "حضرت بریدہ بن حصیب اسلمی رضی اللہ عنہ سے روایت ہے کہ حضرت نجاشی رحمہ اللہ نے رسول اللہ ﷺ کو ہدیہ کے طور پر سیاہ سادہ موزوں کا جوڑا ارسال کیا،چنانچہ آپﷺ نے اسے پہنا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث السابق (549)`;
ibnemaja.anwaar = [507,1];