var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ سَمِعَ أَبَا سَلَمَةَ وَسُلَيْمَانَ بْنَ يَسَارٍ يُخْبِرَانِ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْيَهُودَ وَالنَّصَارَى لَا يَصْبُغُونَ فَخَالِفُوهُمْ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: بلاشبہ یہودی اور عیسائی بالوں کونہیں رنگتے،چنانچہ تم ان کی مخالفت کرو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;