var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَجْلَحِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِي الْأَسْوَدِ الدَّيْلَمِيِّ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ";
ibnemaja.urdu = "حضرت ابو ذر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺنے فرمایا: بڑھاپے(کے بالو)کا رنگ بدلنے کے لئے سب سے بہتر چیز مہندی اور وسمہ ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;