var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا سَلَّامُ بْنُ أَبِي مُطِيعٍ عَنْ عُثْمَانَ بْنِ مَوْهَبٍ قَالَ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ قَالَ فَأَخْرَجَتْ إِلَيَّ شَعَرًا مِنْ شَعْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَخْضُوبًا بِالْحِنَّاءِ وَالْكَتَمِ";
ibnemaja.urdu = "حضرت عثمان بن موہب رحمہ اللہ سے روایت ہے،انہوں نے کہا: میں ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا کی خدمت میں حاضر ہوا۔انہوں نے رسول اللہ ﷺ کے چند بال نکال کر مجھے دکھائے جو مہندی اور وسمہ سے رنگے ہوئے تھے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;