var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو هُرَيْرَةَ الصَّيْرَفِيُّ مُحَمَّدُ بْنُ فِرَاسٍ حَدَّثَنَا عُمَرُ بْنُ الْخَطَّابِ بْنِ زَكَرِيَّا الرَّاسِبِيُّ حَدَّثَنَا دَفَّاعُ بْنُ دَغْفَلٍ السَّدُوسِيُّ عَنْ عَبْدِ الْحَمِيدِ بْنِ صَيْفِيٍّ عَنْ أَبِيهِ عَنْ جَدِّهِ صُهَيْبِ الْخَيْرِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا اخْتَضَبْتُمْ بِهِ لَهَذَا السَّوَادُ أَرْغَبُ لِنِسَائِكُمْ فِيكُمْ وَأَهْيَبُ لَكُمْ فِي صُدُورِ عَدُوِّكُمْ";
ibnemaja.urdu = "حضرت صہیب رومی ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: بہترین چیز جس سے تم خضاب کرتے ہو،سیاہ رنگ ہے۔اس سے تمہاری عورتوں کے دلوں میں تمہاری رغبت (اور محبت)زیادہ ہوتی ہے اور تمہارے دشمنوں کے دلوں میں تمہارا رعب زیادہ ہوتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>دفاع: ضعیف (تقریب: 1827)`;
ibnemaja.anwaar = [508,1];