var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي جُحَيْفَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ مِنْهُ بَيْضَاءُ يَعْنِي عَنْفَقَتَهُ";
ibnemaja.urdu = "حضرت ابوجحیفہ وہب بن عبداللہ سوائی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:میں نے رسول اللہ ﷺ کو دیکھا کہ آپ کے یہ بال سفید تھے۔ان کا اشارہ نچلے ہونٹ اور ٹھوڑی کے درمیان کے بالوں کی طرف تھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;