var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ وَابْنُ أَبِي عَدِيٍّ عَنْ حُمَيْدٍ قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ أَخَضَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّهُ لَمْ يَرَ مِنْ الشَّيْبِ إِلَّا نَحْوَ سَبْعَةَ عَشَرَ أَوْ عِشْرِينَ شَعَرَةً فِي مُقَدَّمِ لِحْيَتِهِ";
ibnemaja.urdu = "حضرت حمید رحمہ اللہ سے روایت ہے،وہ بیان کرتے ہیں کہ حضرت انس بن مالک رضی اللہ عنہ سے دریافت کیا گیا:کیا رسول اللہ ﷺ نے خضاب لگایا تھا؟ انہوں نے فرمایا:نبی ﷺ کے بال سفید نہیں ہوئے،صرف ڈاڑھی کے اگلے حصے میں سترہ یا بیس بال سفید تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;