var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ قَالَ قَالَتْ أُمُّ هَانِئٍ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ تَعْنِي ضَفَائِرَ";
ibnemaja.urdu = "حضرت ام ہانی رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ مکہ میں داخل ہوئے تو آپ (کے بالوں)کی چار لٹیں،یعنی گندھی ہوئی مینڈھیاں تھیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4191) ترمذي (1781)`;
ibnemaja.anwaar = [508,1];