var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ ابْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبَّادٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَفْرِقُ خَلْفَ يَافُوخِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَسْدِلُ نَاصِيَتَهُ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا:میں رسول اللہ ﷺ کے تالو کے پیچھےمانگ نکالتی تھی۔اور سر کے اگلے حصے کے بال لٹکادیتی تھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;