var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَعَرٌ دُونَ الْجُمَّةِ وَفَوْقَ الْوَفْرَةِ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سےروایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ کے بال جمہ سےکم اور وفرہ سے زیادہ تھے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;