var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ عُمَرَ بْنِ نَافِعٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَزَعِ قَالَ وَمَا الْقَزَعُ قَالَ أَنْ يُحْلَقَ مِنْ رَأْسِ الصَّبِيِّ مَكَانٌ وَيُتْرَكَ مَكَانٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ نے قزع سے منع فرمایا ہے۔حضرت نافع رحمہ اللہ نے کہا: قزع کا کیا مطلب ہے؟حضرت ابن عمر رضی اللہ عنہما نے فرمایا:وہ یہ ہوتا ہے کہ بچے کا سر ایک جگہ سے (کچھ حصہ)مونڈ دیا جائے اور ایک جگہ سے (کچھ حصہ) چھوڑ دیا جائے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;