var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا شَرِبَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’جب تم میں سے کسی کے برتن میں کتا پی لے تو اسے چاہیے کہ اس (برتن)کو سات بار دھوئے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;