var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ اصْطَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا فَقَالَ إِنَّا قَدْ اصْطَنَعْنَا خَاتَمًا وَنَقَشْنَا فِيهِ نَقْشًا فَلَا يَنْقُشْ عَلَيْهِ أَحَدٌ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے کہا:رسول اللہ ﷺ نے ایک انگوٹھی بنوائی اور فرمایا: ہم نے انگوٹھی بنوائی ہے اور اس پر ایک نقش بنوایا ہے،چنانچہ اور کوئی شخص اس طرح کے نقش نہ بنوائے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;