var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ لَهُ فَصٌّ حَبَشِيٌّ وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِﷺ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے چاندی کی انگوٹھی بنوائی جس میں حبشی نگینہ تھا۔اس کا نقش محمد رسول اللہﷺ تھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;