var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي أُوَيْسٍ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يُونُسَ بْنِ يَزِيدَ الْأَيْلِيِّ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ خَاتَمَ فِضَّةٍ فِيهِ فَصٌّ حَبَشِيٌّ كَانَ يَجْعَلُ فَصَّهُ فِي بَطْنِ كَفِّهِ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے چاندی کی انگوٹھی پہنی جس میں حبشی نگینہ تھا۔آپ نگینے کو ہتھیلی کی اندرونی طرف رکھتے تھے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;