var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ عَاصِمٍ عَنْ أَبِي بُرْدَةَ عَنْ عَلِيٍّ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَتَخَتَّمَ فِي هَذِهِ وَفِي هَذِهِ يَعْنِي الْخِنْصَرَ وَالْإِبْهَامَ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے بیان کیا:اللہ کے رسول ﷺ نے مجھے اس میں اور اس میں،یعنی چھنگلیا(چھوٹی انگلی)اور انگوٹھے میں،انگوٹھی پہننے سے منع فرمایا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;