var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَبِي طَلْحَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ";
ibnemaja.urdu = "حضرت ابوطلحہ (زید بن سہل انصاری)رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: فرشتے اس گھر میں داخل نہیں ہوتے جس میں کتا یا تصویر ہو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;