var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ مُطَرِّفًا يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغَفَّلِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وَلَغَ الْكَلْبُ فِي الْإِنَاءِ فَاغْسِلُوهُ سَبْعَ مَرَّاتٍ وَعَفِّرُوهُ الثَّامِنَةَ بِالتُّرَابِ";
ibnemaja.urdu = "سیدنا عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’جب برتن میں کتا پی لے تو اسے سات بار دھوؤ اور آٹھویں مرتبہ مٹی کے ساتھ صاف کرو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;