var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَلَائِكَةَ لَا تَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ";
ibnemaja.urdu = "حضرت علی بن ابی طالب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: فرشتے اس گھر میں داخل نہیں ہوتے جس میں کتا یا تصویر ہو۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;