var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا عُفَيْرُ بْنُ مَعْدَانَ حَدَّثَنَا سُلَيْمُ بْنُ عَامِرٍ عَنْ أَبِي أُمَامَةَ أَنَّ امْرَأَةً أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَتْهُ أَنَّ زَوْجَهَا فِي بَعْضِ الْمَغَازِي فَاسْتَأْذَنَتْهُ أَنْ تُصَوِّرَ فِي بَيْتِهَا نَخْلَةً فَمَنَعَهَا أَوْ نَهَاهَا";
ibnemaja.urdu = "حضرت ابو امامہ رضی اللہ عنہ سے روایت ہے کہ ایک خاتون نے نبی ﷺ کی خدمت میں حاضر ہوکر عرض کیا کہ ان کا شوہر جہاد میں گیا ہوا ہے۔اس نے رسول اللہ ﷺ سے اجازت طلب کی کہ وہ گھر میں کھجور کے درخت کی تصویر بنوالے۔نبی ﷺ نے اسے منع فرمایادیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عفیر بن معدان:ضعیف`;
ibnemaja.anwaar = [508,1];