var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْحِمْيَرِيُّ عَنْ أَبِي حُصَيْنٍ الْحَجْرِيِّ الْهَيْثَمِ عَنْ عَامِرٍ الْحَجْرِيِّ قَالَ سَمِعْتُ أَبَا رَيْحَانَةَ صَاحِبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ رُكُوبِ النُّمُورِ";
ibnemaja.urdu = "صحابئ رسول حضرت ابوریحانہ شمعون بن زیدازدی سے روایت ہے،انہوں نے کہا:رسول اللہ ﷺ چیتے (کی کھال)پر سواری کرنے سے منع فرمایا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (4049) نسائي (5094)`;
ibnemaja.anwaar = [508,1];