var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِحَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالُوا يَا رَسُولَ اللَّهِ مَنْ أَبَرُّ قَالَ أُمَّكَ قَالَ ثُمَّ مَنْ قَالَ أُمَّكَ قَالَ ثُمَّ مَنْ قَالَ أَبَاكَ قَالَ ثُمَّ مَنْ قَالَ الْأَدْنَى فَالْأَدْنَى";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا:عرض کیا گیا:اے اللہ کے رسول!میں کس سے نیکی کروں؟آپ نے فرمایا: اپنی ماں سے۔پوچھنے والے نے کہا:اس کے بعد کس سے؟فرمایا: اپنی ماں سے۔اس نے کہا: اس کے بعد کس سے؟فرمایا: اپنے باپ سے۔اس نے کہا اس کے بعد کس سے؟فرمایا: جو زیادہ قریبی (تعلق رکھتا)ہو،پھر جو(اس کے بعد)زیادہ قریبی ہو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;