var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَلَغَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا:’’جب تم میں سے کسی کے برتن میں کتا پی لے تو اسے چاہیے کہ اس (برتن کو سات بار دھوئے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;