var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَطَاءٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ أَبِي الدَّرْدَاءِ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْوَالِدُ أَوْسَطُ أَبْوَابِ الْجَنَّةِ فَأَضِعْ ذَلِكَ الْبَابَ أَوْ احْفَظْهُ";
ibnemaja.urdu = "حضرت ابودرداء رضی اللہ عنہ سے روایت ہے،انہوں نے نبی ﷺسے سنا،آپ فرمارہے تھے: باپ جنت کا درمیانی دروازہ ہے،چاہے اس دروازے کو ضائع کرلو،چاہے محفوظ کرلو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;