var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ أَبِي رَاشِدٍ عَنْ يَعْلَى الْعَامِرِيِّ أَنَّهُ قَالَ جَاءَ الْحَسَنُ وَالْحُسَيْنُ يَسْعَيَانِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَمَّهُمَا إِلَيْهِ وَقَالَ إِنَّ الْوَلَدَ مَبْخَلَةٌ مَجْبَنَةٌ";
ibnemaja.urdu = "حضرت یعلی(بن مرہ)عامری رضی اللہ عنہ سے روایت ہے،انہوں نے کہا:حضرت حسن اور حضرت حسین رضی اللہ عنہمادوڑے دوڑے نبی ﷺ کے پاس آئے۔آپ نے انہیں سینے سے لگایا لیا اور فرمایا: اولاد بخل اور بزدلی کا باعث ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;