var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ مُوسَى بْنِ عُلَيٍّ سَمِعْتُ أَبِي يَذْكُرُ عَنْ سُرَاقَةَ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا أَدُلُّكُمْ عَلَى أَفْضَلِ الصَّدَقَةِ ابْنَتُكَ مَرْدُودَةً إِلَيْكَ لَيْسَ لَهَا كَاسِبٌ غَيْرُكَ";
ibnemaja.urdu = "حضرت سراقہ بن مالک رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: کیا میں تمہیں سب سے افضل صدقہ نہ بتاؤ؟تیری بیٹی جو (بیوہ ہوکر طلاق ہوجانے کی وجہ سے)تیرے پاس واپس آجائے،اور تیرے سوا اس کا کوئی کمانے والا نہ ہو۔(اس کے اخراجات برداشت کرنا افضل صدقہ ہے)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>علتہ الإنقطاع بین سراقۃ وعُلَيّ کما صرح بہ البوصیري وغیرہ <br>فالسند منقطع`;
ibnemaja.anwaar = [508,2];