var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ حَرْمَلَةَ بْنِ عِمْرَانَ قَالَ سَمِعْتُ أَبَا عُشَانَةَ الْمُعَافِرِيَّ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ لَهُ ثَلَاثُ بَنَاتٍ فَصَبَرَ عَلَيْهِنَّ وَأَطْعَمَهُنَّ وَسَقَاهُنَّ وَكَسَاهُنَّ مِنْ جِدَتِهِ كُنَّ لَهُ حِجَابًا مِنْ النَّارِ يَوْمَ الْقِيَامَةِ";
ibnemaja.urdu = "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس کی تین بیٹیاں ہوں،وہ ان پر صبر کرے،جو کچھ میسر ہو اس میں سے انہیں کھلائے پلائے اور پہنائے،قیامت کے دن وہ اس کے لیے جہنم سے رکاوٹ بن جائیں گی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;