var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ فِطْرٍ عَنْ أَبِي سَعِيدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ رَجُلٍ تُدْرِكُ لَهُ ابْنَتَانِ فَيُحْسِنُ إِلَيْهِمَا مَا صَحِبَتَاهُ أَوْ صَحِبَهُمَا إِلَّا أَدْخَلَتَاهُ الْجَنَّةَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس شخص کی دوبیٹیاں جوان ہوجائیں اور وہ ان سے اس وقت تک اچھا سلوک کرتا رہے جب تک وہ اس کے ساتھ رہیں،یا جب تک وہ ان کے ساتھ رہے،وہ اسے جنت میں ضرور داخل کردیں گی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;