var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ حَدَّثَنَا سَعِيدُ بْنُ عُمَارَةَ أَخْبَرَنِي الْحَارِثُ بْنُ النُّعْمَانِ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَكْرِمُوا أَوْلَادَكُمْ وَأَحْسِنُوا أَدَبَهُمْ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اپنی اولاد کی عزت نفس کا خیال رکھو،اور انہیں اچھے آداب (واخلاق)سکھاؤ۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سعید بن عمارۃ و الحارث بن النعمان:ضعیفان (تقریب: 2367،ضعیف سنن الترمذي: 2352)`;
ibnemaja.anwaar = [509,1];