var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ مُجَاهِدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا زَالَ جِبْرَائِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مجھے جبریل علیہ السلام پڑوسی کے ساتھ حسن سلوک کی ہمیشہ تاکید کرتے رہے حتی کہ میں گمان کرنے لگا کہ وہ اسے وراثت میں بھی شریک ٹہرا دیں گے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;