var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ الْمِقْدَامِ أَبِي كَرِيمَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةُ الضَّيْفِ وَاجِبَةٌ فَإِنْ أَصْبَحَ بِفِنَائِهِ فَهُوَ دَيْنٌ عَلَيْهِ فَإِنْ شَاءَ اقْتَضَى وَإِنْ شَاءَ تَرَكَ";
ibnemaja.urdu = "حضرت ابو کریمہ مقدام (بن معدیکرب) رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مہمان کی ایک رات (مہمان نوازی)واجب ہے۔اگر مہمان صبح تک اس کے گھر رہا (اور اس نے مہمانی نہ کی)تو یہ اس (صاحب خانہ)پر قرض ہے۔مہمان چاہے تو اس کا مطالبہ (کرکے وصول)کرلے،چاہے تو چھوڑ دے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;