var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أُحَرِّجُ حَقَّ الضَّعِيفَيْنِ الْيَتِيمِ وَالْمَرْأَةِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اے اللہ! میں(لوگوں کو)دوکمزوروں یتیم اور عورت،کی حلق تلفی کرنا (تاکید کےساتھ)حرام ٹہراتا ہوں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;