var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ عَنْ يَحْيَى بْنِ سُلَيْمَانَ عَنْ زَيْدِ بْنِ أَبِي عَتَّابٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ بَيْتٍ فِي الْمُسْلِمِينَ بَيْتٌ فِيهِ يَتِيمٌ يُحْسَنُ إِلَيْهِ وَشَرُّ بَيْتٍ فِي الْمُسْلِمِينَ بَيْتٌ فِيهِ يَتِيمٌ يُسَاءُ إِلَيْهِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: مسلمانوں میں بہترین گھر وہ ہے جس گھر میں کوئی یتیم (زیرکفالت)ہو اور اس سے اچھا سلوک کیا جائے۔اور مسلمانوں میں سب سے برا گھر وہ ہے جس میں کوئی یتیم (زیر کفالت) ہو اور اس سے برا سلوک کیا جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>یحیی بن أبي سلیمان:ضعیف (د 893) والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [509,1];