var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ أَبَانَ بْنِ صَمْعَةَ عَنْ أَبِي الْوَازِعِ الرَّاسِبِيِّ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ دُلَّنِي عَلَى عَمَلٍ أَنْتَفِعُ بِهِ قَالَ اعْزِلْ الْأَذَى عَنْ طَرِيقِ الْمُسْلِمِينَ";
ibnemaja.urdu = "حضرت ابو برزہ فضلہ بن عبید اسلمی رضی اللہ عنہ سے روایت ہے،انہوں نے کہا:میں نے عرض کیا:اے اللہ کے رسول! مجھے کوئی عمل بتائیے جس سے مجھے فائدہ ہو۔رسول اللہ ﷺ نے فرمایا: مسلمانوں کے راستے سے تکلیف دینے والی چیز کو ہٹادیاکرو۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;