var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ تَمِيمِ بْنِ سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ الْعَبْسِيِّ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يُحْرَمْ الرِّفْقَ يُحْرَمْ الْخَيْرَ";
ibnemaja.urdu = "حضرت جریر بن عبداللہ بجلی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص نرمی سے محروم رہا،وہ(ہرقسم کی)خیر سے محروم رہا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;