var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ حَفْصٍ الْأُبُلِّيُّ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ وَيُعْطِي عَلَيْهِ مَا لَا يُعْطِي عَلَى الْعُنْفِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اللہ تعالیٰ نرمی کرنے والا ہے،نرمی کوپسند کرتا ہے،اور نرمی پر وہ کچھ عطا فرماتا ہے جو سختی پر عطا نہیں فرماتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;