var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ عَنْ الْأَوْزَاعِيِّ ح و حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الْأَمْرِ كُلِّهِ";
ibnemaja.urdu = "ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: اللہ تعالیٰ نرمی کرنے والا ہے اور ہر معاملے میں نرمی کو پسند فرماتا ہے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;