var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ يَعْنِي أَبَا بَكْرٍ الْحَنَفِيَّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْهِرَّةُ لَا تَقْطَعُ الصَّلَاةَ لِأَنَّهَا مِنْ مَتَاعِ الْبَيْتِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’بلی(کے نمازی کے آگے سے گزرنے کے) سے نماز نہیں ٹوٹتی کیوں کہ وہ گھر کی اشیاء میں سے ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;