var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ فِي نَاحِيَةِ الْمَسْجِدِ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ فَقَالَ وَعَلَيْكَ السَّلَامُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،ایک آدمی مسجد میں داخل ہوا جبکہ رسول اللہ ﷺ مسجد میں ایک طرف تشریف فرماتھے۔اس نے نماز پڑھی،پھر آکر سلام کیا۔نبی ﷺ نے فرمایا:[وَعَلَیۡکَ السَّلاَمُ] تجھ پر بھی سلامتی ہو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;