var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ أَبِي سَلَمَةَ أَنَّ عَائِشَةَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا إِنَّ جِبْرَائِيلَ يَقْرَأُ عَلَيْكِ السَّلَامَ قَالَتْ وَعَلَيْهِ السَّلَامُ وَرَحْمَةُ اللَّهِ";
ibnemaja.urdu = "ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے ان سے فرمایا: جبریل علیہ السلام آپ کو سلام کہہ رہے ہیں۔انہوں نے کہا:[وَعَلَیَہِ السَّلاَمُ وَرَحۡمَۃُ اللہِ] ان پر بھی سلامتی اور اللہ کی رحمت ہو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;