var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَمُحَمَّدُ بْنُ بِشْرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ عَلَيْكُمْ أَحَدٌ مِنْ أَهْلِ الْكِتَابِ فَقُولُوا وَعَلَيْكُمْ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب اہل کتاب میں سے کوئی شخص تمہیں سلام کہے تو(جواب میں)کہو:[وَعَلَیۡکُمۡ] تم پر بھی ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;