var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاسٌ مِنْ الْيَهُودِ فَقَالُوا السَّامُ عَلَيْكَ يَا أَبَا الْقَاسِمِ فَقَالَ وَعَلَيْكُمْ";
ibnemaja.urdu = "ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ کچھ یہودی نبی ﷺکی خدمت میں حاضر ہوئے اور کہا:[اَلسَّامُ عَلَیۡکَ یَا أَبَا الۡقَاسِمِ] ابوالقاسم!آپ پر سام ہو،یعنی موت ہو۔نبی ﷺ نے فرمایا:[وَعَلَیۡکُمۡ] تم پر بھی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;