var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْجُهَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي رَاكِبٌ غَدًا إِلَى الْيَهُودِ فَلَا تَبْدَءُوهُمْ بِالسَّلَامِ فَإِذَا سَلَّمُوا عَلَيْكُمْ فَقُولُوا وَعَلَيْكُمْ";
ibnemaja.urdu = "حضرت ابو عبدالرحمٰن جہنی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: میں کل یہودیوں کے پاس جاؤں گا۔انہیں سلام کرنے میں پہل نہ کرنا۔جب وہ تمہیں سلام کہیں تو (جواب میں)کہنا:وَعَلَیۡکُمۡ۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;