var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ اغْتَسَلَ بَعْضُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَفْنَةٍ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَغْتَسِلَ أَوْ يَتَوَضَّأَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ جُنُبًا قَالَ الْمَاءُ لَا يُجْنِبُ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ کی ایک زوجہ محترمہ نے ایک ٹب میں(پانی لے کر) غسل کیا۔اس کے بعد نبی ﷺ غسل یا وضو کرنے کے لئے تشریف لائے تو انہوں نے عرض کیا: اے اللہ کے رسول! میں جنبی تھی۔تو (آپ ﷺ نے فرمایا:) ’’پانی ناپاک نہیں ہوتا";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (68) ترمذي (65) نسائي (326)`;
ibnemaja.anwaar = [391,1];