var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي حُسَيْنٍ قَالَ سَمِعَهُ مِنْ شَهْرِ بْنِ حَوْشَبٍ يَقُولُ أَخْبَرَتْهُ أَسْمَاءُ بِنْتُ يَزِيدَ قَالَتْ مَرَّ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ فَسَلَّمَ عَلَيْنَا";
ibnemaja.urdu = "حضرت اسماء بنت یزید رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ ہم چند عورتوں کے پاس سے گزرے تو آپ نے ہمیں سلام کیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;