var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ جَرِيرِ بْنِ حَازِمٍ عَنْ حَنْظَلَةَ بْنِ عَبْدِ الرَّحْمَنِ السَّدُوسِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ أَيَنْحَنِي بَعْضُنَا لِبَعْضٍ قَالَ لَا قُلْنَا أَيُعَانِقُ بَعْضُنَا بَعْضًا قَالَ لَا وَلَكِنْ تَصَافَحُوا";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:ہم نے عرض کیا:اے اللہ کے رسول!کیا ہم ایک دوسرے کے لئے (احترام کے اظہار کے لئے)جھکا کریں؟آپ ﷺ نے فرمایا: نہیں؟۔ہم نے کہا: کیا ہم ایک دوسرے سے معانقہ کریں؟ آپ ﷺ نے فرمایا: نہیں۔لیکن مصافحہ کرلیا کرو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2728)`;
ibnemaja.anwaar = [509,1];