var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ الْأَجْلَحِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمَيْنِ يَلْتَقِيَانِ فَيَتَصَافَحَانِ إِلَّا غُفِرَ لَهُمَا قَبْلَ أَنْ يَتَفَرَّقَا";
ibnemaja.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب دو مسلمان ایک دوسرے سے ملتے ہیں اور مصافحہ کرتےہیں تو ایک دوسرے سے رخصت ہونے سے پہلے ان کی مغفرت ہوجاتی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (5212) ترمذي (2727)`;
ibnemaja.anwaar = [509,1];