var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَغُنْدَرٌ وَأَبُو أُسَامَةَ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ عَنْ صَفْوَانَ بْنِ عَسَّالٍ أَنَّ قَوْمًا مِنْ الْيَهُودِ قَبَّلُوا يَدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرِجْلَيْهِ";
ibnemaja.urdu = "حضرت صفوان بن عسال رضی اللہ عنہ سے روایت ہے کہ یہودیوں کے چند افراد نے نبی ﷺ کے ہاتھ کو اور دونوں قدموں کو بوسہ دیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;