var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ وَاصِلِ بْنِ السَّائِبِ عَنْ أَبِي سَوْرَةَ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ هَذَا السَّلَامُ فَمَا الِاسْتِئْذَانُ قَالَ يَتَكَلَّمُ الرَّجُلُ تَسْبِيحَةً وَتَكْبِيرَةً وَتَحْمِيدَةً وَيَتَنَحْنَحُ وَيُؤْذِنُ أَهْلَ الْبَيْتِ";
ibnemaja.urdu = "حضرت ابو ایوب انصاری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:ہم نے عرض کیا : اے اللہ کے رسول! یہ سلام(تو ہمیں معلوم)ہے لیکن اجازت طلب کرنے کا کیا مطلب ہے؟آپ ﷺ نے فرمایا: آدمی کوئی بات کہے،سبحان اللہ کہہ دے،اللہ اکبر کہہ دے،الحمد للہ کہہ دے یا کھانس دے۔(مقصد یہ ہے کہ)گھر والوں کو معلوم کرادے (کہ میں اندر آنا چاہتا ہوں۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>واصل بن السائب وأبوسورۃ:ضعیفان (تقریب: 7383،ضعیف) والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [510,1];