var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ مُغِيرَةَ عَنْ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ عَنْ عَلِيٍّ قَالَ كَانَ لِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُدْخَلَانِ مُدْخَلٌ بِاللَّيْلِ وَمُدْخَلٌ بِالنَّهَارِ فَكُنْتُ إِذَا أَتَيْتُهُ وَهُوَ يُصَلِّي يَتَنَحْنَحُ لِي";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ کی خدمت میں حاضر ہونے کے میرے دو اوقات تھے۔ایک رات میں اور ایک دن میں۔جب میں ایسے وقت حاضر ہوتا کہ نبی ﷺ نماز پڑھ رہے ہوتے تو آپ کھانس دیتے۔(جس کا مطلب یہ ہوتاکہ مجھے تمہارے آنے کا علم ہوگیا ہے اور تم اندر آسکتے ہو۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>نسائي (1212،1213)`;
ibnemaja.anwaar = [510,1];