var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ اسْتَأْذَنْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ هَذَا فَقُلْتُ أَنَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا أَنَا";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا:میں نے نبی ﷺ سے(حاضر ہونے کی)اجازت طلب کی تو آپ نے فرمایا: کون ہے؟ میں نے کہا:میں۔نبی ﷺ نے فرمایا: میں،میں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;