var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ امْرَأَةً مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَتْ مِنْ جَنَابَةٍ فَتَوَضَّأَ أَوْ اغْتَسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فَضْلِ وَضُوئِهَا";
ibnemaja.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہازواج مطہرات رضی اللہ عنھن میں سے کسی زوجہ محترمہ نے غسل جنابت کیا۔ان کے وضو سے بچے ہوئے پانی سے نبی ﷺ نے وضو اور غسل فرمالیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (370)`;
ibnemaja.anwaar = [391,1];