var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ عَنْ جَابِرٍ قَالَ قُلْتُ كَيْفَ أَصْبَحْتَ يَا رَسُولَ اللَّهِ قَالَ بِخَيْرٍ مِنْ رَجُلٍ لَمْ يُصْبِحْ صَائِمًا وَلَمْ يَعُدْ سَقِيمًا";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے عرض کیا:اے اللہ کے رسول! آپ نے کیسے صبح کی؟آپ نے فرمایا: خیریت سے صبح ہوئی،ایسے آدمی کی جس نے نہ روزہ رکھا،نہ کسی بیمار کی عیادت کی،";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;