var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشَمَّتُ الْعَاطِسُ ثَلَاثًا فَمَا زَادَ فَهُوَ مَزْكُومٌ";
ibnemaja.urdu = "حضرت سلمہ بن اکوع رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: چھینکنے والے کو تین بار [یَرۡحَمَکَ اللہ کہہ کر]دعا دی جائے۔اس سے زیادہ ہو تو اس شخص کو زکام ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>عکرمۃ بن عمار عنعن وھو مدلس <br>وحدیث مسلم (2993) یغني عنہ`;
ibnemaja.anwaar = [510,1];