var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلْ الْحَمْدُ لِلَّهِ وَلْيَرُدَّ عَلَيْهِ مَنْ حَوْلَهُ يَرْحَمُكَ اللَّهُ وَلْيَرُدَّ عَلَيْهِمْ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب تم میں سے کسی کو چھینک آئے تو اسے چاہیے کہ یوں کہے[اَلۡحَمۡدُ لِلہ] سب تعریفیں اللہ کے لئے ہیں(اللہ کا شکر ہے۔)جو افراد اس کے پا س ہوں وہ کہیں:[یَرۡ حَمَکَ اللہ] اللہ تجھ پر رحمت نازل فرمائے۔وہ جواب میں انہیں کہے:[یَھۡدِیکُمُ اللہُ وَیُصۡلِحُ بَالَکُمۡ] اللہ تمہیں ہدایت پر قائم رکھے اور تمہارے حالات درست فرمائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2741)`;
ibnemaja.anwaar = [510,1];