var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ مِينَاءَ عَنْ جُودَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اعْتَذَرَ إِلَى أَخِيهِ بِمَعْذِرَةٍ فَلَمْ يَقْبَلْهَا كَانَ عَلَيْهِ مِثْلُ خَطِيئَةِ صَاحِبِ مَكْسٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ ابْنِ جُرَيْجٍ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ مِينَاءَ عَنْ جُودَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ";
ibnemaja.urdu = "حضرت جودان رحمہ اللہ سےروایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے اپنے بھائی سے (کسی غلطی پر) معذرت کی،اور اس نے قبول نہ کی،اس پر (ناجائز)ٹیکس وصول کرنے والے جتنا گناہ ہے۔\nامام ابن ماجہ رحمہ اللہ نے یہ روایت محمد بن اسماعیل کے واسطے سے بھی نبیﷺ سے سابقہ حدیث کی مثل بیان کی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>السند مرسل وابن جریج عنعن <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [510,1];