var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ يَحْيَى وَإِسْحَقُ بْنُ مَنْصُورٍ قَالُوا حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ بِفَضْلِ غُسْلِهَا مِنْ الْجَنَابَةِ";
ibnemaja.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے سیدہ میمونہ رضی اللہ عنہ سے روایت بیان کی ہے کہ نبی ﷺ نے ان کے غسل جنابت سے بچے ہوئے پانی سے غسل فرمایا";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سلسلۃ سماک عن عکرمۃ: ضعیفۃ`;
ibnemaja.anwaar = [391,1];