var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَالِطُنَا حَتَّى يَقُولَ لِأَخٍ لِي صَغِيرٍ يَا أَبَا عُمَيْرٍ مَا فَعَلَ النُّغَيْرُ قَالَ وَكِيعٌ يَعْنِي طَيْرًا كَانَ يَلْعَبُ بِهِ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سےروایت ہے،انہو ں نے فرمایا: رسول اللہ ﷺ ہمارے ساتھ بے تکلفی کا اظہا رفرماتے تھے حتی کہ میرے چھوٹے بھائی سے فرماتے: اے ابو عمیر!نُغَیۡرکا کیا بنا؟ امام وکیع رحمہ اللہ کہتے ہیں: نُغیر ایک پرندہ تھا جس سے وہ بچہ کھیلتا تھا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;