var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَتْفِ الشَّيْبِ وَقَالَ هُوَ نُورُ الْمُؤْمِنِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ نے بڑھاپے کے (سفید)بال اکھاڑنے سے منع فرمایااور فرمایا: وہ مومن کا نور ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;