var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ قَيْسِ بْنِ طِخْفَةَ الْغِفَارِيِّ عَنْ أَبِيهِ قَالَ أَصَابَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَائِمًا فِي الْمَسْجِدِ عَلَى بَطْنِي فَرَكَضَنِي بِرِجْلِهِ وَقَالَ مَا لَكَ وَلِهَذَا النَّوْمِ هَذِهِ نَوْمَةٌ يَكْرَهُهَا اللَّهُ أَوْ يُبْغِضُهَا اللَّهُ";
ibnemaja.urdu = "حضرت طھفہ بن قیس غفاری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ نے مجھے مسجد میں پیٹ کے بل سوئے ہوئے پایا تو مجھے قدم مبارک سے ٹھوکا دیا اور فرمایا: اس انداز سے کیوں سوتے ہو؟سونے کا یہ انداز اللہ تعالیٰ کو ناپسند ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;