var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ عَنْ أَبِيهِ عَنْ ابْنِ طِخْفَةَ الْغِفَارِيِّ عَنْ أَبِي ذَرٍّ قَالَ مَرَّ بِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مُضْطَجِعٌ عَلَى بَطْنِي فَرَكَضَنِي بِرِجْلِهِ وَقَالَ يَا جُنَيْدِبُ إِنَّمَا هَذِهِ ضِجْعَةُ أَهْلِ النَّارِ";
ibnemaja.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:میں پیٹ کے بل لیٹا ہوا تھا،میرے پاس سے نبی ﷺ گزرے تو مجھے قدم مبارک سے ٹھوکا دے کر فرمایا: پیارے جندب!یہ اہل جہنم کے لیٹنے کا انداز ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;