var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ عَنْ الْوَلِيدِ بْنِ جَمِيلٍ الدِّمَشْقِيِّ أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ عَبْدِ الرَّحْمَنِ يُحَدِّثُ عَنْ أَبِي أُمَامَةَ قَالَ مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَجُلٍ نَائِمٍ فِي الْمَسْجِدِ مُنْبَطِحٍ عَلَى وَجْهِهِ فَضَرَبَهُ بِرِجْلِهِ وَقَالَ قُمْ وَاقْعُدْ فَإِنَّهَا نَوْمَةٌ جَهَنَّمِيَّةٌ";
ibnemaja.urdu = "حضرت ابو امامہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:نبی ﷺ ایک آدمی کے پاس سے گزرے جو مسجد میں چہرے کے بل لیٹ کر سورہا تھا۔رسول اللہ ﷺ نے اسے قدم مبارک سے ٹھوکا دیا اور فرمایا: اٹھ کر بیٹھ! یہ جہنمیوں کے انداز کی نیند ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;