var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اقْتَبَسَ عِلْمًا مِنْ النُّجُومِ اقْتَبَسَ شُعْبَةً مِنْ السِّحْرِ زَادَ مَا زَادَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سےروایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے ستاروں کا تھوڑا سا علم سیکھا اس نے جادو کا ایک حصہ سیکھ لیا۔جتنا زیادہ(علم نجوم)سیکھے گا اتنا زیادہ(جادو سیکھنے والا شمار)ہوگا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;