var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ حَدَّثَنَا ثَابِتٌ الزُّرَقِيُّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُسُبُّوا الرِّيحَ فَإِنَّهَا مِنْ رَوْحِ اللَّهِ تَأْتِي بِالرَّحْمَةِ وَالْعَذَابِ وَلَكِنْ سَلُوا اللَّهَ مِنْ خَيْرِهَا وَتَعَوَّذُوا بِاللَّهِ مِنْ شَرِّهَا";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سےروایت ہے،رسول اللہ ﷺ نے فرمایا: ہوا کو برا مت کہو،وہ اللہ کی رحمت ہے جو رحمت کا باعث ہوتی اور(کبھی)عذاب کا باعث بھی،اس لئے اللہ سے اس کی بھلائی مانگو اور اس کی برائی سے اللہ کی پناہ طلب کرو۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;