var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا الْعُمَرِيُّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَحَبُّ الْأَسْمَاءِ إِلَى اللَّهِ عَزَّ وَجَلَّ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: اللہ تعالیٰ کے نزدیک سب سے زیادہ پسند یدہ نام عبداللہ اور عبدالرحمٰن ہیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;