var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَئِنْ عِشْتُ إِنْ شَاءَ اللَّهُ لَأَنْهَيَنَّ أَنْ يُسَمَّى رَبَاحٌ وَنَجِيحٌ وَأَفْلَحُ وَنَافِعٌ وَيَسَارٌ";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اگر میں زندہ رہا تو ان شاء اللہ یہ نام رکھنے سے منع کردوں گا:رَبَاحَ (نفع) نَجِیح (کامیاب)،افلح (کامیاب)،نافع (فائدہ دینے والا)،یَسَار (آسانی۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي(2835)`;
ibnemaja.anwaar = [510,1];