var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي حَاجِبٍ عَنْ الْحَكَمِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ وَضُوءِ الْمَرْأَةِ";
ibnemaja.urdu = "سیدنا حکم بن عمرو رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے عورت کے وضو سے بچے ہوئے پانی سے آدمی کو وضو کرنے سے منع فرمایا";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;