var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ الرُّكَيْنِ عَنْ أَبِيهِ عَنْ سَمُرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُسَمِّيَ رَقِيقَنَا أَرْبَعَةَ أَسْمَاءٍ أَفْلَحُ وَنَافِعٌ وَرَبَاحٌ وَيَسَارٌ";
ibnemaja.urdu = "حضرت سمرہ بنت جندب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں اپنے غلاموں کے چار نام رکھنے سے منع فرمایا: أفلح،نافع،رَبَاح،یَسَار۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;