var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا أَبُو عَقِيلٍ حَدَّثَنَا مُجَالِدُ بْنُ سَعِيدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَ لَقِيتُ عُمَرَ بْنَ الْخَطَّابِ فَقَالَ مَنْ أَنْتَ فَقُلْتُ مَسْرُوقُ بْنُ الْأَجْدَعِ فَقَالَ عُمَرُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْأَجْدَعُ شَيْطَانٌ";
ibnemaja.urdu = "حضرت مسروق رحمہ اللہ سے روایت ہے،انہوں نے کہا: میری ملاقات حضرت عمر بن خطاب رضی اللہ عنہ سے ہوئی تو انہوں نے فرمایا:تو کون ہے؟میں نے کہا:مسروق بن اجدع ہوں۔حضرت عمر رضی اللہ عنہ نے فرمایا:میں نے رسول اللہ ﷺ سے یہ فرمان سنا ہے: اجدع شیطان ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4957)`;
ibnemaja.anwaar = [511,1];