var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ قَالَ سَمِعْتُ أَبَا رَافِعٍ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ أَنَّ زَيْنَبَ كَانَ اسْمُهَا بَرَّةَ فَقِيلَ لَهَا تُزَكِّي نَفْسَهَا فَسَمَّاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،ام المومنین حضرت زینب بنت حجش رضی اللہ عنہا کا نام برہ (نیک خاتون)تھا۔بعض لوگوں نے کہا:وہ اپنی تعریف کرتی ہیں،چنانچہ رسول اللہ ﷺ نے ان کا نام زینب رکھ دیا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;