var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ ابْنَةً لِعُمَرَ كَانَ يُقَالُ لَهَا عَاصِيَةُ فَسَمَّاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمِيلَةَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،حضرت عمر رضی اللہ عنہ کی ایک بیٹی کا نام عاصیہ تھا۔رسول اللہ ﷺ نے ان کا نام جمیلہ رکھ دیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;