var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى أَبُو الْمُحَيَّاةِ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ حَدَّثَنِي ابْنُ أَخِي عَبْدِ اللَّهِ بْنِ سَلَامٍ عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ اسْمِي عَبْدَ اللَّهِ بْنَ سَلَامٍ فَسَمَّانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ اللَّهِ بْنَ سَلَامٍ";
ibnemaja.urdu = "حضرت عبداللہ بن سلام رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں رسول اللہ ﷺ کی خدمت میں حاضر ہوا،اس وقت میرا نام عبداللہ بن سلام نہیں تھا تو رسول اللہ ﷺ نے میرا نام عبداللہ بن سلام رکھ دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3256)`;
ibnemaja.anwaar = [511,1];