var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَمَّوْا بِاسْمِي وَلَا تَكَنَّوْا بِكُنْيَتِي";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا:حضرت ابو القاسم ﷺ نے فرمایا:میرے نام پر نام رکھ لیا کرواور میری کنیت پر کنیت نہ رکھو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;