var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ حَمْزَةَ بْنِ صُهَيْبٍ أَنَّ عُمَرَ قَالَ لِصُهَيْبٍ مَا لَكَ تَكْتَنِي بِأَبِي يَحْيَى وَلَيْسَ لَكَ وَلَدٌ قَالَ كَنَّانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَبِي يَحْيَى";
ibnemaja.urdu = "حضرت حمزہ بن صہیب رحمہ اللہ سے روایت ہے،حضرت عمر رضی اللہ عنہ نے حضرت صہیب رضی اللہ عنہ سے کہا:آپ نے اپنی کنیت ابو یحییٰ کیوں رکھی ہے،حالانکہ آپ کی اولاد نہیں ہے؟انہوں نے فرمایا: میری کنیت رسول اللہ ﷺ نے ابو یحییٰ رکھی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ابن عقیل ضعیف <br>وللحدیث شواھد ضعیفۃ عند أحمد (4/ 333،6/ 16) والحاکم (3 /398) وغیرہما`;
ibnemaja.anwaar = [511,1];