var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ مَوْلًى لِلزُّبَيْرِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ أَزْوَاجِكَ كَنَّيْتَهُ غَيْرِي قَالَ فَأَنْتِ أُمُّ عَبْدِ اللَّهِ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہ سے روایت ہے،انہوں نے نبی ﷺ سے عرض کیا:آپ نے میرے سوا اپنی تمام ازواج مطہرات کی کنیت رکھی ہے۔رسول اللہ ﷺ نے فرمایا: تم ام عبداللہ ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;