var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ أَبِي التَّيَّاحِ عَنْ أَنَسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِينَا فَيَقُولُ لِأَخٍ لِي وَكَانَ صَغِيرًا يَا أَبَا عُمَيْرٍ";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ ہمارے ہاں تشریف لایاکرتے تھے اور میرے ایک بھائی سے،جو کم سن تھا،فرمایا کرتے تھے: اے ابو عمیر!";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;