var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ عَنْ الْمِقْدَادِ بْنِ عَمْرٍو قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَحْثُوَ فِي وُجُوهِ الْمَدَّاحِينَ التُّرَابَ";
ibnemaja.urdu = "حضرت مقداد بن عمرو رضی اللہ عنہ سےروایت ہے،انہوں نے فرمایا:اللہ کے رسول ﷺ نے ہمیں حکم دیا کہ ہم تعریف کرنے والوں کے چہروں پر خاک ڈالیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;