var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ مَعْبَدٍ الْجُهَنِيِّ عَنْ مُعَاوِيَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِيَّاكُمْ وَالتَّمَادُحَ فَإِنَّهُ الذَّبْحُ";
ibnemaja.urdu = "حضرت معاویہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ سے سنا،آپ فرمارہے تھے: ایک دوسرے کی تعریف سے پرہیز کرو،یہ ذبح کرنے کے برابر ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;