var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ وَعَلِيُّ بْنُ هَاشِمٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَشَارَ أَحَدُكُمْ أَخَاهُ فَلْيُشِرْ عَلَيْهِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب کوئی اپنے بھائی سے مشورہ طلب کرے تو اسے چاہیے کہ اسے مشورہ دےدے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>محمد بن أبي لیلی: ضعیف <br>ومن أجلہ ضعفہ البوصیري وأبو الزبیر عنعن`;
ibnemaja.anwaar = [511,1];