var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ يَغْتَسِلُونَ مِنْ إِنَاءٍ وَاحِدٍ وَلَا يَغْتَسِلُ أَحَدُهُمَا بِفَضْلِ صَاحِبِهِ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ اور آپ کی زوجہ ایک ہی برتن سے(پانی لے لے کر) غسل کر لیا کرتے تھے لیکن ایک دوسرے کے بچے ہوئے پانی سے غسل نہیں کرتے تھے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الحارث الأعور: ضعیف`;
ibnemaja.anwaar = [391,1];