var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي هَاشِمٍ الرُّمَّانِيِّ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اطَّلَى بَدَأَ بِعَوْرَتِهِ فَطَلَاهَا بِالنُّورَةِ وَسَائِرَ جَسَدِهِ أَهْلُهُ";
ibnemaja.urdu = "ام المومنین حضرت ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ جب بال صفا پاؤڈر استعمال کرتے تو پہلے اعضائے مستورہ پر خود پاؤڈر لگاتے،پھر باقی جسم پر آپ کی اہلیہ لگادیتیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `[3751۔3752] إسنادہ ضعیف<br>قال البوصیري: ’’ رجالہ ثقات وھو منقطع،حبیب بن أبي ثابت لم یسمع من أم سلمۃ ‘‘`;
ibnemaja.anwaar = [511,1];