var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ عَنْ كَامِلٍ أَبِي الْعَلَاءِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَى وَوَلِيَ عَانَتَهُ بِيَدِهِ";
ibnemaja.urdu = "ام المومنین حضرت ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ بال صفا پاؤڈر لگاتے تو ستر کے اعضاء پر خود اپنے ہاتھ سے لگاتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `۔3752] إسنادہ ضعیف<br>قال البوصیري: ’’ رجالہ ثقات وھو منقطع،حبیب بن أبي ثابت لم یسمع من أم سلمۃ ‘‘`;
ibnemaja.anwaar = [511,1];