var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْهِقْلُ بْنُ زِيَادٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ الْأَسْلَمِيِّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقُصُّ عَلَى النَّاسِ إِلَّا أَمِيرٌ أَوْ مَأْمُورٌ أَوْ مُرَاءٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر وضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: لوگوں کو وعظ امیر کرتا ہے،یا جسے حکم دیا گیا ہو(اور اس منصب پر مقررکیا گیا ہو،)یاریاکار۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;