var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الْعُمَرِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ لَمْ يَكُنْ الْقَصَصُ فِي زَمَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا زَمَنِ أَبِي بَكْرٍ وَلَا زَمَنِ عُمَرَ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ کے زمانہ میں قصہ گوئی تھی،نہ حضرت ابو بکر رضی اللہ عنہ کے زمانے میں اور نہ حضرت عمر کے زمانے میں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;