var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ عَنْ مَرْوَانَ بْنِ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ بْنِ عَبْدِ يَغُوثَ عَنْ أُبَيِّ بْنِ كَعْبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ الشِّعْرِ لَحِكْمَةً";
ibnemaja.urdu = "حضرت ابی بن کعب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺنے فرمایا: کچھ شعر دانائی اور حکمت ہوتے ہیں۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;