var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَصْدَقُ كَلِمَةٍ قَالَهَا الشَّاعِرُ كَلِمَةُ لَبِيدٍ أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلُ وَكَادَ أُمَيَّةُ بْنُ أَبِي الصَّلْتِ أَنْ يُسْلِمَ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: کسی شاعر کی کہی ہوئی سب سے سچی بات لبید کا یہ کلام ہے:[أَلَا کُلُّ شَیۡ ءٍ مَا خَلَا اللہَ،بَاطِلُ]اللہ کے سوا ہر چیز باطل ہے۔اور امیہ بن ابو صلت قریب تھا کہ مسلمان ہوجاتا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;