var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا حَفْصٌ وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَمْتَلِئَ جَوْفُ الرَّجُلِ قَيْحًا حَتَّى يَرِيَهُ خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا إِلَّا أَنَّ حَفْصًا لَمْ يَقُلْ يَرِيَهُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: آدمی کے پیٹ کا(برے اور گندے)شعروں سے بھرے ہونے سے بہتر یہ ہے کہ وہ پیپ سے بھرا ہوا ہو جس سے وہ بیمار ہوجائے۔روایت کے راوی حفص نے[یَرِیَہ]کے لفظ بیان نہیں کیے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;