var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ حَدَّثَنِي قَتَادَةُ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا حَتَّى يَرِيَهُ خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا";
ibnemaja.urdu = "حضرت سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: آدمی کے پیٹ کا شعروں سے بھرے ہونے سے بہتر یہ ہے کہ وہ پیپ سے بھرا ہوا ہو جس سے وہ بیمار ہوجائے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;