var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ شَيْبَانَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَعْظَمَ النَّاسِ فِرْيَةً لَرَجُلٌ هَاجَى رَجُلًا فَهَجَا الْقَبِيلَةَ بِأَسْرِهَا وَرَجُلٌ انْتَفَى مِنْ أَبِيهِ وَزَنَّى أُمَّهُ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سب سے بڑا جھوٹ بولنے والا شخص وہ ہے کہ ایک آدمی نے دوسرے کی ہجو کی تو اس نے(جواب میں)پورے قبیلے کی ہجوکی(یہ سب سے بڑا جھوٹا ہے۔)اور وہ آدمی جو اپنے پاب سے نسبی تعلق توڑتا ہے اور اپنی ماں کو بدکارقراردیتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سلیمان الأعمش عنعن <br>وحدیث البخاري (3509) یغني عنہ`;
ibnemaja.anwaar = [511,1];