var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ حَدَّثَنَا شَرِيكٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَظَرَ إِلَى إِنْسَانٍ يَتْبَعُ طَائِرًا فَقَالَ شَيْطَانٌ يَتْبَعُ شَيْطَانًا";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے دیکھا کہ ایک آدمی ایک پرندے کا پیچھا کررہا ہےتو فرمایا: ایک شیطان دوسرے شیطان کا پیچھا کررہا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;