var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَتْبَعُ حَمَامَةً فَقَالَ شَيْطَانٌ يَتْبَعُ شَيْطَانَةً";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے ایک آدمی کو کبوتر کا پیچھا کرتے دیکھا تو فرمایا: ایک شیطان دوسرے شیطان کا پیچھا کررہا ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;