var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ الْحَسَنِ بْنِ أَبِي الْحَسَنِ عَنْ عُثْمَانَ بْنِ عَفَّانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا وَرَاءَ حَمَامَةٍ فَقَالَ شَيْطَانٌ يَتْبَعُ شَيْطَانَةً";
ibnemaja.urdu = "حضرت عثمان بن عفان رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے ایک آدمی کو کبوتر کے پیچھے (بھاگتے)دیکھا تو فرمایا: شیطان،شیطان کاپیچھا کررہا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;