var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو نَصْرٍ مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ حَدَّثَنَا رَوَّادُ بْنُ الْجَرَّاحِ حَدَّثَنَا أَبُو سَعْدٍ السَّاعِدِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَتْبَعُ حَمَامًا فَقَالَ شَيْطَانٌ يَتْبَعُ شَيْطَانًا";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺنے ایک آدمی کو کبوتر کا پیچھا کرتے دیکھا تو فرمایا: شیطان،شیطان کا پیچھا کررہا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;