var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ عَاصِمِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ يَعْلَمُ أَحَدُكُمْ مَا فِي الْوَحْدَةِ مَا سَارَ أَحَدٌ بِلَيْلٍ وَحْدَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:اگر تمہیں معلوم ہوجائے کہ تنہائی میں کیا کیا(خرابی اور نقصان)ہے تو کوئی شخص رات کو اکیلا سفر نہ کرے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;