var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ عَنْ خَالَتِهِ مَيْمُونَةَ قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ";
ibnemaja.urdu = "ام المؤمنین میمونہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں اور رسول اللہ ﷺ ایک ہی برتن سے غسل کر لیا کرتےتھے";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;