var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ احْتَرَقَ بَيْتٌ بِالْمَدِينَةِ عَلَى أَهْلِهِ فَحُدِّثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَأْنِهِمْ فَقَالَ إِنَّمَا هَذِهِ النَّارُ عَدُوٌّ لَكُمْ فَإِذَا نِمْتُمْ فَأَطْفِئُوهَا عَنْكُمْ";
ibnemaja.urdu = "حضرت ابو موسیٰ رضی اللہ عنہ سے روایت ہے کہ مدینہ منورہ میں ایک گھر کو آگ لگ گئی جبکہ گھر والے گھر میں تھے۔نبی ﷺ کو ان کے حادثے کی خبر ہوئی تو آپ نے فرمایا: یہ آگ تمہاری دشمن ہے۔جب تم سونے لگو تو اسے بجھادیا کرو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;