var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عَبْدِ الْمَلِكِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَهَانَا فَأَمَرَنَا أَنْ نُطْفِئَ سِرَاجَنَا";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ نے ہمیں (بہت سے کاموں کا) حکم دیا،اور (بہت سے کاموں سے) منع فرمایا۔آپ نے ہمیں یہ حکم بھی دیا کہ (سوتے وقت) چراغ بجھادیا کریں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;