var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا هِشَامٌ عَنْ الْحَسَنِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْزِلُوا عَلَى جَوَادِّ الطَّرِيقِ وَلَا تَقْضُوا عَلَيْهَا الْحَاجَاتِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: راستے پر قیام نہ کرو،نہ وہاں قضائے حاجت کرو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ابو داود (2570) مسند احمد (3/ 382)<br>الحسن لم یسمع من جابر رضی اللہ عنہ<br>وحدیثا مسلم (1926،269) یغنیان عنہ`;
ibnemaja.anwaar = [511,1];