var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا بَقِيَّةُ أَنْبَأَنَا أَبُو أَحْمَدَ الدِّمَشْقِيُّ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَرِّبُوا صُحُفَكُمْ أَنْجَحُ لَهَا إِنَّ التُّرَابَ مُبَارَكٌ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اپنی تحریروں پر مٹی ڈال دیا کرو،یہ کامیابی کا باعث ہوگا۔مٹی برکت والی چیز ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>بقیۃ عنعن <br>وأبو أحمد عمر الکلاعي الدمشقي: ضعیف من شیوخ بقیۃ المجہولین (تقریب: 4953) <br>وللحدیث شواہد ضعیفۃ مردودۃ`;
ibnemaja.anwaar = [511,2];