var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ قُلْتُ لِعَمْرِو بْنِ دِينَارٍ أَسَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ مَرَّ رَجُلٌ بِسِهَامٍ فِي الْمَسْجِدِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ بِنِصَالِهَا قَالَ نَعَمْ";
ibnemaja.urdu = "سفیان بن عینیہ رحمہ اللہ کہتے ہیں: میں نے حضرت عمر بن دینار سے کہا:آپ نے حضرت جابر بن عبداللہ رضی اللہ عنہما کو فرماتےہوئے سنا:ایک آدمی تیر لے کر مسجد میں سے گزرا تو رسول اللہ ﷺ نے فرمایا: ان کے پیکان پکڑلو۔انہوں نے جواب دیا ہاں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;