var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ جَدِّهِ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا أَوْ فِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا بِكَفِّهِ أَنْ تُصِيبَ أَحَدًا مِنْ الْمُسْلِمِينَ بِشَيْءٍ أَوْ فَلْيَقْبِضْ عَلَى نِصَالِهَا";
ibnemaja.urdu = "حضرت ابو موسیٰ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جب کوئی شخص تیر لے کرہماری مسجد یا ہمارے بازار میں سے گزرے تو اسے چاہیے کہ ان کے پیکان ہاتھ سے پکڑ لے،ایسا نہ ہو کہ کسی مسلمان کو کچھ کچھ گزند پہنچے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;