var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَؤُهُ يَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شَاقٌّ لَهُ أَجْرَانِ اثْنَانِ";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قرآن کریم(صحت کے ساتھ) پڑھنے میں ماہر (قیامت کے دن)معزز نیکوکار فرشتوں کے ساتھ ہوگا۔اور جو شخص اسےاٹک اٹک کر پڑھتا ہے اور اسے پڑھنے میں مشقت ہوتی ہے،اس کے لئے دگنا اجر ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;