var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عَامِرٍ الْأَشْعَرِيُّ عَبْدُ اللَّهِ بْنُ عَامِرٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أُمِّ هَانِئٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَ وَمَيْمُونَةَ مِنْ إِنَاءٍ وَاحِدٍ فِي قَصْعَةٍ فِيهَا أَثَرُ الْعَجِينِ";
ibnemaja.urdu = "سیدہ ام ہانی رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ اور سیدہ میمونہ رضی اللہ عنہا نے ایک ٹب(میں پانی لے کر اس) سے غسل کیا جب کہ اس(برتن) میں گوندھے ہوئے) آٹے کا اثر تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نسائي (241)`;
ibnemaja.anwaar = [391,1];