var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَنْبَأَنَا شَيْبَانُ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لِصَاحِبِ الْقُرْآنِ إِذَا دَخَلَ الْجَنَّةَ اقْرَأْ وَاصْعَدْ فَيَقْرَأُ وَيَصْعَدُ بِكُلِّ آيَةٍ دَرَجَةً حَتَّى يَقْرَأَ آخِرَ شَيْءٍ مَعَهُ";
ibnemaja.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قرآن والے (حافظ یا قاری)سے (قیامت کے دن)جنت میں داخل ہوتے وقت کہا جائے گا:قرآن پڑھتا جا اور(جنت کے درجات میں)چڑھتا جا۔وہ پڑھتا جائے گا اور ہر آیت کے ساتھ ایک ایک درجہ بلند ہوتا چلا جائے گا حتی کہ اسے جو آخری آیت یاد ہے،وہ بھی پڑھ لے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;