var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ بَشِيرِ بْنِ مُهَاجِرٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجِيءُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ كَالرَّجُلِ الشَّاحِبِ فَيَقُولُ أَنَا الَّذِي أَسْهَرْتُ لَيْلَكَ وَأَظْمَأْتُ نَهَارَكَ";
ibnemaja.urdu = "حضرت بُریدہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قیامت کے دن قرآن مجیدمیں ایسے مرد کی شکل میں آئے جس کا رنگ اُڑا ہوا ہو۔اور کہے گا: میں وہی ہوں جس نے تجھے رات کو بیدار رکھا اور دن کو پیاسارکھا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;