var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْقُرْآنِ مَثَلُ الْإِبِلِ الْمُعَقَّلَةِ إِنْ تَعَاهَدَهَا صَاحِبُهَا بِعُقُلِهَا أَمْسَكَهَا عَلَيْهِ وَإِنْ أَطْلَقَ عُقُلَهَا ذَهَبَتْ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺنے فرمایا: قرآن کی مثال گھٹنابندھے ہوئے اونٹوں کی سی ہے۔اگر مالک ان کے بندھنوں کے ذریعے سے ان کی حفاظت کرے گا تو انہیں اپنے قابو میں رکھے گا،اور اگر ان کے بندھن کھول دے گا تو وہ بھاگ جائیں گے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;