var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ عَبَّاسٍ الْجُشَمِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ سُورَةً فِي الْقُرْآنِ ثَلَاثُونَ آيَةً شَفَعَتْ لِصَاحِبِهَا حَتَّى غُفِرَ لَهُ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:قرآن مجید میں ایک سورت جس کی تیس آیتیں ہیں۔اس نے اپنے پڑھنے والے کی شفاعت کی حتی کہ اس کی مغفرت ہوگئی۔(وہ سورت ہے)(تَبَارَکَ الَّذِیۡ بِیَدِہِ الۡمُلۡکُ)";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;