var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي قَيْسٍ الْأَوْدِيِّ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُ أَحَدٌ الْوَاحِدُ الصَّمَدُ تَعْدِلُ ثُلُثَ الْقُرْآنِ";
ibnemaja.urdu = "حضرت ابو مسعود انصاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:[اَللہُ اَحَدٌ،اَلۡوَاحِدُ الصَّمَدُ] تہائی قرآن کے برابر ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;