var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ الْأَسَدِيُّ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَزْوَاجُهُ يَغْتَسِلُونَ مِنْ إِنَاءٍ وَاحِدٍ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ اور آپ کی ازواج مطہرات ایک ہی برتن سے غسل کر لیا کرتے تھے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;