var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ عَنْ الْأَوْزَاعِيِّ عَنْ إِسْمَعِيلَ بْنِ عُبَيْدِ اللَّهِ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ أَنَا مَعَ عَبْدِي إِذَا هُوَ ذَكَرَنِي وَتَحَرَّكَتْ بِي شَفَتَاهُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اللہ تعالیٰ فرماتا ہے میں اپنے بندے کے ساتھ ہوتاہوں،جب وہ میرا ذکر کرتا ہے اور اس کے ہونٹ میرے ذکر کے ساتھ حرکت کرتے ہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;