var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ أَخْبَرَنِي عَمْرُو بْنُ قَيْسٍ الْكِنْدِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ أَنَّ أَعْرَابِيًّا قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ شَرَائِعَ الْإِسْلَامِ قَدْ كَثُرَتْ عَلَيَّ فَأَنْبِئْنِي مِنْهَا بِشَيْءٍ أَتَشَبَّثُ بِهِ قَالَ لَا يَزَالُ لِسَانُكَ رَطْبًا مِنْ ذِكْرِ اللَّهِ عَزَّ وَجَلَّ";
ibnemaja.urdu = "حضرت عبداللہ بن بسر رضی اللہ عنہ سے روایت ہے،ایک اعرابی نے رسول اللہ ﷺ سے عرض کیا: اسلام میں نیک اعمال بہت زیادہ ہیں (میں ان سب کو کماحقہ ادا نہیں کرسکتا۔)مجھے ایک بات بتادیجئے جسے میں مضبوطی سے پکڑ لوں۔آپ نے فرمایا: تیری زبان ہمیشہ اللہ کے ذکر سے تررہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;