var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا زَكَرِيَّا بْنُ مَنْظُورٍ حَدَّثَنِي مُحَمَّدُ بْنُ عُقْبَةَ عَنْ أُمِّ هَانِئٍ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا إِلَهَ إِلَّا اللَّهُ لَا يَسْبِقُهَا عَمَلٌ وَلَا تَتْرُكُ ذَنْبًا";
ibnemaja.urdu = "حضرت ام ہانئ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: لَااِلٰہَ اِلاَّ اللہُ(سے بڑھ کر (افضل)کوئی عمل نہیں اور یہ کسی گناہ کو باقی نہیں چھوڑتا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>زکریا بن منظور: ضعیف وضعفہ الجمھور (مجمع الزوائد 146/10) <br>و محمد بن عقبۃ بن أبي مالک: مستور (تقریب: 2026،6142)`;
ibnemaja.anwaar = [512,1];