var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَدَّثَ عَنِّي حَدِيثًا وَهُوَ يَرَى أَنَّهُ كَذِبٌ فَهُوَ أَحَدُ الْكَاذِبَيْنِ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:‘‘ جس شخص نے میری طرف نسبت کر کے کوئی حدیث بیان کی،حالانکہ اس کے خیال میں وہ جھوٹ ہے تو وہ بھی دو جھوٹوں میں سے ایک جھوٹا ہے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;