var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ أَنَّهَا كَانَتْ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلَانِ مِنْ إِنَاءٍ وَاحِدٍ";
ibnemaja.urdu = "ام المومنین سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ وہ اور رسول اللہ ﷺ ایک ہی برتن میں سے غسل کر لیتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;