var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا مُوسَى بْنُ إِبْرَاهِيمَ بْنِ كَثِيرِ بْنِ بَشِيرِ بْنِ الْفَاكِهِ قَالَ سَمِعْتُ طَلْحَةَ بْنَ خِرَاشٍ ابْنَ عَمِّ جَابِرٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَفْضَلُ الذِّكْرِ لَا إِلَهَ إِلَّا اللَّهُ وَأَفْضَلُ الدُّعَاءِ الْحَمْدُ لِلَّهِ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سب سے افضل ذکر [لَااِلٰہَ اِلاَّ اللہُ]ہے،اور سب سے افضل دعا[اَلۡحَمۡدُ لِلہِ]ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;