var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ شَبِيبِ بْنِ بِشْرٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَنْعَمَ اللَّهُ عَلَى عَبْدٍ نِعْمَةً فَقَالَ الْحَمْدُ لِلَّهِ إِلَّا كَانَ الَّذِي أَعْطَاهُ أَفْضَلَ مِمَّا أَخَذَ";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب اللہ بندے کو کوئی نعمت دیتا ہے اور بندہ الحمد للہ کہتاہے تو بندے نے جو (شکر) ادا کیا،وہ ملنے والی نعمت سے افضل ہوتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>شبیب بن بشر ضعیف`;
ibnemaja.anwaar = [513,1];