var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ ثَقِيلَتَانِ فِي الْمِيزَانِ حَبِيبَتَانِ إِلَى الرَّحْمَنِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دو کلمات ایسے ہیں جو زبان پر ہلکے ہیں،(اعمال کے) میزان میں بھاری ہیں،رحمان کو پیارے ہیں:[سُبۡحَانَ اللہِ وَبِحَمۡدِہٖ،سُبۡحَانَ اللہِ الۡعَظِیۡمِ] میں اللہ کی پاکیزگی بیان کرتا ہوں اور اس کی تعریف کرتا ہوں،پاک ہے اللہ عظمتوں والا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;