var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عُمَرَ حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرْبَعٌ أَفْضَلُ الْكَلَامِ لَا يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ";
ibnemaja.urdu = "حضر سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: چار کلمات سب سے افضل ہیں۔جس کلمہ سے بھی شروع کرو کوئی حرج نہیں[سُبۡحَانَ اللہِ وَالۡحَمۡدُ لِلہِ وَلَا اِلٰہَ اِلَّا اللہُ وَاللہُ اَکۡبَرُ]";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;