var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْوَشَّاءُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ غُفِرَتْ لَهُ ذُنُوبُهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص سو بار[سُبۡحَانَ اللہِ وَبِحَمۡدِہٖ]کہے،اس کے گناہ معاف ہوجائیں گے اگرچہ سمندر کے جھاگ کی طرح (بے شمار)ہوں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;