var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عُمَرَ بْنِ رَاشِدٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الدَّرْدَاءِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكَ بِسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَإِنَّهَا يَعْنِي يَحْطُطْنَ الْخَطَايَا كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا";
ibnemaja.urdu = "حضرت ابودرداء رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:رسول اللہ ﷺ نے مجھ سے فرمایا:[سُبۡحَانَ اللہِ وَالۡحَمۡدُ لِلہِ وَلَا اِلٰہَ اِلَّا اللہُ وَاللہُ اَکۡبَرُ]پڑھتے رہا کرو۔ان کلمات کی وجہ سے گناہ اس طرح ختم ہوجاتے ہیں جس طرح درخت سے پتے جھڑ جاتے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عمر بن راشد:ضعیف`;
ibnemaja.anwaar = [513,1];