var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُسَامَةَ وَالْمُحَارِبِيُّ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ مُحَمَّدِ بْنِ سُوقَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ إِنْ كُنَّا لَنَعُدُّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَجْلِسِ يَقُولُ رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ مِائَةَ مَرَّةٍ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا:ہم رسول اللہ ﷺ کو ایک مجلس میں سو مرتبہ (یہ استغفار کہتے ہوئے)شمار کرتے تھے:[رَبِّ اغۡفِرۡلِی وَتُبۡ عَلَیَّ اِنَّکَ أَنۡتَ التَّوَّابُ الرَّحِیۡمُ] اے!میرے رب! مجھے بخش دے اور میری توبہ قبول فرما۔بے شک تو بہت توبہ قبول کرنے والا،نہایت مہربان ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;