var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عِرْقٍ سَمِعْتُ عَبْدَ اللَّهِ بْنَ بُسْرٍ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طُوبَى لِمَنْ وَجَدَ فِي صَحِيفَتِهِ اسْتِغْفَارًا كَثِيرًا";
ibnemaja.urdu = "حضرت عبداللہ بن بسر رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:مبارک ہو اس شخص کو جسے اپنے نامہ اعمال میں زیادہ استغفار ملا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;