var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَبِي عُثْمَانَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ اجْعَلْنِي مِنْ الَّذِينَ إِذَا أَحْسَنُوا اسْتَبْشَرُوا وَإِذَا أَسَاءُوا اسْتَغْفَرُوا";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ فرمایا کرتے تھے: اے اللہ! مجھے ا ن لوگوں میں شامل فرماجو جب نیکی کرتے ہیں تو انہیں خوشی ہوتی ہے اور جب گناہ کرتے ہیں تو استغفار کرتے ہیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;