var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ لَهُ الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِ مِائَةِ ضِعْفٍ قَالَ اللَّهُ سُبْحَانَهُ إِلَّا الصَّوْمَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: آدم کے بیٹے کا ہرعمل (ثواب میں)بڑھتا ہے۔(یعنی)ایک نیکی دس گناہ سے سات سو گناہ تک بڑھتی ہے۔اللہ تعالیٰ فرماتا ہے:سوائے روزے کے کیونکہ وہ (خالص)میرے لئے ہوتا ہے اور میں ہی اس کا بدلہ دوں گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;