var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي ذَرٍّ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ";
ibnemaja.urdu = "حضرت ابوذر رضی اللہ عنہ سے روایت ہے،انہوں نے کہا:رسول اللہ ﷺ نے مجھ سے فرمایا:کیا میں تجھے جنت کے خزانوں میں سے ایک خزانے کا پتہ نہ دوں؟ میں نے کہا:کیوں نہیں اے اللہ کے رسول!آپ نے فرمایا: [لَا حَوۡلَ وَلَا قُوَّۃَ اِلَّا بِاللہِ]";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;