var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدٍ الْمَدَنِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ حَدَّثَنَا خَالِدُ بْنُ سَعِيدٍ عَنْ أَبِي زَيْنَبَ مَوْلَى حَازِمِ بْنِ حَرْمَلَةَ عَنْ حَازِمِ بْنِ حَرْمَلَةَ قَالَ مَرَرْتُ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي يَا حَازِمُ أَكْثِرْ مِنْ قَوْلِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ فَإِنَّهَا مِنْ كُنُوزِ الْجَنَّةِ";
ibnemaja.urdu = "حضرت حازم بن حرملہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا:میں نبی ﷺ کے پاس سے گزرا تو آپ نے مجھ سے فرمایا:اے حازم![لَا حَوۡلَ وَلَا قُوَّۃَ اِلَّا بِاللہِ]زیادہ کہا کرو کیونکہ یہ جنت کا ایک خزانہ ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;