var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ ذَرِّ بْنِ عَبْدِ اللَّهِ الْهَمْدَانِيِّ عَنْ يُسَيْعٍ الْكِنْدِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الدُّعَاءَ هُوَ الْعِبَادَةُ ثُمَّ قَرَأَ وَقَالَ رَبُّكُمْ ادْعُونِي أَسْتَجِبْ لَكُمْ(غافر:60)";
ibnemaja.urdu = "حضرت نعمان بن بشیر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: دعا ہی عبادت ہے۔پھر نبی ﷺ نے یہ آیت پڑھی(وَقَالَ رَبُّکُمُ ادۡعُوۡنِیۡ اَسۡتَجِبۡ لَکُمۡ) اور تمہارے رب نے فرمایا:مجھے پکارو،میں تمہاری پکار قبول کروں گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = `مشکوۃ المصابیح: 2357
ولہ شاھد حسن لذاتہ عند البیہقی فی شعب الایمان (1/ 372  ح 6996)`;