var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ سُبْحَانَهُ مِنْ الدُّعَاءِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اللہ سبحانہ وتعالیٰ کے ہاں دعا سے بڑھ کر کوئی چیز عزت والی نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3370)`;
ibnemaja.anwaar = [513,1];