var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ فرمایاکرتے تھے:[ اَللّٰھُمَّ اِنِّی أَسۡأَلُکَ الۡھُدٰی وَالتُّقٰی وَالۡعَفَافَ وَالۡغِنٰی] اے اللہ!میں تجھ سے ہدایت،تقویٰ،پاک دامنی اور استغنا کا سوال کرتا ہوں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;