var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ مُحَمَّدِ بْنِ ثَابِتٍ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا وَالْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَأَعُوذُ بِاللَّهِ مِنْ عَذَابِ النَّارِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ فرمایا کرتے تھے: [ا َللّٰھُمَّ!انۡفَعۡنِی بِمَا عَلَّمۡتَنِی،وَعَلِّمۡنِی مَایَنۡفَعُنِی،وَزِدۡنِی عِلۡمًا،وَالۡحَمۡدُلِلہِ عَلٰی کُلِّ حَالٍ،وَاَعُوۡذُبِاللہِ مِنۡ عَذَابِ النَّارِ] اے اللہ! تو نے مجھے جو علم دیا ہےاس سے مجھے فائدہ دے،اور مجھے وہ علم عطافرماجو مجھے فائدہ دے اور میرے علم میں اضافہ فرما۔ہرحال میں اللہ کی تعریف ہے اور میں آگ کے عذاب سے اللہ کی پناہ کاطالب ہوں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف`;
ibnemaja.anwaar = [513,1];