var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ عَنْ الْأَوْزَاعِيِّ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ عَنْ جَعْفَرِ بْنِ عِيَاضٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَوَّذُوا بِاللَّهِ مِنْ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ وَأَنْ تَظْلِمَ أَوْ تُظْلَمَ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’فقر،قلت،ذلت،ظلم کرنے اور مظلوم ہونے سے اللہ کی پناہ مانگو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;