var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلُوا اللَّهَ عِلْمًا نَافِعًا وَتَعَوَّذُوا بِاللَّهِ مِنْ عِلْمٍ لَا يَنْفَعُ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’’اللہ سے نفع بخش علم مانگو اور فائدہ نہ دینے والے علم سے اللہ کی پناہ مانگو۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;