var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ الْجُبْنِ وَالْبُخْلِ وَأَرْذَلِ الْعُمُرِ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الصَّدْرِ قَالَ وَكِيعٌ يَعْنِي الرَّجُلَ يَمُوتُ عَلَى فِتْنَةٍ لَا يَسْتَغْفِرُ اللَّهَ مِنْهَا";
ibnemaja.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے کہ نبیﷺ بزدلی،بخل،انتہائی بڑھاپے اور لاچاری کی عمر،عذاب قبر اور سینے کے فتنے سے پناہ مانگا کرتے تھے۔\nامام وکیع رحمۃ اللہ علیہ بیان کرتے ہیں: سینے (اور دکل) کے فتنے سے مراد یہ ہے کہ آدمی فتنے میں مبتلا ہو کر فوت ہو جائے اور اس نے اللہ سے (بچنے کے لیے) اس سے معافی نہ مانگی ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1539)`;
ibnemaja.anwaar = [514,1];