var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَرْحَمُنَا اللَّهُ وَأَخَا عَادٍ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہﷺ نے فرمایا: اللہ تعالیٰ ہم پ راور قوم عاد کی ہم نسب شخصیت (حضرت ہود علیہ السلام) پر رحم فرمائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>أبو إسحاق ھو الشیباني،وفیہ عنعنۃ سفیان الثوري<br>وللحدیث شاہد مرسل ضعیف عند ابن أبي شیبۃ (220/10) وحدیث مسلم (2380/172) یُغني عنہ`;
ibnemaja.anwaar = [514,1];