var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنِ ابْنِ عَجْلَانَ،عَنْ أَبِي الزِّنَادِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يَقُولَنَّ أَحَدُكُمْ: اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ،وَلْيَعْزِمْ فِي الْمَسْأَلَةِ،فَإِنَّ اللَّهَ لَا مُكْرِهَ لَهُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: تم میں سے کوئی شخص یوں نہ کہے: یااللہ! اگر تو چاہتا ہے تو مجھے بخش دے۔اے چاہیے کہ پختہ امید کے ساتھ دعا مانگے کیونکہ اللہ کو کوئی مجبور نہیں کرسکتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;