var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا،مِائَةً إِلَّا وَاحِدًا،مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: اللہ کے ننانوے،یعنی ایک کم سو نام ہیں،جو انہیں شمار کرےگا،جنت میں داخل ہو جائے گا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;