var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ،عَنْ هِشَامٍ الدَّسْتُوَائِيِّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي جَعْفَرٍ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ثَلَاثُ دَعَوَاتٍ يُسْتَجَابُ لَهُنَّ،لَا شَكَّ فِيهِنَّ: دَعْوَةُ الْمَظْلُومِ،وَدَعْوَةُ الْمُسَافِرِ،وَدَعْوَةُ الْوَالِدِ لِوَلَدِهِ";
ibnemaja.urdu = "حضرت ابو ہریرہؓ سے روایت ہےرسول اللہ نے فرمایا:تین دعائیں قبول ہوتیں ہین۔ان(کی قبولیت) میں کوئی شک نہیں:مظلوم کی دعا مسافر کی دعااور والد کی اپنی اولاد کے حق میں دعا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;