var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا أَبُو سَلَمَةَ قَالَ: حَدَّثَتْنَا حُبَابَةُ ابْنَةُ عَجْلَانَ،عَنْ أُمِّهَا أُمِّ حَفْصٍ،عَنْ صَفِيَّةَ بِنْتِ جَرِيرٍ،عَنْ أُمِّ حَكِيمٍ بِنْتِ وَدَّاعٍ الْخُزَاعِيَّةِ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «دُعَاءُ الْوَالِدِ يُفْضِي إِلَى الْحِجَابِ»";
ibnemaja.urdu = "حضرت ام حکیم بنت وداع خزاعیہ سے روایت ہےرسول اللہ ﷺنے فرمایا:(ماں)ماں باپ کی دعا(اللہ تعالیٰ کے)حجاب تک پہنچ جاتی ہے(قبول ہوتی ہے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال الذہبي في میزان الإعتدال: ’’ حبابۃ لا تعرف،ولا أمہا،ولا صفیۃ،تفرد عنہا التبوذکي‘‘ (605/4)`;
ibnemaja.anwaar = [515,1];