var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ جَعْفَرِ بْنِ مَيْمُونٍ،عَنْ أَبِي عُثْمَانَ،عَنْ سَلْمَانَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ رَبَّكُمْ حَيِيٌّ كَرِيمٌ،يَسْتَحْيِي مِنْ عَبْدِهِ أَنْ يَرْفَعَ إِلَيْهِ يَدَيْهِ،فَيَرُدَّهُمَا صِفْرًا،-أَوْ قَالَ: خَائِبَتَيْنِ-";
ibnemaja.urdu = "حضرت سلمان فارسی ؓ سے روایت ہے نبیﷺ نے فرمایا:تمھا راپروردگار حیا دار اور سخی ہے وہ اس بات سے شرماتا ہے کہ بندہ(دعا کے لیے) اسی کی طرف ہاتھ اٹھائے وہ انھیں خالی یا فرمایا: ناکام پھیر دے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = `ولہ شاھد حسن عند امالی المحاملی (433 وسندہ حسن، /ندیم ظہیر)`;