var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا عَائِذُ بْنُ حَبِيبٍ عَنْ صَالِحِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَعَوْتَ اللَّهَ فَادْعُ بِبُطُونِ كَفَّيْكَ وَلَا تَدْعُ بِظُهُورِهِمَا فَإِذَا فَرَغْتَ فَامْسَحْ بِهِمَا وَجْهَكَ";
ibnemaja.urdu = "حضرت عبدااللہ بن عباسؓ سےروایت ہےرسولﷺ نے فرمایا جب تو اللہ سے دعا کرے تو ہتھیلیوں کو اندر کی طرف اوپر کرکے دعا کر،ہاتھوں کی پشت کے ساتھ دعا نہ کر۔جب تو (دعا سے) فارغ ہوجائے تو ہاتھوں کو چہروں پر پھیرلے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف جدًا <br>سنن أبي داود (1485)<br>صالح بن حسان: متروک`;
ibnemaja.anwaar = [515,1];