var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنِي اللَّيْثُ بْنُ سَعْدٍ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ مُسْلِمِ بْنِ مَخْشِيٍّ عَنْ ابْنِ الْفِرَاسِيِّ قَالَ كُنْتُ أَصِيدُ وَكَانَتْ لِي قِرْبَةٌ أَجْعَلُ فِيهَا مَاءً وَإِنِّي تَوَضَّأْتُ بِمَاءِ الْبَحْرِ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ";
ibnemaja.urdu = "سیدنا ابن فراسی رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں شکار کیا کرتا تھا اور میرے پاس ایک مشک تھی،میں اس میں پانی ڈال لیا کرتا تھا۔میں نے سمندر کے پانی سے وضو کیا،پھر رسول اللہ ﷺ سے یہ واقعہ بیان کیا تو آپ ﷺ نے فرمایا:’’اس کا پانی پاک کرنے والا ہے اور اس کا مرا ہوا جانور حلال ہے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>مسلم بن مخشی مجھول الحال<br>لم یوثقہ غیر ابن حبان والحدیث السابق (الأصل: 386) یغني عنہ`;
ibnemaja.anwaar = [391,2];