var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي عُبَيْدَةَ،عَنْ عَبْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ وَضَعَ يَدَهُ-يَعْنِي الْيُمْنَى-تَحْتَ خَدِّهِ،ثُمَّ قَالَ: «قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ-أَوْ تَجْمَعُ عِبَادَكَ-»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ جب بستر پر تشریف لے جاتے تو اپنا دایاں ہاتھ اپنے رخسار کے نیچے رکھ کر فرماتے: (اللہم! قنی عذابک یوم تبعث عبادک) یا فرماتے (یوم تجمع عبادک) اے اللہ! مجھے (اس دن) اپنے عذاب سے محفوظ رکھنا جس دن تواپنے بندوں کو اٹھائےگا۔یا اپنے بندوں کو جمع کرے گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;