var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ،عَنْ رِبْعِيِّ بْنِ حِرَاشٍ،عَنْ حُذَيْفَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا انْتَبَهَ مِنَ اللَّيْلِ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا،وَإِلَيْهِ النُّشُورُ»";
ibnemaja.urdu = "حضرت حذیفہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جب رات کو جاگتے تو فرماتے: (الحمدللہ الذی احیانا بعد ما اماتنا والیہ النشور) اللہ کا شکر ہے جس نے ہمیں موت دینے کے بعد زندگی بخش دی اور اسی کی طرف اٹھ کر جانا ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;