var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا أَبُو الْحُسَيْنِ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ عَاصِمِ بْنِ أَبِي النُّجُودِ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أَبِي ظَبْيَةَ،عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ عَبْدٍ بَاتَ عَلَى طُهُورٍ،ثُمَّ تَعَارَّ مِنَ اللَّيْلِ فَسَأَلَ اللَّهَ شَيْئًا مِنْ أَمْرِ الدُّنْيَا،أَوْ مِنْ أَمْرِ الْآخِرَةِ،إِلَّا أَعْطَاهُ»";
ibnemaja.urdu = "حضرت معاذ بن جبل رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو بندہ با وضو سوتا ہے،پھر رات کو اس کی آنکھ کھلتی ہے تو وہ اللہ سے دنیا کے معاملات میں سے یا آخرت کے معاملات میں سے کسی چیز کا سوال کرتا ہے تو اللہ اسے وہ چیز دے دیتا ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;