var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ،عَنْ مَنْصُورٍ،عَنِ الشَّعْبِيِّ،عَنْ أُمِّ سَلَمَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ مَنْزِلِهِ قَالَ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ،أَوْ أَزِلَّ،أَوْ أَظْلِمَ أَوْ أُظْلَمَ،أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ»";
ibnemaja.urdu = "ام المومنین حضرت ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ جب گھر سے باہر تشریف لے جاتے تو فرماتے تھے: (اللہم! انی اعوذبک ان اضل او ازل او اظلم او اظلم او اجہل او یجہل علی) یا اللہ! میں (اس بات سے) تیری پناہ میں آتا ہوں کہ میں گمراہ ہو جاؤں یا میں لغزش کا شکار ہو جاؤں،یا میں کسی پر ظلم کروں یا مجھ پر کوئی ظلم کرے،یا میں کسی سے بدتمیزی کروں یا کوئی مجھ سے بدتمیزی سے پیش آئے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (5094) ترمذي (3427) نسائي (5488)`;
ibnemaja.anwaar = [515,1];