var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،عَنْ عَبْدِ اللَّهِ بْنِ حُسَيْنِ بْنِ عَطَاءِ بْنِ يَسَارٍ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ قَالَ: «بِسْمِ اللَّهِ،لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ،التُّكْلَانُ عَلَى اللَّهِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ جب گھر سے باہر تشریف لے جاتے تو فرماتے: (بسم اللہ لا حول ولا قوۃ الا باللہ التکلان علی اللہ) (میں اس گھر سے) اللہ کے نام کے ساتھ (نکل رہا ہوں)،اللہ کی توفیق کے بغیر نہ برائی سے بچاؤ ممکن ہے نہ نیکی کی طاقت۔اللہ ہی پر بھروسہ ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبداﷲ بن حسین بن عطاء: ضعیف (تقریب: 3275) وضعفہ جمھور الأئمۃ (مجمع الزوائد 243/4) <br>وللحدیث شواہد ضعیفۃ`;
ibnemaja.anwaar = [515,1];