var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبِ بْنِ أَبِي الْعِشْرِينَ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ: أَخْبَرَنِي نَافِعٌ،أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ،أَخْبَرَهُ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَأَى الْمَطَرَ قَالَ: «اللَّهُمَّ اجْعَلْهُ صَيِّبًا هَنِيئًا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ جب بارش دیکھتے تو فرماتے: (اللہم! اجعلہ صیبا ہنیئا) یا اللہ! اس بارش کو نفع بخش خوشگوار بنا دے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;