var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ قَالَ: حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الْحَسَنَةُ مِنَ الرَّجُلِ الصَّالِحِ،جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ»";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: نیک آدمی کا اچھا خواب نبوت کا چھیالیسواں حصہ ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;