var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَأَبُو كُرَيْبٍ،قَالَا: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ: أَنْبَأَنَا شَيْبَانُ،عَنْ فِرَاسٍ،عَنْ عَطِيَّةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «رُؤْيَا الرَّجُلِ الْمُسْلِمِ الصَّالِحِ،جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ»";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: مسلمان نیک آدمی کا خواب نبوت کے ستر حصوں میں سے ایک حصہ ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;