var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ،عَنْ أَبِيهِ،عَنْ سِبَاعِ بْنِ ثَابِتٍ،عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ،قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «ذَهَبَتِ النُّبُوَّةُ،وَبَقِيَتِ الْمُبَشِّرَاتُ»";
ibnemaja.urdu = "حضرت ام کُرز کعبیہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: نبوت ختم ہو گئی اور خوشخبری دینے والی چیزیں رہ گئیں،یعنی سچے خواب باقی ہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;