var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ،جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اچھا خواب نبوت کا سترواں حصہ ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;