var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ قَالَتْ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِيضَأَةٍ فَقَالَ اسْكُبِي فَسَكَبْتُ فَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ وَأَخَذَ مَاءً جَدِيدًا فَمَسَحَ بِهِ رَأْسَهُ مُقَدَّمَهُ وَمُؤَخَّرَهُ وَغَسَلَ قَدَمَيْهِ ثَلَاثًا ثَلَاثًا";
ibnemaja.urdu = "سیدہ ربیع بنت معوذ رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: میں وضو کا برتن لے کر نبی ﷺ کی خدمت میں حاضر ہوئی۔آپ نے فرمایا:’’پانی ڈالو۔‘‘میں نے پانی ڈالا تو آپ نے اپنا چہرہٴ مبارک اور دونوں بازو دھوئے۔پھر نیا پانی لیا اور اس کے ساتھ سر کے اگلے اور پچھلے حصے کا مسح کیا اور اپنے پاؤں کو تین تین بار دھویا";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (128،130)<br>ابن عقیل ضعیف`;
ibnemaja.anwaar = [392,1];