var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَنْ رَآنِي فِي الْمَنَامِ،فَقَدْ رَآنِي فِي الْيَقَظَةِ،فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ عَلَى صُورَتِي»";
ibnemaja.urdu = "حضرت عبد اللہ بن مسعود ؓ سے روایت ہے،نبیﷺ نے فرمایا: نے مجھے خواب میں دیکھا،اس نے (گویا) مجھے بیداری میں دیکھا کیونکہ شیطان میری صورت اختیار نہیں کر سکتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;