var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ،قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ،عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي،فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: جس نے خواب میں مجھے دیکھا،اس نے مجھے ہی دیکھا کیونکہ شیطان میر صورت اختیار نہیں کر سکتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;