var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ قَالَ: «مَنْ رَآنِي فِي الْمَنَامِ،فَقَدْ رَآنِي،إِنَّهُ لَا يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَمَثَّلَ فِي صُورَتِي»";
ibnemaja.urdu = "حضرت جابر ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: ’ جس نے خواب میں مجھے دیکھا،اس نے مجھے ہی دیکھا۔شیطان اس قابل نہیں کہ میری صورت اختیار کرے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;