var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَأَبُو كُرَيْبٍ،قَالَا: حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ: حَدَّثَنَا عِيسَى بْنُ الْمُخْتَارِ،عَنِ ابْنِ أَبِي لَيْلَى،عَنْ عَطِيَّةَ،عَنْ أَبِي سَعِيدٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَنْ رَآنِي فِي الْمَنَامِ،فَقَدْ رَآنِي،فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي»";
ibnemaja.urdu = "حضرت ابو سعید ؓ سے روایت ہے،نبیﷺ نے فرمایا: جس نے خواب میں مجھے دیکھا،اس نے مجھے ہی دیکھا کیونکہ شیطان میری صورت اختیار نہیں کر سکتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;