var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ: قَالَ أَبُو عَوَانَةَ حَدَّثَنَا،عَنْ جَابِرٍ،عَنْ عَمَّارٍ هُوَ الدُّهْنِيُّ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فِي الْمَنَامِ،فَقَدْ رَآنِي،فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس سے روایت ہے،رسول اللہﷺ نے فرمایا: جس نے مجھے خواب میں دیکھا،اس نے مجھے دیکھا کیونکہ شیطان میری صورت اختیار نہیں کر سکتا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;