var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: «إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا،فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلَاثًا،وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلَاثًا،وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ»";
ibnemaja.urdu = "حضرت جابر بن عبد اللہ ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: جب کسی کو ایسا خواب آئے جو اسے برا لگے تو اسے چاہیے کہ بائیں طرف تین بار تھوک دے،اور تین بار شیطان سے اللہ کی پناہ مانگے،اور جس پہلو پر لیٹا ہوا ہو،اسے بدل دے (دوسرے پہلو پر لیٹ کر سو جائے)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;