var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ آدَمَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي الْوَلِيدُ بْنُ عُقْبَةَ حَدَّثَنِي حُذَيْفَةُ بْنُ أَبِي حُذَيْفَةَ الْأَزْدِيُّ عَنْ صَفْوَانَ بْنِ عَسَّالٍ قَالَ صَبَبْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَاءَ فِي السَّفَرِ وَالْحَضَرِ فِي الْوُضُوءِ";
ibnemaja.urdu = "سیدنا صفوان بن عسال رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے سفر اور حضر میں نبیﷺ کو وضو کرانے کے لئے(آپ کے ہاتھوں اور پاؤں پر) پانی ڈالا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الولید بن عقبۃ: مجہول (تقریب: 7444) <br>وشیخہ حذیفۃ بن أبي حذیفۃ: مجہول الحال`;
ibnemaja.anwaar = [392,1];