var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنِ الْعُمَرِيِّ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَى أَحَدُكُمْ رُؤْيَا يَكْرَهُهَا،فَلْيَتَحَوَّلْ وَلْيَتْفُلْ عَنْ يَسَارِهِ ثَلَاثًا،وَلْيَسْأَلِ اللَّهَ مِنْ خَيْرِهَا،وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا»";
ibnemaja.urdu = "حضرت ابو ہریرہؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: جب کسی کو ایسا خواب آئے جو اسے برا لگے تو اسے چاہیے کہ کروٹ بدل لے اور بائیں طرف تین بار تھوک دے۔اور اللہ تعالیٰ سے اس خواب کی بہتری کا سوال کرے اور اس کے شر سے (اللہ کی) پناہ مانگے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;