var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِذَا حَلَمَ أَحَدُكُمْ،فَلَا يُخْبِرِ النَّاسَ بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي الْمَنَامِ»";
ibnemaja.urdu = "حضرت جابر ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: جب کسی کو (برا) خواب آئے تو تو اسے چاہیے کہ خواب میں اس سے ہونے والی شیطانی شرارتیں لوگوں کو نہ بتائے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;