var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا أَبِي قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ يَزِيدَ الرَّقَاشِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اعْتَبِرُوهَا بِأَسْمَائِهَا،وَكَنُّوهَا بِكُنَاهَا،وَالرُّؤْيَا لِأَوَّلِ عَابِرٍ»";
ibnemaja.urdu = "حضرت انس بن مالک سے روایت ہے،رسول اللہﷺ نے فرمایا: خوابوں کو ان (میں نظر آنے والی چیزوں) کے ناموں سے سمجھو،اور چیزوں کی کنیتوں سے ان کے کنایات (واشارات) سمجھو،اور خواب پہلے تعبیر کرنے والے کے لیے ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>یزید الرقاشي: ضعیف <br>والأعمش عنعن`;
ibnemaja.anwaar = [516,1];