var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَحَلَّمَ حُلُمًا كَاذِبًا،كُلِّفَ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ،وَيُعَذَّبُ عَلَى ذَلِكَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: جس نے جھوٹا خواب بیان کیا اسے جوکے دو دانوں کو ایک دوسرے سے گرہ لگانے کا حکم دیا جائے گا اور (وہ ایسا نہیں کر سکے گا،چنانچہ) اسے اس درجہ سے عذب دیا جائے گا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;