var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا كُرْدُوسُ بْنُ أَبِي عَبْدِ اللَّهِ الْوَاسِطِيُّ حَدَّثَنَا عَبْدُ الْكَرِيمِ بْنُ رَوْحٍ حَدَّثَنَا أَبِي رَوْحُ بْنُ عَنْبَسَةَ بْنِ سَعِيدِ بْنِ أَبِي عَيَّاشٍ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ عَنْ أَبِيهِ عَنْبَسَةَ بْنِ سَعِيدٍ عَنْ جَدَّتِهِ أُمِّ أَبِيهِ أُمِّ عَيَّاشٍ وَكَانَتْ أَمَةً لِرُقَيَّةَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كُنْتُ أُوَضِّئُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا قَائِمَةٌ وَهُوَ قَاعِدٌ";
ibnemaja.urdu = "رسول اللہ ﷺ کی صاحب زادی سیدہ رقیہ رضی اللہ عنہا کی لونڈی ام عیاش رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو وضو کرایا کرتی تھی۔میں کھڑی ہوتی تھی اور آپ بیٹھے ہوتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عبدالکریم بن روح: ضعیف (تقریب: 4150) و أبوہ روح بن عنبسۃ: مجہول (تقریب: 1964) وقال البوصیري: ’’ھذا إسناد مجہول ‘‘`;
ibnemaja.anwaar = [392,1];