var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: رَأَيْتُ فِي يَدِي سِوَارَيْنِ مِنْ ذَهَبٍ،فَنَفَخْتُهُمَا،فَأَوَّلْتُهُمَا هَذَيْنِ الْكَذَّابَيْنِ: مُسَيْلِمَةَ،وَالْعَنْسِيَّ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: میں نے اپنے ہاتھوں میں سونے کے دو کنگن دیکھے۔میں نے ان پر پھونک ماری (تو وہ غائب ہو گئے) میں نے اس کی تعبیر کی کہ ان سے مراد یہ دو دو کذاب ہیں: مسیلمہ اور عنسی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;