var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ الْهُذَلِيُّ،عَنِ ابْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَكْرَهُ الْغِلَّ،وَأُحِبُّ الْقَيْدَ،الْقَيْدُ ثَبَاتٌ فِي الدِّينِ»";
ibnemaja.urdu = "حضرت ابو ہریرہؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: میں طوق کو ناپسند کرتا ہوں اور (پاؤں کی) بیڑی کو پسند کرتا ہوں۔بیڑی دین میں ثابت قدمی کی علامت ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>أبو بکر الہذلي: متروک الحدیث <br>وتابعہ قتادۃ مع عنعنتہ <br>و لکن السند إلیہ ضعیف والصواب أنہ من قول أبي ہریرۃ رضي اللّٰہ عنہ<br>انظر صحیح البخاري (7017) ومسلم (2263) وغیرھما والمدرج إلی المدرج للسیوطي (ص 36 ح 40)`;
ibnemaja.anwaar = [516,1];