var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الْوَهَّابِ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ،وَيُونُسُ بْنُ يَحْيَى،جَمِيعًا عَنْ دَاوُدَ بْنِ قَيْسٍ،عَنْ أَبِي سَعِيدٍ،مَوْلَى عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ كُرَيْزٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ،دَمُهُ،وَمَالُهُ،وَعِرْضُهُ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ہر مسلمان دوسرے کے لیے قابل احترام ہے،یعنی اس کی جان،اس کا مال اور اس کی آبرو۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;