var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،عَنْ أَبِي هَانِئٍ،عَنْ عَمْرِو بْنِ مَالِكٍ الْجَنْبِيِّ،أَنَّ فَضَالَةَ بْنَ عُبَيْدٍ حَدَّثَهُ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «الْمُؤْمِنُ مَنْ أَمِنَهُ النَّاسُ عَلَى أَمْوَالِهِمْ وَأَنْفُسِهِمْ،وَالْمُهَاجِرُ مَنْ هَجَرَ الْخَطَايَا وَالذُّنُوبَ»";
ibnemaja.urdu = "حضرت فضالہ بن عبید رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: مومن وہ ہے جس سے لوگوں کو اپنے مالوں اور اپنی جانوں کے بارے میں خطرہ نہ ہو،اور مہاجر وہ ہے جو غلطیاں اور گناہ ترک کر دے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;