var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَمُحَمَّدُ بْنُ الْمُثَنَّى،قَالَا: حَدَّثَنَا أَبُو عَاصِمٍ قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ انْتَهَبَ نُهْبَةً مَشْهُورَةً،فَلَيْسَ مِنَّا»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جس نے سر عام (کسی کا مال وغیرہ) چھینا،وہ ہم میں سے نہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;