var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ سِمَاكٍ،عَنْ ثَعْلَبَةَ بْنِ الْحَكَمِ،قَالَ: أَصَبْنَا غَنَمًا لِلْعَدُوِّ فَانْتَهَبْنَاهَا،فَنَصَبْنَا قُدُورَنَا،فَمَرَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْقُدُورِ،فَأَمَرَ بِهَا فَأُكْفِئَتْ،ثُمَّ قَالَ: «إِنَّ النُّهْبَةَ لَا تَحِلُّ»";
ibnemaja.urdu = "حضرت ثعلبہ بن حَکم رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: دشمن کی کچھ بکریاں ہمارے ساتھ لگیں،وہ ہم نے لوٹ لیں اور ہانڈیاں چڑھا دیں۔نبی ﷺ ہانڈیوں کے پاس سے گزرے تو انہیں اُلٹ دینے کا حکم دیا،چنانچہ وہ الٹا دی گئیں۔پھر آپ نے فرمایا: لُوٹ حلال نہیں۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;