var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ وَجَابِرُ بْنُ إِسْمَعِيلَ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلَا يُدْخِلْ يَدَهُ فِي الْإِنَاءِ حَتَّى يَغْسِلَهَا";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جب تم میں سے کوئی شخص نیند سے بیدار ہو تو برتن میں ہاتھ نہ ڈالے حتی کہ ہاتھ دھولے";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;