var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،وَعْبَدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،قَالَا: حَدَّثَنَا شُعْبَةُ،عَنْ عَلِيِّ بْنِ مُدْرِكٍ،قَالَ: سَمِعْتُ أَبَا زُرْعَةَ بْنَ عَمْرِو بْنِ جَرِيرٍ،يُحَدِّثُ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ فِي حَجَّةِ الْوَدَاعِ: «اسْتَنْصِتِ النَّاسَ»،فَقَالَ: «لَا تَرْجِعُوا بَعْدِي كُفَّارًا،يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ»";
ibnemaja.urdu = "حضرت جریر بن عبداللہ رضی اللہ عنہ سے روایت ہے،حجۃ الوداع کے موقع پر رسول اللہ ﷺ نے فرمایا: لوگوں کو خاموش کراؤ۔(جب لوگ خاموش ہو گئے) تو آپ نے فرمایا: میرے بعد دوبارہ کافر نہ بن جانا کہ ایک دوسرے کے گلے کاٹنے لگ جاؤ۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;