var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: أَخْبَرَنِي عُمَرُ بْنُ مُحَمَّدٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «وَيْحَكُمْ،أَوْ وَيْلَكُمْ،لَا تَرْجِعُوا بَعْدِي كُفَّارًا،يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: تمہارا بھلا ہو! میرے بعد دوبارہ کافر نہ بن جانا کہ ایک دوسرے کے گلے کاٹنے لگو۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;