var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا أَبِي،وَمُحَمَّدُ بْنُ بِشْرٍ،قَالَا: حَدَّثَنَا إِسْمَاعِيلُ،عَنْ قَيْسٍ،عَنِ الصُّنَابِحِ الْأَحْمَسِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ،وَإِنِّي مُكَاثِرٌ بِكُمُ الْأُمَمَ فَلَا تَقْتَتِلُنَّ بَعْدِي»";
ibnemaja.urdu = "حضرت صُنابع بن اعسر احمسی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سنو! دوسری امتوں کے مقابلے میں تمہاری کثرت پر فخڑ کروں گا،لہذا میرے (فوت ہونے کے) بعد آپس میں لڑائی نہ کرنا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;