var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا أَيُّوبُ،عَنْ غَيْلَانَ بْنِ جَرِيرٍ،عَنْ زِيَادِ بْنِ رِيَاحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَاتَلَ تَحْتَ رَايَةٍ عِمِّيَّةٍ،يَدْعُو إِلَى عَصَبِيَّةٍ،أَوْ يَغْضَبُ لِعَصَبِيَّةٍ،فَقِتْلَتُهُ جَاهِلِيَّةٌ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص گمراہی کے جھنڈے تلے جنگ کرتا ہے،(لوگوں کو) عصبیت کی دعوت دیتا ہے یا عصبیت کی بنیاد پر غصے میں آتا ہے تو اس کا قتل ہو جانا جاہلیت کی طرح ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;