var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ الْيَحْمِدِيُّ،عَنْ عَبَّادِ بْنِ كَثِيرٍ الشَّامِيِّ،عَنِ امْرَأَةٍ مِنْهُمْ يُقَالُ لَهَا فُسَيْلَةُ،قَالَتْ: سَمِعْتُ أَبِي يَقُولُ،سَأَلْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقُلْتُ: يَا رَسُولَ اللَّهِ أَمِنَ الْعَصَبِيَّةِ أَنْ يُحِبَّ الرَّجُلُ قَوْمَهُ؟ قَالَ: «لَا،وَلَكِنْ مِنَ الْعَصَبِيَّةِ أَنْ يُعِينَ الرَّجُلُ قَوْمَهُ عَلَى الظُّلْمِ»";
ibnemaja.urdu = "حضرت فَسِیلہ رضی اللہ عنہا اپنے والد (واثلہ بن اسقع رضی اللہ عنہ) سے روایت کرتی ہیں،انہوں نے فرمایا: میں نے نبی ﷺ سے سوال کیا: اے اللہ کے رسول! کیا یہ بھی عصبیت ہے کہ آدمی اپنی قوم سے محبت رکھے؟ رسول اللہ ﷺ نے فرمایا: نہیں،عصبیت تو یہ ہے کہ آدمی ظلم میں اپنی قوم کی مدد کرے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>عباد بن کثیر: متروک <br>وللحدیث طریق ضعیف عند أبي داود (5119)`;
ibnemaja.anwaar = [517,1];