var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ تَوْبَةَ حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ الْبَكَّائِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ مِنْ النَّوْمِ فَأَرَادَ أَنْ يَتَوَضَّأَ فَلَا يُدْخِلْ يَدَهُ فِي وَضُوئِهِ حَتَّى يَغْسِلَهَا فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ وَلَا عَلَى مَا وَضَعَهَا";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جب کوئی نیند سے بیدار ہو کر وضو کرنا چاہے تو وضو کے پانی میں ہاتھ نہ ڈالے جب تک اسے دھو نہ لے کیوں کہ اسے معلوم نہیں کہ رات کو اس کا ہاتھ کہاں رہا ہے اور نہ یہ معلوم ہے کہ اس نے کس چیز پر ہاتھ رکھا ہے۔‘‘\nابو اسحاق نے کہا‘صحیح سند جابر عن ابی ہریرہ ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>أبو الزبیر عنعن <br>و حدیث البخاري (1621) و مسلم (278) یغني عنہ`;
ibnemaja.anwaar = [392,1];