var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا مُعَانُ بْنُ رِفَاعَةَ السَّلَامِيُّ قَالَ: حَدَّثَنِي أَبُو خَلَفٍ الْأَعْمَى،قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «إِنَّ أُمَّتِي لَا تَجْتَمِعُ عَلَى ضَلَالَةٍ،فَإِذَا رَأَيْتُمُ اخْتِلَافًا فَعَلَيْكُمْ بِالسَّوَادِ الْأَعْظَمِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: میری امت گمراہی پر جمع نہیں ہو گی،لہذا جب اختلاف نظر آئے تو بڑی جماعت کا ساتھ دو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>معان بن رفاعۃ: لین الحدیث <br>وأبو خلف حازم بن عطاء: متروک ورماہ ابن معین بالکذب (تقریب: 8083) <br>وللحدیث شاہد ضعیف عند أبي نعیم الأصبھاني في أخبار أصفہان (208/2) والسند ضعفہ البوصیري<br>و لحجیۃ الإجماع انظر سنن الترمذي بتحقیقي (الأصل: 2166) والحمد للّٰہ`;
ibnemaja.anwaar = [517,1];