var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنِ الْوَلِيدِ بْنِ سُلَيْمَانَ بْنِ أَبِي السَّائِبِ،عَنْ عَلِيِّ بْنِ يَزِيدَ،عَنِ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ،عَنْ أَبِي أُمَامَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَتَكُونُ فِتَنٌ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا،إِلَّا مَنْ أَحْيَاهُ اللَّهُ بِالْعِلْمِ»";
ibnemaja.urdu = "حضرت ابو امامہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: (مستقبل میں) ایسے فتنے برپا ہوں گے جن میں آدمی صبح کو مومن ہو گا تو شام کو کافر ہو جائے گا (اور شام کو مومن ہو گا تو صبح کو کافر ہو جائے گا۔) مگر جسے اللہ علم کے ذریعے سے زندہ رکھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>علي بن یزید: ضعیف <br>وأصل الحدیث صحیح بالشواہد دون قولہ: ’’ إلا من أحیاہ اﷲ بالعلم‘‘`;
ibnemaja.anwaar = [517,2];