var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ قَالَ دَعَا عَلِيٌّ بِمَاءٍ فَغَسَلَ يَدَيْهِ قَبْلَ أَنْ يُدْخِلَهُمَا الْإِنَاءَ ثُمَّ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ";
ibnemaja.urdu = "سیدنا حارث سے روایت ہے کہ سیدنا علی رضی اللہ عنہ نے پانی منگوایا،پھر پانی میں ہاتھ ڈالنے سے پہلے ہاتھ دھوئے،پھر فرمایا: میں نے رسول اللہ ﷺ کو اسی طرح کرتے دیکھا ہے";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;