var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا مُبَارَكُ بْنُ سُحَيْمٍ،عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَا مِنْ مُسْلِمَيْنِ الْتَقَيَا بِأَسْيَافِهِمَا،إِلَّا كَانَ الْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جب دو مسلمان اپنی تلواریں لے کر ایک دوسرے کے مقابل ہوتے ہیں تو قاتل اور مقتول (دونوں) جہنم میں جاتے ہیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;