var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ رِبْعِيِّ بْنِ حِرَاشٍ،عَنْ أَبِي بَكْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِذَا الْمُسْلِمَانِ حَمَلَ أَحَدُهُمَا عَلَى أَخِيهِ السِّلَاحَ،فَهُمَا عَلَى جُرُفِ جَهَنَّمَ،فَإِذَا قَتَلَ أَحَدُهُمَا صَاحِبَهُ،دَخَلَا جَمِيعًا»";
ibnemaja.urdu = "حضرت ابوبکرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: جب دو مسلمانوں میں سے ایک اپنے بھائی پر ہتھیار اٹھاتا ہے تو وہ دونوں جہنم کے کنارے پر ہوتے ہیں۔جب ان میں سے ایک اپنے ساتھی کو قتل کر دیتا ہے تو دونوں جہنم میں داخل ہو جاتے ہیں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;