var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ،عَنْ عَبْدِ الْحَكَمِ السَّدُوسِيِّ قَالَ: حَدَّثَنَا شَهْرُ بْنُ حَوْشَبٍ،عَنْ أَبِي أُمَامَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مِنْ شَرِّ النَّاسِ مَنْزِلَةً عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ،عَبْدٌ أَذْهَبَ آخِرَتَهُ بِدُنْيَاهُ»";
ibnemaja.urdu = "حضرت ابو امامہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قیامت کے دن اللہ کے ہاں سب سے برے درجے والا شخص وہ ہو گا جس نے (دوسرے کی) دنیا کے لیے اپنی آخرت ضائع کر لی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبدالحکیم السدوسي: مقبول (تقریب: 3748) أ ي مجہول الحال،لم یوثقہ غیر ابن حبان وروی عنہ جماعۃ`;
ibnemaja.anwaar = [518,1];