var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ لَيْثٍ،عَنْ طَاوُسٍ،عَنْ زِيَادِ سَيْمِينْ كُوشْ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَكُونُ فِتْنَةٌ تَسْتَنْظِفُ الْعَرَبَ قَتْلَاهَا فِي النَّارِ،اللِّسَانُ فِيهَا أَشَدُّ مِنْ وَقْعِ السَّيْفِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: عنقریب ایک ایسا فتنہ برپا ہو گا جو عربوں کا صفایا کر دے گا۔اس کے مقتول جہنم میں جائیں گے۔اس فتنے میں زبان تلوار کے وار سے زیادہم سخت (اور تکلیف دہ) محسوس ہو گی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4265) ترمذي (2178)`;
ibnemaja.anwaar = [518,1];