var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ،عَنْ أَبِيهِ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِيَّاكُمْ وَالْفِتَنَ،فَإِنَّ اللِّسَانَ فِيهَا مِثْلُ وَقْعِ السَّيْفِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: فتنوں سے بچو،ان میں زبان (کی بات) تلوار کے وار کی طرح (اثر انداز) ہوتی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br> محمد بن الحارث و ابن البیلماني: ضعیفان <br>وللحدیث لون آخر عند أبي داود (4264)`;
ibnemaja.anwaar = [518,1];