var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو يُوسُفَ بْنُ الصَّيْدَلَانِيُّ مُحَمَّدُ بْنُ أَحْمَدَ الرَّقِّيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،عَنِ ابْنِ إِسْحَاقَ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سُخْطِ اللَّهِ،لَا يَرَى بِهَا بَأْسًا،فَيَهْوِي بِهَا فِي نَارِ جَهَنَّمَ سَبْعِينَ خَرِيفًا»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: آدمی (بعض اوقات) اللہ کی ناراضی والا ایک لفظ کہہ دیتا ہے،وہ اس میں حرج نہیں سمجھتا۔(لیکن وہ اتنا بڑا گناہ کا لفظ ہوتا ہے کہ) وہ اس کی وجہ سے ستر سال تک جہنم میں گر جاتا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;