var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ قَالَ: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ أَبِي حَصِينٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ،فَلْيَقُلْ خَيْرًا أَوْ لِيَسْكُتْ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جو شخص اللہ پر اور قیامت کے دن پر ایمان رکھتا ہے،اسے چاہیے کہ اچھی بات کہے یا خاموش رہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;