var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ خُنَيْسٍ الْمَكِّيُّ،قَالَ: سَمِعْتُ سَعِيدَ بْنَ حَسَّانَ الْمَخْزُومِيَّ،قَالَ: حَدَّثَتْنِي أُمُّ صَالِحٍ،عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ،عَنْ أُمِّ حَبِيبَةَ،زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «كَلَامُ ابْنِ آدَمَ عَلَيْهِ لَا لَهُ،إِلَّا الْأَمْرَ بِالْمَعْرُوفِ،وَالنَّهْيَ عَنِ الْمُنْكَرِ،وَذِكْرَ اللَّهِ عَزَّ وَجَلَّ»";
ibnemaja.urdu = "ام المومنین ام حبیبہ (بنت ابو سفیان) رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: آدم کے بیٹے کا ہر کلام اس کے خلاف ہے،اس کے حق میں نہیں،سوائے نیکی کا حکم دینے،برائی سے منع کرنے اور اللہ عزوجل کا ذکر کرنے کے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2412)`;
ibnemaja.anwaar = [518,1];