var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا خَالِي يَعْلَى،عَنِ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ أَبِي الشَّعْثَاءِ،قَالَ: قِيلَ لِابْنِ عُمَرَ: إِنَّا نَدْخُلُ عَلَى أُمَرَائِنَا فَنَقُولُ الْقَوْلَ: فَإِذَا خَرَجْنَا قُلْنَا غَيْرَهُ،قَالَ: «كُنَّا نَعُدُّ ذَلِكَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،النِّفَاقَ»";
ibnemaja.urdu = "حضرت ابو شعثاءرحمۃ اللہ علیہ سے روایت ہے،کسی نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے کہا: ہم امراء (حکمرانوں) کے پاس جاتے ہیں تو ایک بات کہتے ہیں،پھر جب ہم باہر آتے ہیں تو دوسری بات کہتے ہیں۔حضرت ابن عمر رضی اللہ عنہ نے فرمایا: اس چیز کو ہم رسول اللہ ﷺ کے زمانے میں منافقت شمار کرتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;