var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا يَزِيدُ بْنُ عِيَاضٍ حَدَّثَنَا أَبُو ثِفَالٍ عَنْ رَبَاحِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سُفْيَانَ أَنَّهُ سَمِعَ جَدَّتَهُ بِنْتَ سَعِيدِ بْنِ زَيْدٍ تَذْكُرُ أَنَّهَا سَمِعَتْ أَبَاهَا سَعِيدَ بْنَ زَيْدٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ";
ibnemaja.urdu = "سیدنا سعید بن زید رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:’’اس شخص کی نماز نہیں جس کا وضو نہیں اور اس کا وضو نہیں جس نے اس میں اللہ کا نام نہ لیا ہو";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;