var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ الْمُقَدِّمِيُّ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ قَالَ: حَدَّثَنَا أَبُو عَامِرٍ الْخَزَّازُ،عَنْ حُمَيْدِ بْنِ هِلَالٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ قُرْطٍ،عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَكُونُ فِتَنٌ عَلَى أَبْوَابِهَا دُعَاةٌ إِلَى النَّارِ،فَأَنْ تَمُوتَ وَأَنْتَ عَاضٌّ عَلَى جِذْلِ شَجَرَةٍ،خَيْرٌ لَكَ مِنْ أَنْ تَتْبَعَ أَحَدًا مِنْهُمْ»";
ibnemaja.urdu = "حضرت حذیفہ بن یمان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: فتنے پیدا ہوں گے ان کے دروازوں پر جہنم کی طرف بلانے والے ہوں گے۔ان میں سے کسی کے پیچھے لگنے سے بہتر ہے کہ تو کسی درخت کی جڑ چباتا ہوا مر جائے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;