var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ الْمِصْرِيُّ قَالَ: حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ قَالَ: حَدَّثَنِي عُقَيْلٌ،عَنِ ابْنِ شِهَابٍ قَالَ: أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ،أَنَّ أَبَا هُرَيْرَةَ،أَخْبَرَهُ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ مَرَّتَيْنِ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مومن ایک سوراخ سے دو بار نہیں ڈسا جاتا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;