var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،قَالَ: حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ،قَالَ: حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ مَرَّتَيْنِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:مومن ایک سوراخ سے دو بار نہیں ڈسا جاتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;