var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ: حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ،عَنِ الْمُعَلَّى بْنِ زِيَادٍ،عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ،عَنْ مَعْقِلِ بْنِ يَسَارٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْعِبَادَةُ فِي الْهَرْجِ،كَهِجْرَةٍ إِلَيَّ»";
ibnemaja.urdu = "حضرت معقل بن یسار رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قتل و غارت (اور فتنوں کے ایام) کے دوران میں عبادت کرنا ایسے ہے جیسے میری طرف ہجرت کرنا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;