var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ،وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ،وَسُوَيْدُ بْنُ سَعِيدٍ،قَالُوا: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بَدَأَ الْإِسْلَامُ غَرِيبًا،وَسَيَعُودُ غَرِيبًا،فَطُوبَى لِلْغُرَبَاءِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اسلام شروع میں اجنبی تھا،اور وہ دوبارہ اجنبی ہو جائے گا،اس لیے اجنبیوں کو مبارک ہو۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;