var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ،وَابْنُ لَهِيعَةَ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ سِنَانِ بْنِ سَعْدٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِنَّ الْإِسْلَامَ بَدَأَ غَرِيبًا،وَسَيَعُودُ غَرِيبًا،فَطُوبَى لِلْغُرَبَاءِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اسلام شروع میں اجنبی تھا،اور وہ دوبارہ اجنبی ہو جائے گا،اس لیے اجنبیوں کو مبارک ہو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;