var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنِ الْأَعْمَشِ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْإِسْلَامَ بَدَأَ غَرِيبًا،وَسَيَعُودُ غَرِيبًا،فَطُوبَى لِلْغُرَبَاءِ»،قَالَ: قِيلَ: وَمَنِ الْغُرَبَاءُ؟ قَالَ: «النُّزَّاعُ مِنَ الْقَبَائِلِ»";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اسلام اجنبی کے طور پر شروع ہوا،اور وہ دوبارہ اجنبی ہو جائے گا۔تو اجنبیوں کو مبارک ک ہو۔عرج کیا گیا: اجنبی (غرباء) کون ہیں؟ آپ نے فرمایا: قبائل سے الگ ہونے والے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سفیان بن وکیع ضعیف <br>حفص بن غیاث و سلیمان الأعمش و أبو إسحاق مدلسون و لم أجد تصریح سماعھم<br> والحدیث السابق (الأصل: 3986) یغني عنہ`;
ibnemaja.anwaar = [518,1];