var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى بْنِ أَبِي عَبْدِ اللَّهِ عَنْ يَعْقُوبَ بْنِ سَلَمَةَ اللَّيْثِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’اس شخص کی نماز نہیں جس کا وضو نہیں اور اس کا وضو نہیں جس نے(وضو کرتے وقت) اللہ کا نام نہ لیاہو";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;