var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ قَالَ: حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «النَّاسُ كَإِبِلٍ مِائَةٍ،لَا تَكَادُ تَجِدُ فِيهَا رَاحِلَةً»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: لوگوں کی مثال ان سو اونٹوں کی سی ہے جن میں ایک بھی سواری کے قابل نہ ملے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;