var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا أَبُو عَمْرٍو قَالَ: حَدَّثَنَا قَتَادَةُ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ بَنِي إِسْرَائِيلَ افْتَرَقَتْ عَلَى إِحْدَى وَسَبْعِينَ فِرْقَةً،وَإِنَّ أُمَّتِي سَتَفْتَرِقُ عَلَى ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً،كُلُّهَا فِي النَّارِ،إِلَّا وَاحِدَةً وَهِيَ: الْجَمَاعَةُ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: بنی اسرائیل اکہتر (71) فرقوں میں تقسیم ہوئے اور میری امت بہتر (72) فرقوں میں تقسیم ہو جائے گی۔ایک کے سوا وہ سب فرقے جہنم میں جائیں گے،اور وہ جماعت ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;