var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،ح وَحَدَّثَنَا عَمْرُو بْنُ رَافِعٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ،عَنْ أُسَامَةَ بْنِ زَيْدٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا أَدَعُ بَعْدِي فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ،مِنَ النِّسَاءِ»";
ibnemaja.urdu = "حضرت اسامہ بن زید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: میں اپنے بعد مردوں کے لیے عورتوں سے بڑا کوئی فتنہ نہیں چھوڑتا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;