var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ خَارِجَةَ بْنِ مُصْعَبٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ أَبِي سَعِيدٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَا مِنْ صَبَاحٍ إِلَّا وَمَلَكَانِ يُنَادِيَانِ: وَيْلٌ لِلرِّجَالِ مِنَ النِّسَاءِ،وَوَيْلٌ لِلنِّسَاءِ مِنَ الرِّجَالِ";
ibnemaja.urdu = "حضرت ابو سعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ہر صبح دو فرشتے اعلان کرتے ہیں: مردوں کے لیے عورتوں کی وجہ سے ہلاکت ہے۔اور عورتوں کے لیے مردوں کی وجہ سے ہلاکت ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>خارجۃ: متروک وکان یدلس عن الکذابین (ترمذي: 57)`;
ibnemaja.anwaar = [518,1];