var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ عَنْ ابْنِ الْمُبَارَكِ عَنْ مُحَمَّدِ بْنِ سُوقَةَ عَنْ أَبِي جَعْفَرٍ قَالَ كَانَ ابْنُ عُمَرَ إِذَا سَمِعَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا لَمْ يَعْدُهُ وَلَمْ يُقَصِّرْ دُونَهُ";
ibnemaja.urdu = "حضرت ابو جعفر محمد باقر رحمہ اللہ سے روایت ہے،انہوں نے کہا: حضرت عبداللہ بن عمر رضی اللہ عنہما جب رسول اللہ ﷺ سے کوئی حدیث سنتے،تو نہ اس میں اضافہ کرتے اور نہ کمی کرتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;