var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،عَنْ هِشَامِ بْنِ سَعْدٍ،عَنْ عَمْرِو بْنِ عُثْمَانَ،عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ عُثْمَانَ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «مُرُوا بِالْمَعْرُوفِ،وَانْهَوْا عَنِ الْمُنْكَرِ،قَبْلَ أَنْ تَدْعُوا فَلَا يُسْتَجَابَ لَكُمْ»";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہﷺ نے فرمایا: نیکی کا حکم دو اور برائی سے منع کرو،قبل اس کے کہ تم دعائیں مانگو اور تمہاری دعائیں قبول نہ کی جائیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عاصم بن عمر بن عثمان: مجھول (تقریب: 3070) <br>و للحدیث شواھد ضعیفۃ عند الطبراني (الأوسط: 1389) والخطیب (تاریخ بغداد 13/ 92) وغیرہما`;
ibnemaja.anwaar = [519,1];