var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاقَ،عَنْ عُبَيْدِ اللَّهِ بْنِ جَرِيرٍ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ قَوْمٍ يُعْمَلُ فِيهِمْ بِالْمَعَاصِي،هُمْ أَعَزُّ مِنْهُمْ وَأَمْنَعُ،لَا يُغَيِّرُونَ،إِلَّا عَمَّهُمُ اللَّهُ بِعِقَابٍ»";
ibnemaja.urdu = "حضرت جریر بن عبد اللہ بجلی رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: جن لوگوں میں اللہ کی نافرمانی کی جائے جب کہ وہ (گناہ کرنے والوں سے) زیادہ طاقتوراور زیادہ زور آور ہوں،اس کے باوجود (مجرموں کو گناہ سے) منع نہ کریں تو اللہ تعالیٰ ان سب پر عذاب نازل کر دیتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (4339)`;
ibnemaja.anwaar = [519,1];