var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُصْعَبٍ،ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،قَالَا: حَدَّثَنَا إِسْرَائِيلُ قَالَ: أَنْبَأَنَا مُحَمَّدُ بْنُ جُحَادَةَ،عَنْ عَطِيَّةَ الْعَوْفِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الْجِهَادِ كَلِمَةُ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ»";
ibnemaja.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: سب سے افضل جہاد ظالم سلطان کے سامنے انصاف (اور حق) کی بات کہنا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;