var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ عَلِيِّ بْنِ زَيْدٍ،عَنِ الْحَسَنِ،عَنْ جُنْدُبٍ،عَنْ حُذَيْفَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْبَغِي لِلْمُؤْمِنِ أَنْ يُذِلَّ نَفْسَهُ»،قَالُوا: وَكَيْفَ يُذِلُّ نَفْسَهُ؟ قَالَ: «يَتَعَرَّضُ مِنَ الْبَلَاءِ لِمَا لَا يُطِيقُهُ»";
ibnemaja.urdu = "حضرت حذیفہ رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: مومن کے لیے مناسب نہیں کہ اپنے آپ کو ذلیل کرے۔صحابہ نے عرض کیا: اپنے آپ کو کیسے ذلیل کرسکتا ہے؟ آپ نے فرمایا: ایسی آزمائش میں نہ پڑے جس میں پورا اترنے کی طاقت نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2254)`;
ibnemaja.anwaar = [519,1];