var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو جَعْفَرٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتُمْ فَابْدَءُوا بِمَيَامِنِكُمْ قَالَ أَبُو الْحَسَنِ بْنُ سَلَمَةَ حَدَّثَنَا أَبُو حَاتِمٍ حَدَّثَنَا ابْنُ صَالِحٍ وَابْنُ نُفَيْلٍ وَغَيْرُهُمَا قَالُوا حَدَّثَنَا زُهَيْرٌ فَذَكَرَ نَحْوَهُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب تم وضو کرو تو دائیں طرف سے شروع کرو\n(امام ابن ماجہ رحمہ اللہ کے شاگرد)ابو الحسن بن سلمۃ نے زہیر کے دو شاگردوں یحیٰ بن صالح اور ابن نفیل سے اسی طرح روایت بیان کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (4141)`;
ibnemaja.anwaar = [392,1];