var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدٍ،عَنْ لَيْثٍ،عَنِ الْمِنْهَالِ،عَنْ زَاذَانَ،عَنِ الْبَرَاءِ بْنِ عَازِبٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ تَعَالَى: يَلْعَنُهُمُ اللَّهُ وَيَلْعَنُهُمُ اللَّاعِنُونَ [البقرة: 159]،قَالَ: «دَوَابُّ الْأَرْضِ»";
ibnemaja.urdu = "حضرت براء بن عازب رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے (اللہ تعالیٰ کے قول): (یَلْعَنُہُمُ اللہُ وَ یَلْعَنُہُمُ اللّٰعِنُوْنَۙ) ان پر اللہ تعالیٰ لعنت کرتا ہے اور ان پر لعنت بھیجنے والے لعنت بھیجتے ہیں۔(کی بابت) فرمایا: (لعنت بھیجنے والوں سے مراد) زمین کے چوپائے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>لیث بن أبي سلیم ضعیف`;
ibnemaja.anwaar = [519,1];