var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْجَعْدِ،عَنْ ثَوْبَانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزِيدُ فِي الْعُمْرِ إِلَّا الْبِرُّ،وَلَا يَرُدُّ الْقَدَرَ إِلَّا الدُّعَاءُ،وَإِنَّ الرَّجُلَ لَيُحْرَمُ الرِّزْقَ بِالذَّنْبِ يُصِيبُهُ»";
ibnemaja.urdu = "حضرت ثوبان رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: صرف نیکی عمر میں اضافہ کرتی ہے۔اور صرف دعا ہی تقدیر کو پلٹتی ہے۔اور انسان (بعض اوقات) ایک گناہ کرتا ہے اور اس کی وجہ سے رزق سے محروم ہو جاتا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `<br>ضعیف <br>انظر الحدیث السابق (90)`;
ibnemaja.anwaar = [519,1];