var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ شَقِيقٍ،عَنْ عَبْدِ اللَّهِ،قَالَ: كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَهُوَ يَحْكِي نَبِيًّا مِنَ الْأَنْبِيَاءِ،ضَرَبَهُ قَوْمُهُ،وَهُوَ يَمْسَحُ الدَّمَ عَنْ وَجْهِهِ،وَيَقُولُ: «رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لَا يَعْلَمُونَ»";
ibnemaja.urdu = "حضرت عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: گویا میں رسول اللہﷺ کو دیکھ رہا ہوں کہ آپ کسی نبی کی حالت بیان فرمارہے ہیں: اسے اس کی قوم نے مارا،وہ اپنے چہرے سے خون صاف کرتے تھے اور کہتے تھے: میرے رب! میری قوم کو معاف کردے،وہ جانتے نہیں۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;