var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ سَعْدِ بْنِ سِنَانٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: «عِظَمُ الْجَزَاءِ مَعَ عِظَمِ الْبَلَاءِ،وَإِنَّ اللَّهَ إِذَا أَحَبَّ قَوْمًا ابْتَلَاهُمْ،فَمَنْ رَضِيَ فَلَهُ الرِّضَا،وَمَنْ سَخِطَ فَلَهُ السُّخْطُ»";
ibnemaja.urdu = "حضرت انس بن مالک سے روایت ہے،رسول اللہﷺ نے فرمایا: زیادہ ثواب بڑی آزمائش کا ہوتا ہے۔اللہ تعالیٰ جب کسی قوم سے محبت کرتا ہے تو ان پر آزمائش ڈالتا ہے۔جو راضی رہے اسے رضا ملے گی،اور جو ناراض ہو،اسے ناراضی حاصل ہوگی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2396)`;
ibnemaja.anwaar = [520,1];