var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ قَالَ: حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ صَالِحٍ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ،عَنِ الْأَعْمَشِ،عَنْ يَحْيَى بْنِ وَثَّابٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ الَّذِي يُخَالِطُ النَّاسَ،وَيَصْبِرُ عَلَى أَذَاهُمْ،أَعْظَمُ أَجْرًا مِنَ الْمُؤْمِنِ الَّذِي لَا يُخَالِطُ النَّاسَ،وَلَا يَصْبِرُ عَلَى أَذَاهُمْ»";
ibnemaja.urdu = "حضرت عبد اللہ بن عمر سے روایت ہے،رسول اللہﷺ نے فرمایا: جو مومن لوگوں سے ملتا جلتا ہے ور ان سے ملنے والی تکلیف پر صبر کرتا ہے،وہ اس مومن سے زیادہ ثواب حاصل کرلیتا ہے جو لوگوں سے ملتا جلتا ہے نہیں جلتا نہیں اور ان کی طرف سے آنے والی تکلیف پر صبر نہیں کرتا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;