var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا غِيَاثُ بْنُ جَعْفَرٍ الرَّحَبِيُّ قَالَ: أَنْبَأَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: سَمِعْتُ ابْنَ جَابِرٍ،يَقُولُ: سَمِعْتُ أَبَا عَبْدِ رَبِّهِ،يَقُولُ: سَمِعْتُ مُعَاوِيَةَ،يَقُولُ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «لَمْ يَبْقَ مِنَ الدُّنْيَا إِلَّا بَلَاءٌ وَفِتْنَةٌ»";
ibnemaja.urdu = "حضرت معاویہ ؓ بیان کرتے ہیں کہ میں نے نبیﷺ سے سنا،آپ فرمارہے تھے: دنیا میں صرف آزمائش اور فتنہ ہی باقی رہ گیا ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;