var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى،عَنْ يُونُسَ،عَنِ الزُّهْرِيِّ،عَنْ أَبِي حُمَيْدٍ-يَعْنِي مَوْلَى مُسَافِعٍ-عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَتُنْتَقَوُنَّ كَمَا يُنْتَقَى التَّمْرُ مِنْ أَغْفَالِهِ،فَلْيَذْهَبَنَّ خِيَارُكُمْ،وَلَيَبْقَيَنَّ شِرَارُكُمْ،فَمُوتُوا إِنِ اسْتَطَعْتُمْ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہﷺ نے فرمایا: تم اس طرح چن لیے جاؤ گے جس طرح نکمی اور ردی کھجوروں میں سے (عمدہ)کھجوریں چن (کر اٹھا) لی جاتی ہیں۔اچھے لوگ (دنیا سے) چلے جائیں گے اور برے لوگ رہ جائیں گے،پس اگر تم سے ہوسکے تو مرجانا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ابن شھاب الزہري عنعن <br>و روی البخاري (6434) عن مرداس الأسلمي رضي اللّٰہ عنہ قال قال النبي ﷺ: ((یذھب الصالحون الأول فالأول و یبقی حفالۃ الشعیر أوالتمر،لا یبالیھم اللّٰہ بالۃ)) وھو یغني عنہ وانظر صحیح ابن حبان (الموارد: 1832)`;
ibnemaja.anwaar = [520,1];