var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ فُرَاتٍ الْقَزَّازِ،عَنْ أَبِي الطُّفَيْلِ،عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ،قَالَ: اطَّلَعَ عَلَيْنَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ غُرْفَةٍ وَنَحْنُ نَتَذَاكَرُ السَّاعَةَ،فَقَالَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَكُونَ عَشْرُ آيَاتٍ الدَّجَّالُ،وَالدُّخَانُ،وَطُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا»";
ibnemaja.urdu = "حضرت حذیفہ بن اسید غفاری سے روایت ہے کہ رسول اللہﷺ نے بالائی کمرے سے جھانک کر ہمیں دیکھا جب کہ ہم قیامت کے باے میں باتیں کر رہے تھے۔آپ نے فرمایا: قیامت نہیں آئے گی جب تک دس نشانیاں ظاہر نہ ہو جائیں: دجال،دھواں اور سورج کا مغرب سے طلوع ہونا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;