var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ قَالَ: حَدَّثَنَا عَمْرٌو،مَوْلَى الْمُطَّلِبِ،عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَنْصَارِيِّ،عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَقْتُلُوا إِمَامَكُمْ،وَتَجْتَلِدُوا بِأَسْيَافِكُمْ،وَيَرِثُ دُنْيَاكُمْ شِرَارُكُمْ»";
ibnemaja.urdu = "حضرت حذیفہ بن یمان سے روایت ہے،رسول اللہﷺ نے فرمایا: قیامت قائم نہیں ہوگی حتیٰ کہ تم اپنے امام شہید کروگے اور تلواروں کے ساتھ (ایک دوسرے سے) جنگ کرو گے۔اور بے لوگ تمہاری دنیا کے وارث ہو جائیں گے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;