var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى يَحْسُرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ،فَيَقْتَتِلُ النَّاسُ عَلَيْهِ،فَيُقْتَلُ مِنْ كُلِّ عَشَرَةٍ تِسْعَةٌ»";
ibnemaja.urdu = "حضرت ابو ہریرہ سے روایت ہے،رسول اللہﷺ نے فرمایا: قیامت قائم نہیں ہوگی حتیٰ کہ دریائے فرات سے سونے کا ایک پہاڑ ظاہر ہوگا لوگو اس کے لیے آپس میں لڑیں گے اور ہر دس میں سے نو افراد قتل ہو جائیں گے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `شاذ <br>جاء في صحیح مسلم (2894 / 29)’’ فیقتل من کل مائۃ تسعۃ وتسعون ‘‘ وھو الصواب`;
ibnemaja.anwaar = [521,1];