var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ،عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «لَا تَقُومُ السَّاعَةُ حَتَّى يَفِيضَ الْمَالُ،وَتَظْهَرَ الْفِتَنُ،وَيَكْثُرَ الْهَرْجُ»،قَالُوا: وَمَا الْهَرْجُ يَا رَسُولَ اللَّهِ؟ قَالَ: «الْقَتْلُ،الْقَتْلُ،الْقَتْلُ» ثَلَاثًا";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قیامت قائم نہیں ہوگی حتیٰ کہ مال بہت زیادہ ہوجائے گا،اور فتنے ظاہر ہوں گے اور ہرج بہت ہوگا۔صحابہ نے کہا: اللہ کے رسول! ہرج سےکیا مراد ہے؟ آپ نے تین بار فرمایا: قتل قتل قتل۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;