var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو الْحُسَيْنِ الْعُكْلِيُّ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْأَنْصَارِيِّ قَالَ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَنَا وَضُوءًا فَأَتَيْتُهُ بِمَاءٍ فَمَضْمَضَ وَاسْتَنْشَقَ مِنْ كَفٍّ وَاحِدٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن زید انصاری رضی اللہ عنہ سے روایت ہے،ا نہوں نے فرمایا: رسول اللہ ﷺ ہمارے پاس تشریف لائے اور وضو کے لئے پانی طلب فرمایا: میں نے پانی حاضر کیا تو آپ ﷺ نے ایک چلو سے کلی کی اور ناک میں پانی ڈالا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;