var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا أَبِي،وَوَكِيعٌ،عَنِ الْأَعْمَشِ،عَنْ شَقِيقٍ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ بَيْنَ يَدَيِ السَّاعَةِ أَيَّامٌ يُرْفَعُ فِيهَا الْعِلْمُ،وَيَنْزِلُ فِيهَا الْجَهْلُ،وَيَكْثُرُ فِيهَا الْهَرْجُ» وَالْهَرْجُ: الْقَتْلُ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: قیامت سے پہلے ایسا زمانہ آئے گا جس میں علم اٹھ جائے گا اور جہالت پھیل جائے گی اور ہرج زیادہ ہو گا۔اور ہرج سے مراد قتل و غارت ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;