var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ شَقِيقٍ،عَنْ أَبِي مُوسَى،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ وَرَائِكُمْ أَيَّامًا يَنْزِلُ فِيهَا الْجَهْلُ،وَيُرْفَعُ فِيهَا الْعِلْمُ،وَيَكْثُرُ فِيهَا الْهَرْجُ»،قَالُوا: يَا رَسُولَ اللَّهِ وَمَا الْهَرْجُ؟ قَالَ: «الْقَتْلُ»";
ibnemaja.urdu = "حضرت ابو موسیٰ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: تمہارے آگے (مستقبل میں) ایسا زمانہ آئے گا جس میں جہالت پھیل جائے گی،علم اٹھ جائے گا،اور ہرج زیادہ ہو گا۔صحابہ نے عرض کیا: اللہ کے رسول! ہرج کیا ہوتا ہے؟ آپ نے فرمایا: قتل و غارت۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;