var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ مَعْمَرٍ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،يَرْفَعُهُ،قَالَ: «يَتَقَارَبُ الزَّمَانُ،وَيَنْقُصُ الْعِلْمُ،وَيُلْقَى الشُّحُّ،وَتَظْهَرُ الْفِتَنُ،وَيَكْثُرُ الْهَرْجُ»،قَالُوا: يَا رَسُولَ اللَّهِ وَمَا الْهَرْجُ؟ قَالَ: «الْقَتْلُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: زمانہ قریب ہو جائے گا،علم کم ہو جائے گا،حریصانہ بخل عام ہو جائے گا،فتنے ظاہر ہوں گے اور ہرج بہت زیادہ ہو جائے گا۔صحابہ نے عرض کیا: اللہ کے رسول! ہرج کیا ہے؟ آپ نے فرمایا: قتل۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;