var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ وَابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سِنَانِ بْنِ سَعْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَادِرُوا بِالْأَعْمَالِ سِتًّا طُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدُّخَانَ وَدَابَّةَ الْأَرْضِ وَالدَّجَّالَ وَخُوَيْصَّةَ أَحَدِكُمْ وَأَمْرَ الْعَامَّةِ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: چھ چیزوں سے پہلے پہلے عمل کر لو: سورض کا مغرب سے طلوع ہونا،دھواں،دابۃ الارض،دجال،آدمی کا ذاتی مسئلہ (موت) اور عام لوگوں کا معاملہ (عمومی فتنہ۔)";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;