var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَوْنُ بْنُ عُمَارَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى بْنِ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ عَنْ جَدِّهِ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْآيَاتُ بَعْدَ الْمِائَتَيْنِ";
ibnemaja.urdu = "حضرت ابو قتادہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: (قیامت کی) نشانیاں دو سو سال کے بعد ظاہر ہوں گی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عون بن عمارۃ: ضعیف (تقریب: 5224) <br>وقال الذہبي في تلخیص المستدرک (428/4): ’’ أحسبہ موضوعًا و عون ضعفوہ‘‘`;
ibnemaja.anwaar = [521,1];