var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا بَشِيرُ بْنُ سَلْمَانُ عَنْ سَيَّارٍ عَنْ طَارِقٍ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَ يَدَيْ السَّاعَةِ مَسْخٌ وَخَسْفٌ وَقَذْفٌ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:‘‘قیامت سے پہلے (انسانوں کی) صورتیں بدلیں گی،وہ زمین میں دھنسیں گے اور ان پر پتھر برسیں گے’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;