var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ مَنْصُورٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَلَمَةَ بْنِ قَيْسٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتَ فَانْثُرْ وَإِذَا اسْتَجْمَرْتَ فَأَوْتِرْ";
ibnemaja.urdu = "سیدہ سلمہ رضی اللہ عنہا سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے مجھ سے فرمایا: جب تو وضو کرے تو ناک صاف کیا کر اور جب (قضائے حاجت کے بعد) ڈھیلے استعمال کرے تو طاق تعداد میں استعمال کر۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;