var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَكُونُ فِي آخِرِ أُمَّتِي خَسْفٌ وَمَسْخٌ وَقَذْفٌ";
ibnemaja.urdu = "حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے روایت ہے،انہوں نے نبی ﷺ سے سنا،آپ فرما رہے تھے:‘‘میری اُمت کے آخر میں زمین میں دھنسنے،صورتیں بگڑ جانے اور پتھر برسنے کے واقعات ہوں گے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبد الرحمٰن بن زید بن أسلم ضعیف <br>و الحدیث الآتي (الأصل: 4061) یغني عنہ`;
ibnemaja.anwaar = [521,1];