var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَمُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْحَسَنِ بْنِ عَمْرٍو عَنْ أَبِي الزُّبَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكُونُ فِي أُمَّتِي خَسْفٌ وَمَسْخٌ وَقَذْفٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘میری اُمت میں زمین میں دھنسنے،صورتیں بگڑنے اور پتھر برسنے کے واقعات ہوں گے’’۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;