var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ عَنْ إِسْمَعِيلَ بْنِ كَثِيرٍ عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبْرَةَ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي عَنْ الْوُضُوءِ قَالَ أَسْبِغْ الْوُضُوءَ وَبَالِغْ فِي الِاسْتِنْشَاقِ إِلَّا أَنْ تَكُونَ صَائِمًا";
ibnemaja.urdu = "سیدنا لقیط بن صبرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے عرض کیا: اے اللہ کے رسول! مجھے وضو کے بارے میں ارشاد فرمایئے۔آپ ﷺ نے فرمایا:’’وضو اچھی طرح پورا کر،اور ناک میں پانی ڈالنے میں مبالغہ کر،سوائے اس کے کہ تو روزے سے ہو";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;