var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالُ أَعْوَرُ عَيْنِ الْيُسْرَى جُفَالُ الشَّعَرِ مَعَهُ جَنَّةٌ وَنَارٌ فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ";
ibnemaja.urdu = "حضرت حذیفہ رضی اللہ عنہ روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘دجال بائیں آنکھ سے کانا ہے۔زیادہ بالوں والا ہے۔اس کے ساتھ جنت اور جہنم ہو گی۔اس کی جہنم (اصل میں) باغ ہو گی اور اس کی جنت (اصل میں) آگ ہو گی’’۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;