var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ حَدَّثَنَا يَاسِينُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ عَنْ أَبِيهِ عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَهْدِيُّ مِنَّا أَهْلَ الْبَيْتِ يُصْلِحُهُ اللَّهُ فِي لَيْلَةٍ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ مہدی ہم میں سے،یعنی اہل بیت میں سے ہے۔اللہ اسے ایک رات میں درست فرمائے گا’’۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;