var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا أَبُو الْمَلِيحِ الرَّقِّيُّ عَنْ زِيَادِ بْنِ بَيَانٍ عَنْ عَلِيِّ بْنِ نُفَيْلٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ كُنَّا عِنْدَ أُمِّ سَلَمَةَ فَتَذَاكَرْنَا الْمَهْدِيَّ فَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمَهْدِيُّ مِنْ وَلَدِ فَاطِمَةَ";
ibnemaja.urdu = "حضرت سعید بن مسیّب رحمہ اللہ سے روایت ہے،انھوں نے کہا: ہم ام المومنین حضرت ام سلمہ رضی اللہ عنہما کی خدمت میں حاضر تھے کہ ہم نے مہدی کے بارے میں بات چیت شروع کردی۔ام المومنین رضی اللہ عنہا نے فرمایا:میں نے رسول اللہ ﷺ سے سنا،آپ فرمارہے تھے:‘‘ مہدی،فاطمہ رضی اللہ عنہا کی اولاد میں سے ہوگا’’۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;