var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا سَعْدُ بْنُ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ عَلِيِّ بْنِ زِيَادٍ الْيَمَامِيِّ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ نَحْنُ وَلَدَ عَبْدِ الْمُطَّلِبِ سَادَةُ أَهْلِ الْجَنَّةِ أَنَا وَحَمْزَةُ وَعَلِيٌّ وَجَعْفَرٌ وَالْحَسَنُ وَالْحُسَيْنُ وَالْمَهْدِيُّ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انھوں نے کہا: میں نے رسول اللہ ﷺ سے سنا،آپ فرمارہے تھے:‘‘ ہم عبدالمطلب کی اولاد اہل جنت کے سردار ہیں:میں (نبی ﷺ) حمزہ،علی،جعفر،حسن حسین اور مہدی (رضی اللہ عنہم’’۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>علي بن زیادالیمامي: ضعیف (تقریب: 4733 ب) ضعفہ الجمہور وعکرمۃ بن عمارمدلس و عنعن <br>وللحدیث شاہد منکر جدًا عند الخطیب (434/9)`;
ibnemaja.anwaar = [522,2];