var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ قَالَا حَدَّثَنَا أَبُو صَالِحٍ عَبْدُ الْغَفَّارِ بْنُ دَاوُدَ الْحَرَّانِيُّ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ أَبِي زُرْعَةَ عَمْرِو بْنِ جَابِرٍ الْحَضْرَمِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنَ جَزْءٍ الزَّبِيدِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ نَاسٌ مِنْ الْمَشْرِقِ فَيُوَطِّئُونَ لِلْمَهْدِيِّ يَعْنِي سُلْطَانَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن حارث بن جزء زبیدی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘مشرق سے کچھ لوگ ظاہر ہوںگے جو مہدی کے لئے،یعنی اس کی حکومت کے لئے زمین ہموار کریں گے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عمرو بن جابر: ضعیف شیعي <br>وابن لہیعۃ عنعن <br>وللحدیث شاہد ضعیف في حلیۃ الأولیاء (53/6)`;
ibnemaja.anwaar = [523,1];