var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ وَدَاوُدُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَلْيَسْتَنْثِرْ وَمَنْ اسْتَجْمَرَ فَلْيُوتِرْ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’جو شخص وضو کرے،اسے چاہیے کہ ناک جھاڑے اور جو (استنجا کے لئے) ڈھیلے استعمال کرے،اسے چاہیے کہ طاق تعداد میں استعمال کرے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;