var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي الْعَاتِكَةِ عَنْ سُلَيْمَانَ بْنِ حَبِيبٍ الْمُحَارِبِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَقَعَتْ الْمَلَاحِمُ بَعَثَ اللَّهُ بَعْثًا مِنْ الْمَوَالِي هُمْ أَكْرَمُ الْعَرَبِ فَرَسًا وَأَجْوَدُهُ سِلَاحًا يُؤَيِّدُ اللَّهُ بِهِمْ الدِّينَ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ جب جنگیں ہوں گی تو اللہ تعالی موالی(نومسلموں)کاایک لشکر کھڑا کرے گا۔ان کے گھوڑے عرب کے بہترین گھوڑے ہوں گے اور ان کہ اسلحہ سب سے عمدہ ہوگا۔اللہ تعالی ان کے ذریعے سے دین کی مدد کرے گا’‘۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عثمان بن أبی العاتکۃ: ضعفہ الجمھور (مجمع الزوائد 10/ 210)`;
ibnemaja.anwaar = [523,1];