var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ وَإِسْمَعِيلُ بْنُ عَيَّاشٍ قَالَا حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي مَرْيَمَ عَنْ الْوَلِيدِ بْنِ سُفْيَانَ بْنِ أَبِي مَرْيَمَ عَنْ يَزِيدَ بْنِ قُطَيْبٍ السَّكُونِيِّ وَقَالَ الْوَلِيدُ يَزِيدُ بْنُ قُطْبَةَ عَنْ أَبِي بَحْرِيَّةَ عَنْ مُعَاذِ بْنِ جَبَلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَلْحَمَةُ الْكُبْرَى وَفَتْحُ الْقُسْطَنْطِينِيَّةِ وَخُرُوجُ الدَّجَّالِ فِي سَبْعَةِ أَشْهُرٍ";
ibnemaja.urdu = "حضرت معاذ بن جبل رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:‘‘ بڑی جنگ قسطنطینیہ کی فتح اور دجال کاظہور سات ماہ کے اندر ہوگا’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4295) ترمذي (2238)`;
ibnemaja.anwaar = [523,1];