var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدٍ عَنْ ابْنِ أَبِي بِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْمَلْحَمَةِ وَفَتْحِ الْمَدِينَةِ سِتُّ سِنِينَ وَيَخْرُجُ الدَّجَّالُ فِي السَّابِعَةِ";
ibnemaja.urdu = "حضرت عبداللہ بن بسر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ جنگ میں اور شہر (قسطنطینیہ)کی فتح کے درمیان چھ سال کاوقفہ ہے،اور ساتویں سال دجال ظاہر ہوجائے گا’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4296)`;
ibnemaja.anwaar = [523,1];