var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَدَّثَ عَنِّي بِحَدِيثٍ وَهُوَ يَرَى أَنَّهُ كَذِبٌ فَهُوَ أَحَدُ الْكَاذِبَيْنِ";
ibnemaja.urdu = "حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘جو شخص میری طرف منسوب کر کے کوئی حدیث بیان کرتا ہے اور اس کے علم کے مطابق وہ جھوٹ ہے تو وہ بھی جھوٹ بولنے والے دو افراد میں سے ایک ہے۔’’";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;