var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ النَّخَعِيُّ عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّةَ الثُّمَالِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ قُلْتُ لَهُ حُدِّثْتَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ مَرَّةً مَرَّةً قَالَ نَعَمْ قُلْتُ وَمَرَّتَيْنِ مَرَّتَيْنِ وَثَلَاثًا ثَلَاثًا قَالَ نَعَمْ";
ibnemaja.urdu = "سیدنا ثابت بن ابی صفیہ ثمالی سے روایت ہے،انہوں نے کہا کہ میں نے ابو جعفر سے پوچھا: کیا آپ کو سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی یہ حدیث پہنچی ہے کہ نبی ﷺ نے ایک ایک بار (اعضا دھو کر) وضو کیا؟ انہوں نے فرمایا: ہاں،میں نے کہا: اور(یہ حدیث بھی کہ) دو دو بار اور تین تین بار(اعضاء دھو کروضو کیا؟) انہوں نے فرمایا: ہاں";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (45۔46)`;
ibnemaja.anwaar = [392,1];