var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ قَالَ سَمِعْتُ الْمُسْتَوْرِدَ أَخَا بَنِي فِهْرٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مَثَلُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَثَلُ مَا يَجْعَلُ أَحَدُكُمْ إِصْبَعَهُ فِي الْيَمِّ فَلْيَنْظُرْ بِمَ يَرْجِعُ";
ibnemaja.urdu = "حضرت مستورد بن شداد بن عمرو قرشی فہری رضی اللہ عنہ سے روایت ہے،انھوں نے کہا:میں نے رسول اللہ ﷺ سے سنا،آپ فرمارہے تھے:‘‘ آخرت کے مقابلے میں دنیاکی مثال ایسے ہے جیسے کوئی شخص سمندر میں انگلی ڈالے،پھر دیکھے کہ اس نے کتنا پانی لے لیاہے’’۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;