var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ حَدَّثَنَا أَبُو خُلَيْدٍ عُتْبَةُ بْنُ حَمَّادٍ الدِّمَشْقِيُّ عَنْ ابْنِ ثَوْبَانَ عَنْ عَطَاءِ بْنِ قُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ ضَمْرَةَ السَّلُولِيِّ قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ الدُّنْيَا مَلْعُونَةٌ مَلْعُونٌ مَا فِيهَا إِلَّا ذِكْرَ اللَّهِ وَمَا وَالَاهُ أَوْ عَالِمًا أَوْ مُتَعَلِّمًا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ ﷺ سے سنا،آپ فرمارہے تھے:‘‘ دنیاملعون ہے۔اسمیں جو کچھ ہے،سب ملعون ہے،سوائے اللہ کے ذکر کے اور اس سے تعلق رکھنے والی اشیاء کے اور سوائے عالم اور طالب علم کے’’۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;