var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعْضِ جَسَدِي فَقَالَ يَا عَبْدَ اللَّهِ كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ كَأَنَّكَ عَابِرُ سَبِيلٍ وَعُدَّ نَفْسَكَ مِنْ أَهْلِ الْقُبُورِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انھوں نے فرمایا:رسول اللہ ﷺ نے میرے جسم کاایک حصہ(کندھا)پکڑ کر فرمایا:‘‘عبداللہ! دنیامیں ایسے رہ،گویاتوپردیسی ہے،گویاتومسافر ہے۔اور اپنے آپ کو قبروں والوں (مردوں)میں شمار کر’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2333)`;
ibnemaja.anwaar = [524,1];