var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا أَيُّوبُ بْنُ سُوَيْدٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أُمَامَةَ الْحَارِثِيِّ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَذَاذَةُ مِنْ الْإِيمَانِ قَالَ الْبَذَاذَةُ الْقَشَافَةُ يَعْنِي التَّقَشُّفَ";
ibnemaja.urdu = "حضرت ابو امامہ حارثی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ سے فرمایا:‘‘ سادگی ایمان میں سے ہے’’۔\nراوی نے کہا:سادگی سےمراد معمولی لباس و غذا پر اکتفا کرنا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (4161) <br>فیہ أیوب بن سوید ضعیف`;
ibnemaja.anwaar = [525,1];