var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ عَنْ ابْنِ خُثَيْمٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَلَا أُنَبِّئُكُمْ بِخِيَارِكُمْ قَالُوا بَلَى يَا رَسُولَ اللَّهِ قَالَ خِيَارُكُمْ الَّذِينَ إِذَا رُءُوا ذُكِرَ اللَّهُ عَزَّ وَجَلَّ";
ibnemaja.urdu = "حضرت اسماء بنت یزید رضی اللہ عنہا سے روایت ہے،انھوں نے رسول اللہ ﷺ کو سنا،آپ فرمارہے تھے،‘‘کیامیں تمہیں تمہارے بہترین افراد کی نشان دہی نہ کروں؟’’صحابہ نے عرض کیا:کیوں نہیں اللہ کے رسول!آپ نے فرمایا:‘‘تمہارے بہترین افراد وہ ہیں جن کو دیکھ کر اللہ کی یاد آئے ’’۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;