var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ أَنْبَأَنَا الضَّحَّاكُ بْنُ شُرَحْبِيلَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عُمَرَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ تَوَضَّأَ وَاحِدَةً وَاحِدَةً";
ibnemaja.urdu = "سیدنا عمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے غزوہٴ تبوک کے دوران میں رسول اللہ ﷺ کو دیکھا کہ آپ نے ایک ایک بار(اعضاء دھوکر) وضو کیا";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھو إسناد ضعیف لضعف رشدین بن سعد ‘‘ وھو ضعیف <br>وتابعہ ابن لھیعۃ عند أحمد (1/ 23 ح 149) وسندہ ضعیف <br>لأنہ لم یعلم تحدیث ابن لھیعۃ بہ قبل اختلاطہ`;
ibnemaja.anwaar = [392,1];