var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عِيسَى بْنُ الْمُخْتَارِ عَنْ مُحَمَّدِ بْنِ أَبِي لَيْلَى عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فُقَرَاءَ الْمُهَاجِرِينَ يَدْخُلُونَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِمِقْدَارِ خَمْسِ مِائَةِ سَنَةٍ";
ibnemaja.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ نادار مہاجرین غنی مہاجروں سے پانچ سو سال پہلے جنت میں داخل ہوں گے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>محمد بن أبي لیلی و عطیۃ العوفي ضعیفان <br>و انظر ضعیف سنن الترمذي (2351) <br>و روی الإمام مسلم (2979) عن رسول اللّٰہ ﷺ: ((إن فقراء المھاجرین یسبقون الأغنیاء یوم القیامۃ إلی الجنۃ بأربعین عامًا)) وھو یغني عنہ`;
ibnemaja.anwaar = [525,1];