var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ أَبُو يَحْيَى حَدَّثَنَا إِبْرَاهِيمُ أَبُو إِسْحَقَ الْمَخْزُومِيُّ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ جَعْفَرُ بْنُ أَبِي طَالِبٍ يُحِبُّ الْمَسَاكِينَ وَيَجْلِسُ إِلَيْهِمْ وَيُحَدِّثُهُمْ وَيُحَدِّثُونَهُ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْنِيهِ أَبَا الْمَسَاكِينِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا:حضرت جعفر بن ابوطالب رضی اللہ عنہ غریبوں سے محبت کرتے اور ان کے پاس بیٹھ کران سے باتیں کرتے اور ان کی باتیں سنتے تھے۔اور رسول اللہ ﷺ ان (جعفر رضی اللہ عنہ) کو ابو المساکین کی کنیت سے یاد فرمایا کرتے تھے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3766)`;
ibnemaja.anwaar = [525,1];