var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنِي أَبُو زُمَيْلٍ هُوَ سِمَاكٌ عَنْ مَالِكِ بْنِ مَرْثَدٍ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَكْثَرُونَ هُمْ الْأَسْفَلُونَ يَوْمَ الْقِيَامَةِ إِلَّا مَنْ قَالَ بِالْمَالِ هَكَذَا وَهَكَذَا وَكَسَبَهُ مِنْ طَيِّبٍ";
ibnemaja.urdu = "حضرت ابو ذر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘زیادہ مال والے قیامت کے دن (دوسروں سے درجات میں)نیچے ہوں گے،مگر جس نے مال کو اس طرح اور اس طرح خرچ کیا،اور اس کی کمائی پاک(اور حلال ذرائع)سے ہوئی ’’۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;