var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَكْثَرُونَ هُمْ الْأَسْفَلُونَ إِلَّا مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا ثَلَاثًا";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ زیادہ مال والے زیادہ نیچے ہوں گے،مگر جس نے اس طرح،اس طرح اور اس طرح خرچ کیا’’۔(نبی ﷺ نے)تین بار (اشارہ)فرمایا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;