var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ أَبِي سُهَيْلِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أُحِبُّ أَنَّ أُحُدًا عِنْدِي ذَهَبًا فَتَأْتِي عَلَيَّ ثَالِثَةٌ وَعِنْدِي مِنْهُ شَيْءٌ إِلَّا شَيْءٌ أَرْصُدُهُ فِي قَضَاءِ دَيْنٍ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:‘‘اگر میرے پاس احد پہاڑ جتنا سونا ہوتا میں نہیں چاہوں گاکہ مجھ پر تیسری رات آئے اور (اس وقت بھی)اس میں سے کچھ میرے پاس (بچاہوا)موجود ہو،مگر اتنی چیز جسے میں قرض کی ادائیگی کے لئے سنبھال رکھوں’’۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;