var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ حَمَّادٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي حَصِينٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعِسَ عَبْدُ الدِّينَارِ وَعَبْدُ الدِّرْهَمِ وَعَبْدُ الْقَطِيفَةِ وَعَبْدُ الْخَمِيصَةِ إِنْ أُعْطِيَ رَضِيَ وَإِنْ لَمْ يُعْطَ لَمْ يَفِ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ ہلاک ہوجائے (تباہ ہوجائے)دینار کابندہ،درہم کابندہ،کمبل کابندہ اور چادر کا بندہ۔اگر اسے دیاجائے توخوش رہتاے،اگر نہ دیا جائے تو(بیعت والا)وعدہ پورانہیں کرتا’’۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;