var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدٍ حَدَّثَنَا إِسْحَقُ بْنُ سَعِيدٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعِسَ عَبْدُ الدِّينَارِ وَعَبْدُ الدِّرْهَمِ وَعَبْدُ الْخَمِيصَةِ تَعِسَ وَانْتَكَسَ وَإِذَا شِيكَ فَلَا انْتَقَشَ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:ہلاک ہوجائے دینار کابندہ،درہم کابندہ،اور چادر کابندہ۔ہلاک ہوجائے،اوندھا ہوجائے،اسے کانٹا لگے تونکالا نہ جائے’’۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;