var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ وَحُمَيْدِ بْنِ هَانِئٍ الْخَوْلَانِيِّ أَنَّهُمَا سَمِعَا أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ يُخْبِرُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ قَدْ أَفْلَحَ مَنْ هُدِيَ إِلَى الْإِسْلَامِ وَرُزِقَ الْكَفَافَ وَقَنَعَ بِهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ کامیاب وہ ہے جسے اسلام کی ہدایت مل گئی،ضرورت کے مطابق رزق مل گیا اور وہ اس پر قانع ہوگیا’’۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;