var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ عَنْ ابْنِ عُمَرَ أَنَّهُ تَوَضَّأَ ثَلَاثًا ثَلَاثًا وَرَفَعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ انہوں نے تین تین بار اعضاء دھو کر وضو کیا اور اسے رسول اللہ ﷺ کا عمل قرار دیا";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;