var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَيَعْلَى عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ نُفَيْعٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ غَنِيٍّ وَلَا فَقِيرٍ إِلَّا وَدَّ يَوْمَ الْقِيَامَةِ أَنَّهُ أُتِيَ مِنْ الدُّنْيَا قُوتًا";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ قیامت کے دن ہر دولت مند اور نادار کی خواہش یہی ہوگی کہ اسے دنیامیں صرف (زندہ رکھنے کے قابل) تھوڑی سی روزی ملی ہوتی ’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>نفیع أبو داود الأعمی: متروک وقدکذبہ ابن معین`;
ibnemaja.anwaar = [526,1];