var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ وَمُجَاهِدُ بْنُ مُوسَى قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي شُمَيْلَةَ عَنْ سَلَمَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ مِحْصَنٍ الْأَنْصَارِيِّ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَصْبَحَ مِنْكُمْ مُعَافًى فِي جَسَدِهِ آمِنًا فِي سِرْبِهِ عِنْدَهُ قُوتُ يَوْمِهِ فَكَأَنَّمَا حِيزَتْ لَهُ الدُّنْيَا";
ibnemaja.urdu = "حضرت عبداللہ بن محصن انصاری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ جس کی صبح اس حال میں ہوئی کہ اسے بدن میں عافیت،اپنے بارے میں امن اور دن بھر کی خوراک حاصل ہو،اسے گویا پوری دنیاجمع کرکے دے دی گئی ’’۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;