var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْظُرُوا إِلَى مَنْ هُوَ أَسْفَلَ مِنْكُمْ وَلَا تَنْظُرُوا إِلَى مَنْ هُوَ فَوْقَكُمْ فَإِنَّهُ أَجْدَرُ أَنْ لَا تَزْدَرُوا نِعْمَةَ اللَّهِ قَالَ أَبُو مُعَاوِيَةَ عَلَيْكُمْ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ (دنیامیں)اپنے سے نیچے والے (کم مال)کو دیکھو،اپنے سے اوپر والے کو نہ دیکھو،اس سے یہ ہوگا کہ تم اللہ کی نعمت کوحقیر نہ سمجھوگے’’۔\n(روائ حدیث)ابو معاویہ نے (نعمۃ اللہ)کے بعد(علیکم)کے الفاظ بھی بیان کیے ہیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;