var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ حَدَّثَنَا يَزِيدُ بْنُ الْأَصَمِّ عَنْ أَبِي هُرَيْرَةَ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ إِنَّمَا يَنْظُرُ إِلَى أَعْمَالِكُمْ وَقُلُوبِكُمْ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا:‘‘ اللہ تعالی تمہاری صورتوں اور مالوں کو نہیں دیکھتا بلکہ تمہارے عملوں اور دلوں کو دیکھتاہے’’۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;