var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ إِنْ كُنَّا آلَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنَمْكُثُ شَهْرًا مَا نُوقِدُ فِيهِ بِنَارٍ مَا هُوَ إِلَّا التَّمْرُ وَالْمَاءُ إِلَّا أَنَّ ابْنَ نُمَيْرٍ قَالَ نَلْبَثُ شَهْرًا";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے،انھوں نے فرمایا:ہم،آل محمد ﷺ مہینہ مہینہ اس حال میں گزار دیتے تھے کہ آگ نہیں جلاتے تھے۔(ہمارا کھانا)صرف کھجوریں اور پانی ہوتا تھا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;