var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْتَوِي فِي الْيَوْمِ مِنْ الْجُوعِ مَا يَجِدُ مِنْ الدَّقَلِ مَا يَمْلَأُ بِهِ بَطْنَهُ";
ibnemaja.urdu = "حضرت عمر بن خطاب رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا:میں نے ایک دن رسول اللہ ﷺ کو بھوک کی وجہ سے کروٹیں بدلتے دیکھا کیونکہ آپ کومعمولی سی کھجوریں بھی میسر نہ تھیں جن سے پیٹ بھر لیتے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;