var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى أَنْبَأَنَا شَيْبَانُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مِرَارًا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ مَا أَصْبَحَ عِنْدَ آلِ مُحَمَّدٍ صَاعُ حَبٍّ وَلَا صَاعُ تَمْرٍ وَإِنَّ لَهُ يَوْمَئِذٍ تِسْعَ نِسْوَةٍ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا:میں نے رسول اللہ ﷺ کو کئی بار یہ فرماتے سنا ہے:‘‘قسم ہے اس ذات کی جس کے ہاتھ میں محمد(ﷺ)کی جان ہے! آج محمد (ﷺ) کے گھر والوں کے پاس ایک صاع غلہ ہے نہ ایک صاع کھجوریں ’’۔\nان دنوں رسول اکرم ﷺ کی نو بیویاں تھیں۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;