var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ الْمَسْعُودِيُّ عَنْ عَلِيِّ بْنِ بَذِيمَةَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَصْبَحَ فِي آلِ مُحَمَّدٍ إِلَّا مُدٌّ مِنْ طَعَامٍ أَوْ مَا أَصْبَحَ فِي آلِ مُحَمَّدٍ مُدٌّ مِنْ طَعَامٍ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘آج محمد (ﷺ) کے گھر والوں کے پاس صرف ایک مُد خوراک ہے’’۔یافرمایا:‘‘ایک مُد خوراک بھی نہیں ہے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>أبو عبیدۃ عن أبیہ: منقطع <br>والصحیح ما رواہ البخاري(2508) ’’ ما أصبح لآل محمد ﷺ إلا صاع‘‘ أو ما رواہ الترمذي (1215) وغیرہ ’’ ما أمسی عند آل محمد ﷺ صاع من تمر ولا صاع حب ‘‘`;
ibnemaja.anwaar = [526,1];