var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنِي أَبِي عَنْ شُعْبَةَ عَنْ عَبْدِ الْأَكْرَمِ رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ قَالَ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَكَثْنَا ثَلَاثَ لَيَالٍ لَا نَقْدِرُ أَوْ لَا يَقْدِرُ عَلَى طَعَامٍ";
ibnemaja.urdu = "حضرت سلمان بن صرد رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا:رسول اللہ ﷺ ہمارے ہاں تشریف لائے تو(ہماری یہ حالت تھی کہ)ہمیں تین رات تک کھانا میسر نہ ہوسکا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>عبد الأکرم بن أبي حنیفۃ الکوفي: شیخ مقبول (تقریب: 3740) أي مجہول الحال،وأبوہ: مجہول(تقریب: 8067)`;
ibnemaja.anwaar = [526,2];