var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا بِطَعَامٍ سُخْنٍ فَأَكَلَ فَلَمَّا فَرَغَ قَالَ الْحَمْدُ لِلَّهِ مَا دَخَلَ بَطْنِي طَعَامٌ سُخْنٌ مُنْذُ كَذَا وَكَذَا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا:ایک دن رسول اللہ ﷺ کی خدمت میں گرم کھانا حاضر کیاگیا۔آپ نے تناول فرمایا۔جب فارغ ہوئے توفرمایا:‘‘ اللہ کاشکر ہے میرے پیٹ میں اتنے دن سے (تازہ اور)گرم کھانا نہیں گیا۔(کھجور وغیرہ پر گزارا رہا’’َ۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الأعمش عنعن <br>وسوید بن سعید: ضعیف`;
ibnemaja.anwaar = [527,1];