var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَلِيٍّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى عَلِيًّا وَفَاطِمَةَ وَهُمَا فِي خَمِيلٍ لَهُمَا وَالْخَمِيلُ الْقَطِيفَةُ الْبَيْضَاءُ مِنْ الصُّوفِ قَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَهَّزَهُمَا بِهَا وَوِسَادَةٍ مَحْشُوَّةٍ إِذْخِرًا وَقِرْبَةٍ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ حضرت علی اور فاطمہ رضی اللہ عنہا کے ہاں تشریف لے گئے۔اس وقت ان دونوں نے ایک سفید اونی چادر لے رکھی تھی جو ان دونوں کو رسول اللہ ﷺ نے عنایت فرمائی تھی،نیز ایک اذخر کی گھاس بھراگدا دیاتھا اور مشکیزہ۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;