var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ مُجَالِدٍ عَنْ عَامِرٍ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ أُهْدِيَتْ ابْنَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيَّ فَمَا كَانَ فِرَاشُنَا لَيْلَةَ أُهْدِيَتْ إِلَّا مَسْكَ كَبْشٍ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا:جب رسول اللہ ﷺ کی بیٹی (حضرت فاطمہ رضی اللہ عنہا)رخصت ہوکر میرے گھر آئیں،اس رات ہمارا بستر صرف ایک مینڈھے کی کھال پر مشتمل تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھذا إسناد ضعیف،لضعف الحارث الأعور و مجالد‘‘`;
ibnemaja.anwaar = [527,1];