var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ أَبِي نَعَامَةَ سَمِعَهُ مِنْ خَالِدِ بْنِ عُمَيْرٍ قَالَ خَطَبَنَا عُتْبَةُ بْنُ غَزْوَانَ عَلَى الْمِنْبَرِ فَقَالَ لَقَدْ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَنَا طَعَامٌ نَأْكُلُهُ إِلَّا وَرَقُ الشَّجَرِ حَتَّى قَرِحَتْ أَشْدَاقُنَا";
ibnemaja.urdu = "حضرت خالد بن عمیر رحمہ اللہ سے روایت ہے انھوں نے کہا: ہمیں حضرت عتبہ بن غزوان رضی اللہ عنہ نے منبر پر خطبہ دیا اور (اس میں یہ بھی)فرمایا: میں نے دیکھا ہے کہ ہم سات افراد رسول اللہ ﷺ کے ساتھ تھے۔ہمیں کھانے کے لئے درختوں کے پتوں کے سوا کچھ بھی میسر نہ تھا۔(ہم وہی کھاتے رہے)حتی کہ ہماری باچھیں زخمی ہوگئیں";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;