var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ عَبَّاسٍ الْجُرَيْرِيِّ قَالَ سَمِعْتُ أَبَا عُثْمَانَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ أَنَّهُمْ أَصَابَهُمْ جُوعٌ وَهُمْ سَبْعَةٌ قَالَ فَأَعْطَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ تَمَرَاتٍ لِكُلِّ إِنْسَانٍ تَمْرَةٌ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ انہیں بھوک کاسامنا کرنا پڑا جب کہ وہ سات افراد تھے۔وہ فرماتے ہیں:مجھے نبی ﷺ نے سات کھجوریں عنایت فرمائیں۔ہر آدمی کے لئے ایک کھجور۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;