var ibnemaja = {};
ibnemaja.arabic = "حدثنا محمد بن يحيى بن أبي عمر العدني حدثنا سفيان بن عيينة عن محمد ابن عمرو عن يحيى بن عبد الرحمن بن حاطب عن عبد الله بن الزبير بن العوام عن أبيه قال لما نزلت (ثم لتسألن يومئذ عن النعيم) قال الزبير وأي نعيم نسأل عنه وإنما هو الأسودان التمر والماء قال أما إنه سيكون.";
ibnemaja.urdu = "حضرت عبداللہ بن زبیر رضی اللہ عنہما اپنے والد حضرت زبیر بن عوام رضی اللہ عنہ سے بیان کرتے ہیں انھوں نے کہا:جب یہ آیت نازل ہوئی: ثُمَّ لَتُسْأَلُنَّ یَوْمَئِذٍ عَنِ النَّعِیمِ\n‘‘ پھر اس دن تم سے نعمتوں کے بارے میں ضرور سوال ہوگا’’۔حضرت زبیر رضی اللہ عنہ نے کہا: ہم سے کون سی نعمتوں کے بارے میں سوال ہوگا؟ ہمیں توصرف پانی اور کھجوریں ہی میسر ہیں۔نبی ﷺ نے فرمایا:‘‘ آگاہ رہو! یہ (سوال)ضرور ہوگا’’۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;