var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ فَائِدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثَلَاثًا ثَلَاثًا وَمَسَحَ رَأْسَهُ مَرَّةً";
ibnemaja.urdu = "سیدنا عبداللہ بن ابی اوفیٰ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا کہ آپ نے تین تین بار(اعضاء دھوکر) وضو کیا اور سر کا مسح ایک بار کیا";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;