var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا إِسْحَقُ بْنُ سَعِيدِ بِنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ عَنْ أَبِيهِ سَعِيدٍ عَنْ ابْنِ عُمَرَ قَالَ لَقَدْ رَأَيْتُنِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَنَيْتُ بَيْتًا يُكِنُّنِي مِنْ الْمَطَرِ وَيُكِنُّنِي مِنْ الشَّمْسِ مَا أَعَانَنِي عَلَيْهِ خَلْقُ اللَّهِ تَعَالَى";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: جب میں رسول اللہ ﷺ کے ساتھ ہوتا تھا (اور آپ حیات تھے) تو میں نے یہ کیفیت بھی دیکھی کہ میں نے ایک کمرہ بنایا جو مجھے بارش سے محفوظ رکھ سکے اور دھوپ سے بچا سکے۔اس کی تعمیر میں میری کسی شکص نے مدد نہ کی۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;