var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ ابْنِ هُبَيْرَةَ عَنْ أَبِي تَمِيمٍ الْجَيْشَانِيِّ قَالَ سَمِعْتُ عُمَرَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْ أَنَّكُمْ تَوَكَّلْتُمْ عَلَى اللَّهِ حَقَّ تَوَكُّلِهِ لَرَزَقَكُمْ كَمَا يَرْزُقُ الطَّيْرَ تَغْدُو خِمَاصًا وَتَرُوحُ بِطَانًا";
ibnemaja.urdu = "حضرت عمر رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے:‘‘اگر تم لوگ اللہ پر اس طرح بھروسا کرو جیسے اس پر بھروسا کرنے کا حق ہے تو وہ تمہیں اس طرح رزق دے جیسے پرندوں کو رزق دیتا ہے۔وہ صبح (گھونسلوں سے) بھوکے روانہ ہوتے ہیں اور شام کو سیر ہو کر آتے ہیں’’";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;