var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَمُوتَنَّ أَحَدٌ مِنْكُمْ إِلَّا وَهُوَ يُحْسِنُ الظَّنَّ بِاللَّهِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ہر شخص کو اس حال میں موت آنی چاہیئے کہ وہ اللہ کے بارے میں اچھا گمان رکھتا ہو";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;