var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَلِمَةُ الْحِكْمَةُ ضَالَّةُ الْمُؤْمِنِ حَيْثُمَا وَجَدَهَا فَهُوَ أَحَقُّ بِهَا";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘دانائی کی بات مومن کی گم شدہ چیز ہے۔وہ اسے جہاں ملے اسے لینے کازیادہ حق رکھتاہے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>ترمذي (2687)`;
ibnemaja.anwaar = [527,1];