var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ الْأَغَرِّ أَبِي مُسْلِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُ سُبْحَانَهُ الْكِبْرِيَاءُ رِدَائِي وَالْعَظَمَةُ إِزَارِي مَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا أَلْقَيْتُهُ فِي جَهَنَّمَ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘اللہ عزوجل فرماتا ہے:بڑائی میری چادر ہے اور عظمت میراپہناوا ہے۔جو شخص ان میں سے کوئی چیز بھی مجھ سے کھینچے گا میں اسے جہنم میں پھینک دوں گا’’۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;