var ibnemaja = {};
ibnemaja.arabic = "حدثنا عبد الله بن سعيد وهارون بن إسحق قالا حدثنا عبد الرحمن المحاربي عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال قال رسول الله صلى الله عليه وسلم يقول الله سبحانه الكبرياء ردائي والعظمة إزاري فمن نازعني واحدا منهما ألقيته في النار.";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘ اللہ پاک فرماتا ہے:بڑائی میری چادر ہے اور عظمت میراپہناوا ہے۔جو شخص ان میں سے کوئی چیز بھی مجھ سے کھینچے گا میں اسے آگ میں پھینک دوں گا’";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;