var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الصَّمَدِ وَسَلْمُ بْنُ قُتَيْبَةَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ إِنْ كَانَتْ الْأَمَةُ مِنْ أَهْلِ الْمَدِينَةِ لَتَأْخُذُ بِيَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا يَنْزِعُ يَدَهُ مِنْ يَدِهَا حَتَّى تَذْهَبَ بِهِ حَيْثُ شَاءَتْ مِنْ الْمَدِينَةِ فِي حَاجَتِهَا";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: مدینہ والوں کی ایک لونڈی بھی اللہ کے رسول ﷺ کا ہاتھ پکڑ لیتی تھی تو آپ اس کے ہاتھ سے اپنا ہاتھ نہیں چھڑاتے تھے حتی کہ وہ رسول اللہ ﷺ کو اپنے کسی کام کےلئے مدینہ میں جس جگہ چاہتی لے جاتی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;