var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مُسْلِمٍ الْأَعْوَرِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُ الْمَرِيضَ وَيُشَيِّعُ الْجِنَازَةَ وَيُجِيبُ دَعْوَةَ الْمَمْلُوكِ وَيَرْكَبُ الْحِمَارَ وَكَانَ يَوْمَ قُرَيْظَةَ وَالنَّضِيرِ عَلَى حِمَارٍ وَيَوْمَ خَيْبَرَ عَلَى حِمَارٍ مَخْطُومٍ بِرَسَنٍ مِنْ لِيفٍ وَتَحْتَهُ إِكَافٌ مِنْ لِيفٍ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ بیمار کی عیادت فرماتے جنازے کے ساتھ جاتے غلام کی دعوت قبول کرتے اور گدھے پر سوار ہو جایا کرتے تھے۔بنو قریظہ اور بنونضیر کے دن (جس دن بنوقریظہ اور بنونضیر والا واقعہ ہوا) آپ ﷺ ایک گدھے پر سوار تھے۔اور جنگ خیبر کے موقع پر آپ ایک گدھے پر سوار تھے جس کی لگام کھجور کے پتوں سے بنی ہوئی رسی کی تھی۔اور آپ کے نیچے کھجور کے پتوں کی زین تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (2296)`;
ibnemaja.anwaar = [528,1];