var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ حَدَّثَنَا أَبِي عَنْ مَطَرٍ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ عِيَاضِ بْنِ حِمَارٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ خَطَبَهُمْ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا حَتَّى لَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ";
ibnemaja.urdu = "حضرت عیاض بن حمار رضی اللہ عنہ سے روایت ہے نبی ﷺ نے خطبہ ارشاد فرمایا: اس میں آپ نے یہ بھی فرمایا:‘‘اللہ عزوجل نے مجھ پر وحی نازل کی ہے کہ تواضع اختیار کرو حتی کہ کوئی کسی پر فخر نہ کرے’’۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;