var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عُتْبَةَ مَوْلًى لِأَنَسِ بْنِ مَالِكٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ حَيَاءً مِنْ عَذْرَاءَ فِي خِدْرِهَا وَكَانَ إِذَا كَرِهَ شَيْئًا رُئِيَ ذَلِكَ فِي وَجْهِهِ";
ibnemaja.urdu = "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ پردہ نشین کنواری لڑکی سے زیادہ حیادار تھے۔اگر آپ کو کوئی بات ناگوار گزرتی تو چہرہ مبارک پر اس کے آثار ظاہر ہو جاتے تھے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;