var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ مُعَاوِيَةَ بْنِ يَحْيَى عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِكُلِّ دِينٍ خُلُقًا وَخُلُقُ الْإِسْلَامِ الْحَيَاءُ";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘ہر دین میں کوئی نہ کوئی امتیازی اور اخلاقی خوبی ہوتی ہے۔اسلام کی امتیازی خوبی حیاء ہے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>معاویۃ بن یحیی الصدفي: ضعیف <br>وللحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [528,1];