var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْوَرَّاقُ حَدَّثَنَا صَالِحُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِكُلِّ دِينٍ خُلُقًا وَإِنَّ خُلُقَ الْإِسْلَامِ الْحَيَاءُ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘ہر دین کی کوئی نہ کوئی امتیازی اور اخلاقی خوبی ہوتی ہے۔اسلام کی امتیازی خوبی حیاء ہے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف<br>صالح بن حسان: متروک <br>وللحدیث شواہد ضعیفۃ منھا الحدیث السابق (4181)`;
ibnemaja.anwaar = [528,1];