var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عُقْبَةَ بْنِ عَمْرٍو أَبِي مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى إِذَا لَمْ تَسْتَحْيِ فَاصْنَعْ مَا شِئْتَ";
ibnemaja.urdu = "حضرت ابومسعود رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘لوگوں تک پہلی نبوت کا جو کلام پہنچا ہے اس میں یہ بھی ہے: جب تو حیاء نہ کرے تو جو چاہے کر’’۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;