var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَيَاءُ مِنْ الْإِيمَانِ وَالْإِيمَانُ فِي الْجَنَّةِ وَالْبَذَاءُ مِنْ الْجَفَاءِ وَالْجَفَاءُ فِي النَّارِ";
ibnemaja.urdu = "حضرت ابوبکرہ (نفیع بن حارث ثقفی) رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘حیاء ایمان کا حصہ ہے اور ایمان جنت میں (لے جانے والا) ہے۔اور بدکلامی بداخلاقی کا حصہ ہے اور بداخلاقی جہنم میں (لے جانے والی) ہے’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;