var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي مَرْحُومٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَظَمَ غَيْظًا وَهُوَ قَادِرٌ عَلَى أَنْ يُنْفِذَهُ دَعَاهُ اللَّهُ عَلَى رُءُوسِ الْخَلَائِقِ يَوْمَ الْقِيَامَةِ حَتَّى يُخَيِّرَهُ فِي أَيِّ الْحُورِ شَاءَ";
ibnemaja.urdu = "حضرت معاذ بن انس جہنی انصاری رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘جس شخص نے اپنا غصہ روک لیا جب کہ وہ غصہ (کے مطابق سختی) نافذ کرنے کی طاقت رکھتا تھا اسے قیامت کے دن اللہ تعالیٰ سب مخلوقات کے سامنے بلا کر اختیار دے گا کہ جون سی حور چاہے پسند کر لے’’۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;