var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَقَ الْهَرَوِيُّ حَدَّثَنَا الْعَبَّاسُ بْنُ الْفَضْلِ الْأَنْصَارِيُّ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو جَمْرَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْأَشَجِّ الْعَصَرِيِّ إِنَّ فِيكَ خَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ الْحِلْمَ وَالْحَيَاءَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سےروایت ہے نبی ﷺ نے حضرت اشج عصری رضی اللہ عنہ سے فرمایا:‘‘تمہارے اندر دو خوبیاں ہین جو اللہ کو پسند ہیں۔حلم (بردباری) اور حیاء";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;