var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ جُرْعَةٍ أَعْظَمُ أَجْرًا عِنْدَ اللَّهِ مِنْ جُرْعَةِ غَيْظٍ كَظَمَهَا عَبْدٌ ابْتِغَاءَ وَجْهِ اللَّهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘غصے کا وہ گھونٹ جسے کوئی بندہ اللہ کی رضا کے لئے پی لیتا ہے اللہ کے ہاں اس سے بڑے ثواب والا کوئی گھونٹ نہیں’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الحسن عنعن`;
ibnemaja.anwaar = [528,1];