var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا وَلَبَكَيْتُمْ كَثِيرًا";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘اگر تمہیں وہ کچھ معلوم ہو جائے جو مجھے معلوم ہے تو تم ہنسو کم اور روؤ زیادہ’’۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;