var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو رَجَاءٍ الْخُرَاسَانِيُّ عَنْ مُحَمَّدِ بْنِ مَالِكٍ عَنْ الْبَرَاءِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جِنَازَةٍ فَجَلَسَ عَلَى شَفِيرِ الْقَبْرِ فَبَكَى حَتَّى بَلَّ الثَّرَى ثُمَّ قَالَ يَا إِخْوَانِي لِمِثْلِ هَذَا فَأَعِدُّوا";
ibnemaja.urdu = "حضرت براء رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: ہم ایک جنازے میں رسول اللہ ﷺ کے ساتھ تھے۔رسول اللہ ﷺ ایک قبر کے کنارے پر بیٹھ گئے اور اتنا روئے کہ مٹی تر ہو گئی۔پھر فرمایا:‘‘بھائیو! ایسی چیز (قبر) کے لئے تیاری کر لو";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>محمد بن مالک الجوزجاني: اختلف قول ابن حبان فیہ و ضعفہ الجمھور`;
ibnemaja.anwaar = [528,1];