var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ بَشِيرِ بْنِ ذَكْوَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو رَافِعٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ السَّائِبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْكُوا فَإِنْ لَمْ تَبْكُوا فَتَبَاكَوْا";
ibnemaja.urdu = "حضرت سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘رویا کرو۔اگر رونا نہ آئے تو رونے کی سی شکل بنا لو (تاکہ آنسو آجائیں’’)۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (1337)`;
ibnemaja.anwaar = [528,1];