var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ وَرْقَاءَ بْنِ عُمَرَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ ذَكْوَانَ أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْعَبْدَ إِذَا صَلَّى فِي الْعَلَانِيَةِ فَأَحْسَنَ وَصَلَّى فِي السِّرِّ فَأَحْسَنَ قَالَ اللَّهُ عَزَّ وَجَلَّ هَذَا عَبْدِي حَقًّا";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘جب بندہ دوسروں کے سامنے بھی نماز اچھی پرھے اور چھپ کر (تنہائی میں) بھی نماز اچھی پڑھے تو اللہ تعالی فرماتا ہے: یہ واقعی میرا بندہ ہے’’۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>بقیۃ عنعن <br>وقال أبو حاتم: ’’ ھذا حدیث منکر،یشبہ أن یکون من حدیث عباد بن کثیر ‘‘ (علل الحدیث 189/1،ح 541)`;
ibnemaja.anwaar = [529,1];