var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عِيسَى بْنُ الْمُخْتَارِ عَنْ مُحَمَّدِ بْنِ أَبِي لَيْلَى عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يُسَمِّعْ يُسَمِّعْ اللَّهُ بِهِ وَمَنْ يُرَاءِ يُرَاءِ اللَّهُ بِهِ";
ibnemaja.urdu = "حضرت ابو خدری سے روایت ہے نبی ﷺ نے فر ما یا جو شخص شہرت کے لئے نیکی کر تا ہے۔اللہ تعا لی اس کی تشہیر کر ے گا۔اور جو شخص دکھلاو ا کر تا ہے۔اللہ اس کی حقیقت ظا ہر کر دے گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;