var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْوَهَّابِ عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يُرَاءِ يُرَاءِ اللَّهُ بِهِ وَمَنْ يُسَمِّعْ يُسَمِّعْ اللَّهُ بِهِ";
ibnemaja.urdu = "حضرت جندب (بن عبد اللہ بن سفیا ن ) سے روایت ہے رسول اللہ ﷺ نے فر ما یا جو دکھلا وا کر ے گا۔اللہ اس کی حقیقت ظا ہر کر دے گا۔اور جو شہر ت کے لئے نیکی کر تا ہے اللہ اس کی تشہیر کر ے گا";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;