var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ وَأَحْمَدُ بْنُ الْأَزْهَر قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عِيسَى بْنِ أَبِي عِيسَى الْحَنَّاطِ عَنْ أَبِي الزِّنَادِ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحَسَدُ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ وَالصَّلَاةُ نُورُ الْمُؤْمِنِ وَالصِّيَامُ جُنَّةٌ مِنْ النَّارِ";
ibnemaja.urdu = "حضرت انس ؓ سے روا یت ہے کہ رسول اللہ ﷺ نے فر ما یا۔کہ حسد نیکیو ں کو اس طرح کھا جا تا ہے جس طر ح آ گ لکڑ یو ں کو کھا جا تی ہے اور صد قہ گنا ہو ں (کی آگ) کو اس طر ح بجھا دیتا ہے جس طر ح پا نی (دنیا کی) آگ کو بجھا دیتا ہے نماز مومن کا نو ر ہے اور روزہ جہنم سے (بچا نے والی) ڈاھا ل ہے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عیسی الحناط: متروک <br>ولبعض الحدیث شواہد دون ھذا السیاق وانظر ضعیف سنن أبي داود (4903)`;
ibnemaja.anwaar = [529,1];