var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ وَابْنُ عُلَيَّةَ عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ ذَنْبٍ أَجْدَرُ أَنْ يُعَجِّلَ اللَّهُ لِصَاحِبِهِ الْعُقُوبَةَ فِي الدُّنْيَا مَعَ مَا يَدَّخِرُ لَهُ فِي الْآخِرَةِ مِنْ الْبَغْيِ وَقَطِيعَةِ الرَّحِمِ";
ibnemaja.urdu = "حضرتابو بکر ہ (نفیع بن حا رث ثقفی) ؓ سے روا یت ہے رسول اللہ ﷺ نے فر ما یا زیا دتی اور قطع رحمی سے بڑھ کر کو ئی گنا ہ ایسا نہیں جس کی سزا اللہ تعا لی دنیا میں بھی جلدی دے دیتا ہے جب کہ اس کے سا تھ اس کے لئے آ خر ت کا عذا ب بھی سنھبا ل رکھتا ہے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;