var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا صَالِحُ بْنُ مُوسَى عَنْ مُعَاوِيَةَ بْنِ إِسْحَقَ عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْرَعُ الْخَيْرِ ثَوَابًا الْبِرُّ وَصِلَةُ الرَّحِمِ وَأَسْرَعُ الشَّرِّ عُقُوبَةً الْبَغْيُ وَقَطِيعَةُ الرَّحِمِ";
ibnemaja.urdu = "ام المو مینن حضرت عا ئشہ سے روایت ہے رسول اللہ ﷺ نے فر ما یا سب سے جلدی ثوا ب نیکی اور صلہ رحمی (رشتہ داروں سے حسن سلوک) کا ملتا ہے اور (اسی طرح) سب سے جلدی سزا زیا دتی اور قطع رحمی (رشتہ داروں سے بد سلوکی) کی ملتی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>صالح بن موسی الطلحي: متروک`;
ibnemaja.anwaar = [529,1];