var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدٍ الْمَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ دَاوُدَ بْنِ قَيْسٍ عَنْ أَبِي سَعِيدٍ مَوْلَى بَنِي عَامِرٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَسْبُ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ";
ibnemaja.urdu = "حضرت ابو ہر یرہؓ سے روایت ہے رسول اللہ ﷺ نے فر ما یا انسا ن کے لئے اتنی برا ئی کا فی ہے کہ وہ اپنے مسلمان بھا ئی کی تحقیر کر ے (یا اسے حقیر جا نے)";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;