var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سِنَانِ بْنِ سَعْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا وَلَا يَبْغِي بَعْضُكُمْ عَلَى بَعْضٍ";
ibnemaja.urdu = "حضرت ا نس بن ما لک ؓ سے روا یت ہے۔رسو ل اللہ ﷺ نے فر ما یا اللہ تعا لی نے مجھ پر وحی نا زل کی ہے تو ا ضح اختیا ر کر و اور کو ئی کسی پر زیا دتی نہ کر ے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;