var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ رُمْحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ الْمَاضِي بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ سُلَيْمَانَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَقْلَ كَالتَّدْبِيرِ وَلَا وَرَعَ كَالْكَفِّ وَلَا حَسَبَ كَحُسْنِ الْخُلُقِ";
ibnemaja.urdu = "حضرت ابوذر سے روا یت ہے رسول اللہ ﷺ نے فر ما یا تدبیر جیسی کو ئی عقل مندی نہیں (حرا م وغیرہ سے)پر ہیز جیسا کو ئی تقوی نہیں حسن خلق جیسا کو ئی حسب نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الماضي بن محمد الغافقي: ضعیف وشیخہ علي بن سلیمان: مجہول (تقریب: 6423،4740) <br>وللحدیث شواہد ضعیفۃ جدًا`;
ibnemaja.anwaar = [529,1];