var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا سَلَّامُ بْنُ أَبِي مُطِيعٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَسَبُ الْمَالُ وَالْكَرَمُ التَّقْوَى";
ibnemaja.urdu = "حضرت سمرہ بن جندبؓ سے روا یت ہے رسول اللہ ﷺ نے فر ما یا حسب ما ل ہے اور شر ف تقوی ہے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3271)`;
ibnemaja.anwaar = [529,2];