var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا خَالِي يَعْلَى عَنْ سُفْيَانَ عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ الْوُضُوءِ فَأَرَاهُ ثَلَاثًا ثَلَاثًا ثُمَّ قَالَ هَذَا الْوُضُوءُ فَمَنْ زَادَ عَلَى هَذَا فَقَدْ أَسَاءَ و تَعَدَّى أَوْ ظَلَمَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: ایک اعرابی نبی ﷺ کی خدمت میں حاضر ہوا اور آپ سے وضو کے بارے میں سوال کیا۔آپ ﷺ نے اسے تین تین بار (اعضاء دھو کر) وضو کر کے دکھایا،پھر فرمایا:’’وضو یہ ہوتا ہے،جس نے اس پر اضافہ کیا،اس نے برا کیا،حد سے تجاوز کیا اور ظلم کیا";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;