var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ لَهُ الرَّجُلُ يَعْمَلُ الْعَمَلَ لِلَّهِ فَيُحِبُّهُ النَّاسُ عَلَيْهِ قَالَ ذَلِكَ عَاجِلُ بُشْرَى الْمُؤْمِنِ";
ibnemaja.urdu = "حضرت ابو ذر ؓ سے روا یت ہے انھو ں نےفر ما یا میں نبی سے عرض کیا اللہ کے رسول ایک آ دمی اللہ کی رضا کے لئے (خلوص کے سا تھ) نیک عمل کر تا ہے۔اس کی وجہ سے لو گ اس سے محبت کر تے ہیں نبی نے فر ما یا۔یہ مو من کو جلدی مل جا نے والی خو شخبری ہے";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;