var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا سَعِيدُ بْنُ سِنَانٍ أَبُو سِنَانٍ الشَّيْبَانِيُّ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي أَعْمَلُ الْعَمَلَ فَيُطَّلَعُ عَلَيْهِ فَيُعْجِبُنِي قَالَ لَكَ أَجْرَانِ أَجْرُ السِّرِّ وَأَجْرُ الْعَلَانِيَةِ";
ibnemaja.urdu = "حضرت ابو ہر یرہؓ سے رو ایت ہے کہ ایک آدمی نے کہا اللہ کے رسو ل میں ایک عمل کر تا ہو ں (میرا ارادہ اسے ظا ہر کر نے کا نہیں ہو تا لیکن)لو گو ں کو اس کا پتہ چل جا تا ہے تو مجھے اچھا لگتا ہے۔رسول اللہ نے فر ما یا۔تجھے دو ثواب ملیں گے۔خفیہ نیکی کا ثوا ب اور علا نیہ نیکی کا ثواب۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2384)`;
ibnemaja.anwaar = [530,1];