var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ كُرَيْبًا يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَوَضَّأَ مِنْ شَنَّةٍ وُضُوءًا يُقَلِّلُهُ فَقُمْتُ فَصَنَعْتُ كَمَا صَنَعَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: میں رات کو اپنی خالہ(ام المؤمنین) سیدہ میمونہ رضی اللہ عنہ کے ہاں ٹھہرا۔(رات کو) نبی ﷺ اٹھے،آپ نے ایک مشک سے وضو کیا اور وضو بھی مختصر کیا(کم پانی استعمال کیا) میں اٹھا اور میں نے بھی ویسے ہی کای جیسے آپ ﷺ نے کیا تھا";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;