var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا ابْنُ آدَمَ وَهَذَا أَجَلُهُ عِنْدَ قَفَاهُ وَبَسَطَ يَدَهُ أَمَامَهُ ثُمَّ قَالَ وَثَمَّ أَمَلُهُ";
ibnemaja.urdu = "حضرت انس بن ما لک ؓ سے روایت ہے۔رسول اللہ ﷺ نے فر ما یا یہ ابن آدم ہے۔اور اسکی اجل ہے۔گد ی کے قریب پھر آگے کو ہا تھ بڑھا کر فر ما یا۔اور وہاں تک اس کی امیدیں ہیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;