var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ لِابْنِ آدَمَ وَادِيَيْنِ مِنْ مَالٍ لَأَحَبَّ أَنْ يَكُونَ مَعَهُمَا ثَالِثٌ وَلَا يَمْلَأُ نَفْسَهُ إِلَّا التُّرَابُ وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روا یت ہے۔رسول اللہ ﷺ نے فر ما یا اگر ابن آدم کے پا س ما ل کی دو دوا یا ں بھی بھری ہو ئیہ ہوں تو وہ چاہتا ہے۔کہ ان کے ساتھ تیسری وادی بھی ہو۔اور انسا ن کا دل صرف مٹی سے بھر تا ہے۔البتہ جو شخص تو بہ کر ے اللہ اس کی تو بہ قبو ل فر ما تا ہے";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;