var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَعْمَارُ أُمَّتِي مَا بَيْنَ السِّتِّينَ إِلَى السَّبْعِينَ وَأَقَلُّهُمْ مَنْ يَجُوزُ ذَلِكَ";
ibnemaja.urdu = "حضرت ابو ہر یر ہ ؓ سے روا یت ہے۔رسول اللہ ﷺ نے فر ما یا میری امت کی عمریں ساٹھ اور ستر سا ل کے درمیا ن ہوں گی اس سے آگے بڑھنے والے کم ہو ں گے";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;