var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ وَالَّذِي ذَهَبَ بِنَفْسِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَاتَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ وَهُوَ جَالِسٌ وَكَانَ أَحَبَّ الْأَعْمَالِ إِلَيْهِ الْعَمَلُ الصَّالِحُ الَّذِي يَدُومُ عَلَيْهِ الْعَبْدُ وَإِنْ كَانَ يَسِيرًا";
ibnemaja.urdu = "ام المو منین حضرت ام سلمہ ؓ سے روایت ہے انھو ں نے فر ما یا قسم ہے اس (اللہ) کی جو آپ ﷺ کو(دنیا سے) لے گیا اور آ پ جب فو ت ہو ئے تو آپ زیا دہ نما ز (تحجد) بیٹھ کر ادافر تے تھے اور آپ ﷺ کے نز دیک زیا دہ پسندیدہ عمل وہ نیک عمل تھا جس پر ہمیشگی کر ے اگر چہ تھوڑ ا ہو";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;