var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ مُحَمَّدِ بْنِ الْفَضْلِ عَنْ أَبِيهِ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَتَوَضَّأُ فَقَالَ لَا تُسْرِفْ لَا تُسْرِفْ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے ایک شخص کو وضو کرتے دیکھا تو فرمایا:’’فضول خرچی نہ کرو،فضول خرچی نہ کرو";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع <br>قال البوصیري: ’’ ھذا إسناد ضعیف،الفضل بن عطیۃ ضعیف وابنہ کذاب وبقیۃ مدلس ‘‘ محمد بن الفضل کذاب <br>والفضل بن عطیۃ: صدوق وثقہ الجمھور۔و بقیۃ`;
ibnemaja.anwaar = [393,1];