var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْأَعْرَجُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْلَفُوا مِنْ الْعَمَلِ مَا تُطِيقُونَ فَإِنَّ خَيْرَ الْعَمَلِ أَدْوَمُهُ وَإِنْ قَلَّ";
ibnemaja.urdu = "حضرت ابو ہر یرہ ؓ سے روا یت ہے رسول اللہ ﷺ نے فر مایا اتنے عمل کا بو جھ اٹھا ئو جتنے کی تمھیں طا قت ہو کیو نکہ بہتر ین عمل وہ ہے جس پر زیا دہ پا بندی کی جا ئے اگر چہ تھو ڑا ہو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;