var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِي سَعِيدُ بْنُ مُسْلِمِ بْنِ بَانَكَ سَمِعْتُ عَامِرَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ يَقُولُ حَدَّثَنِي عَوْفُ بْنُ الْحَارِثِ عَنْ عَائِشَةَ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَائِشَةُ إِيَّاكِ وَمُحَقَّرَاتِ الْأَعْمَالِ فَإِنَّ لَهَا مِنْ اللَّهِ طَالِبًا";
ibnemaja.urdu = "ام المو منین حضرت عائشہ ؓ سے روایت ہے انھو ں نے فر ما یا رسول اللہ ﷺ نے مجھ سے فر ما یا۔اے عا ئشہ معمولی سمجھے جا نے والے گنا ہو ں سے بچنا اللہ کے ہا ں ان کا بھی مؤا خذہ ہو گا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;