var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ أَبِيهِ وَعَمِّهِ عَنْ جَدِّهِ عَنْ أَبِي هُرَيْرَةَ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَكْثَرُ مَا يُدْخِلُ الْجَنَّةَ قَالَ التَّقْوَى وَحُسْنُ الْخُلُقِ وَسُئِلَ مَا أَكْثَرُ مَا يُدْخِلُ النَّارَ قَالَ الْأَجْوَفَانِ الْفَمُ وَالْفَرْجُ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روا یت ہے انھو ں نے فرما یا نبی ﷺ سے سوال کیا گیا۔کو ن سا عمل سب سے زیا دہ (لو گو ں کو)جنت میں داخل کر ے گا۔آ پ نے فر ما یا۔تقوی اور خوش اخلاقی سوال کیا گیا۔کون سی چیز سب سے زیا دہ (لو گو ں کو) جہنم میں لے جا ئے گی۔فر ما یا دو کھو کھلی چیزیں۔منہ اور شر م گا ہ۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;