var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا وَرْقَاءُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَفْرَحُ بِتَوْبَةِ أَحَدِكُمْ مِنْهُ بِضَالَّتِهِ إِذَا وَجَدَهَا";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روا یت ہے نبی ﷺ نے فر ما یا اللہ تعا لی تمھا ری تو بہ سے اس سے زیا دہ خو ش ہو تا ہے۔جتنا کو ئی اپنی گم شدہ سوا ری پا کر خو ش ہو تاہے۔";
ibnemaja.hukam = "إسنادہ صحیح، صحیح مسلم";
ibnemaja.description = ``;