var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ الْمَدِينِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَخْطَأْتُمْ حَتَّى تَبْلُغَ خَطَايَاكُمْ السَّمَاءَ ثُمَّ تُبْتُمْ لَتَابَ عَلَيْكُمْ";
ibnemaja.urdu = "ابو ہر یرہ ؓ سے روایت ہے۔نبی ﷺ اگر تم اتنی غلطیا ں کر و کہ تمھا ری غلطیاں آ سمان تک پہنچ جا ئیں۔پھر تو بہ کر و تو (پھر بھی) اللہ تمھا ری تو بہ قبو ل کر ے گا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;