var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ حُيَيِّ بْنِ عَبْدِ اللَّهِ الْمَعَافِرِيِّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِسَعْدٍ وَهُوَ يَتَوَضَّأُ فَقَالَ مَا هَذَا السَّرَفُ فَقَالَ أَفِي الْوُضُوءِ إِسْرَافٌ قَالَ نَعَمْ وَإِنْ كُنْتَ عَلَى نَهَرٍ جَارٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ سیدنا سعد رضی اللہ عنہ وضو کر رہے تھے۔رسول اللہ ﷺ پاس سے گزرے تو فرمایا:’’یہ کیا اسراف ہے؟‘‘ انہوں نے کہا: کیا وضو میں بھی اسراف ہوتا ہے؟ فرمایا:’’ہاں،اگرچہ تم بہتے دریا پر(اس کے کنارے بیٹھے)ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن لہیعۃ عنعن <br>والحدیث ضعفہ الحافظ فی التلخیص (144/1 ح 194 م) والبوصیري`;
ibnemaja.anwaar = [393,1];