var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا عَلِيُّ بْنُ مَسْعَدَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَنِي آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِينَ التَّوَّابُونَ";
ibnemaja.urdu = "حضرت انس ؓ سے روایت ہے رسول اللہ ﷺ نے فر ما یا آدم $کے سب بیٹے خطا کا ر ہیں۔اور بہترین خطا کار وہ ہیں جو کثرت سے تو بہ کر تے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2499)`;
ibnemaja.anwaar = [530,1];