var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ أَنْبَأَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ ابْنِ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر و ؓ سے روا یت ہے نبی ﷺ نے فر ما یا بے شک اللہ تعا لی اس وقت تک بندے کی تو بہ قبول فر ما تا رہتا ہے۔جب تک نزع کا عا لم طا ری نہ ہو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;