var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا مُوسَى بْنُ سَالِمٍ أَبُو جَهْضَمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِسْبَاغِ الْوُضُوءِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: ہمیں رسول اللہ ﷺ نے خوب کامل وضو کرنے کا حکم دیا";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;