var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنِي ابْنُ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ بْنِ حَبِيبٍ عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَيِّسُ مَنْ دَانَ نَفْسَهُ وَعَمِلَ لِمَا بَعْدَ الْمَوْتِ وَالْعَاجِزُ مَنْ أَتْبَعَ نَفْسَهُ هَوَاهَا ثُمَّ تَمَنَّى عَلَى اللَّهِ";
ibnemaja.urdu = "حضرت ابو یعلی رشداد بن اوس ؓ سے روا یت ہے۔رسو ل اللہ ﷺ نے فر مایا عقل مند وہ ہے جو اپنا محا سبہ کر ے اور مو ت کے بعد والی زند گی پر عمل کر ے۔اور بیو قف وہ ہے جو اپنے نفس کو خوہشا ت کے پیچھے لگا دے (نفس کی خوا ہشا ت کے مطا بق زندگی گزارتا ہے۔)اور اللہ سے (جھوٹی)امیدیں وا بستہ کرے۔(یہ کہہ کر مطمئن ہوجا ئے کہ اللہ بہت بخشنے والا ہے۔لیکن عمل ایسے کر ے جس سے اس کی رحمت کی بجا ئے اس کا غضب حا صل ہو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2459)`;
ibnemaja.anwaar = [530,1];