var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ شَيْءٌ مِنْ الْإِنْسَانِ إِلَّا يَبْلَى إِلَّا عَظْمًا وَاحِدًا وَهُوَ عَجْبُ الذَّنَبِ وَمِنْهُ يُرَكَّبُ الْخَلْقُ يَوْمَ الْقِيَامَةِ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے۔رسول اللہ ﷺ نے فر مایا انسان کی ہر چیز بو سیدہ ہو (کر مٹی میں مل) جا تی ہے۔سوائے ایک ہڈی کے وا ریڑھ کی ہڈی کا آخر ی مہرہ ہے۔قیا مت کے دن اسی سے تخلیق شرو ع ہو گی۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;