var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ أَنْبَأَنَا مَالِكُ بْنُ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ الْأَنْصَارِيِّ أَنَّهُ أَخْبَرَهُ أَنَّ أَبَاهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا نَسَمَةُ الْمُؤْمِنِ طَائِرٌ يَعْلُقُ فِي شَجَرِ الْجَنَّةِ حَتَّى يَرْجِعَ إِلَى جَسَدِهِ يَوْمَ يُبْعَثُ";
ibnemaja.urdu = "حضرت عبدالرحمٰن بن کعب انصا ری رحمہ اللہ اپنے والد حضرت کعب بن ما لک انصا ری سے روایت کرتے ہیں رسول اللہ ﷺ نے فر ما یا مو من کی جا ن ایک پر ند ے کی صو رت میں جنت کے درختو ں سے (پھل ) کھا تی ہے حتی کہ اٹھنے کے دن (قیا مت کو) دوبا رہ اپنے جسم میں چلی جا ئے گی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;