var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ حَفْصٍ الْأُبُلِّيُّ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ الْمَيِّتُ الْقَبْرَ مُثِّلَتْ الشَّمْسُ عِنْدَ غُرُوبِهَا فَيَجْلِسُ يَمْسَحُ عَيْنَيْهِ وَيَقُولُ دَعُونِي أُصَلِّي";
ibnemaja.urdu = "حضرت جا بر ؓ سے روایت ہے۔نبیﷺ نے فر مایا جب میت قبر میں پہنچتی ہے۔تو اسے سورج ڈوبتا نظر آ تا ہے۔وہ آ نکھیں ملتا ہو ا اٹھا بیٹھتا ہے۔اور کہتا ہے۔مجھے چھوڑو نماز پڑ ھ لینے دو۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سلیمان الأعمش عنعن <br>و للحدیث شواھد عند ابن حبان (781) و الحاکم (379/1۔380) وغیرھما دون قولہ: ’’ یمسح عینیہ ‘‘ فھو ضعیف`;
ibnemaja.anwaar = [530,2];