var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ حَجَّاجٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ صَاحِبَيْ الصُّورِ بِأَيْدِيهِمَا أَوْ فِي أَيْدِيهِمَا قَرْنَانِ يُلَاحِظَانِ النَّظَرَ مَتَى يُؤْمَرَانِ";
ibnemaja.urdu = "حضرت ابو سعید ؓ سے روایت ہے۔نبی ﷺ نے فر ما یا۔صور پھو نکنے والے دونو ں فرشتوں میں نر سنگے (بگل) ہیں وہ نظر اٹھا اٹھا کر دیکھتے ہیں کہ کب انھیں (پھو نک ما رنے کا) حکم دیا جا ئے گا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>حجاج بن أرطاۃ و عطیۃ العوفي: ضعیفان`;
ibnemaja.anwaar = [531,1];