var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ عَلِيِّ بْنِ عَلِيِّ بْنِ رِفَاعَةَ عَنْ الْحَسَنِ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْرَضُ النَّاسُ يَوْمَ الْقِيَامَةِ ثَلَاثَ عَرَضَاتٍ فَأَمَّا عَرْضَتَانِ فَجِدَالٌ وَمَعَاذِيرُ وَأَمَّا الثَّالِثَةُ فَعِنْدَ ذَلِكَ تَطِيرُ الصُّحُفُ فِي الْأَيْدِي فَآخِذٌ بِيَمِينِهِ وَآخِذٌ بِشِمَالِهِ";
ibnemaja.urdu = "حضرت ابو موسی اشعری ؓ سے روایت ہے،رسول اللہ ﷺ نے فر مایا قیا مت کے دن لو گو ں کی تین پیشیاں ہوں گی۔دو پیشیوں میں تو بحث مباحثہ بھی ہو گا۔اور معذرتیں بھی پیش کی جا ئیں گی۔تیسری پیشی میں اعمال نا مے اڑ کر ہا تھوں میں آ جا ئیں گے۔کو ئی اسے اپنے دائیں ہاتھ میں لے گا۔اور کو ئی با ئیں ہا تھ میں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الحسن عنعن <br>وللحدیث لون آخر عند الترمذي (2425)`;
ibnemaja.anwaar = [531,1];