var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ وَأَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ قَالَ يَقُومُ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے۔کہ نبی ﷺ نے اس آیت کی تلاوت فر ما ئی (آیت) جس دن لوگ رب العا لمین کے سا منے کھڑے ہو گے۔اور فر مایا آ دمی آدھے کا نو ں تک اپنے پسینے میں کھڑا ہو گا۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;