var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ فَأَيْنَ تَكُونُ النَّاسُ يَوْمَئِذٍ قَالَ عَلَى الصِّرَاطِ";
ibnemaja.urdu = "حضرت عائشہ ؓ سے روایت ہے انھوں نے فرما یا میں نے رسول اللہ ﷺ سے دریا فت کیا کہ اللہ تعا لی فر ما تا ہے۔(آیت) جس دن یہ زمین کسی اور زمین سے بدل دی جا ئےگی۔اور آ سمان بھی اس وقت انسا ن کہاں ہوں گے،فرما یا پل صراط پر۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;