var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا سُفْيَانُ بْنُ حَمْزَةَ عَنْ كَثِيرِ بْنِ زَيْدٍ عَنْ الْوَلِيدِ بْنِ رَبَاحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَفَّارَاتُ الْخَطَايَا إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ وَإِعْمَالُ الْأَقْدَامِ إِلَى الْمَسَاجِدِ وَانْتِظَارُ الصَّلَاةِ بَعْدَ الصَّلَاةِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے فرمایا:’’غلطیوں کے کفارے یہ ہیں: اس وقت کامل وضو کرنا جب دل نہ چاہتا ہو،اور مسجدوں کی طرف (چلنے کے لئے) پاؤں کام میں لانا اور نماز کے بعد نماز کا انتظار کرنا";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;