var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرِدُونَ عَلَيَّ غُرًّا مُحَجَّلِينَ مِنْ الْوُضُوءِ سِيمَاءُ أُمَّتِي لَيْسَ لِأَحَدٍ غَيْرِهَا";
ibnemaja.urdu = "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا قیامت کے دن تم میرے پاس (حوض پر) آئو گے۔تو وضو کی وجہ سے تمہارے چہرے اور ہاتھ پائوں چمکتے ہوں گے۔یہ میری امت کی علامت ہے۔جو کسی اور امت کو حاصل نہیں";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;