var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدِ بْنِ النَّحَّاسِ الرَّمْلِيُّ وَأَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ قَالَا حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ عَنْ ابْنِ شَوْذَبٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُكْمِلُ يَوْمَ الْقِيَامَةِ سَبْعِينَ أُمَّةً نَحْنُ آخِرُهَا وَخَيْرُهَا";
ibnemaja.urdu = "حضرت بہز بن حکیم اپنے والد سے اور وہ ان کے دادا (حضرت معاویہ بن حیدہ قشیری رضی للہ تعالیٰ عنہ) سے روایت کرتے ہیں رسول اللہ ﷺ نے فرمایا:قیامت کے دن ہمارے سمیت ستر قومیں (امتیں) ہوں گی۔ہم ان میں سے سب سے آخری اور سب سے افضل (امت) ہوں گے";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;