var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّكُمْ وَفَّيْتُمْ سَبْعِينَ أُمَّةً أَنْتُمْ خَيْرُهَا وَأَكْرَمُهَا عَلَى اللَّهِ";
ibnemaja.urdu = "حضرت معاویہ بن حیدہ رضی للہ تعالیٰ عنہ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا: تم نے ستر امتوں کی تعداد کو پورا کیا ہے۔ان میں سے تم سب سے افضل اور اللہ کے ہاں معزز ہو۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;