var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِسْحَقَ الْجَوْهَرِيُّ حَدَّثَنَا حُسَيْنُ بْنُ حَفْصٍ الْأَصْبَهَانِيُّ حَدَّثَنَا سُفْيَانُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَهْلُ الْجَنَّةِ عِشْرُونَ وَمِائَةُ صَفٍّ ثَمَانُونَ مِنْ هَذِهِ الْأُمَّةِ وَأَرْبَعُونَ مِنْ سَائِرِ الْأُمَمِ";
ibnemaja.urdu = "حضرت بریدہ بن حصیب اسلمی رضی للہ تعالیٰ عنہ سے روایت ہے نبی کریم ﷺ نے فرمایا (میدان محشر میں) اہل جنت کی ایک سو بیس صفیں ہوں گی۔ان میں سے اسی (80) اس امت کی ہوں گی اور چالیس صفیں باقی تمام امتوں کی";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;