var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْكَرِيمِ أَبِي أُمَيَّةَ عَنْ حَسَّانَ بْنِ بِلَالٍ عَنْ عَمَّارِ بْنِ يَاسِرٍ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ حَسَّانَ بْنِ بِلَالٍ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَلِّلُ لِحْيَتَهُ";
ibnemaja.urdu = "سیدنا عمار بن یاسر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کو داڑھی مبارک کا خلال کرتے دیکھا";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;