var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو سَلَمَةَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سَعِيدِ بْنِ إِيَاسٍ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَحْنُ آخِرُ الْأُمَمِ وَأَوَّلُ مَنْ يُحَاسَبُ يُقَالُ أَيْنَ الْأُمَّةُ الْأُمِّيَّةُ وَنَبِيُّهَا فَنَحْنُ الْآخِرُونَ الْأَوَّلُونَ";
ibnemaja.urdu = "حضرت عبد اللہ بن عباس رضی للہ تعالیٰ عنہ سے روایت ہے۔نبی کریم ﷺ نے فرمایا: ہم آخری امت ہیں۔اور ہمارا حساب سب سے پہلے ہوگا۔کہا جائے گا۔کہاں ہے اُمی امت اور ان کا نبی؟تو ہم بعد میں آنے والے (جنت میں داخلے کے لہاظ سے) سب سے مقدم ہیں";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;