var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ أَبِي الْمُسَاوِرِ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَمَعَ اللَّهُ الْخَلَائِقَ يَوْمَ الْقِيَامَةِ أُذِنَ لِأُمَّةِ مُحَمَّدٍ فِي السُّجُودِ فَيَسْجُدُونَ لَهُ طَوِيلًا ثُمَّ يُقَالُ ارْفَعُوا رُءُوسَكُمْ قَدْ جَعَلْنَا عِدَّتَكُمْ فِدَاءَكُمْ مِنْ النَّارِ";
ibnemaja.urdu = "حضرت ابو موسیٰ اشعری رضی للہ تعالیٰ عنہ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا: قیامت کے دن جب اللہ تعالیٰ تمام مخلوقات کوجمع فرمالےگا۔تو حضرت محمد ﷺ کی اُمت کو سجدہ کرنے کی اجازت دی جائےگی۔وہ اللہ کو طویل سجدہ کریں گے پھر کہاجائے گا۔اپنے سر اُٹھائو ہم نے تمہاری تعداد کے مطابق جہنمیوں کو تمہارا فدیہ بنادیا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جبارۃ وعبدالأعلی: مجروحان <br>وحدیث مسلم (2767) یُغني عنہ`;
ibnemaja.anwaar = [531,1];