var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذِهِ الْأُمَّةَ مَرْحُومَةٌ عَذَابُهَا بِأَيْدِيهَا فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ دُفِعَ إِلَى كُلِّ رَجُلٍ مِنْ الْمُسْلِمِينَ رَجُلٌ مِنْ الْمُشْرِكِينَ فَيُقَالُ هَذَا فِدَاؤُكَ مِنْ النَّارِ";
ibnemaja.urdu = "حضرت انس بن مالک رضی للہ تعالیٰ عنہ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا: اس اُمت پر رحمت نازل کی گئی ہے۔اس پر عذاب خود اس کے ہاتھ سے آئے گا۔جب قیامت کا دن ہوگا تو ہر مسلمان کو ایک مشرک دی جائے گا۔اور کہا جائے گا۔یہ جہنم سے بچائو کےلئے تیرا فدیہ ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جبارۃ وکثیر بن سلیم: مجروحان <br>وحدیث أبي داود (4278) یغني عنہ وإسنادہ حسن`;
ibnemaja.anwaar = [531,1];