var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا خَلَقَ الْخَلْقَ كَتَبَ بِيَدِهِ عَلَى نَفْسِهِ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي";
ibnemaja.urdu = "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا بلاشبہ اللہ عزوجل نے جب مخلوق کو پیدا فرمایا تو اپنے ہاتھ سے اپنے لئے یہ لکھ لیا (اپنے لئے یہ ضروری ٹھرا لیا) میری رحمت میرے غضب پر غالب ہوگی";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;