var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَى فِيهِ أَبَارِيقُ الذَّهَبِ وَالْفِضَّةِ كَعَدَدِ نُجُومِ السَّمَاءِذ";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے اللہ کے نبی ﷺ نے فرمایا: اس (حوض) میں آسمان کے ستاروں کی تعداد کی طرح سونے اور چاندی کے جگ ہوں گے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;