var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ فَتَعَجَّلَ كُلُّ نَبِيٍّ دَعْوَتَهُ وَإِنِّي اخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي فَهِيَ نَائِلَةٌ مَنْ مَاتَ مِنْهُمْ لَا يُشْرِكُ بِاللَّهِ شَيْئًا";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓسے روایت ہے۔رسول اللہ ﷺ نے فرمایا: ہر نبی کی ایک مقبول دعا ہوتی ہے۔اور ہر نبی نے وہ دعا جلدی(دنیا میں) مانگ لی۔میں نے اپنی دعا کو اُمت کے حق میں شفاعت کےلئے چھپا کررکھا ہوا تھا۔یہ (دعا) امت کے ہر اس شخص کو نصیب ہوگی۔جو اللہ کے ساتھ کسی چیز کو شریک نہ کرتے ہوئے فوت ہوگا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;