var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَفْصِ بْنِ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ أَبُو النَّضْرِ صَاحِبُ الْبَصْرِيِّ عَنْ يَزِيدَ الرَّقَاشِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأَ خَلَّلَ لِحْيَتَهُ وَفَرَّجَ أَصَابِعَهُ مَرَّتَيْنِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جب وضو کرتے تھے تو ریش مبارک کا خلال کرتے اور (خلال کرنے کے لئے) اپنی کھولتے،دو بار ایسا کرتے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>وقال البوصیري: ’’ ھذا إسناد ضعیف لضعف یحیی بن کثیر و شیخہ‘‘ شیخہ یزید بن أبان الرقاشي: ضعیف <br>وقال الحافظ في یحیی بن کثیر أبی النضر: ضعیف (تقریب: 7631)`;
ibnemaja.anwaar = [393,1];