var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَرْوَانَ حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عَنْبَسَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَلَّاقِ بْنِ أَبِي مُسْلِمٍ عَنْ أَبَانَ بْنِ عُثْمَانَ عَنْ عُثْمَانَ بْنِ عَفَّانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْفَعُ يَوْمَ الْقِيَامَةِ ثَلَاثَةٌ الْأَنْبِيَاءُ ثُمَّ الْعُلَمَاءُ ثُمَّ الشُّهَدَاءُ";
ibnemaja.urdu = "حضرت عثمان بن عفان ؓ سے روایت ہے رسول اللہ ﷺ نے فرمایا: قیامت کے دن تین قسم کے افراد شفاعت کریں گے پہلے انبیائے کرام۔پھر علماء پھر شہداء";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع<br>عنبسۃ: متروک <br>وعلاق: مجہول (تقریب: 5665) والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [532,1];