var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ كُنْتُ إِمَامَ النَّبِيِّينَ وَخَطِيبَهُمْ وَصَاحِبَ شَفَاعَتِهِمْ غَيْرَ فَخْرٍ";
ibnemaja.urdu = "حضرت ابی ابن کعب ؓ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا: جب قیامت کا دن ہوگا تو میں نبیوں کا امام ان کا خطیب اور ان میں سے (پہلے) شفاعت کرنے والا ہوں گا اور کوئی فخر نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (3613ب)`;
ibnemaja.anwaar = [532,1];