var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا الْحَسَنُ بْنُ ذَكْوَانَ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَخْرُجَنَّ قَوْمٌ مِنْ النَّارِ بِشَفَاعَتِي يُسَمَّوْنَ الْجَهَنَّمِيِّينَ";
ibnemaja.urdu = "حضرت عمران بن حصین ؓ سے روایت ہے نبی کریم ﷺ نے فرمایا: یقیناً کچھ لوگ میری شفاعت کی وجہ سے جہنم سے نکلیں گے انھیں جہنمی کہا جائے گا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;