var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَيَعْلَى قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ نُفَيْعٍ أَبِي دَاوُدَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ نَارَكُمْ هَذِهِ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ وَلَوْلَا أَنَّهَا أُطْفِئَتْ بِالْمَاءِ مَرَّتَيْنِ مَا انْتَفَعْتُمْ بِهَا وَإِنَّهَا لَتَدْعُو اللَّهَ عَزَّ وَجَلَّ أَنْ لَا يُعِيدَهَا فِيهَا";
ibnemaja.urdu = "حضرت انس بن مالک ؓ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا تمہاری یہ آگ جہنم کی آگ کےستر حصوں میں سے ایک حصہ ہے۔اور اگر اسے دوبارہ پانی کے ساتھ بجھایا نہ گیا ہوتا تو تم اس سے فائدہ نہ اٹھا سکتے اور یہ (دنیا کی آگ) اللہ سے دعا کرتی ہے کہ اسے دوبارہ جہنم میں نہ بھیجاجائے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>نفیع: متروک <br>ولہ متابعۃ مردودۃ عند الحاکم (593/4) وحدیث البخاري (3265) و مسلم (2843) یُغني عنہ`;
ibnemaja.anwaar = [532,1];