var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ قَيْسٍ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأَ عَرَكَ عَارِضَيْهِ بَعْضَ الْعَرْكِ ثُمَّ شَبَكَ لِحْيَتَهُ بِأَصَابِعِهِ مِنْ تَحْتِهَا";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جب وضو کرتے تھے تو رخساروں کے بالوں کو تھوڑا سا ملتے تھے۔پھر داڑھی میں نیچے کی طرف انگلیاں ڈال کر خلال کرتے تھے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبدالواحد بن قیس: ضعیف یعتبر بہ فی المتابعات والشواہد (التحریر: 4248) وضعفہ الجمہور`;
ibnemaja.anwaar = [393,1];