var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا شَرِيكٌ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُوقِدَتْ النَّارُ أَلْفَ سَنَةٍ فَابْيَضَّتْ ثُمَّ أُوقِدَتْ أَلْفَ سَنَةٍ فَاحْمَرَّتْ ثُمَّ أُوقِدَتْ أَلْفَ سَنَةٍ فَاسْوَدَّتْ فَهِيَ سَوْدَاءُ كَاللَّيْلِ الْمُظْلِمِ";
ibnemaja.urdu = "حضرت ابو ہریرۃ ؓ سے روایت ہے۔نبی کریمﷺ نے فرمایا: جہنم(کی آگ) ایک ہزار سال تک دہقائی گئی تو وہ سفید ہوگئی پھر ہزار سال تک دہقائی گئی تو وہ سرخ ہوگئی پھر ہزار سال تک دہکائی گئی تو سیاہ ہوگئی (اب) وہ تاریک رات کی طرح سیاہ ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (2591)`;
ibnemaja.anwaar = [532,1];