var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عِيسَى بْنُ الْمُخْتَارِ عَنْ مُحَمَّدِ بْنِ أَبِي لَيْلَى عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْكَافِرَ لَيَعْظُمُ حَتَّى إِنَّ ضِرْسَهُ لَأَعْظَمُ مِنْ أُحُدٍ وَفَضِيلَةُ جَسَدِهِ عَلَى ضِرْسِهِ كَفَضِيلَةِ جَسَدِ أَحَدِكُمْ عَلَى ضِرْسِهِ";
ibnemaja.urdu = "حضرت ابو سعید خدری ؓ سے روایت ہے نبی کریمﷺ نے فرمایا: کافر (جہنم میں جسمانی طور پر)بہت بڑا ہوجائے گا حتیٰ کہ اس کی ڈاڑھ احد پہاڑ سے بھی بڑی ہوجائےگی۔اور اس کا جسم اس کی ڈاڑھ سے اتنا ہی بڑا ہوگا۔جتنا(دنیا میں) کسی کا جسم اس کی ڈاڑھ سے بڑا ہوتا ہے";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ابن أبي لیلٰی وعطیۃ العوفي: ضعیفان <br>ولأصل الحدیث شواہد عند مسلم (2408) وأحمد 367/4) وغیرہما بغیر ھذا المتن`;
ibnemaja.anwaar = [532,1];