var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَأْكُلُ النَّارُ ابْنَ آدَمَ إِلَّا أَثَرَ السُّجُودِ حَرَّمَ اللَّهُ عَلَى النَّارِ أَنْ تَأْكُلَ أَثَرَ السُّجُودِ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے۔نبی کریمﷺ نے فرمایا ؛ آگ آدم علیہ السلام کے بیٹے کو کھا جائےگی۔سوائے سجدوں کے نشان کے۔اللہ تعالیٰ نے آگ پر سجدے کا نشان کھانا حرام فرمادیا ہے۔";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;