var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ حَجَّاجٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَشِبْرٌ فِي الْجَنَّةِ خَيْرٌ مِنْ الْأَرْضِ وَمَا عَلَيْهَا الدُّنْيَا وَمَا فِيهَا";
ibnemaja.urdu = "حضرت ابو سعید خدری ؓ سے روایت ہے نبی کریمﷺ نے فرمایا: جنت کی بالشت بھر جگہ دنیا سے اور اس میں جو کچھ ہے اس سب سے بہتر ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>فیہ علل منہا ضعف عطیۃ العوفي وتدلیسہ`;
ibnemaja.anwaar = [532,1];