var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ الْكِلَابِيُّ حَدَّثَنَا وَاصِلُ بْنُ السَّائِبِ الرَّقَاشِيُّ عَنْ أَبِي سَوْرَةَ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَخَلَّلَ لِحْيَتَهُ";
ibnemaja.urdu = "سیدنا ابو ایوب انصاری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا کہ آپ نے وضو کیا تو داڑھی مبارک کا خلال کیا";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;