var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عُمَرَ الضَّرِيرُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍ لَا يَقْطَعُهَا وَاقْرَءُوا إِنْ شِئْتُمْ وَظِلٍّ مَمْدُودٍ(الواقعۃ:30)";
ibnemaja.urdu = "حضرت ابو ہریرۃ ؓسے روایت ہے۔رسول اللہﷺ نے فرمایا: جنت میں ایک درخت ہے۔جس کے سائے میں ایک سوار سو سال تک چلتا رہے گا۔تب بھی سایہ ختم نہیں ہوگا۔چاہو تو یہ آیت پڑھ لو (وَظِلٍّ مَّمْدُودٍ) اور لمبے لمبے سایوں میں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;