var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ عَامِرٍ الْأَحْوَلِ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُ إِذَا اشْتَهَى الْوَلَدَ فِي الْجَنَّةِ كَانَ حَمْلُهُ وَوَضْعُهُ فِي سَاعَةٍ وَاحِدَةٍ كَمَا يَشْتَهِي";
ibnemaja.urdu = "حضرت ابو سعید خدری ؓ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا: مومن کو جنت میں جب بچے کی خواہش ہوگی تو اس کی خواہش کے مطابق ایک گھڑی میں (فورا) حمل ولادت اور اس بچے کا بڑا ہونا (سب کچھ) ہوجائے گا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;