var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَحْمَدُ بْنُ سِنَانٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا لَهُ مَنْزِلَانِ مَنْزِلٌ فِي الْجَنَّةِ وَمَنْزِلٌ فِي النَّارِ فَإِذَا مَاتَ فَدَخَلَ النَّارَ وَرِثَ أَهْلُ الْجَنَّةِ مَنْزِلَهُ فَذَلِكَ قَوْلُهُ تَعَالَى أُولَئِكَ هُمْ الْوَارِثُونَ";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے۔رسول اللہ ﷺ نے فرمایا: تم میں سے ہر ایک کے دو گھر ہیں:ایک گھر جنت میں اورایک گھر جہنم میں۔جب کوئی شخص فوت ہوکرجہنم میں جاتا ہے۔تو اس کا گھروراثت میں جنت والوں کو مل جاتا ہے۔اللہ تعالیٰ کے س فرمان کا یہی مطلب ہے۔:(أُولَـٰئِکَ ہُمُ الْوَارِثُونَ) یہی لوگ وراثت پانے والے ہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سلیمان الأعمش عنعن <br>و حدیث البخاري (6569،1379) مسلم (2866) یغني عنہ`;
ibnemaja.anwaar = [533,1];