var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ قَالَتْ تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَسَحَ رَأْسَهُ مَرَّتَيْنِ";
ibnemaja.urdu = "سیدنا ربیع بنت معوذ ابن عفراء رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے وضو کیا تو دوبار سر کا مسح کیا";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (126) ترمذي (33)`;
ibnemaja.anwaar = [393,2];