var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ أُذُنَيْهِ دَاخِلَهُمَا بِالسَّبَّابَتَيْنِ وَخَالَفَ إِبْهَامَيْهِ إِلَى ظَاهِرِ أُذُنَيْهِ فَمَسَحَ ظَاهِرَهُمَا وَبَاطِنَهُمَا";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے(وضو کے دوران میں) کانوں کا مسح کیا۔ان کی اندرونی طرف کا مسح شہادت کی انگلیوں سے کیا اور انگوٹھے کانوں کے باہر کی طرف لے آئے پھر ان کا باہر اور اندر سے مسح کیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;