var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ الْمِسْمَعِيُّ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو عَنْ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَوَعَظَنَا مَوْعِظَةً بَلِيغَةً فَذَكَرَ نَحْوَهُ";
ibnemaja.urdu = "حضرت عرباض بن ساریہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے ہمیں صبح کی نماز پڑھائی،پھر چہرہٴ مبارک ہماری طرف پھیرلیا اور ایک پر تاثیر وعظ فرمایا۔۔۔اس کے بعد راوی نے پوری حدیث بیان کی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;