var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ قَالَتْ تَوَضَّأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَدْخَلَ إِصْبَعَيْهِ فِي جُحْرَيْ أُذُنَيْهِ";
ibnemaja.urdu = "سیدنا ربیع بنت معوذ ابن عفرا رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے وضو کیا تو اپنے کانوں کے سوراخوں میں انگلیاں داخل کیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (129) ترمذي (34)`;
ibnemaja.anwaar = [394,1];