var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ سِنَانِ بْنِ رَبِيعَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَبِي أُمَامَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأُذُنَانِ مِنْ الرَّأْسِ وَكَانَ يَمْسَحُ رَأْسَهُ مَرَّةً وَكَانَ يَمْسَحُ الْمَأْقَيْنِ";
ibnemaja.urdu = "سیدنا ابو امامہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’کان سر میں شامل ہیں۔‘‘ اور آپ ﷺ ایک بار سر کا مسح کرتے تھے اور آنکھوں کے کونوں کا مسح کرتے تھے";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;