var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ عَنْ إِسْمَعِيلَ بْنِ كَثِيرٍ عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبْرَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْبِغْ الْوُضُوءَ وَخَلِّلْ بَيْنَ الْأَصَابِعِ";
ibnemaja.urdu = "سیدنا عاصم بن لقیط بن صبرہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا:’’کامل وضو کر اور انگلیوں میں خلال کر۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;