var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الرَّقَاشِيُّ حَدَّثَنَا مَعْمَرُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ حَدَّثَنِي أَبِي عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا تَوَضَّأَ حَرَّكَ خَاتَمَهُ";
ibnemaja.urdu = "سیدنا ابو رافع رضی اللہ عنہ سے روایت کہ رسول اللہ ﷺ جب وضو کرتے تھے تو اپنی انگوٹھی کو حرکت دیتے تھے(تاکہ اس کے نیچے بھی پانی پہنچ جائے۔)";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھذا إسناد ضعیف لضعف معمر و أبیہ ‘‘إلخ <br>معمر بن محمد بن عبید اللّٰہ بن أبي رافع: منکر الحدیث<br>وأبوہ: ضعیف (تقریب: 6816،6106) وقال الھیثمي فیہ محمد بن عبیداللہ بن أبي رافع: ضعیف عند الجمھور<br>وانظر الحدیث الآتي (732)`;
ibnemaja.anwaar = [394,1];