var ibnemaja = {};
ibnemaja.arabic = "حدثنا أبو بكر بن أبي شيبة وعلي بن محمد قالا حدثنا وكيع عن سفيان عن منصور عن هلال بن يساف عن أبي يحيى عن عبد الله بن عمرو قال رأى رسول الله صلى الله عليه وسلم قوما يتوضئون وأعقابهم تلوح فقال ويل للأعقاب من النار أسبغوا الوضوء.";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر ورضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے کچھ لوگوں کو وضو کرتے دیکھا(آپ نے دیکھا کہ جو افراد وضو کر چکے تھے) ان کی ایڑیاں چمک رہی تھیں۔(جو پاؤں اچھی طرح نہ دھونے کی وجہ سے واضح طور پر خشک نظر آرہی تھیں۔) آپ ﷺ نے فرمایا:’’ایڑیوں کے لئے آگ کا عذاب ہے،وضو اچھی طرح مکمل کرو";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;