var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي حَيَّةَ قَالَ رَأَيْتُ عَلِيًّا تَوَضَّأَ فَغَسَلَ قَدَمَيْهِ إِلَى الْكَعْبَيْنِ ثُمَّ قَالَ أَرَدْتُ أَنْ أُرِيَكُمْ طُهُورَ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "جناب ابو حیہ رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں نے سیدنا علی رضی اللہ عنہ کو دیکھا کہ انہوں نے وضو کیا تو اپنے دونوں قدم ٹخنوں تک دھوئے،پھر فرمایا: میں نے چاہا کہ تم لوگوں کو تمہارے نبی ﷺ کا وضو کا طریقہ(عملی طور پر) دکھا دوں";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;