var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَيْسَرَةَ عَنْ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَغَسَلَ رِجْلَيْهِ ثَلَاثًا ثَلَاثًا";
ibnemaja.urdu = "سیدنا مقدام بن معدیکرب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے وضو کیا تو اپنے پاؤں تین تین بار دھوئے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;