var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ جَامِعِ بْنِ شَدَّادٍ أَبِي صَخْرَةَ قَالَ سَمِعْتُ حُمْرَانَ يُحَدِّثُ أَبَا بُرْدَةَ فِي الْمَسْجِدِ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ فَالصَّلَاةُ الْمَكْتُوبَاتُ كَفَّارَاتٌ لِمَا بَيْنَهُنَّ";
ibnemaja.urdu = "سیدنا عثمان بن عفان رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے فرمایا:’’جو شخص اس طرح مکمل وضو کرتا ہے جس طرح اللہ نے حکم دیا ہے تو اس کی فرض نمازیں ان کے درمیانی اوقات کے گناہوں کا کفارہ بن جاتی ہیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;