var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا زَكَرِيَّا بْنُ أَبِي زَائِدَةَ قَالَ قَالَ مَنْصُورٌ حَدَّثَنَا مُجَاهِدٌ عَنْ الْحَكَمِ بْنِ سُفْيَانَ الثَّقَفِيِّ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثُمَّ أَخَذَ كَفًّا مِنْ مَاءٍ فَنَضَحَ بِهِ فَرْجَهُ";
ibnemaja.urdu = "سیدنا حکم بن سفیان ثقفی رضی اللہ عنہ سے روایت ہے،انہوں نے رسول ﷺ کو دیکھا کہ آپ نے وضو کیا،پھر پانی کا ایک چلو لے کر اپنے ستر پر چھڑکا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;