var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ سَلَمَةَ الْيَحْمِدِيُّ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْهَاشِمِيُّ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتَ فَانْتَضِحْ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’جب تو وضو کرے تو(شرم گاہ والے حصے کے کپڑے پر) چھینٹے مار لیا کر۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (50)`;
ibnemaja.anwaar = [394,1];