var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ أَنَّ أَبَا مُرَّةَ مَوْلَى عَقِيلٍ حَدَّثَهُ أَنَّ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ حَدَّثَتْهُ أَنَّهُ لَمَّا كَانَ عَامُ الْفَتْحِ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى غُسْلِهِ فَسَتَرَتْ عَلَيْهِ فَاطِمَةُ ثُمَّ أَخَذَ ثَوْبَهُ فَالْتَحَفَ بِهِ";
ibnemaja.urdu = "سیدہ ام ہانی بنت ابو طالب رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا:’’جس سال مکہ فتح ہوا رسول اللہ ﷺ نہانے کے پانی کی طرف گئے،سیدہ فاطمہ رضی اللہ عنہ نے رسول اللہ ﷺ کے لئے پردہ تان دیا(تو آپ ﷺ نے غسل فرمایا)،اس کے بعد آپ نے اپنا کپڑا لے کر جسم پر لپیٹ لیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;