var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ حَدَّثَنَا ابْنُ عَبَّاسٍ عَنْ خَالَتِهِ مَيْمُونَةَ قَالَتْ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَوْبٍ حِينَ اغْتَسَلَ مِنْ الْجَنَابَةِ فَرَدَّهُ وَجَعَلَ يَنْفُضُ الْمَاءَ";
ibnemaja.urdu = "سیدہ ام المؤمنین میمونہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: جب رسول اللہ ﷺ نے غسل جنابت کیا تو میں نے آپ کی خدمت میں کپڑا(تولیہ وغیرہ) پیش کیا،آپ ﷺ نے اسے واپس کر دیا اور(جسم پر سے ہاتھ کے ساتھ)پانی جھاڑنے لگے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;