var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ وَأَحْمَدُ بْنُ الْأَزْهَرِ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا يَزِيدُ بْنُ السِّمْطِ حَدَّثَنَا الْوَضِينُ بْنُ عَطَاءٍ عَنْ مَحْفُوظِ بْنِ عَلْقَمَةَ عَنْ سَلْمَانَ الْفَارِسِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَقَلَبَ جُبَّةَ صُوفٍ كَانَتْ عَلَيْهِ فَمَسَحَ بِهَا وَجْهَهُ";
ibnemaja.urdu = "سیدنا سلمان فارسی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے وضو کیا،پھر اس کے بعد جسم مبارک پر پہنا ہوا اونی جُبّہ الٹ کر اس سے چہرہٴ مبارک صاف کر لیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث الآتي (3564)<br>السند منقطع،قال البوصیري: ’’ وفي سماع محفوظ عن سلمان نظر ‘‘`;
ibnemaja.anwaar = [394,1];