var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمَاجِشُونِ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْرَجْنَا لَهُ مَاءً فِي تَوْرٍ مِنْ صُفْرٍ فَتَوَضَّأَ بِهِ";
ibnemaja.urdu = "سیدنا عبداللہ بن زید رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ہمارے ہاں تشریف لائے۔ہم نے پیتل کے ایک برتن میں پانی پیش کیا تو آپ ﷺ نے اس سے وضو کیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;