var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ جَحْشٍ أَنَّهُ كَانَ لَهَا مِخْضَبٌ مِنْ صُفْرٍ قَالَتْ فَكُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ";
ibnemaja.urdu = "سیدہ ام المومنین زیب بنت جحش رضی اللہ عنہا سے روایت ہے کہ ان کے ہاں پیتل کا ٹب ہوا کرتا تھا۔انہوں نے فرمایا: میں اس میں پانی ڈال کر رسول اللہ ﷺ کے سر مبارک میں کنگھی کیا کرتی تھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;