var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنَامُ حَتَّى يَنْفُخَ ثُمَّ يَقُومُ فَيُصَلِّي وَلَا يَتَوَضَّأُ قَالَ الطَّنَافِسِيُّ قَالَ وَكِيعٌ تَعْنِي وَهُوَ سَاجِدٌ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ سو جاتے تھے حتی کہ خراٹے لینے لگتے،پھر کھڑے ہو کر نماز پڑھتے اور وضو نہ کرتے۔\nوکیع بیان کرتے ہیں کہ ام المؤمنین کی مراد یہ ہے کہ آپ ﷺ کو بعض اوقات سجدے میں نیند آجاتی تھی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;