var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ حَجَّاجٍ عَنْ فُضَيْلِ بْنِ عَمْرٍو عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَامَ حَتَّى نَفَخَ ثُمَّ قَامَ فَصَلَّى";
ibnemaja.urdu = "سیدنا عبداللہ (بن مسعود) رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ سوگئے حتی کہ خراٹے لینے لگے،پھر اٹھ کھڑے ہوئے اور نماز پڑھ لی۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;