var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ عَنْ ابْنِ أَبِي زَائِدَةَ عَنْ حُرَيْثِ بْنِ أَبِي مَطَرٍ عَنْ يَحْيَى بْنِ عَبَّادٍ أَبِي هُبَيْرَةَ الْأَنْصَارِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ نَوْمُهُ ذَلِكَ وَهُوَ جَالِسٌ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ کی وہ نیند بیٹھے بیٹھے تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد فیہ حریث بن أبي مطر وھو ضعیف ‘‘ وھو ضعیف`;
ibnemaja.anwaar = [395,1];