var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ الْوَضِينِ بْنِ عَطَاءٍ عَنْ مَحْفُوظِ بْنِ عَلْقَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَائِذٍ الْأَزْدِيِّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَيْنُ وِكَاءُ السَّهِ فَمَنْ نَامَ فَلْيَتَوَضَّأْ";
ibnemaja.urdu = "سیدنا علی بن ابو طالب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’آنکھیں سرین کا بندھن ہیں،لہٰذا جو شخص سو جائے،اسے چاہیے کہ وضو کرے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (203)`;
ibnemaja.anwaar = [395,1];