var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ صَفْوَانَ بْنِ عَسَّالٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ لَا نَنْزِعَ خِفَافَنَا ثَلَاثَةَ أَيَّامٍ إِلَّا مِنْ جَنَابَةٍ لَكِنْ مِنْ غَائِطٍ وَبَوْلٍ وَنَوْمٍ";
ibnemaja.urdu = "سیدنا صفوان بن عسال رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ہمیں حکم دیتے تھے کہ ہم تین دن تک اپنے موزے نہ اتاریں سوائے اس کے کہ جنابت کی وجہ سے (غسل کرنا پڑے۔تب تو اتارنا ہی پڑیں گے) لیکن پیشاب،پاخانے،یا نیند کی وجہ سے(موزے اتارنے کی ضرورت نہیں۔)";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;