var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ مَرْوَانَ بْنِ الْحَكَمِ عَنْ بُسْرَةَ بِنْتِ صَفْوَانَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَسَّ أَحَدُكُمْ ذَكَرَهُ فَلْيَتَوَضَّأْ";
ibnemaja.urdu = "سیدہ بسرہ بنت صفوان رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:’’جب کوئی شخص اپنی شرم گاہ کو ہاتھ لگائے تو اسے چاہیے کہ وضو کرے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;