var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،ح وَحَدَّثَنَا حَوْثَرَةُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ،قَالَا: حَدَّثَنَا حَجَّاجُ بْنُ دِينَارٍ،عَنْ أَبِي غَالِبٍ،عَنْ أَبِي أُمَامَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا ضَلَّ قَوْمٌ بَعْدَ هُدًى كَانُوا عَلَيْهِ إِلَّا أُوتُوا الْجَدَلَ» ثُمَّ تَلَا هَذِهِ الْآيَةَ بَلْ هُمْ قَوْمٌ خَصِمُونَ [الزخرف: 58]";
ibnemaja.urdu = "حضرت ابو امامہ رضی اللہ عنہ سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا:‘‘کچھ لوگ ہدایت پر تھے،پھر اس کے بعد گمراہی اختیار کر لی تو انہیں جھگڑے ہی نصیب ہوئے۔’’پھر نبی ﷺ نے یہ آیت تلاوت فرمائی:‘‘(بل ھم قوم خصمون) بلکہ یہی لوگ جھگڑالو ہیں۔’’";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;