var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا مَعْنُ بْنُ عِيسَى ح و حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ جَمِيعًا عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ عُقْبَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَسَّ أَحَدُكُمْ ذَكَرَهُ فَعَلَيْهِ الْوُضُوءُ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جب کوئی شخص اپنے عضو خاص کو ہاتھ لگائے تو اس پر لازم ہے کہ وضو کرے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;