var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْمُعَلَّى بْنُ مَنْصُورٍ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ بَشِيرِ بْنِ ذَكْوَانَ الدِّمَشْقِيُّ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ حَدَّثَنَا الْعَلَاءُ بْنُ الْحَارِثِ عَنْ مَكْحُولٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ مَسَّ فَرْجَهُ فَلْيَتَوَضَّأْ";
ibnemaja.urdu = "سیدہ ام المومنین ام حبیبہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے یہ ارشاد سنا:’’جو شخص اپنے عضو تناسل کو ہاتھ لگائے،اسے چاہیے کہ وضو کرے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;