var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ إِسْحَقَ بْنِ أَبِي فَرْوَةَ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ عَنْ أَبِي أَيُّوبَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ مَسَّ فَرْجَهُ فَلْيَتَوَضَّأْ";
ibnemaja.urdu = "سیدنا ابو ایوب رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے یہ ارشاد سنا:’’جو شخص اپنی شرم گاہ کو ہاتھ لگائے،تو اسے چاہیے کہ وضو کرے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;