var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ قَالَ سَمِعْتُ قَيْسَ بْنَ طَلْقٍ الْحَنَفِيَّ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ مَسِّ الذَّكَرِ فَقَالَ لَيْسَ فِيهِ وُضُوءٌ إِنَّمَا هُوَ مِنْكَ";
ibnemaja.urdu = "سیدنا قیس بن طلق حنفی اپنے والد(سیدنا طلق بن علی رضی اللہ عنہ) سے روایت کرتے ہیں،انہوں نے فرمایا: میں نے سنا کہ کسی نے رسول اللہ ﷺ سے عضو خاص کو ہاتھ لگانے کے بارے میں سوال کیا تو آپ ﷺ نے فرمایا: ’’اس سے وضو لازم نہیں آتا،وہ بھی تیرا ایک حصہ ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;