var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ الْقَاسِمِ عَنْ أَبِي أُمَامَةَ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مَسِّ الذَّكَرِ فَقَالَ إِنَّمَا هُوَ جِذْيَةٌ مِنْكَ";
ibnemaja.urdu = "سیدنا ابو امامہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ سے عضو خاص کو چھونے کے بارے میں سوال کیا گیا تو آپ نے فرمایا:’’وہ تو تیرے جسم کا ایک ٹکڑا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ھذا إسناد فیہ جعفر بن الزبیر وقد اتفقوا علی ترک حدیثہ واتھموہ‘‘ وقال الحافظ: متروک الحدیث وکان صالحًا في نفسہ (تقریب: 939)`;
ibnemaja.anwaar = [395,1];