var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ خَالِدٍ الْأَزْرَقُ حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ بْنِ أَبِي مَالِكٍ عَنْ أَبِيهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ يَضَعُ يَدَيْهِ عَلَى أُذُنَيْهِ وَيَقُولُ صُمَّتَا إِنْ لَمْ أَكُنْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ";
ibnemaja.urdu = "سیدنا یزید بن ابو مالک رحمہ اللہ سے روایت ہے،انہوں نے سیدنا انس بن مالک رضی اللہ عنہ سے روایت کی کہ وہ اپنے ہاتھ اپنے کانوں پر رکھ کر فرماتے تھے:(یہ کان) بہرے ہو جائیں اگر میں نے رسول اللہ ﷺ کو یہ فرماتے نہ سنا ہو:’’جس چیز کو آگ نے چھو اہو،اس کی وجہ سے وضو کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>خالد بن یزید بن أبي مالک: ضعیف (تقریب: 1688) <br>وقال الھیثمي: وضعفہ الجمھور<br>وقال البوصیري: ’’ ولم ینفرد بہ‘‘ أي بھذا الحدیث!`;
ibnemaja.anwaar = [395,1];