var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ أَكَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتِفًا ثُمَّ مَسَحَ يَدَيْهِ بِمِسْحٍ كَانَ تَحْتَهُ ثُمَّ قَامَ إِلَى الصَّلَاةِ فَصَلَّى";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے (بکری کے) شانے کا گوشت تناول فرمایا،پھر اپنے ہاتھ اس ٹاٹ سے صاف کر لیے جو آپ کے نیچے بچھا ہوا تھا،پھر آپ نماز کے لئے کھڑے ہوئے اور نماز ادا کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (189)`;
ibnemaja.anwaar = [395,1];