var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَعَمْرِو بْنِ دِينَارٍ وَعَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَكَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ خُبْزًا وَلَحْمًا وَلَمْ يَتَوَضَّئُوا";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ،ابو بکر اور عمر رضی اللہ عنہما نے روٹی گوشت کھایا اور وضو نہ کیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;