var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَتِفِ شَاةٍ فَأَكَلَ مِنْهُ وَصَلَّى وَلَمْ يَمَسَّ مَاءً";
ibnemaja.urdu = "سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کی خدمت میں بکری کے کندھے کا گوشت پیش کیا۔آپ نے اس میں سے تناول فرمایا،پھر نماز پڑھی اور پانی کو ہاتھ بھی نہ لگایا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;