var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ حَدَّثَنَا سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ كَتِفَ شَاةٍ فَمَضْمَضَ وَغَسَلَ يَدَيْهِ وَصَلَّى";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے بکری کے شانے کا گوشت تناول فرمایا،پھر کلی کی،ہاتھ دھوئے اور نماز ادا کی۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;