var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَأَبُو مُعَاوِيَةَ قَالَا حَدَّثَنَا الْأَعْمَشُ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْوُضُوءِ مِنْ لُحُومِ الْإِبِلِ فَقَالَ تَوَضَّئُوا مِنْهَا";
ibnemaja.urdu = "سیدنا براء بن عازب رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ سے اونٹ کے گوشت سے وضو کا مسئلہ دریافت کیا گیا تو آپ نے فرمایا: ’’اس سے وضو کرو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;