var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا زَائِدَةُ وَإِسْرَائِيلُ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَوَضَّأَ مِنْ لُحُومِ الْإِبِلِ وَلَا نَتَوَضَّأَ مِنْ لُحُومِ الْغَنَمِ";
ibnemaja.urdu = "سیدنا جابر بن سمر ہ رضی اللہ عنہ سے روایت ہےانہوں نے فرمایا: ہمیں رسول اللہ ﷺ نے حکم دیا کہ اونٹ کا گوشت کھا کر وضو کریں،اور بھیڑ بکری کا گوشت کھا کر وضو نہ کریں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;