var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَقَ الْهَرَوِيُّ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ حَجَّاجٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ مَوْلَى بَنِي هَاشِمٍ وَكَانَ ثِقَةً وَكَانَ الْحَكَمُ يَأْخُذُ عَنْهُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى عَنْ أُسَيْدِ بْنِ حُضَيْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَتَوَضَّئُوا مِنْ أَلْبَانِ الْغَنَمِ وَتَوَضَّئُوا مِنْ أَلْبَانِ الْإِبِلِ";
ibnemaja.urdu = "سیدنا اسید بن حضیر رضی اللہ عنہ سے روایت ہےرسول اللہ ﷺ نے فرمایا: ’’بکریوں کا دودھ پی کر وضو نہ کرو،اور اونٹیوں کا دودھ پی کر وضو کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف لضعف حجاج بن أرطاۃ وتدلیسہ،لا سیما وقد خالف غیرہ ‘‘ وحجاج بن أرطاۃ ضعیف (د 1820) <br>و الحدیث السابق (الأصل: 495) یغني عنہ`;
ibnemaja.anwaar = [395,1];