var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَضْمِضُوا مِنْ اللَّبَنِ فَإِنَّ لَهُ دَسَمًا";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’دودھ پی کر کلی کر لیا کرو کیوں کہ اس میں چکناہٹ ہوتی ہے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;