var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ مُوسَى بْنِ يَعْقُوبَ حَدَّثَنِي أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ زَمْعَةَ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَرِبْتُمْ اللَّبَنَ فَمَضْمِضُوا فَإِنَّ لَهُ دَسَمًا";
ibnemaja.urdu = "سیدہ ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’جب تم دودھ پیو تو کلی کر لیا کرو،کیوں کہ اس میں چکناہٹ ہوتی ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;