var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ الْحَنَّاطُ،عَنْ أَبِي زَيْدٍ،عَنْ أَبِي الْمُغِيرَةِ،عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَبَى اللَّهُ أَنْ يَقْبَلَ عَمَلَ صَاحِبِ بِدْعَةٍ حَتَّى يَدَعَ بِدْعَتَهُ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘اللہ تعالیٰ نے بدعتی کا عمل قبول کرنے سے انکار کر دیا ہے حتٰی کہ وہ شخص بدعت ترک کر دے۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو زید و أبو مغیرۃ: مجہولان (تقریب: 8110،8387)`;
ibnemaja.anwaar = [376,1];