var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ السَّوَّاقُ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ حَلَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاةً وَشَرِبَ مِنْ لَبَنِهَا ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ فَاهُ وَقَالَ إِنَّ لَهُ دَسَمًا";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ایک بکری دوہ کر دودھ پیا،پھر پانی منگوا کر کلی کی اور فرمایا:’’اس میں چکناہٹ ہوتی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>زمعۃ بن صالح: ضعیف وضعفہ الجمہور کما قال البوصیري`;
ibnemaja.anwaar = [395,2];