var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبَّلَ بَعْضَ نِسَائِهِ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ قُلْتُ مَا هِيَ إِلَّا أَنْتِ فَضَحِكَتْ";
ibnemaja.urdu = "جناب عروہ سیدہ عائشہ رضی اللہ عنہا سے روایت کرتے ہیں،انہوں نے فرمایا: رسول اللہ ﷺ نے اپنی ایک بیوی کا بوسہ لیا،پھر نماز کے لئے تشریف لے گئے،اور وضو نہیں کیا۔(عروہ کہتے ہیں) میں نے کہا: وہ ضرور آپ ہی ہوں گی تو آپ ہنس دیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (179) ترمذي (86)`;
ibnemaja.anwaar = [396,1];