var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ حَجَّاجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ زَيْنَبَ السَّهْمِيَّةِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ ثُمَّ يُقَبِّلُ وَيُصَلِّي وَلَا يَتَوَضَّأُ وَرُبَّمَا فَعَلَهُ بِي";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ وضو کرتے،پھر بوسہ لیتے اور (دوبارہ) وضو کیے بغیر نماز پڑھ لیتے،اور بعض اوقات آپ میرے ساتھ بھی یہ کرتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>حجاج بن أرطاۃ عنعن مع ضعفہ`;
ibnemaja.anwaar = [396,1];