var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَذْيِ فَقَالَ فِيهِ الْوُضُوءُ وَفِي الْمَنِيِّ الْغُسْلُ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ سے مذی کے متعلق سوال کیا گیا تو آپ نے فرمایا:’’اس سے وضو ہے اور منی سے غسل ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (114)`;
ibnemaja.anwaar = [396,1];