var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ الْمِقْدَادِ بْنِ الْأَسْوَدِ أَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجْلِ يَدْنُو مِنْ امْرَأَتِهِ فَلَا يُنْزِلُ قَالَ إِذَا وَجَدَ أَحَدُكُمْ ذَلِكَ فَلْيَنْضَحْ فَرْجَهُ يَعْنِي لِيَغْسِلْهُ وَيَتَوَضَّأْ";
ibnemaja.urdu = "سیدنا مقداد بن اسود رضی اللہ عنہ سے روایت ہے،کہ انہوں نے نبی ﷺ سے دریافت کیا کہ اگر مرد اپنی بیوی کے قریب جائے اور انزال نہ ہو(تو کیا حکم ہے؟) آپ ﷺ نے فرمایا:’’جب کسی کو یہ صورت حال پیش آئے تو وہ اپنی شرم گاہ پر پانی ڈال لے،یعنی استنجا کر لے اور وضو کر لے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (207) نسائي (156،441)`;
ibnemaja.anwaar = [396,1];