var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا شَرِيكٌ عَنْ عَمْرِو بْنِ عَامِرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ لِكُلِّ صَلَاةٍ وَكُنَّا نَحْنُ نُصَلِّي الصَّلَوَاتِ كُلَّهَا بِوُضُوءٍ وَاحِدٍ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ہر نماز کے لئے وضو کیا کرتے تھے،جب کہ ہم لوگ تمام نمازیں ایک وضو سے پڑھ لیا کرتےتھے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;