var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ،وَهَارُونُ بْنُ إِسْحَاقَ،قَالَا: حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،عَنْ سَلَمَةَ بْنِ وَرْدَانَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَرَكَ الْكَذِبَ وَهُوَ بَاطِلٌ،بُنِيَ لَهُ قَصْرٌ فِي رَبَضِ الْجَنَّةِ،وَمَنْ تَرَكَ الْمِرَاءَ وَهُوَ مُحِقٌّ،بُنِيَ لَهُ فِي وَسَطِهَا،وَمَنْ حَسَّنَ خُلُقَةُ،بُنِيَ لَهُ فِي أَعْلَاهَا»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘جو شخص باطل پر ہوتے ہوئے جھگڑا ترک کر دے،اس کے لئے جنت کے اطراف میں ایک محل تیار کیا جائے گا اور جو شخص حق پر ہوتے ہوئے جھگڑا ترک کر دے،اس کے لئے جنت کے وسط میں(محل) تیار کیا جائے گا اور جو شخص اپنے اخلاق اچھے کر لے،اس کے لئے (جنت کے) بلند ترین حصے میں محل تیار کیا جائے گا۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (1993)`;
ibnemaja.anwaar = [376,1];