var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ لِكُلِّ صَلَاةٍ فَلَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ صَلَّى الصَّلَوَاتِ كُلَّهَا بِوُضُوءٍ وَاحِدٍ";
ibnemaja.urdu = "سلیمان بن بریدہ رحمہ اللہ اپنے والد(بریدہ بن حصیب اسلمی رضی اللہ عنہ)سے روایت کرتے ہیں،انہوں نے فرمایا: نبی ﷺ ہر نماز کے لئے(نیا) وضو کیا کرتے تھے۔جس دن مکہ فتح ہوا اس دن آپ ﷺ نے سب نمازیں ایک ہی وضو سے ادا فرمائیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;