var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ تَوْبَةَ حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْفَضْلُ بْنُ مُبَشِّرٍ قَالَ رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يُصَلِّي الصَّلَوَاتِ بِوُضُوءٍ وَاحِدٍ فَقُلْتُ مَا هَذَا فَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ هَذَا فَأَنَا أَصْنَعُ كَمَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "جناب فضل بن مبشر رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں نے سیدنا جابر بن عبداللہ رضی اللہ عنہماکو ایک وضو سے کئی نمازیں پڑھتے دیکھا۔(جناب فضل رحمہ اللہ نے فرمایا:) میں نے کہا: آپ نے یہ کیا کیا؟ انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو اسی طرح کرتے دیکھا تھا،چنانچہ میں بھی ویسے ہی کرتا ہوں جس طرح رسول اللہ ﷺ نے کیا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،الفضل بن مبشر ضعفہ الجمھور ‘‘ <br>وقال الحافظ: فیہ لین (تقریب: 5416) <br>والحدیث السابق (الأصل: 510) یغني عنہ`;
ibnemaja.anwaar = [396,1];