var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ وَعَبَّادُ بْنُ تَمِيمٍ عَنْ عَمِّهِ قَالَ شُكِيَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلُ يَجِدُ الشَّيْءَ فِي الصَّلَاةِ فَقَالَ لَا حَتَّى يَجِدَ رِيحًا أَوْ يَسْمَعَ صَوْتًا";
ibnemaja.urdu = "جناب عباد بن تمیم رحمہ اللہ اپنے چچا سیدنا عبداللہ بن یزید بن عاصم رضی اللہ عنہ سے روایت کرتے ہیں،انہوں نے فرمایا: نبی ﷺ سے عرض کیا گیا کہ اگر کوئی آدمی نماز میں کچھ محسوس کرے(اسے شک پڑے کہ ہوا خارچ ہوئی ہے تو کیا کرے؟) تو آپ ﷺ نے فرمایا: ’’نہیں(وضو کرنے نہ جائے) حتی کہ بو محسوس کرے یا آواز سنے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;