var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا الْمُحَارِبِيُّ عَنْ مَعْمَرِ بْنِ رَاشِدٍ عَنْ الزُّهْرِيِّ أَنْبَأَنَا سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّشَبُّهِ فِي الصَّلَاةِ فَقَالَ لَا يَنْصَرِفْ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے نبی ﷺ سے نماز میں (وضو ٹوٹنےکا) شبہ پیدا ہونے کےبارے میں سوال کیا گیا تو آپ ﷺ نے فرمایا: ’’نماز چھوڑ کر نہ جائے حتی کہ آواز سنے یا بو محسوس کرے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;