var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الرَّحْمَنِ قَالُوا حَدَّثَنَا شُعْبَةُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وُضُوءَ إِلَّا مِنْ صَوْتٍ أَوْ رِيحٍ";
ibnemaja.urdu = "=سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’آواز یا بو کے بغیر وضو (دوبارہ کرنا ضروری نہیں ہوتا۔)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;