var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ وَالْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيَّانِ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا رِشْدِينُ أَنْبَأَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ رَاشِدِ بْنِ سَعْدٍ عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْمَاءَ لَا يُنَجِّسُهُ شَيْءٌ إِلَّا مَا غَلَبَ عَلَى رِيحِهِ وَطَعْمِهِ وَلَوْنِهِ";
ibnemaja.urdu = "سیدنا ابو امامہ باہلی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’پانی کو کوئی چیز ناپاک نہیں کرتی سوائے اس کے جو اس کی بو،ذائقے یا رنگ پر غالب آجائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد فیہ رشدین وھو ضعیف واختلف علیہ مع ضعفہ ‘‘ ویغني عنہ الإجماع،انظر: الإجماع لابن المنذر (ص 33 نص 11،12) رشدین: ضعیف`;
ibnemaja.anwaar = [397,1];