var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَبِيٍّ فَبَالَ عَلَيْهِ فَأَتْبَعَهُ الْمَاءَ وَلَمْ يَغْسِلْهُ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ کی خدمت میں ایک (شیر خوار) بچہ لایا گیا۔اس نے آپ ﷺ(کے کپڑوں) پر پیشاب کر دیا،آپ نے وہاں پانی چھڑک دیا اور کپڑا دھویا نہیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;