var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ قَالَتْ دَخَلْتُ بِابْنٍ لِي عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَأْكُلْ الطَّعَامَ فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَرَشَّ عَلَيْهِ";
ibnemaja.urdu = "سیدہ ام قیس بنت محصن رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں رسول اللہ ﷺ کی خدمت میں اپنا ایک (شیر خوار) بچہ لے کر حاضر ہوئی جو(ابھی کھانا نہیں کھاتا تھا۔اس نے آپ ﷺ(کے کپڑوں) پر پیشاب کر دیا تو آپ ﷺ نے پانی منگوایا اور اس پر چھڑک دیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;