var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أُمِّ كُرْزٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَوْلُ الْغُلَامِ يُنْضَحُ وَبَوْلُ الْجَارِيَةِ يُغْسَلُ";
ibnemaja.urdu = "جناب عمرو بن شعیب،ام کرز سے بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’لڑکے کے پیشاب پر پانی چھڑکا جاتا ہے اور لڑکی کا پیشاب دھویا جاتا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;