var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍ أَنَّ أَعْرَابِيًّا بَالَ فِي الْمَسْجِدِ فَوَثَبَ إِلَيْهِ بَعْضُ الْقَوْمِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُزْرِمُوهُ ثُمَّ دَعَا بِدَلْوٍ مِنْ مَاءٍ فَصَبَّ عَلَيْهِ";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک بدو نے مسجد میں پیشاب کر دیا۔کچھ لوگ (اسے روکنے کے لئے) اس کی طرف بھاگے۔رسول اللہ ﷺ نے فرمایا:’’اس کا پیشاب بند نہ کرو۔‘‘ پھر پانی کا ایک ڈول منگوایا اور اس پر بہا دیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;