var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ،عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ قَالَ: حَدَّثَنِي أَبُو هَانِئٍ حُمَيْدُ بْنُ هَانِئٍ الْخَوْلَانِيُّ،عَنْ أَبِي عُثْمَانَ مُسْلِمِ بْنِ يَسَارٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أُفْتِيَ بِفُتْيَا غَيْرَ ثَبَتٍ،فَإِنَّمَا إِثْمُهُ عَلَى مَنْ أَفْتَاهُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘جس شخص کو بغیر دلیل کے فتویٰ دیا گیا (اور اس نے اس غلط فتویٰ پر عمل کر لیا) تو اس کا گناہ اس پر ہے جس نے اسے فتویٰ۔’’";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;