var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ الْيَشْكُرِيُّ عَنْ ابْنِ أَبِي حَبِيبَةَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي سُفْيَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ قِيلَ يَا رَسُولَ اللَّهِ إِنَّا نُرِيدُ الْمَسْجِدَ فَنَطَأُ الطَّرِيقَ النَّجِسَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَرْضُ يُطَهِّرُ بَعْضُهَا بَعْضًا";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ کسی نے عرض کیا: اے اللہ کے رسول! ہم مسجد کی طرف آتے ہیں تو راستے میں ناپاک جگہ پر بھی پاؤں پڑتا ہے(ہم کیا کریں؟) رسول اللہ ﷺ نے فرمایا:’’زمین کا ایک قطعہ دوسرے قطعے(سے حاصل ہونے والی نجاست سے جوتے یا قدم) کو پاک کر دیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن أبي حبیبۃ: متفق علی ضعفہ کما قال البوصیري،ضعیف <br>والراوي عنہ إبراہیم بن إسماعیل الیشکري: مجہول الحال (تقریب: 151)`;
ibnemaja.anwaar = [397,1];