var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ امْرَأَةٍ مِنْ بَنِي عَبْدِ الْأَشْهَلِ قَالَتْ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ بَيْنِي وَبَيْنَ الْمَسْجِدِ طَرِيقًا قَذِرَةً قَالَ فَبَعْدَهَا طَرِيقٌ أَنْظَفُ مِنْهَا قُلْتُ نَعَمْ قَالَ فَهَذِهِ بِهَذِهِ";
ibnemaja.urdu = "قبیلہ بنو عبدالاشہل کی ایک خاتون(رضی اللہ عنہا) سے روایت ہے،انہوں نے کہا: میں نے نبی ﷺ سے مسئلہ پوچھا،میں نے کہا: میرے(گھر) اور مسجد کے درمیان راستہ گندا(اور کوڑے کرکٹ والا) ہے۔آپ ﷺ نے فرمایا:’’اس کے بعد صاف راستہ بھی ہے؟‘‘میں نے کہا: جی ہاں،فرمایا:’’اس سے اس کی تلافی ہو جائے گی۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;