var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ جَمِيعًا عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ عَنْ عَائِشَةَ قَالَتْ رُبَّمَا فَرَكْتُهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِي";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: بعض اوقات میں اس چیز کو رسول اللہ ﷺ کے کپڑے پر سے خود اپنے ہاتھ سے کھرچتی تھی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;