var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ لَقَدْ رَأَيْتُنِي أَجِدُهُ فِي ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَحُتُّهُ عَنْهُ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہاسے روایت ہے،انہوں نے فرمایا: بعض اوقات مجھے رسول اللہ ﷺ کے کپڑے پر وہ چیز نظر آتی تو میں اسے کھرچ کر اتار دیتی تھی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;