var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ قَالَ: حَدَّثَنِي رِشْدِينُ بْنُ سَعْدٍ،وَجَعْفَرُ بْنُ عَوْنٍ،عَنِ ابْنِ أَنْعُمٍ هُوَ الْإِفْرِيقِيُّ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: الْعِلْمُ ثَلَاثَةٌ،فَمَا وَرَاءَ ذَلِكَ فَهُوَ فَضْلٌ: آيَةٌ مُحْكَمَةٌ،أَوْ سُنَّةٌ قَائِمَةٌ،أَوْ فَرِيضَةٌ عَادِلَةٌ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘علم تین چیزیں ہیں،اور جو کچھ ان کے علاوہ ہے وہ اضافی ہے(اس کے بغیر گزارہ ہو سکتا ہے۔) محکم آیات،ثابت شدہ سنتیں اور مالی حقوق جو عدل پر مبنی ہوں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (2885)`;
ibnemaja.anwaar = [376,1];