var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَحْيَى بْنُ يُوسُفَ الزِّمِّيُّ ح و حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ حَدَّثَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ الرَّقِّيُّ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الثَّوْبِ الَّذِي يَأْتِي فِيهِ أَهْلَهُ قَالَ نَعَمْ إِلَّا أَنْ يَرَى فِيهِ شَيْئًا فَيَغْسِلَهُ";
ibnemaja.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک آدمی نے نبی ﷺ سے سوال کیا: کسی نے بیوی کے پاس جاتے وقت جو کپڑا پہن رکھا ہو،کیا وہی پہن کر نماز پڑھ سکتا ہے؟ آپ ﷺ نے فرمایا: ’’ہاں،اگر اس میں کوئی چیز نظر آئے(جو دھونے کے لائق ہو) تو اسے دھولے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبد الملک بن عمیر مدلس وعنعن (ترمذي: 3659) <br>و الحدیث السابق (الأصل: 540) یغني عنہ`;
ibnemaja.anwaar = [397,1];