var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو هَمَّامٍ الْوَلِيدُ بْنُ شُجَاعِ بْنِ الْوَلِيدِ حَدَّثَنَا أَبِي وَابْنُ عُيَيْنَةَ وَابْنُ أَبِي زَائِدَةَ جَمِيعًا عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ";
ibnemaja.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے وضو کیا اور موزوں پر مسح کیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;