var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أَبِيهِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ خَرَجَ لِحَاجَتِهِ فَاتَّبَعَهُ الْمُغِيرَةُ بِإِدَاوَةٍ فِيهَا مَاءٌ حَتَّى فَرَغَ مِنْ حَاجَتِهِ فَتَوَضَّأَ وَمَسَحَ عَلَى الْخُفَّيْنِ";
ibnemaja.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ قضائے حاجت کے لئے تشریف لے گئے۔سیدنا مغیرہ رضی اللہ عنہ ایک برتن میں پانی لے کر آپ کے ساتھ گئے۔رسول اللہ ﷺ نے قضائے حاجت سے فارغ ہو کر وضو کیا اور موزوں پر مسح کیا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;