var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدَنِيُّ حَدَّثَنَا عَبْدُ الْمُهَيْمِنِ بْنُ الْعَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ عَلَى الْخُفَّيْنِ وَأَمَرَنَا بِالْمَسْحِ عَلَى الْخُفَّيْنِ";
ibnemaja.urdu = "سیدنا سہل ساعدی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے موزوں پر مسح کیا اور ہمیں بھی موزوں پر مسح کرنے کا حکم دیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھذا إسناد ضعیف۔عبدالمھیمن ضعفہ الجمھور ‘‘ وھو ضعیف`;
ibnemaja.anwaar = [397,2];