var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ حَدَّثَنَا عُمَرُ بْنُ الْمُثَنَّى عَنْ عَطَاءٍ الْخُرَاسَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَقَالَ هَلْ مِنْ مَاءٍ فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ ثُمَّ لَحِقَ بِالْجَيْشِ فَأَمَّهُمْ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں ایک سفر میں رسول اللہ ﷺ کے ہمراہ تھا۔آپ ﷺ نے فرمایا: ’’کچھ پانی ہے؟‘‘ پھر آپ نے وضو کیا اور موزوں پر مسح کیا۔پھر لشکر سے آملے اور انہیں نماز پڑھائی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عمر بن المثنی: مستور (تقریب: 4962) <br>وعطاء الخراساني لم یسمع من أنس رضي اللّٰہ عنہ`;
ibnemaja.anwaar = [398,1];