var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا دَلْهَمُ بْنُ صَالِحٍ الْكِنْدِيُّ عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ الْكِنْدِيِّ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّجَاشِيَّ أَهْدَى لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ فَلَبِسَهُمَا ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَيْهِمَا";
ibnemaja.urdu = "جناب ابن بریدہ اپنے والد رضی اللہ عنہ سے روایت کرتے ہیں کہ نجاشی نے نبی ﷺ کی خدمت میں دو سادہ سیاہ موزے تحفہ کے طور پر ارسال کیے۔آپ نے انہیں پہنا،پھر وضو کیا اور ان پر مسح کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (155) ترمذي (2820) وانظر الآتي (3620)`;
ibnemaja.anwaar = [398,1];