var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ حَمَّادٍ سَجَّادَةُ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأُمَوِيُّ،عَنْ مُحَمَّدِ بْنِ سَعِيدِ بْنِ حَسَّانَ،عَنْ عُبَادَةَ بْنِ نُسَيٍّ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ قَالَ: حَدَّثَنَا مُعَاذُ بْنُ جَبَلٍ،قَالَ: لَمَّا بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ قَالَ: «لَا تَقْضِيَنَّ وَلَا تَفْصِلَنَّ إِلَّا بِمَا تَعْلَمُ،وإنْ أَشْكَلَ عَلَيْكَ أَمْرٌ،فَقِفْ حَتَّى تَبَيَّنَهُ أَوْ تَكْتُبَ إِلَيَّ فِيهِ»";
ibnemaja.urdu = "حضرت معاذ بن جبل رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ نے جب مجھے یمن بھیجا تو فرمایا:‘‘تم ہر گز فیصلہ نہ کرنا مگر(یقینی)علم کے مطابق اور اگر کسی معاملے میں مشکل پڑ جائے تو توقف کرنا حتٰی کہ(صورت حال) واضح طور پر سمجھ لے(اور تحقیق کر لے) یا اس کے بارے میں مجھے لکھ دینا۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع <br>محمد بن سعید المصلوب:کذاب (ترمذي: 3549)`;
ibnemaja.anwaar = [376,1];