var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِيهِ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ قَالَ جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُسَافِرِ ثَلَاثًا وَلَوْ مَضَى السَّائِلُ عَلَى مَسْأَلَتِهِ لَجَعَلَهَا خَمْسًا";
ibnemaja.urdu = "سیدنا خزیمہ بن ثابت رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے مسافر کے لئے تین دن کی مدت مقرر فرمائی ہے،لیکن اگر سائل مزید مدت کے لئے اجازت مانگتا تو آپ ﷺ پانچ دن کی بھی اجازت دے دیتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (157)`;
ibnemaja.anwaar = [398,1];