var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ سَمِعْتُ إِبْرَاهِيمَ التَّيْمِيَّ يُحَدِّثُ عَنْ الْحَارِثِ بْنِ سُوَيْدٍ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةُ أَيَّامٍ أَحْسِبُهُ قَالَ وَلَيَالِيهِنَّ لِلْمُسَافِرِ فِي الْمَسْحِ عَلَى الْخُفَّيْنِ";
ibnemaja.urdu = "سیدنا خزیمہ بن ثابت رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’مسافر کے لئے موزوں پر مسح کی مدت تین دن ہے۔‘‘ غالباً یہ بھی فرمایا:’’اور تین رات۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;