var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَبِشْرُ بْنُ هِلَالٍ الصَّوَّافُ قَالَا حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ قَالَ حَدَّثَنَا الْمُهَاجِرُ أَبُو مَخْلَدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ رَخَّصَ لِلْمُسَافِرِ إِذَا تَوَضَّأَ وَلَبِسَ خُفَّيْهِ ثُمَّ أَحْدَثَ وُضُوءًا أَنْ يَمْسَحَ ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ وَلِلْمُقِيمِ يَوْمًا وَلَيْلَةً";
ibnemaja.urdu = "سیدنا ابو بکرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے مسافر کو اجازت دی کہ جب وہ وضو کر کے موزے پہنے،پھر وضو کرے تو تین دن رات تک مسح کرے،اور مقیم کے لئے ایک دن رات(مسح کرنے کی اجازت دی)۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;