var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ وَبِشْرُ بْنُ آدَمَ قَالَا حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ عِيسَى بْنِ سِنَانٍ عَنْ الضَّحَّاكِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَرْزَبٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وَمَسَحَ عَلَى الْجَوْرَبَيْنِ وَالنَّعْلَيْنِ قَالَ الْمُعَلَّى فِي حَدِيثِهِ لَا أَعْلَمُهُ إِلَّا قَالَ وَالنَّعْلَيْنِ";
ibnemaja.urdu = "سیدنا ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے وضو کیا اور جرابوں اور جوتوں پر مسح کیا۔\n(عیسیٰ بن یونس کے شاگرد)معلیٰ بن منصور نے اپنی حدیث میں کہا کہ میرے علم مین تو یہ ہے کہ انہوں نے صرف’’والنعلین‘‘ ہی کہا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البیہقي (ا/ 284،285): ’’ الضحاک بن عبد الرحمٰن لم یثبت سماعہ من أبي موسی وعیسی بن سنان ضعیف ‘‘ والسند ضعفہ أبو داود (159)`;
ibnemaja.anwaar = [398,1];