var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا دُحَيْمٌ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ عَمْرِو بْنِ أُمَيَّةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ وَالْعِمَامَةِ";
ibnemaja.urdu = "جناب جعفر بن عمرو اپنے والد(عمرو بن حریث مخزومی رضی اللہ عنہ) سے روایت کرتے ہیں،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو موزوں اور پگڑی پر مسح کرتے دیکھا ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;