var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو طَاهِرٍ أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ مُسْلِمٍ عَنْ أَبِي مَعْقِلٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وَعَلَيْهِ عِمَامَةٌ قِطْرِيَّةٌ فَأَدْخَلَ يَدَهُ مِنْ تَحْتِ الْعِمَامَةِ فَمَسَحَ مُقَدَّمَ رَأْسِهِ وَلَمْ يَنْقُضْ الْعِمَامَةَ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے دیکھا کہ رسول اللہ ﷺ نے وضو کیا اور آپ نے قطر کا بنا ہوا عمامہ پہنا ہوا تھا۔آپ ﷺ نے عمامہ کے نیچے ہاتھ ڈال کر سر کے اگلے حصے کا مسح کیا اور عمامہ مبارک کو کھالا نہیں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (147)`;
ibnemaja.anwaar = [399,1];