var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ تَيَمَّمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَنَاكِبِ";
ibnemaja.urdu = "سیدنا عمار بن یاسر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: ہم نے رسول اللہ ﷺ کے ساتھ کندھوں تک تیمم کیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;