var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ ح و حَدَّثَنَا أَبُو إِسْحَقَ الْهَرَوِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ جَمِيعًا عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جُعِلَتْ لِي الْأَرْضُ مَسْجِدًا وَطَهُورًا";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’میرے لئے زمین مسجد اور پاکیزگی حاصل کرنے کا ذریعہ بنا دی گئی ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;