var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْحَكَمِ وَسَلَمَةَ بْنِ كُهَيْلٍ أَنَّهُمَا سَأَلَا عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى عَنْ التَّيَمُّمِ فَقَالَ أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّارًا أَنْ يَفْعَلَ هَكَذَا وَضَرَبَ بِيَدَيْهِ إِلَى الْأَرْضِ ثُمَّ نَفَضَهُمَا وَمَسَحَ عَلَى وَجْهِهِ قَالَ الْحَكَمُ وَيَدَيْهِ وَقَالَ سَلَمَةُ وَمِرْفَقَيْهِ";
ibnemaja.urdu = "جناب حکم اور سلمہ بن کہیل سے روایت ہے کہ انہوں نے سیدنا عبداللہ بن ابو اوفی رضی اللہ عنہ سے تیمم کا مسئلہ دریافت کیا،تو انہوں نے فرمایا: نبی ﷺ نے سیدنا عمار رضی اللہ عنہ کو اس طرح کرنے کا حکم دیا تھا۔یہ کہہ کر انہوں نے اپنے دونوں ہاتھ زمین پر مارے،پھر انہیں جھاڑا اور انہیں اپنے چہرے پر پھیر لیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>محمد ابن أبي لیلی: ضعیف`;
ibnemaja.anwaar = [399,1];