var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ تَمَارَوْا فِي الْغُسْلِ مِنْ الْجَنَابَةِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنَا فَأُفِيضُ عَلَى رَأْسِي ثَلَاثَ أَكُفٍّ";
ibnemaja.urdu = "سیدنا جبیر بن مطعم رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کی مجلس میں غسل جنابت کے بارے میں بحث ہوگئی تو رسول اللہ ﷺ نے فرمایا: ’’میں تو اپنے سر پر تین لپ(پانی) ڈالتا ہوں۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;