var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،عَنْ أَبِيهِ،عَنْ جَابِرٍ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ،أَنَا فِي أَرْضٍ بَارِدَةٍ،فَكَيْفَ الْغُسْلُ مِنَ الْجَنَابَةِ؟ فَقَالَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَمَّا أَنَا،فَأَحْثُو عَلَى رَأْسِي ثَلَاثًا»";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: میں نے عرض کیا: اے اللہ کے رسول! میں سرد علاقے میں رہتا ہوں تو غسل جنابت کیسے کروں؟ آپ ﷺ نے فرمایا: ’’میں تو اپنے سر پر تین لپ ڈالتا ہوں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;