var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ وَإِسْمَعِيلُ بْنُ مُوسَى السُّدِّيُّ قَالُوا حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَوَضَّأُ بَعْدَ الْغُسْلِ مِنْ الْجَنَابَةِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ غسل جنابت کے بعد وضو نہیں کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (250) ترمذي (107)`;
ibnemaja.anwaar = [399,1];