var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ،وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ،قَالَا: حَدَّثَنَا سُفْيَانُ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَعِظُ أَخَاهُ فِي الْحَيَاءِ،فَقَالَ: «إِنَّ الْحَيَاءَ شُعْبَةٌ مِنَ الْإِيمَانِ»";
ibnemaja.urdu = "حضرت سالم رحمہ اللہ نے اپنے والد(حضرت عبداللہ بن عمر رضی اللہ عنہما) سے روایت کی،انہوں نے فرمایا: نبی ﷺ نے ایک نصیحت کر رہا تھا تو آپ نے ﷺ نے فرمایا:‘‘بے شک حیا ایمان کی ایک شاخ ہے۔’’";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;