var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ حُرَيْثٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ مِنْ الْجَنَابَةِ ثُمَّ يَسْتَدْفِئُ بِي قَبْلَ أَنْ أَغْتَسِلَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ غسل جنابت کرتے تھے،پھر میرے غسل کرنے سے پہلے مجھ سے(لپٹ کر) گرمی حاصل کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (123)`;
ibnemaja.anwaar = [399,1];