var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْنِبُ ثُمَّ يَنَامُ وَلَا يَمَسُّ مَاءً حَتَّى يَقُومَ بَعْدَ ذَلِكَ فَيَغْتَسِلَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کو جنابت کی کیفیت پیش آتی تھی،پھر آپ پانی کو ہاتھ لگائے بغیر سو جاتے تھے حتی کہ بعد میں اٹھ کر غسل فرمالیتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (228) ترمذي (118)`;
ibnemaja.anwaar = [399,1];