var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَتْ لَهُ إِلَى أَهْلِهِ حَاجَةٌ قَضَاهَا ثُمَّ يَنَامُ كَهَيْئَتِهِ لَا يَمَسُّ مَاءً";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ اگر اپنے اہل سے قربت کی ضرورت محسوس فرماتے تو اپنی یہ حاجت پوری کر لیتے،پھر پانی کو ہاتھ لگائے بغیر اسی حالت میں سو جاتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیث السابق (581)`;
ibnemaja.anwaar = [399,1];