var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُجْنِبُ ثُمَّ يَنَامُ كَهَيْئَتِهِ لَا يَمَسُّ مَاءً قَالَ سُفْيَانُ فَذَكَرْتُ الْحَدِيثَ يَوْمًا فَقَالَ لِي إِسْمَعِيلُ يَا فَتَى يُشَدُّ هَذَا الْحَدِيثُ بِشَيْءٍ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت کہ رسول اللہ ﷺ جنبی ہوتے تھے،تو پانی کو ہاتھ لگائے بغیر اسی حالت میں سو جاتے تھے۔\nسفیان کہتے ہیں کہ ایک دن میں نے اس حدیث کا ذکر کیا تو اسماعیل نے فرمایا:لڑکے!اس حدیث کو کسی چیز سے مضبوط کرنے کی ضرورت ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>انظر الحدیثین السابقین (581،582)`;
ibnemaja.anwaar = [400,1];