var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کو جب نہانے کی حاجت ہوتی اور آپ (نہائے بغیر) سونا چاہتے تو نماز والا وضو کر لیتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;