var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَرْقُدُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ نَعَمْ إِذَا تَوَضَّأَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہےکہ عمر بن خطاب رضی اللہ عنہ نے رسول اللہ ﷺ سے عرض کیا: جب ہم میں سے کوئی شخص حالت جنابت میں ہو تو کیا وہ سو سکتا ہے؟ آپ نے فرمایا:’’ہاں وضو کر لے(تو سو جائے)۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;