var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ مُحَمَّدُ بْنُ عُثْمَانَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ كَانَ تُصِيبُهُ الْجَنَابَةُ بِاللَّيْلِ فَيُرِيدُ أَنْ يَنَامَ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَوَضَّأَ ثُمَّ يَنَامَ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ وہ رات کو جنبی ہو جاتے تھے،پھر سونا چاہتے تھے،تو (مسئلہ پوچھنے پر) رسول اللہ ﷺ نے انھیں حکم دیا کہ وضو کر لیں،پھر سو جائیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;