var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ صَالِحِ بْنِ أَبِي الْأَخْضَرِ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَ وَضَعْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُسْلًا فَاغْتَسَلَ مِنْ جَمِيعِ نِسَائِهِ فِي لَيْلَةٍ";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کے لئے پانی رکھا،تو آپ نے ایک ہی رات میں تمام ازواج مطہرات رضی اللہ عنھن سے مقاربت کے بعد(ایک ہی بار)غسل کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>صالح بن أبی الأخضر: ضعیف`;
ibnemaja.anwaar = [400,1];