var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُلَيَّةَ وَغُنْدَرٌ وَوَكِيعٌ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَأْكُلَ وَهُوَ جُنُبٌ تَوَضَّأَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کو جب غسل کی حاجت ہوتی اور(اسی دوران میں) آپ کچھ تناول فرمانا چاہتے تو(کھانے سے پہلے) وضو کر لیتے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;