var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ صُبَيْحٍ حَدَّثَنَا أَبُو أُوَيْسٍ عَنْ شُرَحْبِيلَ بْنِ سَعْدٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجُنُبِ هَلْ يَنَامُ أَوْ يَأْكُلُ أَوْ يَشْرَبُ قَالَ نَعَمْ إِذَا تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روای تہے،انہوں نے فرمایا: نبی ﷺ سے جنبی کے متعلق سوال کیا گیا: کیا وہ سو سکتا ہے یا کھا پی سکتا ہے؟ آپ ﷺ نے فرمایا: ’’ہاں،جب وہ وضو کر لے،جس طرح نماز کے لئے وضو ہوتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>شرحبیل بن سعد وثقہ ابن حبان وضعفہ الجمھور الأئمۃ،قالہ الھیثمي (مجمع الزوائد 5/ 130) <br>وھو ضعیف`;
ibnemaja.anwaar = [400,1];