var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْرَأُ الْقُرْآنَ الْجُنُبُ،وَلَا الْحَائِضُ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جنبی اور حائضہ قرآن نہ پڑھیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `[595۔596] إسنادہ ضعیف <br>ترمذي (131)`;
ibnemaja.anwaar = [400,1];