var ibnemaja = {};
ibnemaja.arabic = "قَالَ: أَبُو الْحَسَنِ،وحَدَّثَنَا أَبُو حَاتِمٍ قَالَ: حَدَّثَنَا هِشامُ بْنُ عمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عيَّاشٍ قَالَ: حَدَّثَنَا مُوسى بْنُ عُقْبةَ،عَنْ نافعٍ،عَنِ ابْنِ عُمرَ قَالَ: قَالَ رَسُولُ اللَّهِ صلَّى اللَّهُ عليْهِ وسلَّمَ: «لَا يَقْرَأُ الْجُنُبُ وَالْحَائِضُ شيْئًا مِنَ الْقُرْآنِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جنبی اور حائضہ قرآن میں سے کچھ نہ پڑھیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `۔596] إسنادہ ضعیف <br>ترمذي (131)`;
ibnemaja.anwaar = [400,1];