var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا الْحَارِثُ بْنُ وَجِيهٍ حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ تَحْتَ كُلِّ شَعَرَةٍ جَنَابَةً فَاغْسِلُوا الشَّعَرَ وَأَنْقُوا الْبَشَرَةَ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ہر بال کے نیچے جنابت ہے،اس لئے بالوں کو دھو ڈالو اور جلد کو صاف کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (248) ترمذي (106)`;
ibnemaja.anwaar = [400,1];