var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي مَنْصُورِينَ لَا يَضُرُّهُمْ مَنْ خَذَلَهُمْ حَتَّى تَقُومَ السَّاعَةُ";
ibnemaja.urdu = "حضرت قُرّہ رضی اللہ عنہ سے روایت ہے اللہ کے رسول ﷺ نے فرمایا:‘‘میری امت کے ایک گروہ کو ہمیشہ (اللہ تعالیٰ کی) مدد حاصل رہے گی،ان کی مدد نہ کرنے والا ان کا کچھ بگاڑ نہ سکے گا،تاآنکہ قیامت قائم ہو جائے۔’’";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;