var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الطَّنَافِسِيُّ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ أَخْبَرَنَا الْقَاسِمُ بْنُ مُحَمَّدٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ إِذَا الْتَقَى الْخِتَانَانِ فَقَدْ وَجَبَ الْغُسْلُ فَعَلْتُهُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاغْتَسَلْنَا";
ibnemaja.urdu = "نبی ﷺ کی زوجہ محترمہ سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: جب(مرد اور عورت کے) ختنے(شرمگاہیں) باہم مل جائیں،تو غسل واجب ہو جاتا ہے۔میں نے اور رسول اللہ ﷺ نے یہ عمل کیا تو ہم نے غسل کیا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;