var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَنْبَأَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ قَالَ سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ أَنْبَأَنَا أُبَيُّ بْنُ كَعْبٍ قَالَ إِنَّمَا كَانَتْ رُخْصَةً فِي أَوَّلِ الْإِسْلَامِ ثُمَّ أُمِرْنَا بِالْغُسْلِ بَعْدُ";
ibnemaja.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اسلام کے ابتدائی دور میں رخصت تھی (کہ جماع کی صورت میں جب تک انزال نہ ہو،غسل واجب نہیں ہوتا تھا۔) بعد میں ہمیں غسل کرنے کا حکم دے دیا گیا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;