var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ نَجِيحٍ،وَكَانَ ثِقَةً،عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ،عَنْ جُنْدُبِ بْنِ عَبْدِ اللَّهِ،قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِتْيَانٌ حَزَاوِرَةٌ،«فَتَعَلَّمْنَا الْإِيمَانَ قَبْلَ أَنْ نَتَعَلَّمَ الْقُرْآنَ،ثُمَّ تَعَلَّمْنَا الْقُرْآنَ فَازْدَدْنَا بِهِ إِيمَانًا»";
ibnemaja.urdu = "حضرت جندب بن عبداللہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہمیں نبی ﷺ کا ساتھ نصیب ہوا جب کہ ہم بھر پور جواب تھے،تو ہم نے قرآن کا علم حاصل کرنے سے پہلے ایمان سیکھا،پھر ہم نے قرآن سیکھا تو اس سے ہمارے ایمان میں اضافہ ہوگیا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;