var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَلَسَ الرَّجُلُ بَيْنَ شُعَبِهَا الْأَرْبَعِ ثُمَّ جَهَدَهَا فَقَدْ وَجَبَ الْغُسْلُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب مردعورت کی چار شاخوں کے درمیان بیٹھے،پھر کوشش کرے تو غسل واجب ہوگیا۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;