var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ حَجَّاجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا الْتَقَى الْخِتَانَانِ وَتَوَارَتْ الْحَشَفَةُ فَقَدْ وَجَبَ الْغُسْلُ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب ختنے باہم مل جائیں اور سپاری چھپ جائے تو غسل واجب ہو جاتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف لضعف حجاج وھو ابن أرطاۃ وتدلیسہ وقد رواہ بالعنعنۃ ‘‘ <br>وللحدیث شواھد ضعیفۃ <br>والحدیث السابق (الأصل: 608) یغني عنہ`;
ibnemaja.anwaar = [400,1];