var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ عَنْ الْعُمَرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَرَأَى بَلَلًا وَلَمْ يَرَ أَنَّهُ احْتَلَمَ اغْتَسَلَ وَإِذَا رَأَى أَنَّهُ قَدْ احْتَلَمَ وَلَمْ يَرَ بَلَلًا فَلَا غُسْلَ عَلَيْهِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب کوئی شخص نیند سے بیدار ہو اور اسے (جسم یا کپڑوں پر) گیلا پن (مادہ منویہ) نظر آئے اور اسے خواب یاد نہ ہو،وہ غسل کرے اور اگر اسے محسوس ہو کہ اس نے خواب(میں غسل واجب کرنے والا عمل)دیکھا ہے اور(بیدار ہونے پر) گیلا پن نظر نہ آئے تو اس پر کوئی غسل نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (236) ترمذي (113)`;
ibnemaja.anwaar = [400,1];