var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ وَأَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ الْفَلَّاسُ وَمُجَاهِدُ بْنُ مُوسَى قَالُوا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا يَحْيَى بْنُ الْوَلِيدِ أَخْبَرَنِي مُحِلُّ بْنُ خَلِيفَةَ حَدَّثَنِي أَبُو السَّمْحِ قَالَ كُنْتُ أَخْدُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا أَرَادَ أَنْ يَغْتَسِلَ قَالَ وَلِّنِي فَأُوَلِّيهِ قَفَايَ وَأَنْشُرُ الثَّوْبَ فَأَسْتُرُهُ بِهِ";
ibnemaja.urdu = "سیدنا ابو سمح رضی اللہ عنہ سے روایت ہے،انھوں نے بیان کیا کہ میں نبی ﷺ کی خدمت کیا کرتا تھا۔آپ جب غصل کرنا چاہتے تو فرماتے:’’مجھ سے رخ پھیر لو۔‘‘ میں آپ کی طرف پیٹھ کر لیتا اور کپڑا پھیلا کر آپ کو پردہ کر دیتا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;