var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ ثَعْلَبَةَ الْحِمَّانِيُّ حَدَّثَنَا عَبْدُ الْحَمِيدِ أَبُو يَحْيَى الْحِمَّانِيُّ حَدَّثَنَا الْحَسَنُ بْنُ عُمَارَةَ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْتَسِلَنَّ أَحَدُكُمْ بِأَرْضِ فَلَاةٍ وَلَا فَوْقَ سَطْحٍ لَا يُوَارِيهِ فَإِنْ لَمْ يَكُنْ يَرَى فَإِنَّهُ يُرَى";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کوئی شخص کھلے میدان میں غسل نہ کرے،نہ ایسی چھت پر غسل کرے جس پر پردہ نہ ہوسکے۔اگر وہ کسی کو نہیں دیکھتا تو اس پر تو نظر پڑتی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>قال البوصیري: ’’ ھذا إسناد ضعیف،أبو عبیدۃ،قیل: لم یسمع من أبیہ عبد اللّٰہ بن مسعود،والحسن بن عمارۃ: مجمع علی ترک حدیثہ ‘‘ أبو عبیدۃ عن أبیہ منقطع <br>والحسن بن عمارۃ: متروک`;
ibnemaja.anwaar = [400,2];