var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ أَرْقَمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَحَدُكُمْ الْغَائِطَ وَأُقِيمَتْ الصَّلَاةُ فَلْيَبْدَأْ بِهِ";
ibnemaja.urdu = "سیدنا عبداللہ بن ارقم رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب کوئی شخص قضائے حاجت کے لئے جانا چاہتا ہو اور نماز کھڑی ہو جائے تو اسے چاہیے کہ پہلے حاجت سے فراغت حاصل کرے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;