var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ إِدْرِيسَ الْأَوْدِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُومُ أَحَدُكُمْ إِلَى الصَّلَاةِ وَبِهِ أَذًى";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’کوئی شخص اس حال میں نماز کے لئے کھڑا نہ ہو کہ اسے پیشاب یا پاخانہ کی حاجت ہو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;