var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ حَبِيبِ بْنِ صَالِحٍ عَنْ يَزِيدَ بْنِ شُرَيْحٍ عَنْ أَبِي حَيٍّ الْمُؤَذِّنِ عَنْ ثَوْبَانَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَقُومُ أَحَدٌ مِنْ الْمُسْلِمِينَ وَهُوَ حَاقِنٌ حَتَّى يَتَخَفَّفَ";
ibnemaja.urdu = "سیدنا ثوبان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کوئی مسلمان پیشاب یا پاخانہ کی حاجت ہوتے ہوئے(نماز کے لئے) کھڑا نہ ہو حتی کہ ہلکا پھلکا ہوجائے(حاجت سے فارغ ہو جائے۔‘‘)";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;