var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ نِزَارٍ،عَنْ أَبِيهِ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: صِنْفَانِ مِنْ هَذِهِ الْأُمَّةِ لَيْسَ لَهُمَا فِي الْإِسْلَامِ نَصِيبٌ: الْمُرْجِئَةُ وَالْقَدَرِيَّةُ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا:‘‘میری امت کی دو جماعتیں ایسی ہیں،جن کا اسلام میں کوئی حصہ نہیں: مُرْجِئَہ اور قَدَرِیَّہ۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2149)`;
ibnemaja.anwaar = [376,1];