var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْمَعِيلُ بْنُ مُوسَى قَالَا حَدَّثَنَا شَرِيكٌ عَنْ أَبِي الْيَقْظَانِ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْتَحَاضَةُ تَدَعُ الصَّلَاةَ أَيَّامَ أَقْرَائِهَا ثُمَّ تَغْتَسِلُ وَتَتَوَضَّأُ لِكُلِّ صَلَاةٍ وَتَصُومُ وَتُصَلِّي";
ibnemaja.urdu = "سیدنا عدی بن ثابت انصاری رحمہ اللہ اپنے والد سے،اور وہ عدی کے نانا سیدنا عبداللہ بن یزید خطمی رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی ﷺ نے فرمایا: ’’استحاضہ والی عورت حیض کے ایام میں نماز چھوڑ دے،پھر غسل کر لے اور ہر نماز کے لئے وضو کرے اور روزے بھی رکھے،نماز بھی پڑھے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (297) ترمذي (126)`;
ibnemaja.anwaar = [401,1];