var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ ثَابِتِ بْنِ هُرْمُزَ أَبِي الْمِقْدَامِ عَنْ عَدِيِّ بْنِ دِينَارٍ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ قَالَ اغْسِلِيهِ بِالْمَاءِ وَالسِّدْرِ وَحُكِّيهِ وَلَوْ بِضِلَعٍ";
ibnemaja.urdu = "سیدہ ام قیس بنت محصن رضی اللہ عنہا سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے کپڑے کو حیض کا خون لگ جانے کا مسئلہ پوچھا۔آپ ﷺ نے فرمایا: ’’اسے بیری کے پتوں اور پانی کے ساتھ دھو ڈالو،اور اسے کھرچ دو،خواہ لکڑی سے کھرچو۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;