var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يَكُونُ فِي الثَّوْبِ قَالَ اقْرُصِيهِ وَاغْسِلِيهِ وَصَلِّي فِيهِ";
ibnemaja.urdu = "سیدہ اسماء بنت ابو بکر صدیق رضی اللہ عنہا سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ سے کپڑے کو لگ جانے والے حیض کے خون کے بارے میں سوال کیا گیا تو آپ نے فرمایا: ’’انگلیوں سے مل کر دھو لے اور اسے پہن کر نماز پڑھ لے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;