var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ إِنْ كَانَتْ إِحْدَانَا لَتَحِيضُ ثُمَّ تَقْرُصُ الدَّمَ مِنْ ثَوْبِهَا عِنْدَ طُهْرِهَا فَتَغْسِلُهُ وَتَنْضَحُ عَلَى سَائِرِهِ ثُمَّ تُصَلِّي فِيهِ";
ibnemaja.urdu = "ام المومنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،ا نہوں نے فرمایا: ہم میں سے کسی کو حیض آتا تھا تو پاک ہونے پروہ انگلیوں سے مل کر کپڑے سے خون اتار دیتی تھی،پھر(وہاں سے) کپڑا دھو لیتی اور باقی کپڑے پر چھینٹے مار لیتی اور اسے پہن کر نماز پڑھ لیتی تھی۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;