var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَهِيِّ عَنْ عَائِشَةَ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاوِلِينِي الْخُمْرَةَ مِنْ الْمَسْجِدِ فَقُلْتُ إِنِّي حَائِضٌ فَقَالَ لَيْسَتْ حَيْضَتُكِ فِي يَدِكِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے مجھ سے فرمایا: ’’مجھے مسجد میں سے مصلّٰی (جائے نماز) اٹھا دو۔‘‘ میں نے عرض کیا: میں حیض سے ہوں۔نبی ﷺ نے فرمایا: ’’تمہارا حیض تمہارے ہاتھ میں تو نہیں ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;