var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُدْنِي رَأْسَهُ إِلَيَّ وَأَنَا حَائِضٌ وَهُوَ مُجَاوِرٌ تَعْنِي مُعْتَكِفًا فَأَغْسِلُهُ وَأُرَجِّلُهُ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ مسجد میں اعتکاف بیٹھے ہوئے تھے اور میں حیض سے ہوتی تھی تو آپ اپنا سر مبارک میرے قریب کر دیتے چنانچہ میں سر دھودیتی اور کنگھی کر دیتی تھی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;