var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا سُفْيَانُ عَنْ مَنْصُورِ بْنِ صَفِيَّةَ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ لَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ رَأْسَهُ فِي حِجْرِي وَأَنَا حَائِضٌ وَيَقْرَأُ الْقُرْآنَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ میری گود میں سر رکھ کر قرآن مجید کی تلاوت کر لیتے تھے،جب کہ میں حیض سے ہوتی تھی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;