var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَتْ إِحْدَانَا إِذَا حَاضَتْ أَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَأْتَزِرَ بِإِزَارٍ ثُمَّ يُبَاشِرُهَا";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: ہم (امہات المومنین) میں سے کوئی جب ایام سے ہوتی تو نبی ﷺ اسے تہ بند باندھ لینے کا حکم دیتے،پھر اس سے مباشرت (بوس و کنار) فرماتے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;