var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ عَبْدِ الْحَمِيدِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ قَالَ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ ایامِ حیض میں عورت سے مباشرت کرنے والے کے بارے میں نبی ﷺ نے فرمایا: ’’وہ ایک دینار یا نصف دینار صدقہ دے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (264)`;
ibnemaja.anwaar = [401,1];