var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ عَنْ أَبِي الْخَطَّابِ الْهَجَرِيِّ عَنْ مَحْدُوجٍ الذُّهْلِيِّ عَنْ جَسْرَةَ قَالَتْ أَخْبَرَتْنِي أُمُّ سَلَمَةَ قَالَتْ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَرْحَةَ هَذَا الْمَسْجِدِ فَنَادَى بِأَعْلَى صَوْتِهِ إِنَّ الْمَسْجِدَ لَا يَحِلُّ لِجُنُبٍ وَلَا لِحَائِضٍ";
ibnemaja.urdu = "سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ اس مسجد کے صحن میں داخل ہوئے اور بلند آواز سے اعلان فرمایا: ’’کسی جنبی یا حائضہ کو مسجد میں داخل ہونا جائز نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو الخطاب و محدوج مجھولان (تقریب: 8081،6498) <br>والحدیث ضعفہ البوصیري وحدیث أبي داود (232) یغني عنہ`;
ibnemaja.anwaar = [401,1];