var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ النَّحْوِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ بَكْرٍ أَنَّهَا أُخْبِرَتْ أَنَّ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَرْأَةِ تَرَى مَا يَرِيبُهَا بَعْدَ الطُّهْرِ قَالَ إِنَّمَا هِيَ عِرْقٌ أَوْ عُرُوقٌ قَالَ مُحَمَّدُ بْنُ يَحْيَى يُرِيدُ بَعْدَ الطُّهْرِ بَعْدَ الْغُسْلِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے اس عورت کے بارے میں،جسے پاک ہونے کے بعد کوئی مشکوک چیز نظر آئے،فرمایا:’’وہ ایک رگ ہے‘‘۔یا فرمایا: ’’وہ رگیں ہیں۔‘‘\nمحمد بن یحیٰ نے کہا:پاک ہونے کے بعد سے مراد غسل کے بعد ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (293)`;
ibnemaja.anwaar = [401,1];