var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى عَنْ أَبِي سَهْلٍ عَنْ مُسَّةَ الْأَزْدِيَّةِ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَتْ النُّفَسَاءُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَجْلِسُ أَرْبَعِينَ يَوْمًا وَكُنَّا نَطْلِي وُجُوهَنَا بِالْوَرْسِ مِنْ الْكَلَفِ";
ibnemaja.urdu = "سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کے زمانہ مبارک میں نفاس والی عورت چالیس دن بیٹھی رہتی تھی،اور ہم چھائیوں کا علاج کرنے کے لئے چہروں پر ورس لگاتی تھیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;