var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا الْمُحَارِبِيُّ عَنْ سَلَّامِ بْنِ سُلَيْمٍ أَوْ سَلْمٍ شَكَّ أَبُو الْحَسَنِ وَأَظُنُّهُ هُوَ أَبُو الْأَحْوَصِ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِلنُّفَسَاءِ أَرْبَعِينَ يَوْمًا إِلَّا أَنْ تَرَى الطُّهْرَ قَبْلَ ذَلِكَ";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے نفاس والی عورت کے لئے چالیس دن کی مقدار مقرر کی ہے،سوائے اس کے کہ اس مدت سے پہلے طہر نظر آجائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>سلام الطویل: متروک (تقریب: 2702) <br>والمحاربي مدلس و عنعن <br>وللحدیث شواہد کثیرۃ`;
ibnemaja.anwaar = [401,2];