var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَبْدِ الْكَرِيمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ الرَّجُلُ إِذَا وَقَعَ عَلَى امْرَأَتِهِ وَهِيَ حَائِضٌ أَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَصَدَّقَ بِنِصْفِ دِينَارٍ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: جب کوئی شخص حیض کی حالت میں بیوی سے مباشرت (صحبت) کر لیتا تو نبی ﷺ اسے آدھا دینار صدقہ کرنے کا حکم دیتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (137)`;
ibnemaja.anwaar = [402,1];