var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ حَرَامِ بْنِ حَكِيمٍ عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ سَعْدٍ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مُؤَاكَلَةِ الْحَائِضِ فَقَالَ وَاكِلْهَا";
ibnemaja.urdu = "سیدنا عبداللہ بن سعد رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں نے رسول اللہ ﷺ سے حائضہ کے ساتھ مل کر کھانا کھانے کا حکم دریافت کیا تو آپ ﷺ نے فرمایا: ’’اس کے ساتھ مل کر کھا لیا کرو۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;