var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَنَا إِلَى جَنْبِهِ وَأَنَا حَائِضٌ وَعَلَيَّ مِرْطٌ لِي وَعَلَيْهِ بَعْضُهُ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نماز پڑھ رہے تھے اور میں آپ کے قریب(لیٹی ہوئی) تھی جب کہ میں حیض سے تھی۔میں نے ایک چادر اپنے اوپر لے رکھی تھی اور اس کا ایک حصہ آپ ﷺ کے جسم مبارک پر تھا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;