var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا الشَّيْبَانِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ مَيْمُونَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى وَعَلَيْهِ مِرْطٌ بَعْضُهُ عَلَيْهِ وَعَلَيْهَا بَعْضُهُ وَهِيَ حَائِضٌ";
ibnemaja.urdu = "ام المومنین سیدہ میمونہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے(گھر میں نفل) نماز پڑھی۔آپ نے چادر اوڑھی رکھی تھی جس کا کچھ حصہ نبی ﷺ پر تھا اور کچھ حصہ ان پر تھا۔اور وہ حالت حیض میں تھیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;