var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو الْوَلِيدِ وَأَبُو النُّعْمَانِ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ صَفِيَّةَ بِنْتِ الْحَارِثِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقْبَلُ اللَّهُ صَلَاةَ حَائِضٍ إِلَّا بِخِمَارٍ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،نبی ﷺ نے فرمایا: ’’اللہ تعالیٰ کسی بالغ عورت کی نماز اوڑھنی کے بغیر قبول نہیں کرتا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;