var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ مُعَاذَةَ أَنَّ امْرَأَةً سَأَلَتْ عَائِشَةَ قَالَتْ تَخْتَضِبُ الْحَائِضُ فَقَالَتْ قَدْ كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَخْتَضِبُ فَلَمْ يَكُنْ يَنْهَانَا عَنْهُ";
ibnemaja.urdu = "جناب معاذہ رحمہ اللہ سے روایت ہے کہ ایک عورت نے ام المومنین سیدہ عائشہ رضی اللہ عنہا سے سوال کیا،کیا حیض والی عورت مہندی (یا کوئی دوسرا خضاب) لگا سکتی ہے؟ ام المومنین نے فرمایا: ہم نبی ﷺ کے پاس ہوتیں اور خضاب لگا لیتی تھیں،آپ ﷺ ہمیں منع نہیں فرماتے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;