var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا إِسْرَائِيلُ عَنْ عَمْرِو بْنِ خَالِدٍ عَنْ زَيْدِ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ انْكَسَرَتْ إِحْدَى زَنْدَيَّ فَسَأَلْتُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَنِي أَنْ أَمْسَحَ عَلَى الْجَبَائِرِ قَالَ أَبُو الْحَسَنِ بْنُ سَلَمَةَ أَنْبَأَنَا الدَّبَرِيُّ عَنْ عَبْدِ الرَّزَّاقِ نَحْوَهُ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میری ایک کلائی ٹوٹ گئی میں نے نبی ﷺ سے مسئلہ پوچھا تو آپ نے مجھے پٹیوں پر مسح کرنے کا حکم دیا۔\n(امام ابن ماحہ رحمہ اللہ کے شاگرد) ابو الحسن بن سلمہ نے کہا‘انہیں دبری نے عبد الرزاق سے سابقہ روایت کی مثل بیان کیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ موضوع <br>عمرو بن خالد الواسطي: متروک،رماہ وکیع بالکذب`;
ibnemaja.anwaar = [402,1];