var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَامِلَ الْحُسَيْنِ بْنِ عَلِيٍّ عَلَى عَاتِقِهِ وَلُعَابُهُ يَسِيلُ عَلَيْهِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو دیکھا کہ سیدنا حسین بن علی رضی اللہ عنہما کو کندھے پر اٹھایا ہوا تھا،اور ان کا لعاب بہ کر آپ پر گر رہا تھا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;