var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مِسْعَرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ كَرَامَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مِسْعَرٍ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِدَلْوٍ فَمَضْمَضَ مِنْهُ فَمَجَّ فِيهِ مِسْكًا أَوْ أَطْيَبَ مِنْ الْمِسْكِ وَاسْتَنْثَرَ خَارِجًا مِنْ الدَّلْوِ";
ibnemaja.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے دیکھا کہ نبی ﷺ کی خدمت میں (پانی کا) ڈول حاضر کیا گیا،آپ نے اس میں سے پانی لے کر کلی کی،پھر ڈول میں کلی کی جو کستوری کی طرح یا کستوری سے پاکزہ تر تھی اور آپ نے ڈول سے باہر ناک صاف کی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>السند منقطع: عبد الجبار لم یسمع من أبیہ کما قال البخاري (جامع الترمذي: 1453)`;
ibnemaja.anwaar = [402,1];