var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَمُحَمَّدُ بْنُ الْمُثَنَّى،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،قَالَ: سَمِعْتُ قَتَادَةَ،يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ-أَوْ قَالَ لِجَارِهِ-مَا يُحِبُّ لِنَفْسِهِ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا:‘‘ تم میں سے کوئی شخص اس وقت تک مومن نہیں ہو سکتا جب تک اپنے مسلمان بھائی کے لئے۔۔۔۔یا فرمایا: اپنے ہمسائے کے لئے۔۔۔۔بھی وہ چیز پسند نہ کرے جو اپنے لیے پسند کرتا ہے۔’’";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;