var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ مَحْمُودِ بْنِ الرَّبِيعِ وَكَانَ قَدْ عَقَلَ مَجَّةً مَجَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دَلْوٍ مِنْ بِئْرٍ لَهُمْ";
ibnemaja.urdu = "امام زہری نے سیدنا محمود بن ربیع رضی اللہ عنہ سے روایت بیان کی اور یہ وہ صحابی ہیں جنہیں وہ کلی یاد تھی جو رسول اللہ ﷺ نے ایک ڈول میں کی تھی جس میں ان کے ایک کنویں سے پانی لیا گیا تھا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;