var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْظُرْ الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ وَلَا يَنْظُرْ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کوئی عورت،دوسری عورت کے ستر کو نہ دیکھے،اور کوئی مرد کسی مرد کے ستر کو نہ دیکھے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;