var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ مَوْلًى لِعَائِشَةَ عَنْ عَائِشَةَ قَالَتْ مَا نَظَرْتُ أَوْ مَا رَأَيْتُ فَرْجَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطُّ قَالَ أَبُو بَكْرٍ كَانَ أَبُو نُعَيْمٍ يَقُولُ عَنْ مَوْلَاةٍ لِعَائِشَةَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کی شرمگاہ کو کبھی نہیں دیکھا۔\nابو بکر نے کہا:ابو نعیم(حضرت عائشہ رضی اللہ عنہا کے غلام کی بجائے)حضرت عائشہ رضی اللہ عنہا کی لونڈی سے بیان کیا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>انظر الحدیث الآتي (1922)<br>قال البوصیري: ’’ ھذا إسناد ضعیف،مولی عائشۃ لم یسم ‘‘`;
ibnemaja.anwaar = [402,1];