var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا مُسْتَلِمُ بْنُ سَعِيدٍ عَنْ أَبِي عَلِيٍّ الرَّحَبِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَ مِنْ جَنَابَةٍ فَرَأَى لُمْعَةً لَمْ يُصِبْهَا الْمَاءُ فَقَالَ بِجُمَّتِهِ فَبَلَّهَا عَلَيْهَا قَالَ إِسْحَقُ فِي حَدِيثِهِ فَعَصَرَ شَعْرَهُ عَلَيْهَا";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے غسل جنابت کیا،پھر آپ کو تھوڑی سی جگہ(خشک) نظر آئی جسے پانی نہیں پہنچا تھا۔چنانچہ آپ نے اپنی بالوں کو اس جگہ پر نچوڑ کر تر کر لیا۔\nجناب اسحاق نے اپنی حدیث میں کہا کہ آپ نے اپںے بالوں کو اس سے نچوڑا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،<br>أبو علي الرحبي اسمہ حسین بن قیس: أجمعوا علی ضعفہ‘‘ متروک`;
ibnemaja.anwaar = [402,1];