var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ الْحَسَنِ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي اغْتَسَلْتُ مِنْ الْجَنَابَةِ وَصَلَّيْتُ الْفَجْرَ ثُمَّ أَصْبَحْتُ فَرَأَيْتُ قَدْرَ مَوْضِعِ الظُّفْرِ لَمْ يُصِبْهُ الْمَاءُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كُنْتَ مَسَحْتَ عَلَيْهِ بِيَدِكَ أَجْزَأَكَ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نبی ﷺ کی خدمت میں حاضر ہوا اور عرض کیا: میں نے غسل جنابت کیا اور فجر کی نماز پڑھی۔دن چڑھا تو مجھے ایک ناخن کے برابر جگہ نظر آئی جہاں(غسل کے دوران میں) پانی نہیں پہنچا تھا۔رسول اللہ ﷺ نے فرمایا: ’’اگر تو اس جگہ (گیلا) ہاتھ پھیر دیتا تو کافی ہوتا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>محمد بن عبیداللّٰہ العرزمي: متروک <br>والحدیث ضعفہ البوصیري`;
ibnemaja.anwaar = [402,1];