var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ تَوَضَّأَ وَتَرَكَ مَوْضِعَ الظُّفْرِ لَمْ يُصِبْهُ الْمَاءُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْجِعْ فَأَحْسِنْ وُضُوءَكَ";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نبی ﷺ کی خدمت میں حاضر ہوا،اس نے وضو تھا اور ناخن کے برابر جگہ چھوڑ دی تھی،وہاں پانی نہیں پہنچا تھا۔نبی ﷺ نے اسے فرمایا: ’’واپس جا کر اچھی طرح وضو کرو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;