var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ ح و حَدَّثَنَا ابْنُ حُمَيْدٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَا حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا تَوَضَّأَ فَتَرَكَ مَوْضِعَ الظُّفْرِ عَلَى قَدَمِهِ فَأَمَرَهُ أَنْ يُعِيدَ الْوُضُوءَ وَالصَّلَاةَ قَالَ فَرَجَعَ";
ibnemaja.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: اللہ کے رسول ﷺ نے ایک آدمی کو دیکھا کہ اس نے وضو کیا(لیکن) پاؤں پر ایک ناخن کے برابر جگہ(خشک) چھوڑ دی۔آپ ﷺ نے اسے حکم دیا کہ دوبارہ وضو کرے اور دوبارہ نماز پڑھے۔چنانچہ وہ شخص (وضو کرنے کے لئے مسجد سے)واپس چلا گیا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;