var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كُنَّ نِسَاءُ الْمُؤْمِنَاتِ يُصَلِّينَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ ثُمَّ يَرْجِعْنَ إِلَى أَهْلِهِنَّ فَلَا يَعْرِفُهُنَّ أَحَدٌ تَعْنِي مِنْ الْغَلَسِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: مومن خواتین نبی ﷺ کے ساتھ فجر کی نماز(باجماعت) ادا کیا کرتی تھیں،اس کے بعد وہ گھروں کو واپس جاتیں تو انہیں کوئی نہ پہچان سکتا،یعنی اندھیرے کی وجہ سے پہچانی نہیں جاتی تھیں۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;