var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَمُحَمَّدُ بْنُ الْمُثَنَّى،قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،قَالَ: سَمِعْتُ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَلَدِهِ،وَوَالِدِهِ،وَالنَّاسِ أَجْمَعِينَ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ نے فرمایا:‘‘تم میں سے کوئی شخص ایمان دار نہیں ہو سکتاحتٰی کہ میں اسے اس کی اولاد،والد اور تمام لوگوں سے زیادہ محبوب ہو جاؤں۔’’";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;