var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ وَالْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا قَالَ تَشْهَدُهُ مَلَائِكَةُ اللَّيْلِ وَالنَّهَارِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے آیات کریمہ:﴿ وَ قُرْاٰنَ الْفَجْرِ ۭ اِنَّ قُرْاٰنَ الْفَجْرِ کَانَ مَشْہُوْدًا ﴾’’اور فجر کی تلاوت یقیناً فجر کی نماز میں۔۔۔فرشتے۔۔۔حاضر ہوتے ہیں۔‘‘ کی وضاحت کرتے ہوئے فرمایا: ’’اس میں رات اور دن کے فرشتے حاضر ہوتے ہیں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;