var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ عَجْلَانَ سَمِعَ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ وَجَدُّهُ بَدْرِيٌّ يُخْبِرُ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَصْبِحُوا بِالصُّبْحِ فَإِنَّهُ أَعْظَمُ لِلْأَجْرِ أَوْ لِأَجْرِكُمْ";
ibnemaja.urdu = "سیدنا رافع بن خدیج رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’صبح کو روشن کرو،اس میں زیادہ ثواب ہے۔‘‘ یا فرمایا: ’’اس سے تمہیں زیادہ ثواب ملے گا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;