var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ عَنْ سَيَّارِ بْنِ سَلَامَةَ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةَ الْهَجِيرِ الَّتِي تَدْعُونَهَا الظُّهْرَ إِذَا دَحَضَتْ الشَّمْسُ";
ibnemaja.urdu = "سیدنا ابو برزہ اسلمی رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ دوپہر کی نماز،جسے تم لوگ ظہر کہتے ہو،اس وقت ادا کرتے تھے جب سورج ڈھل جاتا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;