var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ الْعَبْدِيِّ عَنْ خَبَّابٍ قَالَ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّ الرَّمْضَاءِ فَلَمْ يُشْكِنَا قَالَ الْقَطَّانُ حَدَّثَنَا أَبُو حَاتِمٍ حَدَّثَنَا الْأَنْصَارِيُّ حَدَّثَنَا عَوْفٌ نَحْوَهُ";
ibnemaja.urdu = "سیدنا خباب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم نے رسول اللہ ﷺ سے زمین کی تپش کی شکایت کی،تو رسول اللہ ﷺ نے ہماری شکایت دور نہ فرمائی۔\n(امام ابن ماجہ رحمہ اللہ کے شاگرد)قطان نے کہا:ہمیں ابو حاتم نے انصاری سے ‘انہوں نے حضرت عوف رضی اللہ عنہ سے اسی طرح روایت بیان کی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;