var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ خِشْفِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ شَكَوْنَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّ الرَّمْضَاءِ فَلَمْ يُشْكِنَا";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم نے نبی ﷺ سے زمین کی تپش کی شکایت فرمائی تو آپ ﷺ نے ہماری شکایت دور نہ فرمائی۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;