var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ الْوَاسِطِيُّ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ عَنْ شَرِيكٍ عَنْ بَيَانٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الظُّهْرِ بِالْهَاجِرَةِ فَقَالَ لَنَا أَبْرِدُوا بِالصَّلَاةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ";
ibnemaja.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ہم رسول اللہ ﷺ کی معیت میں ظہر کی نماز دوپہر کے وقت(زوال سے فوراً بعد) پڑھا کرتےت ھے،تو آپ ﷺ نے ہمیں فرمایا: ’’نماز ٹھنڈی کر لو کیوں کہ گرمی کی شدت جہنم کی بھاپ سے ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>شریک مدلس وعنعن <br>ولأصل الحدیث شواھد کثیرۃ`;
ibnemaja.anwaar = [403,1];