var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ حَيَّةٌ فَيَذْهَبُ الذَّاهِبُ إِلَى الْعَوَالِي وَالشَّمْسُ مُرْتَفِعَةٌ";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ عصر کی نماز ادا فرماتے تھے جب کہ سورج بلند اور روشن ہوتا تھا۔(اس کے بعد) اگر کوئی شخص مدینہ کی نواحی بستیوں میں جاتا،تو وہاں پہنچنے تک سورج ابھی بلند ہوتا تھا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;