var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِي لَمْ يُظْهِرْهَا الْفَيْءُ بَعْدُ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے عصر کی نماز ادا فرمائی اور ابھی میرے صحن میں دھوپ موجود تھی،ابھی سایہ(دیوار پر) نہ چڑھا تھا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;