var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ الْخَنْدَقِ مَلَأَ اللَّهُ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا كَمَا شَغَلُونَا عَنْ الصَّلَاةِ الْوُسْطَى";
ibnemaja.urdu = "سیدنا علی بن ابو طالب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے غزوہٴ خندق کے موقع پر ارشاد فرمایا: ’’جس طرح ان لوگوں نے ہمیں عصر کی نماز سے روک دیا،اللہ(اس کی سزا کے طور پر) ان کے گھروں اور قبروں کو آگ سے بھر دے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;