var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الَّذِي تَفُوتُهُ صَلَاةُ الْعَصْرِ فَكَأَنَّمَا وُتِرَ أَهْلُهُ وَمَالُهُ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،اللہ کے رسول ﷺ نے فرمایا: ’’جس کی عصر کی نماز فوت ہوگئی گویا اس کے اہل و عیال اور مال و دولت(سب کچھ) تباہ و برباد ہوگئے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;