var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ح و حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ عَنْ زُبَيْدٍ عَنْ مُرَّةَ عَنْ عَبْدِ اللَّهِ قَالَ حَبَسَ الْمُشْرِكُونَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ الْعَصْرِ حَتَّى غَابَتْ الشَّمْسُ فَقَالَ حَبَسُونَا عَنْ صَلَاةِ الْوُسْطَى مَلَأَ اللَّهُ قُبُورَهُمْ وَبُيُوتَهُمْ نَارًا";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مشرکین نے نبی ﷺ کو عصر کی نماز نہ پڑھنے دی،حتی کہ سورج غروب ہوگیا،تب آپ ﷺ نے فرمایا: ’’انہوں نے ہمیں درمیانی نماز سے روک دیا،اللہ ان کی قبروں اور گھروں کو آگ سے بھر دے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;