var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ أَنَّهُ كَانَ يُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ إِذَا تَوَارَتْ بِالْحِجَابِ";
ibnemaja.urdu = "سیدنا سلمہ بن اکوع رضی اللہ عنہ سے روایت ہے کہ وہ رسول اللہ ﷺ کی اقتدا میں نمازمغرب اس وقت ادا کرتے تھ،جب سورج اوٹ میں چھپ جاتا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;