var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا عَفَّانُ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنِ الْأَعْمَشِ،ح وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي وَائِلٍ،عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سِبَابُ الْمُسْلِمِ فُسُوقٌ،وَقِتَالُهُ كُفْرٌ»";
ibnemaja.urdu = "حضرت عبداللہ (بن مسعود) رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا؛‘‘ مسلمان کو گالی دینا گناہ اور اس سے جنگ کرنا کفر ہے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;