var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَخَّرْتُ صَلَاةَ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ أَوْ نِصْفِ اللَّيْلِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اگر مجھے اپنی امت پر مشقت کا خوف نہ ہوتا تو میں عشاء کی نماز کو تہائی رات یا نصف رات تک مؤخر کرتا۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;