var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَاجِرِ عَنْ بُرَيْدَةَ الْأَسْلَمِيِّ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ فَقَالَ بَكِّرُوا بِالصَّلَاةِ فِي الْيَوْمِ الْغَيْمِ فَإِنَّهُ مَنْ فَاتَتْهُ صَلَاةُ الْعَصْرِ حَبِطَ عَمَلُهُ";
ibnemaja.urdu = "سیدنا بریدہ اسلمی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ایک جنگ میں ہم رسول اللہ ﷺ کے ساتھ تھے تو آپ نے فرمایا: ’’بادل والے دن نماز جلدی پڑھ لیا کرو کیوں کہ جس کی عصر کی نماز چھوٹ گئی اس کے عمل ضائع ہوگئے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>یحیی بن أبي کثیر مدلس و عنعن <br>و حدیث البخاري (553) یغني عنہ`;
ibnemaja.anwaar = [403,1];