var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يَغْفُلُ عَنْ الصَّلَاةِ أَوْ يَرْقُدُ عَنْهَا قَالَ يُصَلِّيهَا إِذَا ذَكَرَهَا";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ سے سوال کیا گیا کہ اگر کوئی آدمی نماز پڑھنا بھول جائے یا سویا رہ جائے (تو کیا کرے؟) آپ ﷺ نے فرمایا: ’’جب یاد آئے،اسی وقت نماز پڑھ لے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;