var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عَبْد اللَّهِ قَالَ حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ قَالَ حَدَّثَنَا أَبُو عَلْقَمَةَ نَصْرُ بْنُ عَلْقَمَةَ عَنْ عُمَيْرِ بْنِ الْأَسْوَدِ وَكَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي قَوَّامَةً عَلَى أَمْرِ اللَّهِ لَا يَضُرُّهَا مَنْ خَالَفَهَا";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ نے فرمایا:‘‘میری امت میں سے ایک گروہ اللہ کے احکام پر ہمیشہ پوری طرح قائم رہے گا،اس کی مخالفت کرنے والا اس کو نقصان نہیں پہنچا سکے گا۔’’";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;