var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الْوَهَّابِ قَالُوا حَدَّثَنَا عَوْفٌ عَنْ أَبِي الْمِنْهَالِ سَيَّارِ بْنِ سَلَامَةَ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ الْعِشَاءَ وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا";
ibnemaja.urdu = "سیدنا ابو برزہ اسلمی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ عشاء کی نماز کو دیر سے پڑھنا پسند کرتے تھے،اور اس سے پہلے سونا اور اس کے بعد باتیں کرنا ناپسند فرماتے تھے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;