var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ وَعَلِيُّ بْنُ الْمُنْذِرِ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ جَدَبَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّمَرَ بَعْدَ الْعِشَاءِ يَعْنِي زَجَرَنَا";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں عشاء کے بعد باتیں کرنے سے سختی سے منع کیا ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ …عطاء بن السائب اختلط بآخرہ۔ومحمد بن فضیل روی عنہ بعد الإختلاط‘‘ وکذا سائر من رواہ عنہ ھذا الحدیث (وانظر ضعیف سنن أبي داود: 2819) <br>ولأصل الحدیث شواھد بغیر ھذا اللفظ`;
ibnemaja.anwaar = [403,1];