var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَغْلِبَنَّكُمْ الْأَعْرَابُ عَلَى اسْمِ صَلَاتِكُمْ فَإِنَّهَا الْعِشَاءُ وَإِنَّهُمْ لَيُعْتِمُونَ بِالْإِبِلِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو سنا آپ فرما رہے تھے: ’’اعرابی تمہاری نماز کے نام میں تم پر غالب نہ آجائیں،یہ عشاء ہے،وہ لوگ اونٹنیوں(کا دودھ اندھیرے کے وقت دوہنے) کی وجہ سے اسے عتمہ(اندھیرے کی نماز) کہتے ہیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;