var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ: حَدَّثَنَا أَبُو النَّضْرِ قَالَ: حَدَّثَنَا أَبُو جَعْفَرٍ،عَنْ يُونُسَ،عَنِ الْحَسَنِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ،وَأَنِّي رَسُولُ اللَّهِ،وَيُقِيمُوا الصَّلَاةَ،وَيُؤْتُوا الزَّكَاةَ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ مجھے حکم دیا گیا ہے کہ لوگوں سے جہاد کروں حتٰی کہ وہ گواہی دیں کہ اللہ کے سوا کوئی معبود حقیقی نہیں اور میں(محمد) اللہ کا رسول ہوں،اور نماز قائم کریں اور زکوٰۃ ادا کریں۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = `متواتر`;