var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِلَالًا أَنْ يَجْعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ وَقَالَ إِنَّهُ أَرْفَعُ لِصَوْتِكَ";
ibnemaja.urdu = "سیدنا سعد قرظ رضی اللہ عنہ جو رسول اللہ ﷺ کے مؤذن تھے،ان سے روایت ہے کہ رسول اللہ ﷺ نے سیدنا بلال رضی اللہ عنہ کو کانوں میں انگلیاں ڈالنے کا حکم دیا،اور فرمایا: ’’اس سے تمہاری آواز بلند ہو جائے گی۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،لضعف أولا د سعد القرظ: عمار و سعد و عبد الرحمٰن ‘‘`;
ibnemaja.anwaar = [403,1];