var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْهَاشِمِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِيهِ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْأَبْطَحِ وَهُوَ فِي قُبَّةٍ حَمْرَاءَ فَخَرَجَ بِلَالٌ فَأَذَّنَ فَاسْتَدَارَ فِي أَذَانِهِ وَجَعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ";
ibnemaja.urdu = "سیدنا ابو جحیفہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں مقام ابطح پر رسول اللہ ﷺ کی خدمت میں حاضر ہوا اور آپ ایک سرخ خیمہ میں تشریف فرما تھے۔سیدنا بلال رضی اللہ عنہ (خیمہ سے) نکلے،انہوں نے اذان دی،اور اذان کے دوران میں(دائیں بائیں) گھومے اور اپنی انگلیاں اپنے کانوں میں ڈالیں۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;