var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ مَرْوَانَ بْنِ سَالِمٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَصْلَتَانِ مُعَلَّقَتَانِ فِي أَعْنَاقِ الْمُؤَذِّنِينَ لَلْمُسْلِمِينَ صَلَاتُهُمْ وَصِيَامُهُمْ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’مؤذنوں کی گردنوں پر مسلمانوں کی دو چیزوں کی ذمہ داری ہے،ان کی نماز اور ان کے روزے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>مروان بن سالم الغفاري: متروک ورماہ الساجي وغیرہ بالوضع (تقریب:6570) والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [403,2];