var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَ بِلَالٌ لَا يُؤَخِّرُ الْأَذَانَ عَنْ الْوَقْتِ وَرُبَّمَا أَخَّرَ الْإِقَامَةَ شَيْئًا";
ibnemaja.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: سیدنا بلال رضی اللہ عنہ اذان کو وقت سے مؤخر نہیں کرتے تھے،البتہ اقامت میں بعض اوقات تاخیر کر دیتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>شریک عنعن <br>وحدیث أبي داود (403) یغني عنہ`;
ibnemaja.anwaar = [404,1];