var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ أَشْعَثَ عَنْ الْحَسَنِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَ كَانَ آخِرُ مَا عَهِدَ إِلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا أَتَّخِذَ مُؤَذِّنًا يَأْخُذُ عَلَى الْأَذَانِ أَجْرًا";
ibnemaja.urdu = "سیدنا عثمان بن ابی العاص رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے مجھے سب سے آخر میں جو وصیت فرمائی تھی،وہ یہ تھی کہ میں ایسا مؤذن مقرر نہ کروں،جو اذان دینے کی اجرت وصول کرے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;