var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَسَدِيُّ عَنْ أَبِي إِسْرَائِيلَ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ بِلَالٍ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُثَوِّبَ فِي الْفَجْرِ وَنَهَانِي أَنْ أُثَوِّبَ فِي الْعِشَاءِ";
ibnemaja.urdu = "سیدنا بلال رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا: رسول اللہ ﷺ نے مجھے فجر کی نماز میں تثویب کا حکم دیا،اور عشاء کی نماز تثویب سے منع فرمایا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (198)`;
ibnemaja.anwaar = [404,1];