var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ بِلَالٍ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْذِنُهُ بِصَلَاةِ الْفَجْرِ فَقِيلَ هُوَ نَائِمٌ فَقَالَ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ فَأُقِرَّتْ فِي تَأْذِينِ الْفَجْرِ فَثَبَتَ الْأَمْرُ عَلَى ذَلِكَ";
ibnemaja.urdu = "سیدنا بلال رضی اللہ عنہ سے روایت ہے کہ وہ فجر کی نماز کی اطلاع دینے کے لئے ﷺ کی خدمت میں حاضر ہوئے تو معلوم ہوا کہ آپ ابھی آرام فرما رہے ہیں۔سیدنا بلال رضی اللہ عنہ نے کہا: (الصلوۃ خیر من النوم،الصلوہ خیر من النوم) ’’نماز نیند سے بہتر ہے،نماز نیند سے بہتر ہے۔‘‘ تب یہ کلمہ فجر کی اذان میں مقرر کر دیا گیا،پھر اسی پر عمل جاری رہا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ رجالہ ثقات إلا أن فیہ انقطاعًا۔سعید بن المسیب لم یسمع من بلال ‘‘۔`;
ibnemaja.anwaar = [404,1];