var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا الِإفْرِيقِيُّ عَنْ زِيَادِ بْنِ نُعَيْمٍ عَنْ زِيَادِ بْنِ الْحَارِثِ الصُّدَائِيِّ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَأَمَرَنِي فَأَذَّنْتُ فَأَرَادَ بِلَالٌ أَنْ يُقِيمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخَا صُدَاءٍ قَدْ أَذَّنَ وَمَنْ أَذَّنَ فَهُوَ يُقِيمُ";
ibnemaja.urdu = "سیدنا زیادہ بن حارث صدائی رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: میں ایک سفر میں رسول اللہ ﷺ کے ہمراہ تھا۔آپ نے مجھے حکم دیا تو میں نے اذان دی۔(جماعت کے وقت) سیدنا بلال رضی اللہ عنہ نے اقامت کہنا چاہی تو رسول اللہ ﷺ نے فرمایا: ’’قبیلہ بن صداء کے آدمی نے اذان دی ہے اور جو کوئی اذان دے وہی اقامت کہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (514(ترمذي (199)`;
ibnemaja.anwaar = [404,1];