var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ عَنْ عَبَّادِ بْنِ إِسْحَقَ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَذَّنَ الْمُؤَذِّنُ فَقُولُوا مِثْلَ قَوْلِهِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب مؤذن اذان دے تو جس طرح وہ کہتا ہے،اسی طرح تم بھی کہو۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;