var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا شُجَاعُ بْنُ مَخْلَدٍ أَبُو الْفَضْلِ قَالَ حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا أَبُو بِشْرٍ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ أَبِي سُفْيَانَ حَدَّثَتْنِي عَمَّتِي أُمُّ حَبِيبَةَ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا كَانَ عِنْدَهَا فِي يَوْمِهَا وَلَيْلَتِهَا فَسَمِعَ الْمُؤَذِّنَ يُؤَذِّنُ قَالَ كَمَا يَقُولُ الْمُؤَذِّنُ";
ibnemaja.urdu = "سیدہ ام المومنین ام حبیبہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ ان کی باری کے دن اور رات ان کے ہاں تشریف فرما تھے۔اس دوران میں آپ ﷺ نے مؤذن کو اذان دیتے سنا تو ام المومنین نے سنا کہ آپ نے بھی اسی طرح کہا جس طرح مؤذن نے کہا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;