var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ قَالَ: حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ،عَنْ مُعَاذِ بْنِ جَبَلٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ،وَأَنِّي رَسُولُ اللَّهِ،وَيُقِيمُوا الصَّلَاةَ،وَيُؤْتُوا الزَّكَاةَ»";
ibnemaja.urdu = "حضرت معاذ بن جبل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:‘‘ مجھے حکم دیا گیا ہے کہ میں لوگوں سے جہاد کروں حتٰی کہ وہ گواہی دیں کہ اللہ کے سوا کوئی معبود نہیں اور میں(محمد) اللہ کا رسول ہوں،اور نماز قائم کریں اور زکاۃ ادا کریں۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = `متواتر`;