var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا سُفْيَانُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عِيسَى بْنِ طَلْحَةَ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤَذِّنُونَ أَطْوَلُ النَّاسِ أَعْنَاقًا يَوْمَ الْقِيَامَةِ";
ibnemaja.urdu = "سیدنا معاویہ بن ابو سفیان رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قیامت کے دن مؤذنوں کی گردنیں سب سے لمبی ہوں گی۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;