var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُخْتَارُ بْنُ غَسَّانَ حَدَّثَنَا حَفْصُ بْنُ عُمَرَ الْأَزْرَقُ الْبُرْجُمِيُّ عَنْ جَابِرٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ ح و حَدَّثَنَا رَوْحُ بْنُ الْفَرَجِ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ حَدَّثَنَا أَبُو حَمْزَةَ عَنْ جَابِرٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَذَّنَ مُحْتَسِبًا سَبْعَ سِنِينَ كَتَبَ اللَّهُ لَهُ بَرَاءَةً مِنْ النَّارِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے ثواب کی نیت سے سات سال (مسلسل) اذان دی،اللہ تعالیٰ اس کے لیے جہنم سے نجات لکھ دیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جابر الجعفي: ضعیف رافضي <br>ولہ لون آخر (انظر ضعیف سنن الترمذي: 206)`;
ibnemaja.anwaar = [404,1];