var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ عَنْ ابْنِ جُرَيْجٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَذَّنَ ثِنْتَيْ عَشْرَةَ سَنَةً وَجَبَتْ لَهُ الْجَنَّةُ وَكُتِبَ لَهُ بِتَأْذِينِهِ فِي كُلِّ يَوْمٍ سِتُّونَ حَسَنَةً وَلِكُلِّ إِقَامَةٍ ثَلَاثُونَ حَسَنَةً";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص بارہ برس تک اذان دیتا ہے،اس کے لئے جنت واجب ہو جاتی ہے،اور اس کے لئے روزانہ اذان کے عوض ساٹھ نیکیاں لکھی جاتی ہیں اور ہر اقامت کے عرض تیس نیکیاں لکھی جاتی ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن جریج عنعن <br>وللحدیث طریق آخر عندالحاکم (2/ 205 ح 737) وسندہ ضعیف`;
ibnemaja.anwaar = [404,1];