var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ الْتَمَسُوا شَيْئًا يُؤْذِنُونَ بِهِ عِلْمًا لِلصَّلَاةِ فَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: صحابہ کرام رضی اللہ عنہم کو کسی ایسی چیز کی تلاش تھی جس کو علامت بنا کر وہ نماز کی اطلاع دے سکیں۔(آخر کار) سیدنا بلال رضی اللہ عنہ کو حکم دیا گیا کہ اذان میں دو بار کلمات کہیں اور اقامت میں ایک ایک بار کہیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;