var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدٍ حَدَّثَنَا عَمَّارُ بْنُ سَعْدٍ مُؤَذِّنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ أَذَانَ بِلَالٍ كَانَ مَثْنَى مَثْنَى وَإِقَامَتَهُ مُفْرَدَةٌ";
ibnemaja.urdu = "سیدنا سعد بن عمار بن سعد سے روایت ہے،انہوں نے اپنے والد سے اور انہوں نے ان کے دادا سے روایت کی کہ سیدنا بلال رضی اللہ عنہ کی اذان دہری اور اقامت اکہری ہوتی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>قال البوصیري: ’’ ھذا إسناد ضعیف لضعف أولاد سعد القرظ: عمار وسعد و عبدالرحمن ‘‘ <br>وانظر الحدیث السابق (710)`;
ibnemaja.anwaar = [404,1];