var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَدْرٍ عَبَّادُ بْنُ الْوَلِيدِ حَدَّثَنِي مُعَمَّرُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ مَوْلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي أَبِي مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عُبَيْدِ اللَّهِ عَنْ أَبِي رَافِعٍ قَالَ رَأَيْتُ بِلَالًا يُؤَذِّنُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثْنَى مَثْنَى وَيُقِيمُ وَاحِدَةً";
ibnemaja.urdu = "سیدنا ابو رافع رضی اللہ عنہ جو نبی ﷺ کے غلام تھے سے روایت ہے،انہوں نے فرمایا: میں نے سیدنا بلال رضی اللہ عنہ کی موجودگی میں اذان کے کلمات دو دو بار اور اقامت کے کلمات ایک ایک بار کہتے دیکھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف لإتفاقھم علی ضعف معمر بن محمد بن عبیداللّٰہ وأبیہ محمد ‘‘ (وانظرالحدیث السابق: 449) <br>محمد بن عبیداللّٰہ: ضعیف عندالجمھور (مجمع الزوائد 114/6)`;
ibnemaja.anwaar = [404,2];