var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ،عَنْ أَبِيهِ،عَنْ مَحْمُودِ بْنِ لَبِيدٍ،عَنْ عُثْمَانَ بْنِ عَفَّانَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ بَنَى لِلَّهِ مَسْجِدًا،بَنَى اللَّهُ لَهُ مِثْلَهُ فِي الْجَنَّةِ»";
ibnemaja.urdu = "سیدنا عثمان بن عفان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے اللہ(کی رضا حاصل کرنے) کے لئے مسجد تعمیر کی،اللہ اس کے لئے جنت میں ویسا ہی (گھر)تیار کرے گا۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;