var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ ابْنِ لَهِيعَةَ قَالَ حَدَّثَنِي أَبُو الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَنَى مَسْجِدًا مِنْ مَالِهِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے اپنے مال سے اللہ کے لئے مسجد تعمیر کی،اللہ تعالیٰ کے لئے جنت میں گھر تیار کرے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،الولید مدلس وابن لھیعۃ ضعیف ‘‘`;
ibnemaja.anwaar = [405,1];