var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو عُثْمَانَ الْبُخَارِيُّ سَعِيدُ بْنُ سعْدٍ قَالَ: حَدَّثَنَا الْهَيْثَمُ بْنُ خَارِجَةَ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عيَّاشٍ،عَنْ عبْدِ الْوَهَّابِ بْنِ مُجَاهِدٍ،عَنْ مُجَاهِدٍ،عَنْ أَبِي هُرَيْرةَ،وَابْنِ عبَّاسٍ قَالَا: «الْإِيمَانُ يَزِيدُ وَيَنْقُصُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ اور حضرت عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے،ان دونوں نے فرمایا: ایمان میں اضافہ اور کمی ہوتی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>عبدالوہاب بن مجاہد: متروک وقد کذبہ الثوري (تقریب: 4263) <br>ومفھوم الأثر صحیح بإتفاق أھل السنۃ`;
ibnemaja.anwaar = [377,1];