var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا عَبْدُ الْكَرِيمِ بْنُ عَبْدِ الرَّحْمَنِ الْبَجَلِيُّ،عَنْ لَيْثٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرَاكُمْ سَتُشَرِّفُونَ مَسَاجِدَكُمْ بَعْدِي،كَمَا شَرَّفَتِ الْيَهُودُ كَنَائِسَهَا،وَكَمَا شَرَّفَتِ النَّصَارَى بِيَعَهَا»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’میں دیکھتا ہوں(مجھے یقین ہے) کہ تم لوگ میرے بعد اس طرح اونچی اونچی مسجدیں بناؤ گے،جس طرح یہودیوں نے اپنے عبادت خانے اور عیسائیوں نے اپنے گرجے اونچے اونچے بنائے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال البوصیري: ’’ ھذا إسناد ضعیف،فیہ لیث وھو ابن أبي سلیم: ضعیف،وجبارۃ بن المغلس وھو کذاب ‘‘ لیث وجبارۃ: ضعیف (تقریب: 890) وقال الھیثمي: وضعفہ الجمھور (مجمع الزوائد 21/9)`;
ibnemaja.anwaar = [405,1];