var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا عَبْدُ الْكَرِيمِ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي إِسْحَاقَ،عَنْ عَمْرِو بْنِ مَيْمُونٍ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا سَاءَ عَمَلُ قَوْمٍ قَطُّ،إِلَّا زَخْرَفُوا مَسَاجِدَهُمْ»";
ibnemaja.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس قوم کے اعمال خراب ہو جاتے ہیں،وہ مسجدوں کو مزین کرنے لگتی ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>جبارۃ: ضعیف جدًا`;
ibnemaja.anwaar = [405,1];