var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا أَبُو هَمَّامٍ الدَّلَّالُ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ السَّائِبِ،عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عِيَاضٍ،عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَمَرَهُ أَنْ يَجْعَلَ مَسْجِدَ الطَّائِفِ حَيْثُ كَانَ طَاغِيَتُهُمْ»";
ibnemaja.urdu = "سیدنا عثمان بن العاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے انہیں طائف میں اس جگہ مسجد بنانے کا حکم دیا،جہاں ان کا بت ہوا کرتا تھا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (450)`;
ibnemaja.anwaar = [405,1];