var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ: حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ،قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ وَسُئِلَ عَنِ الْحِيطَانِ تُلْقَى فِيهَا الْعَذِرَاتُ،فَقَالَ «إِذَا سُقِيَتْ مِرَارًا،فَصَلُّوا فِيهَا» يَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ ان سے ان باغوں کے بارے میں سوال کیا گیا،جن میں نجاست(کھاد کے طور پر) ڈالی جاتی ہے۔تو انہوں نے فرمایا: جب انہیں کئی بار پانی دے دیا جائے تو(اس کے بعد) ان میں نماز پڑھ لو۔انہوں نے یہ بات نبی ﷺ کی طرف منسوب کی ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن إسحاق عنعن <br>عمرو بن عثمان بن سیار الرقي: ضعیف (تقریب: 5074) والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [406,1];