var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ عَمْرِو بْنِ يَحْيَى،عَنْ أَبِيهِ وَحَمَّادُ بْنُ سَلَمَةَ،عَنْ عَمْرِو بْنِ يَحْيَى،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْأَرْضُ كُلُّهَا مَسْجِدٌ،إِلَّا الْمَقْبَرَةَ،وَالْحَمَّامَ»";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قبرستان اور غسل خانے کے سوا ساری زمین مسجد ہے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;