var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ زَيْدِ بْنِ جَبِيرَةَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلَّى فِي سَبْعِ مَوَاطِنَ فِي الْمَزْبَلَةِ وَالْمَجْزَرَةِ وَالْمَقْبَرَةِ وَقَارِعَةِ الطَّرِيقِ وَالْحَمَّامِ وَمَعَاطِنِ الْإِبِلِ وَفَوْقَ الْكَعْبَةِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے سات جگہوں میں نماز پڑھنے سے منع فرمایا: کوڑا کرکٹ پھینکنے کی جگہ،مذبح (جانور ذبح کرنے کی جگہ) میں،قبرستان میں،عام راستے میں،غسل خانے میں،اونٹوں کے باڑے میں،اور کعبہ شریف کے اوپر(چھت پر)۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (346)`;
ibnemaja.anwaar = [406,1];