var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ دَاوُدَ وَمُحَمَّدُ بْنُ أَبِي الْحُسَيْنِ قَالَا حَدَّثَنَا أَبُو صَالِحٍ حَدَّثَنِي اللَّيْثُ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ بْنِ الْخَطَّابِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَبْعُ مَوَاطِنَ لَا تَجُوزُ فِيهَا الصَّلَاةُ ظَاهِرُ بَيْتِ اللَّهِ وَالْمَقْبَرَةُ وَالْمَزْبَلَةُ وَالْمَجْزَرَةُ وَالْحَمَّامُ وَعَطَنُ الْإِبِلِ وَمَحَجَّةُ الطَّرِيقِ";
ibnemaja.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ساتھ جگہ نماز پڑھنا جائز نہیں۔بیت اللہ کی چھت پر،قبرستان میں،کوڑا کرکٹ پھینکنے کی جگہ،مذبھ(جانور ذبح کرنے کی جگہ) میں،غسل خانے میں اونٹوں کے باڑے میں،اور عام راستے کے درمیان میں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ترمذي (347)<br>أبو صالح کاتب اللیث ضعیف في غیر ما یروي الحذاق کالبخاري وغیرہ عنہ و تلمیذہ ھاھنا لیس من الحذاق`;
ibnemaja.anwaar = [406,1];