var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ قَالَ: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنِ ابْنِ عَجْلَانَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْبَيْعِ وَالِابْتِيَاعِ وَعَنْ تَنَاشُدِ الْأَشْعَارِ فِي الْمَسَاجِدِ»";
ibnemaja.urdu = "جناب عمرو بن شعیب اپنے والد جناب شعیب بن محمد رحمہ اللہ) سے،اور وہ اپنے دادا(سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہما) سے روایت کرتے ہیں کہ انہوں نے کہا: رسول اللہ ﷺ نے مسجد میں خریدو فروخت اور شعر گوئی سے منع فرمایا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;