var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ الْفَضْلِ الْخُرْقِي قَالَ: حَدَّثَنَا أَبُو عَامِرٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ عَاصِمٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا مِنَ الْأَنْصَارِ أَرْسَلَ إِلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ تَعَالَ فَخُطَّ لِي مَسْجِدًا فِي دَارِي أُصَلِّي فِيهِ،وَذَلِكَ بَعْدَ مَا عَمِيَ،«فَجَاءَ،فَفَعَلَ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک انصاری صحابی نے رسول اللہ ﷺ کی خدمت میں پیغام بھیجا کہ میرے گھر تشریف لا کر میرے لئے گھر میں ایک مسجد(نماز کی جگ) مقرر کر دیجئے جہاں میں نماز پڑھا کروں۔اس وقت وہ صحابی نا بینا ہو چکے تھے۔رسول اللہ ﷺ تشریف لائے اور اس صحابی کی فرمائش پوری کی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;