var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ بْنِ أَبِي الْجَوْنِ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ صَالِحٍ الْمَدَنِيُّ قَالَ: حَدَّثَنَا مُسْلِمُ بْنُ أَبِي مَرْيَمَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَخْرَجَ أَذًى مِنَ الْمَسْجِدِ،بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ»";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے مسجد سے کوڑا کرکٹ نکالا،اللہ اس کے لئے جنت میں گھر تعمیر کرے گا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البو صیري: ’’ ھذا إسناد ضعیف،مسلم ھو ابن یسار لم یسمع من أبي سعید الخدري و محمد (بن صالح المدني) فیہ لین ‘‘`;
ibnemaja.anwaar = [406,1];