var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ وَأَحْمَدُ بْنُ الْأَزْهَرِ قَالَا حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ أَنْبَأَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِالْمَسَاجِدِ أَنْ تُبْنَى فِي الدُّورِ وَأَنْ تُطَهَّرَ وَتُطَيَّبَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے حکم دیا کہ محلوں میں مسجدیں تعمیر کی جائیں،انہیں پاک صاف رکھا جائے اور انہیں خوشبو لگائی جائے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;