var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رِزْقُ اللَّهِ بْنُ مُوسَى قَالَ: حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ الْحَضْرَمِيُّ قَالَ: حَدَّثَنَا زَائِدَةُ بْنُ قُدَامَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ قَالَتْ: أَمَرَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَنْ تُتَّخَذَ الْمَسَاجِدُ فِي الدُّورِ،وَأَنْ تُطَهَّرَ،وَتُطَيَّبَ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے محلوں میں مسجدیں بنانے،انہیں پاک رکھنے اور انہیں خوشبو لگانے کا حکم دیا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;