var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ قَالَ: حَدَّثَنَا عَائِذُ بْنُ حَبِيبٍ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ،فَغَضِبَ حَتَّى احْمَرَّ وَجْهُهُ،فَجَاءَتْهُ امْرَأَةٌ مِنَ الْأَنْصَارِ فَحَكَّتْهَا،وَجَعَلَتْ مَكَانَهَا خَلُوقًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا أَحْسَنَ هَذَا»";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ کو مسجد میں قبلے کی طرف(دیوار پر) بلغم نظر آیا۔آپ ﷺ اس قدر غضب ناک ہوئے کہ چہرہٴ مبارک سرخ ہوگیا۔(یہ دیکھ کر) ایک انصاری خاتون نے آکر اسے کھرچ دیا اور اس جگہ خوشبو لگا دی۔رسول اللہ ﷺ نے فرمایا: ’’بہت خوب!‘‘۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;