var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ أَبِي سِنَانٍ سَعِيدِ بْنِ سِنَانٍ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،قَالَ: صَلَّى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ رَجُلٌ: مَنْ دَعَا إِلَى الْجَمَلِ الْأَحْمَرِ؟ فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا وَجَدْتَهُ،إِنَّمَا بُنِيَتِ الْمَسَاجِدُ لِمَا بُنِيَتْ لَهُ»";
ibnemaja.urdu = "سیدنا بریدہ بن حصیب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے نماز ادا فرمایا: (نماز کے بعد) ایک آدمی بولا: مجھے کون سرخ اونٹ کی اطلاع دے گا؟ نبی ﷺ نے فرمایا: ’’تجھے وہ(اونٹ) نہ ملے۔مسجدیں تو جس کام کے لئے بنی ہیں اسی کے لئے ہی بنی ہیں۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;