var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا ابْنُ لَهِيعَةَ،ح وَحَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،جَمِيعًا،عَنِ ابْنِ عَجْلَانَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«نَهَى عَنْ إِنْشَادِ الضَّالَّةِ فِي الْمَسْجِدِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے گمشدہ چیز کا اعلان مسجد میں کرنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;