var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،ح وَحَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،قَالَا: حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنْ لَمْ تَجِدُوا إِلَّا مَرَابِضَ الْغَنَمِ،وَأَعْطَانَ الْإِبِلِ،فَصَلُّوا فِي مَرَابِضِ الْغَنَمِ،وَلَا تُصَلُّوا فِي أَعْطَانِ الْإِبِلِ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اگر تمہیں اونٹوں اور بکریوں کے باڑے کے سوا کوئی جگہ نہ ملے،تو بکریوں کے باڑے میں نماز پڑھ لو،اونٹوں کے باڑے میں نہ پڑھو۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;