var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا هُشَيْمٌ،عَنْ يُونُسَ،عَنِ الْحَسَنِ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَلُّوا فِي مَرَابِضِ الْغَنَمِ،وَلَا تُصَلُّوا فِي أَعْطَانِ الْإِبِلِ،فَإِنَّهَا خُلِقَتْ مِنَ الشَّيَاطِينِ’’";
ibnemaja.urdu = "سیدنا عبداللہ بن مغفل مزنی رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’بکریوں کے باڑے میں نماز پڑھ لیا کرو اور اونٹوں کے باڑے میں نماز نہ پڑھو،کیوں کہ وہ شیطانوں سے پیدا ہوئے ہیں۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;