var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ رَبِيعِ بْنِ سَبْرَةَ بْنِ مَعْبَدٍ الْجُهَنِيُّ قَالَ: أَخْبَرَنِي أَبِي،عَنْ أَبِيهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُصَلَّى فِي أَعْطَانِ الْإِبِلِ،وَيُصَلَّى فِي مُرَاحِ الْغَنَمِ»";
ibnemaja.urdu = "سیدنا سبرہ بن معبد جہنی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: اونٹوں کے باڑوں میں نماز نہ پڑھی جائے،بکریوں کے باڑے میں پڑھ لی جائے۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;