var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدِ بْنِ رَاشِدٍ الرَّمْلِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ أَبِي رَافِعٍ إِسْمَاعِيلَ بْنِ رَافِعٍ،عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمَشَّاءُونَ إِلَى الْمَسَاجِدِ فِي الظُّلَمِ،أُولَئِكَ الْخَوَّاضُونَ فِي رَحْمَةِ اللَّهِ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ نے فرمایا: ’’اندھیروں میں مسجدوں کی طرف زیادہ چل کر جانے والے ہی اللہ کی رحمت میں غوطہ زن ہوتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الولید عنعن <br>وقال البوصیري: ’’ ھذا إسناد ضعیف،أبو رافع أجمعوا علی ضعفہ ‘‘ أبو رافع إسماعیل بن رافع: ضعیف الحفظ`;
ibnemaja.anwaar = [407,1];