var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ الْحَلَبِيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ الْحَارِثِ الشِّيرَازِيُّ قَالَ: حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ التَّمِيمِيُّ،عَنْ أَبِي حَازِمٍ،عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «لِيَبْشَرِ الْمَشَّاءُونَ فِي الظُّلَمِ،بِنُورٍ تَامٍّ يَوْمَ الْقِيَامَةِ»";
ibnemaja.urdu = "سیدنا سہل بن سعد ساعدی رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’اندھیروں میں (مسجدوں کی طرف) بکثرت چلنے والوں کے لئے قیامت کے دن مکمل نور کی خوشخبری ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;