var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَجْزَأَةُ بْنُ سُفْيَانَ بْنِ أَسِيدٍ،مَوْلَى ثَابِتٍ الْبُنَانِيِّ قَالَ: حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الصَّائِغُ،عَنْ ثَابِتٍ الْبُنَانِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بَشِّرِ الْمَشَّائِينَ فِي الظُّلَمِ إِلَى الْمَسَاجِدِ،بِالنُّورِ التَّامِّ يَوْمَ الْقِيَامَةِ»";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اندھیروں میں مسجدوں کی طرف زیادہ چلنے والون کو قیامت کے دن مکمل نور کے حصول کی خوشخبری دے دو۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;