var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنِ ابْنِ أَبِي ذِئْبٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْأَبْعَدُ فَالْأَبْعَدُ مِنَ الْمَسْجِدِ أَعْظَمُ أَجْرًا»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو مسجد سے زیادہ دور ہو،پھر جو اسے سے بھی زیادہ دور ہو،تو اس کا ثواب پہلے شخص سے بھی زیادہ ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;