var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا إِسْرَائِيلُ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: كَانَتِ الْأَنْصَارُ بَعِيدَةً مَنَازِلُهُمْ مِنَ الْمَسْجِدِ،فَأَرَادُوا أَنْ يَقْرُبُوا،فَنَزَلَتْ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ [يس: 12] قَالَ: «فَثَبَتُوا»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: انصار (میں سے بعض حضرات) کے گھر مسجد سے دور تھے۔انہوں نے قریب آنا چاہا تو یہ آیت نازل ہوگئی: ’’جو کچھ انہوں نے آگے بھیجا،ہم وہ بھی لکھ لیتے ہیں اور ان کے نشانات بھی لکھتے ہیں۔‘‘چنانچہ وہ لوگ(وہیں) ٹھہرے رہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سماک عن عکرمۃ: ضعیف <br>و للحدیث شاھد ضعیف عند الترمذي (3226) والحدیث السابق (الأصل: 784) یغني عنہ`;
ibnemaja.anwaar = [407,1];