var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنِ ابْنِ شِهَابٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «فَضْلُ الْجَمَاعَةِ عَلَى صَلَاةِ أَحَدِكُمْ وَحْدَهُ خَمْسٌ وَعِشْرُونَ جُزْءًا»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’نماز باجماعت تم میں سے کسی اکیلے کی نماز سے پچیس حصے افضل ہے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;