var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ هِلَالِ بْنِ مَيْمُونٍ،عَنْ عَطَاءِ بْنِ يَزِيدَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَلَاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلَاتِهِ فِي بَيْتِهِ خَمْسًا وَعِشْرِينَ دَرَجَةً»";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’آدمی کا جماعت کے ساتھ نماز پڑھنا،گھر میں نماز پڑھنے سے پچیس درجے زیادہ (اجرو ثواب کا باعث) ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;