var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ: حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَصِيرٍ،عَنْ أَبِيهِ،عَنْ أُبَيِّ بْنِ كَعْبٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَلَاةُ الرَّجُلِ فِي جَمَاعَةٍ،تَزِيدُ عَلَى صَلَاةِ الرَّجُلِ وَحْدَهُ أَرْبَعًا وَعِشْرِينَ،أَوْ خَمْسًا وَعِشْرِينَ دَرَجَةً»";
ibnemaja.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’آدمی کا جماعت سے نماز پڑھنا،آدمی کے اکیلے نماز پڑھنے سے چوبیس یا پچیس درجے زیادہ (ثواب کا باعث) ہوتا ہے۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;