var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ زَائِدَةَ،عَنْ عَاصِمٍ،عَنْ أَبِي رَزِينٍ،عَنِ ابْنِ أُمِّ مَكْتُومٍ،قَالَ: قُلْتُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنِّي كَبِيرٌ ضَرِيرٌ،شَاسِعُ الدَّارِ وَلَيْسَ لِي قَائِدٌ يُلَاوِمُنِي،فَهَلْ تَجِدُ لِي مِنْ رُخْصَةٍ قَالَ: «هَلْ تَسْمَعُ النِّدَاءَ؟»،قُلْتُ: نَعَمْ،قَالَ: «مَا أَجِدُ لَكَ رُخْصَةً»";
ibnemaja.urdu = "سیدنا ابن ام مکتوم رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ سے عرض کیا: میں بوڑھا اور نابینا ہوں،میرا گھر دور ہے اور کوئی میری مرضی کے مطابق مجھے(مسجد میں) لانے والا نہیں،تو کیا مجھے (جماعت کے بغیر گھر میں نماز پڑھنے کی) اجازت مل سکتی ہے؟ آپ ﷺ نے فرمایا: ’’تم اذان سنتے ہو؟‘‘ میں نے کہا: جی ہاں،فرمایا: ’’تم کو (نماز باجماعت سے پیچھے رہنے کی) کوئی اجازت نہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (552)`;
ibnemaja.anwaar = [407,1];