var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ قَالَ: أَنْبَأَنَا هُشَيْمٌ،عَنْ شُعْبَةَ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَنْ سَمِعَ النِّدَاءَ فَلَمْ يَأْتِهِ،فَلَا صَلَاةَ لَهُ،إِلَّا مِنْ عُذْرٍ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،نبی ﷺ نے فرمایا: ’’جو شخص اذان سن کر(نماز کے لیے مسجد میں)نہیں آتا،اس کی کوئی نماز نہیں،سوائے کسی عذر کی صورت کے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;