var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ إِسْمَاعِيلَ الْهُذَلِيُّ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنِ ابْنِ أَبِي ذِئْبٍ،عَنِ الزَّبْرِقَانِ بْنِ عَمْرٍو الضَّمْرِيِّ،عَنْ أُسَامَةَ بْنِ زَيْدٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيَنْتَهِيَنَّ رِجَالٌ عَنْ تَرْكِ الْجَمَاعَةِ،أَوْ لَأُحَرِّقَنَّ بُيُوتَهُمْ»";
ibnemaja.urdu = "سیدنا اسامہ بن زید رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’لوگوں کو چاہیے کہ جماعت ترک کرنے سے باز آجائیں،ورنہ میں ضرور ان کے گھروں کو آگ لگا دوں گا۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;