var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: أَنْبَأَ أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَثْقَلَ الصَّلَاةِ عَلَى الْمُنَافِقِينَ صَلَاةُ الْعِشَاءِ،وَصَلَاةُ الْفَجْرِ،وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لَأَتَوْهُمَا وَلَوْ حَبْوًا»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’منافقوں پر جو نمازیں سب سے بھاری ہیں،وہ عشاء کی نماز اور فجر کی نماز ہے،اور اگر انہیں معلوم ہوتا کہ ان میں کیا کچھ ہے،تو وہ ضرور حاضر ہوتے خواہ گھسٹ کر آنا پڑتا۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;