var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ،عَنْ عُمَارَةَ بْنِ غَزِيَّةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ كَانَ يَقُولُ: «مَنْ صَلَّى فِي مَسْجِدٍ جَمَاعَةً أَرْبَعِينَ لَيْلَةً،لَا تَفُوتُهُ الرَّكْعَةُ الْأُولَى مِنْ صَلَاةِ الْعِشَاءِ،كَتَبَ اللَّهُ لَهُ بِهَا عِتْقًا مِنَ النَّارِ»";
ibnemaja.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ سے روایت ہے،نبی ﷺ فرمایا کرتے تھے،’’جو شخص کسی مسجد میں چالیس رات(مسلسل) باجماعت نماز ادا کرے،اس کی نماز عشاء کی پہلی رکعت (جماعت سے) نہ چھوٹے،اللہ تعالیٰ اس عمل کی وجہ سے اس کے لئے جہنم سے آزادی لکھ دیتا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ عمارۃ لم یدرک أنسًا ولم یلقہ‘‘ فالسند منقطع`;
ibnemaja.anwaar = [407,1];