var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا شَبَابَةُ قَالَ: حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ،عَنِ الْمَقْبُرِيِّ،عَنْ سَعِيدِ بْنِ يَسَارٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَا تَوَطَّنَ رَجُلٌ مُسْلِمٌ الْمَسَاجِدَ لِلصَّلَاةِ وَالذِّكْرِ،إِلَّا تَبَشْبَشَ اللَّهُ لَهُ،كَمَا يَتَبَشْبَشُ أَهْلُ الْغَائِبِ بِغَائِبِهِمْ إِذَا قَدِمَ عَلَيْهِمْ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’جو مسلمان مرد نماز اور ذکر کے لئے مسجدوں میں پابندی سے حاضر ہوتا ہے،اللہ تعالیٰ اس سے ایسا خوش ہوتا ہے،جس طرح مسافر کے گھر والے اس کے گھر آنے پر خوش ہوتے ہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;