var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ،عَنْ عَمْرِو بْنِ الْحَارِثِ،عَنْ دَرَّاجٍ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا رَأَيْتُمُ الرَّجُلَ يَعْتَادُ الْمَسَاجِدَ،فَاشْهَدُوا لَهُ بِالْإِيمَانِ،قَالَ اللَّهُ تَعَالَى: إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ [التوبة: 18] الْآيَةَ";
ibnemaja.urdu = "سیدنا ابو سعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب تم کسی کو مسجدوں میں جاتے دیکھو تو اس کے ایمان کی گواہی دو۔اللہ نے فرمایا:﴿ اِنَّمَا یَعْمُرُ مَسٰجِدَ اللہِ مَنْ اٰمَنَ بِاللہِ ﴾’’اللہ کی مسجدوں کو وہی آباد کرتا ہے جو اللہ پر ایمان رکھتا ہے۔۔۔۔‘‘۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;