var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الطَّنَافِسِيُّ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ قَالَ: حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ،قَالَ: سَمِعْتُ أَبَا حُمَيْدٍ السَّاعِدِيَّ يَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِذَا قَامَ إِلَى الصَّلَاةِ،اسْتَقْبَلَ الْقِبْلَةَ،وَرَفَعَ يَدَيْهِ،وَقَالَ: اللَّهُ أَكْبَرُ";
ibnemaja.urdu = "سیدنا حمید ساعدی رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا:‘‘رسول اللہ ﷺ جب نماز کے لئے کھڑے ہوتے قبلے کی طرف منہ کرتے،اپنے دونوں ہاتھ اٹھاتے اور کہتے (اللہ اکبر) اللہ سب سے بڑا ہے۔’’";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;