var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ مَنْصُورٍ،عَنْ رِبْعِيٍّ،عَنْ عَلِيٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يُؤْمِنُ عَبْدٌ حَتَّى يُؤْمِنَ بِأَرْبَعٍ: بِاللَّهِ وَحْدَهُ لَا شَرِيكَ لَهُ،وَأَنِّي رَسُولُ اللَّهِ،وَبِالْبَعْثِ بَعْدَ الْمَوْتِ،وَالْقَدَرِ";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے اللہ کے رسول ﷺ نے فرمایا:‘‘کوئی بندہ مومن نہیں ہوسکتا حتٰی کہ وہ چار چیزوں پر ایمان رکھے: اللہ پر جو اکیلا ہے اس کا کوئی شریک نہیں،اس بات پر کہ میں(محمدﷺ) اللہ کا رسول ہوں،موت کے بعد زندہ ہو کر اٹھنے پر اور تقدیر پر۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (2145)`;
ibnemaja.anwaar = [377,1];