var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،ح وَحَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ قَالَ: حَدَّثَنَا بِشْرُ بْنُ الْمَفَضَّلِ،قَالَا: حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ،عَنْ أَبِيهِ،عَنْ وَائِلِ بْنِ حُجْرٍ،قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي،فَأَخَذَ شِمَالَهُ بِيَمِينِهِ»";
ibnemaja.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو نماز پڑھتے دیکھا۔آپ ﷺ نے دائیں ہاتھ سے بائیں ہاتھ کو پکڑ لیا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;