var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو إِسْحَاقَ الْهَرَوِيُّ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ قَالَ: أَنْبَأَنَا هُشَيْمٌ قَالَ: أَنْبَأَنَا الْحَجَّاجُ بْنُ أَبِي زَيْنَبَ السُّلَمِيُّ،عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ: مَرَّ بِيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا وَاضِعٌ يَدِي الْيُسْرَى عَلَى الْيُمْنَى «فَأَخَذَ بِيَدِي الْيُمْنَى فَوَضَعَهَا عَلَى الْيُسْرَى»";
ibnemaja.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ میرے پاس سے گزرے،میں نے (نماز میں) اپنے دائیںہاتھ پر بایاں ہاتھ رکھا ہوا تھا۔آپ ﷺ نے میرا دایاں ہاتھ پکڑا اور اسے بائیں ہاتھ پر رکھ دیا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;