var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ حُسَيْنٍ الْمُعَلِّمِ،عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ،عَنْ أَبِي الْجَوْزَاءِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَفْتَتِحُ الْقِرَاءَةَ بِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ [الفاتحة: 2]";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا:﴿ اَلْحَمْدُ لِلّٰہِ رَبِّ الْعٰلَمِیْنَ ﴾ سے قراءت کی ابتدا فرماتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;