var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا سُفْيَانُ،عَنْ أَيُّوبَ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،ح وَحَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَأَبُو بَكْرٍ،وَعُمَرُ يَفْتَتِحُونَ الْقِرَاءَةَ بِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ،سیدنا ابو بکر اور سیدنا عمر رضی اللہ عنہما ﴿ اَلْحَمْدُ لِلّٰہِ رَبِّ الْعٰلَمِیْنَ ﴾ سے قراءت شروع کرتےتھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;