var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَبَكْرُ بْنُ خَلَفٍ وَعُقْبَةُ بْنُ مُكْرَمٍ قَالُوا: حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ: حَدَّثَنَا بِشْرُ بْنُ رَافِعٍ،عَنْ أَبِي عَبْدِ اللَّهِ ابْنِ عَمِّ أَبِي هُرَيْرَةَ،عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْتَتِحُ الْقِرَاءَةَ بِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ [الفاتحة: 2]";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ قراءت کی ابتداء: ﴿ اَلْحَمْدُ لِلّٰہِ رَبِّ الْعٰلَمِیْنَ ﴾ سے کرتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;