var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا شَرِيكٌ وَسُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ زِيَادِ بْنِ عِلَاقَةَ،عَنْ قُطْبَةَ بْنِ مَالِكٍ،سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الصُّبْحِ وَالنَّخْلَ بَاسِقَاتٍ لَهَا طَلْعٌ نَضِيدٌ [ق: 10]";
ibnemaja.urdu = "سیدنا قطبہ بن مالک رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی ﷺ کو صبح کی نماز میں یہ آیت پڑھتے سنا(وَ النَّخْلَ بٰسِقٰتٍ لَّہَا طَلْعٌ نَّضِیْدٌ)(ق:۱۰)’’اور ہم نے کھجور کے بلند و بالادرخت پیدا کیے،جن کے خوشے تہ بہ تہ ہوتے ہیںَ‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;