var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ،عَنْ عَوْفٍ،عَنْ أَبِي الْمِنْهَالِ،عَنْ أَبِي بَرْزَةَ،ح وَحَدَّثَنَا سُوَيْدٌ قَالَ: حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ،عَنْ أَبِيهِ،حَدَّثَهُ أَبُو الْمِنْهَالِ،عَنْ أَبِي بَرْزَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «كَانَ» يَقْرَأُ فِي الْفَجْرِ مَا بَيْنَ السِّتِّينَ إِلَى الْمِائَةِ";
ibnemaja.urdu = "سیدنا ابو برزہ رضی اللہ عنہ سے وایت ہے کہ رسول اللہ ﷺ فجر کی نماز میں ساٹھ سے سو آیات تک تلاوت کرتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;