var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ حَجَّاجٍ الصَّوَّافِ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ،وَعَنْ أَبِي سَلَمَةَ،عَنْ أَبِي قَتَادَةَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي بِنَا،فَيُطِيلُ فِي الرَّكْعَةِ الْأُولَى مِنَ الظُّهْرِ،وَيُقْصِرُ فِي الثَّانِيَةِ،وَكَذَلِكَ فِي الصُّبْحِ»";
ibnemaja.urdu = "سیدنا ابو قتادہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ہمیں نماز پڑھاتے تھے تو ظہر کی پہلی رکعت میں طویل قراءت کرتے تھے،اور دوسری رکعت میں(اس سے) کم قراءت کرتے تھے۔صبح کی نماز بھی اسی طرح پڑھاتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;