var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ ابْنِ جُرَيْجٍ،عَنِ ابْنِ أَبِي مُلَيْكَةَ،عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَ: قَرَأَ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ: بِالْمُؤْمِنُونَ فَلَمَّا أَتَى عَلَى ذِكْرِ عِيسَى،أَصَابَتْهُ شَرْقَةٌ،فَرَكَعَ يَعْنِي سَعْلَةً";
ibnemaja.urdu = "سیدنا عبداللہ بن سائب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے صبح کی نماز میں سورۃ المومنوں تلاوت فرمائی،جب سیدنا عیسٰی علیہ السلام کا ذکر آیا تو آپ ﷺ کو کھانسی آگئی تو آپ رکوع میں چلے گئے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;