var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَ: حَدَّثَنَا وَكِيعٌ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،قَالَا: حَدَّثَنَا سُفْيَانُ،عَنْ مُخَوَّلٍ،عَنْ مُسْلِمٍ الْبَطِينِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الصُّبْحِ يَوْمَ الْجُمُعَةِ: الم تَنْزِيلُ السَّجْدَةَ،وَهَلْ أَتَى عَلَى الْإِنْسَانِ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ جمعہ کے دن فجر کی نماز میں (الٓمّ تَنْزِیْلُ) اور (ہَلْ اَتٰی عَلَی الْاِنْسَانِ) پڑھا کرتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;