var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ قَالَ: حَدَّثَنَا الْحَارِثُ بْنُ نَبْهَانَ قَالَ: حَدَّثَنَا عَاصِمُ ابْنُ بَهْدَلَةَ،عَنْ مُصْعَبِ بْنِ سَعْدٍ،عَنْ أَبِيهِ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ: الم تَنْزِيلُ،وَهَلْ أَتَى عَلَى الْإِنْسَانِ";
ibnemaja.urdu = "سیدنا سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جمعہ کے دن نماز فجر میں (الٓمّ تَنْزِیْلُ) اور (ہَلْ اَتٰی عَلَی الْاِنْسَانِ) پڑھا کرتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;