var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ: أَخْبَرَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنْ أَبِيهِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الصُّبْحِ يَوْمَ الْجُمُعَةِ: الم تَنْزِيلُ،وَهَلْ أَتَى عَلَى الْإِنْسَانِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جمعہ کے دن صبح کی نماز میں (الٓمّ تَنْزِیْلُ) اور (ہَلْ اَتٰی عَلَی الْاِنْسَانِ) پڑھا کرتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;