var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ قَالَ قُلْنَا لِخَبَّابٍ بِأَيِّ شَيْءٍ كُنْتُمْ تَعْرِفُونَ قِرَاءَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الظُّهْرِ وَالْعَصْرِ قَالَ بِاضْطِرَابِ لِحْيَتِهِ";
ibnemaja.urdu = "جناب ابو معمر رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں نے سیدنا خباب رضی اللہ عنہ سے کہا: آپ لوگوں کو ظہر اور عصر میں رسول اللہ ﷺ کی قراءت کا کس طرح علم ہوتا تھا؟ انہوں نے فرمایا: آپ کی ریش مبارک کی حرکت سے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;