var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ: حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ،عَنْ أَبِيهِ،قَالَ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِنَا فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنْ صَلَاةِ الظُّهْرِ،وَيُسْمِعُنَا الْآيَةَ أَحْيَانًا»";
ibnemaja.urdu = "سیدنا ابو قتادہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ہمیں نماز پڑھاتے ہوئے ظہر کی پہلی دو رکعتوں میں قراءت کرتے تھے اور کبھی کبھی ہمیں آیت سنا دیتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;