var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ قَالَ: حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ،عَنْ هَاشِمِ بْنِ الْبَرِيدِ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْبَرَاءِ بْنِ عَازِبٍ،قَالَ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِنَا الظُّهْرَ،فَنَسْمَعُ مِنْهُ الْآيَةَ بَعْدَ الْآيَاتِ،مِنْ سُورَةِ لُقْمَانَ،وَالذَّارِيَاتِ»";
ibnemaja.urdu = "سیدنا براء بن عازب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ ہمیں ظہر کی نماز پڑھاتے تھے،اور ہمیں چند آیتوں کے بعد ایک آیت سورہٴ لقمان اور ذاریات کی سنائی دیتی تھی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نسائي (972)`;
ibnemaja.anwaar = [407,2];