var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنِ ابْنِ عَبَّاسٍ،عَنْ أُمِّهِ-قَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ هِيَ لُبَابَةُ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَقْرَأُ فِي الْمَغْرِبِ بِالْمُرْسَلَاتِ عُرْفًا»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما نے اپنی والدہ (سیدہ لبابہ رضی اللہ عنہا) سے روایت کیا کہ انہوں نے رسول اللہ ﷺ کو مغرب کی نماز میں(وَ الْمُرْسَلٰتِ عُرْفًا)(سورہٴ مرسلات)پڑھتے سنا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;