var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ بُدَيْلٍ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْمَغْرِبِ: قُلْ يَا أَيُّهَا الْكَافِرُونَ،وَقُلْ هُوَ اللَّهُ أَحَدٌ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ مغرب کی نماز میں (قُلْ یٰٓاَیُّہَا الْکٰفِرُوْنَ) اور(قُلْ ہُوَ اللہُ اَحَدٌ) تلاوت کیا کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال ابن عدي: ’’ أحمد بن بدیل یروي عن حفص بن غیاث وغیرہ مناکیر … و ھو ممن یکتب حدیثہ مع ضعفہ‘‘ <br>(الکامل 189/1،190)`;
ibnemaja.anwaar = [408,1];