var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا سُفْيَانُ،ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ قَالَ: حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ جَمِيعًا،عَنْ مِسْعَرٍ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنِ الْبَرَاءِ،مِثْلَهُ قَالَ: فَمَا سَمِعْتُ إِنْسَانًا أَحْسَنَ صَوْتًا،-أَوْ قِرَاءَةً مِنْهُ-";
ibnemaja.urdu = "سیدنا براء بن عازب رضی اللہ عنہ سے روایت ہے،انہوں نے مذکورہ بالا ارشاد فرما کر کہا: میں نے رسول اللہ ﷺ سے زیادہ خوش آواز یا اچھی قراءت کرنے والا کوئی انسان نہیں سنا۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;