var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ: أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ مُعَاذَ بْنَ جَبَلٍ صَلَّى بِأَصْحَابِهِ الْعِشَاءَ،فَطَوَّلَ عَلَيْهِمْ،فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «اقْرَأْ بِالشَّمْسِ وَضُحَاهَا،وَسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى،وَاللَّيْلِ إِذَا يَغْشَى،وَاقْرَأْ بِاسْمِ رَبِّكَ»";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت کہ سیدنا معاذ بن جبل رضی اللہ عنہ نے اپنے مقتدیوں کو عشاء کی نماز پڑھائی اور اس میں طویل قراءت کی تو نبی ﷺ نے فرمایا: ’’تم (ایسی سورتیں) پڑھا کرو: (وَالشَّمْسِ وَضُحٰیہَا-سَبِّحِ اسْمَ رَبِّکَ الْاَعْلَی-وَالَّیْلِ اِذَا یَغْشٰی-اور اِقْرَاْ بِاسْمِ رَبِّکَ)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;