var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،وَسَهْلُ بْنُ أَبِي سَهْلٍ،وَإِسْحَاقُ بْنُ إِسْمَاعِيلَ،قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ مَحْمُودِ بْنِ الرَّبِيعِ،عَنْ عُبَادَةَ بْنِ الصَّامِتِ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ فِيهَا بِفَاتِحَةِ الْكِتَابِ»";
ibnemaja.urdu = "سیدنا عبادہ بن صامت رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جس نے نماز میں سورہٴ فاتحہ نہیں پڑھی اس کی کوئی نماز نہیں۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;