var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ،ح وَحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ جَمِيعًا،عَنْ أَبِي سُفْيَانَ السَّعْدِيِّ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي سَعِيدٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ فِي كُلِّ رَكْعَةٍ بِالْحَمْدُ لِلَّهِ وَسُورَةٍ،فِي فَرِيضَةٍ أَوْ غَيْرِهَا»";
ibnemaja.urdu = "سیدنا ابو سعید رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اس شخص کی کوئی نماز نہیں جو فرض اور نفل نماز کی ہر رکعت میں(اَلْحَمْدُ لِلّٰہِ) اور اس کے ساتھ کوئی اور سورت نہیں پڑھتا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>أبو سفیان السعدي طریف بن شہاب: ضعیف`;
ibnemaja.anwaar = [408,1];