var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ الْجَزَرِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «كُلُّ صَلَاةٍ لَا يُقْرَأُ فِيهَا بِأُمِّ الْكِتَابِ فَهِيَ خِدَاجٌ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے یہ ارشاد مبارک سنا:’’ہر وہ نماز جس میں ام الکتاب (سورہٴ فاتحہ) نہ پڑھی جائے وہ خداج) ناقص ہے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;