var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْوَلِيدُ بْنُ عَمْرِو بْنِ السُّكَيْنِ قَالَ: حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ السَّلْعِيُّ قَالَ: حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ صَلَاةٍ لَا يُقْرَأُ فِيهَا بِفَاتِحَةِ الْكِتَابِ فَهِيَ خِدَاجٌ،فَهِيَ خِدَاجٌ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’ہر وہ نماز جس میں سورہٴ فاتحہ نہ پڑھی وہ ناقص ہے،وہ ناقص ہے۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;