var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ يَحْيَى،عَنْ يُونُسَ بْنِ مَيْسَرَةَ،عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ،عَنْ أَبِي الدَّرْدَاءِ،قَالَ: سَأَلَهُ رَجُلٌ فَقَالَ: أَقْرَأُ وَالْإِمَامُ يَقْرَأُ؟ قَالَ: سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَفِي كُلِّ صَلَاةٍ قِرَاءَةٌ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ» فَقَالَ رَجُلٌ مِنَ الْقَوْمِ: وَجَبَ هَذَا";
ibnemaja.urdu = "سیدنا ابو درداء رضی اللہ عنہ سے روایت ہے،ان سے ایک شخص نے سوال کیا: کیا میں اس وقت بھی قراءت کیا کروں جب امام قراءت کر رہا ہو؟ سیدنا ابو درداء رضی اللہ عنہ نے فرمایا: ایک آدمی نے نبی ﷺ سے سوال کیا تھا: کیا ہر نماز میں قراءت ہے؟ تو رسول اللہ ﷺ نے فرمایا: ’’ہاں‘‘۔حاضرین میں سے ایک صاحب نے کہا: یہ تو واجب ہوگئی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>معاویۃ بن یحیی الصدفي أبو روح: ضعیف`;
ibnemaja.anwaar = [408,1];