var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى الْقَطَّانُ قَالَ: حَدَّثَنَا جَرِيرٌ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،عَنْ قَتَادَةَ،عَنْ أَبِي غَلَّابٍ،عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ،عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَرَأَ الْإِمَامُ فَأَنْصِتُوا،فَإِذَا كَانَ عِنْدَ الْقَعْدَةِ،فَلْيَكُنْ أَوَّلَ ذِكْرِ أَحَدِكُمْ التَّشَهُّدُ»";
ibnemaja.urdu = "سیدنا ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’جب امام قراءت کرے تو خاموش رہو،اور جب وہ قعدہ تک پہنچ جائے تو سب سے پہلے اللہ کا جو ذکر کرو،تو تشھد ہونا چاہیے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;