var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ: حَدَّثَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنِ ابْنِ أُكَيْمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَذَكَرَ نَحْوَهُ،وَزَادَ فِيهِ: قَالَ: فَسَكَتُوا بَعْدُ فِيمَا جَهَرَ فِيهِ الْإِمَامُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے ہمیں نماز پڑھائی۔۔۔۔اس کے بعد راوی نے پوری حدیث ذکر کی،اس کے آخر میں یہ اجافہ ہے۔اس کے بعد صحابہ نے ان نمازوں میں خاموشی اختیار فرمائی جن میں امام بلند آواز سے قراءت کرتا ہے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;