var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،عَنِ الْحَسَنِ بْنِ صَالِحٍ،عَنْ جَابِرٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ لَهُ إِمَامٌ،فَقِرَاءَةُ الْإِمَامِ لَهُ قِرَاءَةٌ»";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جس کا کوئی امام ہو تو امام کی قراءت اسی کی قراءت ہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>قال البو صیري: ’’ ھذا إسناد ضعیف،جابر ہو ابن یزید الجعفي متھم ‘‘ جابر الجعفي ضعیف رافضي <br>وأبو الزبیر عنعن <br>وللحدیث شواہد کلھا ضعیفۃ۔`;
ibnemaja.anwaar = [408,1];