var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَمَّنَ الْقَارِئُ فَأَمِّنُوا،فَإِنَّ الْمَلَائِكَةَ تُؤَمِّنُ،فَمَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ،غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسولا للہ ﷺ نے فرمایا: ’’جب قراءت کرنے والا (امام) آمین کہے تو تم بھی آمین کہو کیوں فرشتے بھی آمین کہتے ہیں تو جس کی آمین فرشتوں کی آمین سے مل گئی اس کے گزشتہ گناہ معاف ہو جائیں گے۔‘‘";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;