var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ: حَدَّثَنَا بِشْرُ بْنُ رَافِعٍ،عَنْ أَبِي عَبْدِ اللَّهِ ابْنِ عَمِّ أَبِي هُرَيْرَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: تَرَكَ النَّاسُ التَّأْمِينَ،وَكَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ: غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ [الفاتحة: 7]،قَالَ: «آمِينَ» حَتَّى يَسْمَعَهَا أَهْلُ الصَّفِّ الْأَوَّلِ،فَيَرْتَجُّ بِهَا الْمَسْجِدُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: لوگوں نے آمین کہنا چھوڑ دیا ہے۔حالانکہ رسول اللہ ﷺ جب (غَیْرِ الْمَغْضُوْبِ عَلَیْہِمْ وَ لَا الضَّآلِّیْنَ) کہتے تھے تو (بلند آواز سے) آمین کہتے تھے حتی کہ پہلی صف والے سن لیتے،پھر اس (آمین) کی آواز سے مسجد گونج اٹھتی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (934)`;
ibnemaja.anwaar = [408,1];