var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ: حَدَّثَنَا ابْنُ أَبِي لَيْلَى،عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،عَنْ حُجَيَّةَ بْنِ عَدِيٍّ،عَنْ عَلِيٍّ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ: «وَلَا الضَّالِّينَ» قَالَ «آمِينَ»";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا کہ جب آپ نے (وَ لَا الضَّآلِّیْنَ) کہا تو فرمایا: ’’آمین‘‘۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;