var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ،قَالَا: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ أَبِي إِسْحَاقَ،عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ،عَنْ أَبِيهِ،قَالَ: صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَلَمَّا قَالَ: «وَلَا الضَّالِّينَ» قَالَ «آمِينَ» فَسَمِعْنَاهَا";
ibnemaja.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کی اقتدا میں نماز پڑھی جب نبی ﷺ نے (وَ لَا الضَّآلِّیْنَ)کہا تو فرمایا: ’’آمیں‘‘ ہم سب نے آپ کی آمین سنی۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>نسائي (933) وانظر الحدیث الآتي طرفہ (3802)<br>و حدیث أبي داود (932،933) یغني عنہ`;
ibnemaja.anwaar = [408,1];