var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ: حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَا حَسَدَتْكُمُ الْيَهُودُ عَلَى شَيْءٍ،مَا حَسَدَتْكُمْ عَلَى السَّلَامِ وَالتَّأْمِينِ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے نبی ﷺ نے فرمایا: ’’یہودی تم سے کسی چیز پر اتنا حسد نہیں کرتے،جتنا سلام اور آمین پر تم سے حسد کرتے ہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;