var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الْخَلَّالُ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ،وَأَبُو مُسْهِرٍ،قَالَا: حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ بْنِ صُبَيْحٍ الْمُرِّيُّ قَالَ: حَدَّثَنَا طَلْحَةُ بْنُ عَمْرٍو،عَنْ عَطَاءٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا حَسَدَتْكُمُ الْيَهُودُ عَلَى شَيْءٍ،مَا حَسَدَتْكُمْ عَلَى آمِينَ،فَأَكْثِرُوا مِنْ قَوْلِ آمِينَ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’یہودی تم سے کسی بات پر اتنا حسد نہیں کرتے جتنا تم سے آمین پر حسد کرتے ہیں،اس لئے آمین کثرت سے کہا کرو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>قال البوصیري: ’’ ھذا إسناد ضعیف،لإتفاقھم علی ضعف طلحۃ بن عمرو ‘‘ طلحۃ: متروک (تقریب: 3030)<br>و الحدیث السابق (الأصل: 856) یغني عنہ`;
ibnemaja.anwaar = [408,2];