var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ: حَدَّثَنَا هِشَامٌ،عَنْ قَتَادَةَ،عَنْ نَصْرِ بْنِ عَاصِمٍ،عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «كَانَ إِذَا كَبَّرَ رَفَعَ يَدَيْهِ حَتَّى يَجْعَلَهُمَا قَرِيبًا مِنْ أُذُنَيْهِ،وَإِذَا رَكَعَ صَنَعَ مِثْلَ ذَلِكَ،وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ صَنَعَ مِثْلَ ذَلِكَ»";
ibnemaja.urdu = "سیدنا مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب اللہ اکبر کہتے تو اپنے ہاتھ اٹھاتے حتی کہ کانوں کے قریب لے جاتے۔اور جب رکوع کرتے تو اسی طرح کرتے اور جب رکوع سے سر اٹھاتے تو اسی طرح کرتے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;