var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ،قَالَا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ،عَنْ صَالِحِ بْنِ كَيْسَانَ،عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ فِي الصَّلَاةِ حَذْوَ مَنْكِبَيْهِ حِينَ يَفْتَتِحُ الصَّلَاةَ،وَحِينَ يَرْكَعُ،وَحِينَ يَسْجُدُ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو نماز میں کندھوں تک ہاتھ اٹھاتے دیکھا جب نماز شروع کرتے،جب رکوع کرتے اور جب سجدہ کرتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>صالح بن کیسان: حجازي وروایۃ إسماعیل عن الحجازین ضعیفۃ<br>انظر ضعیف سنن الترمذي (131)`;
ibnemaja.anwaar = [409,1];