var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا رِفْدَةُ بْنُ قُضَاعَةَ الْغَسَّانِيُّ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ عُمَيْرِ بْنِ حَبِيبٍ،قَالَ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ مَعَ كُلِّ تَكْبِيرَةٍ فِي الصَّلَاةِ الْمَكْتُوبَةِ»";
ibnemaja.urdu = "سیدنا عمیر بن قتادہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ فرض نماز میں ہر تکبیر کے ساتھ رفع الیدین کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري ما ملخصہ: ’’ رفدۃ ضعیف و عبد اللّٰہ لم یسمع من أبیہ شیئًا ‘‘ رفدۃ بن قضاعۃ: ضعیف (تقریب: 1952) <br>وقال الھیثمي: وضعفہ الجمھور (مجمع الزوائد 269/6)`;
ibnemaja.anwaar = [409,1];