var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْهَاشِمِيُّ قَالَ: حَدَّثَنَا عُمَرُ بْنُ رِيَاحٍ،عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «كَانَ يَرْفَعُ يَدَيْهِ عِنْدَ كُلِّ تَكْبِيرَةٍ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ ہر تکبیر کے وقت رفع یدین کرتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>قال البوصیري: ’’ ھذا إسناد ضعیف،فیہ عمر بن ریاح وقد اتفقوا علی تضعیفہ‘‘ عمر بن ریاح: متروک وکذّبہ بعضھم (تقریب: 4896)`;
ibnemaja.anwaar = [409,1];