var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ حُسَيْنٍ الْمُعَلِّمِ،عَنْ بُدَيْلٍ،عَنْ أَبِي الْجَوْزَاءِ،عَنْ عَائِشَةَ قَالَتْ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا رَكَعَ لَمْ يَشْخَصْ رَأْسَهُ،وَلَمْ يُصَوِّبْهُ،وَلَكِنْ بَيْنَ ذَلِكَ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جب رکوع کرتے تو اپنا سر نہ اونچا رکھتے،نہ اسے (بہت زیادہ) جھکا دیتے بلکہ(ان دونوں حالتوں کے) درمیان میں رکھتے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;