var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنِ الْأَعْمَشِ،عَنْ عُمَارَةَ،عَنْ أَبِي مَعْمَرٍ،عَنْ أَبِي مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُجْزِئُ صَلَاةٌ لَا يُقِيمُ الرَّجُلُ فِيهَا صُلْبَهُ فِي الرُّكُوعِ وَالسُّجُودِ»";
ibnemaja.urdu = "سیدنا ابو مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص رکوع اور سجدے میں کمر سیدھی نہیں کرتا اس کی نماز درست نہیں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;