var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ يُوسُفَ الْفِرْيَابِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ عَطَاءٍ قَالَ: حَدَّثَنَا طَلْحَةُ بْنُ زَيْدٍ،عَنْ رَاشِدٍ،قَالَ: سَمِعْتُ وَابِصَةَ بْنَ مَعْبَدٍ،يَقُولُ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي،«فَكَانَ إِذَا رَكَعَ سَوَّى ظَهْرَهُ،حَتَّى لَوْ صُبَّ عَلَيْهِ الْمَاءُ لَاسْتَقَرَّ»";
ibnemaja.urdu = "سیدنا وابصہ بن معبد رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو نماز پڑھتے دیکھا۔آپ ﷺ جب رکوع کرتے تھے تو کمر اس قدر برابر کرتے تھے کہ اگر کمر پر پانی ڈالا جائے تو ٹھہر جائے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `ضعیف <br>طلحۃ بن زید: متروک،قال أحمد وعلي وأبو داود: کان یضع (تقریب: 3020) <br>راشد: مجھول <br>وعبد اللّٰہ بن عثمان بن عطاء لین الحدیث (تقریب: 1858،3469)`;
ibnemaja.anwaar = [409,1];