var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ،قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ،عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ،عَنْ مُصْعَبِ بْنِ سَعْدٍ،قَالَ: رَكَعْتُ إِلَى جَنْبِ أَبِي،فَطَبَّقْتُ،فَضَرَبَ يَدِي وَقَالَ: «قَدْ كُنَّا نَفْعَلُ هَذَا،ثُمَّ أُمِرْنَا أَنْ نَرْفَعَ إِلَى الرُّكَبِ»";
ibnemaja.urdu = "سیدنا مصعب بن سعد رحمہ اللہ سے روایت ہے،انہوں نے فرمایا: میں نے اپنے والد (سیدنا سعد بن ابی وقاص رضی اللہ عنہ) کے قریب(نماز پڑھتے ہوئے) رکوع کیا تو تطبیق کی۔انہوں نے میرے ہاتھ پر مارا اور فرمایا: ہم پہلے اس طرح کیا کرتے تھے،پھر ہمیں حکم دیا گیا کہ (ہاتھ) گھٹنوں کے اوپر رکھیں۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;