var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ حَارِثَةَ بْنِ أَبِي الرِّجَالِ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَرْكَعُ،فَيَضَعُ يَدَيْهِ عَلَى رُكْبَتَيْهِ،وَيُجَافِي بِعَضُدَيْهِ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ رکوع کرتے تھے تو اپنے ہاتھ گھٹنوں پر رکھتے تھے اور بازوؤں کو(پہلوؤں سے) دور رکھتے تھے۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;