var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ رَبَّنَا وَلَكَ الْحَمْدُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب (سَمِعَ اللَّہُ لِمَنْ حَمِدَہُ) کہتے تو (اس کے بعد (رَبَّنَا وَلَکَ الْحَمْدُ) کہتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;