var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب امام کہے: (سَمِعَ اللَّہُ لِمَنْ حَمِدَہُ) ’’اللہ اس کی بات سنتا ہے جو اس کی تعریف کرتا ہے‘‘ تو کہو(رَبَّنَا وَلَکَ الْحَمْدُ) ’’اےہمارے رب! اور تیرے لئے ہی سب تعریفیں ہیں۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;