var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ يَزِيدَ الرَّقَاشِيِّ،عَنْ غُنَيْمِ بْنِ قَيْسٍ،عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الْقَلْبِ مَثَلُ الرِّيشَةِ تُقَلِّبُهَا الرِّيَاحُ بِفَلَاةٍ»";
ibnemaja.urdu = "حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ دل کی مثال ایک پر کی سی ہے،جسے ہوائیں چٹیل میدان میں الٹا پلٹاتی رہتی ہیں۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>یزید الرقاشي ضعیف <br>وللحدیث شواھد ضعیفۃ عند أحمد (408/4،419) وغیرہ وقال أبوموسی الأشعري رضي اللّٰہ عنہ: ’’ إنما سمي القلب قلبًا لتقلبہ و إنما مثل القلب مثل ریشۃ بفلاۃ من الأرض ‘‘ رواہ علي بن الجعد في مسندہ (145) و أبو نعیم في حلیۃ الأولیاء (1/ 261) وسندہ صحیح`;
ibnemaja.anwaar = [378,1];