var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَصَمِّ عَنْ عَمِّهِ يَزِيدَ بْنِ الْأَصَمِّ عَنْ مَيْمُونَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ جَافَى يَدَيْهِ فَلَوْ أَنَّ بَهْمَةً أَرَادَتْ أَنْ تَمُرَّ بَيْنَ يَدَيْهِ لَمَرَّتْ";
ibnemaja.urdu = "سیدہ میمونہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ جب سجدہ کرتے تو ہاتھوں (اور بازوؤں) کو (پہلوؤں سے) الگ کرتے۔اگر کوئی میمنا سامنے سے (بازوؤں کے نیچے سے) گزرنا چاہتا تو گزر جاتا۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;