var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَضَعَ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا قَامَ مِنْ السُّجُودِ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ";
ibnemaja.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو دیکھا کہ جب آپ سجدہ کرتے تھے تو ہاتھوں سے پہلے گھٹنے(زمین پر) رکھتے تھے اور جب سجدے سے سر اٹھاتے تھے تو گھٹنوں سے پہلے ہاتھ اٹھاتے تھے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (838) ترمذي (268) نسائي (1090)`;
ibnemaja.anwaar = [409,1];