var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ عَنْ الْحَسَنِ حَدَّثَنَا أَحْمَرُ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ كُنَّا لَنَأْوِي لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يُجَافِي بِيَدَيْهِ عَنْ جَنْبَيْهِ إِذَا سَجَدَ";
ibnemaja.urdu = "رسول اللہ ﷺ کے صحابی سیدنا احمر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ جب سجدہ کرتے تو ہاتھوں(اور بازوؤں) کو پہلوؤں سے اتنا دور کرتے کہ ہمیں (اس مشقت کی کیفیت کو دیکھ کر) ترس آتا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;