var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا ابْنُ لَهِيعَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ أَبِي الْأَزْهَرِ عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا رَكَعَ سُبْحَانَ رَبِّيَ الْعَظِيمِ ثَلَاثَ مَرَّاتٍ وَإِذَا سَجَدَ قَالَ سُبْحَانَ رَبِّيَ الْأَعْلَى ثَلَاثَ مَرَّاتٍ";
ibnemaja.urdu = "سیدنا حذیفہ بن یمان رضی اللہ عنہ سے روایت ہے،انہوں نے رسول اللہ ﷺ کو سنا کہ جب آپ رکوع کرتے تو تین بار (سُبْحَانَ رَبِّیَ الْعَظِیمِ) کہتے اور جب سجدہ کرتے تو تین بار (سُبْحَانَ رَبِّیَ الأَعْلَی) کہتے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>ابن لھیعۃ ضعیف لإختلاطہ یدلس <br>وأبو الأزھر المصري: مستور`;
ibnemaja.anwaar = [409,1];