var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ أَنْ يَقُولَ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ رکوع اور سجدے میں یہ دعا کثرت سے پڑھتے تھے:(سُبْحَانَکَ اللَّہُمَّ وَبِحَمْدِکَ،اللَّہُمَّ اغْفِرْ لِی) ’’اے اللہ! میں تیری تعریف کے ساتھ پاکیزگی بیان کرتا ہوں،اے اللہ! مجھے بخش دے۔‘‘ آپ(اس دعا کے ذریعے سے) قرآن پر عمل کرتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;