var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ أَحَدُكُمْ فَلْيَعْتَدِلْ وَلَا يَفْتَرِشْ ذِرَاعَيْهِ افْتِرَاشَ الْكَلْبِ";
ibnemaja.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب کوئی شخص سجدہ کرے تو اعتدال و اختیار کرے اور اپنے بازو اس طرح نہ پھیلائے جس طرح کتا پھیلاتا ہے۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;