var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اعْتَدِلُوا فِي السُّجُودِ وَلَا يَسْجُدْ أَحَدُكُمْ وَهُوَ بَاسِطٌ ذِرَاعَيْهِ كَالْكَلْبِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’سجدے میں اعتدال اختیار کرو اور سجدہ کرتے وقت کتے کی طرح بازو(زمین پر) نہ پھیلاؤ۔‘‘";
ibnemaja.hukam = "متفق علیہ";
ibnemaja.description = ``;