var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقْعِ بَيْنَ السَّجْدَتَيْنِ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے مجھ سے فرمایا: ’’دو سجدوں کے درمیان اس طرح نہ بیٹھ کہ سرین اور ایڑیاں زمین پر ہوں اور دونوں پنڈلیاں کھڑی ہوں۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ترمذي (282)`;
ibnemaja.anwaar = [410,1];