var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا الْعَلَاءُ أَبُو مُحَمَّدٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعْتَ رَأْسَكَ مِنْ السُّجُودِ فَلَا تُقْعِ كَمَا يُقْعِي الْكَلْبُ ضَعْ أَلْيَتَيْكَ بَيْنَ قَدَمَيْكَ وَأَلْزِقْ ظَاهِرَ قَدَمَيْكَ بِالْأَرْضِ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے مجھ سے فرمایا: ’’جب تو سجدے سے سر اٹھائے تو اس طرح نہ بیٹھ جس طرح کتا بیٹھا ہے۔اپنے سرین اپنے قدموں کے درمیان رکھ اور پاؤں کی اوپر کی سمت زمین سے ملا دے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>العلاء بن زید: متروک ورماہ أبو الولید بالکذب (تقریب: 5239) والسند ضعفہ البوصیري`;
ibnemaja.anwaar = [410,1];