var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ حَدَّثَنَا الْعَلَاءُ بْنُ الْمُسَيَّبِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ طَلْحَةَ بْنِ يَزِيدَ عَنْ حُذَيْفَةَ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ بَيْنَ السَّجْدَتَيْنِ رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي";
ibnemaja.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺدو سجدوں کے درمیان یوں کہا کرتے تھے:(رب اغفرلی،رب اغفرلی) ’’اے میرے رب! مجھے بخش دے،اے میرے رب! میری مغفرت فرما۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;