var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ صَبِيحٍ،عَنْ كَامِلٍ أَبِي الْعَلَاءِ،قَالَ: سَمِعْتُ حَبِيبَ بْنَ أَبِي ثَابِتٍ يُحَدِّثُ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَ السَّجْدَتَيْنِ فِي صَلَاةِ اللَّيْلِ «رَبِّ اغْفِرْ لِي،وَارْحَمْنِي،وَاجْبُرْنِي،وَارْزُقْنِي،وَارْفَعْنِي»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ رات کی نماز(تہجد) میں دو سجدوں کے درمیان(جلسہ میں) یوں کہتے تھے:(رَبِّ اغْفِرْ لِی وَارْحَمْنِی وَاجْبُرْنِی وَارْزُقْنِی وَارْفَعْنِی) ’’اے میرے رب! میری مغفرت فرما،مجھ پر رحم کر،میرے نقص دور فرما،مجھے رزق دے اور مجھے بلندی عطا فرما۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (850) ترمذي (284)`;
ibnemaja.anwaar = [410,1];