var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عبْدِ اللَّهِ بْنِ عِيسَى،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْجَعْدِ،عَنْ ثَوْبَانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزِيدُ فِي الْعُمْرِ إِلَّا الْبِرُّ،وَلَا يَرُدُّ الْقَدَرَ إِلَّا الدُّعَاءُ،وَإِنَّ الرَّجُلَ لَيُحْرَمُ الرِّزْقَ بِخَطِيئَةٍ يَعْمَلُهَا»";
ibnemaja.urdu = "حضرت ثوبان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘صرف نیکی ہی عمر میں اضافے کا باعث ہوتی ہے اور تقدیر کو محض دعا ٹالتی ہے۔بلا شبہ انسان کو بعض اوقات ایک گناہ کے ارتکاب کی وجہ سے رزق سے محروم کر دیا جاتا ہے۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>انظر الحدیث الآتي (4022)<br>سفیان الثوري مدلس و عنعن`;
ibnemaja.anwaar = [378,1];