var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ قَالَ: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،عَنْ شُعْبَةَ،عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ،قَالَ: سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «مَا مِنْ مُسْلِمٍ يُصَلِّي عَلَيَّ،إِلَّا صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ مَا صَلَّى عَلَيَّ،فَلْيُقِلَّ الْعَبْدُ مِنْ ذَلِكَ أَوْ لِيُكْثِرْ»";
ibnemaja.urdu = "سیدنا عامر بن ربیعہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جو مسلمان مجھ پر درود پڑھتا ہے،فرشتے اس وقت تک اس کے لئے رحمت کی دعا کرتے رہتے ہیں جب تک وہ مجھ پر درود پڑھتا رہتا ہے۔اب بندہ چاہے یہ عمل کم کرے یا زیادہ کر لے(اس کی مرضی ہے۔)‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عاصم بن عبید اللّٰہ: ضعیف وضعفہ الجمھور (مجمع الزوائد 8/ 150) <br>وقال البوصیري: ’’ ھذا إسناد ضعیف ‘‘`;
ibnemaja.anwaar = [410,1];