var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ جَابِرِ بْنِ زَيْدٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ نَسِيَ الصَّلَاةَ عَلَيَّ،خَطِئَ طَرِيقَ الْجَنَّةِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جس نے مجھ پر درود پڑھنا فراموش کر دیا،وہ جنت کا راستہ بھول گیا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>جبارۃ بن مغلس: ضعیف جدًا و للحدیث شواھد ضعیفۃ`;
ibnemaja.anwaar = [410,1];