var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى الْقَطَّانُ قَالَ: حَدَّثَنَا جَرِيرٌ،عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لِرَجُلٍ «مَا تَقُولُ فِي الصَّلَاةِ؟» قَالَ: أَتَشَهَّدُ،ثُمَّ أَسْأَلُ اللَّهَ الْجَنَّةَ،وَأَعُوذُ بِهِ مِنَ النَّارِ،أَمَا وَاللَّهِ مَا أُحْسِنُ دَنْدَنَتَكَ،وَلَا دَنْدَنَةَ مُعَاذٍ،فَقَالَ: «حَوْلَهَا نُدَنْدِنُ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے ایک آدمی سے فرمایا: ’’تم نماز میں کیا پڑھتے ہو؟‘‘ اس نے کہا: میں تشہد پڑھتا ہوں،پھر اللہ سے جنت کا سوال کرتا ہوں اور جہنم سے اس کی پناہ مانگتا ہوں۔قسم ہے اللہ کی! مجھے وہ دعائیں تو آتی نہیں جو آپ آہستہ آہستہ پڑھتے رہتے ہیں یا جو معاذ رضی اللہ گنگناتے ہیں تو رسول اللہ ﷺ نے فرمایا: ’’ہم بھی یہی کچھ گنگناتے ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (792) وانظر الحدیث الآتي (3847)`;
ibnemaja.anwaar = [410,2];