var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ عِصَامِ بْنِ قُدَامَةَ،عَنْ مَالِكِ بْنِ نُمَيْرٍ الْخُزَاعِيِّ،عَنْ أَبِيهِ،قَالَ: «رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،وَاضِعًا يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى فِي الصَّلَاةِ،وَيُشِيرُ بِإِصْبَعِهِ»";
ibnemaja.urdu = "سیدنا نمیر خزاعی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو نماز میں دائیں ران پر دایاں ہاتھ رکھے ہوئے اور اپنی انگلی سے اشارہ کرتے دیکھا۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;