var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنْ عَاصِمِ بْنِ كُلَيْبٍ،عَنْ أَبِيهِ،عَنْ وَائِلِ بْنِ حُجْرٍ،قَالَ: «رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ حَلَّقَ بِالْإِبْهَامِ وَالْوُسْطَى،وَرَفَعَ الَّتِي تَلِيهِمَا،يَدْعُو بِهَا فِي التَّشَهُّدِ»";
ibnemaja.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو دیکھا کہ آپ نے انگوٹھے اور درمیان کی انگلی سے حلقہ بنایا اور اس کے قریب کی انگلی(شہادت کی انگلی) کو اٹھایا،آپ تشہد میں اس کے ساتھ (اشارہ کرتے ہوئے) دعا کر رہے تھے۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;