var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،كَانَ «يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ،السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ»";
ibnemaja.urdu = "سیدنا عبداللہ (بن مسعود) رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ دائیں طرف اور بائیں طرف سلام پھیرتے تھے حتی کہ آپ کے رخساروں کے سفیدی نظر آتی۔(اور فرماتے:) (السَّلاَمُ عَلَیْکُمْ وَرَحْمَۃُ اللَّہِ) ’’تم پر سلامتی ہو اور اللہ کی رحمت ہو۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;