var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ،عَنْ مُصْعَبِ بْنِ ثَابِتِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ،عَنْ عَامِرِ بْنِ سَعْدٍ،عَنْ أَبِيهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «كَانَ يُسَلِّمُ عَنْ يَمِينِهِ،وَعَنْ يَسَارِهِ»";
ibnemaja.urdu = "سیدنا سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ دائیں اور بائیں جانب سلام پھیرا کرتے تھے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;