var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ قَالَ: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ أَبِي إِسْحَاقَ،عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ،عَنْ أَبِي مُوسَى،قَالَ: «صَلَّى بِنَا عَلِيٌّ،يَوْمَ الْجَمَلِ،صَلَاةً ذَكَّرَنَا صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،فَإِمَّا أَنْ نَكُونَ نَسِينَاهَا،وَإِمَّا أَنْ نَكُونَ تَرَكْنَاهَا،فَسَلَّمَ عَلَى يَمِينِهِ وَعَلَى شِمَالِهِ»";
ibnemaja.urdu = "سیدنا ابو موسیٰ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: جنگِ جَمَل کے موقع پر سیدنا علی رضی اللہ عنہ نے ہمیں ایسی نماز پڑھائی کہ ہمیں رسول اللہ ﷺ کی نماز کی یاد دلا دی،جسے ہم فراموش کر چکے تھے یا (کوتاہی کی وجہ سے) چھوڑ بیٹھے تھے۔(اس نماز میں) انہوں نے دائیں طرف اور بائیں طرف سلام پھیرا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br> أبو إسحاق عنعن`;
ibnemaja.anwaar = [411,1];