var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدِينِيُّ أَحْمَدُ بْنُ أَبِي بَكْرٍ قَالَ: حَدَّثَنَا عَبْدُ الْمُهَيْمِنِ بْنُ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيُّ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَلَّمَ تَسْلِيمَةً وَاحِدَةً تِلْقَاءَ وَجْهِهِ»";
ibnemaja.urdu = "سیدنا سہل بن سعد ساعدی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے سامنے کی طرف ایک ہی سلام پھیرا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>عبدالمہیمن: ضعیف <br>وللحدیث شواہد ضعیفۃ کلہا`;
ibnemaja.anwaar = [411,1];