var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ قَالَ: حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ،عَنِ الْأَوْزَاعِيِّ،عَنِ ابْنِ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مَجُوسَ هَذِهِ الْأُمَّةِ الْمُكَذِّبُونَ بِأَقْدَارِ اللَّهِ،إِنْ مَرِضُوا فَلَا تَعُودُوهُمْ،وَإِنْ مَاتُوا فَلَا تَشْهَدُوهُمْ،وَإِنْ لَقِيتُمُوهُمْ فَلَا تُسَلِّمُوا عَلَيْهِمْ»";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:‘‘ اس امت کے مجوسی وہ ہیں اللہ کی تقدیر کا انکار کرتے ہیں،اگر وہ بیمار ہو جائیں،تو ان کی عیادت نہ کرو،اگر مر جائیں تو ان کے جنازے میں نہ جاؤ،اور اگر ان سے ملاقات ہو تو انہیں سلام نہ کہو۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ابن جریج و أبو الزبیر مدلسان وعنعنا <br>ولبعض الحدیث طرق أخری`;
ibnemaja.anwaar = [378,1];