var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ الْمِصْرِيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ رَاشِدٍ،عَنْ يَزِيدَ مَوْلَى سَلَمَةَ،عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ،قَالَ: «رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَّى،فَسَلَّمَ مَرَّةً وَاحِدَةً»";
ibnemaja.urdu = "سیدنا سلمہ بن اکوع رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا کہ آپ نے نماز ادا فرمائی تو ایک ہی سلام پھیرا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،لضعف یحیی بن راشد ‘‘ یعني المازني البراء: ضعیف (تقریب: 7545)`;
ibnemaja.anwaar = [411,1];