var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا أَبُو بَكْرٍ الْهُذَلِيُّ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا سَلَّمَ الْإِمَامُ،فَرُدُّوا عَلَيْهِ»";
ibnemaja.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: ’’جب امام سلام کہتے تو اسے(سلام کا) جواب دو۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>أبو بکر الھذلي: أخباري متروک الحدیث (تقریب: 8002)`;
ibnemaja.anwaar = [411,1];