var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ الْقَاسِمِ قَالَ: أَنْبَأَنَا هَمَّامٌ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نُسَلِّمَ عَلَى أَئِمَّتِنَا،وَأَنْ يُسَلِّمَ بَعْضُنَا عَلَى بَعْضٍ»";
ibnemaja.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ’’رسول اللہ ﷺ نے ہمیں حکم دیا کہ ہم اپنے اماموں کو سلام کہیں اور ہم ایک دوسرے کو سلام کہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (1001)`;
ibnemaja.anwaar = [411,1];