var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ قَالَ: حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ،عَنْ حَبِيبِ بْنِ صَالِحٍ،عَنْ يَزِيدَ بْنِ شُرَيْحٍ،عَنْ أَبِي حَيٍّ الْمُؤَذِّنِ،عَنْ ثَوْبَانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَؤُمُّ عَبْدٌ فَيَخُصَّ نَفْسَهُ بِدَعْوَةٍ دُونَهُمْ،فَإِنْ فَعَلَ فَقَدْ خَانَهُمْ»";
ibnemaja.urdu = "سیدنا ثوبان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’کوئی بندہ نماز پڑھائے تو انہیں (نمازیوں کو) چھوڑ کر صرف اپنے لئے دعا نہ کرے۔اگر اس نے ایسا کیا تو ان کی خیانت کی۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;