var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا شَبَابَةُ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ،عَنْ مَوْلًى لِأُمِّ سَلَمَةَ،عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: إِذَا صَلَّى الصُّبْحَ حِينَ يُسَلِّمُ «اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا،وَرِزْقًا طَيِّبًا،وَعَمَلًا مُتَقَبَّلًا»";
ibnemaja.urdu = "سیدہ ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ جب صبح کی نماز سے سلام پھیرتے تو فرماتے تھے: (اللَّہُمَّ إِنِّی أَسْأَلُکَ عِلْمًا نَافِعًا وَرِزْقًا طَیِّبًا وَعَمَلاً مُتَقَبَّلاً) ’’اے اللہ! میں تجھ سے فائدہ دینے والے علم،پاک رزق اور قبول ہونے والے عمل کا سوال کرتا ہوں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `سندہ ضعیف<br>مولی أم سلمۃ مجھول و لم یثبت في روایۃ صحیحۃ بأنہ عبد اللّٰہ بن شداد (انظر مسند الحمیدي بتحقیقي: 299)`;
ibnemaja.anwaar = [535,1];