var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،عَنْ حُسَيْنٍ الْمُعَلِّمِ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«يَنْفَتِلُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ فِي الصَّلَاةِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے رویت ہے،انہوں نے فرمایا: میں نے نبی ﷺ کو نماز سے (فارغ ہو کر) دائیں طرف مڑتے بھی دیکھا ہے اور بائیں طرف بھی۔";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;