var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ بْنِ وَاقِدٍ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنِ ابْنِ شِهَابٍ،عَنْ هِنْدٍ بِنْتِ الْحَارِثِ،عَنْ أُمِّ سَلَمَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«إِذَا سَلَّمَ قَامَ النِّسَاءُ حِينَ يَقْضِي تَسْلِيمَهُ،ثُمَّ يَلْبَثُ فِي مَكَانِهِ يَسِيرًا قَبْلَ أَنْ يَقُومَ»";
ibnemaja.urdu = "سیدہ ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: جب رسول اللہ ﷺ سلام پھیرتے تھے تو آپ کے سلام پھیرتے ہی عورتیں اٹھ کھڑی ہوتی تھیں۔اس کے بعد رسول اللہ ﷺ اٹھنے سے پہلے کچھ دیر اپنی جگہ تشریف رکھتے تھے۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;