var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «إِذَا وُضِعَ الْعَشَاءُ،وَأُقِيمَتِ الصَّلَاةُ،فَابْدَءُوا بِالْعَشَاءِ»";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب رات کا کھانا پیش کر دیا جائے اور نماز کی اقامت ہو جائے تو پہلے کھانا کھالو۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;