var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ: حَدَّثَنَا أَيُّوبُ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتِ الصَّلَاةُ،فَابْدَءُوا بِالْعَشَاءِ»،قَالَ: فَتَعَشَّى ابْنُ عُمَرَ لَيْلَةً،وَهُوَ يَسْمَعُ الْإِقَامَةَ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: جب رات کھا کھانا پیش کر دیا جائے اور نماز کھڑی ہو جائے تو پہلے کھانا کھا لو۔‘‘ امام نافع رحمہ اللہ نے فرمایا: ایک رات سیدنا ابن عمر رضی اللہ عنہما نے کھانا کھایا،حالانکہ انہیں اقامت کی آواز سنائی دے رہی تھی۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;