var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ جَمِيَعًا،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا حَضَرَ الْعَشَاءُ،وَأُقِيمَتِ الصَّلَاةُ،فَابْدَءُوا بِالْعَشَاءِ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب کھانا(سامنے) آجائے اور نماز کی اقامت ہو جائے تو پہلے کھانا کھا لو۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;