var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَادِي مُنَادِيهِ فِي اللَّيْلَةِ الْمَطِيرَةِ أَوْ اللَّيْلَةِ الْبَارِدَةِ ذَاتِ الرِّيحِ صَلُّوا فِي رِحَالِكُمْ";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کا مؤذن بارش اور تیز ہوا والی سرد رات میں اعلان کر دیا کرتا تھا:’’گھروں میں نماز پڑھ لو۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;