var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ قَالَ: حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ،عَنْ عَبَّادِ بْنِ مَنْصُورٍ،قَالَ: سَمِعْتُ عَطَاءً يُحَدِّثُ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: فِي يَوْمِ جُمُعَةٍ،يَوْمِ مَطَرٍ،«صَلُّوا فِي رِحَالِكُمْ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے بارش والے دن جمعے کے روز فرمایا:’’گھروں میں نماز پڑھ لو۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;