var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا نَفَعَنِي مَالٌ قَطُّ،مَا نَفَعَنِي مَالُ أَبِي بَكْرٍ» قَالَ: فَبَكَى أَبُو بَكْرٍ،وَقَالَ: يَا رَسُولَ اللَّهِ،هَلْ أَنَا وَمَالِي إِلَّا لَكَ يَا رَسُولَ اللَّهِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ مجھے کبھی کسی مال سے اس قدر فائدہ حاصل نہیں ہوا جس قدر ابو بکر کے مال سے مجھے فائدہ حاصل ہوا ہے۔’’حضرت ابو بکر (یہ سن کر) آبدیدہ ہو گئے اور عرض کیا: اے اللہ کے رسول! میں بھی اور میرا مال بھی آپ ہی کے لئے توہے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>الأعمش مدلس وعنعن <br>وللحدیث شاھد ضعیف عند الترمذي (3661)`;
ibnemaja.anwaar = [378,1];