var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،تُخْرَجُ لَهُ حَرْبَةٌ فِي السَّفَرِ،فَيَنْصِبُهَا،فَيُصَلِّي إِلَيْهَا";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: سفر میں نبی ﷺ کی خدمت میں برچھی پیش کی جاتی تھی۔آپ اسے (زمین میں) گاڑ کر اس کی طرف منہ کر کے نماز پڑھتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;