var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ قَالَ: حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ،عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ عَائِشَةَ قَالَتْ: «كَانَ لِرَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،حَصِيرٌ،يُبْسَطُ بِالنَّهَارِ،وَيَحْتَجِرُهُ بِاللَّيْلِ يُصَلِّي إِلَيْهِ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کی ایک چٹائی تھی،جسے دن کے وقت بچھا دیا جاتا تھا اور رات کے وقت آپ اسے اڑ بنا کر اس کی طرف (منہ کر کے) نماز پڑھتے تھے۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;