var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ،عَنْ عَمِّهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ يَعْلَمُ أَحَدُكُمْ مَا لَهُ فِي أَنْ يَمُرَّ بَيْنَ يَدَيْ أَخِيهِ،مُعْتَرِضًا فِي الصَّلَاةِ،كَانَ لَأَنْ يُقِيمَ مِائَةَ عَامٍ،خَيْرٌ لَهُ مِنَ الْخَطْوَةِ الَّتِي خَطَاهَا»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے نبی ﷺ نے فرمایا: ’’اگر کسی کو معلوم ہو کہ اپنے بھائی کے سامنے سے ایک طرف سے دوسری طرف گزرنے پر جب کہ وہ نماز پڑھ رہا ہو کتنا گناہ ہے تو وہ اپنے اٹھائے ہوئے ایک قدم کی نسبت سو سال تک ٹھہرے رہنا بہتر سمجھے۔‘‘";
ibnemaja.hukam = "إسنادہ حسن";
ibnemaja.description = ``;