var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنِ ابْنِ عَبَّاسٍ،قَالَ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِعَرَفَةَ،فَجِئْتُ أَنَا وَالْفَضْلُ عَلَى أَتَانٍ،فَمَرَرْنَا عَلَى بَعْضِ الصَّفِّ،فَنَزَلْنَا عَنْهَا وَتَرَكْنَاهَا،ثُمَّ دَخَلْنَا فِي الصَّفِّ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: نبی ﷺ میدان عرفات میں نماز پڑھ رہے تھے۔میں اور فضل رضی اللہ عنہ ایک گدھی پر سوار ہو کر آئے اور ہم صف کے کچھ حصے کے سامنے سے گزرے،پھر ہم اس سے اترے اور اسے چھوڑ دیا،پھر ہم صف میں شامل ہوگئے۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;