var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: حَدَّثَنَا قَتَادَةُ قَالَ: حَدَّثَنَا جَابِرٌ،عَنْ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَقْطَعُ الصَّلَاةَ الْكَلْبُ الْأَسْوَدُ،وَالْمَرْأَةُ الْحَائِضُ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے فرمایا: ’’کالا کتا اور حیض والی(یا بالغ) عورت نماز توڑ دیتے ہیں۔‘‘";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;