var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنِ الْحَسَنِ بْنِ عُمَارَةَ،عَنْ فِرَاسٍ،عَنِ الشَّعْبِيِّ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَبُو بَكْرٍ وَعُمَرُ سَيِّدَا كُهُولِ أَهْلِ الْجَنَّةِ مِنَ الْأَوَّلِينَ وَالْآخِرِينَ،إِلَّا النَّبِيِّينَ وَالْمُرْسَلِينَ،لَا تُخْبِرْهُمَا يَا عَلِيُّ مَا دَامَا حَيَّيْنِ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:‘‘ ابو بکر اور عمر تمام پہلے پچھلے ادھیڑ عمر جنتیوں کے سردار ہیں،نبیوں اور رسولوں کے علاوہ۔اے علی! جب تک وہ دونوں زندہ ہیں،انہیں یہ بات نہ بتانا۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا<br>الحسن بن عمارۃ: متروک <br>والحارث الأعور: ضعیف <br>وحدیث الترمذي (3666) یغني عنہ`;
ibnemaja.anwaar = [378,1];