var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ أَبُو طَالِبٍ قَالَ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ: حَدَّثَنَا أَبِي،عَنْ قَتَادَةَ،عَنْ زُرَارَةَ بْنُ أَوْفَى،عَنْ سَعْدِ بْنُ هِشَامٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَقْطَعُ الصَّلَاةَ الْمَرْأَةُ،وَالْكَلْبُ،وَالْحِمَارُ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے فرمایا: ’’عورت،کتا اور گدھا نماز توڑ دیتے ہیں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;