var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ ابْنِ عَجْلَانَ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «إِذَا صَلَّى أَحَدُكُمْ،فَلْيُصَلِّ إِلَى سُتْرَةٍ،وَلْيَدْنُ مِنْهَا،وَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ،فَإِنْ جَاءَ أَحَدٌ يَمُرُّ فَلْيُقَاتِلْهُ،فَإِنَّهُ شَيْطَانٌ»";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جب کوئی شخص نماز پڑھے تو اسے چاہیے کہ سترہ(سامنے رکھ کر اس) کی طرف نماز پڑھے اور اس سے قریب ہو کر کھڑا ہو اور کسی کو سامنے سے گزرنے نہ دے۔اگر کوئی گزرنے لگے تو اس سے لڑے کیوں کہ وہ شیطان ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;