var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «كَانَ يُصَلِّي مِنَ اللَّيْلِ،وَأَنَا مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ،كَاعْتِرَاضِ الْجِنَازَةِ»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ رات کو نماز(تہجد) ادا کرتے تھے اور میں آپ کے سامنے قبلے کی طرف اس طرح لیٹی ہوئی ہوتی تھی جس طرح جنازہ پڑا ہوتا ہے۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;