var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ،وَسُوَيْدُ بْنُ سَعِيدٍ،قَالَا حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ: حَدَّثَنَا خَالِدٌ الْحَذَّاءُ،عَنْ أَبِي قِلَابَةَ،عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ،عَنْ أُمِّهَا،قَالَتْ «كَانَ فِرَاشُهَا بِحِيَالِ مَسْجَدِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»";
ibnemaja.urdu = "سیدہ زینب بنت ابو سلمہ رضی اللہ عنہما نے اپنی والدہ(ام المومنین ام سلمہ رضی اللہ عنہا) سے روایت کرتے ہوئے فرمایا کہ ان (ام المومنین رضی اللہ عنہا) کا بستر رسول اللہ ﷺ کے سجدہ کے مقام کے برابر ہوتا تھا۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;