var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ،عَنْ الشَّيْبَانِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ،قَالَ: حَدَّثَتْنِي مَيْمُونَةُ،زَوْجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: كَانَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي وَأَنَا بِحِذَائِهِ،وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ»";
ibnemaja.urdu = "نبی ﷺ کی زوجہ محترمہ سیدہ میمونہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نماز پڑھتے تھے اور میں آپ کے برابر (لیٹی) ہوتی تھی۔جب آپ ﷺ سجدہ کرتے تو بعض اوقات مجھے آپ کا کپڑا چھو جاتا۔";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;