var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنِي أَبُو الْمِقْدَامِ،عَنْ مُحَمَّدُ بْنُ كَعْبٍ،عَنْ ابْنِ عَبَّاسٍ،قَالَ «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلَّى خَلْفَ الْمُتَحَدِّثِ وَالنَّائِمِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے باتیں کرنے والے اور سوئے ہوئے کے پیچھے نماز پڑھنے سے منع فرمایا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = `ولہ شاھد عند الطبراني فی المعجم الاوسط (6/ 118 ح 5242، وسندہ حسن / معاذ علی زئي)`;