var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ،وَعَمْرُو بْنُ عَبْدِ اللَّهِ،قَالَا: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا الْأَعْمَشُ،عَنْ عَطِيَّةَ بْنِ سَعْدٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَهْلَ الدَّرَجَاتِ الْعُلَى يَرَاهُمْ مَنْ أَسْفَلَ مِنْهُمْ كَمَا يُرَى الْكَوْكَبُ الطَّالِعُ فِي الْأُفُقِ مِنْ آفَاقِ السَّمَاءِ،وَإِنَّ أَبَا بَكْرٍ وَعُمَرَ مِنْهُمْ وَأَنْعَمَا»";
ibnemaja.urdu = "حضرت ابو سعید خدری رضی اللہ عنہ سےروایت ہے کہ اللہ کے رسول ﷺ نے فرمایا:‘‘(جنت میں) اونچے درجے والوں کو ان سے کم تردرجات والے اس طرح دیکھیں گے جیسے آسمان کے کسی افق میں طلوع ہونے والا ستارہ دیکھا جاتا ہے۔بلاشبہ ابو بکر اور عمر رضی اللہ عنہما ان(بلند درجات والوں) میں سے ہیں،بلکہ ان سے بھی اچھے ہیں۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>سنن أبي داود (3987) ترمذي (3658)`;
ibnemaja.anwaar = [378,1];