var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،عَنْ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا أَنْ «لَا نُبَادِرَ الْإِمَامَ بِالرُّكُوعِ،وَالسُّجُودِ،وَإِذَا كَبَّرَ فَكَبِّرُوا،وَإِذَا سَجَدَ فَاسْجُدُوا»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ ہمیں تعلیم دیتے تھے کہ ہم رکوع اور سجدے میں امام سے جلدی نہ کریں۔(اور فرماتے تھے کہ) جب وہ تکبیر کہے تو تم تکبیر (اللہ اکبر) کہو اور جب وہ سجدہ کرے تب تم سجدہ کرو۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;