var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،وَسُوَيْدُ بْنُ سَعِيدٍ،قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا يَخْشَى الَّذِي يَرْفَعُ رَأْسَهُ قَبْلَ الْإِمَامِ،أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جو شخص امام سے پہلے سر اٹھاتا ہے،کیا اسے اس بات سے خوف نہیں آتا کہ اللہ تعالیٰ اس کے سر کو گدھے کا سر بنادے؟";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;