var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَ: حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ قَالَ: حَدَّثَنَا هَارُونُ بْنُ هَارُونَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ التَّيْمِيُّ،عَنْ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ مِنَ الْجَفَاءِ أَنَّ يُكْثِرَ الرَّجُلُ مَسْحَ جَبْهَتِهِ قَبْلَ الْفَرَاغِ مِنْ صَلَاتِهِ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’یہ جہالت کی بات ہے کہ آدمی نماز سے فارغ ہونے سے پہلے بار بار پیشانی پر ہاتھ پھیرتا رہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>قال البوصیري: ’’ ھذا إسناد ضعیف،فیہ ہارون بن ہارون وقد اتفقوا علی تضعیفہ‘‘ وھو: ضعیف (تقریب:7247)`;
ibnemaja.anwaar = [412,1];