var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ: حَدَّثَنَا أَبُو قُتَيْبَةَ قَالَ: حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ،وَإِسْرَائِيلُ بْنُ يُونُسُ،عَنْ أَبِي إِسْحَاقَ،عَنْ الْحَارِثِ،عَنْ عَلِيٍّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُفَقِّعْ أَصَابِعَكَ وَأَنْتَ فِي الصَّلَاةِ»";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’نماز میں انگلیاں مت چٹخاؤ۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>الحارث الأعور: ضعیف`;
ibnemaja.anwaar = [412,1];