var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ سُفْيَانُ بْنُ زِيَادٍ الْمُؤَدِّبُ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ،عَنْ الْحَسَنِ بْنِ ذَكْوَانَ،عَنْ عَطَاءٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُغَطِّيَ الرَّجُلُ فَاهُ فِي الصَّلَاةِ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا: رسول اللہ ﷺ نے اس بات سے منع فرمایا ہے کہ آدمی نماز کے دوران میں منہ ڈھانک لے۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (643) ترمذي (378)`;
ibnemaja.anwaar = [412,1];