var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلْقَمَةُ بْنُ عَمْرٍو الدَّارِمِيُّ قَالَ: حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ مُحَمَّدِ بْنِ عَجْلَانَ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ،عَنْ كَعْبِ بْنِ عُجْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رَأَى رَجُلًا قَدْ شَبَّكَ أَصَابِعَهُ فِي الصَّلَاةِ،فَفَرَّجَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَصَابِعِهِ»";
ibnemaja.urdu = "سیدنا کعب بن عجرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے ایک آدمی کو نماز کے دوران میں انگلیوں میں انگلیاں ڈالے دیکھا تو رسول اللہ ﷺ نے اس (کے دونوں ہاتھوں) کی انگلیوں کو الگ الگ کر دیا۔";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;