var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَضَعْ يَدَهُ عَلَى فِيهِ وَلَا يَعْوِي فَإِنَّ الشَّيْطَانَ يَضْحَكُ مِنْهُ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جب کسی کو جمائی آئے تو اسے چاہیے کہ منہ پر ہاتھ رکھ لے اور آواز نہ نکالے کیوں کہ شیطان اس سے ہنستا ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>عبد اللّٰہ بن سعید المقبري: متروک <br>وحدیث البخاري (6223) یغني عنہ`;
ibnemaja.anwaar = [412,1];