var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ،عَنْ شَرِيكٍ،عَنْ أَبِي الْيَقْظَانِ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبُزَاقُ،وَالْمُخَاطُ،وَالْحَيْضُ،وَالنُّعَاسُ فِي الصَّلَاةِ،مِنَ الشَّيْطَانِ»";
ibnemaja.urdu = "سیدنا عدی بن ثابت انصاری اپنے والد سے اور وہ عدی کے نانا(سیدنا عبداللہ بن یزید بن زید خطمی انصاری رضی اللہ عنہ) سے روایت کرتے ہیں۔نبی ﷺ نے فرمایا: ’’نماز میں تھوکنا،ناک صاف کرنا،حیض آجانا اور اونگھ آنا شیطان کی طرف سے ہے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>ترمذي (2748)`;
ibnemaja.anwaar = [412,1];