var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،وَجَعْفَرُ بْنُ عَوْنٍ،عَنْ الْإِفْرِيقِيِّ،عَنْ عِمْرَانَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثَةٌ لَا تُقْبَلُ لَهُمْ صَلَاةٌ،الرَّجُلُ يَؤُمُّ الْقَوْمَ وَهُمْ لَهُ كَارِهُونَ،وَالرَّجُلُ لَا يَأْتِي الصَّلَاةَ إِلَّا دِبَارًا-يَعْنِي بَعْدَ مَا يَفُوتُهُ الْوَقْتُ-وَمَنْ اعْتَبَدَ،مُحَرَّرًا»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’تین آدمیوں کی نماز قبول نہیں ہوتی: ایک وہ شخص جو لوگوں کا امام بن جائے حالانکہ وہ اسے نا پسند کرتے ہوں،اور وہ شخص جو وقت گزرے جانے کے بعد ہی نماز کے لئے آتا ہے اور وہ شخص جو کسی آزاد کو غلام بنالے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (593)`;
ibnemaja.anwaar = [412,1];