var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ عَمْرِو بْنُ جَرَادٍ،عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اثْنَانِ فَمَا فَوْقَهُمَا جَمَاعَةٌ»";
ibnemaja.urdu = "سیدنا ابو موسیٰ اشعری رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’دو یا دو سے افراد جماعت ہیں۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف جدًا <br>الربیع بن بدر: متروک (تقریب: 1883) والسند ضعفہ البو صیري`;
ibnemaja.anwaar = [412,1];