var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ قَالَ: حَدَّثَنَا عَبْدِ الْوَاحِدِ بْنِ زِيَادٍ قَالَ: حَدَّثَنَا عَاصِمٌ،عَنْ الشَّعْبِيِّ،عَنْ ابْنِ عَبَّاسٍ،قَالَ: بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ،فَقَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي مِنَ اللَّيْلِ،فَقُمْتُ عَنْ يَسَارِهِ،فَأَخَذَ بِيَدِي،فَأَقَامَنِي عَنْ يَمِينِهِ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: میں ایک رات اپنی خالہ(ام المومنین) سیدہ میمونہ رضی اللہ عنہا کے ہاں ٹھہرا۔رات کو نبی ﷺ نماز(تہجد) ادا کرنے کے لئے کھڑے ہوئے۔میں آپ کی بائیں طرف جا کھڑا ہوا۔آپ ﷺ نے میرا ہاتھ پکڑ کر مجھے دائیں طرف کھڑآ کر لیا۔";
ibnemaja.hukam = "صحیح بخاری";
ibnemaja.description = ``;