var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ قَالَ: حَدَّثَنَا أَبُو بَكْرُ الْحَنَفِيُّ قَالَ: حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ قَالَ: حَدَّثَنَا شُرَحْبِيلُ،قَالَ سَمِعْتُ جَابِرَ بْنُ عَبْدِ اللَّهِ،يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي الْمَغْرِبَ،فَجِئْتُ فَقُمْتُ عَنْ يَسَارِهِ،فَأَقَامَنِي عَنْ يَمِينِهِ»";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ مغرب کی نماز پڑھ رہے تھے۔میں آکر آپ کی بائیں طرف کھڑآ ہوگیا تو آپ ﷺ نے مجھے دائیں طرف کھڑا کر لیا۔";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>شرحبیل بن سعد: ضعیف <br>ولبعض الحدیث شواھد عند ابن خزیمۃ (1532۔1674) و مسلم (3008) وغیرہما`;
ibnemaja.anwaar = [412,2];