var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا أَبِي قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ،عَنْ مُوسَى بْنِ أَنَسٍ،عَنْ أَنَسٍ،قَالَ «صَلَّى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِامْرَأَةٍ مِنْ أَهْلِهِ وَبِي،فَأَقَامَنِي عَنْ يَمِينِهِ،وَصَلَّتِ الْمَرْأَةُ خَلْفَنَا»";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے اپنے گھر والوں میں سے ایک خاتون کو اور مجھے نماز پڑھائی تو مجھے اپنی دائیں طرف کھڑآ کیا اور خاتون نے ہمارے پیچھے(کھڑے ہو کر) نماز پڑھی۔";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;