var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ: حَدَّثَنَا حُمَيْدٌ،عَنْ أَنَسٍ،قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يُحِبُّ أَنْ يَلِيَهُ الْمُهَاجِرُونَ وَالْأَنْصَارُ لِيَأْخُذُوا عَنْهُ»";
ibnemaja.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کو یہ بات پسند تھی کہ مہاجر اور انصار آپ کے قریب(اگلی صفوں میں) کھڑے ہوں۔تاکہ آپ سے (نماز کے مسائل عملی طور پر) سیکھ سکیں۔";
ibnemaja.hukam = "إسنادہ صحیح";
ibnemaja.description = ``;