var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ،عَنْ أَبِي الْأَشْهَبِ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي سَعِيدٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي أَصْحَابِهِ تَأَخُّرًا فَقَالَ: «تَقَدَّمُوا فَأْتَمُّوا بِي،وَلْيَأْتَمَّ بِكُمْ مَنْ بَعْدَكُمْ،لَا يَزَالُ قَوْمٌ يَتَأَخَّرُونَ حَتَّى يُؤَخِّرَهُمُ اللَّهُ»";
ibnemaja.urdu = "سیدنا ابو سعید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اپنے (بعض) صحابہ کو پیچھے رہتے دیکھا تو فرمایا: ’’آگے بڑھو اور میری اقتدا کرو،تمہارے بعد والے تمہاری اقتدار کریں۔کچھ لوگ پیچھے رہنے کے عادی ہو جاتے ہیں حتی کہ اللہ تعالیٰ انہیں پیچھے رہنے دیتا ہے۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;