var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ أَبِي قِلَابَةَ،عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ،قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَا وَصَاحِبٌ لِي،فَلَمَّا أَرَدْنَا الِانْصِرَافَ،قَالَ لَنَا «إِذَا حَضَرَتِ الصَّلَاةُ فَأَذِّنَا وَأَقِيمَا،وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا»";
ibnemaja.urdu = "سیدنا مالک بن حویرث رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں اور میرا ایک ساتھی نبی ﷺ کی خدمت میں حاضر ہوئے۔جب ہم نے واپس (وطن) جانے کا ارادہ کیا تو آپ ﷺ نے ہم سے فرمایا: ’’جب نماز کا وقت ہو جائے تو تم لوگ اذان اور اقامت کہنا اور تمہارا امام وہ بنے جو تم دونوں میں سے زیادہ بڑا ہے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;