var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ أُمِّ غُرَابٍ،عَنْ امْرَأَةٍ يُقَالُ لَهَا عَقِيلَةُ،عَنْ سَلَامَةَ بِنْتِ الْحُرِّ،أُخْتِ خَرَشَةَ قَالَتْ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ «يَأْتِي عَلَى النَّاسِ زَمَانٌ يَقُومُونَ سَاعَةً،لَا يَجِدُونَ إِمَامًا يُصَلِّي بِهِمْ»";
ibnemaja.urdu = "سیدنا خرشہ رضی اللہ عنہ کی ہمشیرہ سیدہ سلامہ بنت حر رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں نے نبی ﷺ سے یہ ارشاد مبارک سنا ہے: ’’لوگوں پر ایسا زمانہ بھی آئے گا کہ وہ ایک گھڑی کھڑے ہوئے(ایک دوسرے کو امامت کے لئے دھکیلیں گے) انہیں کوئی امام نہیں ملے گا جو نماز پڑھا سکے۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن أبي داود (581)`;
ibnemaja.anwaar = [413,1];