var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ إِسْمَاعِيلَ قَالَ: حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا يَحْيَى قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،قَالَ حَدَّثَ عُثْمَانُ بْنُ أَبِي الْعَاصِ،أَنَّ آخِرَ مَا قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَمَمْتَ قَوْمًا فَأَخِفَّ بِهِمْ»";
ibnemaja.urdu = "سیدنا عثمان بن ابی العاص رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھ سے رسول اللہ ﷺ نے آخری بات یہ فرمائی:’’جب تو لوگوں کا امام بنے تو ان پر تخفیف کرنا(نماز ہلکی پڑھانا۔‘‘)";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;