var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ قَالَ: حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ: حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَأَدْخُلُ فِي الصَّلَاةِ،وَإِنِّي أُرِيدُ إِطَالَتَهَا،فَأَسْمَعُ بُكَاءَ الصَّبِيِّ،فَأَتَجَوَّزُ فِي صَلَاتِي،مِمَّا أَعْلَمُ لِوَجْدِ أُمِّهِ بِبُكَائِهِ»";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’میں نماز شروع کرتا ہوں اور میرا ارادہ طویل نماز پڑھانے کا ہوتا ہے،پھر مجھے کسی بچے کے رونے کی آواز آتی ہے تو نماز مختصر کر دیتا ہوں کیوں کہ مجھے معلوم ہے کہ اس کے رونے سے اس کی ماں پریشان ہوگی۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;