var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ،عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَبِي بَكْرٍ وَعُمَرَ،فَقَالَ: «هَكَذَا نُبْعَثُ»";
ibnemaja.urdu = "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ حضرت ابو بکر اور عمر رضی اللہ عنہما کے درمیان(چلتے ہوئے گھر سے)باہر تشریف لائے۔اور فرمایا:‘‘ ہمیں اس طرح(قبروں سے) اٹھایا جائے گا۔’’";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف <br>سنن الترمذي (3669)`;
ibnemaja.anwaar = [378,1];