var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي كَرِيمَةَ الْحَرَّانِيُّ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،عَنْ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُلَاثَةَ،عَنْ هِشَامِ بْنِ حَسَّانَ،عَنْ الْحَسَنِ،عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَأَسْمَعُ بُكَاءَ الصَّبِيِّ،فَأَتَجَوَّزُ فِي الصَّلَاةِ»";
ibnemaja.urdu = "سیدنا عثمان بن ابی العاص رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’مجھے بچے کے رونے کی آواز آتی ہے تو میں نماز میں اختصار کر دیتا ہوں۔‘‘";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;