var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ شُعْبَةَ،ح وحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ: حَدَّثَنَا أَبِي،وَبِشْرُ بْنُ عُمَرَ،قَالَا حَدَّثَنَا شُعْبَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَوُّوا صُفُوفَكُمْ،فَإِنَّ تَسْوِيَةَ الصُّفُوفِ مِنْ تَمَامِ الصَّلَاةِ»";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اپنی صفیں درست کرو کیوں کہ صفیں درست کرنا نماز کی تکمیل میں شامل ہے۔‘‘";
ibnemaja.hukam = "بخاری ومسلم";
ibnemaja.description = ``;