var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلِّونَ عَلَى الَّذِينَ يَصِلُونَ الصُّفُوفَ،وَمَنْ سَدَّ فُرْجَةً رَفَعَهُ اللَّهُ بِهَا دَرْجَةً»";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ ان لوگوں پر رحمت نازل کرتا ہے اور فرشتے ان کے لئے دعائے خیر کرتے ہیں جو صفوں کو ملاتے ہیں اور جو شخص صف کا شگاف پر کرے گا،اس کے بدلے اللہ تعالیٰ اس کا درجہ بلند کر دےگا۔‘‘";
ibnemaja.hukam = "ضعیف";
ibnemaja.description = `إسنادہ ضعیف<br>ہشام بن عروۃ حجازي و روایۃ إسماعیل بن عیاش عن الحجازیین ضعیفۃ و للحدیث شواھد ضعیفۃ عند المحاملي (الأمالي ق 2/36،الصحیحۃ: 1892) وغیرہ <br>و روی ابن خزیمۃ (1550) عن رسول اللّٰہ ﷺ قال: ((إن اللّٰہ و ملائکتہ یصلون علی الذین یصلون الصفوف۔)) وسندہ حسن وھو یغني عنہ`;
ibnemaja.anwaar = [413,1];