var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ: أَنْبَأَنَا هِشَامٌ الدَّسْتُوَائِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنْ عِرْبَاضِ بْنِ سَارِيَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ «يَسْتَغْفِرُ لِلصَّفِّ الْمُقَدَّمِ ثَلَاثًا وَلِلثَّانِي مَرَّةً»";
ibnemaja.urdu = "سیدنا عرباض بن ساریہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ اگلی صف والوں کے لئے تین بار دعائے مغفرت فرماتے تھے اور دوسری صف کے لئے ایک بار۔";
ibnemaja.hukam = "صحیح";
ibnemaja.description = ``;