var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،وَمُحَمَّدُ بْنُ جَعْفَرٍ،قَالَ حَدَّثَنَا شُعْبَةُ،قَالَ سَمِعْتُ طَلْحَةَ بْنَ مُصَرِّفٍ،يَقُولُ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْسَجَةَ،يَقُولُ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ،يَقُولُ: سَمِعْتُ رَسُول اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الصَّفِّ الْأَوَّلِ»";
ibnemaja.urdu = "سیدنا براء بن عازت رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا ہے کہ آپ نے فرمایا: ’’اللہ تعالیٰ پہلی صف پر رحمت نازل فرماتا اورفرشتے اس کے لئے دعائے خیر کرتے ہیں۔‘‘";
ibnemaja.hukam = "حسن";
ibnemaja.description = ``;