var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو ثَوْرٍ إِبْرَاهِيمُ بْنُ خَالِدٍ قَالَ: حَدَّثَنَا أَبُو قَطَنٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ خِلَاسٍ،عَنْ أَبِي رَافِعٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ يَعْلَمُونَ مَا فِي الصَّفِّ الْأَوَّلِ لَكَانَتْ قُرْعَةٌ»";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اگر لوگوں کو معلوم ہوتا کہ پہلی صف میں کیا کچھ(اجرو ثواب اور رحمت و برکت) ہے تو قرعہ اندازی ہوتی۔‘‘";
ibnemaja.hukam = "صحیح مسلم";
ibnemaja.description = ``;