var mishkaat = {};
mishkaat.arabic = "عَن عَمْرو بن الْعَاصِ قَالَ: أَقْرَأَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسُ عَشْرَةَ سَجْدَةً فِي الْقُرْآنِ مِنْهَا ثَلَاثٌ فِي الْمُفَصَّلِ وَفِي سُورَةِ الْحَجِّ سَجْدَتَيْنِ. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "عمرو بن عاص ؓ نے فرمایا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے قرآن کے پندرہ سجدے پڑھائے،ان میں سے تین مفصل سورتوں میں ہیں،جبکہ سورۂ حج میں دو سجدے ہیں۔ضعیف۔";
mishkaat.description = `[1029] إسنادہ ضعیف، رواہ أبو داود (1401) و ابن ماجہ (1057)<br>٭ حارث بن سعید: مجھول الحال۔`;