var mishkaat = {};
mishkaat.arabic = "وَعنهُ: أَنه كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَيْنَا الْقُرْآنَ فَإِذَا مَرَّ بِالسَّجْدَةِ كَبَّرَ وَسجد وسجدنا مَعَه. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہمیں قرآن سنایا کرتے تھے،پس جب آپ آیت سجدہ پڑھتے تو تکبیر کہہ کر سجدہ کرتے اور ہم بھی آپ کے ساتھ سجدہ کرتے۔اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[1032] إسنادہ حسن، رواہ أبو داود (1413)<br>٭ عبد اللہ العمري حسن الحدیث عن نافع، ضعیف الحدیث عن غیرہ۔`;