var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَسْجُدْ فِي شَيْءٍ مِنَ الْمُفَصَّلِ مُنْذُ تَحَوَّلَ إِلَى الْمَدِينَةِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جب سے مدینہ تشریف لائے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مفصل سورتوں میں سجدہ نہیں فرمایا۔ضعیف۔";
mishkaat.description = `[1034] إسنادہ ضعیف، رواہ أبو داود (1403) [و ابن خزیمۃ: 560]<br>٭ أبو قدامۃ حارثۃ بن عبید: ضعیف ضعفہ الجمھور من جھۃ حفظہ و أخرج لہ مسلم متابعۃ (2667، 2838)`;