var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي (ص)\nوَقَالَ: سَجَدَهَا دَاوُدُ تَوْبَةً وَنَسْجُدُهَا شُكْرًا. رَوَاهُ النَّسَائِيُّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے سورۂ صٓ کی تلاوت پر سجدہ کیا اور فرمایا:’’داؤد ؑ نے توبہ کے لیے سجدہ کیا جبکہ ہم بطور شکر سجدہ کرتے ہیں۔‘‘ صحیح،رواہ النسائی۔";
mishkaat.description = `[1038] إسنادہ صحیح، رواہ النسائي (2/ 159 ح 958) وأعل بما لا یقدح۔`;