var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا صَلَاةَ بَعْدَ الصُّبْحِ حَتَّى تَرْتَفِعَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ الْعَصْرِ حَتَّى تَغِيبَ الشَّمْسُ»";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’نماز فجر کے بعد سورج کے بلند ہونے تک اور نماز عصر کے بعد سورج کے غروب ہو جانے تک کوئی نماز (پڑھنا درست) نہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[1041] متفق علیہ، رواہ البخاري (586) و مسلم (288/ 827)`;