var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ نِصْفَ النَّهَارِ حَتَّى تَزُولَ الشَّمْسُ إِلَّا يَوْمَ الْجُمُعَةِ. رَوَاهُ الشَّافِعِي";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے جمعہ کے سوا نصف النہار کے وقت نماز پڑھنے سے منع فرمایا حتیٰ کہ سورج ڈھل جائے۔ضعیف۔";
mishkaat.description = `[1046] إسنادہ ضعیف جدًا، رواہ الشافعي فی الأم (1/ 197) و مسندہ (ص 63 ح 269)<br>٭ إبراہیم الأسلمي متروک متھم، و إسحاق بن عبد اللہ بن أبي فروۃ مثلہ۔`;