var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَمْنَعُوا نِسَاءَكُمُ الْمَسَاجِدَ وَبُيُوتُهُنَّ خَيْرٌ لَهُنَّ» . رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنی خواتین کو مساجد میں آنے سے منع نہ کرو،جب کہ ان کے گھر ان کے لیے بہتر ہیں۔‘‘ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[1062] صحیح، رواہ أبو داود (567) [و صححہ ابن خزیمۃ (1684) والحاکم علٰی شرط الشیخین (1/ 209) ووافقہ الذہبي۔ ]`;