var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُؤَخِّرُوا الصَّلَاةَ لِطَعَامٍ وَلَا لغيره» . رَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کھانے اور کسی اور کام کی خاطر نماز کو مؤخر نہ کرو۔‘‘ ضعیف۔";
mishkaat.description = `[1071] إسنادہ ضعیف، رواہ البغوي في شرح السنۃ (3/ 357 تحت ح 800) بغیر ھذا اللفظ [و أبو داود: 3758 واللفظ لہ۔ ]<br>٭ محمد بن میمون الزعفراني ضعیف: ضعفہ الجمھور۔`;