var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا كُنْتُمْ فِي الْمَسْجِدِ فَنُودِيَ بِالصَّلَاةِ فَلَا يَخْرُجْ أَحَدُكُمْ حَتَّى يُصَلِّيَ. رَوَاهُ أَحْمد";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہمیں حکم فرمایا:’’جب تم مسجد میں ہو اور اذان ہو جائے تو پھر تم میں سے کوئی شخص نماز پڑھے بغیر وہاں سے باہر نہ جائے۔‘‘ ضعیف۔";
mishkaat.description = `[1074] سندہ ضعیف، رواہ أحمد (2/ 537 ح 10946)<br>٭ المسعودي اختلط و شریک القاضي مدلس و عنعن۔`;