var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصُّفُوفِ من إِقَامَة الصَّلَاة» . إِلَّا أَنَّ عِنْدَ مُسْلِمٍ: «مِنْ تَمَامِ الصَّلَاةِ»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنی صفیں برابر کرو،بے شک صفوں کا برابر کرنا نماز قائم کرنے سے ہے۔‘‘ بخاری،مسلم۔البتہ صحیح مسلم میں:’’نماز مکمل کرنے سے ہے۔‘‘ کے الفاظ ہیں۔متفق علیہ۔";
mishkaat.description = `[1087] متفق علیہ، رواہ البخاري (723) و مسلم (124/ 433)`;