var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وشرها أَولهَا» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مردوں کی صفوں میں سے پہلی صف،بہترین صف ہے اور ان کی آخری صف کمتر ہے،جبکہ عورتوں کی آخری صف ان کی بہترین صف ہے،اور ان کی پہلی صف بدتر ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1092] رواہ مسلم (132/ 440)`;