var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتِمُّوا الصَّفَّ الْمُقَدَّمَ ثُمَّ الَّذِي يَلِيهِ فَمَا كَانَ مِنْ نَقْصٍ فَلْيَكُنْ فِي الصَّفّ الْمُؤخر» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگلی صف کو پورا کرو،پھر اس کو جو اس کے بعد ہے،پس جو کمی ہو وہ آخری صف میں ہونی چاہیے۔‘‘ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[1094] صحیح، رواہ أبو داود (671) [والنسائي (93/2 ح 819) و صححہ ابن خزیمۃ (1546) و ابن حبان (390)]`;