var mishkaat = {};
mishkaat.arabic = "وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَوِّي صُفُوفَنَا إِذَا قُمْنَا إِلَى الصَّلَاةِ فَإِذَا اسَتْوَيْنَا كَبَّرَ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "نعمان بن بشیر ؓ بیان کرتے ہیں،جب ہم نماز کے لیے کھڑے ہوتے تو رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہماری صفیں برابر فرماتے،جب ہم برابر ہو جاتے تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اللہ اکبر کہتے۔صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[1097] إسنادہ صحیح، رواہ أبو داود (665) [و أصلہ متفق علیہ، رواہ البخاري (717) و مسلم (436)]`;