var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَوَسَّطُوا الْإِمَامَ وَسُدُّوا الْخَلَلَ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’امام کو وسط میں جگہ دو اور شگاف بند کرو۔‘‘ ضعیف۔";
mishkaat.description = `[1103] إسنادہ ضعیف، رواہ أبو داود (681) [والبیھقي (3/ 104)]<br>٭ أمۃ الواحد: مجھولۃ، و ابنھا یحیی بن بشیر: مستور۔`;