var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِ وَبِأُمِّهِ أَوْ خَالَتِهِ قَالَ: فَأَقَامَنِي عَنْ يَمِينِهِ وَأَقَامَ الْمَرْأَةَ خَلْفَنَا. رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے اور میری والدہ یا میری خالہ کو نماز پڑھائی،وہ بیان کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے اپنی دائیں جانب اور عورت کو اپنے پیچھے کھڑا کیا۔رواہ مسلم۔";
mishkaat.description = `[1109] رواہ مسلم (269/ 660)`;