var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رِضَى اللَّهُ عَنْهَا قَالَتْ: صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حُجْرَتِهِ وَالنَّاسُ يَأْتَمُّونَ بِهِ مِنْ وَرَاءِ الْحُجْرَةِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حجرہ میں نماز پڑھی جبکہ لوگ حجرے کے باہر سے آپ کی اقتدا کر رہے تھے۔صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[1114] صحیح، رواہ أبو داود (1126) [والبیھقي (3/ 110) و رواہ البخاري (729) و مسلم (761) بہ مطولاً]`;