var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الوائدة والموؤدة فِي النَّار . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عبداللہ بن مسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’زندہ درگور کرنے والی اور جس کی خاطر زندہ درگور کیا گیا جہنمی ہیں۔‘‘ صحیح،رواہ ابوداؤد (۴۷۱۷) وابن حبان (۶۷)۔";
mishkaat.description = `[112] صحیح، رواہ أبو داود (4717) [و ابن حبان، الموارد: 67]<br>٭ وللحدیث شواہد .`;