var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِالتَّخْفِيفِ وَيَؤُمُّنَا ب (الصافات)\nرَوَاهُ النَّسَائِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہمیں ہلکی نماز پڑھانے کا حکم دیا کرتے تھے،جبکہ آپ سورۃ الصافات سے ہماری امامت کرایا کرتے تھے۔اسنادہ حسن،رواہ النسائی۔";
mishkaat.description = `[1135] إسنادہ حسن، رواہ النسائي (2/ 95 ح 827) [و صححہ ابن خزیمۃ (1606) و ابن حبان (الموارد:470 والإحسان: 1814)]`;