var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمَا يَخْشَى الَّذِي يَرْفَعُ رَأْسَهُ قَبْلَ الْإِمَامِ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حمَار»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص امام سے پہلے اپنا سر اٹھا لیتا ہے وہ اس بات سے نہیں ڈرتا کہ اللہ کہیں اس کے سر کو گدھے کا سر نہ بنا دے۔متفق علیہ۔";
mishkaat.description = `[1141] متفق علیہ، رواہ البخاري (691) و مسلم (114/ 427)`;