var mishkaat = {};
mishkaat.arabic = "وَعَن أبي هُرَيْرَة أَنَّهُ كَانَ يَقُولُ: «مَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ السَّجْدَةَ وَمَنْ فَاتَتْهُ قِرَاءَةُ أُمِّ الْقُرْآنِ فقد فَاتَهُ خير كثير» . رَوَاهُ مَالك";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،جس نے رکوع پا لیا تو اس نے رکعت پا لی،اور جسے سورۂ فاتحہ نہ ملی تو وہ خیر کثیر سے محروم ہو گیا۔ضعیف۔";
mishkaat.description = `[1148] إسنادہ ضعیف، رواہ مالک (1/ 11ح 17)<br>٭ السند منقطع لأنہ من البلاغات و لقولہ: ’’و من فاتتہ۔ ۔ ۔ خیر کثیر‘‘ شواھد عند البخاري و مسلم وغیرھما فھو صحیح۔`;