var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رَحِمَ اللَّهُ امْرَءًا صَلَّى قَبْلَ الْعَصْرِ أَرْبَعًا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ،عصر سے پہلے چار رکعتیں پڑھنے والے شخص پر رحم فرمائے۔‘‘ اسنادہ حسن،رواہ احمد و الترمذی و ابوداؤد۔";
mishkaat.description = `[1170] إسنادہ حسن، رواہ أحمد (117/2 ح 5980) والترمذي (430 وقال: حسن غریب۔) [وأبو داود (1271) و صححہ ابن خزیمۃ (1193) و ابن حبان (616)]`;