var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى بَعْدَ الْمَغْرِبِ عِشْرِينَ رَكْعَةً بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص مغرب کے بعد بیس رکعتیں پڑھتا ہے تو اللہ اس کے لیے جنت میں گھر بنا دیتا ہے۔اسنادہ موضوع۔";
mishkaat.description = `[1174] إسنادہ موضوع، رواہ الترمذي (435) معلقًا و أشار إلٰی ضعفہ۔ [وابن ماجہ (1373)]<br>٭ فیہ یعقوب بن الولید: و کان من الکذابین الکبار۔`;