var mishkaat = {};
mishkaat.arabic = "وَعَنْهَا قَالَتْ: مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ قَطُّ فَدَخَلَ عَلَيَّ إِلَّا صلى أَربع رَكْعَات أَو سِتّ رَكْعَات. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جب بھی عشاء پڑھ کر میرے پاس تشریف لاتے تو آپ چار یا چھ رکعت نماز نفل ادا کرتے تھے۔ضعیف۔";
mishkaat.description = `[1175] إسنادہ ضعیف، رواہ أبو داود (1303)<br>٭ فیہ مقاتل بن بشیر: مجھول الحال و ثقہ ابن حبان وحدہ۔`;