var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إدبار النُّجُوم الركعتان قبل الْفجْر وأدبار السُّجُود الركعتان بعد الْمغرب» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ستاروں کے ڈوبنے کے بعد سے مراد فجر سے پہلے کی دو رکعتیں اور سجدوں کے بعد سے مغرب کے بعد دو رکعتیں ہیں۔‘‘ ضعیف۔";
mishkaat.description = `[1176] إسنادہ ضعیف، رواہ الترمذي (3275 وقال: غریب)<br>٭ فیہ رشدین بن کریب: ضعیف۔`;