var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُطِيلُ الْقِرَاءَةَ فِي الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ حَتَّى يَتَفَرَّقَ أَهْلُ الْمَسْجِدِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم مغرب کے بعد دو رکعتوں میں قراءت لمبی کیا کرتے تھے حتیٰ کہ نمازی چلے جاتے۔حسن،رواہ ابوداؤد۔";
mishkaat.description = `[1183] حسن، رواہ أبو داود (1301)<br>٭ جعفر بن أبی المغیرۃ عن سعید بن جبیر: حسن لہ الترمذي۔`;