var mishkaat = {};
mishkaat.arabic = "وَعَنْ مَسْرُوقٍ قَالَ: سَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ. فَقَالَت: سبع وتسع وَإِحْدَى عشر رَكْعَة سوى رَكْعَتي الْفجْر. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "مسروق ؒ بیان کرتے ہیں،میں نے عائشہ ؓ سے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی رات کی نماز کے بارے میں دریافت کیا،تو انہوں نے فرمایا: فجر کی دو رکعتوں کے علاوہ سات،نو اور گیارہ رکعت تھی۔رواہ البخاری۔";
mishkaat.description = `[1192] رواہ البخاري (1139)`;