var mishkaat = {};
mishkaat.arabic = "وَعَن أبي هُرَيْرَة قَالَ: كَانَ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ يَرْفَعُ طَوْرًا وَيَخْفِضُ طَوْرًا. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم تہجد میں قراءت کرتے وقت کبھی اپنی آواز بلند کرتے اور کبھی پست کرتے تھے۔اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[1202] إسنادہ حسن، رواہ أبو داود (1328) [و صححہ ابن خزیمۃ (1159) و ابن حبان (657) و الحاکم (310/1) ووافقہ الذہبي۔ ]`;