var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَدْرِ مَا يَسْمَعُهُ مَنْ فِي الْحُجْرَةِ وَهُوَ فِي الْبَيْتِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اس قدر بلند آواز سے قراءت کرتے تھے کہ آپ گھر کے اندر قراءت کرتے تو صحن میں موجود شخص آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی قراءت سن سکتا تھا۔اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[1203] إسنادہ حسن، رواہ أبو داود (1327) [والترمذي فی الشمائل: 321]`;