var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي أُمَامَةَ قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ أَيُّ الدُّعَاءِ أَسْمَعُ؟ قَالَ: «جَوْفُ اللَّيْلِ الآخر ودبر الصَّلَوَات المكتوبات» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوامامہ ؓ بیان کرتے،عرض کیا گیا،اللہ کے رسول صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم! کون سی دعا زیادہ قبول ہوتی ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’رات کے آخری حصے میں اور فرض نمازوں کے بعد کی گئی دعا۔‘‘ ضعیف۔";
mishkaat.description = `[1231] إسنادہ ضعیف، رواہ الترمذي (3499 وقال: حسن) تقدم (968) فراجعہ لعلتہ۔`;