var mishkaat = {};
mishkaat.arabic = "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَبْدَ اللَّهِ لَا تَكُنْ مِثْلَ فُلَانٍ كَانَ يَقُومُ مِنَ اللَّيْلِ فَتَرَكَ قيام اللَّيْل»";
mishkaat.urdu = "عبداللہ بن عمرو بن عاص ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے فرمایا:’’عبداللہ! فلاں شخص کی طرح نہ ہو جانا،وہ تہجد پڑھا کرتا تھا لیکن اب اس نے تہجد پڑھنا چھوڑ دی ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1234] متفق علیہ، رواہ البخاري (1152) و مسلم (185 / 1159)`;