var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَفْضَلُ الصَّلَاةِ بَعْدَ الْمَفْرُوضَةِ صَلَاةٌ فِي جَوف اللَّيْل» . رَوَاهُ أَحْمد";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’فرض نماز کے بعد رات کے آخری حصے میں پڑھی گئی نماز سب سے بہتر ہے۔‘‘ صحیح،رواہ احمد۔";
mishkaat.description = `[1236] صحیح، رواہ أحمد (2/ 342 ح 8488) [و رواہ مسلم کما سیأتي: 2039]`;