var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَشْرَافُ أُمَّتَيْ حَمَلَةُ الْقُرْآنِ وَأَصْحَابُ اللَّيْلِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’حاملین قرآن اور تہجد گزار لوگ میری امت کے شرفاء ہیں۔‘‘ اسنادہ موضوع۔";
mishkaat.description = `[1239] إسنادہ موضوع، رواہ البیھقي في شعب الإیمان (2703)<br>٭ فیہ نھشل: کذاب و سعد بن سعید الجرجاني: ضعیف و الضحاک لم یدرک ابن عباس۔`;