var mishkaat = {};
mishkaat.arabic = "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَلَّى اللَّهُ عَلَيْهِ وَسلم قَائِمًا فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا فَإِنْ لَمْ تستطع فعلى جنب» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عمران بن حصین ؓ روایت کرتے ہیں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کھڑے ہو کر نماز پڑھو،اگر استطاعت نہ ہو تو پھر بیٹھ کر اور اگر اس کی بھی استطاعت نہ ہو تو پھر پہلو کے بل (نماز پڑھو)۔‘‘ رواہ البخاری۔";
mishkaat.description = `[1248] رواہ البخاري (1117)`;