var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَة توتر لَهُ مَا قد صلى»";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے،جب تم میں سے کسی کو صبح ہو جانے کا اندیشہ ہو تو وہ ایک رکعت پڑھ لے تو وہ اس کی نماز کو وتر (طاق) بنا دے گی۔‘‘ متفق علیہ۔";
mishkaat.description = `[1254] متفق علیہ، رواہ البخاري (990) و مسلم (749/145)`;