var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً يُوتِرُ مِنْ ذَلِكَ بِخَمْسٍ لَا يَجْلِسُ فِي شَيْء إِلَّا فِي آخرهَا";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم تیرہ رکعت نماز تہجد پڑھا کرتے تھے،ان میں سے پانچ وتر پڑھتے اور تشہد کے لیے صرف آخری رکعت میں بیٹھتے تھے۔متفق علیہ۔";
mishkaat.description = `[1256] متفق علیہ، رواہ البخاري (1140) و مسلم (737/123)`;