var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مِنْ كُلَّ اللَّيْلِ أَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَوَّلِ اللَّيْلِ وَأَوْسَطِهِ وَآخِرِهِ وَانْتَهَى وَتْرُهُ إِلَى السَّحَرِ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے رات کے تمام اوقات میں وتر پڑھے ہیں،رات کے اول حصے میں،اس کے وسط میں،اس کے آخری حصے میں اور آخری دور میں آپ کی نماز وتر سحری (آخر شب) کے وقت ہوتی تھی۔متفق علیہ۔";
mishkaat.description = `[1261] متفق علیہ، رواہ البخاري (996) و مسلم (136/ 745)`;