var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمُّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَانَ يُصَلِّي بَعْدَ الْوِتْرِ رَكْعَتَيْنِ» رَوَاهُ التِّرْمِذِيُّ وَزَادَ ابْنُ مَاجَه: خفيفتين وَهُوَ جَالس";
mishkaat.urdu = "ام سلمہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم وتر کے بعد دو رکعتیں پڑھا کرتے تھے۔ترمذی،اور ابن ماجہ نے یہ اضافہ نقل کیا ہے: آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم بیٹھ کر ہی دو خفیف رکعتیں پڑھا کرتے تھے۔صحیح،رواہ الترمذی و ابن ماجہ۔";
mishkaat.description = `[1284] صحیح، رواہ الترمذي (471) و ابن ماجہ (1195)`;