var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي أُمَامَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّيهِمَا بَعْدَ الْوِتْرِ وَهُوَ جَالس يقْرَأ فيهمَا (إِذا زلزلت)\nو (قل يَا أَيهَا الْكَافِرُونَ)\nرَوَاهُ أَحْمد";
mishkaat.urdu = "ابوامامہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم یہ دو رکعتیں وتروں کے بعد بیٹھ کر ادا کرتے تھے،اور آپ ان میں سورۃ الزلزال اور سورۃ الکافرون پڑھا کرتے تھے۔اسنادہ حسن،رواہ احمد۔";
mishkaat.description = `[1287] إسنادہ حسن، رواہ أحمد (260/5 ح 22601)`;