var mishkaat = {};
mishkaat.arabic = "وَسُئِلَ أَن بْنُ مَالِكٍ عَنِ الْقُنُوتِ. فَقَالَ: قَنَتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدُ الرُّكُوعِ وَفِي رِوَايَةٍ: قَبْلَ الرُّكُوعِ وَبَعْدَهُ. رَوَاهُ ابْنُ مَاجَهْ";
mishkaat.urdu = "انس بن مالک ؓ سے قنوت کے متعلق دریافت کیا گیا تو انہوں نے فرمایا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے رکوع کے بعد قنوت کیا،اور ایک روایت میں ہے: رکوع سے پہلے بھی اور بعد بھی۔حسن،رواہ ابن ماجہ۔";
mishkaat.description = `[1294] حسن، رواہ ابن ماجہ (1183) بلفظ مختلف [و أصلہ عند البخاري (1001) ومسلم (677)]`;