var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَضَى أَحَدُكُمُ الصَّلَاةَ فِي مَسْجده فليجعل لبيته نَصِيبا من صلَاته فَإِنَّ اللَّهَ جَاعِلٌ فِي بَيْتِهِ مِنْ صِلَاتِهِ خيرا» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی مسجد میں نماز ادا کرے تو وہ اس کا کچھ حصہ نفل وغیرہ اپنے گھر میں بھی ادا کرے،کیونکہ اللہ اس کی نماز کی وجہ سے اس کے گھر میں خیر و برکت فرمائے گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1297] رواہ مسلم (778/210)`;