var mishkaat = {};
mishkaat.arabic = "وَعَن معَاذَة قَالَتْ: سَأَلْتُ عَائِشَةَ: كَمْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةَ الضُّحَى؟ قَالَتْ: أَرْبَعَ رَكَعَاتٍ وَيَزِيدُ مَا شَاءَ اللَّهُ. رَوَاهُ مُسلم";
mishkaat.urdu = "معاذہ ؓ بیان کرتی ہیں،میں نے عائشہ ؓ سے دریافت کیا،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم چاشت کی کتنی رکعتیں پڑھا کرتے تھے؟ انہوں نے فرمایا: چار رکعتیں،اور جس قدر اللہ چاہتا بڑھا دیتے تھے۔رواہ مسلم۔";
mishkaat.description = `[1310] رواہ مسلم (719/78)`;