var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ أَنَّهَا كَانَتْ تُصَلِّي الضُّحَى ثَمَانِي رَكَعَاتٍ ثُمَّ تَقُولُ: «لَوْ نُشِرَ لِي أَبَوَايَ مَا تركتهَا» . رَوَاهُ مَالك";
mishkaat.urdu = "عائشہ ؓ سے روایت ہے کہ وہ چاشت کی آٹھ رکعتیں پڑھا کرتی تھیں،پھر وہ فرماتی ہیں،اگر میرے والدین بھی زندہ کر دیے جائیں تو میں (ان کی خاطر) اس (نماز چاشت) کو ترک نہیں کروں گی۔ضعیف۔";
mishkaat.description = `[1319] إسنادہ ضعیف، رواہ مالک (153/1 ح 358)<br>٭ أشار علي بن الحسین بن الجنید بأن زید بن أسلم لم یسمع من عائشۃ (انظر المراسیل لابن أبي حاتم ص 64)`;