var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى حَتَّى نَقُولَ: لَا يَدَعُهَا وَيَدَعُهَا حَتَّى نَقُولَ: لَا يُصليهَا. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوسعید ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نماز چاشت پڑھا کرتے تھے،حتیٰ کہ ہم کہتے: اب آپ اسے نہیں چھوڑیں گے،اور (کبھی) اسے چھوڑ دیتے تو ہم کہتے: اب آپ اسے نہیں پڑھیں گے۔ضعیف۔";
mishkaat.description = `[1320] إسنادہ ضعیف، رواہ الترمذي (477 و قال: حسن غریب۔)<br>٭ فیہ عطیۃ العوفي ضعیف مدلس۔`;