var mishkaat = {};
mishkaat.arabic = "وَعَنْ حَارِثَةَ بْنِ وَهْبٍ الْخُزَاعِيِّ قَالَ: صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ أَكْثَرُ مَا كُنَّا قَطُّ وآمنه بمنا رَكْعَتَيْنِ";
mishkaat.urdu = "حارثہ بن وہب خزاعی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہمیں منی ٰمیں دو رکعتیں پڑھائیں،حالانکہ اس سے پہلے ہم کبھی نہ تو اتنی کثیر تعداد میں تھے اور نہ کبھی اس قدر پر امن تھے۔متفق علیہ۔";
mishkaat.description = `[1334] متفق علیہ، رواہ البخاري (1083) و مسلم (696/20)`;