var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ وَأَرَادَ أَنْ يَتَطَوَّعَ اسْتَقْبَلَ الْقِبْلَةَ بِنَاقَتِهِ فَكَبَّرَ ثُمَّ صَلَّى حَيْثُ وَجهه ركابه. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دوران سفر نفل پڑھنے کا ارادہ فرماتے تو آپ اپنی سواری پر قبلہ رخ ہو کر تکبیر کہہ کر نماز پڑھتے اور سواری جس رخ چاہتی چلتی جاتی۔اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[1345] إسنادہ حسن، رواہ أبو داود (1225)`;