var mishkaat = {};
mishkaat.arabic = "وَعَن ابْن عَبَّاس وَعَنِ ابْنِ عُمَرَ قَالَا: سَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ السَّفَرِ رَكْعَتَيْنِ وَهُمَا تَمَامٌ غَيْرُ قَصْرٍ وَالْوِتْرُ فِي السَّفَرِ سنة. رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "ابن عباس ؓ اور ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے نماز سفر دو رکعت مشروع فرمائی اور وہ دو رکعت (ثواب کے لحاظ سے) پوری ہیں،کم نہیں جبکہ دوران سفر وتر پڑھنا سنت ہے۔ضعیف۔";
mishkaat.description = `[1350] إسنادہ ضعیف جدًا، رواہ ابن ماجہ (1194)<br>٭ فیہ جابر الجعفي وھو ضعیف جدًا۔`;