var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا قُلْتَ لِصَاحِبِكَ يَوْمَ الْجُمُعَةِ أنصت وَالْإِمَام يخْطب فقد لغوت)";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم نے دوران خطبہ کسی ساتھ والے شخص سے (بس اتنا) کہہ دیا کہ خاموش ہو جاؤ تو تم نے لغو کام کیا۔‘‘ متفق علیہ۔";
mishkaat.description = `[1385] متفق علیہ، ۔ رواہ البخاري (934) و مسلم (851/11)`;