var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يُقِيمَنَّ أَحَدُكُمْ أَخَاهُ يَوْمَ الْجُمُعَةِ ثُمَّ يُخَالِفُ إِلَى مَقْعَدِهِ فَيَقْعُدَ فِيهِ وَلَكِن يَقُول: افسحوا . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم میں سے کوئی شخص جمعہ کے روز اپنے کسی بھائی کو،اس کی جگہ سے اس مقصد سے نہ اٹھائے کہ خود اس کی جگہ پر بیٹھ جائے بلکہ وہ یوں کہے: وسعت پیدا کرو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1386] رواہ مسلم (30 / 2178)`;