var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: كَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَتَانِ يَجْلِسُ بَيْنَهُمَا يقْرَأ الْقُرْآن وَيذكر النَّاس فَكَانَت صلَاته قصدا وخطبته قصدا. رَوَاهُ مُسلم";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جمعہ کے دو خطبے دیا کرتے تھے۔آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ان کے درمیان بیٹھتے تھے۔آپ قرآن پڑھتے اور لوگوں کو وعظ و نصیحت فرماتے تھے۔آپ کا خطبہ اور نماز متوسط ہوتی تھی۔رواہ مسلم۔";
mishkaat.description = `[1405] رواہ مسلم (866/41)`;