var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ: مَا أَخَذْتُ (ق. وَالْقُرْآنِ الْمَجِيدِ)\nإِلَّا عَنْ لِسَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا كُلَّ جُمُعَةٍ عَلَى الْمِنْبَرِ إِذَا خطب النَّاس. رَوَاهُ مُسلم";
mishkaat.urdu = "ام شام بن حارثہ بن نعمان ؓ بیان کرتی ہیں،میں نے سورۂ ق رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے سن سن کر یاد کی،آپ ہر جمعہ جب منبر پر لوگوں سے خطاب فرماتے تو اسے پڑھا کرتے تھے۔رواہ مسلم۔";
mishkaat.description = `[1409] رواہ مسلم (873/52)`;