var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم وَهُوَ يخْطب: «إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فليركع رَكْعَتَيْنِ وليتجوز فيهمَا» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے خطبہ کے دوران فرمایا:’’جب تم میں سے کوئی شخص جمعہ کے دن دوران خطبہ میں مسجد میں آئے تو وہ دو مختصر رکعتیں پڑھے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1411] رواہ مسلم (875/59)`;