var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَطَاءٍ مُرْسَلًا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَطَبَ يَعْتَمِدُ عَلَى عنزته اعْتِمَادًا. رَوَاهُ الشَّافِعِي";
mishkaat.urdu = "عطاء ؒ مرسل روایت بیان کرتے ہیں کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جب خطبہ ارشاد فرماتے تو آپ اپنے چھوٹے نیزے پر ٹیک لگاتے تھے۔ضعیف۔";
mishkaat.description = `[1445] إسنادہ ضعیف جدًا، رواہ الشافعي في مسندہ (ص 77 ح 341) والأم (238/1)<br>٭ فیہ إبراہیم الأسلمي متروک متھم و لیث بن أبي سلیم ضعیف مدلس مختلط۔`;