var mishkaat = {};
mishkaat.arabic = "وَعَن أبي هُرَيْرَة أَنَّهُ أَصَابَهُمْ مَطَرٌ فِي يَوْمِ عِيدٍ فَصَلَّى بِهِمُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْعِيدِ فِي الْمَسْجِدِ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ عید کے روز بارش ہو گئی تو نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے انہیں نماز عید مسجد میں پڑھائی۔ضعیف۔";
mishkaat.description = `[1448] إسنادہ ضعیف، رواہ أبو داود (1160) و ابن ماجہ (1313)<br>٭ عیسی بن عبد الأعلی: مجھول و عبید اللہ بن عبد اللہ بن موھب: مستور (أي مجھول الحال)`;