var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي جَعْفَرٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا مِنَ النُّغَاشِينَ فَخَرَّ ساجا. رَوَاهُ الدَّارَقُطْنِيُّ مُرْسَلًا وَفِي شَرْحِ السُّنَّةِ لَفْظُ المصابيح";
mishkaat.urdu = "ابوجعفر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے کسی چھوٹے سے قد والے (بونے) شخص کو دیکھا تو آپ سجدہ ریز ہو گئے۔دارقطنی نے اسے مرسل روایت کیا ہے،اور شرح السنہ میں مصابیح کے الفاظ ہیں۔ضعیف۔";
mishkaat.description = `[1495] إسنادہ ضعیف جدًا، رواہ الدارقطني (410/1)<br>٭ جابر الجعفي ضعیف جدًا مدلس و ھشیم مدلس و عنعن والسند مرسل۔`;