var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَفَاتِيحُ الْغَيْبِ خَمْسٌ ثُمَّ قَرَأَ: (إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ)\nالْآيَة. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عبد اللہ بن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’غیب کی کنجیاں پانچ ہیں۔‘‘ پھر آپ نے یہ آیت تلاوت فرمائی:’’بے شک قیامت کا علم اسی کے پاس ہے اور وہی بارش برساتا ہے،،،،،۔‘‘ رواہ البخاری۔";
mishkaat.description = `[1514] رواہ البخاري (4778)`;