var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَتِ السَّنَةُ بِأَنْ لَا تُمْطَرُوا وَلَكِنِ السَّنَةُ أَنْ تُمْطَرُوا وَتُمْطَرُوا وَلَا تُنْبِتُ الْأَرْضُ شَيْئًا» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قحط سالی یہ نہیں ہے کہ بارش نہ ہو،بلکہ قحط سالی یہ ہے کہ تم پر بار بار بہت زیادہ بارش تو ہو لیکن زمین کوئی چیز نہ اگائے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1515] رواہ مسلم (2904/44)`;