var mishkaat = {};
mishkaat.arabic = "عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّهُ كَانَ إِذَا سَمِعَ الرَّعْدَ تَرَكَ الْحَدِيثَ وَقَالَ: سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ من خيفته. رَوَاهُ مَالك";
mishkaat.urdu = "عامر بن عبداللہ بن زبیر سے روایت ہے کہ جب وہ گرج کی آواز سنتے تو بات چیت ترک کر دیتے اور فرماتے: رعد (گرج) اور فرشتے اس کے خوف سے اس کی حمد بیان کرتے ہیں۔صحیح،رواہ مالک۔";
mishkaat.description = `[1522] إسنادہ صحیح، رواہ مالک (992/2 ح 1934) و صححہ ابن الملقن في تحفۃ المحتاج (737)`;