var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا مَرِضَ الْعَبْدُ أَوْ سَافَرَ كُتِبَ لَهُ بِمِثْلِ مَا كَانَ يعْمل مُقيما صَحِيحا» رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوموسی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب بندہ بیمار ہو جائے یا وہ سفر پر ہو تو اس کے لیے اتنا ہی عمل (ثواب) لکھ دیا جاتا ہے جتنا وہ حالت قیام اور حالت صحت میں کیا کرتا تھا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[1544] رواہ البخاري (2996)`;