var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَا أَغْبِطُ أَحَدًا بِهَوْنِ مَوْتٍ بَعْدَ الَّذِي رَأَيْتُ مِنْ شِدَّةِ مَوْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی موت کی سختی دیکھنے کے بعد کسی کے آسان مرنے پر میں رشک نہیں کیا کرتی۔حسن،رواہ الترمذی و النسائی۔";
mishkaat.description = `[1563] حسن، رواہ الترمذي (979) والنسائي (6/4۔ 7 ح 1831) [و للحدیث شواھد۔ ]`;