var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ ك قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَخَلْتَ عَلَى مَرِيضٍ فَمُرْهُ يَدْعُو لَكَ فَإِنَّ دُعَاءَهُ كَدُعَاءِ الْمَلَائِكَةِ» . رَوَاهُ ابْنُ مَاجَهْ";
mishkaat.urdu = "عمر بن خطاب ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم مریض کے پاس جاؤ تو اسے کہو کہ وہ تمہارے حق میں دعا کرے،کیونکہ اس کی دعا،فرشتوں جیسی ہے۔‘‘ ضعیف۔";
mishkaat.description = `[1588] إسنادہ ضعیف، رواہ ابن ماجہ (1441)<br>٭ میمون بن مھران: لم یسمع من عمر، قالہ المنذري۔`;