var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَدَأَ الْإِسْلَامُ غَرِيبًا وَسَيَعُودُ كَمَا بَدَأَ فَطُوبَى للغرباء» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اسلام اجنبیت کے عالم میں شروع ہوا،اور عنقریب اسی حالت میں لوٹ جائے گا جیسے شروع ہوا،پس اجنبیوں (جنہوں نے اسلام کے ابتدائی دور اور آخری دور میں اسلام کا ساتھ دیا) کے لیے خوشخبری ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[159] رواہ مسلم (232 / 145)`;