var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم: «العيادة فوَاق نَاقَة»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عیادت (اتنے وقت کے لیے کرنی چاہیے) جتنا وقت دودھ کی دو دھاریں نکالنے کے درمیان ہوتا ہے۔‘‘ ضعیف۔";
mishkaat.description = `[1590] إسنادہ ضعیف، رواہ البیھقي في شعب الإیمان (9222)<br>٭ سندہ: ’’أیوب بن الولید الضریر: ثنا شعیب بن حرب: نا أبو عبد اللہ (العرني): نا إسماعیل بن القاسم عن أنس بن مالک۔‘‘ و فیہ جماعۃ لم أعرفھم۔`;