var mishkaat = {};
mishkaat.arabic = "وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه";
mishkaat.urdu = "بریدہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مومن مرتا ہے تو اس کی پیشانی پر پسینہ آ جاتا ہے۔‘‘ صحیح،رواہ الترمذی و النسائی و ابن ماجہ۔";
mishkaat.description = `[1610] صحیح، رواہ الترمذي (982 وقال: حسن۔) والنسائي (5/4۔ 6 ح 1829۔ 1830) و ابن ماجہ (1452) [و صححہ ابن حبان (الإحسان: 3000) والحاکم علٰی شرط الشیخین (361/1) ووافقہ الذہبي۔ ]`;