var mishkaat = {};
mishkaat.arabic = "عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ آخِرُ كَلَامِهِ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ» رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "معاذ بن جبل ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص کا آخری کلام ’’لا الہ الا اللہ‘‘ ہو گا وہ جنت میں داخل ہو گا۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[1621] إسنادہ حسن، رواہ أبو داود (3116) [و صححہ الحاکم (351/1، 500) ووافقہ الذہبي۔ ]`;