var mishkaat = {};
mishkaat.arabic = "وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «اقرؤوا سُورَةَ (يس)\nعَلَى مَوْتَاكُمْ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "معقل بن یسار ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنے قریب المرگ افراد پر سورۂ یس ٓ کی تلاوت کرو۔‘‘ ضعیف۔";
mishkaat.description = `[1622] إسنادہ ضعیف، رواہ أحمد (27/5 ح 20580) و أبو داود (3121) و ابن ماجہ (1448)<br>٭ فیہ أبو عثمان و أبوہ: مجھولان، و لہ شاھد ضعیف موقوف۔`;