var mishkaat = {};
mishkaat.arabic = "وَعَن عَائِشَةَ قَالَتْ: إِنَّ أَبَا بَكْرٍ قَبَّلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مَيِّتٌ. رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم وفات پا گئے تو ابوبکر ؓ نے ان کا بوسہ لیا۔صحیح،رواہ الترمذی و ابن ماجہ۔";
mishkaat.description = `[1624] صحیح، رواہ الترمذي (لم أجدہ مسندًا بل ذکرہ: 989 معلقًا و رواہ فی الشمائل: 391 و سندہ صحیح) و ابن ماجہ (1456) [والبخاري في صحیحہ: 5709۔ 5711]`;