var mishkaat = {};
mishkaat.arabic = "وَعَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ: دَخَلْتُ عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ وَهُوَ يَمُوتُ فَقُلْتُ: اقْرَأْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّلَام. رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "محمد بن منکدر ؒ بیان کرتے ہیں،جب جابر بن عبداللہ ؓ پر نزع کا عالم طاری تھا تو میں ان کے پاس گیا تو میں نے انہیں کہا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو سلام کہنا۔صحیح،رواہ ابن ماجہ۔";
mishkaat.description = `[1633] صحیح، رواہ ابن ماجہ (1450) [و أحمد (69/3ح 11682، 391/4 ح 19711) و صححہ البوصیري۔ ]`;