var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَغَالَوْا فِي الْكَفَنِ فَإِنَّهُ يُسْلَبُ سَلْبًا سَرِيعًا» . رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "علی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مہنگا کفن نہ دیا کرو کیونکہ وہ تو جلد ہی بوسیدہ ہو جاتا ہے۔‘‘ ضعیف۔";
mishkaat.description = `[1639] إسنادہ ضعیف، رواہ أبو داود (3154)<br>٭ عمرو بن ھاشم: لین الحدیث، و إسماعیل بن أبي خالد مدلس و عنعن و فی السند انقطاع بین عامر الشعبي و علي رضي اللہ عنہ۔`;