var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى لِلنَّاسِ النَّجَاشِيَّ الْيَوْمَ الَّذِي مَاتَ فِيهِ وَخرج بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَات";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے نجاشی کے فوت ہونے کی،جس روز وہ فوت ہوئے،خبر سنائی اور آپ صحابہ کرام ؓ کو لے کر عید گاہ تشریف لے گئے،آپ نے ان کی صفیں بنائیں اور چار تکبیریں کہیں۔متفق علیہ۔";
mishkaat.description = `[1652] متفق علیہ، رواہ البخاري (1318) و مسلم (951/62)`;