var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَا مِنْ مَيِّتٍ تُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ الْمُسْلِمِينَ يَبْلُغُونَ مِائَةً كُلُّهُمْ يَشْفَعُونَ لَهُ: إِلَّا شفعوا فِيهِ . رَوَاهُ مُسلم";
mishkaat.urdu = "عائشہ ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتی ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس میت پر سو مسلمان جنازہ پڑھیں اور وہ تمام اس کے حق میں سفارش کریں تو اس کے حق میں ان کی سفارش قبول کی جاتی ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1661] رواہ مسلم (947/58)`;