var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِفَرَسٍ مَعْرُورٍ فَرَكِبَهُ حِينَ انْصَرَفَ مِنْ جَنَازَةِ ابْنِ الدَّحْدَاحِ وَنَحْنُ نمشي حوله. رَوَاهُ مُسلم";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ابن دحداح کی نماز جنازہ سے فارغ ہوئے تو زین کے بغیر ایک گھوڑا آپ کی خدمت میں پیش کیا گیا جس پر آپ سوار ہو گئے جبکہ ہم آپ کے اردگرد پیدل چلتے رہے۔رواہ مسلم۔";
mishkaat.description = `[1666] رواہ مسلم (965/89)`;