var mishkaat = {};
mishkaat.arabic = "وَقَدْ رَوَى فِي «شَرْحِ السُّنَّةِ»: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَمَلَ جَنَازَةَ سَعْدِ ابْن معَاذ بَين العمودين";
mishkaat.urdu = "شرح السنہ میں مروی ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے سعد بن معاذ ؓ کے جنازے کو دو پایوں کے درمیان سے اٹھایا۔لا اصل لہ۔";
mishkaat.description = `[1671] لا أصل لہ، رواہ البغوي في شرح السنۃ (337/5 بعد ح 1488 بدون سند) [وابن سعد فی الطبقات الکبری (431/3) عن محمد بن عمر الواقدي عن إبراہیم بن إسماعیل بن أبي حبیبۃ عن شیوخ من بني عبد الأشھل بہ إلخ و الواقدي کذاب۔ ]`;