var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا صَلَّيْتُمْ عَلَى الْمَيِّتِ فَأَخْلِصُوا لَهُ الدُّعَاءَ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم جنازہ پڑھو تو میت کے لیے خلوص کے ساتھ دعا کرو۔‘‘ اسنادہ حسن،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[1674] إسنادہ حسن، رواہ أبو داود (3199) و ابن ماجہ (1497) [وابن حبان (الموارد: 754۔ 755)]`;