var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اذْكُرُوا مَحَاسِنَ مَوْتَاكُمْ وَكُفُّوا عَنْ مُسَاوِيهِمْ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنے فوت شدگان کے محاسن بیان کیا کرو اور ان کی برائیاں بیان کرنے سے اجتناب کرو۔‘‘ ضعیف۔";
mishkaat.description = `[1678] إسنادہ ضعیف، رواہ أبو داود (4900) والترمذي (1019 وقال: حدیث غریب، سمعت محمدًا [البخاري] یقول: عمران بن أنس المکی منکر الحدیث۔)`;