var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيٍّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنَا بِالْقِيَامِ فِي الْجَنَازَةِ ثُمَّ جَلَسَ بَعْدَ ذَلِكَ وَأَمَرَنَا بِالْجُلُوسِ. رَوَاهُ أَحْمد";
mishkaat.urdu = "علی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے جنازہ دیکھ کر ہمیں کھڑا ہونے کا حکم فرمایا،اس کے بعد پھر آپ بیٹھ گئے تو آپ نے ہمیں بیٹھ جانے کا حکم فرمایا۔حسن،رواہ احمد۔";
mishkaat.description = `[1682] حسن، رواہ أحمد (82/1 ح 623 وسندہ حسن)`;