var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ أَنَّ جَنَازَةً مَرَّتْ بِرَسُولِ اللَّهِ فَقَامَ فَقِيلَ: إِنَّهَا جَنَازَةُ يَهُودِيٍّ فَقَالَ: «إِنَّمَا قُمْت للْمَلَائكَة» . رَوَاهُ النَّسَائِيّ";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے پاس سے ایک جنازہ گزرا تو آپ کھڑے ہو گئے،آپ کو بتایا گیا کہ یہ تو کسی یہودی کا جنازہ ہے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں تو صرف فرشتوں کی خاطر کھڑا ہوا ہوں۔‘‘ ضعیف۔";
mishkaat.description = `[1686] سندہ ضعیف، رواہ النسائي (4/ 48 ح 1931)<br>٭ قتادۃ عنعن و للحدیث شاھد ضعیف عند أحمد (413/4)`;