var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ: صَلَّيْتُ وَرَاءَ أَبِي هُرَيْرَةَ عَلَى صَبِيٍّ لَمْ يَعْمَلْ خَطِيئَةً قَطُّ فَسَمِعْتُهُ يَقُولُ: اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْر. رَوَاهُ مَالك";
mishkaat.urdu = "سعید بن مسیّب ؒ بیان کرتے ہیں،میں نے ابوہریرہ ؓ کے پیچھے ایک ایسے بچے کی نماز جنازہ پڑھی جس نے کبھی کوئی گناہ کیا ہی نہیں،وہ دعا کر رہے تھے:’’اے اللہ! اسے عذاب قبر سے بچا لے۔‘‘ صحیح،رواہ مالک۔";
mishkaat.description = `[1689] إسنادہ صحیح، رواہ مالک (228/1 ح 537)`;