var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْبُخَارِيِّ تَعْلِيقًا قَالَ: يَقْرَأُ الْحَسَنُ عَلَى الطِّفْلِ فَاتِحَةَ الْكِتَابِ وَيَقُولُ: اللَّهُمَّ اجْعَلْهُ لَنَا سلفا وفرطا وذخرا وَأَجرا";
mishkaat.urdu = "امام بخاری ؒ نے معلق روایت بیان کرتے ہوئے فرمایا: حسن بصری ؒ بچے کی نماز جنازہ میں سورۂ فاتحہ پڑھتے اور یہ دعا کرتے: اے اللہ! اسے ہمارے لیے پیش رو،میر منزل،ذخیرہ اور ثواب بنا۔‘‘ ضعیف۔";
mishkaat.description = `[1690] إسنادہ ضعیف، رواہ البخاري في صحیحہ (کتاب الجنائز باب 65 قبل ح 1335) و الحافظ ابن حجر في تغلیق التعلیق (484/2)<br>٭ فیہ سعید بن أبي عروبۃ مدلس و عنعن۔`;