var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقُومَ الْإِمَامُ فَوْقَ شَيْءٍ وَالنَّاسُ خَلْفَهُ يَعْنِي أَسْفَلَ مِنْهُ. رَوَاهُ الدراقطني وَأَبُو دَاوُد";
mishkaat.urdu = "ابومسعود انصاری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے امام کو کسی بلند جگہ پر کھڑے ہونے سے منع فرمایا جبکہ مقتدی اس کے نیچے ہوں۔ضعیف۔";
mishkaat.description = `[1692] إسنادہ ضعیف، رواہ الدارقطني (88/2) [وأبو داود: 597]<br>٭ الأعمش مدلس و عنعن و للحدیث شاھد ضعیف عند أبي داود (598)`;