var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ";
mishkaat.urdu = "عائشہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میت کی ہڈی کا توڑنا،زندہ کی ہڈی کے توڑنے کے مترادف ہے۔‘‘ صحیح،رواہ مالک و ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[1714] صحیح، رواہ مالک (238/1 ح 564 بلاغًا) و أبو داود (3207) و ابن ماجہ (1616)`;