var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى جَنَازَةٍ ثُمَّ أَتَى الْقَبْر فَحَثَا عَلَيْهِ مِنْ قِبَلِ رَأْسِهِ ثَلَاثًا. رَوَاهُ ابْنُ مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایک نماز جنازہ پڑھی،پھر قبر پر تشریف لائے اور اس کے سر کی جانب سے اس پر تین لپ مٹی ڈالی۔ضعیف۔";
mishkaat.description = `[1720] إسنادہ ضعیف، رواہ ابن ماجہ (1565)<br>٭ یحیی بن أبي کثیر مدلس و جاء تصریح سماعہ في روایۃ موضوعۃ و للحدیث شواھد ضعیفۃ۔`;