var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ»";
mishkaat.urdu = "عبداللہ بن مسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص رخسار پیٹے،گریبان چاک کرے اور جاہلیت کی سی باتیں کرے تو وہ ہم میں سے نہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[1725] متفق علیہ، رواہ البخاري (1294) و مسلم (103/165)`;