var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَا يَمُوت لمُسلم ثَلَاث مِنَ الْوَلَدِ فَيَلِجُ النَّارَ إِلَّا تَحِلَّةَ الْقَسَمِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس مسلمان کے تین بچے فوت ہو جائیں تو وہ صرف قسم پوری کرنے کی خاطر ہی جہنم میں جائے گا (وہ بھی پل صراط سے گزرتے وقت)۔‘‘ متفق علیہ۔";
mishkaat.description = `[1729] متفق علیہ، رواہ البخاري (6656) و مسلم (2632/150)`;