var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّائِحَةَ وَالْمُسْتَمِعَةَ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے نوحہ کرنے والی اور قصداً اسے سننے والی پر لعنت فرمائی۔ضعیف۔";
mishkaat.description = `[1732] إسنادہ ضعیف، رواہ أبو داود (3128)<br>٭ محمد بن الحسن بن عطیۃ العوفي و أبوہ ضعیفان و جدہ ضعیف مدلس و للحدیث شواھد ضعیفۃ عند البیھقي (63/4) وغیرہ۔`;