var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي بَرْزَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ عَزَّى ثَكْلَى كسي بردا فِي الْجَنَّةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب";
mishkaat.urdu = "ابوبرزہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص کسی عورت کو،جس کا بچہ گم جائے،تسلی دیتا ہے تو اسے جنت میں ایک قیمتی لباس پہنایا جائے گا۔‘‘ ترمذی،اور انہوں نے فرمایا: یہ حدیث غریب ہے۔ضعیف۔";
mishkaat.description = `[1738] إسنادہ ضعیف، رواہ الترمذي (1076)<br>٭ منیۃ بنت عبید: لا یعرف حالھا۔`;