var mishkaat = {};
mishkaat.arabic = "عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «من نِيحَ عَلَيْهِ فَإِنَّهُ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ يَوْم الْقِيَامَة»";
mishkaat.urdu = "مغیرہ بن شعبہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جس شخص پر نوحہ کیا جائے تو اس پر نوحہ کیے جانے کے باعث روز قیامت اسے عذاب دیا جائے گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[1740] متفق علیہ، رواہ البخاري (1291) و مسلم (933/28)`;