var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُتْبَعَ جَنَازَةٌ مَعهَا رانة. رَوَاهُ أَحْمد وَابْن مَاجَه";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایسے جنازے میں شریک ہونے سے منع فرمایا جس کے ساتھ کوئی نوحہ کرنے والی ہو۔ضعیف۔";
mishkaat.description = `[1751] سندہ ضعیف، رواہ أحمد (92/2 ح 5668) و ابن ماجہ (1583)<br>٭ أبو یحیی القتات روی عنہ إسرائیل أحادیث کثیرۃ مناکیر جدًا۔`;