var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَدِيِّ بْنِ عُمَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَعْمَلْنَاهُ مِنْكُم على عمر فَكَتَمَنَا مِخْيَطًا فَمَا فَوْقَهُ كَانَ غُلُولًا يَأْتِي بِهِ يَوْم الْقِيَامَة» . رَوَاهُ مُسلم";
mishkaat.urdu = "عدی بن عمیرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ہم تم میں سے جس شخص کو کسی کام پر مامور کریں اور اگر وہ ہم سے ایک سوئی یا اس سے بھی کوئی چھوٹی چیز چھپا لے تو یہ خیانت ہو گی،جسے وہ روز قیامت لے کر حاضر ہو گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1780] رواہ مسلم (1833/30)`;