var mishkaat = {};
mishkaat.arabic = "وَعَنْ بَشِيرِ بْنِ الْخَصَاصِيَّةِ قَالَ: قُلْنَا: أَنَّ أَهْلَ الصَّدَقَةِ يَعْتَدُونَ عَلَيْنَا أَفَنَكْتُمُ مِنْ أَمْوَالِنَا بِقَدْرِ مَا يَعْتَدُونَ؟ قَالَ: «لَا» رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "بشیر بن خصاصیہ ؓ بیان کرتے ہیں،ہم نے عرض کیا: کہ اہل صدقہ ہم پر زیادتی کرتے ہیں،کیا ہم ان کی زیادتی کے مطابق اپنے اموال میں سے چھپا لیا کریں؟ فرمایا:’’نہیں۔‘‘ ضعیف۔";
mishkaat.description = `[1784] إسنادہ ضعیف، رواہ أبو داود (1586)<br>٭ دیسم: مستور لم یوثقہ غیر ابن حبان۔`;