var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ من الْإِبِل صَدَقَة»";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’پانچ وسق سے کم کھجور پر،پانچ اوقیہ سے کم چاندی پر اور پانچ سے کم اونٹوں پر زکوۃ نہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[1794] متفق علیہ، رواہ البخاري (1459) و مسلم (979/1)`;