var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «العجماء جرحها جَبَّار والبشر جَبَّار والمعدن جَبَّار وَفِي الرِّكَاز الْخمس»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جانور کا زخم معاف ہے (اس پر کوئی دیت و تاوان نہیں)،کنویں میں اور کان میں موت واقع ہو جائے تو اس پر کوئی معاوضہ نہیں،اور دفینے پر پانچواں حصہ زکوۃ ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1798] متفق علیہ، رواہ البخاري (1499) و مسلم (1710/45)`;