var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُعْتَدِي فِي الصَّدَقَةِ كَمَانِعِهَا» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’زکوۃ وصول کرنے میں زیادتی کرنے والا،زکوۃ نہ دینے والے کی طرح ہے۔‘‘ ضعیف۔";
mishkaat.description = `[1801] ضعیف، رواہ أبو داود (1585) والترمذي (646 وقال: غریب) [وابن ماجہ: 1808]<br>٭ سعد بن سنان صدوق و لکن روایۃ یزید بن أبي حبیب عن سعد بن سنان منکرۃ کما فی الضعفاء الکبیر للعقیلي (119/2)`;