var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا أَنْ نُخْرِجَ الصَّدَقَةَ مِنَ الَّذِي نُعِدُّ لِلْبَيْعِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "سمرہ بن جندب ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہمیں حکم دیا کرتے تھے کہ ہم تجارت کے لیے تیار کیے گئے مال کی زکوۃ ادا کریں۔ضعیف۔";
mishkaat.description = `[1811] إسنادہ ضعیف، رواہ أبو داود (1562)<br>٭ فیہ خبیب: مجھول و جعفر بن سعد: ضعفہ الجمھور، و یؤیدہ حدیث الترمذي (616) وسندہ حسن۔`;