var mishkaat = {};
mishkaat.arabic = "عَنْ أَنَسٍ قَالَ: مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرَةٍ فِي الطَّرِيقِ فَقَالَ: «لَوْلَا أَنِّي أَخَافُ أَنْ تَكُونَ مِنَ الصَّدَقَةِ لأكلتها»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے راستے میں پڑی ہوئی ایک کھجور دیکھی تو فرمایا:’’اگر مجھے اس کے صدقہ کے ہونے کا اندیشہ نہ ہوتا تو میں اسے کھا لیتا۔‘‘ متفق علیہ۔";
mishkaat.description = `[1821] متفق علیہ، رواہ البخاري (2055) و مسلم (1071/164)`;