var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ دُعِيتُ إِلَى كُرَاعٍ لَأَجَبْتُ وَلَوْ أُهْدِيَ إِلَيَّ ذِرَاع لقبلت» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر مجھے دستی کے گوشت کی دعوت دی جائے تو میں ضرور قبول کروں گا اور اگر مجھے دستی کا گوشت بطور ہدیہ پیش کیا جائے تو میں قبول کروں گا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[1827] رواہ البخاري (2568)`;