var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي";
mishkaat.urdu = "عبداللہ بن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کسی مال دار شخص اور طاقت ور صحیح الخلقت شخص کے لیے صدقہ لینا حلال نہیں۔‘‘ اسنادہ حسن،رواہ الترمذی و ابوداؤد و الدارمی۔";
mishkaat.description = `[1830] إسنادہ حسن، رواہ الترمذي (652) و أبو داود (1634) والدارمي (346/1 ح 1646)`;