var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ النَّاسَ أَمْوَالَهُمْ تَكَثُّرًا فَإِنَّمَا يَسْأَلُ جمرا. فليستقل أَو ليستكثر» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص مال بڑھانے کی خاطر لوگوں کے مال میں سے سوال کرتا ہے تو وہ انگارے مانگ رہا ہے،وہ کم مانگے یا زیادہ۔‘‘ رواہ مسلم۔";
mishkaat.description = `[1838] رواہ مسلم (1041/105)`;