var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا يَزَالُ الرَّجُلُ يَسْأَلُ النَّاسَ حَتَّى يَأْتِيَ يَوْمَ الْقِيَامَةِ لَيْسَ فِي وَجْهِهِ مُزْعَةُ لحم»";
mishkaat.urdu = "عبداللہ بن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آدمی لوگوں سے مانگتا رہتا ہے حتیٰ کہ جب وہ روز قیامت پیش ہو گا تو اس کے چہرے پر کوئی گوشت نہیں ہو گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[1839] متفق علیہ، رواہ البخاري (174) و مسلم (104 /1040)`;