var mishkaat = {};
mishkaat.arabic = "وَعَن عمر رَضِي الله عَنهُ قَالَ: تَعْلَمُنَّ أَيُّهَا النَّاسُ أَنَّ الطَّمَعَ فَقْرٌ وَأَنَّ الْإِيَاسَ غِنًى وَأَنَّ الْمَرْءَ إِذَا يَئِسَ عَن شَيْء اسْتغنى عَنهُ. رَوَاهُ رزين";
mishkaat.urdu = "عمر ؓ سے روایت ہے،انہوں نے فرمایا: لوگو! تم جان لو کہ طمع فقر ہے،جبکہ (لوگوں سے) نا امیدی غنی ہے،کیونکہ جب آدمی کسی چیز سے نا امید ہو جاتا ہے تو وہ اس سے بے نیاز ہو جاتا ہے۔لا اصل لہ،رواہ رزین (لم اجدہ)۔";
mishkaat.description = `[1856] لا أصل لہ، رواہ رزین (لم أجدہ)`;