var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ خِبٌّ وَلَا بَخِيلٌ وَلَا منان» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوبکر صدیق ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’فساد و لڑائی پیداکرنے والا،بخیل اور احسان جتلانے والا شخص جنت میں داخل نہیں ہو گا۔‘‘ ضعیف۔";
mishkaat.description = `[1873] سندہ ضعیف، رواہ الترمذي (1963 وقال: حسن غریب)<br>٭ صدقۃ بن موسی و فرقد بن یعقوب السبخي ضعیفان۔`;