var mishkaat = {};
mishkaat.arabic = "وَعَنْ حَسَّانَ قَالَ: «مَا ابْتَدَعَ قَوْمٌ بِدْعَةً فِي دِينِهِمْ إِلَّا نَزَعَ اللَّهُ مِنْ سُنَّتِهِمْ مِثْلَهَا ثُمَّ لَا يُعِيدُهَا إِلَيْهِمْ إِلَى يَوْمِ الْقِيَامَة.» رَوَاهُ الدَّارمِيّ";
mishkaat.urdu = "حسان ؒ بیان کرتے ہیں،جب کوئی قوم اپنے دین میں کوئی بدعت ایجاد کرتی ہے تو اللہ اس کی مثل ان کی سنت چھین لیتا ہے،پھر وہ اسے روز قیامت تک ان کی طرف نہیں لوٹاتا۔‘‘ اسنادہ صحیح،رواہ الدارمی (۱/ ۴۵ ح ۹۹)۔";
mishkaat.description = `[188] إسنادہ صحیح، رواہ الدارمي (1/ 45 ح 99)`;