var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا نِسَاءَ الْمُسْلِمَاتِ لَا تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مسلمان خواتین! کوئی پڑوسن اپنی پڑوسن کے کسی ہدیے کو حقیر نہ سمجھے خواہ وہ بکری کا کھر ہی ہو۔‘‘ متفق علیہ۔";
mishkaat.description = `[1892] متفق علیہ، رواہ البخاري (6017) و مسلم (1030/90)`;