var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الصَّدَقَةُ اللِّقْحَةُ الصَّفِيُّ مِنْحَةً وَالشَّاةُ الصَّفِيُّ مِنْحَةً تَغْدُو بِإِنَاءٍ وَتَرُوحُ بِآخَرَ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’دودھ دینے والی بہترین اونٹنی عاریۃً دینا اور دودھ دینے والی بہترین بکری،جو صبح و شام برتن بھر دیتی ہو،عاریۃً دینا بہترین صدقہ ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1899] متفق علیہ، رواہ البخاري (5608) و مسلم (1020/74)`;