var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا أَوْ يَزْرَعُ زَرْعًا فَيَأْكُلُ مِنْهُ إِنْسَانٌ أَوْ طَيْرٌ أَوْ بَهِيمَةٌ إِلَّا كَانَت لَهُ صَدَقَة»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب کوئی مسلمان شجرکاری کرتا ہے یا کاشتکاری کرتا ہے،پھر کوئی انسان یا پرندہ یا کوئی حیوان اس میں سے کھا لیتا ہے تو یہ اس کے لیے صدقہ ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1900] متفق علیہ، رواہ البخاري (6012) و مسلم (1552/12)`;