var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الصَّدَقَةَ لَتُطْفِئُ غَضَبَ الرَّبِّ وَتَدْفَعُ مِيتَةَ السَّوْءِ» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بے شک صدقہ،رب کے غضب کو ختم کرتا ہے اور بری موت کو دور کرتا ہے۔‘‘ ضعیف۔";
mishkaat.description = `[1909] إسنادہ ضعیف، رواہ الترمذي (664 وقال: غریب)<br>٭ عبد اللہ بن عیسی: ضعیف و للحدیث شواھد ضعیفۃ۔`;