var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْبَرَاءِ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَنَحَ مِنْحَةَ لَبَنٍ أَو روق أَوْ هَدَى زُقَاقًا كَانَ لَهُ مِثْلَ عِتْقِ رَقَبَة» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "براء ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص دودھ والا جانور عاریۃً دے دے یا کوئی قرض دے دے یا کسی کو راستہ بتا دے تو اس کے لیے غلام آزاد کرنے کے برابر ثواب ہے۔‘‘ صحیح،رواہ الترمذی۔";
mishkaat.description = `[1917] صحیح، رواہ الترمذي (1957 وقال: حسن صحیح غریب۔)`;