var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ وَحَكِيمِ بْنِ حِزَامٍ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وأبدأ بِمن تعول» . رَوَاهُ البُخَارِيّ وَمُسلم عَن حَكِيم وَحده";
mishkaat.urdu = "ابوہریرہ ؓ اور حکیم بن حزام ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بہترین صدقہ وہ ہے جس کے پیچھے غنا ہو اور صدقہ کی ابتدا اپنے زیر کفالت افراد سے کر۔‘‘ بخاری،مسلم نے صرف حکیم ؓ سے روایت کی ہے۔متفق علیہ۔";
mishkaat.description = `[1929] متفق علیہ، رواہ البخاري (1426۔ 1427) و مسلم (1034/95)`;