var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أَنْفَقَ الْمُسْلِمُ نَفَقَةً عَلَى أَهْلِهِ وَهُوَ يَحْتَسِبُهَا كَانَت لَهُ صَدَقَة»";
mishkaat.urdu = "ابومسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب مسلمان اللہ کی رضا اور حصول ثواب کی نیت سے اپنے اہل و عیال پر خرچ کرتا ہے تو وہ اس کے لیے صدقہ ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1930] متفق علیہ، رواہ البخاري (55، 5351) و مسلم (1002/48)`;