var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصَّدَقَةِ أَنْ تُشْبِعَ كَبِدًا جَائِعًا» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بہترین صدقہ یہ ہے کہ تو کسی بھوکے پیٹ کو سیر کر دے۔‘‘ ضعیف۔";
mishkaat.description = `[1946] إسنادہ ضعیف، رواہ البیھقي في شعب الإیمان (3367، نسخۃ محققۃ: 3095)<br>٭ فیہ زربي بن عبد اللہ: ضعیف۔`;