var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ كَسْبِ زَوْجِهَا مِنْ غَيْرِ أَمْرِهِ فَلَهَا نِصْفُ أَجْرِهِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب عورت اپنے خاوند کی کمائی سے،اس کی اجازت کے بغیر خرچ کرتی ہے تو اس کے لیے اس کے اجر سے نصف ملتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1948] متفق علیہ، رواہ البخاري (5360) و مسلم (1026/84)`;