var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَلَامِي لَا يَنْسَخُ كَلَامَ اللَّهِ وَكَلَامُ اللَّهِ يَنْسَخُ كَلَامِي وَكَلَامُ اللَّهِ يَنْسَخُ بعضه بَعْضًا»";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ نے فرمایا:’’میرا کلام،اللہ کے کلام کو منسوخ نہیں کر سکتا،جبکہ اللہ کا کلام میرے کلام کو منسوخ کر سکتا ہے اور اور اللہ کا کلام ایک دوسرے کو منسوخ کر سکتا ہے۔‘‘ اسنادہ موضوع،رواہ الدارقطنی (۴/ ۱۴۵)۔";
mishkaat.description = `[195] إسنادہ موضوع، رواہ الدارقطني (4/ 145)<br>٭ فیہ جبرون بن واقد: متھم .`;