var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: فِي الْجَنَّةِ ثَمَانِيَةُ أَبْوَابٍ مِنْهَا: بَابٌ يُسَمَّى الرَّيَّانَ لَا يدْخلهُ إِلَّا الصائمون";
mishkaat.urdu = "سہل بن سعد ؓ بیان کرتے ہیں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جنت کے آٹھ دروازے ہیں،ان میں سے ایک دروازے کا نام ’’الریان‘‘ ہے،اس میں سے صرف روزہ دار ہی داخل ہوں گے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1957] متفق علیہ، رواہ البخاري (3257) و مسلم (166/ 1152)`;