var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ شَهْرُ رَمَضَانَ أَطْلَقَ كُلَّ أَسِيرٍ وَأَعْطَى كُلَّ سَائِلٍ. رَوَاهُ الْبَيْهَقِيّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،جب ماہ رمضان آتا تو رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہر قیدی کو آزاد فرما دیتے اور ہر سائل کو عطا کیا کرتے تھے۔اسنادہ ضعیف جذا۔";
mishkaat.description = `[1966] إسنادہ ضعیف جدًا، رواہ البیھقي في شعب الإیمان (3629)<br>٭ فیہ أبو بکر الھذلي: متروک۔`;