var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْتَصَفَ شَعْبَانُ فَلَا تَصُومُوا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب نصف شعبان ہو جائے تو پھر روزہ نہ رکھو۔‘‘ صحیح،رواہ ابوداؤد و الترمذی و ابن ماجہ و الدارمی۔";
mishkaat.description = `[1974] إسنادہ صحیح، رواہ أبو داود (2237) و الترمذي (738 وقال: حسن صحیح .) و ابن ماجہ (1651) والدارمي (17/2۔ 18 ح 1747)`;