var mishkaat = {};
mishkaat.arabic = "وَعَن أم سَلمَة قَالَتْ: مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلَّا شَعْبَانَ وَرَمَضَانَ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ";
mishkaat.urdu = "ام سلمہ ؓ بیان کرتی ہیں،میں نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو شعبان کے علاوہ دو ماہ لگاتار روزے رکھتے ہوئے نہیں دیکھا۔صحیح،رواہ ابوداؤد و الترمذی و النسائی و ابن ماجہ۔";
mishkaat.description = `[1976] صحیح، رواہ أبو داود (2336) و الترمذي (736 وقال: حسن .) والنسائي (150/4 ح 2177) و ابن ماجہ (1648)`;