var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: تَرَاءَى النَّاسُ الْهِلَالَ فَأَخْبَرْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي رَأَيْتُهُ فَصَامَ وَأَمَرَ النَّاسَ بِصِيَامِهِ. رَوَاهُ أَبُو دَاوُد والدارمي";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں لوگ چاند دیکھنے کے لیے جمع ہوئے تو میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو بتایا کہ میں نے اس کو دیکھ لیا ہے،آپ نے روزہ رکھا اور لوگوں کو بھی روزہ رکھنے کا حکم فرمایا۔‘‘ صحیح،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[1979] إسنادہ صحیح، رواہ أبو داود (2342) و الدارمي (4/2 1698)`;