var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَقْبَلَ اللَّيْل من هَهُنَا وَأدبر النَّهَار من هَهُنَا وَغَرَبَتِ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ»";
mishkaat.urdu = "عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب رات اس طرف سے آ جائے اور دن اس طرف پلٹ جائے اور سورج غروب ہو جائے تو روزہ دار کو چاہیے کہ وہ افطار کرے۔‘‘ متفق علیہ۔";
mishkaat.description = `[1985] متفق علیہ، رواہ البخاري (1954) و مسلم (1100/51)`;