var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَمِعَ النِّدَاءَ أَحَدُكُمْ وَالْإِنَاءُ فِي يَدِهِ فَلَا يَضَعْهُ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی اذان (فجر) سنے اور (کھانے پینے کا) برتن اس کے ہاتھ میں ہو تو وہ اپنی ضرورت پوری کرنے کے بعد اسے نیچے رکھے۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[1988] إسنادہ حسن، رواہ أبو داود (2350)`;