var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: قَالَ اللَّهُ تَعَالَى: أَحَبُّ عِبَادِي إِلَيَّ أَعْجَلُهُمْ فطرا . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ تعالیٰ فرماتا ہے: مجھے اپنے وہ بندے زیادہ محبوب ہیں جو ان میں سے افطار کرنے میں جلدی کرتے ہیں۔‘‘ ضعیف۔";
mishkaat.description = `[1989] إسنادہ ضعیف، رواہ الترمذي (700۔ 701 وقال: حسن غریب .)<br>٭ الولید بن مسلم والزھري مدلسان و عنعنا.`;