var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَفْطَرَ قَالَ: «ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ الله» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم روزہ افطار کرتے تو آپ یہ دعا پڑھا کرتے تھے:’’پیاس جاتی رہی،رگیں تر ہوگئیں اور اگر اللہ نے چاہا تو اجر ثابت ہو گیا۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[1993] إسنادہ حسن، رواہ أبو داود (2357)`;