var mishkaat = {};
mishkaat.arabic = "وَعَنْ مُعَاذٍ بْنِ زُهْرَةَ قَالَ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَفْطَرَ قَالَ: «اللَّهُمَّ لَكَ صَمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ» . رَوَاهُ أَبُو دَاوُد مُرْسلا";
mishkaat.urdu = "معاذ بن زہرہ ؒ بیان کرتے ہیں کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جب افطار کرتے تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم یہ دعا پڑھا کرتے تھے:’’اے اللہ! میں نے تیرے ہی لیے روزہ رکھا اور تیرے ہی رزق سے افطار کیا۔‘‘ ابوداؤد نے اسے مرسل روایت کیا ہے۔ضعیف۔";
mishkaat.description = `[1994] إسنادہ ضعیف، رواہ أبو داود (2358)<br>٭ السند مرسل .`;