var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَ: دَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى السَّحُورِ فِي رَمَضَانَ فَقَالَ: «هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ» . رَوَاهُ أَبُو دَاوُد والسنائي";
mishkaat.urdu = "عرباض بن ساریہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے رمضان میں مجھے سحری کی دعوت دیتے ہوئے فرمایا:’’مبارک کھانے کی طرف آؤ۔‘‘ اسنادہ حسن،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[1997] إسنادہ حسن، رواہ أبو داود (2344) و النسائي (145/4ح 2165)`;