var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ فَلَيْسَ لِلَّهِ حَاجَةٌ فِي أَنْ يَدَعَ طَعَامَهُ وَشَرَابه» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص (روزہ کی حالت میں) جھوٹ اور برے اعمال ترک نہیں کرتا تو اللہ کو کوئی حاجت نہیں کہ وہ شخص اپنا کھانا پینا ترک کر دے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[1999] رواہ البخاري (1903)`;