var mishkaat = {};
mishkaat.arabic = "وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَإِنَّمَا أَنَا قَاسِمٌ وَاللَّهِ يُعْطِي»";
mishkaat.urdu = "معاویہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ جس کے ساتھ بھلائی کا ارادہ فرماتا ہے تو اسے دین کے متعلق سمجھ بوجھ عطا فرما دیتا ہے،میں تو صرف (علم) تقسیم کرنے والا ہوں جبکہ (فہم) اللہ عطا کرتا ہے۔‘‘ متفق علیہ،رواہ البخاری (۷۱) و مسلم۔";
mishkaat.description = `[200] متفق علیہ، رواہ البخاري (71) و مسلم (98/ 1037)`;