var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُدْرِكُهُ الْفَجْرُ فِي رَمَضَانَ وَهُوَ جُنُبٌ مِنْ غَيْرِ حُلْمٍ فَيَغْتَسِلُ وَيَصُومُ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو رمضان میں کبھی جماع کی وجہ سے حالت جنابت میں صبح ہو جاتی تو آپ غسل کرتے اور پھر روزہ رکھتے۔متفق علیہ۔";
mishkaat.description = `[2001] متفق عیہ، رواہ البخاري (1930) و مسلم (1109/76)`;