var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من نسي وَهُوَ صَائِم فأل أَوْ شَرِبَ فَلْيُتِمَّ صَوْمَهُ فَإِنَّمَا أَطْعَمَهُ اللَّهُ وسقاه»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص بھول جائے کہ وہ روزہ سے ہے اور وہ کھا لے یا پی لے تو وہ اپنا روزہ پورا کرے کیونکہ اسے تو اللہ نے کھلایا پلایا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2003] متفق علیہ، رواہ البخاري (1933) و مسلم (171 /1155)`;