var mishkaat = {};
mishkaat.arabic = "وَعَنْ ثَابِتٍ الْبُنَانِيِّ قَالَ: سُئِلَ أَنَسُ بْنُ مَالِكٍ: كُنْتُمْ تَكْرَهُونَ الْحِجَامَةَ لِلصَّائِمِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: لَا إِلَّا مِنْ أَجْلِ الضَّعْفِ. رَوَاهُ الْبُخَارِيُّ";
mishkaat.urdu = "ثابت بنانی ؒ بیان کرتے ہیں،انس بن مالک ؓ سے دریافت کیا گیا،تم رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے دور میں روزہ دار کے پچھنے لگانے کو نا پسند کیا کرتے تھے؟ انہوں نے فرمایا: نہیں،صرف کمزوری کے پیش نظر۔رواہ البخاری۔";
mishkaat.description = `[2016] رواہ البخاري (1940)`;