var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبْعٍ فَلْيَصُمْ رَمَضَانَ من حَيْثُ أدْركهُ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "سلمہ بن محبق ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص کے پاس سواری ہو جو شکم سیری کے مقام پر اسے پہنچا دے وہ روزے رکھے جہاں بھی وہ رمضان کو پا لے۔‘‘ ضعیف";
mishkaat.description = `[2026] إسنادہ ضعیف، رواہ أبو داود (2410۔ 2411)<br>٭ عبد الصمد بن حبیب ضعیف ضعفہ الجمھور و حبیب بن عبد اللہ: مجھول .`;