var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَائِمُ رَمَضَانَ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ» . رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "عبدالرحمٰن بن عوف ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’دوران سفر رمضان کا روزہ رکھنے والا،حالتِ قیام میں روزہ نہ رکھنے والے کی طرح ہے۔‘‘ ضعیف۔";
mishkaat.description = `[2028] إسنادہ ضعیف، رواہ ابن ماجہ (1666)<br>٭ أبو سلمۃ لم یسمع من أبیہ کما قال علي بن المدیني و أحمد و ابن معین وغیرہم فالسند منقطع .`;