var mishkaat = {};
mishkaat.arabic = "عَنْ عَائِشَةَ قَالَتْ: كَانَ يَكُونُ عَلَيَّ الصَّوْمُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَ إِلَّا فِي شَعْبَانَ. قَالَ يَحْيَى بْنُ سَعِيدٍ: تَعْنِي الشّغل من النَّبِي أَو بِالنَّبِيِّ صلى الله عَلَيْهِ وَسلم";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،مجھ پر رمضان کے روزے ہوتے تو میں صرف شعبان میں ان کی قضا دے سکتی تھی۔یحیی بن سعید بیان کرتے ہیں،ان کی مراد یہ ہے کہ (قضا میں تاخیر) نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی مشغولیت کی وجہ سے تھی۔متفق علیہ۔";
mishkaat.description = `[2030] متفق علیہ، رواہ البخاري (1950) و مسلم (151 / 1146)`;