var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمِ وَأَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ صَلَاةُ اللَّيْلِ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’رمضان کے بعد اللہ کے مہینے محرم کا روزہ بہترین روزہ ہے،اور فرض نماز کے بعد رات کی نماز (یعنی تہجد) بہترین نماز ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2039] رواہ مسلم (202 / 1163)`;