var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَصُومُ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ إِلَّا أَن بِصَوْم قبله أَو بِصَوْم بعده»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم میں سے کوئی صرف جمعہ کے دن روزہ نہ رکھے،الاّ یہ کہ وہ اس سے پہلے یا اس کے بعد روزہ رکھے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2051] متفق علیہ، رواہ البخاري (1985) و مسلم (1144/147)`;