var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَعَّدَ اللَّهُ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا»";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص دوران جہاد ایک دن روزہ رکھتا ہے تو اللہ اس شخص کو ستر سال کی مسافت کے برابر جہنم سے دور کر دیتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2053] متفق علیہ، رواہ البخاري (2840) و مسلم (168 / 1153)`;