var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنِي أَنْ أَصُومَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلُهَا الِاثْنَيْنِ وَالْخَمِيس. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "ام سلمہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم مجھے حکم فرمایا کرتے تھے کہ میں ہر ماہ تین روزے رکھوں،ان کی ابتدا پیر سے ہو یا جمعرات سے۔‘‘ صحیح،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[2060] صحیح، رواہ أبو داود (2452) و النسائي (221/4 ح 2421)`;