var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ شَيْءٍ زَكَاةٌ وَزَكَاةُ الْجَسَدِ الصَّوْمُ» . رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ہر چیز کی زکوۃ ہے جبکہ جسم کی زکوۃ روزہ ہے۔‘‘ اسنادہ ضعیف۔";
mishkaat.description = `[2072] إسنادہ ضعیف، رواہ ابن ماجہ (1745)<br>٭ موسی بن عبیدۃ: ضعیف و جمھان: مجھول و للحدیث طرق لا یصح منھا شئ .`;