var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْعَشْرُ شَدَّ مِئْزَرَهُ وَأَحْيَا ليله وَأَيْقَظَ أَهله";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،جب آخری عشرہ شروع ہو جاتا تو رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم (عبادت کے لیے) کمر بستہ ہو جاتے،شب بیداری فرماتے اور اپنے اہل خانہ کو بھی بیدار رکھتے تھے۔متفق علیہ۔";
mishkaat.description = `[2090] متفق علیہ، رواہ البخاري (2024) و مسلم (1174/7)`;