var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ: أَنَّ عُمَرَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: كُنْتُ نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِد الْحَرَام؟ قَالَ: «فأوف بِنَذْرِك»";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ عمر ؓ نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے مسئلہ دریافت کیا،میں نے دور جاہلیت میں نذر مانی تھی کہ میں مسجد حرام میں ایک رات اعتکاف کروں گا،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنی نذر پوری کرو۔‘‘ متفق علیہ۔";
mishkaat.description = `[2101] متفق علیہ، رواہ البخاري (2032) و مسلم (27 / 1656)`;