var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا اعْتَكَفَ طُرِحَ لَهُ فِرَاشُهُ أَوْ يُوضَعُ لَهُ سَرِيرُهُ وَرَاءَ أسطوانه التَّوْبَة. رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "عبداللہ بن عمر ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں کہ جب آپ اعتکاف فرماتے تو توبہ کے ستون کے پیچھے آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے لیے بستر بچھا دیا جاتا یا چار پائی لگا دی جاتی۔اسنادہ حسن،رواہ ابن ماجہ۔";
mishkaat.description = `[2107] إسنادہ حسن، رواہ ابن ماجہ (1774)`;