var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَجْعَلُوا بِيُوتَكُمْ مَقَابِرَ إِنَّ الشَّيْطَانَ يَنْفِرُ من الْبَيْت الَّذِي يقْرَأ فِيهِ سُورَة الْبَقَرَة» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان فرماتے ہیں: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنے گھروں کو قبرستان نہ بناؤ،کیونکہ جس گھر میں سورۂ بقرہ کی تلاوت کی جائے وہاں سے شیطان بھاگ جاتا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2119] رواہ مسلم (780/212)`;