var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: إِنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ هَذِهِ السُّورَةَ: (قُلْ هُوَ الله أحد)\nقَالَ: إِنَّ حُبَّكَ إِيَّاهَا أَدْخَلَكَ الْجَنَّةَ . رَوَاهُ التِّرْمِذِيّ وروى البُخَارِيّ مَعْنَاهُ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،ایک آدمی نے عرض کیا: اللہ کے رسول! میں سورۂ اخلاص سے محبت کرتا ہوں،آپ نے فرمایا:’’بے شک تمہاری اس سے محبت ہی تمہیں جنت میں لے جائے گی۔‘‘ ترمذی۔اور امام بخاری نے اس کا مفہوم بیان کیا ہے۔رواہ البخاری و الترمذی۔";
mishkaat.description = `[2130] رواہ البخاري (2774) و الترمذي (2901)`;