var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَلَمْ تَرَ آيَاتٍ أُنْزِلَتِ اللَّيْلَةَ لَمْ يُرَ مِثْلُهُنَّ قَطُّ (قل أعوذ بِرَبّ الفلق)\nو (قل أعوذ بِرَبّ النَّاس)\nرَوَاهُ مُسلم";
mishkaat.urdu = "عقبہ بن عامر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کیا تمہیں معلوم نہیں کہ آج رات ایسی آیات نازل ہوئیں کہ ان جیسی پہلے نہیں دیکھی گئیں،سورۃ الفلق اور سورۃ الناس۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2131] رواہ مسلم (814/264)`;