var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَوْ جُعِلَ الْقُرْآنُ فِي إِهَابٍ ثُمَّ أُلْقِيَ فِي النَّار مَا احْتَرَقَ» . رَوَاهُ الدَّارمِيّ";
mishkaat.urdu = "عقبہ بن عامر ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’اگر قرآن کو چمڑے میں رکھ کر آگ میں ڈال دیا جائے تو وہ جلے گا نہیں۔‘‘ اسنادہ حسن،رواہ الدارمی۔";
mishkaat.description = `[2140] إسنادہ حسن، رواہ الدارمي (430/2 ح 3313)<br>٭ ابن لھیعۃ صرح بالسماع و حدث بہ قبل اختلاطہ والحمد للّٰہ .`;