var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ مُرْسَلًا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فِي فَاتِحَةِ الْكِتَابِ شِفَاءٌ مِنْ كُلِّ دَاءٍ» . رَوَاهُ الدَّارمِيّ وَالْبَيْهَقِيّ فِي شعب الْإِيمَان";
mishkaat.urdu = "عبدالملک بن عمیر مرسل روایت بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سورۂ فاتحہ میں ہر بیماری سے شفا ہے۔‘‘ اسنادہ ضعیف۔";
mishkaat.description = `[2170] إسنادہ ضعیف، رواہ الدارمي (445/2 ح 3373) و البیھقي في شعب الإیمان (2370)<br>٭ سفیان بن عیینۃ مدلس و عنعن والخبر مرسل .`;