var mishkaat = {};
mishkaat.arabic = "وَعَن كَعْب رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ: «اقرؤوا سُورَة هود يَوْم الْجُمُعَة» . رَوَاهُ الدِّرَامِي مُرْسلا";
mishkaat.urdu = "کعب ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جمعہ کے روز سورۂ ھود پڑھا کرو۔‘‘ اسنادہ ضعیف۔";
mishkaat.description = `[2174] إسنادہ ضعیف، رواہ الدارمي (454/2 ح 3407، نسخۃ محققۃ: 3447) [و أبو داود فی المراسیل (59) و البیھقي في شعب الإیمان (2438)]<br>٭ سندہ صحیح إلی کعب الأحبار رحمہ اللہ ولکنہ ضعیف لإرسالہ .`;