var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ قَالَ: إِنَّ لِكُلِّ شَيْءٍ سَنَامًا وَإِنَّ سَنَامَ الْقُرْآنِ سُورَةُ الْبَقَرَةِ وَإِنَّ لِكُلِّ شَيْءٍ لُبَابًا وَإِنَّ لباب الْقُرْآن الْمفصل. رَوَاهُ الدَّارمِيّ";
mishkaat.urdu = "عبداللہ بن مسعود ؓ سے روایت ہے کہ انہوں نے فرمایا: ہر چیز کی ایک چوٹی ہوتی ہے اور قرآن کی چوٹی سورۃ البقرہ ہے،اور ہر چیز کا ایک مغز ہوتا ہے اور قرآن کا مغز مفصل سورتیں (سورۃ الحجرات سے الناس تک) ہیں۔‘‘ اسنادہ حسن،رواہ الدارمی۔";
mishkaat.description = `[2179] إسنادہ حسن، رواہ الدارمي (447/2ح 3380، نسخۃ محققۃ: 3420)`;