var mishkaat = {};
mishkaat.arabic = "وَعَنْ جُنْدُبِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «اقرؤوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فَقومُوا عَنهُ»";
mishkaat.urdu = "جندب بن عبداللہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قرآن اس وقت تک پڑھو جب تک تمہارے دل اس پر متوجہ ہوں،اور جب تمہارے خیالات منتشر ہو جائیں تو پھر اسے پڑھنا چھوڑ دو۔‘‘ متفق علیہ۔";
mishkaat.description = `[2190] متفق علیہ، رواہ البخاري (5060) و مسلم (3۔ 4 / 2667)`;