var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ نے اتنی توجہ سے کسی چیز کو نہیں سنا جتنا اس نے نبی کو ترنم کے ساتھ قرآن پڑھتے ہوئے توجہ سے سنا۔‘‘ متفق علیہ۔";
mishkaat.description = `[2192] متفق علیہ، رواہ البخاري (5023۔ 5024) و مسلم (792/232)`;