var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسِنِ الصَّوْتِ بِالْقُرْآنِ يَجْهَرُ بِهِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ نے اتنی توجہ سے کسی چیز کو نہیں سنا جتنا اس نے اپنے نبی کو خوش الحانی کے ساتھ با آواز بلند قرآن پڑھتے ہوئے سنا۔‘‘ متفق علیہ۔";
mishkaat.description = `[2193] متفق علیہ، رواہ البخاري (7544) و مسلم (233/ 792)`;