var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ";
mishkaat.urdu = "براء بن عازب ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنی آوازوں کے ذریعے قرآن کو مزین کرو۔‘‘ صحیح،رواہ احمد و ابوداؤد و ابن ماجہ و الدارمی۔";
mishkaat.description = `[2199] صحیح، رواہ أحمد (285/4 ح 18713) و أبو داود (1468) و ابن ماجہ (1342) والدارمي (474/2 ح3503)`;