var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعْرِفُ فَصْلَ السُّورَةِ حَتَّى يَنْزِلَ عَلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو (بسم اللہ الرحمن الرحیم) کے نازل ہونے کے بعد سورت کے فرق کا پتہ چلتا تھا۔(کہ پہلی سورت مکمل ہو گئی ہے) صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[2218] صحیح، رواہ أبو داود (788)`;