var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ مِنَ الدُّعَاءِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ کے ہاں دعا سے بہتر کوئی چیز نہیں۔‘‘ ترمذی،ابن ماجہ۔اور امام ترمذی نے فرمایا: یہ حدیث حسن غریب ہے۔اسنادہ ضعیف،رواہ الترمذی (۳۳۷۰) و ابن ماجہ (۳۸۲۹)۔";
mishkaat.description = `[2232] إسنادہ ضعیف، رواہ الترمذي (3370) وابن ماجہ (3829)<br>٭ قتادۃ مدلس و عنعن .`;