var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَسْأَلِ اللَّهَ يغضبْ عَلَيْهِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص اللہ سے سوال نہیں کرتا تو وہ اس پر ناراض ہوتا ہے۔‘‘ سندہ ضعیف رواہ الترمذی (۳۳۷۳) و ابن ماجہ (۳۸۲۷)۔";
mishkaat.description = `[2238] سندہ ضعیف، رواہ الترمذي (3373) [و ابن ماجہ: 3827]<br>٭ أبو صالح الخوزي لین الحدیث .`;