var mishkaat = {};
mishkaat.arabic = "وَعَنْ مَالِكِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَأَلْتُمُ اللَّهَ فَاسْأَلُوهُ بِبُطُونِ أَكُفِّكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا»";
mishkaat.urdu = "مالک بن یسار ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم اللہ سے دعا کرو تو اس سے سیدھے ہاتھوں سے دعا کرو اور اس سے الٹے ہاتھوں سے دعا نہ کرو۔‘‘ اسنادہ حسن،رواہ ابوداؤد (۱۴۸۶)۔";
mishkaat.description = `[2242] إسنادہ حسن، رواہ أبو داود (1486)`;