var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةِ ابْنِ عَبَّاسٍ قَالَ: «سَلُوا اللَّهَ بِبُطُونِ أَكُفِّكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا فَإِذَا فَرَغْتُمْ فامسحوا بهَا وُجُوهكُم» . رَوَاهُ دَاوُد";
mishkaat.urdu = "ابن عباس ؓ کی روایت میں ہے،فرمایا:’’اللہ سے سیدھے ہاتھوں سے دعا کیا کرو،الٹے ہاتھوں سے دعا نہ کیا کرو،اور جب تم (دعا سے) فارغ ہو جاؤ تو ان (ہاتھوں) کو اپنے چہروں پر پھیر لیا کرو۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد (۱۴۸۵)۔";
mishkaat.description = `[2243] إسنادہ ضعیف، رواہ أبو داود (1485)<br>٭ فیہ مجھول و علۃ أخری و للحدیث شواھد ضعیفۃ انظر الحدیث الآتي (2245)`;