var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَحِبُّ الْجَوَامِعَ مِنَ الدُّعَاءِ وَيَدَعُ مَا سِوَى ذَلِكَ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جامع دعائیں کرنا پسند کرتے تھے اور ان کے علاوہ باقی دعائیں چھوڑ دیا کرتے تھے۔اسنادہ صحیح،رواہ ابوداؤ (۱۴۸۲) وصحیحہ ابن حبان (۲۴۱۲) و الحاکم (۱ / ۵۳۹)۔";
mishkaat.description = `[2246] إسنادہ صحیح، رواہ أبو داود (1482) [و صححہ ابن حبان (المواد: 2412) والحاکم (539/1) ووافقہ الذہبي.]`;