var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ فِي الدُّعَاءِ حَتَّى يُرى بياضُ إبطَيْهِ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دورانِ دعا اپنے ہاتھ اس قدر بلند فرماتے کہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی بغلوں کی سفیدی نظر آنے لگتی۔صحیح،رواہ البیھقی فی الدعوات الکبیر (۱ / ۱۳۸ ح ۱۸۲) و مسلم و احمد (۳ /۲۵۹)۔";
mishkaat.description = `[2253] صحیح، رواہ البیھقي فی الدعوات الکبیر (138/1 ح 182) [و مسلم (895) و أحمد (259/3)]`;