var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ أَنَّهُ يَقُولُ: إِنَّ رَفْعَكُمْ أَيْدِيَكُمْ بِدْعَةٌ مَا زَادَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذَا يَعْنِي إِلَى الصَّدْر رَوَاهُ أَحْمد";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ وہ فرمایا کرتے تھے: تمہارا (دعا کے لیے) ہاتھ اٹھانا بدعت ہے،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اس (یعنی) سینے سے اوپر ہاتھ نہیں اٹھاتے تھے۔اسنادہ ضعیف،رواہ احمد (۲ / ۶۱ ح ۵۲۶۴)۔";
mishkaat.description = `[2257] إسنادہ ضعیف، رواہ أحمد (61/2 ح 5264)<br>٭ فیہ بشر بن حرب الندبي: ضعیف ضعفہ الجمھور .`;