var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الَّذِي يَذْكُرُ رَبَّهُ وَالَّذِي لَا يَذْكُرُ مَثَلُ الْحَيّ وَالْمَيِّت»";
mishkaat.urdu = "ابوموسی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ شخص جو اپنے رب کا ذکر کرتا ہے وہ زندہ کی طرح ہے اور وہ شخص جو ذکر نہیں کرتا مردہ کی طرح ہے۔‘‘ متفق علیہ،رواہ البخاری (۶۴۰۷) و مسلم";
mishkaat.description = `[2263] متفق علیہ، رواہ البخاري (6407) و مسلم (779/211)`;