var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَأَنْ أَقُولَ: سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْس . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سُبْحَانَ اللہِ،وَالْحَمْدُلِلہِ،وَلَا اِلَٰہ اِلَّا اللہُ وَاللہُ اَکْبَرُ،پڑھ لینا مجھے پوری کائنات (کے مل جانے) سے زیادہ پسند ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2295] رواہ مسلم (2695/32)`;