var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي ذَرٍّ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْكَلَامِ أَفْضَلُ؟ قَالَ: مَا اصْطَفَى اللَّهُ لِمَلَائِكَتِهِ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوذر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے دریافت کیا گیا،کون سا کلام افضل ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو اللہ نے اپنے فرشتوں کے لئے منتخب کیا ((سُبْحَان اللہِ وَبِحَمْدِہِ))۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2300] رواہ مسلم (2731/84)`;