var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَالَ سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص ((سُبْحَانَ اللہِ الْعَظِیْمِ وَبِحَمْدِہِ)) پڑھتا ہے تو اس کے لئے جنت میں کھجور کا ایک درخت لگا دیا جاتا ہے۔‘‘ سندہ ضعیف،رواہ الترمذی (۳۴۶۴)۔";
mishkaat.description = `[2304] سندہ ضعیف، رواہ الترمذي (3464 و قال: حسن صحیح غریب)<br>٭ أبو الزبیر مدلس و عنعن .`;