var mishkaat = {};
mishkaat.arabic = "وَعَنِ الزُّبَيْرِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ صَبَاحٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلَّا مُنَادٍ يُنَادِي سَبِّحُوا الْمَلِكَ القدوس» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "زبیر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ہر صبح ایک اعلان کرنے والا (فرشتہ) اعلان کرتا ہے: منزہ و مقدس بادشاہ کی تسبیح بیان کرو۔‘‘ اسنادہ ضعیف،رواہ الترمذی (۳۵۶۹)۔";
mishkaat.description = `[2305] إسنادہ ضعیف، رواہ الترمذي (3569 وقال: غریب)<br>٭ فیہ موسی بن عبیدۃ و محمد بن ثابت: ضعیفان .`;