var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ إِنِّي لِأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سبعينَ مرَّةً» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ کی قسم! میں دن میں ستر بار سے زیادہ اللہ سے مغفرت طلب کرتا ہوں اور اس کے حضور توبہ کرتا ہوں۔‘‘ رواہ البخاری (۶۳۰۷)۔";
mishkaat.description = `[2323] رواہ البخاري (6307)`;