var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْأَغَرِّ الْمُزَنِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهُ لَيُغَانُ عَلَى قَلْبِي وَإِنِّي لَأَسْتَغْفِرُ اللَّهَ فِي الْيَوْم مائَة مرّة» . رَوَاهُ مُسلم";
mishkaat.urdu = "اغرّ المزنی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میرے دل پر پردہ سا آ جاتا ہے اور میں دن میں سو مرتبہ اللہ سے مغفرت طلب کرتا ہوں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2324] رواہ مسلم (2702/41)`;