var mishkaat = {};
mishkaat.arabic = "وَرَوَاهُ ابْنُ مَاجَهْ عَنِ ابْنِ مَسْعُودٍ وَجَابِرٍ وَلَمْ يَذْكُرِ: «اتَّقُوا الْحَدِيثَ عَنِّي إِلَّا مَا علمْتُم»";
mishkaat.urdu = "ابن ماجہ نے ابن مسعود ؓ سے روایت کیا ہے لیکن ابن ماجہ نے یہ الفاظ:’’مجھ سے حدیث بیان کرتے وقت احتیاط کرو اور وہی حدیث بیان کرو جس کے بارے میں تمہیں علم ہو۔‘‘ ذکر نہیں کئے۔صحیح،رواہ ابن ماجہ (۳۰،۳۳) و الترمذی (۲۲۵۷)۔";
mishkaat.description = `[233] صحیح، رواہ ابن ماجہ (30، 33) [والترمذي: 2257 وقال: حسن صحیح .]<br>٭ ھذا الحدیث متواتر .`;