var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِنَّ الْعَبَدَ إِذَا اعْتَرَفَ ثُمَّ تَابَ تَابَ الله عَلَيْهِ»";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب بندہ اعتراف کر لیتا ہے پھر توبہ کرتا ہے تو اللہ بھی (رحمت کے ساتھ) اس پر رجوع فرماتا ہے۔‘‘ متفق علیہ،رواہ البخاری (۴۱۴۱) و مسلم";
mishkaat.description = `[2330] متفق علیہ، رواہ البخاري (4141) و مسلم (2770/56)`;