var mishkaat = {};
mishkaat.arabic = "وَعَن عبد الله بن يسر قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طُوبَى لِمَنْ وَجَدَ فِي صَحِيفَتِهِ اسْتِغْفَارًا كَثِيرًا» . رَوَاهُ ابْنُ مَاجَهْ وَرَوَى النَّسَائِيُّ فِي «عملِ يَوْم وَلَيْلَة»";
mishkaat.urdu = "عبداللہ بن بُسر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس شخص کے لئے خوشخبری ہو جو اپنے نامہ اعمال میں بہت زیادہ استغفار پائے۔‘‘ اسنادہ حسن،رواہ ابن ماجہ۔";
mishkaat.description = `[2356] إسنادہ حسن، رواہ ابن ماجہ (2818) والنسائي في عمل الیوم واللیلۃ (455 و الکبری: 10289)`;