var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُدْخِلُ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ وَلَا يُجِيرُهُ مِنَ النَّارِ وَلَا أَنا إِلا برحمةِ الله» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم میں سے کسی کا عمل اسے جنت میں داخل کرا سکتا ہے نہ اسے جہنم سے بچا سکتا ہے اور میں بھی اللہ کی رحمت کے ساتھ (جنت میں جاؤں گا)۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2372] رواہ مسلم (2817/77)`;