var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ الْخَطْمِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَسْتَوْدِعَ الْجَيْشَ قَالَ: «أَسْتَوْدِعُ اللَّهَ دِينَكُمْ وأمانتكم وخواتيم أَعمالكُم» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عبداللہ خطمی ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم لشکر روانہ کرنے کا ارادہ فرماتے تو یوں دعا فرماتے:’’میں تمہارے دین،تمہاری امانتوں اور تمہارے آخری اعمال کو اللہ کے سپرد کرتا ہوں۔‘‘ اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[2436] إسنادہ صحیح، رواہ أبو داود (2601)`;