var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «تَعَوَّذُوا بِاللَّهِ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ القضاءِ وشَماتة الْأَعْدَاء»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آزمائش کی شدت،بدبختی کی آمد،تقدیر کی زحمت اور دشمنوں کی خوشی سے اللہ کی پناہ طلب کرو۔‘‘ متفق علیہ۔";
mishkaat.description = `[2457] متفق علیہ، رواہ البخاري (6616) و مسلم (2707/53)`;