var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دعا کیا کرتے تھے:’’اے اللہ! میں فکر و غم،عاجزی اور سستی،بزدلی اور بخل،قرضے کے بوجھ اور لوگوں کے غلبے سے تیری پناہ چاہتا ہوں۔‘‘ متفق علیہ۔";
mishkaat.description = `[2458] متفق علیہ، رواہ البخاري (6369) و مسلم (2706/50)`;