var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ وَالنِّفَاقِ وَسُوءِ الْأَخْلَاقِ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دعا کیا کرتے تھے:’’اے اللہ! میں تنازع و اختلاف،نفاق اور برے اخلاق سے تیری پناہ چاہتا ہوں۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[2468] إسنادہ ضعیف، رواہ أبو داود (1546) والنسائي (264/8 ح 5473)<br>٭ فیہ ضبارۃ: مجھول .`;