var mishkaat = {};
mishkaat.arabic = "وَعَن قُطْبةَ بْنِ مَالِكٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الْأَخْلَاق والأعمال والأهواء» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "قطبہ بن مالک ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دعا کیا کرتے تھے:’’اے اللہ! میں برے اخلاق،بُرے اعمال اور بُری خواہشات سے تیری پناہ چاہتا ہوں۔‘‘ صحیح،رواہ الترمذی۔";
mishkaat.description = `[2471] صحیح، رواہ الترمذي (3591 وقال: حسن غریب) [و صححہ الحاکم علی شرط مسلم (532/1) ووافقہ الذہبي]`;