var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَظَرَ إِلَى الْقَمَرِ فَقَالَ: «يَا عَائِشَةُ اسْتَعِيذِي بِاللَّهِ مِنْ شَرِّ هَذَا فَإِنَّ هَذَا هُوَ الْغَاسِقُ إِذا وَقب» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عائشہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے چاند کی طرف دیکھا تو فرمایا:’’عائشہ ؓ! اس کے شر سے اللہ کی پناہ طلب کرو،کیونکہ یہی وہ غاسق ہے جب بے نور ہو جائے۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[2475] إسنادہ حسن، رواہ الترمذي (3366 وقال: حسن صحیح) [و صححہ الحاکم (540/2۔ 541) ووافقہ الذہبي]`;