var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى» . رَوَاهُ مُسلم";
mishkaat.urdu = "عبداللہ بن مسعود ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں کہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دعا کیا کرتے تھے:’’اے اللہ! میں تجھ سے ہدایت،تقوی اور عفت اور تونگری کا سوال کرتا ہوں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2484] رواہ مسلم (72/ 2721)`;