var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قُلْ اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي وَاذْكُرْ بِالْهُدَى هِدَايَتَكَ الطَّرِيقَ وبالسداد سداد السهْم» . رَوَاهُ مُسلم";
mishkaat.urdu = "علی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے فرمایا:’’کہو،اے اللہ! میری راہنمائی فرما،مجھے درست رکھ اور (اے علی ؓ) راہنمائی سے راہ ہدایت پہ چلنے کا تصور اور درست ہونے سے تیر کا سا درست ہونا تصور میں رکھ۔رواہ مسلم۔";
mishkaat.description = `[2485] رواہ مسلم (2725/78)`;