var mishkaat = {};
mishkaat.arabic = "وَعَن أنسٍ قَالَ: كَانَ أَكْثَرُ دُعَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وقنا عَذَاب النَّار»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی اکثر یہ دعا ہوا کرتی تھی ’’اے اللہ! ہمیں دنیا میں بھلائی عطا فرما اور آخرت میں بھلائی عطا فرما،اور ہمیں آگ کے عذاب سے بچا۔‘‘ متفق علیہ۔";
mishkaat.description = `[2487] متفق علیہ، رواہ البخاري (6389) و مسلم (2690/26)`;