var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مِنْ حَجَّ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَيَوْمِ وَلَدَتْهُ أمه»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص اللہ کے لئے حج کرے،پھر وہ گناہ کا کام کرے نہ فحش گوئی کرے تو وہ (گناہوں سے پاک ہو کر) اس روز کی طرح لوٹتا ہے جس روز اس کی والدہ نے اسے جنم دیا تھا۔‘‘ متفق علیہ۔";
mishkaat.description = `[2507] متفق علیہ، رواہ البخاري (1521) و مسلم (1350/438)`;