var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزاءٌ إِلا الجنَّةُ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عمرہ دوسرے عمرہ تک کے درمیانی وقفہ میں ہونے والے گناہوں کا کفارہ ہے،اور حج مقبول کی جزا جنت ہی ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2508] متفق علیہ، رواہ البخاري (1773) و مسلم (1349/437)`;