var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nلَا صَرُورَةَ فِي الإِسلامِ . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اسلام میں ’’صرورہ‘‘ (گوشہ نشینی اختیار کرنا،شادی نہ کرنا،استطاعت کے باوجود حج نہ کرنا وغیرہ) نہیں ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[2522] إسنادہ ضعیف، رواہ أبو داود (1729)<br>٭ و حقق الإمام أحمد و ابن معین وغیرہما بأن فی السند عمر بن عطاء بن وراز ھو ضعیف .`;