var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ عَلَى النِّسَاءِ جِهَادٌ؟ قَالَ: نَعَمْ عَلَيْهِنَّ جِهَادٌ لَا قِتَالَ فِيهِ: الْحَجُّ وَالْعُمْرَةُ . رَوَاهُ ابْنُ مَاجَه";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں نے عرض کیا،اللہ کے رسول! کیا عورتوں پر جہاد فرض ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا: ہاں،ان پر جہاد فرض ہے لیکن ان میں قتال نہیں،اور وہ جہاد حج و عمرہ ہے۔‘‘ صحیح،رواہ ابن ماجہ۔";
mishkaat.description = `[2534] صحیح، رواہ ابن ماجہ (2901)`;