var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَدْخَلَ رِجْلَهُ فِي الْغَرْزِ وَاسْتَوَتْ بِهِ نَاقَتُهُ قَائِمَةً أَهَلَّ منَ عندِ مسجدِ ذِي الحليفة";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اپنا پاؤں رکاب میں رکھ لیتے اور آپ کی اونٹنی آپ کو لے کر سیدھی کھڑی ہو جاتی تو آپ ذوالحلیفہ کی مسجد کے پاس تلبیہ پکارتے۔متفق علیہ۔";
mishkaat.description = `[2542] متفق علیہ، رواہ البخاري (2865) و مسلم (1187/27)`;