var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: تَمَتَّعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ إِلَى الْحَجِّ بدأَ فأهلَّ بالعمْرةِ ثمَّ أهلَّ بالحجّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حجۃ الوداع کے موقع پر حج کے ساتھ عمرہ ملایا تھا،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے پہلے عمرے کے لیے تلبیہ کہا اور پھر حج کے لیے۔متفق علیہ۔";
mishkaat.description = `[2546] متفق علیہ، رواہ البخاري (1961) و مسلم (174 / 1227)`;