var mishkaat = {};
mishkaat.arabic = "عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَجَرَّدَ لِإِهْلَالِهِ وَاغْتَسَلَ. رَوَاهُ التِّرْمِذِيّ والدارمي";
mishkaat.urdu = "زید بن ثابت ؓ سے روایت ہے کہ انہوں نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو دیکھا کہ آپ نے احرام باندھنے کے لیے اپنا لباس اتارا اور غسل کیا (پھر احرام باندھا)۔اسنادہ حسن،رواہ الترمذی و الدارمی۔";
mishkaat.description = `[2547] إسنادہ حسن، رواہ الترمذي (830 و قال: حسن غریب) و الدارمي (31/2 ح 1801)`;