var mishkaat = {};
mishkaat.arabic = "وَعَنِ الزُّبَيْرِ بْنِ عَرَبِيٍّ قَالَ: سَأَلَ رَجُلٌ ابنَ عمرَ عَنِ اسْتِلَامِ الْحَجَرِ فَقَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُهُ وَيُقَبِّلُهُ. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "زبیر بن عربی ؒ بیان کرتے ہیں،کسی آدمی نے عبداللہ بن عمر ؓ سے حجر اسود کو بوسہ دینے کے بارے میں دریافت کیا تو انہوں نے فرمایا: میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو اسے ہاتھ لگاتے اور بوسہ دیتے ہوئے دیکھا ہے۔رواہ البخاری۔";
mishkaat.description = `[2567] رواہ البخاري (1611)`;