var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ بِالْبَيْتِ عَلَى بَعِيرٍ كُلَّمَا أَتَى عَلَى الرُّكْنِ أَشَارَ إِلَيْهِ بِشَيْءٍ فِي يدِه وكبَّرَ. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اونٹ پر سوار ہو کر بیت اللہ کا طواف کیا جب آپ حجر اسود کے پاس آتے تو آپ اپنے ہاتھ میں موجود کسی چیز کے ساتھ اشارہ کرتے اور اللہ اکبر کہتے۔رواہ البخاری۔";
mishkaat.description = `[2570] رواہ البخاري (1632)`;