var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ قَالَ: مَا تَرَكْنَا اسْتِلَامَ هَذَيْنِ الرُّكْنَيْنِ: الْيَمَانِي وَالْحَجَرِ فِي شِدَّةٍ وَلَا رخاء مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يستلمهما";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،میں نے جب سے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو حجر اسود اور رکنِ یمانی کا استلام (چھونا) کرتے ہوئے دیکھا ہے تب سے ہم نے تنگی یا آسانی کسی بھی حال میں اِن کا استلام کرنا نہیں چھوڑا۔متفق علیہ";
mishkaat.description = `[2586] متفق علیہ، رواہ البخاري (1606) ومسلم (1268/245)`;