var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: رَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَمْرَةَ يَوْمَ النَّحْرِ ضُحًى وَأَمَّا بَعْدَ ذَلِكَ فَإِذَا زَالَتِ الشَّمْسُ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے قربانی کے دن چاشت کے وقت کنکریاں ماریں،جبکہ اس کے بعد سورج ڈھل جانے کے بعد ماریں۔متفق علیہ۔";
mishkaat.description = `[2620] متفق علیہ، رواہ البخاري (الحج باب 134 قبل ح 1746 تعلیقًا عن جابر رضي اللہ عنہ .) و مسلم (1300/314)`;