var mishkaat = {};
mishkaat.arabic = "عَنْ نَافِعٍ قَالَ: إِنَّ ابْنَ عُمَرَ كَانَ يَقِفُ عِنْدَ الْجَمْرَتَيْنِ الْأُولَيَيْنِ وُقُوفًا طَوِيلًا يُكَبِّرُ اللَّهَ وَيُسَبِّحُهُ وَيَحْمَدُهُ وَيَدْعُو اللَّهَ وَلَا يَقِفُ عنْدَ جمرَةِ العقبةِ. رَوَاهُ مَالك";
mishkaat.urdu = "نافع ؒ بیان کرتے ہیں کہ عبداللہ بن عمر ؓ پہلے دو جمروں کے پاس بہت دیر تک ٹھہرتے،اللہ کی کبریائی بیان کرتے،اس کی تسبیح و تحمید بیان کرتے اور اللہ سے دعائیں کرتے،لیکن وہ جمرہ عقبی (بڑے شیطان) کے پاس کھڑے نہیں ہوتے تھے۔اسنادہ صحیح،رواہ مالک۔";
mishkaat.description = `[2626] إسنادہ صحیح، رواہ مالک (407/1 ح 939)`;