var mishkaat = {};
mishkaat.arabic = "وَعَن ابنِ عمَرَ: أَنَّهُ أَتَى عَلَى رَجُلٍ قَدْ أَنَاخَ بِدَنَتَهُ يَنْحَرُهَا قَالَ: ابْعَثْهَا قِيَامًا مُقَيَّدَةً سُنَّةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ وہ ایک آدمی کے پاس آئے جو اپنے قربانی کے اونٹ کو بٹھا کر نحرکر رہا تھا،تو انہوں نے اسے فرمایا:’’محمد صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی سنت کے مطابق اسے کھڑا کرو اور اس کی ٹانگ کو باندھو (پھر نحر کرو)۔متفق علیہ۔";
mishkaat.description = `[2637] متفق علیہ، رواہ البخاري (1713) و مسلم (1320/358)`;