var mishkaat = {};
mishkaat.arabic = "وَرَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنِ ابْنِ عُمَرَ مِنْ قَوْلِهِ: «مَنْ جَعَلَ الْهُمُومَ» إِلَى آخِره";
mishkaat.urdu = "بیہقی نے شعب الایمان میں ابن عمر ؓ سے آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے قول:((من جعل الھموم،،،،)) سے آخر تک روایت کیا ہے۔اسنادہ ضعیف،رواہ البیھقی فی شعب الایمان (۱۸۸۸) و الحاکم فی المستدرک (۴/ ۳۲۸،۳۲۹)۔";
mishkaat.description = `[264] إسنادہ ضعیف، رواہ البیھقي في شعب الإیمان (1888) [و الحاکم فی المستدرک 4/ 328، 329]<br>٭ فیہ یحیی بن المتوکل أبو عقیل وھو ضعیف .`;