var mishkaat = {};
mishkaat.arabic = "وَعَن يحيى بن الْحصين عَن جدته أَنَّهَا سَمِعَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ دَعَا لِلْمُحَلِّقِينَ ثَلَاثًا وَلِلْمُقَصِّرِينَ مرّة وَاحِدَة. رَوَاهُ مُسلم";
mishkaat.urdu = "یحیی بن حصین ؒ اپنی دادی سے روایت کرتے ہیں کہ انہوں نے حجۃ الوداع کے موقع پر نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو سر منڈوانے والوں کے لیے تین بار اور بال کترانے والوں کے لیے ایک بار دعا کرتے ہوئے سنا۔رواہ مسلم۔";
mishkaat.description = `[2649] رواہ مسلم (1303/321)`;