var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْأَعْمَشِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «آفَةُ الْعِلْمِ النِّسْيَانُ وَإِضَاعَتُهُ أَنْ تُحَدِّثَ بِهِ غَيْرَ أَهْلِهِ» . رَوَاهُ الدَّارِمِيُّ مُرْسلا";
mishkaat.urdu = "اعمش ؒ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بھول جانا علم کے لیے آفت ہے،اور جو علم کی اہلیت نہیں رکھتے ان سے اسے بیان کرنا اسے ضائع کرنا ہے۔‘‘ اسنادہ ضعیف،رواہ الدارمی (۱/ ۱۵۰ ح ۶۳۰)۔";
mishkaat.description = `[265] إسنادہ ضعیف، رواہ الدارمي (1/ 150 ح 630)<br>٭ السند مرسل .`;