var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كُنْتُ أُطَيِّبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَلَ أَنْ يُحْرِمَ وَيَوْمَ النَّحْرِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ بِطِيبٍ فِيهِ مِسْكٌ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو احرام باندھنے سے پہلے اور قربانی کے دن بیت اللہ کا طواف کرنے سے پہلے کستوری کی ملاوٹ والی خوشبو لگایا کرتی تھی۔متفق علیہ۔";
mishkaat.description = `[2651] متفق علیہ، رواہ البخاري (1539) و مسلم (1191/46)`;