var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى النِّسَاءِ الْحَلْقُ إِنَّمَا عَلَى النِّسَاءِ التَّقْصِيرُ» . رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ\nوَهَذَا الْبَابُ خَالٍ مِنَ الْفَصْلِ الثَّالِثِ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عورتوں پر سر منڈانا واجب نہیں،ان پر بال کترانا واجب ہے۔‘‘ حسن،رواہ ابوداؤد و الترمذی و الدارمی۔";
mishkaat.description = `[2654] حسن، رواہ أبو داود (1984۔ 1985) و الدارمي (64/2 ح 1911)`;