var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: اسْتَأْذَنَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيتَ بِمَكَّةَ لَيَالِيَ منى من أجلِ سِقايتِهِ فَأذن لَهُ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،عباس بن عبدالمطلب ؓ نے پانی پلانے کی وجہ سے،منیٰ کی راتیں مکہ میں گزارنے کے لیے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے اجازت طلب کی تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے انہیں اجازت دے دی۔متفق علیہ۔";
mishkaat.description = `[2662] متفق علیہ، رواہ البخاري (1634) و مسلم (1315/346)`;