var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعَشَاءَ ثُمَّ رَقَدَ رَقْدَةً بِالْمُحَصَّبِ ثُمَّ رَكِبَ إِلَى الْبَيْتِ فَطَافَ بِهِ. رَوَاهُ الْبُخَارِيُّ";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ظہر،عصر،مغرب اور عشا کی نمازیں پڑھیں،پھر آپ وادی محصب میں تھوڑی دیر سوئے،پھر آپ سواری پر بیت اللہ تشریف لائے اور اس کا طواف (وداع) کیا۔رواہ البخاری۔";
mishkaat.description = `[2664] رواہ البخاري (1756)`;