var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: نُزُولُ الْأَبْطَحِ لَيْسَ بِسُنَّةٍ إِنَّمَا نَزَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَنَّهُ كَانَ أسمح لِخُرُوجِهِ إِذا خرج";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،ابطح میں قیام کرنا سنت نہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے تو وہاں اس لیے قیام فرمایا تھا کہ وہاں سے (مدینہ کے لیے) روانہ ہونا زیادہ آسان تھا۔متفق علیہ۔";
mishkaat.description = `[2666] متفق علیہ، رواہ البخاري (1765) و مسلم (1311/339)`;