var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةِ أَحْمَدَ وَالنَّسَائِيِّ عَنِ ابْنِ عَبَّاسٍ قَالَ: «إِذَا رَمَى الْجَمْرَةَ فَقَدْ حَلَّ لَهُ كلُّ شيءٍ إِلا النساءَ»";
mishkaat.urdu = "احمد اور نسائی کی ابن عباس سے مروی روایت میں ہے،فرمایا:’’جب وہ کنکریاں مار لے تو بیویوں کے علاوہ ہر چیز اس پر حلال ہو جاتی ہے۔‘‘ سندہ ضعیف،رواہ احمد و النسائی۔";
mishkaat.description = `[2675] سندہ ضعیف، رواہ أحمد (234/1 ح 2090) و النسائي (277/6 ح 3086) [و ابن ماجہ (3041)]<br>٭ الحسن العرني ثقۃ أرسل عن ابن عباس رضي اللہ عنہ (تقدم: 2613) و لبعض الحدیث شاھد عند مسلم (1179)`;