var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَهُوَ يَقُولُ: «إِذَا لَمْ يَجِدِ الْمُحْرِمُ نَعْلَيْنِ لَبَسَ خُفَّيْنِ وَإِذَا لَمْ يَجِدْ إِزَارًا لَبَسَ سَرَاوِيل»";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو خطاب کرتے ہوئے سنا،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم فرما رہے تھے:’’جب محرِم جوتے نہ پائے تو وہ موزے پہن لے اور جب وہ تہبند نہ پائے تو شلوار پہن لے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2679] متفق علیہ، رواہ البخاري (1841) و مسلم (1178/4)`;