var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: إِنَّ مِنْ أَشَرِّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ: عَالِمٌ لَا ينْتَفع بِعِلْمِهِ . رَوَاهُ الدَّارمِيّ";
mishkaat.urdu = "ابودرداء ؓ بیان کرتے ہیں:’’روز قیامت اللہ کے ہاں سب سے بُرا مقام اس عالم کا ہو گا جو اپنے علم سے فائدہ حاصل نہیں کرتا۔‘‘ اسنادہ ضعیف جذا موضوع،رواہ الدارمی (۱ /۸۲ ح ۲۶۸)۔";
mishkaat.description = `[268] إسنادہ ضعیف جدًا موضوع، رواہ الدارمي (1/ 82 ح 268)<br>٭ فیہ ابن القاسم بن قیس وھو عبد الغفار بن القاسم وکان یضع الحدیث .`;