var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ بن بُحَيْنَةَ قَالَ: احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ بِلَحْيِ جَمَلٍ مِنْ طريقِ مكةَ فِي وسط رَأسه";
mishkaat.urdu = "عبداللہ بن مالک بن بحینہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حالت احرام میں لحی جمل کے مقام (مکہ اور مدینہ کے درمیان ایک مقام) پر اپنے سر کے وسط میں پچھنے لگوائے۔متفق علیہ۔";
mishkaat.description = `[2693] متفق علیہ، رواہ البخاري (5698) و مسلم (88/ 1203)`;