var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: احْتَجَمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ عَلَى ظَهْرِ الْقَدَمِ مِنْ وَجَعٍ كَانَ بِهِ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حالت احرام میں پاؤں کی پشت پر تکلیف کی وجہ سے پچھنے لگوائے۔سندہ ضعیف،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[2694] سندہ ضعیف، رواہ أبو داود (1837) و النسائي (194/5 ح 2852)<br>٭ قتادۃ مدلس و عنعن .`;