var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: خَمْسٌ لَا جُنَاحَ عَلَى من قتلَهُنّ فِي الْحل وَالْإِحْرَامِ: الْفَأْرَةُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْعَقْرَبُ وَالْكَلْبُ الْعَقُورُ";
mishkaat.urdu = "ابن عمر ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’پانچ چیزیں ایسی ہیں جنہیں حرم میں حالت احرام میں قتل کر دینے پر کوئی گناہ نہیں: چوہیا،کوّا،چیل،بچھو اور کاٹنے والا کتا۔‘‘ متفق علیہ۔";
mishkaat.description = `[2698] متفق علیہ، رواہ البخاري (3315) و مسلم (72/ 1199)`;