var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْجَرَادُ مِنْ صَيْدِ الْبَحْرِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ";
mishkaat.urdu = "ابوہریرہ ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ٹڈی (مکڑی) سمندری شکار کے زمرے میں ہے۔‘‘ حسن،رواہ ابوداؤد و الترمذی۔";
mishkaat.description = `[2701] حسن، رواہ أبو داود (1853 وسندہ حسن، 1854 و سندہ ضعیف جدًا، فیہ أبو المھزم: متروک) والترمذي (850 وقال: غریب، وسندہ ضعیف جدًا، فیہ أبو المھزم)`;