var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عَبَّاسٍ قَالَ: قَدْ أُحْصِرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَلَقَ رَأَسَهُ وَجَامَعَ نِسَاءَهُ وَنَحَرَ هَدْيَهُ حَتَّى اعْتَمَرَ عَامًا قَابلا. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عبداللہ بن عباس ؓ بیان کرتے ہیں،(صلح حدیبیہ کے سال) رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو (عمرہ کرنے سے) روک دیا گیا تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنا سر منڈایا،اپنی ازواج مطہرات سے جماع کیا اور قربانی کی،اور پھر اگلے سال عمرہ کیا۔رواہ البخاری۔";
mishkaat.description = `[2707] رواہ البخاري (1809)`;