var mishkaat = {};
mishkaat.arabic = "عَن يَعْلَى بْنِ أُمَيَّةَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «احْتِكَارُ الطَّعَامِ فِي الْحَرَمِ إِلْحَادٌ فِيهِ» . رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "یعلی بن امیہ ؓ بیان کرتے ہیں کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’حرم میں ذخیرہ اندوزی کرنا الحاد ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[2723] إسنادہ ضعیف، رواہ أبو داود (2020)<br>٭ فیہ موسی بن جابان: مجھول، و جعفر و عمارۃ: مستوران .`;