var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَصْبِرُ عَلَى لَأْوَاءِ الْمَدِينَةِ وَشِدَّتِهَا أَحَدٌ مِنْ أُمَّتِي إِلَّا كُنْتُ لَهُ شَفِيعًا يَوْمَ الْقِيَامَةِ» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میری اُمت میں سے جو شخص مدینہ کی بھوک اور اس کی تکلیف پر صبر کرے گا تو روز قیامت میں اس کی سفارش کروں گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2730] رواہ مسلم (484 / 1378)`;