var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَنْفِيَ الْمَدِينَةُ شِرَارَهَا كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيد» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قیامت قائم نہیں ہو گی حتی کہ مدینہ بُرے لوگوں کو نکال باہر کرے گا جیسے بھٹی لوہے کی میل کچیل نکال باہر کرتی ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2740] رواہ مسلم (1381/487)`;