var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَأْتِي عَلَى النَّاسِ زَمَانٌ لَا يُبَالِي الْمَرْءُ مَا أَخَذَ مِنْهُ أَمِنَ الْحَلَالِ أم من الْحَرَام» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’لوگوں پر ایک ایسا زمانہ آئے گا کہ آدمی اس بات کی پرواہ نہیں کرے گا کہ وہ حلال طریقے سے کما رہا ہے یا حرام طریقے سے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[2761] رواہ البخاري (2059)`;