var mishkaat = {};
mishkaat.arabic = "وَعَن أبي حجيفة أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الدَّمِ وَثَمَنِ الْكَلْبِ وَكَسْبِ الْبَغِيِّ وَلَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ وَالْمُصَوِّرَ. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوجحیفہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے خون کی قیمت،کتے کی قیمت اور زانیہ کی کمائی سے منع فرمایا،اور سود کھانے والے،کھلانے والے،جسم گوندنے والی اور گدوانے والی اور مصور پر لعنت فرمائی۔رواہ البخاری۔";
mishkaat.description = `[2765] رواہ البخاري (5962)`;