var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: حَجَمَ أَبُو طَيْبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُمِرَ لَهُ بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ أَهْلَهُ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خراجه";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،ابوطیبہ نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو پچھنے لگائے تو آپ نے اسے ایک صاع (تقریباً اڑھائی کلو) کھجوریں دینے اور اس کے مالکوں کو اس کے خزاج میں تخفیف کرنے کا حکم فرمایا۔متفق علیہ۔";
mishkaat.description = `[2769] متفق علیہ، رواہ البخاري (2102) و مسلم (1577/62)`;