var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وكسْبِ الزَّمارةِ. رَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے کتے کی قیمت اور گانے والی (گلوکارہ یا زانیہ) کی کمائی سے منع فرمایا ہے۔اسنادہ ضعیف،رواہ البغوی فی شرح السنہ۔";
mishkaat.description = `[2779] إسنادہ ضعیف، رواہ البغوي في شرح السنۃ (23/8 ح 2038) [والبیھقي 126/6]<br>٭ ہشام بن حسان مدلس و عنعن .`;