var mishkaat = {};
mishkaat.arabic = "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طَلَبُ كَسْبِ الْحَلَالِ فَرِيضَةٌ بَعْدَ الْفَرِيضَةِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان";
mishkaat.urdu = "عبداللہ بن مسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’فرائض کے بعد کسب حلال کی تلاش بھی فرض ہے۔‘‘ اسنادہ ضعیف جذا،رواہ البیھقی فی شعب الایمان۔";
mishkaat.description = `[2781] إسنادہ ضعیف جدًا، رواہ البیھقي في شعب الإیمان (8741) [والطبراني فی الکبیر (90/10 ح 9993)]<br>٭ فیہ عباد بن کثیر: متروک .`;