var mishkaat = {};
mishkaat.arabic = "وَعَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ أَيُّ الْكَسْبِ أَطْيَبُ؟ قَالَ: «عَمَلُ الرَّجُلِ بِيَدِهِ وَكُلُّ بَيْعٍ مَبْرُورٍ» . رَوَاهُ أَحْمَدُ";
mishkaat.urdu = "رافع بن خدیج ؓ بیان کرتے ہیں،عرض کیا گیا،اللہ کے رسول! کون سا کسب سب سے پاکیزہ ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آدمی کا اپنے ہاتھ سے کام کرنا اور ہر اچھی تجارت۔‘‘ ضعیف،رواہ احمد۔";
mishkaat.description = `[2783] ضعیف، رواہ أحمد (141/4 ح 17397نسخۃ محققۃ)<br>٭ المسعودي اختلط و للحدیث شواھد ضعیفۃ عند الحاکم (10/2) والطبراني (الأوسط: 2161) وغیرہما .`;