var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَجُلٌ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أُخْدَعُ فِي الْبُيُوعِ فَقَالَ: إِذَا بَايَعْتَ فَقُلْ: لَا خلابة فَكَانَ الرجل يَقُوله";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،ایک آدمی نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے فرمایا: بیع میں میرے ساتھ دھوکہ ہو جاتا ہے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم بیع کرو تو کہا کرو: دھوکہ فریب نہیں چلے گا۔‘‘ وہ آدمی یہ الفاظ کہا کرتا تھا۔متفق علیہ۔";
mishkaat.description = `[2803] متفق علیہ، رواہ البخاري (2117) ومسلم (1533/48)`;