var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم خيَّرَ أعرابيَّاً بَعْدَ الْبَيْعِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيب";
mishkaat.urdu = "جابر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایک اعرابی کو بیع کے بعد اختیار دیا۔ترمذی،اور فرمایا: یہ حدیث صحیح غریب ہے۔سندہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[2806] سندہ ضعیف، رواہ الترمذي (1249) [وصححہ الحاکم علی شرط مسلم (49/2) و وافقہ الذہبي]<br>٭ أبو الزبیر مدلس و عنعن و للحدیث شواھد ضعیفۃ .`;