var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: لَعَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ الرِّبَا وَمُوَكِلَهُ وَكَاتِبَهُ وَشَاهِدَيْهِ وَقَالَ: «هُمْ سَوَاءٌ» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے سود کھانے والے،کھلانے والے،لکھنے والے اور اس کی گواہی دینے والوں پر لعنت فرمائی،اور فرمایا:’’(گناہ میں) وہ سب برابر ہیں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2807] رواہ مسلم (1598/106)`;