var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ";
mishkaat.urdu = "سمرہ بن جندب ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حیوان کے بدلے حیوان کی ادھار بیع سے منع فرمایا۔صحیح،رواہ الترمذی و ابوداؤد و النسائی و ابن ماجہ و الدارمی۔";
mishkaat.description = `[2822] صحیح، رواہ الترمذي (1237 وقال: حسن صحیح) و أبو داود (3356) والنسائي (292/7 ح 4624) و ابن ماجہ (2270) والدارمي (254/2 ح 2567)`;