var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَقْرَضَ الرَّجُلُ الرَّجُلَ فَلَا يَأْخُذُ هَدِيَّةً» . رَوَاهُ الْبُخَارِيُّ فِي تَارِيخِهِ هَكَذَا فِي الْمُنْتَقى";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب آدمی،آدمی کو قرض دے تو پھر وہ ہدیہ قبول نہ کرے۔‘‘ امام بخاری نے اسے تاریخ میں روایت کیا،اور المنتقی میں بھی اسی طرح ہے۔لم اجدہ،رواہ البخاری فی تاریخہ۔";
mishkaat.description = `[2832] لم أجدہ، رواہ البخاري في تاریخہ (لم أجدہ و لعلہ لا أصل لہ) و ذکرہ في منتقی الأخبار (2970)`;