var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَالْمُعَاوَمَةِ وَعَنِ الثُّنْيَا وَرَخَّصَ فِي الْعَرَايَا. رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے محاقلہ،مزابنہ،مخابرہ،باغ کو کئی سال پر ٹھیکے پر دینے اور استثنا سے منع کیا ہے،البتہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اندازہ لگانے کی اجازت فرمائی۔رواہ مسلم۔";
mishkaat.description = `[2836] رواہ مسلم (1536/85)`;