var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا مِنَ التَّمْرِ فِيمَا دُونَ خَمْسَة أوسق أَو خَمْسَة أوسق شكّ دَاوُد ابْن الْحصين";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے پانچ وسق یا اس سے کم خشک کھجور کے اندازہ سے تازہ کھجوروں کو بیچنے کی اجازت فرمائی۔‘‘ داؤد بن حصین راوی کو پانچ یا پانچ سے کم میں شک ہوا۔متفق علیہ۔";
mishkaat.description = `[2838] متفق علیہ، رواہ البخاري (2190) و مسلم (1541/71)`;