var mishkaat = {};
mishkaat.arabic = "عَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ خَرَجَتْ خَطَايَاهُ مِنْ جَسَدِهِ حَتَّى تخرج من تَحت أَظْفَاره»";
mishkaat.urdu = "عثمان ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص وضو کرے اور خوب اچھی طرح وضو کرے تو اس کی خطائیں اس کے جسم سے نکل جاتی ہیں،حتیٰ کہ اس کے ناخنوں کے نیچے سے بھی نکل جاتی ہیں۔‘‘ متفق علیہ،رواہ البخاری (لم اجدہ) و مسلم۔";
mishkaat.description = `[284] متفق علیہ، رواہ البخاري (لم أجدہ) و مسلم (33/ 245)`;