var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: أَمَّا الَّذِي نَهَى عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُوَ الطَّعَامُ أَنْ يُبَاعَ حَتَّى يُقْبَضَ. قَالَ ابْنُ عَبَّاسٍ: وَلَا أَحْسِبُ كُلَّ شَيْءٍ إِلاَّ مثلَه";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رہی وہ چیز جس سے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے منع فرمایا ہے کہ اسے فروخت نہ کیا جائے حتی کہ اس پر قبضہ کر لیا جائے تو وہ اناج ہے،اور ابن عباس ؓ نے فرمایا: جبکہ میرا ہر چیز کے بارے میں یہی خیال ہے۔متفق علیہ۔";
mishkaat.description = `[2846] متفق علیہ، رواہ البخاري (2135) و مسلم (1525/29)`;