var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَلَقَّوُا الْجَلَبَ فَمَنْ تَلَقَّاهُ فَاشْتَرَى مِنْهُ فَإِذَا أَتَى سَيِّدُهُ السُّوقَ فَهُوَ بالخَيارِ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم اناج لانے والوں کو راستے میں جا کر نہ ملو،جو شخص اسے ملے اور اس سے غلہ خرید لے،پھر اس کا مالک بازار آ جائے تو اسے اختیار حاصل ہے۔‘‘ (چاہے تو سودا رہنے دے اور چاہے تو فسخ کر دے) رواہ مسلم۔";
mishkaat.description = `[2848] رواہ مسلم (1519/17)`;