var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَبِعِ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا يَخْطِبْ عَلَى خِطْبَةِ أَخِيهِ إِلَّا أنْ يأذَنَ لَهُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آدمی اپنے بھائی کی بیع پر بیع کرے نہ اپنے بھائی کے پیغامِ نکاح پر پیغامِ نکاح بھیجے مگر یہ کہ وہ اسے اجازت دے دے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2850] رواہ مسلم (1412/50)`;