var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يبِعْ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ من بعض» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کوئی شہری،کسی دیہاتی کا مال فروخت نہ کرے،لوگوں کو (اپنے حال پر) چھوڑ دو،اللہ تعالیٰ بعض کے ذریعے بعض کو رزق فراہم کرتا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2852] رواہ مسلم (1522/20)`;