var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْعُرْبَانِ. رَوَاهُ مَالِكٌ وَأَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے بیعانہ لے کر بیع کرنے سے منع فرمایا۔اسنادہ حسن،رواہ امالک و ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[2864] إسنادہ حسن، رواہ مالک (609/2 ح 1331) و أبو داود (3502) و ابن ماجہ (2192۔ 2193)`;