var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن بيْعِ المضطرِّ وعنْ بيْعِ الغَرَرِ وَعَنْ بَيْعِ الثَّمَرَةِ قَبْلَ أَنْ تُدْرِكَ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "علی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجبورو بے بس شخص کی بیع سے،دھوکے کی بیع سے اور پھلوں کی بیع سے اس سے پہلے کہ وہ پک جائیں منع فرمایا ہے۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[2865] إسنادہ ضعیف، رواہ أبو داود (3382)<br>٭ شیخ من بني تمیم: مجھول، کما قال الخطابي وغیرہ والحدیث ضعفہ البغوي .`;