var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ فِي بيعةٍ. رَوَاهُ مَالك وَالتِّرْمِذِيّ وَالنَّسَائِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایک بیع میں دو بیع سے منع فرمایا۔اسنادہ حسن،رواہ مالک و الترمذی و ابوداؤد و النسائی۔";
mishkaat.description = `[2868] إسنادہ حسن، رواہ مالک (663/2 ح 1404) والترمذي (1231 وقال: حسن صحیح) و أبو داود (3461) والنسائي (296/7۔ 297 ح 4636)`;