var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ فِي صَفْقَةٍ وَاحِدَةٍ. رَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایک ہی مرتبہ دو بیع سے منع فرمایا۔اسنادہ حسن،رواہ البغوی فی شرح السنہ۔";
mishkaat.description = `[2869] إسنادہ حسن، رواہ البغوي في شرح السنۃ (144/8 ح 2112) [والبیھقي 343/5] و انظر الحدیث الآتي:2870`;