var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمِكْيَالُ مِكْيَالُ أَهْلِ الْمَدِينَةِ وَالْمِيزَانُ مِيزَانُ أَهْلِ مَكَّةَ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ناپ اہل مدینہ کا معتبر ہے جبکہ وزن اہل مکہ کا معتبر ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[2889] إسنادہ ضعیف، رواہ أبو داود (3340) و النسائي (54/5 ح 2521، 4598)<br>٭ سفیان الثوري مدلس و عنعن و تابعہ المدلس الو لید بن مسلم و عنعن .`;