var mishkaat = {};
mishkaat.arabic = "عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْجَالِبُ مَرْزُوقٌ والمحتكر مَلْعُون» . رَوَاهُ ابْن مَاجَه والدارمي";
mishkaat.urdu = "عمر ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’(بازار میں) غلہ لانے والوں کو رزق دیا جاتا ہے،جبکہ ذخیرہ اندوز ملعون ہے۔‘‘ اسنادہ ضعیف،رواہ ابن ماجہ و الدارمی۔";
mishkaat.description = `[2893] إسنادہ ضعیف، رواہ ابن ماجہ (2153) والدارمي (249/2 ح 2548)<br>٭ علي بن سالم: ضعیف و علي بن زید بن جدعان ضعیف مشھور .`;