var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا رَجُلٍ أَفْلَسَ فَأَدْرَكَ رَجُلٌ مَالَهُ بِعَيْنِهِ فَهُوَ أَحَق بِهِ من غَيره»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص مفلس ہو جائے اور کوئی آدمی اپنا مال بالکل اسی صورت میں پا لے تو یہ (مال والا) شخص دوسروں کی نسبت اس مال کا زیادہ حق دار ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2899] متفق علیہ، رواہ البخاري (2402) و مسلم (1559/22)`;