var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَرَّهُ أَنْ يُنْجِيَهُ اللَّهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ فَلْيُنَفِّسْ عَنْ مُعْسِرٍ أَوْ يَضَعْ عَنْهُ» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابوقتادہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص کو یہ پسند ہو کہ اللہ اسے روزِ قیامت کی تکلیفوں سے نجات دے دے تو وہ تنگدست کو مہلت دے یا اسے (قرض) معاف کر دے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2902] رواہ مسلم (1563/32)`;