var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَنْظَرَ مُعْسِرًا أَوْ وَضَعَ عَنْهُ أَنْجَاهُ اللَّهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَة» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوقتادہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جو شخص کسی تنگدست کو مہلت دے یا اسے قرض معاف کر دے تو اللہ اسے روزِ قیامت کی تکلیفوں سے نجات دے دے گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2903] رواہ مسلم (1563/32)`;