var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَطْلُ الْغَنِيِّ ظُلْمٌ فَإِذَا أُتْبِعَ أحدكُم على مَلِيء فَليتبعْ»";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مال دار شخص کا (قرض کی ادائیگی میں) ٹال مٹول کرنا ظلم ہے،اگر تم میں سے کسی کو کسی مال دار شخص (یعنی ضامن) کے پیچھے لگا دیا جائے (کہ اس سے قرض وصول کر لو) تو لگ جانا چاہیے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2907] متفق علیہ، رواہ البخاري (2287) و مسلم (1564/33)`;