var mishkaat = {};
mishkaat.arabic = "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَهُوَ بَرِيءٌ مِنَ الْكِبْرِ وَالْغُلُولِ وَالدَّيْنِ دَخَلَ الْجَنَّةَ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَه والدارمي";
mishkaat.urdu = "ثوبان ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص اس حال میں فوت ہو کہ وہ کبر و خیانت اور قرض سے بَری ہو تو وہ جنت میں داخل ہو گا۔‘‘ صحیح،رواہ الترمذی و ابن ماجہ و الدارمی۔";
mishkaat.description = `[2921] صحیح، رواہ الترمذي (1572) و ابن ماجہ (2412) والدارمي (262/2 ح 2595)<br>٭ و للحدیث شواھد .`;