var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَوَضَّأَ عَلَى طُهْرٍ كُتِبَ لَهُ عَشْرُ حَسَنَاتٍ» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص وضو ہونے کے باوجود وضو کرے تو اس کے لیے دس نیکیاں لکھی جاتی ہیں۔‘‘ اسنادہ ضعیف،رواہ الترمذی ۵۹) و ابوداؤد (۶۲)۔";
mishkaat.description = `[293] إسنادہ ضعیف، رواہ الترمذي (59 وقال: إسنادہ ضعیف) [و أبو داود: 62]<br>٭ عبد الرحمٰن بن زیاد الإفریقي ضعیف (تقدم: 239)`;