var mishkaat = {};
mishkaat.arabic = "عَن سعيد بْنِ زَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَخَذَ شِبْرًا مِنَ الْأَرْضِ ظُلْمًا فَإِنَّهُ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ مِنْ سبع أَرضين»";
mishkaat.urdu = "سعید بن زید ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص ظلم سے بالشت برابر زمین حاصل کرتا ہے تو روزِ قیامت سات زمینوں کا طوق اس کے گلے میں ڈالا جائے گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[2938] متفق علیہ، رواہ البخاري (3198) و مسلم (1610/140)`;