var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِفْتَاحُ الْجَنَّةِ الصَّلَاةُ وَمِفْتَاحُ الصَّلَاة الطّهُور» . رَوَاهُ أَحْمد";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جنت کی چابی نماز ہے اور نماز کی چابی طہارت (وضو) ہے۔‘‘ سندہ ضعیف،(۳ /۳۴۰ ح ۱۴۷۱۷) و الترمذی (۴)۔";
mishkaat.description = `[294] سندہ ضعیف، رواہ أحمد (3/ 340 ح 14717) [والترمذي (4)]<br>٭ سلیمان بن قرم ھو سلیمان بن معاذ ضعیف وأبو یحیی القتات لین الحدیث .`;