var mishkaat = {};
mishkaat.arabic = "وَعَن عمرَان ابْن حُصَيْنٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «لَا جَلَبَ وَلَا جَنَبَ وَلَا شِغَارَ فِي الْإِسْلَامِ وَمَنِ انْتَهَبَ نُهْبَةً فَلَيْسَ مِنَّا» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عمران بن حصین ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں کہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اسلام میں جلب،جنب اور شغار نہیں اور جو شخص کوئی لوٹ مار کرے تو وہ ہم میں سے نہیں۔‘‘ صحیح،رواہ الترمذی۔";
mishkaat.description = `[2947] صحیح، رواہ الترمذي (1123 وقال: حسن صحیح)`;