var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَلَى الْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "سمرہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ہاتھ پر واجب ہے کہ اس نے جو لیا ہے وہ واپس کرے۔‘‘ اسنادہ ضعیف،رواہ الترمذی و ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[2950] إسنادہ ضعیف، رواہ الترمذي (1266 وقال: حسن صحیح) رواہ أبو داود (3561) و ابن ماجہ (2400)<br>٭ قتادۃ مدلس و عنعن .`;