var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الرجل جَبَّار وَالنَّار جَبَّار» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’(جانور کے) پاؤں سے ہونے والا نقصان ضائع ہے (اس کا کوئی معاوضہ نہیں)۔‘‘ اور فرمایا:’’آگ (کسی نے اپنی جگہ میں آگ جلائی،اور پھر آندھی اس آگ کو اڑا کر کسی اور جگہ لے گئی اور وہاں آگ لگ گئی تو اس) کا نقصان ہے۔‘‘ اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[2952] إسنادہ صحیح، رواہ أبو داود (4594) و أعل بما لا یقدح .`;