var mishkaat = {};
mishkaat.arabic = "عَن سَالم عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَخَذَ مِنَ الْأَرْضِ شَيْئًا بِغَيْرِ حَقِّهِ خُسِفَ بِهِ يَوْمَ الْقِيَامَةِ إِلَى سبع أَرضين» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "سالم اپنے والد سے روایت کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص تھوڑی سی بھی زمین ناحق وصول کرے گا تو روزِ قیامت اسے سات زمینوں تک دھنسا دیا جائے گا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[2958] رواہ البخاري (3196)`;