var mishkaat = {};
mishkaat.arabic = "وَعَن يعلى بن مرّة قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَخَذَ أَرْضًا بِغَيْرِ حَقِّهَا كُلِّفَ أَنْ يَحْمِلَ تُرَابَهَا الْمَحْشَرَ» . رَوَاهُ أَحْمَدُ";
mishkaat.urdu = "یعلی بن مُرّہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جو شخص ناحق کچھ زمین حاصل کرتا ہے تو اسے حکم دیا جائے گا کہ وہ حشر کے میدان میں اس کی مٹی اٹھائے رکھے۔‘‘ اسنادہ حسن،رواہ احمد۔";
mishkaat.description = `[2959] إسنادہ حسن، رواہ أحمد 172/4، 173 ح 17701) [و عبد بن حمید: 406]`;