var mishkaat = {};
mishkaat.arabic = "وَعنهُ قَالَ: كُنَّا نخبر وَلَا نَرَى بِذَلِكَ بَأْسًا حَتَّى زَعَمَ رَافِعُ ابْن خَدِيجٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فَتَرَكْنَاهَا مِنْ أَجْلِ ذَلِكَ. رَوَاهُ مُسلم";
mishkaat.urdu = "عبداللہ بن عمر ؓ بیان کرتے ہیں،ہم مخابرت کیا کرتے تھے اور ہم اس میں کوئی حرج محسوس نہیں کرتے تھے،حتی کہ رافع بن خدیج ؓ نے کہا کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اسے منع فرمایا ہے۔لہذا ہم نے اس وجہ سے ترک کر دیا۔رواہ مسلم۔";
mishkaat.description = `[2973] رواہ مسلم (1547/106)`;