var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أرضه»";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص کی زمین ہو تو وہ اسے کاشت کرے یا بطور احسان اسے اپنے بھائی کو دے دے،اگر ایسا نہیں کر سکتا تو وہ اپنی زمین اپنے پاس رکھے۔‘‘ متفق علیہ۔";
mishkaat.description = `[2977] متفق علیہ، رواہ البخاري (2340) و مسلم (1536/96)`;