var mishkaat = {};
mishkaat.arabic = "عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ: زَعَمَ ثَابِتُ بْنُ الضَّحَّاكِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْمُزَارَعَةِ وَأَمَرَ بِالْمُؤَاجَرَةِ وَقَالَ: «لَا بَأْسَ بِهَا» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "عبداللہ بن مغفل ؓ بیان کرتے ہیں،ثابت بن ضحاک نے کہا کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مزارعت سے منع فرمایا اور مؤاجرت (ٹھیکے) پر کام کرنے کا حکم فرمایا،اور فرمایا:’’اس میں کوئی حرج نہیں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[2981] رواہ مسلم (119/ 1549)`;