var mishkaat = {};
mishkaat.arabic = "عَنِ الْحَسَنِ عَنْ سَمُرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَحَاطَ حَائِطًا عَلَى الْأَرْضِ فَهُوَ لَهُ» . رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "حسن ؒ سمرہ ؓ سے اور وہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص کسی (بنجر) زمین پر چار دیواری کر لے تو وہ قطعہ زمین اس کا ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[2996] إسنادہ ضعیف، رواہ أبو داود (3077)<br>٭ قتادۃ مدلس و عنعن .`;