var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحَبَّ لِلَّهِ وَأَبْغَضَ لِلَّهِ وَأَعْطَى لِلَّهِ وَمَنَعَ لِلَّهِ فَقَدِ اسْتكْمل الْإِيمَان» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوامامہؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے اللہ کے لیے محبت کی،اللہ کی خاطر بغض رکھا،اللہ کی رضا کی خاطر عطا کیا اور اللہ کے لیے روک لیا تو اس نے ایمان مکمل کر لیا۔‘‘ اسنادہ حسن،رواہ ابوداود (۴۶۸۱)۔";
mishkaat.description = `[30] إسنادہ حسن، رواہ أبو داود (4681)`;