var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْمُسْلِمُونَ شُرَكَاءُ فِي ثَلَاث: الْمَاءِ وَالْكَلَأِ وَالنَّارِ . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مسلمان تین چیزوں: پانی،گھاس اور آگ میں،حصہ دار ہیں۔‘‘ صحیح،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3001] صحیح، رواہ أبو داود (3477 وسندہ صحیح) و ابن ماجہ (2472 وسندہ ضعیف جدًا)`;