var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا ترقبوا أَو لَا تُعْمِرُوا فَمَنْ أُرْقِبَ شَيْئًا أَوْ أُعْمِرَ فَهِيَ لوَرثَته» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم رقبیٰ کے طور پر کوئی چیز دو نہ عمریٰ کے طور پر،جس شخص کو رقبیٰ کے طور پر کوئی چیز دی گئی یا عمریٰ کے طور پر تو وہ اس کے وارثوں کی ہے۔‘‘ اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[3013] إسنادہ صحیح، رواہ أبو داود (3556)`;