var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمْسِكُوا أَمْوَالَكُمْ عَلَيْكُمْ لَا تُفْسِدُوهَا فَإِنَّهُ مَنْ أَعْمَرَ عُمْرَى فَهِيَ لِلَّذِي أعمر حَيا وَمَيتًا ولعقبه» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اپنے اموال کی حفاظت کرو اور انہیں خراب نہ کرو،کیونکہ جس شخص نے عمریٰ دیا تو وہ اسی شخص کا ہے جس کو عمریٰ دیا گیا اس کی زندگی میں بھی،اس کے مرنے کے بعد بھی اور اس کے ورثا کا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3015] رواہ مسلم (1625/26)`;