var mishkaat = {};
mishkaat.arabic = "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَرْجِعُ أَحَدٌ فِي هِبَتِهِ إِلَّا الْوَالِدُ مِنْ وَلَده» . رَوَاهُ النَّسَائِيّ وَابْن مَاجَه";
mishkaat.urdu = "عبداللہ بن عمرو ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کوئی شخص ہبہ کر کے واپس نہیں لے سکتا،البتہ والدین اپنی اولاد کو کوئی چیز ہبہ کر کے واپس لے سکتے ہیں۔‘‘ صحیح،رواہ النسائی و ابن ماجہ۔";
mishkaat.description = `[3020] صحیح، رواہ النسائي (264/6 ح 3719) و ابن ماجہ (2378)`;