var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَهَادُوا فَإِنَّ الْهَدِيَّةَ تُذْهِبُ الضَّغَائِنَ» . رَوَاهُ";
mishkaat.urdu = "عائشہ ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتی ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’باہم تحائف دیا کرو،کیونکہ تحفہ عداوت دور کر دیتا ہے۔‘‘ اسنادہ موضوع۔";
mishkaat.description = `[3027] إسنادہ موضوع، [رواہ القضاعي في مسند الشھاب (383/1 ح 660) و فیہ أبو یوسف یعقوب بن محمد بن عبید الکوفي الأعشي: کذاب رجل سوء، و فی السند علل أخری .]`;