var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثٌ لَا تُرَدُّ الْوَسَائِدُ وَالدُّهْنُ وَاللَّبَنُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ قِيلَ: أَرَادَ بالدهن الطّيب";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تین چیزیں واپس نہیں کی جانی چاہییں،تکیہ،تیل اور دودھ۔ترمذی اور فرمایا: یہ حدیث غریب ہے۔کہا گیا کہ تیل سے خوشبو مراد ہے۔اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[3029] إسنادہ حسن، رواہ الترمذي (2790)`;