var mishkaat = {};
mishkaat.arabic = "وَعَن أَبِي عُثْمَانَ النَّهْدَيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أعْطى أحدكُم الرَّيْحَانَ فَلَا يَرُدُّهُ فَإِنَّهُ خَرَجَ مِنَ الْجَنَّةِ» . رَوَاهُ التِّرْمِذِيّ مُرْسلا";
mishkaat.urdu = "ابوعثمان نہدی ؒ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کسی شخص کو خوشبو پیش کی جائے تو وہ اسے واپس نہ کرے،کیونکہ وہ جنت سے آئی ہے۔‘‘ ترمذی،روایت مرسل ہے۔اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[3030] إسنادہ ضعیف، رواہ الترمذي (2791)<br>٭ السند مرسل و فیہ علل أخری .`;