var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْجَارُودِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جارود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مسلمان کی گم شدہ چیز (اگر وہ اعلان کیے بغیر اٹھا لی جائے تو وہ) آگ کا شعلہ ہے۔‘‘ صحیح،رواہ الدارمی۔";
mishkaat.description = `[3038] صحیح، رواہ الدارمي (266/2 ح 2604، نسخۃ محققۃ: 2643 وسندہ حسن لذاتہ) [و أحمد (80/5) و النسائي فی الکبری(5792)]<br>٭ و للحدیث طرق کثیرۃ .`;