var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصَى فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلَّا وَوَصِيَّة مَكْتُوبَة عِنْده»";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو مسلمان وصیت کرنا چاہتا ہے اس کے لیے مناسب نہیں کہ وہ دو راتیں بھی یوں گزار دے کہ وصیت اس کے پاس لکھی ہوئی نہ ہو۔‘‘ متفق علیہ۔";
mishkaat.description = `[3070] متفق علیہ، رواہ البخاري (2738) و مسلم (1637/1)`;