var mishkaat = {};
mishkaat.arabic = "] وَرَوَاهُ الْبَيْهَقِيُّ فِي\nشُعَبِ الْإِيمَانِ\nعَنْ أَبِي هُرَيْرَة رَضِي الله عَنهُ";
mishkaat.urdu = "امام بیہقی نے اسے شعب الایمان میں ابوہریرہ ؓ کی سند سے روایت کیا ہے۔لم اجدہ،رواہ البیھقی فی شعب الایمان۔";
mishkaat.description = `[3079] لم أجدہ، رواہ البیھقي في شعب الإیمان: لم أجدہ و لعلہ یشیر إلی حدیث: ’’من قطع میراثًا فرضہ اللہ و رسولہ قطع اللہ میراثًا من الجنۃ‘‘ رواہ البیھقي في شعب الإیمان (نسخۃ محققۃ: 7594) و سندہ ضعیف فیہ سلم بن سلیمان شیخ بالبصرۃ و لم أجد من وثقہ .`;