var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ نسَاء ركبن الْإِبِل صَالح نسَاء قُرَيْش أَحْنَاهُ عَلَى وَلَدٍ فِي صِغَرِهِ وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اونٹوں پر سوار ہونے والی (عرب) عورتوں میں سے،قریش کی صالحہ خواتین بہتر ہیں۔وہ اپنے چھوٹے بچوں پر نہایت شفیق اور شوہر کے مال کی انتہائی محافظ ہوتی ہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[3084] متفق علیہ، رواہ البخاري (5082) ومسلم (202 / 2527)`;