var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الشُّؤْمُ فِي الْمَرْأَةِ وَالدَّارِ وَالْفَرَسِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: الشُّؤْمُ فِي ثَلَاثَة: فِي الْمَرْأَة والمسكن وَالدَّابَّة";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عورت،گھر اور گھوڑے میں نحوست (یعنی بے برکتی) ہے۔‘‘ بخاری،مسلم۔اور ایک روایت میں ہے:’’تین چیزوں میں نحوست ہے عورت،گھر اور جانور۔‘‘ متفق علیہ۔";
mishkaat.description = `[3087] متفق علیہ، رواہ البخاري (5093) و مسلم (2225/115)`;