var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ فَتَنْعَتُهَا لِزَوْجِهَا كَأَنَّهُ ينظر إِلَيْهَا»";
mishkaat.urdu = "ابن مسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عورت،عورت کے ساتھ جسم نہ ملائے،پھر وہ اس کے متعلق اپنے خاوند سے بیان کرے گویا کہ وہ اسے دیکھ رہا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3099] متفق علیہ، رواہ البخاري (5240۔ 5241) و مسلم (لم أجدہ)`;