var mishkaat = {};
mishkaat.arabic = "رَوَاهُ التِّرْمِذِيُّ عَنْ مُعَاذِ بْنِ أَنَسٍ مَعَ تَقْدِيمٍ وَتَأْخِير وَفِيه: «فقد اسْتكْمل إيمَانه»";
mishkaat.urdu = "اور امام ترمذی ؒ نے معاذ بن انس ؓ سے الفاظ کی تقدیم و تاخیر کے ساتھ اسے یوں روایت کیا ہے:’’اس شخص نے اپنا ایمان مکمل کر لیا۔‘‘ اسنادہ حسن،رواہ الترمذی (۲۵۲۱) و صحیحہ الحاکم علیٰ شرط الشیخین (۲/ ۱۶۴)۔";
mishkaat.description = `[31] إسنادہ حسن، رواہ الترمذي (2521 وقال: ھذا حدیث منکر) [و صححہ الحاکم علٰی شرط الشیخین (2/ 164) ووافقہ الذہبي . الصواب أنہ حسن، خلافًا لمن أعلہ .]`;