var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا وُضُوءَ إِلَّا مِنْ صَوْتٍ أَوْ رِيحٍ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آواز یا بدبو (محسوس ہونے) کی صورت میں وضو واجب ہوتا ہے۔‘‘ صحیح،رواہ احمد (۲ /۴۱ ح ۹۳۰۱) و الترمذی (۷۴) و ابن ماجہ (۵۱۵)۔";
mishkaat.description = `[310] إسنادہ صحیح، رواہ أحمد (2/ 41 ح 9301) والترمذي (74 وقال: حسن صحیح .) [و ابن ماجہ: 515]`;