var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا خَطَبَ أَحَدُكُمُ الْمَرْأَةَ فَإِنِ اسْتَطَاعَ أَنْ يَنْظُرَ إِلَى مَا يَدْعُوهُ إِلَى نِكَاحهَا فَلْيفْعَل» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی عورت کو پیغامِ نکاح بھیجے تو پھر اگر وہ اس سے داعیہ نکاح (عورت کی شکل و صورت وغیرہ) کو دیکھ سکے تو دیکھ لے۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[3106] إسنادہ حسن، رواہ أبو داود (2082)`;