var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمَرْأَةُ عَوْرَةٌ فَإِذَا خَرَجَتِ اسْتَشْرَفَهَا الشَّيْطَانُ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن مسعود ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عورت پردہ ہے،جب وہ (بے پردہ) نکلتی ہے تو شیطان اسے مزین کر کے دکھاتا ہے۔‘‘ سندہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[3109] سندہ ضعیف، رواہ الترمذي (1173 و قال: حسن صحیح غریب)<br>٭ قتادۃ مدلس و عنعن .`;