var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَخْلُوَنَّ رَجُلٌ بِامْرَأَةٍ إِلَّا كَانَ ثالثهما الشَّيْطَان» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عمر ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب کوئی آدمی کسی (اجنبی) عورت کے ساتھ علیحدگی میں ہوتا ہے تو ان دونوں کا تیسرا شیطان ہوتا ہے۔‘‘ اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[3118] إسنادہ صحیح، رواہ الترمذي (1171، 2169 وقال: حسن صحیح)`;