var mishkaat = {};
mishkaat.arabic = "عَن أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا نِكَاحَ إِلَّا بِوَلِيٍّ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ";
mishkaat.urdu = "ابوموسی ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ولی کے بغیر نکاح نہیں۔‘‘ صحیح،رواہ احمد و الترمذی و ابوداؤد و ابن ماجہ و الدارمی۔";
mishkaat.description = `[3130] صحیح، رواہ أحمد (394/4 ح 19747) و الترمذي (1101) و أبو داود (2085) و ابن ماجہ (1881) والدارمي (137/1 ح 2188۔ 2189)`;