var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَغَايَا اللَّاتِي يُنْكِحْنَ أَنْفُسَهُنَّ بِغَيْرِ بَيِّنَةٍ» . وَالْأَصَحُّ أَنَّهُ مَوْقُوفٌ عَلَى ابْنِ عَبَّاس. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’زانیہ وہ ہیں جو گواہ کے بغیر اپنا نکاح کریں۔‘‘ درست بات یہ ہے کہ یہ ابن عباس ؓ کا قول ہے۔اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[3132] إسنادہ ضعیف، رواہ الترمذي (1103)<br>٭ سعید بن أبي عروبۃ و قتادۃ مدلسان و عنعنا .`;