var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «لَا تزوج الْمَرْأَة الْمَرْأَةَ وَلَا تُزَوِّجُ الْمَرْأَةُ نَفْسَهَا فَإِنَّ الزَّانِيَةَ هِيَ الَّتِي تُزَوِّجُ نَفْسَهَا» . رَوَاهُ ابْنُ مَاجَهْ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کوئی عورت دوسری عورت کا نکاح نہ کرائے اور نہ کوئی عورت خود اپنا نکاح کرائے کیونکہ وہ زانیہ ہے جو اپنا نکاح خود کرتی ہے۔‘‘ صحیح،رواہ ابن ماجہ۔";
mishkaat.description = `[3137] صحیح، رواہ ابن ماجہ (1882)`;