var mishkaat = {};
mishkaat.arabic = "وَعَن عَائِشَة رَضِي الله عَنهُ قَالَتْ: زُفَّتِ امْرَأَةٌ إِلَى رَجُلٍ مِنَ الْأَنْصَارِ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا كَانَ مَعَكُمْ لَهْوٌ؟ فَإِنَّ الْأَنْصَارَ يُعْجِبُهُمُ اللَّهْو» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،ایک عورت کی ایک انصاری صحابی کے ساتھ رخصتی ہوئی تو نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کیا تمہارے پاس کھیل کود کا سامان نہیں تھا؟ کیونکہ انصار کو دف اور اشعار کہنا اچھا لگتا ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[3141] رواہ البخاري (5162)`;