var mishkaat = {};
mishkaat.arabic = "وَعَنْهَا قَالَتْ: تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَوَّالٍ وَبَنَى بِي فِي شَوَّالٍ فَأَيُّ نِسَاءِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَحْظَى عِنْدَهُ مِنِّي؟ . رَوَاهُ مُسلم";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے شوال میں مجھ سے شادی کی اور شوال میں مجھے اپنے گھر لائے اور رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی ازواج مطہرات میں سے کون سی وہ بیوی ہے جسے آپ کے ہاں مجھ سے اہم مقام حاصل تھا؟ رواہ مسلم۔";
mishkaat.description = `[3142] رواہ مسلم (1423/73)`;