var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسْأَلِ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا وَلِتَنْكِحَ فَإِنَّ لَهَا مَا قُدِّرَ لَهَا»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عورت اپنی (مسلمان) بہن کی طلاق کا مطالبہ نہ کرے تاکہ اسے اس کا رزق بھی مل جائے اسے چاہیے کہ وہ اس مرد سے خود شادی کر لے،حالانکہ جو اس کے مقدر میں ہے وہ اسے مل جائے گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[3145] متفق علیہ، رواہ البخاري (6601) و مسلم (1413/52)`;