var mishkaat = {};
mishkaat.arabic = "وَعَن مُعَاوِيَة بن أبي سُفْيَان أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: قَالَ: «إِنَّمَا الْعَيْنَانِ وِكَاءُ السَّهِ فَإِذَا نَامَتِ الْعَيْنُ اسْتطْلقَ الوكاء» . رَوَاهُ الدِّرَامِي";
mishkaat.urdu = "معاویہ بن ابی سفیان ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آنکھیں دبر کا تسمہ ہیں،جب آنکھیں سو جاتی ہیں تو تسمہ کھل جاتا ہے۔‘‘ سندہ ضعیف،رواہ الدارمی (۱ /۱۸۴ ح ۷۲۸)۔";
mishkaat.description = `[315] سندہ ضعیف، رواہ الدارمي (1/ 184 ح 728)<br>٭ أبو بکر بن أبي مریم ضعیف و فی السند علۃ أخری .`;