var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ خُطْبَةٍ لَيْسَ فِيهَا تَشَهُّدٌ فَهِيَ كَالْيَدِ الْجَذْمَاءِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ہر وہ خطبہ جس میں تشہد (حمد و ثنا) نہ ہو تو وہ کٹے ہوئے ہاتھ کی طرح ہے۔‘‘ ترمذی،اور انہوں نے فرمایا: یہ حدیث حسن غریب ہے۔صحیح،رواہ الترمذی۔";
mishkaat.description = `[3150] صحیح، رواہ الترمذي (1106)`;