var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ أَمْرٍ ذِي بَالٍ لَا يُبْدَأُ فِيهِ بِالْحَمْدِ لِلَّهِ فَهُوَ أَقْطَعُ» . رَوَاهُ ابْنُ مَاجَهْ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ہر اہم کام جس کا آغاز اللہ کی حمد سے نہ کیا جائے وہ (کام) برکت سے خالی ہے۔‘‘ اسنادہ ضعیف،رواہ ابن ماجہ۔";
mishkaat.description = `[3151] إسنادہ ضعیف، رواہ ابنماجہ (1894) [و أبو داود (4840)]<br>٭ الزھري مدلس و عنعن و قرۃ متکلم فیہ و خالفہ الثقات الجبال الحفاظ فالقول قولھم .`;