var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُجْمَعُ بَيْنَ الْمَرْأَة وعمتها وَلَا بَين الْمَرْأَة وخالتها»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عورت اور اس کی پھوپھی نیز عورت اور اس کی خالہ کو نکاح میں اکٹھا نہ کیا جائے۔‘‘ (یعنی پھوپھی،بھتیجی اور خالہ بھانجی،ایک وقت میں ایک آدمی کی بیویاں نہیں ہو سکتیں) متفق علیہ۔";
mishkaat.description = `[3160] متفق علیہ، رواہ البخاري (5109) و مسلم (1408/33)`;