var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُحَرِّمُ مِنَ الرِّضَاعِ إِلَّا مَا فَتَقَ الْأَمْعَاءَ فِي الثَّدْيِ وَكَانَ قبل الْفِطَام» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ام سلمہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ رضاعت باعث حرمت ہے،جو براہ راست چھاتیوں سے دودھ پی کر (بھوک مٹا کر) انتڑیاں کھول دے،اور یہ (رضاعت) دودھ چھڑانے سے پہلے ہو۔‘‘ صحیح،رواہ الترمذی۔";
mishkaat.description = `[3173] صحیح، رواہ الترمذي (1152 وقال: حسن صحیح)`;