var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ قَالَ: كَانَتِ الْيَهُودُ تَقُولُ: إِذَا أَتَى الرَّجُلُ امْرَأَتَهُ مِنْ دُبُرِهَا فِي قُبُلِهَا كَانَ الْوَلَد أَحول فَنزلت: (نساوكم حرث لكم فَأتوا حَرْثكُمْ أَنى شِئْتُم)";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،یہود کہا کرتے تھے،جب آدمی اپنی بیوی سے اس کی پچھلی جانب سے اس کی اندام نہانی میں جماع کرے تو بچہ بھینگا پیدا ہوتا ہے۔اس پر یہ آیت نازل ہوئی:’’تمہاری عورتیں تمہاری کھیتی ہیں،تم جیسے چاہو اپنی کھیتی کو آؤ۔‘‘ متفق علیہ۔";
mishkaat.description = `[3183] متفق علیہ، رواہ البخاري (4528) و مسلم (117/ 1435)`;