var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الَّذِي يَأْتِي امْرَأَتَهُ فِي دُبُرِهَا لَا يَنْظُرُ اللَّهُ إِلَيْهِ» . رَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص اپنی اہلیہ سے اس کی دُبر سے آتا ہے تو اللہ اس کی طرف نظر (رحمت) نہیں فرمائے گا۔‘‘ اسنادہ حسن،رواہ فی شرح السنہ۔";
mishkaat.description = `[3194] إسنادہ حسن، رواہ البغوي في شرح السنۃ (107/9 ح 2297) [و ابن ماجہ (1923) و ابن حبان (الموارد: 1302)] و ھو حدیث صحیح بالشواھد .`;