var mishkaat = {};
mishkaat.arabic = "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَن يعْزل عَن الْحرَّة إِلَّا بِإِذْنِهَا. رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "عمر بن خطاب ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے آزاد عورت سے اس کی اجازت کے بغیر عزل کرنے سے منع فرمایا۔اسنادہ ضعیف،رواہ ابن ماجہ۔";
mishkaat.description = `[3197] إسنادہ ضعیف، رواہ ابن ماجہ (1928)<br>٭ وقال البوصیري: ’’ھذا إسناد ضعیف لضعف ابن لھیعۃ‘‘ و الزھري مدلس و عنعن: إن صح السند إلیہ .`;