var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْطَى فِي صَدَاقِ امْرَأَتِهِ مِلْءَ كَفَّيْهِ سَوِيقًا أَوْ تَمْرًا فَقَدِ اسْتحلَّ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے اپنی اہلیہ کو دونوں ہاتھ بھر کر ستو یا کھجور بطور مہر ادا کیا تو اس نے (اس عورت کو) اپنے لیے جائز کر لیا۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[3205] إسنادہ ضعیف، رواہ أبو داود (2110)<br>٭ ابن رومان: مستور، و ثقہ ابن حبان و حدہ و فیہ علۃ أخری .`;