var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ أَعْتَقَ صَفِيَّةَ وَتَزَوَّجَهَا وَجَعَلَ عِتْقَهَا صَدَاقَهَا وَأَوْلَمَ عَلَيْهَا بحيس. مُتَّفق عَلَيْهِ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے صفیہ ؓ کو آزاد کیا اور ان سے شادی کی اور ان کی آزادی کو ان کا حق مہر مقرر کیا اور حیس (کھجور،پنیر اور گھی سے تیار شدہ حلوہ) سے ان کا ولیمہ کیا۔متفق علیہ۔";
mishkaat.description = `[3213] متفق علیہ، رواہ البخاري (5169) ومسلم (1365/84)`;