var mishkaat = {};
mishkaat.arabic = "وَعَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ فأيهن خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سفر کا ارادہ فرمایا کرتے تھے تو آپ اپنی ازواج کے درمیان قرعہ اندازی کیا کرتے تھے،جس کے نام قرعہ نکلتا تو وہ آپ کے ساتھ سفر پر روانہ ہوتی تھیں۔متفق علیہ۔";
mishkaat.description = `[3232] متفق علیہ، رواہ البخاري (2688) و مسلم (2770/56)`;