var mishkaat = {};
mishkaat.arabic = "وَعَن ابْن عَبَّاس قَالَ: أَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتِفًا ثُمَّ مَسَحَ يَده بِمِسْحٍ كَانَ تَحْتَهُ ثُمَّ قَامَ فَصَلَّى. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه وَأحمد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے دستی کا گوشت کھایا،پھر اپنے نیچے بچھی ہوئی چادر سے اپنا ہاتھ صاف کیا،پھر کھڑے ہوئے اور نماز پڑھی۔ضعیف۔";
mishkaat.description = `[324] إسنادہ ضعیف، رواہ أبو داود (189) و ابن ماجہ (488)<br>٭ سماک عن عکرمۃ سلسلۃ ضعیفۃ .`;