var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا بَنُو إِسْرَائِيلَ لَمْ يَخْنَزِ اللَّحْمُ وَلَوْلَا حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوجهَا الدَّهْر»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بنو اسرائیل نہ ہوتے تو گوشت خراب نہ ہوتا اور اگر حوا نہ ہوتیں تو کوئی عورت کبھی اپنے شوہر کی خیانت نہ کرتی۔‘‘ متفق علیہ۔";
mishkaat.description = `[3241] متفق علیہ، رواہ البخاري (3399) و مسلم (1470/63)`;