var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا امْرَأَةٍ مَاتَتْ وَزَوْجُهَا عَنْهَا رَاضٍ دَخَلَتِ الْجَنَّةَ» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ام سلمہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو عورت اس حال میں فوت ہو کہ اس کا شوہر اس سے راضی ہو تو وہ جنت میں داخل ہو گی۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[3256] إسنادہ حسن، رواہ الترمذي (1161 وقال: حسن غریب)`;