var mishkaat = {};
mishkaat.arabic = "وَعَنْ طَلْقِ بْنِ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا الرَّجُلُ دَعَا زَوْجَتَهُ لِحَاجَتِهِ فَلْتَأْتِهِ وَإِنْ كَانَتْ عَلَى التَّنور» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "طلق بن علی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب آدمی اپنی اہلیہ کو اپنی حاجت کے لیے بلائے تو اسے اس کے پاس جانا چاہیے خواہ وہ تنور پر ہو۔‘‘ اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[3257] إسنادہ صحیح، رواہ الترمذي (1160 و قال: حسن غریب)`;