var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنَّا مَنْ خَبَّبَ امْرَأَةً عَلَى زَوْجِهَا أَوْ عَبْدًا عَلَى سَيّده» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص کسی عورت کو اس کے خاوند کے خلاف یا غلام کو اس کے آقا کے خلاف بھڑکائے وہ ہم میں سے نہیں۔‘‘ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[3262] حسن، رواہ أبو داود (5170)`;