var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُسْأَلُ الرَّجُلُ فِيمَا ضَرَبَ امْرَأَتَهُ عَلَيْهِ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "عمر ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’خاوند سے دریافت نہ کیا جائے کہ اس نے اپنی بیوی کو کیوں مارا ہے؟‘‘ حسن،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3268] حسن، رواہ أبو داود (2147) و ابن ماجہ (1986)`;