var mishkaat = {};
mishkaat.arabic = "وَعَنْ نَافِعٍ عَنْ مَوْلَاةٍ لِصَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ أَنَّهَا اخْتَلَعَتْ مِنْ زَوْجِهَا بِكُلِّ شَيْءٍ لَهَا فَلَمْ يُنْكِرْ ذَلِكَ عَبْدُ اللَّهِ بْنُ عمر. رَوَاهُ مَالك";
mishkaat.urdu = "نافع،صفیہ بنت ابی عبید کی آزاد کردہ لونڈی سے روایت کرتے ہیں کہ اس نے اپنی ہر چیز کے بدلے اپنے خاوند (ابن عمر ؓ) سے خلع لیا تو عبداللہ بن عمر ؓ نے اس کا انکار نہ کیا۔اسنادہ صحیح،رواہ مالک۔";
mishkaat.description = `[3291] إسنادہ صحیح، رواہ مالک (565/2 ح 1229)<br>٭ مولاۃ صفیۃ لا تعرف، و قول نافع: عن، بمعنی أن فلا علاقۃ لھذہ المولاۃ بالسند و اللہ أعلم .`;