var mishkaat = {};
mishkaat.arabic = "وَعَن ابْن عمر كَانَ يَقُولُ: قُبْلَةُ الرَّجُلِ امْرَأَتَهُ وَجَسُّهَا بِيَدِهِ مِنَ الْمُلَامَسَةِ. وَمَنْ قَبَّلَ امْرَأَتَهُ أَوْ جَسَّهَا بِيَدِهِ فَعَلَيهِ الْوضُوء. رَوَاهُ مَالك وَالشَّافِعِيّ";
mishkaat.urdu = "ابن عمر ؓ کہا کرتے تھے: آدمی کا اپنی اہلیہ کا بوسہ لینا اور اسے اپنے ہاتھ سے چھونا ملامسہ کے زمرے میں ہے،اور جو شخص اپنی اہلیہ کا بوسہ لے یا اسے اپنے ہاتھ سے چھوئے تو اس پر وضو کرنا لازم ہے۔صحیح،رواہ مالک و الشافعی۔";
mishkaat.description = `[330] صحیح، رواہ مالک فی الموطأ (1/ 43 ح 93) و الشافعي فی الأم (1/ 15)`;