var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَأَبِي بَكْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حرَام»";
mishkaat.urdu = "سعد بن ابی وقاص ؓ اور ابوبکرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے جانتے بوجھتے اپنے آپ کو اپنے باپ کے علاوہ کسی اور کی طرف منسوب کیا تو ایسے شخص پر جنت حرام ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3314] متفق علیہ، رواہ البخاري (6766) و مسلم (115/ 63)`;