var mishkaat = {};
mishkaat.arabic = "وَعَن سعيدِ بنِ المسيِّبِ قَالَ: إِنَّمَا نُقِلَتْ فَاطِمَةُ لِطُولِ لِسَانِهَا عَلَى أحمائِها. رَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "سعید بن مسیّب بیان کرتے ہیں،فاطمہ (بنت قیس ؓ) کو محض اس لیے منتقل کیا گیا کہ وہ اپنے (خاوند کے) اقارب پر زبان درازی کرتی تھیں۔اسنادہ ضعیف،رواہ فی شرح السنہ۔";
mishkaat.description = `[3326] إسنادہ ضعیف، رواہ البغوي في شرح السنۃ (294/9 بعد ح 2384 بلا سند) [و أبو داود (2296 و سندہ ضعیف) و الشافعي فی الأم (474/7)]<br>٭ سعید بن المسیب لم یذکر من حدثہ بھذا فقولہ ھاھنا مردود .`;