var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْعَبْدَ إِذَا نَصَحَ لِسَيِّدِهِ وَأَحْسَنَ عِبَادَةَ اللَّهِ فَلَهُ أَجْرُهُ مرَّتَيْنِ»";
mishkaat.urdu = "عبداللہ بن عمر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب غلام اپنے آقا کے لیے مخلص و خیر خواہ ہو اور وہ اللہ کی عبادت بھی احسن انداز میں کرتا ہو تو اس کے لیے دو اجر ہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[3348] متفق علیہ، رواہ البخاري (2546) و مسلم (1664/43)`;