var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعِمَّا لِلْمَمْلُوكِ أَنْ يَتَوَفَّاهُ اللَّهُ بِحُسْنِ عِبَادَةِ رَبِّهِ وَطَاعَة سَيّده نعما لَهُ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مملوک کے لیے کیا خوب ہے کہ اللہ اسے اس حال میں فوت کرے کہ وہ اپنے رب کی عبادت بھی اچھے انداز میں کرتا ہو اور اپنے آقا کی اطاعت بھی اچھے انداز میں کرتا ہو،کیا خوب ہے اس کے لیے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3349] متفق علیہ، رواہ البخاري (2549) و مسلم (1667/46)`;