var mishkaat = {};
mishkaat.arabic = "عَن عبد الله بن عمر قَالَ: ارْتَقَيْتُ فَوْقَ بَيْتِ حَفْصَةَ لِبَعْضِ حَاجَتِي فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يقْضِي حَاجته مستدبر الْقبْلَة مُسْتَقْبل الشَّام";
mishkaat.urdu = "عبداللہ بن عمر ؓ بیان کرتے ہیں،میں اپنی کسی ضرورت کے تحت ام المومنین حفصہ ؓ کے گھر کی چھت پر چڑھا تو میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو قبلہ کی طرف پشت اور شام کی طرف منہ کر کے قضائے حاجت کرتے ہوئے دیکھا۔متفق علیہ۔";
mishkaat.description = `[335] متفق علیہ، رواہ البخاري (148) و مسلم (62/ 266)`;