var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ ضَرَبَ غُلَامًا لَهُ حَدًّا لَمْ يَأْتِهِ أَوْ لَطَمَهُ فَإِن كَفَّارَته أَن يعتقهُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جس شخص نے اپنے غلام پر اس کے ناکردہ جرم پر حد قائم کی یا اس کو تھپڑ رسید کیا تو اس کا کفارہ یہ ہے کہ وہ اسے آزاد کر دے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3352] رواہ مسلم (657/30)`;