var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه";
mishkaat.urdu = "ابوبکر صدیق ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’غلاموں کے ساتھ بُرا سلوک کرنے والا جنت میں داخل نہیں ہو گا۔‘‘ اسنادہ ضعیف،رواہ الترمذی و ابن ماجہ۔";
mishkaat.description = `[3358] إسنادہ ضعیف، رواہ الترمذي (1946 و قال: غریب) و ابن ماجہ (3691)<br>٭ فرقد السبخي: ضعیف مشھور .`;