var mishkaat = {};
mishkaat.arabic = "وَفِي «الْمُجْتَبَى» لِلدَّارَقُطْنِيِّ: أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضَرْبِ الْمُصَلِّينَ";
mishkaat.urdu = "اور امام دارقطنی کی روایت المجتبی میں ہے کہ عمر بن خطاب ؓ نے فرمایا کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہمیں نمازیوں کو مارنے سے منع فرمایا ہے۔حسن،رواہ الدارقطنی۔";
mishkaat.description = `[3366] حسن، رواہ الدارقطني (54/2 ح 1739 و سندہ ضعیف و ھو حسن بالشواھد منھا الحدیث السابق (3365)`;