var mishkaat = {};
mishkaat.arabic = "وَعَن أبي مُوسَى قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَرَّقَ بَيْنَ الْوَالِدِ وَوَلَدِهِ وَبَيْنَ الْأَخِ وَبَيْنَ أَخِيهِ. رَوَاهُ ابْنُ مَاجَهْ وَالدَّارَقُطْنِيُّ";
mishkaat.urdu = "ابوموسی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے والد اور اس کے بچے کے درمیان،نیز بھائیوں کے درمیان جدائی ڈالنے والے پر لعنت فرمائی۔اسنادہ ضعیف،رواہ ابن ماجہ و الدارقطنی۔";
mishkaat.description = `[3372] إسنادہ ضعیف، رواہ ابن ماجہ (2250) و الدارقطني (67/3)<br>٭ إبراہیم بن إسماعیل بن مجمع الأنصاري: ضعیف .`;