var mishkaat = {};
mishkaat.arabic = "عَن الْحسن عَن سَمُرَة عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من ملك ذَا رحم محرم فَهُوَ حُرٌّ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَه";
mishkaat.urdu = "حسن،سمرہ کی سند سے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص قرابت دار محرم کا مالک ہو جائے تو وہ (غلام) آزاد ہے۔‘‘ اسنادہ حسن،رواہ الترمذی و ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3393] إسنادہ حسن، رواہ الترمذي (1365) و أبو داود (3949) و ابن ماجہ (2524)`;