var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلَّا أَنْ يَشْتَرِطَ السَّيِّدُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص غلام آزاد کرے اور اس (غلام) کا مال ہو تو غلام کا مال غلام ہی کا ہے مگر یہ کہ آقا کوئی شرط طے کر لے۔‘‘ اسنادہ صحیح،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3396] إسنادہ صحیح، رواہ أبو داود (3962) و ابن ماجہ (2529)`;