var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتبَته دِرْهَم» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں،انہوں نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کیا،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مکاتب پر جب تک مکاتبت کا ایک درہم بھی باقی رہتا ہے تو وہ غلام ہے۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[3399] إسنادہ حسن، رواہ أبو داود (3926)`;