var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَانَ عِنْدَ مكَاتب إحداكن وَفَاء فلنحتجب مِنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ";
mishkaat.urdu = "ام سلمہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تمہارے کسی مکاتب کے پاس اس قدر رقم ہو کہ وہ ادا کر سکے تو وہ (مالکہ) اس سے پردہ کرے۔‘‘ اسنادہ حسن،رواہ الترمذی و ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3400] إسنادہ حسن، رواہ الترمذي (1261 وقال: حسن صحیح) و أبو داود (3928) و ابن ماجہ (2520)`;