var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ ليصمت»";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بے شک اللہ تمہیں اپنے باپ دادا کی قسمیں اٹھانے سے منع فرماتا ہے،جس نے قسم اٹھانی ہو وہ اللہ کی قسم اٹھائے یا پھر خاموش رہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3407] متفق علیہ، رواہ البخاري (6646) و مسلم (1646/3)`;