var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وليفعل» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص کسی چیز پر قسم اٹھائے اور وہ اس سے بہتر چیز جان لے تو وہ اپنی قسم کا کفارہ ادا کرے اور جو بہتر چیز ہے وہ کرے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3413] رواہ مسلم (1650/12)`;