var mishkaat = {};
mishkaat.arabic = "وَعَن أبي هُرَيْرَة قَالَ: كَانَتْ يَمِينُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفَ: «لَا وَأَسْتَغْفِرُ اللَّهَ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم قسم اٹھاتے تو یوں فرماتے:’’نہیں! اور میں اللہ سے مغفرت طلب کرتا ہوں۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3423] إسنادہ ضعیف، رواہ أبو داود (3265) و ابن ماجہ (2093)<br>٭ ھلال بن أبي ھلال المدني: مستور و ثقہ ابن حبان وحدہ و قال الذہبي: ’’لا یعرف‘‘.`;