var mishkaat = {};
mishkaat.arabic = "عَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’معصیت میں کوئی نذر نہیں،اور اس کا کفارہ قسم کے کفارہ کی طرح ہے۔‘‘ صحیح،رواہ ابوداؤد و الترمذی و النسائی۔";
mishkaat.description = `[3435] صحیح، رواہ أبو داود (3292) و الترمذي (1524 وقال: لا یصح) و النسائي (26/7 ح 3865)<br>٭ و للحدیث شواھد وھو بھا صحیح .`;