var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ الْبَرَازَ انْطَلَقَ حَتَّى لَا يرَاهُ أحد. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم بول و براز کا ارادہ فرماتے تو آپ (صحرا کی طرف) چلتے جاتے حتیٰ کہ آپ نظروں سے اوجھل ہو جاتے۔ضعیف۔";
mishkaat.description = `[344] سندہ ضعیف، رواہ أبو داود (2) [و ابن ماجہ: 335]<br>٭ إسماعیل بن عبد الملک ضعیف ضعفہ الجمھور و أحادیث أبي داود (2549) و النسائي (16) و السراج (المسند: 17) وغیرہم تغني عنہ .`;