var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ عَنْ\nرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ ذَنْبٍ عَسَى اللَّهُ أَنْ يَغْفِرَهُ إِلَّا مَنْ مَاتَ مُشْرِكًا أَوْ مَنْ يقتُلُ مُؤمنا مُتَعَمدا» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابودرداءؓ،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’امید ہے کہ اللہ ہر گناہ معاف فرما دے بجز اس شخص کے جو حالت شرک میں فوت ہو،اور جس نے عمداً کسی مومن کو قتل کیا ہو۔‘‘ اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[3468] إسنادہ صحیح، رواہ أبو داود (4270)`;