var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ وَلَا يُقَادُ بِالْوَلَدِ الْوَالِدُ» . رَوَاهُ التِّرْمِذِيّ والدارمي";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مساجد میں حدود قائم نہ کی جائیں اور نہ اولاد کا والد سے قصاص لیا جائے۔‘‘ سندہ ضعیف،رواہ الترمذی و الدارمی۔";
mishkaat.description = `[3470] سندہ ضعیف، رواہ الترمذي (1401) والدارمي (190/2 ح 2362) [و ابن ماجہ (2661)]<br>٭ إسماعیل بن مسلم ضعیف و للحدیث شواھد ضعیفۃ .`;