var mishkaat = {};
mishkaat.arabic = "وَعَن عَائِشَة قَالَتْ: كَانَتْ يَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْيُمْنَى لِطَهُورِهِ وَطَعَامِهِ وَكَانَتْ يَدُهُ الْيُسْرَى لِخَلَائِهِ وَمَا كَانَ مِنْ أَذًى. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کا دایاں ہاتھ وضو،اور کھانے کے لیے تھا،جبکہ بایاں ہاتھ استنجا اور ناپسندیدہ کاموں کے لیے تھا۔‘‘ ضعیف۔";
mishkaat.description = `[348] سندہ ضعیف، رواہ أبو داود (33)<br>٭ سعید بن أبي عروبۃ مدلس و حدیث أبي داود (32) یغني عنہ .`;