var mishkaat = {};
mishkaat.arabic = "وَرَوَاهُ أَبُو دَاوُد عَنهُ وَابْن مَاجَه وَعَن ابْن عمر. وَفِي «شَرْحِ السُّنَّةِ» لَفْظُ «الْمَصَابِيحِ» عَنِ ابْنِ عمر";
mishkaat.urdu = "اور ابوداؤد نے ان (عبداللہ بن عمرو ؓ) سے اور ابن عمر ؓ سے روایت کیا ہے،اور شرح السنہ میں مصابیح کے الفاظ صرف ابن عمر ؓ سے مروی ہیں۔سندہ ضعیف،رواہ ابوداؤد و البغوی فی شرح السنہ۔";
mishkaat.description = `[3491] سندہ ضعیف، رواہ أبو داود (4549) و البغوي في شرح السنۃ (186/10 ح 2536)<br>٭ علي بن زید بن جدعان ضعیف و حدیث أبي داود (4547) و البخاري (6895) یغني عنہ .`;