var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ جَعَلَ الدِّيَةَ اثْنَيْ عَشَرَ أَلْفًا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ";
mishkaat.urdu = "ابن عباس ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں کہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے دیت بارہ ہزار (درہم) مقرر فرمائی۔اسنادہ حسن،رواہ الترمذی و ابوداؤد و النسائی و الدارمی۔";
mishkaat.description = `[3499] إسنادہ حسن، رواہ الترمذي (1388 وقال: حسن صحیح غریب) و أبو داود (4546) و النسائي (192/2 ح2368) و الدارمي (44/8 ح4808)`;