var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَيْنِ الْقَائِمَةِ السَّادَّةِ لِمَكَانِهَا بِثُلْثِ الدِّيَةِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں،انہوں نے کہا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنی جگہ پر ثابت رہ جانے والی آنکھ کی ایک تہائی دیت مقرر فرمائی۔اسنادہ حسن،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[3502] إسنادہ حسن، رواہ أبو داود (4567) و النسائي (55/8 ح 4844)`;