var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَالْبِئْرُ جُبَارٌ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر چوپائے کسی کو زخمی کر دیں تو اس پر کوئی خون بہا نہیں،اگر کوئی کان میں دب کر مر جائے اس پر کوئی خون بہا نہیں اور جو شخص کنویں میں گر کر مر جائے تو اس کا خون بہا نہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[3510] متفق علیہ، رواہ البخاري (6912) و مسلم (1710/45)`;