var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَوِ اطَّلَعَ فِي بَيْتِكَ أحدٌ ولمْ تَأذن لَهُ فخذفته بحصاة ففتأت عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ»";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ انہوں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’اگر کوئی شخص بلا اجازت تمہارے گھر میں جھانکے اور تم اسے کنکری مارو جس سے اس کی آنکھ پھوٹ جائے تو تم پر کوئی گناہ نہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[3514] متفق علیہ، رواہ البخاري (6888) و مسلم (2158/44)`;