var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَاتَلَ أَحَدُكُمْ فَلْيَجْتَنِبِ الْوَجْهَ فَإِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی (کسی کو) مارے تو وہ چہرے سے اجتناب کرے،کیونکہ اللہ نے آدم ؑ کو اپنی صورت پر پیدا فرمایا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3525] متفق علیہ، رواہ البخاري (2559) و مسلم (2612/115)`;