var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَعَاطَى السَّيْفُ مَسْلُولًا. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے بے نیام تلوار کسی کو دینے سے منع فرمایا ہے۔سندہ ضعیف،رواہ الترمذی و ابوداؤد۔";
mishkaat.description = `[3527] سندہ ضعیف، رواہ الترمذي (2613 و قال: حسن غریب) و أبو داود (2588)<br>٭ أبو الزبیر مدلس و عنعن و للحدیث شواھد ضعیفۃ .`;