var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ أُمَّتِي فِرْقَتَيْنِ فَيَخْرُجُ مِنْ بَيْنِهِمَا مَارِقَةٌ يَلِي قَتْلَهُمْ أولاهم بِالْحَقِّ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میری امت دو گروہوں میں منقسم ہو جائے گی اور ان دونوں کے بیچ سے ایک خارجی جماعت رونما ہو گی،ان کا خاتمہ وہ لوگ کریں گے جو حق کے زیادہ قریب ہونگے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3536] رواہ مسلم (1064/151)`;