var mishkaat = {};
mishkaat.arabic = "عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُثُّنَا عَلَى الصَّدَقَةِ وَيَنْهَانَا عَنِ الْمُثْلَةِ. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "عمران بن حصین ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہمیں صدقہ دینے پر آمادہ کیا کرتے تھے اور مثلہ کرنے سے منع فرمایا کرتے تھے۔سندہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[3540] سندہ ضعیف، رواہ أبو داود (2667)<br>٭ قتادۃ مدلس و عنعن و حدیث أحمد (20/5) یغني عن ھذا الحدیث .`;