var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَرِيرٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَبَقَ الْعَبْدُ إِلَى الشِّرْكِ فقد حلَّ دَمه» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جریر ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب غلام مشرکین کے علاقے کی طرف فرار ہو جائے تو اس کا خون حلال ہو جاتا ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[3549] إسنادہ ضعیف، رواہ أبو داود (4360)<br>٭ أبو إسحاق عنعن و حدیث مسلم (70) یغني عنہ .`;