var mishkaat = {};
mishkaat.arabic = "وَعَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَاقْتُلُوا الْفَاعِلَ وَالْمَفْعُول بِهِ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه";
mishkaat.urdu = "عکرمہ،ابن عباس ؓ سے روایت کرتے ہیں،انہوں نے کہا،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم جس شخص کو قوم لوط کا سا کام کرتے ہوئے دیکھو تو فاعل اور مفعول دونوں کو قتل کر دو۔‘‘ اسنادہ حسن،رواہ الترمذی و ابن ماجہ۔";
mishkaat.description = `[3575] إسنادہ حسن، رواہ الترمذي (1456) و ابن ماجہ (2561)`;