var mishkaat = {};
mishkaat.arabic = "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مجھے اپنی امت کے متعلق قومِ لوط کے عمل میں ملوث ہونے کا سب سے زیادہ اندیشہ ہے۔‘‘ سندہ ضعیف،رواہ الترمذی و ابن ماجہ۔";
mishkaat.description = `[3577] سندہ ضعیف، رواہ الترمذي (1457 وقال: حسن غریب) و ابن ماجہ (2563)<br>٭ عبد اللہ بن محمد بن عقیل ضعیف ضعفہ الجمھور .`;