var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مِنَ الْخَلَاءِ قَالَ «غفرانك» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه والدارمي";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم بیت الخلا سے باہر تشریف لاتے تو یہ دعا: ((غفرانک))’’میں تیری مغفرت چاہتا ہوں۔‘‘ پڑھا کرتے تھے۔صحیح،رواہ الترمذی و ابن ماجہ و الدارمی۔";
mishkaat.description = `[359] إسنادہ صحیح، رواہ الترمذي (7 وقال: غریب حسن .) و ابن ماجہ (300) والدارمي (1/ 174 ح 686) [وأبوداود: 30]`;