var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ السارِقَ يسرقُ البيضةَ فتُقطعُ يَده وَيسْرق الْحَبل فتقطع يَده»";
mishkaat.urdu = "ابوہریرہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ چور پر لعنت کرے کہ وہ انڈا چراتا ہے تو اس کا ہاتھ کاٹ دیا جاتا ہے،اور وہ رسی چراتا ہے تو اس کا ہاتھ کاٹ دیا جاتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3592] متفق علیہ، رواہ البخاري (6799) و مسلم (م1687/7)`;