var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى الْمُنْتَهِبِ قَطْعٌ وَمَنِ انْتَهَبَ نُهْبَةً مَشْهُورَةً فَلَيْسَ مِنَّا» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ڈاکو پر قطع (ہاتھ کاٹنا) نہیں (اس کی سزا الگ ہے)،اور جو شخص بڑے بڑے ڈاکے ڈالے وہ ہم میں سے نہیں۔‘‘ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[3596] صحیح، رواہ أبو داود (4391)`;