var mishkaat = {};
mishkaat.arabic = "عَنْ عُبَادَةَ بْنِ الصَّامِتِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَرَّمَ الله عَلَيْهِ النَّار»";
mishkaat.urdu = "عبادہ بن صامت ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جو شخص گواہی دے کہ اللہ کے سوا کوئی معبود برحق نہیں،اور محمد صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اللہ کے رسول ہیں،اللہ نے اس کو جہنم پر حرام کر دیا ہے۔‘‘ رواہ مسلم و الترمذی (۲۶۳۸)۔";
mishkaat.description = ``;