var mishkaat = {};
mishkaat.arabic = "وَرُوِيَ فِي شَرْحِ السُّنَّةِ فِي قَطْعِ السَّارِقِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اقْطَعُوهُ ثمَّ احسموه»";
mishkaat.urdu = "اور انہوں نے شرح السنہ میں چور کے ہاتھ کاٹنے کے بارے میں نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کیا،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس (کے ہاتھ) کو کاٹ دو پھر اسے داغ دو۔‘‘ حسن،رواہ فی شرح السنہ۔";
mishkaat.description = `[3604] حسن، رواہ البغوي في شرح السنۃ (327/10 بعد ح 2602) [والحاکم (381/4 ح 8150) و صححہ ووافقہ الذہبي و سندہ حسن]`;