var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَرَقَ الْمَمْلُوكُ فَبِعْهُ وَلَوْ بِنَشٍّ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْن مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب غلام چوری کرے تو اسے بیچ دو خواہ ایک ’’نش‘‘ (بیس درہم) ہی ملے۔‘‘ حسن،رواہ ابوداؤد و النسائی و ابن ماجہ۔";
mishkaat.description = `[3606] حسن، رواہ أبو داود (4412) و النسائي (91/8 ح 4983) و ابن ماجہ (2589)`;