var mishkaat = {};
mishkaat.arabic = "وَعَن الحكم بن سُفْيَان قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَالَ تَوَضَّأَ وَنَضَحَ فَرْجَهُ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "حکم بن سفیان ؓ بیان کرتے ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم پیشاب کرتے تو وضو فرماتے اور اپنی شرم گاہ پر پانی کے چھینٹے مارتے تھے۔‘‘ حسن،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[361] حسن، رواہ أبو داود (166) والنسائي (1/ 86 ح 134) [وابن ماجہ: 461]<br>٭ فی السند بعض الإختلاف وھو لا یضر و للحدیث شواھد .`;