var mishkaat = {};
mishkaat.arabic = "وَعَن أُمَيْمَة بنت رقيقَة قَالَتْ: كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدَحٌ مِنْ عَيْدَانٍ تَحْتَ سَرِيرِهِ يَبُولُ فِيهِ بِاللَّيْلِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "امیمہ بنت رقیقہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی چارپائی کے نیچے لکڑی کا ایک پیالہ ہوتا تھا جس میں آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم رات کے وقت پیشاب کیا کرتے تھے۔حسن،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[362] حسن، رواہ أبو داود (24) والنسائي (1/ 31 ح 32)`;