var mishkaat = {};
mishkaat.arabic = "عَنْ حُذَيْفَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سباطة قوم فَبَال قَائِما. . قيل: كَانَ ذَلِك لعذر";
mishkaat.urdu = "حذیفہ ؓ بیان کرتے ہیں: نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کسی قوم کے کوڑے کرکٹ کے ڈھیر پر آئے تو آپ نے کھڑے ہو کر پیشاب کیا۔امام بخاری اور امام مسلم نے روایت کیا ہے اور کہا گیا ہے کہ یہ (کھڑے ہو کر پیشاب کرنا) کسی عذر کی وجہ سے تھا۔متفق علیہ۔";
mishkaat.description = `[364] متفق علیہ، رواہ البخاري (224) ومسلم (73/ 273) و قول محیي السنۃ في مصابیح السنۃ (200/1 ح 256)`;