var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ";
mishkaat.urdu = "جابر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس چیز کی کثیر مقدار نشہ آور ہو تو اس کی قلیل مقدار بھی حرام ہے۔‘‘ اسنادہ حسن،رواہ الترمذی و ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3645] إسنادہ حسن، رواہ الترمذي (1865 وقال: حسن غریب) و أبو داود (2681) و ابن ماجہ (3393)`;