var mishkaat = {};
mishkaat.arabic = "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: «مَنْ حَدَّثَكُمْ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبُولُ قَائِمًا فَلَا تُصَدِّقُوهُ مَا كَانَ يَبُول إِلَّا قَاعِدا» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَالنَّسَائِيّ";
mishkaat.urdu = "عائشہؓ نے فرمایا: جو شخص تمہیں یہ بتائے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کھڑے ہو کر پیشاب کیا کرتے تھے،تو اس کی تصدیق نہ کرو،آپ تو صرف بیٹھ کر پیشاب کیا کرتے تھے۔حسن،رواہ احمد و الترمذی و النسائی۔";
mishkaat.description = `[365] حسن، رواہ أحمد (6/ 192 ح 26124) والترمذي (12) والنسائي (1/ 26 ح 29)`;