var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مُدْمِنُ الْخَمْرِ إِنْ مَاتَ لقيَ اللَّهَ كعابِدِ وثن» . رَوَاهُ أَحْمد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’شراب نوشی پر دوام اختیار کرنے والا اگر (اسی حالت میں) فوت ہو جائے تو وہ اللہ تعالیٰ سے بت کے پجاری کی طرح ملاقات کرے گا۔‘‘ حسن،رواہ احمد۔";
mishkaat.description = `[3657] حسن، رواہ أحمد (272/1 ح 2453)<br>٭ و سندہ ضعیف لجھالۃ الراوي و الحدیث الآتي شاھد لہ، و لہ شواھد کثیرۃ .`;