var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ الْحُصَيْنِ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ مُجَدَّعٌ يَقُودُكُمْ بِكِتَابِ اللَّهِ فَاسْمَعُوا لَهُ وَأَطيعُوا» . رَوَاهُ مُسلم";
mishkaat.urdu = "ام حصین ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر کسی ناک اور کان کٹے غلام کو تمہارا امیر مقرر کر دیا جائے اور وہ اللہ کی کتاب کے مطابق تمہاری راہنمائی کرے تو پھر اس کی بات سنو اور اطاعت کرو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3662] رواہ مسلم (1298/311)`;