var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اسْمَعُوا وَأَطِيعُوا وَإِنِ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ كَأَنَّ رَأْسَهُ زَبِيبَةٌ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر کسی حبشی غلام کو،جس کا سر انگور کی طرح چھوٹا سا ہو،تم پر عامل (گورنر) مقرر کر دیا جائے تو اس کی بات سنو اور اطاعت کرو۔‘‘ رواہ البخاری۔";
mishkaat.description = `[3663] رواہ البخاري (7142)`;