var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كُنَّا إِذَا بَايَعْنَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا: «فِيمَا اسْتَطَعْتُمْ»";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،جب ہم سمع و اطاعت میں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی بیعت کرتے تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہمیں فرماتے:’’اس (معاملے) میں جس کی تم استطاعت رکھو۔‘‘ متفق علیہ۔";
mishkaat.description = `[3667] متفق علیہ، رواہ البخاري (7202) و مسلم (1867/90)`;