var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَتَاكُمْ وَأَمْرُكُمْ جَمِيعٌ عَلَى رَجُلٍ وَاحِدٍ يُرِيدُ أَنْ يَشُقَّ عَصَاكُمْ أوْ يُفرِّقَ جماعتكم فَاقْتُلُوهُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "عرفجہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا: جو شخص تمہارے پاس آئے،جبکہ تمہارا معاملہ شخصِ واحد پر مجتمع ہو،اور وہ شخص تمہاری قوت کو بکھیرنا یا تمہاری جمعیت کو منتشر کرنا چاہتا ہو تو اسے قتل کر دو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3678] رواہ مسلم (1852/60)`;