var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَجِدُونَ مِنْ خَيْرِ النَّاسِ أَشَدَّهُمْ كَرَاهِيَةً لِهَذَا الْأَمْرِ حَتَّى يقَعَ فِيهِ»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم لوگوں میں سے اس شخص کو بہترین پاؤ گے جو اس امر (حکومت و امارت) کو انتہائی ناپسند کرتا ہے یہاں تک کہ وہ اس میں مبتلا نہ ہو جائے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3684] متفق علیہ، رواہ البخاري (3588) و مسلم (2526/199)`;