var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ عَبْدٍ يَسْتَرْعِيهِ اللَّهُ رَعِيَّةً فَلَمْ يَحُطْهَا بِنَصِيحَةٍ إِلَّا لَمْ يجد رَائِحَة الْجنَّة»";
mishkaat.urdu = "معقل بن یسار ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’اللہ جس بندے کو کسی رعیت کا نگہبان بنائے اور وہ ان کے ساتھ خیر خواہی نہ کرے تو وہ جنت کی خوشبو بھی نہیں پائے گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[3687] متفق علیہ، رواہ البخاري (7150) و مسلم (142/21)`;