var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ» . رَوَاهُ مُسلم";
mishkaat.urdu = "عثمان ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص کو اس حالت میں موت آئے کہ وہ جانتا ہو کہ اللہ کے سوا کوئی معبود برحق نہیں تو وہ جنت میں داخل ہو گا۔‘‘ رواہ مسلم و الترمذی (۱/ ۶۵،۴۶۴،ابن حبان (۲۰۱)۔";
mishkaat.description = ``;