var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْأَمِيرَ إِذَا ابْتَغَى الرِّيبَةَ فِي النَّاسِ أَفْسَدَهُمْ» . رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "ابوامامہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو حکمران لوگوں کے عیوب تلاش کرتا رہتا ہے تو وہ انہیں خراب کر دیتا ہے۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[3708] إسنادہ حسن، رواہ أبو داود (4889)`;