var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ الْغَادِرَ يُنْصَبُ لَهُ لِوَاءٌ يَوْمَ الْقِيَامَةِ فَيُقَالُ: هَذِهِ غَدْرَةُ فُلَانِ بْنِ فُلَانٍ";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عہد شکنی کرنے والے کے لیے روز قیامت جھنڈا نصب کیا جائے گا اور کہا جائے گا: یہ فلاں بن فلاں شخص کی عہد شکنی (کا نتیجہ) ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3725] متفق علیہ، رواہ البخاري (6178) و مسلم (1735/10)`;