var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا خَرَجَ مِنَ الْخَلَاءِ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنِّي الْأَذَى وَعَافَانِي» . رَوَاهُ أبن مَاجَه";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم بیت الخلا سے باہر تشریف لائے تو یہ دعا پڑھتے:’’ہر قسم کی تعریف و شکر اللہ کے لیے ہے جس نے مجھ سے تکلیف دور کی اور مجھے عافیت عطا فرمائی۔‘‘ ضعیف۔";
mishkaat.description = `[374] إسنادہ ضعیف، رواہ ابن ماجہ (301)<br>٭ إسماعیل بن مسلم المکي: ضعیف الحدیث و فیہ علل أخری .`;