var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أُعْطِيكُمْ وَلَا أَمْنَعُكُمْ أَنَا قَاسِمٌ أَضَعُ حَيْثُ أُمِرْتُ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں نہ تمہیں دیتا ہوں اور نہ تم سے روکتا ہوں،میں تو تقسیم کرنے والا ہوں میں تو اسی جگہ پر خرچ کرتا ہوں جہاں کے متعلق مجھے حکم دیا جاتا ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[3745] رواہ البخاري (3117)`;