var mishkaat = {};
mishkaat.arabic = "وَعَن خَوْلةَ الْأَنْصَارِيَّةِ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ رِجَالًا يَتَخَوَّضُونَ فِي مَالِ اللَّهِ بِغَيْرِ حَقٍّ فَلَهُمُ النَّارُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "خولہ انصاریہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کچھ لوگ اللہ کے مال (بیت المال) میں ناحق تصرف کرتے ہیں،روز قیامت ان کے لیے (جہنم کی) آگ ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[3746] رواہ البخاري (3118)`;