var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنِ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابوذر ؓ سے روایت ہے کہ انہوں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جس نے کسی ایسی چیز کا دعوی کیا جو کہ اس کی نہیں تو وہ اپنا ٹھکانا جہنم میں بنا لے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3765] رواہ مسلم (61/112)`;