var mishkaat = {};
mishkaat.arabic = "وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ؟ الَّذِي يَأْتِي بشهادتِه قبلَ أنْ يسْأَلهَا» . رَوَاهُ مُسلم";
mishkaat.urdu = "زید بن خالد ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کیا میں تمہیں بہترین گواہ کے متعلق نہ بتاؤں؟ یہ وہ ہے جو اس (گواہی) کے طلب کیے جانے سے پہلے اپنی گواہی پیش کر دے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3766] رواہ مسلم (1719/19)`;