var mishkaat = {};
mishkaat.arabic = "وَعَن أبي هريرةَ أنَّ رجُلينِ اختَصما فِي دَابَّة وَلَيْسَ لَهما بَيِّنَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «استهِما على اليَمينِ» . رَوَاهُ أَبُو دَاوُد وابنُ مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ دو آدمیوں نے کسی جانور کے بارے میں جھگڑا کیا اور ان دونوں کے پاس کوئی گواہی نہیں تھی،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قسم پر قرعہ اندازی کرو۔‘‘ (جس کا قرعہ نکل آئے وہ قسم دے) صحیح،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3773] صحیح، رواہ أبو داود (3618) و ابن ماجہ (2346)`;