var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ حَلَّفَهُ: «احْلِفْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ مَاله عِنْدَكَ شَيْءٌ» يُعْنَى لِلْمُدَّعِي. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایک آدمی سے قسم لینے کا ارادہ کیا تو فرمایا:’’اللہ کی قسم اٹھاؤ جس کے سوا کوئی معبود برحق نہیں کہ تمہارے پاس اس شخص (یعنی مدعی) کی کوئی چیز نہیں۔‘‘ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[3774] حسن، رواہ أبو داود (3620)`;