var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’گنوار کی بستی میں رہائش پذیر شخص کے خلاف گواہی جائز نہیں۔‘‘ اسنادہ صحیح،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[3783] إسنادہ صحیح، رواہ أبو داود (3602) و ابن ماجہ (2366)`;