var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنَ الدُّنْيَا وَمَا عَلَيْهَا»";
mishkaat.urdu = "سہل بن سعد ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ کی راہ میں ایک دن مورچہ بند ہونا دنیا اور اس میں جو کچھ ہے اس (کے مل جانے یا اسے خرچ کر دینے) سے بہتر ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3791] متفق علیہ، رواہ البخاري (2892) و مسلم (113/ 1881)`;