var mishkaat = {};
mishkaat.arabic = "وَعَن زيد بن خالدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ فَقَدْ غَزَا وَمَنْ خَلَفَ غَازِيًا فِي أَهْلِهِ فقد غزا»";
mishkaat.urdu = "زید بن خالد ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے اللہ کی راہ میں کسی مجاہد کو تیار کیا تو اس نے بھی جہاد کیا،جس شخص نے کسی مجاہد کے اہل خانہ میں جانشینی کا حق ادا کیا تو اس نے بھی جہاد کیا۔‘‘ متفق علیہ۔";
mishkaat.description = `[3797] متفق علیہ، رواہ البخاري (2843) و مسلم (136، 1895/135)`;