var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بَعْثًا إِلَى بَنِي لِحْيَانَ مِنْ هُذَيْلٍ فَقَالَ: «لينبعثْ مِنْ كلِّ رجلينِ أحدُهما والأجرُ بَينهمَا» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوسعید ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہذیل قبیلہ کے بنولحیان کی طرف ایک لشکر بھیجنے کا ارادہ کیا تو فرمایا:’’ہر دو آدمیوں میں سے ایک (دشمن کی طرف) اٹھ کھڑا ہو،اور اجر اِن دونوں کو ملے گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3800] رواہ مسلم (1896/137)`;