var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَنْ يَبْرَحَ هَذَا الدِّينُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِنَ الْمُسْلِمِينَ حَتَّى تقوم السَّاعَة» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یہ دین ہمیشہ قائم رہے گا،مسلمانوں کی ایک جماعت اس کی خاطر قیامت تک لڑتی رہے گی۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3801] رواہ مسلم (1922/172)`;