var mishkaat = {};
mishkaat.arabic = "وَعَن سهل بن حنيف قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ. رَوَاهُ مُسلم";
mishkaat.urdu = "سہل بن حُنیف ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص صدقِ دل سے اللہ سے شہادت طلب کرتا ہے تو وہ اسے شہداء کے مقام پر پہنچا دیتا ہے،خواہ اسے اپنے بستر پر موت آئے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3808] رواہ مسلم (1909/157)`;