var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْم الْفَتْح: («اهجرة بَعْدَ الْفَتْحِ وَلَكِنْ جِهَادٌ وَنِيَّةٌ وَإِذَا اسْتُنْفِرْتُمْ فانفروا»";
mishkaat.urdu = "ابن عباس ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فتح مکہ کے روز فرمایا:’’فتح (مکہ) کے بعد کوئی ہجرت نہیں لیکن جہاد اور نیت (باقی) ہے،اور جب تم سے (جہاد میں) نکلنے کے لیے کہا جائے تو نکلو۔‘‘ متفق علیہ۔";
mishkaat.description = `[3818] متفق علیہ، رواہ البخاري (2783) و مسلم (445/ 1353)`;