var mishkaat = {};
mishkaat.arabic = "وَعَن خُرَيمِ بن فاتِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ كُتبَ لَهُ بسبعمائةِ ضعف» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ";
mishkaat.urdu = "خُریم بن فاتک ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے اللہ کی راہ میں کچھ خرچ کیا تو اس کے لیے سات سو گنا تک لکھ دیا جاتا ہے۔‘‘ اسنادہ صحیح،رواہ الترمذی و النسائی۔";
mishkaat.description = `[3826] إسنادہ صحیح، رواہ الترمذي (1625 وقال: حسن) و النسائي (49/6 ح 3188)`;