var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: عَيْنَانِ لَا تَمَسُّهُمَا النَّارُ: عَيْنٌ بَكَتْ مِنْ خَشْيَةِ اللَّهِ وَعَيْنٌ بَاتَتْ تَحْرُسُ فِي سَبِيلِ اللَّهِ . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’دو آنکھیں ہیں جنہیں جہنم کی آگ نہیں چھوے گی،ایک وہ آنکھ جو اللہ کے ڈر سے روئی اور دوسری وہ آنکھ جو رات کے وقت اللہ کی راہ میں پہرہ دیتی ہے۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[3829] حسن، رواہ الترمذي (1639 وقال: حسن غریب)`;