var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرْقُدُ مِنْ لَيْلٍ وَلَا نَهَارٍ فَيَسْتَيْقِظُ إِلَّا يَتَسَوَّكُ قَبْلَ أَنْ يَتَوَضَّأَ. رَوَاهُ أَحْمد وَأَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم رات یا دن کے کسی حصے میں سوتے تو آپ بیدار ہو کر وضو کرنے سے پہلے مسواک کیا کرتے تھے۔ضعیف۔";
mishkaat.description = `[383] إسنادہ ضعیف، رواہ أحمد (6/ 160 ح 25787) و أبو داود (57)<br>٭ علي بن زید بن جدعان ضعیف و أم محمد: لم أجد من و ثقھا .`;