var mishkaat = {};
mishkaat.arabic = "وَعَن أم حرَام عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمَائِدُ فِي الْبَحْرِ الَّذِي يُصِيبُهُ الْقَيْءُ لَهُ أَجْرُ شَهِيدٍ وَالْغَرِيقُ لَهُ أَجْرُ شَهِيدَيْنِ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ام حرام ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتی ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سمندر (کے سفر) میں چکرانے والے شخص کو قے آ جائے تو اس کے لیے ایک شہید کا اجر ہے،اور جو شخص ڈوب جائے تو اس کے لیے دو شہیدوں کا اجر ہے۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[3839] إسنادہ حسن، رواہ أبو داود (2493)`;