var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِلْغَازِي أَجْرُهُ وَلِلْجَاعِلِ أَجْرُهُ وَأَجْرُ الْغَازِي» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عبداللہ بن عمرو ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جہاد کرنے والے کے لیے اس کا اجر ہے اور جہاد پر تیار کرنے والے کے لیے تیاری کا اجر بھی ہے اور جہاد کرنے کا اجر بھی ہے۔‘‘ اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[3842] إسنادہ صحیح، رواہ أبو داود (2526)`;