var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «سَتُفْتَحُ عَلَيْكُمُ الرُّومُ وَيَكْفِيكُمُ اللَّهُ فَلَا يَعْجِزْ أَحَدُكُمْ أَنْ يَلْهُوَ بِأَسْهُمِهِ» . رَوَاهُ مُسلم";
mishkaat.urdu = "عقبہ بن عامر ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’تم عنقریب روم فتح کر لو گے،اور اللہ تمہارے لیے (ان کے شر کے مقابلے میں) کافی ہو گا،تم میں سے کوئی اپنے تیر کے ساتھ مشغول رہنے میں سستی نہ کرے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[3862] رواہ مسلم (1918/168)`;