var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا سَبَقَ إِلَّا فِي نَصْلٍ أَوْ خُفٍّ أَوْ حَافِرٍ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’انعام صرف تیر اندازی،اونٹ اور گھوڑے میں ہے۔‘‘ صحیح،رواہ الترمذی و ابوداؤد و النسائی۔";
mishkaat.description = `[3874] صحیح، رواہ الترمذي (1700) و أبو داود (2564) و النسائي (226/6 ح 3615، 3617)`;