var mishkaat = {};
mishkaat.arabic = "وَعَن أنسٍ قَالَ: كَانَتْ قَبِيعَةُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ والدارمي";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی تلوار کی دستی چاندی کی تھی۔صحیح،رواہ الترمذی و ابوداؤد و النسائی و الدارمی۔";
mishkaat.description = `[3884] صحیح، رواہ الترمذي (1691 وقال: حسن غریب) أبو داود (2583) و النسائي (219/8ح 5376) و الدارمي (221/2 ح 2461)`;