var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَطْرُقُ أَهْلَهُ لَيْلًا وَكَانَ لَا يَدْخُلُ إِلَّا غُدْوَةً أَوْ عَشِيَّةً";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم (جب سفر سے واپس آتے تو) وہ رات کے وقت اپنے اہل خانہ کے ہاں تشریف نہیں لاتے تھے بلکہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دن کے پہلے پہر یا پچھلے پہر تشریف لایا کرتے تھے۔متفق علیہ۔";
mishkaat.description = `[3902] متفق علیہ، رواہ البخاري (1800) و مسلم (1928/180)`;