var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دَخَلْتَ لَيْلًا فَلَا تَدَخُلْ عَلَى أهلك حَتَّى تستحد المغيبة وتمتشط الشعثة»";
mishkaat.urdu = "جابر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم رات کے وقت (شہر میں) داخل ہو تو اپنی اہلیہ کے پاس نہ جاؤ حتی کہ جس کا خاوند غائب رہا ہے وہ غیر ضروری بالوں کی صفائی کر لے اور پراگندہ بالوں والی کنگھی کر لے۔‘‘ متفق علیہ۔";
mishkaat.description = `[3904] متفق علیہ، رواہ البخاري (5246) و مسلم (182/ 1928)`;