var mishkaat = {};
mishkaat.arabic = "وَعَن جَابر قَالَ: كُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَلَمَّا قَدِمْنَا الْمَدِينَةَ قَالَ لِي: «ادْخُلِ الْمَسْجِدَ فَصَلِّ فِيهِ رَكْعَتَيْنِ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،میں ایک سفر میں نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے ساتھ تھا،جب ہم مدینہ پہنچے تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے فرمایا:’’مسجد میں جا کر دو رکعتیں پڑھو۔‘‘ رواہ البخاری۔";
mishkaat.description = `[3907] رواہ البخاري (3088)`;