var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا كَانَ ثَلَاثَةٌ فِي سَفَرٍ فَلْيُؤَمِّرُوا أحدهم» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوسعید خدری ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تین افراد سفر کر رہے ہوں تو وہ اپنے میں سے ایک کو امیر بنا لیں۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[3911] إسنادہ ضعیف، رواہ أبو داود (2608)<br>٭ فیہ محمد بن عجلان مدلس و عنعن ولہ شواھد کلھا ضعیفۃ و لم یصب من حسنہ .`;