var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَحْسَنَ مَا دَخَلَ الرَّجُلُ أَهْلَهُ إِذَا قَدِمَ مِنْ سفرٍ أوَّلُ الليلِ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب آدمی سفر سے واپس آئے تو اس کا اپنے اہل خانہ کے پاس آنے کا بہترین وقت رات کا ابتدائی حصہ ہے۔‘‘ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[3921] صحیح، رواہ أبو داود (2777)`;