var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جِلْدُ نَمِرٍ» . رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’فرشتے اس جماعت کے ساتھ نہیں ہوتے جس میں چیتے کی کھال ہو۔‘‘";
mishkaat.description = `[3924] إسنادہ ضعیف، رواہ أبو داود (کتاب اللباس باب في جلود النمور ح4130)<br>٭ فیہ قتادۃ مدلس و عنعن و حدیث أبي داود (2555) لا یستشھد لہ، ھو غیر ھذا المتن .`;