var mishkaat = {};
mishkaat.arabic = "وَعَن النُّعْمَانِ بْنِ مُقَرِّنٍ قَالَ: شَهِدْتُ الْقِتَالَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا لَمْ يُقَاتِلْ أَوَّلَ النَّهَارِ انْتَظَرَ حَتَّى تهب الْأَرْوَاح وتحضر الصَّلَاة. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "نعمان بن مقرن ؓ بیان کرتے ہیں،میں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے ساتھ جہاد میں شریک تھا،اگر آپ دن کے آغاز میں لڑائی کا آغاز نہ فرماتے تو آپ انتظار فرماتے حتی کہ ہوائیں چلنے لگتیں اور نماز (ظہر) کا وقت ہو جاتا۔رواہ البخاری۔";
mishkaat.description = `[3932] رواہ البخاري (3160)`;