var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْزُو بِأُمِّ سُلَيْمٍ وَنِسْوَةٍ مِنَ الْأَنْصَارِ مَعَهُ إِذَا غَزَا يَسْقِينَ الْمَاءَ وَيُدَاوِينَ الْجَرْحَى. رَوَاهُ مُسلم";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جہاد کے لیے جاتے تو ام سلیم ؓ اور انصار کی کچھ عورتیں آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے ساتھ جہاد کے لیے جاتیں وہ پانی پلاتیں اور زخمیوں کا علاج کرتی تھیں۔رواہ مسلم۔";
mishkaat.description = `[3940] رواہ مسلم (1810/130)`;