var mishkaat = {};
mishkaat.arabic = "وَعَن الْمُهلب أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنْ بَيَّتَكُمُ الْعَدُوُّ فَلْيَكُنْ شِعَارُكُمْ: حم لَا ينْصرُونَ . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد";
mishkaat.urdu = "مہلّب ؒ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر دشمن تم پر شب خون مارے تمہارا شعار (کوڈ ورڈ) یہ ہونا چاہیے: حٰمٓ لَا یُنْصَرُوْنَ۔‘‘ صحیح،رواہ الترمذی و ابوداؤد۔";
mishkaat.description = `[3948] صحیح، رواہ الترمذي (1682 وقال: حسن صحیح غریب) و أبو داود (2597)`;