var mishkaat = {};
mishkaat.arabic = "وَعَن سَمُرَة بن جُنْدُبٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اقْتُلُوا شُيُوخَ الْمُشْرِكِينَ وَاسْتَحْيُوا شَرْخَهُمْ» أَيْ صِبْيَانَهُمْ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد";
mishkaat.urdu = "سمرہ بن جندب ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مشرکین کے بوڑھوں کو قتل کرو اور ان کے بچوں کو زندہ رکھو۔‘‘ اسنادہ ضعیف،رواہ الترمذی و ابوداؤد۔";
mishkaat.description = `[3952] إسنادہ ضعیف، رواہ الترمذي (1583 وقال: حسن صحیح غریب) و أبو داود (2670)<br>٭ قتادۃ مدلس و عنعن .`;