var mishkaat = {};
mishkaat.arabic = "وَعَن عُروَةَ قَالَ: حدَّثني أسامةُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَهِدَ إِلَيْهِ قَالَ: «أَغِرْ عَلَى أُبْنَى صباحا وَحرق» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عروہ ؒ بیان کرتے ہیں،اسامہ ؓ نے مجھے حدیث بیان کی کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اسے وصیت کرتے ہوئے فرمایا:’’اُبنٰی پر صبح کے وقت حملہ کر اور (ان کی کھیتیاں اور درخت) جلا دے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[3953] إسنادہ ضعیف، رواہ أبو داود (2616) [و ابن ماجہ (2843)]<br>٭ صالح بن أبی الأخضر: ضعیف یعتبر بہ و فیہ علۃ أخری .`;