var mishkaat = {};
mishkaat.arabic = "عَنْ ثَوْبَانَ بْنِ يَزِيدَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَصَبَ الْمَنْجَنِيقَ عَلَى أَهْلِ الطائفِ. رَوَاهُ التِّرْمِذِيّ مُرْسلا";
mishkaat.urdu = "ثوبان بن یزید سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اہل طائف پر منجنیق نصب کی۔امام ترمذی ؒ نے اسے مرسل روایت کیا ہے۔اسنادہ ضعیف جذا،رواہ الترمذی۔";
mishkaat.description = `[3959] إسنادہ ضعیف جدًا، رواہ الترمذي (2762)<br>٭ فیہ عمر بن ھارون: متروک و للحدیث شواھد ضعیفۃ، انظر بلوغ المرام بتحقیقي (1306)`;