var mishkaat = {};
mishkaat.arabic = "وَعَن جُبَير بن مطعم أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي أُسَارَى بَدْرٍ: «لَوْ كَانَ الْمُطْعِمُ بْنُ عَدِيٍّ حَيًّا ثُمَّ كَلَّمَنِي فِي هَؤُلَاءِ النَّتْنَى لتركتهم لَهُ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "جبیر بن مطعم ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے بدر کے قیدیوں کے بارے میں فرمایا:’’اگر مطعم بن عدی زندہ ہوتا،پھر وہ ان ناپاکوں کے متعلق سفارش کرتا تو میں اس کی خاطر انہیں چھوڑ دیتا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[3965] رواہ البخاري (3139)`;