var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنَفِّلُ بَعْضَ مَنْ يَبْعَثُ مِنَ السَّرَايَا لِأَنْفُسِهِمْ خَاصَّةً سِوَى قِسْمَةِ عَامَّةِ الْجَيْشِ";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جن دستوں کو روانہ فرماتے تو ان میں سے بعض مجاہدین کو ان کے حصہ کے علاوہ خصوصی حصہ عنایت فرمایا کرتے تھے۔متفق علیہ۔";
mishkaat.description = `[3990] متفق علیہ، رواہ البخاري (3135) و مسلم (1750/40)`;