var mishkaat = {};
mishkaat.arabic = "وَعَن خوْلَةَ الْأَنْصَارِيَّةِ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ رِجَالًا يَتَخَوَّضُونَ فِي مَالِ اللَّهِ بِغَيْرِ حَقٍّ فَلَهُمُ النَّارُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "خولہ انصاریہ ؓ بیان کرتی ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’کچھ لوگ اللہ کے مال میں ناحق تصرف کرتے ہیں،،روزِ قیامت ان کے لیے (جہنم کی) آگ ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[3995] رواہ البخاري (3118)`;