var mishkaat = {};
mishkaat.arabic = "عَن مُعَاذِ بْنِ جَبَلٍ قَالَ: «قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَفَاتِيحُ الْجَنَّةِ شَهَادَةُ أَنْ لَا إِلَه إِلَّا الله» . رَوَاهُ أَحْمد";
mishkaat.urdu = "معاذ بن جبل ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے فرمایا:’’اس بات کی گواہی دینا کہ اللہ کے سوا کوئی معبود برحق نہیں جنت کی چابی ہے۔‘‘ اسنادہ ضعیف،رواہ احمد (۵/ ۲۴۲ ح ۲۲۴۵۳)۔";
mishkaat.description = `[40] إسنادہ ضعیف، رواہ أحمد (5/ 242 ح 22453)<br>٭ شھر بن حوشب: عن معاذ، منقطع .`;