var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي شَأْنِهِ كُلِّهِ: فِي طهوره وَترَجله وتنعله";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنے تمام امور (مثلاً) وضو کرنے،کنگھی کرنے اور جوتا پہننے میں دائیں طرف سے شروع کرنا مقدور بھر پسند کیا کرتے تھے۔متفق علیہ۔";
mishkaat.description = `[400] متفق علیہ، رواہ البخاري (426) و مسلم (67/ 268)`;