var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ وَخَالِدِ بْنِ الْوَلِيدِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي السَّلَبِ لِلْقَاتِلِ. وَلَمْ يُخَمِّسِ السَلَب. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عوف بن مالک اشجعی اور خالد بن ولید ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے جنگ میں قتل ہو جانے والے شخص کے سازو سامان کے بارے میں فیصلہ فرمایا کہ وہ اس کے قاتل کا ہے،اور آپ نے مقتول کے سازو سامان سے خمس نہیں نکالا۔حسن،رواہ ابوداؤد۔";
mishkaat.description = `[4003] حسن، رواہ أبو داود (2721)`;