var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنَفِّلُ الرُّبُعَ بَعْدَ الْخُمُسِ وَالثُّلُثَ بَعْدَ الْخُمُسِ إِذَا قَفَلَ. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "حبیب بن مسلمہ فہری ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جب جہاد سے واپس تشریف لانے سے پہلے مالِ غنیمت خمس نکالنے کے بعد چوتھائی اور واپس لوٹتے ہوئے خمس نکالنے کے بعد تہائی حصہ اضافی طور پر عطا فرمایا کرتے تھے۔صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[4008] صحیح، رواہ أبو داود (2749)`;