var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ يَكْتُمُ غَالًّا فَإِنَّهُ مِثْلُهُ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "سمرہ بن جندب ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا کرتے تھے:’’جو شخص خیانت کرنے والے کی پردہ پوشی کرتا ہے تو وہ بھی اسی کی طرح ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4014] إسنادہ ضعیف، رواہ أبو داود (2716)<br>٭ خبیب: مجھول، و جعفر بن سعد: ضعفہ الجمھور .`;