var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَهْيٌ أَنْ تُبَاعَ السِّهَامُ حَتَّى تُقْسَمَ. رَوَاهُ الدَّارمِيّ";
mishkaat.urdu = "ابوامامہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں کہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حصوں کی تقسیم سے پہلے انہیں بیچنے سے منع فرمایا۔سندہ حسن،رواہ الدارمی۔";
mishkaat.description = `[4016] سندہ حسن، رواہ الدارمي (226/2 ح 2479، نسخۃ محققۃ: 2519) [و الطبراني فی الکبیر 220/8 ح 7774 و قبلہ: 7594]`;