var mishkaat = {};
mishkaat.arabic = "وَعَن رافعِ بن خديجٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْعَلُ فِي قَسْمِ الْمَغَانِمِ عَشْرًا مِنَ الشّاءِ بِبَعِير. رَوَاهُ النَّسَائِيّ";
mishkaat.urdu = "رافع بن خدیج ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم مال غنیمت کی تقسیم میں ایک اونٹ کے بدلے میں دس بکریاں مقرر فرمایا کرتے تھے۔صحیح رواہ النسائی۔";
mishkaat.description = `[4032] صحیح، رواہ النسائي (7/ 221 ح 4396) [و أصلہ متفق علیہ (البخاري: 2488 ومسلم: 1968)]`;