var mishkaat = {};
mishkaat.arabic = "عَنْ أَسْلَمَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ ضَرَبَ الْجِزْيَةَ عَلَى أَهْلِ الذَّهَبِ أربعةَ دنانيرَ وعَلى أهلِ الوَرِقِ أَرْبَعِينَ دِرْهَمًا مَعَ ذَلِكَ أَرْزَاقُ الْمُسْلِمِينَ وَضِيَافَةُ ثلاثةِ أيامٍ. رَوَاهُ مَالك";
mishkaat.urdu = "اسلم سے روایت ہے کہ عمر بن خطاب ؓ نے سونے والوں پر چار دینار اور چاندی والوں پر چالیس درہم جزیہ مقرر فرمایا،اس کے ساتھ ساتھ مسلمانوں کی ضروریات زندگی اور تین دن کی ضیافت۔اسنادہ صحیح،رواہ مالک۔";
mishkaat.description = `[4041] إسنادہ صحیح، رواہ مالک (279/1 ح 623)`;