var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَمَيْتَ بِسَهْمِكَ فَغَابَ عَنْكَ فَأَدْرَكْتَهُ فَكُلْ مَا لَمْ يُنْتِنْ» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابوثعلبہ خشنی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم نے اپنا تیر (شکار پر) پھینکا اور وہ (شکار) تیری نظروں سے اوجھل ہو گیا،پھر تم نے اسے پا لیا تو اگر وہ بدبودار نہیں ہوا تو اسے کھا سکتے ہو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4067] رواہ مسلم (1931/9)`;