var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَا من دَابَّة إِلَّا وَقَدْ ذَكَّاهَا اللَّهُ لِبَنِي آدَمَ» . رَوَاهُ الدَّارَقُطْنِيّ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ نے تمام سمندری جانور بنی آدم کے لیے حلال کیے ہیں۔‘‘ اسنادہ ضعیف جذا،رواہ الدارقطنی۔";
mishkaat.description = `[4097] إسنادہ ضعیف جدًا، رواہ الدارقطني (267/4 ح 4666)<br>٭ فیہ حمزۃ بن عمرو النصیبي: ضعیف جدًا متھم .`;