var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَنِ اقْتَنَى كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ ضَارٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے ریوڑ کی حفاظت والے کتے اور شکاری کتے کے علاوہ کوئی اور کتا رکھا تو اس کے عمل سے روزانہ دو قراط کمی کی جاتی ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4098] متفق علیہ، رواہ البخاري (5480) و مسلم (50 / 1574)`;