var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من اتَّخَذَ كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ صَيْدٍ أَو زرعٍ انتقَصَ منْ أجرِه كلَّ يومٍ قِيرَاط»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے ریوڑ کی حفاظت والے کتے یا شکاری یا کھیتی کی حفاظت والے کتے کے سوا کوئی اور کتا رکھا تو اس کے اجر سے روزانہ ایک قراط کم کیا جاتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4099] متفق علیہ، رواہ البخاري (2322) و مسلم (1575/58)`;