var mishkaat = {};
mishkaat.arabic = "وَعَن أنس قَالَ: أَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ فَأَخَذْتُهَا فَأَتَيْتُ بهَا أَبَا طلحةَ فذبحها وَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بوَرِكِها وفخذْيها فقبِله";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،ہم نے مرالظہران کے پاس ایک خرگوش کو دوڑایا،میں اسے پکڑ کر ابوطلحہ ؓ کے پاس لے آیا،انہوں نے اسے ذبح کیا اور اس کا کولہا اور اس کی دونوں رانیں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی خدمت میں بھیجیں تو آپ نے انہیں قبول فرمایا۔متفق علیہ۔";
mishkaat.description = `[4109] متفق علیہ، رواہ البخاري (2572) و مسلم (53/ 1953)`;