var mishkaat = {};
mishkaat.arabic = "وَعَن ميمونةَ أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَمَاتَتْ فَسُئِلَ رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ: «ألقوها وَمَا حولهَا وكلوه» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "میمونہ ؓ سے روایت ہے کہ ایک چوہیا گھی میں گر کر مر گئی،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے اس کے متعلق مسئلہ دریافت کیا گیا تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس کو اور اس کے آس پاس کے گھی کو پھینک دو اور بقیہ (گھی) کھا لو۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4116] رواہ البخاري (5538)`;