var mishkaat = {};
mishkaat.arabic = "وَعَن عبد الله بن زيد قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَضْمَضَ وَاسْتَنْشَقَ مِنْ كَفٍّ وَاحِدَةٍ فَعَلَ ذَلِك ثَلَاثًا. رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ";
mishkaat.urdu = "عبداللہ بن زید ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو دیکھا کہ آپ نے ایک ہی چلو سے کلی کی اور ناک میں پانی ڈالا،اور آپ نے تین مرتبہ ایسے ہی کیا۔صحیح،رواہ ابوداؤد و الترمذی۔";
mishkaat.description = `[412] إسنادہ صحیح، رواہ أبو داود (119) والترمذي (28 وقال: حسن غریب .) [وھو متفق علیہ/ رواہ البخاري (191) ومسلم (235)]`;