var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَتَلَ وَزَغًا فِي أولَّ ضَرْبَة كتبت لَهُ مِائَةُ حَسَنَةٍ وَفِي الثَّانِيَةِ دُونَ ذَلِكَ وَفِي الثَّالِثَة دون ذَلِك» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے پہلی ضرب میں گرگٹ مار دیا تو اس کے لیے سو نیکی لکھ دی جاتی ہے،اور دوسری چوٹ میں مارنے والے کے لیے اس سے کم اور تیسری میں اس سے کم (نیکی لکھی جاتی ہے)۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4121] رواہ مسلم (2240/147)`;