var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ بِرَأْسِهِ وَأُذُنَيْهِ: بَاطِنَهُمَا بِالسَّبَّاحَتَيْنِ وَظَاهِرَهُمَا بإبهاميه)\n(رَوَاهُ النَّسَائِيّ)";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنے سر کا مسح کیا،اور آپ نے کانوں کے اندر کے حصوں کا شہادت کی انگلیوں سے اور باہر کے حصوں کا انگوٹھوں سے مسح کیا۔اسنادہ حسن،رواہ النسائی۔";
mishkaat.description = `[413] إسنادہ حسن، رواہ النسائي (1/ 74 ح 102) [والترمذي (36) و ابن ماجہ (439)]`;