var mishkaat = {};
mishkaat.arabic = "وَعَن زيدِ بن خالدٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ سَبِّ الدِّيكِ وَقَالَ: «إِنَّهُ يُؤَذِّنُ للصَّلاةِ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "زید بن خالد ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مرغ کو بُرا بھلا کہنے سے منع فرمایا ہے،اور آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ نماز (کے وقت) کی اطلاع دیتا ہے۔‘‘ اسنادہ حسن،رواہ فی شرح السنہ۔";
mishkaat.description = `[4135] إسنادہ حسن، رواہ البغوي في شرح السنۃ (199/12 ح 3270) [و أبو داود، انظر الحدیث الآتي]`;