var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا سَالَمْنَاهُمْ مُنْذُ حَارَبْنَاهُمْ وَمَنْ تَرَكَ شَيْئًا مِنْهُمْ خِيفَةً فَلَيْسَ منَّا» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب سے ہماری ان (سانپوں) سے لڑائی شروع ہوئی ہے ہم نے ان سے صلح نہیں کی،اور جس نے ڈر کے پیشِ نظر ان میں سے کسی (سانپ) کو (مارے بغیر) چھوڑ دیا تو وہ ہم میں سے نہیں۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[4139] إسنادہ حسن، رواہ أبو داود (5248)`;