var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِ أَرْبَعٍ مِنَ الدَّوَابِّ: النَّمْلَةِ وَالنَّحْلَةِ وَالْهُدْهُدُ وَالصُّرَدُ. رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے چار جانوروں: چیونٹی،شہد کی مکھی،ہد ہد اور لٹورے کو مارنے سے منع فرمایا ہے۔سندہ ضعیف،رواہ ابوداؤد و الدارمی۔";
mishkaat.description = `[4145] سندہ ضعیف، رواہ أبو داود (5267) و الدارمي (88/2۔ 89ح 2550) [و ابن ماجہ (3224)]<br>٭ الزھري عنعن و للحدیث شواھد ضعیفۃ .`;