var mishkaat = {};
mishkaat.arabic = "عَن سلمانَ بن عامرٍ الضَّبي قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَعَ الْغُلَامِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وأمِيطوا عَنهُ الْأَذَى» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "سلمان بن عامر ضبی ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’لڑکے کے پیدا ہونے پر عقیقہ ہے،اس کی طرف سے خون بہاؤ (جانور ذبح کرو) اور اس سے تکلیف دور کرو (اس کا سر منڈاؤ اور اسے نہلاؤ)۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4149] رواہ البخاري (5471۔ 5472)`;