var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَّ عَنِ الْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا. رَوَاهُ أَبُو دَاوُدَ وَعِنْدَ النَّسَائِيِّ: كبشين كبشين";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حسن اور حسین ؓ کی طرف سے ایک ایک مینڈھے سے عقیقہ کیا۔ابوداؤد۔اور نسائی کی روایت میں دو دو مینڈھوں کا ذکر ہے۔اسنادہ صحیح،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[4155] إسنادہ صحیح، رواہ أبو داود (2841) و النسائي (165/7۔ 166 ح 4224)`;