var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَأْكُلَنَّ أَحَدُكُمْ بِشِمَالِهِ وَلَا يَشْرَبَنَّ بِهَا فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بهَا» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم میں سے کوئی شخص بھی اپنے بائیں ہاتھ سے نہ کھائے اور نہ اس کے ساتھ پیئے،کیونکہ شیطان اپنے بائیں ہاتھ کے ساتھ کھاتا پیتا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4163] رواہ مسلم (106/ 2020)`;