var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «طَعَامُ الْوَاحِدِ يَكْفِي الِاثْنَيْنِ وَطَعَامُ الِاثْنَيْنِ يَكْفِي الْأَرْبَعَةَ وَطَعَامُ الْأَرْبَعَةِ يَكْفِي الثمانيَة» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’ایک آدمی کا کھانا دو کے لیے،دو کا کھانا چار کے لیے اور چار کا کھانا آٹھ کے لیے کافی ہوتا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4178] رواہ مسلم (2059/179)`;