var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «التَّلْبِينَةُ مُجِمَّةٌ لِفُؤَادِ الْمَرِيضِ تَذْهَبُ بِبَعْض الْحزن»";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’تلبینہ (جو کا دلیہ) دل کے مریض کے لیے راحت بخش اور غم کو ہلکا کرنے والا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4179] متفق علیہ، رواہ البخاري (5417) و مسلم (2216/90)`;