var mishkaat = {};
mishkaat.arabic = "وَعَن النّعمانِ بن بشيرٍ قَالَ: أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئْتُمْ؟ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يَجِدُ مِنَ الدَّقَلِ مَا يَمْلَأُ بَطْنَهُ. رَوَاهُ مُسلم";
mishkaat.urdu = "نعمان بن بشیر ؓ بیان کرتے ہیں،کیا تمہارے پاس تمہاری چاہت کے مطابق کھانے پینے کی وافر چیزیں نہیں ہیں؟ جبکہ میں نے تمہارے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو دیکھا کے آپ کے پاس پیٹ بھرنے کے لیے ردی قسم کی کھجوریں بھی نہیں تھیں۔رواہ مسلم۔";
mishkaat.description = `[4195] رواہ مسلم (2977/34)`;