var mishkaat = {};
mishkaat.arabic = "وَعَن ابنِ عبَّاسٍ قَالَ: كَانَ أَحَبَّ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثَّرِيدُ مِنَ الْخُبْزِ والثريدُ منَ الحَيسِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو روٹی اور حیس (کھجور،پنیر اور گھی) سے تیار شدہ ثرید بہت مرغوب تھا۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4220] إسنادہ ضعیف، رواہ أبو داود (3783)<br>٭ فیہ رجل من أھل البصرۃ مجھول و سقط ذکرہ فی المستدرک (116/4) فصححاہ (!)`;