var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأ مَرَّتَيْنِ مَرَّتَيْنِ وَقَالَ: هُوَ «نُورٌ عَلَى نُورٍ»";
mishkaat.urdu = "عبداللہ بن زید ؓ بیان کرتے ہیں کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے دو دو مرتبہ وضو کیا اور فرمایا:’’وہ نور پرنور (سونے پہ سہاگہ) ہے۔‘‘ لااصل لہ،روواہ رزین (لم اجدہ)";
mishkaat.description = `[423] لا أصل لہ، رواہ رزین (لم أجدہ)<br>٭ و انظر الترغیب والترہیب (1/ 163 ح 315) للمنذري، و تخریج احیاء علوم الدین للعراقي (1/ 135)`;