var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن أَكْلِ الثُّومِ إِلَّا مَطْبُوخًا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد";
mishkaat.urdu = "علی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے کچا لہسن کھانے سے منع فرمایا ہے مگر پکا ہوا (کھانے میں کچھ حرج نہیں) اسنادہ ضعیف،رواہ الترمذی و ابوداؤد۔";
mishkaat.description = `[4230] إسنادہ ضعیف، رواہ الترمذي (1808 و ضعفہ) و أبو داود (3828)<br>٭ فیہ أبو إسحاق مدلس ومختلط و عنعن و لم یعلم تحدیثہ بہ قبل اختلاطہ .`;