var mishkaat = {};
mishkaat.arabic = "وَعَن أبي زيادٍ قَالَ: سُئلتْ عائشةُ عَنِ الْبَصَلِ فَقَالَتْ: إِنَّ آخِرَ طَعَامٍ أَكَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامُ فِيهِ بصل. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوزیاد بیان کرتے ہیں،عائشہ ؓ سے پیاز کے متعلق دریافت کیا گیا تو انہوں نے فرمایا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے جو آخری کھانا تناول فرمایا اس میں پیاز تھا۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4231] إسنادہ ضعیف، رواہ أبو داود (3829)<br>٭ خیار بن سلمۃ: لم یوثقہ غیر ابن حبان .`;