var mishkaat = {};
mishkaat.arabic = "وَعَن ابْنيْ بُسرٍ السُّلَمِيَّين قَالَا: دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدَّمْنَا زُبْدًا وَتَمْرًا وَكَانَ يُحِبُّ الزبدَ والتمرِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "بسر کے دونوں بیٹوں سے روایت ہے،انہوں نے کہا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہمارے پاس تشریف لائے تو ہم نے آپ کے سامنے مکھن اور کھجور پیش کیا۔آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم مکھن اور کھجور پسند فرمایا کرتے تھے۔اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[4232] إسنادہ صحیح، رواہ أبو داود (3837)`;