var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا جَمِيعًا وَلَا تَفَرَّقُوا فَإِنَّ الْبَرَكَةَ معَ الجماعةِ» . رَوَاهُ ابْنُ مَاجَهْ";
mishkaat.urdu = "عمر بن خطاب ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اکٹھے کھایا کرو،الگ الگ مت کھاؤ،کیونکہ برکت جماعت کے ساتھ ہے۔‘‘ سندہ ضعیف،رواہ ابن ماجہ۔";
mishkaat.description = `[4257] سندہ ضعیف، رواہ ابن ماجہ (3287)<br>٭ عمرو بن دینار قھرمان آل الزبیر ضعیف و حدیث ابن ماجہ (3255) یغني عنہ .`;