var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنَ السَّنَةِ أَنْ يَخْرُجَ الرَّجُلُ مَعَ ضَيْفِهِ إِلَى بَابِ الدَّارِ» . رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آدمی کا پنے مہمان کے ساتھ گھر کے دروازے تک جانا مسنون ہے۔‘‘ اسنادہ ضعیف جذا،رواہ ابن ماجہ۔";
mishkaat.description = `[4258] إسنادہ ضعیف جدًا، رواہ ابن ماجہ (3358)<br>٭ فیہ علي بن عروۃ: متروک و لہ شاھد موضوع عند ابن عدي فی الکامل (1173/3) فلا یستشھد بہ .`;