var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ اخْتِنَاثِ الْأَسْقِيَةِ. زَادَ فِي رِوَايَةٍ: وَاخْتِنَاثُهَا: أَنْ يُقْلَبَ رَأْسُهَا ثُمَّ يُشْرَبَ مِنْهُ";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مشکیزوں کے منہ موڑ کر ان سے پانی پینے سے منع فرمایا ہے۔اور ایک روایت میں اضافہ نقل کیا ہے: مشکیزوں کا منہ موڑنا یہ ہے کہ اس کا دہانہ اُلٹا کر پھر ان سے پیا جائے۔متفق علیہ۔";
mishkaat.description = `[4265] متفق علیہ، رواہ البخاري (5625) و مسلم (111/ 2023)`;