var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَنَفَّسَ فِي الْإِنَاءِ أَوْ يُنْفَخَ فِيهِ. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے برتن میں سانس لینے یا اس میں پھونک مارنے سے منع فرمایا ہے۔اسنادہ صحیح،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[4277] إسنادہ صحیح، رواہ أبو داود (3728) و ابن ماجہ (3428۔ 3429)`;