var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْتَعْذَبُ لَهُ الْمَاءُ مِنَ السُّقْيَا. قِيلَ: هِيَ عَيْنٌ بَيْنَهَا وَبَيْنَ الْمَدِينَةِ يَوْمَانِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے لیے سقیا سے آبِ شیریں لایا جاتا تھا،مشہور ہے کہ وہ مدینہ سے دو روز کی مسافت پر ایک چشمہ ہے۔اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[4284] إسنادہ صحیح، رواہ أبو داود (3735)`;