var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نهى عَن الدُّبَّاء والحنتم والمرفت وَالنَّقِيرِ وَأَمَرَ أَنْ يُنْبَذَ فِي أَسْقِيَةِ الْأَدَمِ. رَوَاهُ مُسلم";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے کدو کے بنائے ہوئے برتن،سبز گھڑے،روغن کیے ہوئے برتن اور لکڑی سے کریدے ہوئے برتن میں نبیذ تیار کرنے سے منع فرمایا،اور آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے چمڑے کے مشکیزوں میں نبیذ تیار کرنے کا حکم فرمایا۔رواہ مسلم۔";
mishkaat.description = `[4290] رواہ مسلم (1997/57، 1997/46)`;