var mishkaat = {};
mishkaat.arabic = "عَن أبي مَالك الْأَشْعَرِيّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَيَشْرَبَنَّ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ";
mishkaat.urdu = "ابومالک اشعری ؓ سے روایت ہے کہ انہوں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’میری امت کے کچھ لوگ شراب کا کوئی اور نام رکھ کر شراب نوشی کریں گے۔‘‘ حسن،رواہ ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[4292] حسن، رواہ أبو داود (3688) و ابن ماجہ (4020)`;