var mishkaat = {};
mishkaat.arabic = "عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ الْأَخْضَرِ قُلْتُ: أَنَشْرَبُ فِي الأبيضِ؟ قَالَ: «لَا» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عبداللہ بن ابی اوفی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے سبز گھڑے کی نبیذ سے منع فرمایا تو میں نے عرض کیا،کیا ہم سفید میں پی لیا کریں؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’نہیں۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4293] رواہ البخاري (5596)`;