var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةٍ لَهُ: قَالَ: «لَا تُرْسِلُوا فَوَاشِيكُمْ وَصِبْيَانَكُمْ إِذَا غَابَتِ الشَّمْسُ حَتَّى تَذْهَبَ فَحْمَةُ الْعِشَاءِ فَإِنَّ الشَّيْطَانَ يَبْعَثُ إِذَا غَابَتِ الشَّمْسُ حَتَّى تذْهب فَحْمَة الْعشَاء»";
mishkaat.urdu = "اور مسلم ہی کی روایت میں ہے،فرمایا:’’جب سورج غروب ہو جائے تو رات کی ابتدائی تاریکی غائب ہو جانے تک اپنے مویشی اور اپنے بچے نہ چھوڑو،کیونکہ اس وقت شیطان چھوڑے جاتے ہیں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4297] رواہ مسلم (2013/98)`;