var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذا جلس بَيْنَ شُعَبِهَا الْأَرْبَعِ ثُمَّ جَهَدَهَا فَقَدْ وَجَبَ الْغسْل وَإِن لم ينزل»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی اس (یعنی اپنی اہلیہ) کی چار شاخوں کے درمیان بیٹھے،پھر اسے مشقت میں مبتلا (یعنی جماع) کرے تو غسل واجب ہو جاتا ہے،خواہ انزال نہ ہو:‘‘ متفق علیہ۔";
mishkaat.description = `[430] متفق علیہ، رواہ البخاري (291) و مسلم (87/ 348)`;