var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي بُرْدَةَ قَالَ: أَخْرَجَتْ إِلَيْنَا عَائِشَةُ كِسَاءً مُلَبَّدًا وَإِزَارًا غَلِيظًا فَقَالَتْ: قُبِضَ رُوحُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هذَيْن";
mishkaat.urdu = "ابوبُردہ ؓ بیان کرتے ہیں،عائشہ ؓ نے پیوند لگی ہوئی ایک چادر اور ایک موٹی تہبند ہمیں دکھائی اور فرمایا،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی ان دو کپڑوں میں روح قبض کی گئی۔متفق علیہ۔";
mishkaat.description = `[4306] متفق علیہ، رواہ البخاري (5818) و مسلم (35، 2080/34)`;