var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الْمَاءُ مِنَ الْمَاءِ» . رَوَاهُ مُسْلِمٌ\nقَالَ الشَّيْخُ الْإِمَامُ مُحْيِي السّنة C: هَذَا مَنْسُوخ";
mishkaat.urdu = "ابوسعید ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’پانی (غسل) پانی (منی کے نکلنے) سے ہے۔‘‘ رواہ مسلم۔الشیخ الامام محی السنہ ؒ نے فرمایا: یہ حدیث منسوخ ہے۔";
mishkaat.description = `[431] رواہ مسلم (81، 80/ 343)<br>٭ و انظر شرح السنۃ لمحیي السنۃ البغوي (2/ 6 بعد ح 243)`;