var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَيْنَمَا رَجُلٌ يَجُرُّ إِزَارَهُ مِنَ الْخُيَلَاءِ خُسِفَ بِهِ فَهُوَ يَتَجَلْجَلُ فِي الْأَرْضِ إِلى يومِ الْقِيَامَة» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس اثنا میں کہ ایک آدمی تکبر کے طور پر اپنا تہبند گھسیٹتا تھا،اس وجہ سے اسے زمین میں دھنسا دیا گیا،اور وہ روزِ قیامت تک زمین میں دھنستا چلا جائے گا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4313] رواہ البخاري (2484)`;