var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ وَأَنَسٍ وَابْنِ الزُّبَيْرِ وَأَبِي أُمَامَةَ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الْآخِرَة»";
mishkaat.urdu = "عمر،انس،ابن زبیر اور ابوامامہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص دنیا میں ریشم پہنتا ہے وہ اسے آخرت میں نہیں پہنے گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[4318] متفق علیہ، رواہ البخاري (5833) و مسلم (2069/11)`;