var mishkaat = {};
mishkaat.arabic = "وَعَنْ حُذَيْفَةَ قَالَ: نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَشْرَبَ فِي آنِيَةِ الْفِضَّةِ وَالذَّهَبِ وَأَنْ نَأْكُلَ فِيهَا وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَأَنْ نَجْلِسَ عَلَيْهِ";
mishkaat.urdu = "حذیفہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے سونے چاندی کے برتن میں کھانے پینے،ریشم اور دیباج (ریشم کی ایک قسم) پہننے اور اس پر بیٹھنے سے ہمیں منع فرمایا ہے۔متفق علیہ۔";
mishkaat.description = `[4321] متفق علیہ، رواہ البخاري (5837) و مسلم (2067/4)`;