var mishkaat = {};
mishkaat.arabic = "وَعَن أسماءَ بنت يزِيد قَالَتْ: كَانَ كُمُّ قَمِيصِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الرُّصْغِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
mishkaat.urdu = "اسماء بنت یزید ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی قمیص کے آستین کلائی اور ہاتھ کے درمیانے جوڑ تک تھے۔ترمذی،ابوداؤد،اور امام ترمذی نے فرمایا: یہ حدیث غریب ہے۔اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[4329] إسنادہ حسن، رواہ الترمذي (1765)`;