var mishkaat = {};
mishkaat.arabic = "وَعَن أبي كبشةَ قَالَ: كَانَ كِمَامُ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُطْحًا. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حديثٌ مُنكر";
mishkaat.urdu = "ابو کبشہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے صحابہ کی ٹوپیاں سروں کے ساتھ لگی ہوئیں تھیں (یعنی اوپر اٹھی ہوئی نہیں تھیں)۔ترمذی،اور انہوں نے فرمایا: یہ حدیث منکر ہے۔اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[4333] إسنادہ ضعیف، رواہ الترمذي (1782)<br>٭ أبو سعید عبد اللہ بن بسر: ضعیف .`;