var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةِ التِّرْمِذِيِّ وَالنَّسَائِيِّ عَنِ ابْنِ عُمَرَ فَقَالَتْ: إِذًا تَنْكَشِفُ أَقْدَامُهُنَّ قَالَ: «فَيُرْخِينَ ذِرَاعًا لَا يزدن عَلَيْهِ»";
mishkaat.urdu = "ترمذی اور نسائی کی ابن عمر ؓ سے مروی روایت میں ہے۔ام سلمہ ؓ نے عرض کیا: تب تو ان کے پاؤں نظر آئیں گے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ ایک ہاتھ (ازار) لٹکا لیں اور اس سے زیادہ نہیں۔اسنادہ صحیح،رواہ الترمذی و النسائی۔";
mishkaat.description = `[4335] إسنادہ صحیح، رواہ الترمذي (1731 وقال: حسن صحیح) و النسائي (209/8 ح 5338)`;