var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اعْتَمَّ سَدَلَ عِمَامَتَهُ بَيْنَ كَتِفَيْهِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم عمامہ باندھتے تو اپنے عمامے کا شملہ اپنے کندھوں کے درمیان لٹکا لیتے۔ترمذی،اور انہوں نے فرمایا: یہ حدیث حسن غریب ہے۔حسن،رواہ الترمذی۔";
mishkaat.description = `[4338] حسن، رواہ الترمذي (1736)`;