var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: عَمَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَدَلَهَا بَيْنَ يَدَيَّ وَمِنْ خَلْفِي. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "عبدالرحمٰن بن عوف ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے میرے سر پر دستار باندھی۔آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اس کے ایک کنارے کو آگے کی طرف اور دوسرے کنارے کو پیچھے کی طرف لٹکا دیا۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4339] إسنادہ ضعیف، رواہ أبو داود (4079)<br>٭ شیخ من أھل المدینۃ: مجھول، کما قال المنذري وغیرہ .`;