var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَبِسَ ثَوْبَ شهرةٍ منَ الدُّنْيَا أَلْبَسَهُ اللَّهُ ثَوْبَ مَذَلَّةٍ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَابْن مَاجَه";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص دنیا میں لباسِ شہرت پہنتا ہے تو اللہ تعالیٰ اسے روزِ قیامت لباسِ مذلت پہنائے گا۔‘‘ حسن،رواہ احمد و ابوداؤد و ابن ماجہ۔";
mishkaat.description = `[4346] حسن، رواہ أحمد (139/2 ح 6245) و أبو داود (4029) و ابن ماجہ (3606)`;