var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ يُحِبُّ أَنْ يُرَى أَثَرَ نِعْمَتِهِ على عَبده» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عمرو بن شعیب اپنے والد سے اور وہ اپنے دادا سے روایت کرتے ہیں،انہوں نے کہا،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا: بے شک اللہ پسند فرماتا ہے کہ اس بندے پر اس کی نعمت کا اثر دکھائی دے۔‘‘ صحیح،رواہ الترمذی۔";
mishkaat.description = `[4350] صحیح، رواہ الترمذي (2819 وقال: حسن)`;