var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْتَبٍ بِشَمْلَةٍ قَدْ وَقَعَ هُدْبها على قَدَمَيْهِ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،میں نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی خدمت میں حاضر ہوا تو آپ ایک چادر میں گوٹ مار کر بیٹھے ہوئے تھے،اور اس کے پھندنے آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے قدموں پر تھے۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4365] إسنادہ ضعیف، رواہ أبو داود (4075)<br>٭ عبیدۃ أبو خداش: مجھول .`;