var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ سَلَمَةَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ تَخْتَمِرُ فَقَالَ: «ليَّةً لَا ليَّتينِ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ام سلمہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ان کے پاس تشریف لائے تو وہ اوڑھنی اوڑھ رہی تھی،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ایک پھیر دو،دو کی ضرورت نہیں۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4367] إسنادہ ضعیف، رواہ أبو داود (4115)<br>٭ حبیب بن أبي ثابت مدلس و عنعن و وھب مولی أبي أحمد: مجھول .`;