var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم إِن أَتَخَتَّمَ فِي إِصْبَعِي هَذِهِ أَوْ هَذِهِ قَالَ: فَأَوْمَأَ إِلَى الْوُسْطَى وَالَّتِي تَلِيهَا. رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "علی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے منع فرمایا کہ میں اپنی اس یا اس انگلی میں انگوٹھی پہنوں۔آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے درمیانی اور اس کے ساتھ والی (انگشت شہادت) کی طرف اشارہ کیا۔رواہ مسلم۔";
mishkaat.description = `[4390] رواہ مسلم (65/ 2078)`;