var mishkaat = {};
mishkaat.arabic = "وَعَن مُعَاوِيَةُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ رُكُوبِ النُّمُورِ وَعَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ";
mishkaat.urdu = "معاویہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے چیتوں کی کھال پر سواری کرنے اور سونا پہننے سے منع فرمایا،ہاں البتہ ٹکڑوں کی شکل میں پہننے کی رخصت فرمائی۔صحیح،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[4395] صحیح، رواہ أبو داود (4239) و النسائي (161/8 ح 5152۔ 5154)`;