var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْفِطْرَةُ خَمْسٌ: الْخِتَانُ وَالِاسْتِحْدَادُ وَقَصُّ الشَّارِبِ وَتَقْلِيمُ الْأَظْفَارِ ونتفُ الإِبطِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’پانچ چیزیں فطرت سے ہیں،ختنہ کرنا،زیر ناف بال صاف کرنا،مونچھیں کترنا،ناخن تراشنا اور بغلوں کے بال اکھاڑنا۔‘‘ متفق علیہ۔";
mishkaat.description = `[4420] متفق علیہ، رواہ البخاري (5891) و مسلم (257/50)`;