var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خَالِفُوا الْمُشْرِكِينَ: أَوْفِرُوا اللِّحَى وَأَحْفُوا الشَّوَارِبَ . وَفِي رِوَايَةٍ: «أنهكوا الشَّوَارِب وأعفوا اللحى»";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مشرکوں کی مخالفت کرو،داڑھیاں بڑھاؤ اور مونچھیں کتراؤ۔‘‘ ایک دوسری روایت میں ہے:’’مونچھیں خوب کتراؤ اور داڑھیاں بڑھاؤ۔‘‘ متفق علیہ۔";
mishkaat.description = `[4421] متفق علیہ، رواہ البخاري (5893) و مسلم (258/52)`;