var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ رَأْسِهِ وَتُرِكَ بَعْضُهُ فَنَهَاهُمْ عَنْ ذَلِكَ وَقَالَ: «احْلِقُوا كُلَّهُ أَوِ اتْرُكُوا كُلَّهُ» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایک بچہ دیکھا جس کے سر کا کچھ حصہ مونڈ دیا گیا تھا اور کچھ چھوڑ دیا گیا تھا،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے انہیں اس سے منع کر دیا اور فرمایا:’’سارا (سر) مونڈو یا سارا چھوڑ دو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4427] رواہ مسلم (2120/112)`;