var mishkaat = {};
mishkaat.arabic = "وَعَنْ زَيْدِ بْنِ أَرْقَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَمْ يَأْخُذ شَارِبِهِ فَلَيْسَ مِنَّا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ";
mishkaat.urdu = "زید بن ارقم ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص اپنی مونچھیں نہیں کتراتا وہ ہم میں سے نہیں۔‘‘ صحیح رواہ احمد و الترمذی و النسائی۔";
mishkaat.description = `[4438] صحیح، رواہ أحمد (366/4 ح 19477) و الترمذي (2761 وقال: حسن صحیح) و النسائي (15/1 ح 13)`;