var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْبَلُ اللَّهُ صَلَاةَ رَجُلٍ فِي جَسَدِهِ شَيْءٌ مِنْ خَلُوقٍ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوموسی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ اس شخص کی،جس کے جسم پر خلوق (خوشبو کی ایک قسم) کا اثر ہو،نماز قبول نہیں کرتا۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4441] إسنادہ ضعیف، رواہ أبو داود (4178)<br>٭ فیہ زید و زیاد جدا الربیع: مجھولان .`;