var mishkaat = {};
mishkaat.arabic = "وَعَن عبد الله بن مغفَّل قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّرَجُّلِ إِلَّا غِبًّا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "عبداللہ بن مغفل ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے روزانہ بلا ناغہ کنگھی کرنے سے منع فرمایا ہے۔سندہ ضعیف،رواہ الترمذی و ابوداؤد و النسائی۔";
mishkaat.description = `[4448] سندہ ضعیف، رواہ الترمذي (1756 و قال: حسن صحیح) و أبو داود (4159) و النسائي (132/8 ح 5058)<br>٭ ھشام بن حسان مدلس و عنعن و حدیث النسائي (132/8 ح 5061 سندہ صحیح) یغني عنہ .`;