var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يتَوَضَّأ بعد الْغسْل. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں۔نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم غسل کے بعد وضو نہیں کیا کرتے تھے۔ضعیف۔";
mishkaat.description = `[445] سندہ ضعیف، رواہ أبو داود (250) و الترمذي (107) والنسائي (1/ 137 ح 253) و ابن ماجہ (579) [وصححہ الحاکم علٰی شرط الشیخین (1/ 153) ووافقہ الذہبي .]<br>٭ أبو إسحاق السبیعي مدلس و لم یصرح بالسماع في ھذا اللفظ .`;