var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ الشَّيْبُ الْحِنَّاءُ وَالْكَتَمُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ";
mishkaat.urdu = "ابوذر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سفید بالوں (بڑھاپے) کو بدلنے والی سب سے بہترین چیز مہندی اور وسمہ ہے۔‘‘ اسنادہ صحیح،رواہ الترمذی و ابوداؤد و النسائی۔";
mishkaat.description = `[4451] إسنادہ صحیح، رواہ الترمذي (1753 وقال: حسن صحیح) و أبو داود (4205) و النسائي (139/8 ح 5080۔ 5083)`;