var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَكَانَ لَهُ شَعْرٌ فَوْقَ الْجُمَّةِ وَدُونَ الوفرة. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں اور رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ایک برتن میں غسل کیا کرتے تھے،آپ کے بال کندھوں اور کانوں کی لو کے درمیان تھے۔اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[4460] إسنادہ حسن، رواہ الترمذي (1755 وقال: حسن غریب صحیح) و النسائي (128/1۔ 129 ح 234)`;