var mishkaat = {};
mishkaat.arabic = "وَعَن أنسٍ قَالَ: كَانَتْ لِي ذُؤَابَةٌ فَقَالَتْ لِي أُمِّي: لَا أَجُزُّهَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُدُّهَا وَيَأْخُذُهَا. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،میری پیشانی کے بال لمبے تھے،میری والدہ نے مجھے کہا: میں انہیں نہیں کاٹوں گی،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم انہیں کھینچتے اور پکڑا کرتے تھے۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4462] إسنادہ ضعیف، رواہ أبو داود (4196)<br>٭ فیہ میمون بن عبد اللہ: عن ثابت (وھو) مجھول و لعلہ میمون بن أبان: مستور أي مجھول الحال .`;