var mishkaat = {};
mishkaat.arabic = "وَعَن ابنِ عبَّاسٍ قَالَ: لُعِنَتِ الْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ وَالنَّامِصَةُ وَالْمُتَنَمِّصَةُ وَالْوَاشِمَةُ والمشتوشمة من غير دَاء. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں بیماری کے بغیر بالوں میں بال جوڑنے والی اور جڑوانے والی،بال نوچنے والی اور اکھڑوانے والی،بدن گودنے والی اور گدوانے والی پر لعنت کی گئی ہے۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4468] إسنادہ ضعیف، رواہ أبو داود (4170)<br>٭ عبد اللہ بن وھب مدلس و عنعن و لبعض الحدیث شواھد ضعیفۃ .`;