var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ: قِيلَ لِعَائِشَةَ: إِنَّ امْرَأَةً تَلْبَسُ النَّعْلَ قَالَتْ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَةَ مِنَ النِّسَاء. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن ابی ملیکہ ؒ بیان کرتے ہیں،عائشہ ؓ سے عرض کیا گیا،ایک عورت (مردوں جیسے) جوتے پہنتی ہے (اس کا کیا حکم ہے) انہوں نے فرمایا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مردوں سے مشابہت کرنے والی عورتوں پر لعنت فرمائی ہے۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4470] إسنادہ ضعیف، رواہ أبو داود (4099)`;