var mishkaat = {};
mishkaat.arabic = "وعنها أَنَّهَا كَانَت عَلَى سَهْوَةٍ لَهَا سِتْرًا فِيهِ تَمَاثِيلُ فَهَتَكَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاتَّخَذَتْ مِنْهُ نُمرُقتين فكانتا فِي الْبَيْت يجلسُ عَلَيْهِم";
mishkaat.urdu = "عائشہ ؓ سے روایت ہے کہ انہوں نے گھر کے دریچے پر پردہ لٹکا رکھا تھا جس پر تصویریں تھیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اسے پھاڑ ڈالا،اور میں نے اس سے دو تکیے بنا لیے جو کہ گھر میں تھے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ان پر بیٹھا کرتے تھے۔متفق علیہ۔";
mishkaat.description = `[4493] متفق علیہ، رواہ البخاري (2479) و مسلم (2107/94)`;