var mishkaat = {};
mishkaat.arabic = "وَعَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَشَدُّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُضَاهُونَ بِخلق الله»";
mishkaat.urdu = "عائشہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتی ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’روزِ قیامت ان لوگوں کو سب سے زیادہ سخت عذاب دیا جائے گا جو اللہ کی تخلیق میں اللہ سے مشابہت کرتے ہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[4495] متفق علیہ، رواہ البخاري (4954) و مسلم (2107/92)`;