var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْخَمْرِ وَالْمَيْسِرِ وَالْكُوبَةِ والغبيراء. الغبيراء: شَرَابٌ يَعْمَلُهُ الْحَبَشَةُ مِنَ الذُّرَةِ يُقَالُ لَهُ: السكركة. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے شراب،جوئے،طبل اور ’’غبیراء‘‘ سے منع فرمایا ہے،اور ’’غبیراء‘‘ شراب ہے جسے حبشی مکئی سے بنایا کرتے تھے،اور اسے سکرکہ بھی کہا جاتا ہے۔حسن،رواہ ابوداؤد۔";
mishkaat.description = `[4504] حسن، رواہ أبو داود (3685)`;