var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد";
mishkaat.urdu = "ابوموسیٰ اشعری ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے نردشیر کھیلی اس نے اللہ اور اس کے رسول کی نافرمانی کی۔‘‘ سندہ ضعیف،رواہ احمد و ابوداؤد۔";
mishkaat.description = `[4505] سندہ ضعیف، رواہ أحمد (394/4) و أبو داود (4938)<br>٭ سعید بن أبي ھند ثقۃ أرسل عن أبي موسی رضي اللہ عنہ، و حدیث مسلم (2260) یغني عنہ .`;