var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الشِّفَاءُ فِي ثَلَاثٍ: فِي شَرْطَةِ مِحْجَمٍ أَوْ شَرْبَةِ عَسَلٍ أَوْ كَيَّةٍ بِنَارٍ وَأَنَا أَنْهَى أُمَّتِي عَنِ الْكَيِّ . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’شفا تین چیزوں میں ہے: پچھنے لگوانے میں یا شہد پینے میں یا آگ سے داغنے سے،اور میں اپنی امت کو داغنے سے منع کرتا ہوں۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4516] رواہ البخاري (5680)`;