var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: رُمِيَ سَعْدُ بْنُ مُعَاذٍ فِي أكحله فحمسه النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ بِمِشْقَصٍ ثمَّ ورمت فحمسه الثَّانِيَة. رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،سعد بن معاذ ؓ کو رگ ہفت اندام میں تیر لگا تو نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنے دست مبارک سے تیر کے پیکان کے ساتھ اسے داغ دیا،پھر اس پر ورم آ گیا تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے دوسری مرتبہ اسے داغ دیا۔رواہ مسلم۔";
mishkaat.description = `[4518] رواہ مسلم (2208/75)`;