var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُعَذِّبُوا صِبْيَانَكُمْ بِالْغَمْزِ مِنَ الْعُذْرَةِ عَلَيْكُمْ بِالْقُسْطِ»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عذرہ (ایک ورم ہے جو بچہ کے حلق میں کثرت خون کی وجہ سے ہو جاتا ہے) کی وجہ سے اپنے بچوں کے گلے دبا کر انہیں تکلیف نہ پہنچاؤ،بلکہ تم قسط استعمال کرو۔‘‘ متفق علیہ۔";
mishkaat.description = `[4523] متفق علیہ، رواہ البخاري (5696) و مسلم (1577/63)`;