var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي بَيْتِهَا جَارِيَةً فِي وجهِها سفعة يَعْنِي صُفْرَةً فَقَالَ: «اسْتَرْقُوا لَهَا فَإِنَّ بِهَا النَّظْرَةَ»";
mishkaat.urdu = "ام سلمہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اس کے گھر میں ایک لڑکی دیکھی جس کے چہرے پر زردی تھی،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اسے دم کراؤ کیونکہ اسے نظر لگی ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4528] متفق علیہ، رواہ البخاري (5738) ومسلم (2197/59)`;