var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعَيْنُ حَقٌّ فَلَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرِ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فاغسِلوا» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابن عباس ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’نظر (کی تاثیر) ثابت ہے،اگر کوئی چیز تقدیر پر سبقت لے جانے والی ہوتی تو نظر اس پر سبقت لے جاتی اور جب تم سے غسل کا مطالبہ کیا جائے تو غسل کرو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4531] رواہ مسلم (2188/42)`;