var mishkaat = {};
mishkaat.arabic = "وَعَن زيد بن أَرقم قَالَ: أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَدَاوَى مِنْ ذَاتِ الْجَنْبِ بِالْقُسْطِ البحريِّ وَالزَّيْت. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "زید بن ارقم ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہمیں حکم فرمایا کہ ہم قسط بحری اور زیتون سے نمونیہ کا علاج کریں۔اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[4535] إسنادہ ضعیف، رواہ الترمذي (2079 وقال: حسن صحیح)<br>٭ فیہ میمون أبو عبد اللہ: ضعیف .`;