var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الدَّوَاءِ الْخَبِيثِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے حرام چیز کو بطور دوا استعمال کرنے سے بھی منع فرمایا ہے۔اسنادہ صحیح،رواہ احمد و ابوداؤد و الترمذی و ابن ماجہ۔";
mishkaat.description = `[4539] إسنادہ صحیح، رواہ أحمد (305/2) و أبو داود (3870) و الترمذي (2045) و ابن ماجہ (3459)`;