var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْ بَينهمَا وضُوءًا» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی اپنی اہلیہ سے جماع کرے اور پھر وہ دوبارہ جماع کرنا چاہے تو وہ ان دونوں کے درمیان وضو کر لے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[454] رواہ مسلم (27/ 308)`;