var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ: إِنَّ طَبِيبًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضِفْدَعٍ يَجْعَلُهَا فِي دَوَاءٍ فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عبد الرحمن بن عثمان ؓ سے روایت ہے کہ ایک طبیب نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے مینڈک کو دوائی میں ڈالنے کے متعلق دریافت کیا تو نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اسے اس کے قتل کرنے سے منع فرما دیا۔اسنادہ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[4545] إسنادہ صحیح، رواہ أبو داود (3871)`;