var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَحِبُّ الْحِجَامَةَ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ. رَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم (چاند کی) سترہ،انیس اور اکیس تاریخ کو پچھنے لگانا پسند فرماتے تھے۔اسنادہ ضعیف،رواہ فی شرح السنہ۔";
mishkaat.description = `[4547] إسنادہ ضعیف، رواہ البغوي في شرح السنۃ (150/12 ح 3235) [والترمذي (2052 بلفظ آخر) والحاکم (409/4)]<br>٭ فیہ عباد بن منصور ضعیف .`;