var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ احْتَجَمَ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ كَانَ شِفَاءً لَهُ مِنْ كُلِّ دَاء» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص (چاند کی) سترہ،انیس اور اکیس تاریخ کو پچھنے لگوائے وہ ہر بیماری سے محفوظ رہے گا۔‘‘ اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[4548] إسنادہ حسن، رواہ أبو داود (3861)`;