var mishkaat = {};
mishkaat.arabic = "وَعَن عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد";
mishkaat.urdu = "عمران بن حصین ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’نظر لگ جانے یا کسی کے ڈسنے سے دم کرنا جائز ہے۔‘‘ صحیح،رواہ احمد و الترمذی و ابوداؤد۔";
mishkaat.description = `[4557] صحیح، رواہ أحمد (436/4) و الترمذي (2057) و أبو داود (3884)`;