var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ أَوْ دَمٍ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’نظر لگ جانے یا کسی چیز کے ڈس لینے یا نکسیر جاری ہونے پر دم کرنا درست ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4559] إسنادہ ضعیف، رواہ أبو داود (3889)<br>٭ شریک القاضی مدلس و عنعن و للحدیث شاھد ضعیف عند ابن أبي شیبۃ (393/7)`;