var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ اللَّهَ عَزَّ وَجَلَّ عَلَى كُلِّ أَحْيَانِهِ. رَوَاهُ مُسْلِمٌ\nوَحَدِيثُ ابْنِ عَبَّاسٍ سَنَذْكُرُهُ فِي كِتَابِ الْأَطْعِمَةِ إِنْ شَاءَ اللَّهُ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہر حالت میں اللہ عزوجل کا ذکر کیا کرتے تھے۔رواہ مسلم۔اور ابن عباس ؓ سے مروی حدیث ہم ان شاء اللہ تعالیٰ،کتاب الاطعمہ میں ذکر کریں گے۔";
mishkaat.description = `[456] رواہ مسلم (117 / 373)<br>حدیث ابن عباس، یأتي (4209)`;