var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَعِقَ الْعَسَلَ ثَلَاثَ غَدَوَاتٍ فِي كلِّ شهر لم يصبهُ عَظِيم الْبلَاء»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص ہر ماہ تین روز شہد چاٹتا ہے تو اسے کوئی بڑی بیماری لاحق نہیں ہوتی۔‘‘ اسنادہ ضعیف،رواہ ابن ماجہ و البیھقی فی شعب الایمان۔";
mishkaat.description = `[4570] إسنادہ ضعیف، رواہ ابن ماجہ (3450) و البیھقي في شعب الإیمان (5938)<br>٭ الزبیر بن سعید: لین الحدیث و عبد الحمید: مجھول .`;