var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى وَلَا طِيَرَةَ وَلَا هَامة وَلَا صقر وفر الْمَجْذُومِ كَمَا تَفِرُّ مِنَ الْأَسَدِ» . رَوَاهُ الْبُخَارِيُّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’نہ کوئی بیماری متعدی ہے اور نہ کوئی بدشگونی ہے۔اور الّو منحوس ہے اور نہ ماہ صفر،اور مجذوم سے ایسے بھاگو جیسے تو شیر سے بھاگتا ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4577] رواہ البخاري (5707)`;