var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَ: كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّا قد بايعناك فَارْجِع» . رَوَاهُ مُسلم";
mishkaat.urdu = "عمرو بن شرید اپنے والد سے روایت کرتے ہیں،انہوں نے کہا: وفدِ ثقیف میں ایک مجذوم شخص تھا،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اس کی طرف پیغام بھیجا کہ ’’تیری بیعت ہو گئی ہے لہذا تم واپس چلے جاؤ۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4581] رواہ مسلم (126/ 2231)`;