var mishkaat = {};
mishkaat.arabic = "وَعَن قَطن بن قَبيصةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعِيَافَةُ وَالطَّرْقُ وَالطِّيَرَةُ مِنَ الْجِبْتِ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "قطن بن قبیصہ ؓ اپنے والد سے روایت کرتے ہیں کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’پرندوں کے ذریعے فال لینا،لکیریں کھینچ کر فال لینا اور بدشگونی لینا جادو کی اقسام ہیں۔‘‘ سندہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4583] سندہ ضعیف، رواہ أبو داود (3907)<br>٭ حیان بن العلاء مجھول و ثقہ ابن حبان وحدہ .`;