var mishkaat = {};
mishkaat.arabic = "وَعَن الربيعِ مِثْلُهُ وَزَادَ: وَاللَّهِ مَا جَعَلَ اللَّهُ فِي نَجْمٍ حَيَاةَ أَحَدٍ وَلَا رِزْقَهُ وَلَا مَوْتَهُ وَإِنَّمَا يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ وَيَتَعَلَّلُونَ بِالنُّجُومِ";
mishkaat.urdu = "ربیع سے بھی اسی طرح مروی ہے،نیز انہوں نے یہ اضافہ نقل کیا ہے،اللہ کی قسم! اللہ نے کسی ستارے میں نہ تو کسی کی زندگی رکھی ہے اور نہ اس کا رزق رکھا ہے اور نہ اس کی موت رکھی ہے،وہ تو اللہ پر جھوٹ باندھتے ہیں اور ستاروں کا فقط بہانہ بناتے ہیں۔لم اجدہ،رواہ رزین۔";
mishkaat.description = `[4603] لم أجدہ، رواہ رزین (لم أجدہ)`;