var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَمْ يَبْقَ مِنَ النُّبُوَّةِ إِلَّا الْمُبَشِّرَاتُ» قَالُوا: وَمَا الْمُبَشِّرَاتُ؟ قَالَ: «الرُّؤْيَا الصالحةُ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’نبوت میں صرف ’’مبشرات‘‘ باقی رہ گئے ہیں۔‘‘ صحابہ ؓ نے عرض کیا: مبشرات سے کیا مراد ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اچھے خواب۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4606] رواہ البخاري (6990)`;