var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقْرَأُ الْحَائِضُ وَلَا الْجُنُبُ شَيْئًا مِنَ الْقُرْآنِ» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’حائضہ اور جنبی شخص قرآن سے کچھ نہ پڑھیں۔‘‘ ضعیف۔";
mishkaat.description = `[461] إسنادہ ضعیف، رواہ الترمذي (131، و نقل عن البخاري قال: إن إسماعیل بن عیاش یروي عن أھل الحجاز و أھل العراق أحادیث مناکیر.) [وابن ماجہ: 595]<br>٭ روایات إسماعیل بن عیاش عن الحجازیین ضعیفۃ و ھذہ منھا .`;