var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من رَآنِي فِي الْمَنَام فيسراني فِي الْيَقَظَةِ وَلَا يَتَمَثَّلُ الشَّيْطَانُ بِي»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس نے مجھے خواب میں دیکھا تو وہ مجھے عنقریب حالت بیداری میں بھی دیکھے گا اور شیطان میری صورت اختیار نہیں کر سکتا۔‘‘ متفق علیہ۔";
mishkaat.description = `[4611] متفق علیہ، رواہ البخاري (6993) و مسلم (2266/11)`;