var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ» . رَوَاهُ التِّرْمِذِيّ والدارمي\nنِهَايَة الْجُزْء الثَّانِي";
mishkaat.urdu = "ابوسعید ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سحری (یعنی پچھلی رات کے) وقت کا خواب سچ ہونے میں قریب تر ہے۔‘‘ اسنادہ ضعیف،رواہ الترمذی و الدارمی۔";
mishkaat.description = `[4627] إسنادہ ضعیف، رواہ الترمذي (2274) و الدارمي (125/2ح 2159)`;