var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو: أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الْإِسْلَامِ خَيْرٌ؟ قَالَ: «تُطْعِمُ الطَّعَامَ وَتَقْرَأُ السَّلَامَ عَلَى مَنْ عَرَفْتَ وَمَنْ لم تعرف»";
mishkaat.urdu = "عبداللہ بن عمرو ؓ سے روایت ہے کہ ایک آدمی نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے دریافت کیا،کون سا (آداب) اسلام بہتر ہے؟ فرمایا:’’(یہ کہ) تم کھانا کھلاؤ اور تم جسے جانتے ہو اسے بھی اور جسے نہیں جانتے اسے بھی سلام کرو۔‘‘ متفق علیہ۔";
mishkaat.description = `[4629] متفق علیہ، رواہ البخاري (6236) و مسلم (39/63)`;