var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «لَا تبدؤوا الْيَهُودَ وَلَا النَّصَارَى بِالسَّلَامِ وَإِذَا لَقِيتُمْ أَحَدَهُمْ فِي طريقٍ فَاضْطَرُّوهُ إِلَى أضيَقِه»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یہود و نصاریٰ کو سلام کرنے میں پہل نہ کرو،اور جب تم ان میں سے کسی کو راستے میں ملو تو انہیں راستے کے ایک طرف چلنے پر مجبور کر دو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4635] رواہ مسلم (2167/13)`;