var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا سَلَّمَ عَلَيْكُمُ الْيَهُودُ فَإِنَّمَا يَقُولُ أَحَدُهُمْ: السَّامُ عَلَيْك. فَقل: وَعَلَيْك";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب یہودی تمہیں سلام کرتے ہیں تو ان میں سے ایک تمہیں یہی کہتا ہے: السام علیک (تم پر موت واقع ہو) لہذا تم انہیں یہ جواب دو: وعلیک (تم پر ہو)۔‘‘ متفق علیہ۔";
mishkaat.description = `[4636] متفق علیہ، رواہ البخاري (6257) و مسلم (2164/8)`;