var mishkaat = {};
mishkaat.arabic = "وَعَن أُسامة بن زيد: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِمَجْلِسٍ فِيهِ أَخْلَاطٌ مِنَ الْمُسْلِمِينَ وَالْمُشْرِكِينَ عَبَدَةِ الْأَوْثَانِ وَالْيَهُودِ فَسَلَّمَ عَلَيْهِمْ";
mishkaat.urdu = "اسامہ بن زید ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کا ایک ایسی مجلس سے گزر ہوا جس میں مسلمان،بتوں کے پجاری مشرک اور یہودی بیٹھے ہوئے تھے،تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے انہیں سلام کیا۔متفق علیہ۔";
mishkaat.description = `[4639] متفق علیہ، رواہ البخاري (2654) و مسلم (116/ 1798)`;