var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي\nهُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ الْقِصَّةِ قَالَ: «وَإِرْشَادُ السَّبِيلِ» . رَوَاهُ أَبُو دَاوُدَ عَقِيبَ حَدِيثِ الْخُدْرِيِّ هَكَذَا";
mishkaat.urdu = "ابوہریرہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے اس (حدیث سابق میں مذکورہ) قصے کے متعلق روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اور راستہ بتانا۔‘‘ امام ابوداؤد نے ابوسعید خدری ؓ سے مروی حدیث کے بعد اسی طرح روایت کیا ہے۔اسنادہ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[4641] إسنادہ حسن، رواہ أبو داود (4816)`;