var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَوْلَى النَّاسِ بِاللَّهِ مَنْ بَدَأَ السَّلَام» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد";
mishkaat.urdu = "ابوامامہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سلام میں پہل کرنے والا شخص اللہ کا سب سے زیادہ قریبی ہے۔‘‘ صحیح،رواہ احمد و الترمذی و ابوداؤد۔";
mishkaat.description = `[4646] صحیح، رواہ أحمد (254/5 ح 22545) و الترمذي (2694 وقال: حسن) و أبو داود (5197)`;