var mishkaat = {};
mishkaat.arabic = "وَعَن أبي\nالْعَلَاء بن الْحَضْرَمِيّ أَنَّ الْعَلَاءَ الْحَضْرَمِيَّ كَانَ عَامِلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ إِذَا كَتَبَ إِليه بدأَ بنفسِه. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوالعلاء بن حضرمی سے روایت ہے کہ علاء حضرمی ؓ،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے (مقرر کردہ بحرین کے) حکمران تھے،اور جب وہ آپ کی طرف خط لکھتے تو اپنے نام (از طرف علاء) سے شروع کیا کرتے تھے۔اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4656] إسنادہ ضعیف، رواہ أبو داود (5134)<br>٭ بعض ولد العلاء (ابن العلاء) مجھول .`;