var mishkaat = {};
mishkaat.arabic = "وَعَن أسماءَ\nبنت يزيدَ قَالَتْ: مَرَّ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ فَسَلَّمَ عَلَيْنَا. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه والدارمي";
mishkaat.urdu = "اسماء بنت یزید ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہماری خواتین کی جماعت کے پاس سے گزرے تو آپ نے ہمیں سلام کیا۔اسنادہ حسن،رواہ ابوداؤد و ابن ماجہ و الدارمی۔";
mishkaat.description = `[4663] إسنادہ حسن، رواہ أبو داود (5204) و ابن ماجہ (3701) و الدارمي (277/2 ح 2640)`;