var mishkaat = {};
mishkaat.arabic = "وَعَن عَبْدِ\nاللَّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَادِئُ بِالسَّلَامِ بَرِيءٌ مِنَ الْكِبْرِ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شعب الْإِيمَان»";
mishkaat.urdu = "عبداللہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سلام میں پہل کرنے والا تکبر سے بری ہوتا ہے۔‘‘ اسنادہ ضعیف،رواہ البیھقی فی شعب الایمان۔";
mishkaat.description = `[4666] إسنادہ ضعیف، رواہ البیھقي في شعب الإیمان (8786، نسخۃ محققۃ: 8407)<br>٭ سفیان الثوري و أبو إسحاق السبیعي مدلسان و عنعنا .`;