var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذْنُكَ عَلَيَّ أَنْ تَرْفَعَ الْحِجَابَ وَأَنْ تَسْمَعَ سِوَادِي حَتَّى أَنهَاك»";
mishkaat.urdu = "عبداللہ بن مسعود ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے فرمایا:’’تمہارا مجھ سے اجازت لینا یہی ہے کہ تم پردہ اٹھاؤ اور تم میری پوشیدہ باتیں سن لو (تو آ جاؤ) جب تک میں تجھے ایسے کرنے سے منع نہ کر دوں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4668] رواہ مسلم (2169/16)`;