var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُقِيمُ الرَّجُلُ الرَّجُلَ مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُوا» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کوئی آدمی کسی آدمی کو اس کی جگہ سے اٹھا کر وہاں مت بیٹھے،بلکہ وسعت و کشادگی پیدا کرو۔‘‘ متفق علیہ۔";
mishkaat.description = `[4696] متفق علیہ، رواہ البخاري (6269) و مسلم (2177/27)`;