var mishkaat = {};
mishkaat.arabic = "وَعَن مُعَاوِيَة قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَرَّهُ أَنْ يَتَمَثَّلَ لَهُ الرِّجَالُ قِيَامًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد";
mishkaat.urdu = "معاویہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص کو یہ پسند ہو کہ لوگ اس کے سامنے کھڑے رہیں تو وہ اپنا ٹھکانا جہنم میں بنا لے۔‘‘ حسن،رواہ الترمذی و ابوداؤد۔";
mishkaat.description = `[4699] حسن، رواہ الترمذي (2755 وقال: حسن) و أبو داود (5229)`;