var mishkaat = {};
mishkaat.arabic = "وَعَن عبَّادِ بن تَمِيم عَنْ عَمِّهِ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ مُسْتَلْقِيًا وَاضِعًا إِحْدَى قدمَيه على الْأُخْرَى. مُتَّفق عَلَيْهِ";
mishkaat.urdu = "عبادہ بن تمیم اپنے چچا سے روایت کرتے ہیں،انہوں نے کہا: میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو مسجد میں چت لیٹے ہوئے دیکھا،آپ نے اپنا ایک پاؤں دوسرے پر رکھا ہوا تھا۔متفق علیہ۔";
mishkaat.description = `[4708] متفق علیہ، رواہ البخاري (6287) و مسلم (2100/75)`;