var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ فِي الْمَسْجِد احتبى بيدَيْهِ. رَوَاهُ رزين";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم مسجد میں بیٹھتے تو آپ اپنے ہاتھوں سے گوٹ مار لیتے تھے۔ضعیف جذا،رواہ رزین۔";
mishkaat.description = `[4713] ضعیف جدًا، رزین (لم أجدہ) [وأبو داود (4846) و الترمذي فی الشمائل (128) واللفظ لہ، فیہ عبد اللہ بن إبراہیم المدني: منکر الحدیث متروک متھم و حدیث البخاري (6272) یغني عنہ، تقدم (4707)]`;