var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الْفَجْرَ تَرَبَّعَ فِي مَجْلِسِهِ حَتَّى تطلع الشَّمْس حسناء. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم فجر کی نماز پڑھتے تو سورج کے اچھی طرح طلوع ہو جانے تک آلتی پالتی مار کر (چار زانوں ہو کر) اپنی جگہ پر بیٹھے رہتے۔صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[4715] صحیح، رواہ أبو داود (4850)`;