var mishkaat = {};
mishkaat.arabic = "وَعَن\nأبي هريرةَ قَالَ: رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مُضْطَجِعًا عَلَى بَطْنِهِ فَقَالَ: «إِنَّ هَذِهِ ضِجْعَةٌ لَا يُحِبُّهَا اللَّهُ» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ایک آدمی کو مسجد میں پیٹ کے بل لیٹے ہوئے دیکھا تو فرمایا:’’اس طرح لیٹنے کو اللہ پسند نہیں فرماتا۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[4718] إسنادہ حسن، رواہ الترمذي (2768)`;