var mishkaat = {};
mishkaat.arabic = "وَعَن\nحذيفةَ قَالَ: مَلْعُونٌ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَعَدَ وَسْطَ الْحَلْقَةِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد";
mishkaat.urdu = "حذیفہ ؓ بیان کرتے ہیں،جو شخص مجلس کے وسط میں بیٹھتا ہے وہ محمد صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی زبان پر ملعون ہے۔اسنادہ ضعیف،رواہ الترمذی و ابوداؤد۔";
mishkaat.description = `[4722] إسنادہ ضعیف، رواہ الترمذي (2753 وقال: حسن صحیح) و أبو داود (4826)<br>٭ أبو مجلز لم یدرک حذیفۃ رضي اللہ عنہ کما قال شعبۃ، انظر جامع التحصیل (ص 296) وغیرہ .`;