var mishkaat = {};
mishkaat.arabic = "وَعَن\nجَابر بن سَمُرَة قَالَ: جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ جُلُوسٌ فَقَالَ: «مَا لِي أَرَاكُمْ عِزينَ؟» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم تشریف لائے تو آپ کے صحابہ کرام ؓ بیٹھے ہوئے تھے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کیا وجہ ہے کہ میں تمہیں الگ الگ (بیٹھے ہوئے) دیکھ رہا ہوں؟‘‘ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[4724] صحیح، رواہ أبو داود (4823)`;