var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا كَانَ أَحَدُكُمْ فِي الْفَيْء فقلص الظِّلُّ فَصَارَ بَعْضُهُ فِي الشَّمْسِ وَبَعْضُهُ فِي الظل فَليقمْ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی سائے میں ہو،پھر وہ (سایہ) اس سے بلند ہو جائے اور اس شخص کا کچھ حصہ دھوپ میں ہو جائے اور کچھ سائے میں تو وہ (وہاں سے) اٹھ جائے۔‘‘ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[4725] حسن، رواہ أبو داود (4821)`;