var mishkaat = {};
mishkaat.arabic = "وَعَن أبي\nذرِّ قَالَ: مرَّ بِي النبيُّ وَأَنَا مُضْطَجِعٌ عَلَى بَطْنِي فَرَكَضَنِي بِرِجْلِهِ وَقَالَ: «يَا جُنْدُبُ إِنَّمَا هِيَ ضِجْعَةُ أَهْلِ النَّارِ» . رَوَاهُ ابنُ مَاجَه";
mishkaat.urdu = "ابوذر ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم میرے پاس سے گزرے جبکہ میں اپنے پیٹ کے بل لیٹا ہوا تھا۔آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنے پاؤں سے مجھے چونکا مارا اور فرمایا:’’جندب! یہ تو جہنمیوں کا سا لیٹنا ہے۔‘‘ صحیح،رواہ ابن ماجہ۔";
mishkaat.description = `[4731] صحیح، رواہ ابن ماجہ (3724)`;