var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مُوسَى قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا عَطَسَ أَحَدُكُمْ فَحَمِدَ اللَّهَ فَشَمِّتُوهُ وَإِنْ لَمْ يَحْمَدِ اللَّهَ فَلَا تُشَمِّتُوهُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوموسی ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جب تم میں سے کوئی چھینک مارے اور ’’الحمد للہ‘‘ کہے تو تم اسے دعا دو۔اور اگر وہ ’’الحمد للہ‘‘ نہ کہے تو تم اس کے لیے دعا نہ کرو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4735] رواہ مسلم (2992/54)`;