var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ\n: «إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَمْسِكْ بِيَدِهِ عَلَى فَمه فإِنَّ الشيطانَ يدخلُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوسعید خدری ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کسی کو جمائی آئے تو وہ اپنا ہاتھ اپنے منہ پر رکھے کیونکہ شیطان (منہ میں) داخل ہو جاتا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4737] رواہ مسلم (2995/57)`;