var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «سموا باسمي وَلَا تكنوا بِكُنْيَتِي فَإِنِّي إِنَّمَا جُعِلْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ» مُتَّفق عَلَيْهِ";
mishkaat.urdu = "جابر ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میرے نام پر نام رکھو اور میری کنیت پر کنیت مت رکھو،کیونکہ مجھے تو قاسم بنایا گیا ہے،میں تمہارے مابین تقسیم کرتا ہوں۔‘‘ متفق علیہ۔";
mishkaat.description = `[4751] متفق علیہ، رواہ البخاري (3114) و مسلم (2133/4)`;