var mishkaat = {};
mishkaat.arabic = "وَعَن ابنِ عبَّاسٍ قَالَ: كَانَتْ جُوَيْرِيَةُ اسْمُهَا بَرَّةُ فَحَوَّلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمَهَا جُوَيْرِيَةَ وَكَانَ يَكْرَهُ أَنْ يُقَالَ: خَرَجَ مِنْ عِنْدِ برة. رَوَاهُ مُسلم";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،جویریہ ؓ کا نام برہ تھا،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ان کا نام بدل کر جویریہ رکھ دیا،اور آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ناپسند کرتے تھے کے یوں کہا جائے: وہ برہ کے پاس سے چلے گئے ہیں۔رواہ مسلم۔";
mishkaat.description = `[4757] رواہ مسلم (2140/16)`;