var mishkaat = {};
mishkaat.arabic = "وَقَالَ:\nوَغَيَّرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْم الْعَاصِ وعزير وَعَتَلَةَ وَشَيْطَانٍ وَالْحَكَمِ وَغُرَابٍ وَحُبَابٍ وَشِهَابٍ وَقَالَ: تركت أسانيدها للاختصار";
mishkaat.urdu = "اور ابوداؤد نے کہا،اور نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے عاص،عزیز،عتلہ،شیطان،حکم،غراب،حباب اور شہاب نام بدل دیے تھے،اور انہوں نے کہا: میں نے اختصار کی خاطر ان کی اسناد بیان نہیں کیں۔صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[4776] صحیح، رواہ أبو داود (4956)`;