var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nحُذَيْفَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُولُوا: مَا شَاءَ اللَّهُ وَشَاءَ فُلَانٌ وَلَكِنْ قُولُوا: مَا شَاءَ اللَّهُ ثُمَّ شَاءَ فلَان . رَوَاهُ أَحْمد وَأَبُو دَاوُد";
mishkaat.urdu = "حذیفہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یوں نہ کہا کرو: جو اللہ چاہے اور فلاں چاہے،بلکہ یوں کہو: جو اللہ چاہے،پھر فلاں چاہے۔‘‘ اسنادہ صحیح،رواہ احمد و ابوداؤد۔";
mishkaat.description = `[4778] إسنادہ صحیح، رواہ أحمد (384/5 ح 23654) و أبو داود (4980)`;