var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أُصَدِّقُ كَلِمَةٍ قَالَهَا الشَّاعِرُ كَلِمَةُ لَبِيدٍ: أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلُ . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سب سے زیادہ درست بات جو کسی شاعر نے کہی وہ لبید شاعر کی یہ بات ہے: سن لو! اللہ کے سوا ہر چیز فانی ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4786] متفق علیہ، رواہ البخاري (6147) و مسلم (2256/3)`;