var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِأَنَّ يمتلىءَ جَوْفُ رَجُلٍ قَيْحًا يَرِيهِ خَيْرٌ مِنْ أَنْ يمتلئ شعرًا» مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کسی آدمی کے پیٹ کا پیپ سے بھر کر خراب ہو جانا،اس سے بہتر ہے کہ اس کا پیٹ (مذموم) اشعار سے بھر جائے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4794] متفق علیہ، رواہ البخاري (6155) و مسلم (2257/7)`;