var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي\nأُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْحَيَاءُ وَالْعِيُّ شُعْبَتَانِ مِنَ الْإِيمَانِ وَالْبَذَاءُ وَالْبَيَانُ شُعْبَتَانِ مِنَ النِّفَاقِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوامامہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’حیا اور کم گوئی ایمان کی شاخیں ہیں،جبکہ فحش گوئی اور بیان (مبالغہ آرائی) نفاق کی دو شاخیں ہیں۔‘‘ اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[4796] إسنادہ صحیح، رواہ الترمذي (2027 وقال: حسن غریب)`;