var mishkaat = {};
mishkaat.arabic = "وَرَوَى التِّرْمِذِيُّ\nنَحْوَهُ عَنْ جَابِرٍ وَفِي رِوَايَتِهِ قَالُوا: يَا رَسُول الله قد علمنَا الثرثارونَ والمتشدقون فَمَا المتفيقهون؟ قَالَ: «المتكبرون»";
mishkaat.urdu = "امام ترمذی نے جابر ؓ سے اسی طرح روایت کیا ہے،ان کی روایت میں ہے،صحابہ کرام ؓ نے عرض کیا: اللہ کے رسول! ہم باتونی اور منہ پھٹ شخص کے متعلق تو جانتے ہیں،لیکن ’’المتفیھقون‘‘ سے مراد کون ہیں؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تکبر کرنے والے۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[4798] إسنادہ حسن، رواہ الترمذي (2018 وقال: حسن غریب)`;