var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَرْمِي رَجُلٌ رَجُلًا بِالْفُسُوقِ وَلَا يَرْمِيهِ بِالْكُفْرِ إِلَّا ارْتَدَّتْ عَلَيْهِ إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ» رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوذر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر کوئی شخص کسی شخص کو فاسق یا کافر کہہ کر پکارتا ہے اور اگر وہ شخص (جسے پکارا جا رہا ہے) ایسے نہ ہو تو پھر وہ (بات) اس (کہنے والے) پر لوٹ آتی ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4816] رواہ البخاري (6045)`;