var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ دَعَا رَجُلًا بِالْكُفْرِ أَوْ قَالَ: عَدُوَّ اللَّهِ وَلَيْسَ كَذَلِكَ إِلاَّ حارَ عليهِ . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوذر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے کسی شخص کو کافر کہہ کر پکارا یا کہا: اللہ کے دشمن! جبکہ وہ ایسے نہ ہو تو وہ بات اس (کہنے والے) پر لوٹ آتی ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4817] متفق علیہ، رواہ البخاري (6044) و مسلم (61/112)`;