var mishkaat = {};
mishkaat.arabic = "وَعَن أنس وَأَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُسْتَبَّانِ مَا قَالَا فَعَلَى الْبَادِئِ مالم يعْتد الْمَظْلُوم» . رَوَاهُ مُسلم";
mishkaat.urdu = "انس اور ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’باہم گالی گلوچ کرنے والے دو افراد میں سے اس وقت تک گنہگار وہ ہے جو پہلے گالی دیتا ہے جب تک مظلوم ایک کے بدلے میں دو گالیاں نہ دے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4818] رواہ مسلم (2587/68)`;