var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ: قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَجِدُونَ شَرَّ النَّاسِ يَوْمَ الْقِيَامَةِ ذَا الْوَجْهَيْنِ الَّذِي يَأْتِي هَؤُلَاءِ بوجهٍ وَهَؤُلَاء بوجهٍ» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم قیامت کے روز سب سے بدترین اس شخص کو پاؤ گے جو دوغلا ہے،اِدھر لوگوں سے کچھ بات کرتا ہے اور اُدھر لوگوں سے کچھ بات کرتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4822] متفق علیہ، رواہ البخاري (6058) و مسلم (2526/100)`;