var mishkaat = {};
mishkaat.arabic = "وَعَنْ حُذَيْفَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَدْخُلُ الْجَنَّةَ قَتَّاتٌ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةِ مُسْلِمٍ: «نَمَّامٌ»";
mishkaat.urdu = "حذیفہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’چغل خور جنت میں نہیں جائے گا۔‘‘ اور مسلم کی روایت میں نَمَّامٌ ’’چغل خور‘‘ کا لفظ ہے۔متفق علیہ۔";
mishkaat.description = `[4823] متفق علیہ، رواہ البخاري (6056) و مسلم (169، 105/168)`;