var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ كُلْثُومٍ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَيْسَ الْكَذَّابُ الَّذِي يُصْلِحُ بَيْنَ النَّاسِ وَيَقُولُ خيرا وينمي خيرا» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ام کلثوم ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’لوگوں کے درمیان صلح کرانے والا شخص جھوٹا نہیں،وہ خیر و بھلائی کی بات کرتا ہے اور خیر و بھلائی کی بات ہی آگے پہنچاتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4825] متفق علیہ، رواہ البخاري (2692) و مسلم (101/ 2605)`;