var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ\nاللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من صَمَتَ نَجَا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالدَّارِمِيُّ وَالْبَيْهَقِيُّ فِي شعب الْإِيمَان";
mishkaat.urdu = "عبداللہ بن عمرو ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس نے خاموشی اختیار کی اس نے نجات پائی۔‘‘ اسنادہ حسن،رواہ احمد و الترمذی و الدارمی و البیھقی فی شعب الایمان۔";
mishkaat.description = `[4836] إسنادہ حسن، رواہ أحمد (177/2 ح 6654) و الترمذي (2501) و الدارمي (299/2 ح 2716) والبیھقي في شعب الإیمان (4983)`;