var mishkaat = {};
mishkaat.arabic = "وَعَن\nسُفْيَان بن عبد الله الثَّقَفِيّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ مَا أَخْوَفُ مَا تَخَافُ عَلَيَّ؟ قَالَ: فَأَخَذَ بِلِسَانِ نَفْسِهِ وَقَالَ: «هَذَا» . رَوَاهُ التِّرْمِذِيّ وَصَححهُ";
mishkaat.urdu = "سفیان بن عبداللہ ثقفی ؓ بیان کرتے ہیں،میں نے عرض کیا: اللہ کے رسول! آپ کو میرے بارے میں سب سے زیادہ کس چیز کا اندیشہ ہے؟ راوی بیان کرتے ہیں: آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنی زبان پکڑ کر فرمایا:’’اس کا۔‘‘ ترمذی،اور انہوں نے اسے صحیح قرار دیا ہے۔صحیح،رواہ الترمذی۔";
mishkaat.description = `[4843] صحیح، رواہ الترمذي (2410)`;