var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ\nعُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَذَبَ الْعَبْدُ تَبَاعَدَ عَنْهُ الْمَلَكُ مِيلًا مِنْ نَتْنِ مَا جاءَ بِهِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب بندہ جھوٹ بولتا ہے تو اس کی بدبو کی وجہ سے فرشتہ اس (بندے) سے ایک میل دور چلا جاتا ہے۔‘‘ اسنادہ ضعیف جذا،رواہ الترمذی۔";
mishkaat.description = `[4844] إسنادہ ضعیف جدًا، رواہ الترمذي (1972 وقال: حسن غریب)<br>٭ فیہ عبد الرحیم بن ھارون ضعیف، کذبہ الدارقطني .`;