var mishkaat = {};
mishkaat.arabic = "وَعَن عمار\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ ذَا وَجْهَيْنِ فِي الدُّنْيَا كَانَ لَهُ يَوْمَ الْقِيَامَةِ لِسَانَانِ مِنْ نَارٍ» . رَوَاهُ الدَّارمِيّ";
mishkaat.urdu = "عمار ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص دنیا میں دوغلہ ہو گا تو روزِ قیامت اس کی زبان آگ کی ہو گی۔‘‘ حسن،رواہ الدارمی۔";
mishkaat.description = `[4846] حسن، رواہ الدارمي (314/2ح 2767) [و أبو داود (4873)]<br>٭ شریک القاضي صرح بالسماع عند ابن أبی الدنیا في کتاب الصمت (274) فالسند حسن و للحدیث شواھد .`;