var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَكُونُ الْمُؤْمِنُ لعانا» . وَفِي رِوَايَة: «لاينبغي لِلْمُؤمنِ أَن يكون لعانا» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مومن لعنت کرنے والا نہیں ہوتا۔‘‘ ایک دوسری روایت میں ہے:’’مومن کے لیے مناسب نہیں کہ وہ لعنت کرنے والا ہو۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[4848] إسنادہ حسن، رواہ الترمذي (2019)`;