var mishkaat = {};
mishkaat.arabic = "وَعَن أم هَانِئ قَالَتْ: اغْتَسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ وَمَيْمُونَةُ فِي قَصْعَةٍ فِيهَا أَثَرُ الْعَجِين. رَوَاهُ النَّسَائِيّ وَابْن مَاجَه";
mishkaat.urdu = "ام ہانی ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اور میمونہ ؓ نے برتن میں غسل کیا جس میں آٹے کا نشان تھا۔ضعیف۔";
mishkaat.description = `[485] سندہ ضعیف، رواہ النسائي (1/ 131 ح 241) و ابن ماجہ (378)<br>٭ ابن أبي نجیح مدلس و عنعن و حدیث النسائي (415 سندہ حسن) یغني عنہ .`;