var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا كَانَ الْفُحْشُ فِي شَيْءٍ إِلَّا شَانَهُ وَمَا كَانَ الْحَيَاءُ فِي شيءٍ إِلا زانَهُ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’فحش گوئی جس چیز میں ہو،وہ اسے معیوب بنا دیتی ہے اور حیا جس چیز میں ہو وہ اسے مزین کر دیتا ہے۔‘‘ اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[4854] إسنادہ صحیح، رواہ الترمذي (1974 وقال: حسن غریب)`;