var mishkaat = {};
mishkaat.arabic = "وَعَن\nعَائِشَةَ قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أُحِبُّ أَنِّي حَكَيْتُ أَحَدًا وَأَنَّ لي كَذَا وَكَذَا» . رَوَاهُ التِّرْمِذِيّ وَصَححهُ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں کسی کی نقل اتارنا پسند نہیں کرتا خواہ مجھے اتنا اتنا مال دیا جائے۔‘‘ ترمذی نے اسے روایت کیا اور اسے صحیح قرار دیا ہے۔اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[4857] إسنادہ صحیح، رواہ الترمذي (2503)`;