var mishkaat = {};
mishkaat.arabic = "وَزَاد رزين قَالَ: زَاد بعض الروَاة فِي قَول عمر: وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَهَا مَا أَخَذَتْ فِي بُطُونِهَا وَمَا بَقِي فَهُوَ لنا طهُور وشراب»";
mishkaat.urdu = "رزین نے کہا: بعض راویوں نے عمر ؓ کے قول میں یہ اضافہ نقل کیا ہے کہ میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جو ان (درندوں) کے پیٹ میں چلا گیا،وہ ان کا،اور جو بچ رہا وہ ہمارے لیے پاک ہے اور باعث طہارت اور پینے کے لائق ہے۔‘‘ لااصل لہ،رواہ رزین لم اجدہ۔";
mishkaat.description = `[487] لا أصل لہ، رواہ رزین (لم أجدہ)`;