var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «يَا ذَا الْأُذُنَيْنِ» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اسے فرمایا:’’اے دو کانوں والے!‘‘ صحیح،رواہ ابوداؤد و الترمذی۔";
mishkaat.description = `[4887] حسن، رواہ أبو داود (5007) و الترمذي (1991)<br>٭ حمید الطویل مدلس و عنعن و لحدیثہ شاھد حسن عند الطبراني فی الکبیر (240/1 ح 662)<br>تعدیلات [4887]:<br>صحیح، رواہ أبو داود (5007) و الترمذي (1991)<br>٭ و للحدیث شاھد حسن عند الطبراني فی الکبیر (240/1 ح 662)`;