var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْكَرِيمُ ابْنُ الْكَرِيمِ ابْنِ الْكَرِيمِ ابْنِ الْكَرِيمِ يُوسُفُ بْنُ يَعْقُوبَ بنِ إِسحاقَ بن إِبراهيمَ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کریم بن کریم بن کریم بن کریم،یوسف بن یعقوب بن اسحاق بن ابراہیم علیہم السلام ہیں۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4894] رواہ البخاري (3390)`;