var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا خَيْرَ الْبَرِيَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ذَاكَ إِبْرَاهِيم» . رَوَاهُ مُسلم";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،ایک آدمی نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی خدمت میں حاضر ہوا تو اس نے آپ سے پوچھا: مخلوق میں سے بہترین شخصیت! رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ ابراہیم ؑ ہیں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[4896] رواہ مسلم (2369/150)`;