var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تُطْرُونِي كَمَا أَطْرَتِ النَّصَارَى ابْنَ مَرْيَمَ فَإِنَّمَا أَنَا عَبْدُهُ فَقُولُوا: عبدُ الله ورسولُه . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میری مدح میں ایسے مبالغہ نہ کرنا جیسے نصاریٰ نے ابن مریم کی مدح میں مبالغہ سے کام لیا،میں تو اس کا بندہ ہوں،تم کہوں،اللہ کا بندہ اور اس کا رسول۔‘‘ متفق علیہ۔";
mishkaat.description = `[4897] متفق علیہ، رواہ البخاري (3445) و مسلم (1691/5)`;