var mishkaat = {};
mishkaat.arabic = "وَعَن\nواثلةَ بن الأسقَعِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ مَا الْعَصَبِيَّةُ؟ قَالَ: «أَنْ تُعِينَ قَوْمَكَ عَلَى الظُّلْمِ» رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "واثلہ بن اسقع ؓ بیان کرتے ہیں،میں نے عرض کیا،اللہ کے رسول! عصبیت کیا ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یہ کہ تم ناحق اپنی قوم کی معاونت کرو۔‘‘ ضعیف جذا،رواہ ابوداؤد۔";
mishkaat.description = `[4905] ضعیف جدًا، رواہ أبو داود (5119) [و ابن ماجہ (3949)]<br>٭ فیہ سلمۃ الدمشقي: مستور، لم یوثقہ غیر ابن حبان و دلّس عن عباد بن کثیر و لحدیثہ شاھد ضعیف جدًا یأتي (4909)`;