var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي\nالدَّرْدَاءَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «حُبُّكَ الشَّيْءَ يُعْمِي وَيُصِمُّ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابودرداء ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کسی چیز سے تیری محبت اندھا اور بہرہ بنا دیتی ہے۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4908] إسنادہ ضعیف، رواہ أبو داود (5130)<br>٭ أبو بکر بن أبي مریم: ضعیف و کان قد سرق بیتہ فاختلط .`;