var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحَبَّ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ وَيُنْسَأَ لَهُ فِي أَثَره فَليصل رَحمَه» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص یہ پسند کرتا ہے کہ اس کا رزق فراخ کر دیا جائے اور اس کی عمر دراز کر دی جائے تو وہ صلہ رحمی کرے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4918] متفق علیہ، رواہ البخاري (5976) و مسلم (21/ 2557)`;