var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الرَّحِمُ شِجْنَةٌ مِنَ الرَّحْمَنِ. فَقَالَ اللَّهُ: مَنْ وَصَلَكِ وَصَلْتُهُ وَمَنْ قَطَعَكِ قَطَعْتُهُ . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’رحم،رحمن سے مشتق ہے،اللہ نے فرمایا:’’جس نے تجھ سے تعلق قائم کیا میں اس سے تعلق قائم کروں گا اور جس نے تجھ سے تعلق توڑا میں اس سے تعلق توڑ دوں گا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4920] رواہ البخاري (5988)`;