var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الرَّحِمُ مُعَلَّقَةٌ بِالْعَرْشِ تَقُولُ: مَنْ وَصَلَنِي وَصَلَهُ اللَّهُ وَمَنْ قَطَعَنِي قَطَعَهُ الله . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’رحم عرش کے ساتھ معلق ہے،وہ عرض کرتا ہے: جس نے مجھے جوڑا اللہ اسے جوڑے اور جس نے مجھے توڑا اللہ اسے توڑے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4921] متفق علیہ، رواہ البخاري (5989) و مسلم (2555/17)`;