var mishkaat = {};
mishkaat.arabic = "وَعَنِ\nابْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَيْسَ الواصِلُ بالمكافىء\nوَلَكِنَّ الْوَاصِلَ الَّذِي إِذَا قُطِعَتْ رَحِمُهُ وَصَلَهَا» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’صلہ رحمی کے بدلے میں صلہ رحمی کرنے والا،صلہ رحمی کرنے والا نہیں،بلکہ صلہ رحمی کرنے والا تو وہ ہے کہ جب اس کے ساتھ قطع رحمی کی جائے تو وہ صلہ رحمی کرے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[4923] رواہ البخاري (5991)`;