var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ\nاللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ مَنَّانٌ وَلَا عَاقٌّ وَلَا مُدْمِنُ خمر» . رَوَاهُ النَّسَائِيّ والدارمي";
mishkaat.urdu = "عبداللہ بن عمرو ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’احسان جتلانے والا،والدین کا نافرمان اور مستقل شراب نوش جنت میں نہیں جائے گا۔‘‘ اسنادہ حسن،رواہ النسائی و الدارمی۔";
mishkaat.description = `[4933] إسنادہ حسن، رواہ النسائي (318/8 ح 5675) و الدارمي (112/2 ح 2099)`;