var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ عَالَ جَارِيَتَيْنِ حَتَّى تَبْلُغَا جَاءَ يَوْمَ الْقِيَامَةِ أَنَا وَهُوَ هَكَذَا» وضمَّ أصابعَه. رَوَاهُ مُسلم";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے دو بچیوں کی پرورش کی حتی کہ وہ بالغ ہو گئیں تو وہ روز قیامت اس طرح آئے گا کہ میں اور وہ اس طرح ہوں گے۔‘‘ اور آپ نے اپنی انگلیاں ملائیں۔رواہ مسلم۔";
mishkaat.description = `[4950] رواہ مسلم (149/ 2631)`;