var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَا يُؤمن أحد حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! کوئی بندہ اس وقت تک مومن نہیں ہو سکتا جب تک وہ اپنے بھائی کے لیے وہی چیز پسند نہ کرے جو وہ اپنے لیے پسند کرتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4961] متفق علیہ، رواہ البخاري (13) و مسلم (45/72)`;