var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ وَابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمْ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "عائشہ اور ابن عمر ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جبریل ؑ پڑوسی کے متعلق مجھے مسلسل وصیت کرتے رہے یہاں تک کہ میں نے خیال کیا کہ وہ اسے وارث بنا دیں گے۔‘‘ متفق علیہ۔";
mishkaat.description = `[4964] متفق علیہ، رواہ البخاري (6014، 6015) و مسلم (141، 140/ 2625)`;