var mishkaat = {};
mishkaat.arabic = "عَن أبي\nهُرَيْرَة قَالَ: سَمِعْتُ أَبَا الْقَاسِمِ الصَّادِقَ الْمَصْدُوقَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تُنْزَعُ الرَّحْمَةُ إِلاَّ مَن شقي» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،میں نے ابوالقاسم صادق و مصدوق صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’کسی بدنصیب شخص ہی سے رحمت سلب کی جاتی ہے۔‘‘ اسنادہ حسن،رواہ احمد و الترمذی۔";
mishkaat.description = `[4968] إسنادہ حسن، رواہ أحمد (442/2 ح 9700) و الترمذي (1923 وقال: حسن)`;