var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ\nأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أنزِلوا النَّاس منازَلهم» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’لوگوں سے ان کے مقام و مرتبے کے مطابق برتاؤ کرو۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[4989] إسنادہ ضعیف، رواہ أبو داود (4842)<br>٭ حبیب بن أبي ثابت و سفیان الثوري مدلسان و عنعنا و السند منقطع، ولعلہ أشار مسلم في مقدمۃ صحیحہ إلی ضعفہ لأنہ ذکرہ بصیغۃ التمریض. واللہ أعلم`;