var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْكَبَائِرُ الْإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَالْيَمِين الْغمُوس» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عبداللہ بن عمرو ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ کے ساتھ شریک بنانا،والدین کی نافرمانی کرنا،قتل نفس اور جھوٹی قسم اٹھانا کبیرہ گناہ ہیں۔‘‘ رواہ البخاری (۶۶۷۵)۔";
mishkaat.description = `[50] رواہ البخاري (6675)`;