var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُقْبَةَ\nبْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ خَصْمَيْنِ يَوْمَ الْقِيَامَةِ جَارَانِ» . رَوَاهُ أَحْمد";
mishkaat.urdu = "عقبہ بن عامر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’روز قیامت سب سے پہلے دو پڑوسیوں کا مقدمہ پیش ہو گا۔‘‘ حسن،رواہ احمد۔";
mishkaat.description = `[5000] حسن، رواہ أحمد (151/4 ح 17507)<br>٭ فیہ عبد اللہ بن لھیعۃ تابعہ عمرو بن الحارث عند الطبراني فی الکبیر (303/17 ح 836) وسندہ حسن .`;