var mishkaat = {};
mishkaat.arabic = "وَعَن أبي\nهُرَيْرَة أَنَّ رَجُلًا شَكَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسْوَةَ قَلْبِهِ فَقَالَ: «امْسَحْ رَأْسَ الْيَتِيم وَأطْعم الْمِسْكِين» . رَوَاهُ أَحْمد";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ کسی آدمی نے اپنی سنگ دلی کی نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے شکایت کی تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یتیم کے سر پر دست شفقت پھیرا کر اور مسکین کو کھانا کھلایا کر۔‘‘ اسنادہ ضعیف،رواہ احمد۔";
mishkaat.description = `[5001] إسنادہ ضعیف، رواہ أحمد (263/2 ح 7566)<br>٭ فیہ رجل لم یسم: مجھول .`;