var mishkaat = {};
mishkaat.arabic = "عَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’روحیں مختلف قسم کے لشکر ہیں جو باہم متعارف ہوتی ہیں وہ دنیا میں باہم محبت سے رہتی ہیں،اور جن میں اجنبیت تھی ان میں اختلاف رہتا ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5003] رواہ البخاري (3336)`;