var mishkaat = {};
mishkaat.arabic = "وَعَن\nالْمِقْدَام بن معديكرب عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذا أحب الرجل أَخَاهُ فليخبره أَنه أحبه» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ";
mishkaat.urdu = "مقدام بن معدیکرب ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب آدمی اپنے (مسلمان) بھائی سے محبت کرے تو وہ اسے بتائے کہ وہ اس سے محبت کرتا ہے۔‘‘ اسنادہ حسن،رواہ ابوداؤد و الترمذی۔";
mishkaat.description = `[5016] إسنادہ حسن، رواہ أبو داود (5124) و الترمذي (2392 ا وقال: غریب)`;