var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ وَالنَّسَائِيِّ عَنْ أَبِي السَّمْحِ قَالَ: يُغْسَلُ مِنْ بَوْلِ الْجَارِيَةِ وَيُرَشُّ من بَوْل الْغُلَام";
mishkaat.urdu = "ابوداؤد اور نسائی میں ابوالسمح ؓ سے مروی روایت میں ہے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بچی کے پیشاب سے کپڑا دھویا جاتا ہے جبکہ لڑکے کے پیشاب سے کپڑے پر چھینٹے مارے جاتے ہیں۔‘‘ صحیح۔";
mishkaat.description = `[502] إسنادہ صحیح، رواہ أبو داود (376) والنسائي (1/ 158 ح 305) [و ابن ماجہ (526) و صححہ ابن خزیمۃ (283) والحاکم (166/1) ووافقہ الذہبی .]`;