var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي\nأُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَحَبَّ عَبْدٌ عَبْدًا لِلَّهِ إِلَّا أَكْرَمَ رَبَّهُ عَزَّ وَجَلَّ» . رَوَاهُ أَحْمد";
mishkaat.urdu = "ابوامامہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص اللہ کی رضا کی خاطر کسی شخص سے محبت کرتا ہے تو وہ اپنے رب و عزوجل کی تکریم کرتا ہے۔‘‘ اسنادہ حسن،رواہ احمد۔";
mishkaat.description = `[5022] إسنادہ حسن، رواہ أحمد (259/5 ح 22582، نسخۃ محققۃ: 22229)`;