var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nعَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِيَّاكُمْ وَسُوءَ ذَاتِ الْبَيْنِ فَإِنَّهَا الْحَالِقَةُ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سےروایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’دو (فریقوں،دوستوں،رشتہ داروں) کے درمیان برائی ڈالنے سے بچو کیونکہ وہ (دین کو) زائل کرنے والی ہے۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[5041] إسنادہ حسن، رواہ الترمذي (2508 وقال: صحیح غریب)`;