var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَادَ الْفَقْرُ أَنْ يَكُونَ كفرا وكادَ الحسدُ أَن يغلب الْقدر»";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قریب ہے کہ فقر (اللہ پر اعتراض کرنے کی وجہ سے) کفر بن جائے اور قریب ہے کہ حسد تقدیر پر غالب آ جائے۔‘‘ اسنادہ ضعیف،رواہ البیھقی فی شعب الایمان۔";
mishkaat.description = `[5051] إسنادہ ضعیف، رواہ البیھقي في شعب الإیمان (6612، نسخۃ محققۃ: 6188)<br>٭ فیہ یزید الرقاشي: ضعیف و سفیان الثوري مدلس و عنعن .`;