var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْهَدْيَ الصَّالِحَ وَالِاقْتِصَادَ جُزْءٌ مِنْ خَمْسٍ وَعِشْرِينَ جُزْءًا مِنَ النُّبُوَّة» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اچھا طریق اور اچھی سیرت نبوت کا پچیسواں حصہ ہے۔‘‘ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[5060] حسن، رواہ أبو داود (4776) ولہ شاھد عند الترمذي (2010) و انظر الحدیث السابق (5059)`;