var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ الْمُؤْمِنَ لَيُدْرِكُ بِحُسْنِ خُلُقِهِ دَرَجَةَ قَائِمِ اللَّيْل وصائم النَّهَار» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’بے شک مومن اپنے حسن خلق کی وجہ سے روزے دار اور تہجد گزار شخص کا درجہ پا لیتا ہے۔‘‘ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[5082] حسن، رواہ أبو داود (4798)`;