var mishkaat = {};
mishkaat.arabic = "عَنْ زَيْدِ\nبْنِ طَلْحَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِكُلِّ دِينٍ خُلُقًا وَخُلُقُ الْإِسْلَامِ الْحَيَاءُ» . رَوَاهُ مَالِكٌ مُرْسلا";
mishkaat.urdu = "زید بن طلحہ ؒ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بے شک ہر دین کی کچھ امتیازی خصوصیات ہیں اور اسلام کی امتیازی خصوصیت حیا ہے۔‘‘ امام مالک نے اسے مرسل روایت کیا ہے۔اسنادہ ضعیف،رواہ مالک۔";
mishkaat.description = `[5090] إسنادہ ضعیف، رواہ مالک فی الموطأ (905/2 ح 1743)<br>٭ السند مرسل .`;