var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةِ\nابْنِ عَبَّاسٍ: «فَإِذَا سُلِبَ أَحَدُهُمَا تَبِعَهُ الْآخَرُ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ»";
mishkaat.urdu = "اور ابن عباس ؓ کی روایت میں ہے،فرمایا:’’جب ان میں سے ایک کو سلب کر لیا جاتا ہے تو دوسرا بھی اس کے پیچھے چلا جاتا ہے۔‘‘ اسنادہ ضعیف جذا موضوع،رواہ البیھقی فی شعب الایمان۔";
mishkaat.description = `[5094] إسنادہ ضعیف جدًا موضوع، رواہ البیھقي في شعب الإیمان (7726، نسخۃ محققۃ: 7330)<br>٭ فیہ محمد بن یونس الکدیمي کذاب و علل أخری .`;