var mishkaat = {};
mishkaat.arabic = "وَعَن مَالك\nبَلَغَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بُعِثْتُ لِأُتَمِّمَ حُسْنَ الْأَخْلَاقِ» رَوَاهُ الْمُوَطَّأ";
mishkaat.urdu = "امام مالک ؒ بیان کرتے ہیں،مجھے یہ بات پہنچی ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مجھے اچھے اخلاق کی تکمیل کے لیے مبعوث کیا گیا ہے۔‘‘ سندہ ضعیف،رواہ مالک۔";
mishkaat.description = `[5096] سندہ ضعیف، رواہ مالک فی الموطأ (904/2 ح 1742 بدون سند) [و لہ شواھد ضعیفۃ عند أحمد (381/2) و البخاري فی الأدب المفرد (273) وغیرہما و انظر الحدیث الآتي: 5770)]`;