var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ حسَّنَت خَلقي فأحسِنْ خُلقي» . رَوَاهُ أَحْمد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم دعا کیا کرتے تھے:’’اے اللہ! تو نے مجھے اچھی طرح تخلیق فرمایا،پس میرے اخلاق بھی سنوار دے۔‘‘ اسنادہ صحیح،رواہ احمد۔";
mishkaat.description = `[5099] إسنادہ صحیح، رواہ أحمد (68/6 ح 24896) [و صححہ ابن حبان (الموارد: 2423، الإحسان: 959) بسند آخر نحوہ]`;