var mishkaat = {};
mishkaat.arabic = "عَن أبي هريرةَ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم: أوصني. قَالَ: «لَا تغضبْ» . فردَّ ذَلِكَ مِرَارًا قَالَ: «لَا تَغْضَبْ» . رَوَاهُ الْبُخَارِيُّ";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ ایک آدمی نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے درخواست کی،مجھے وصیت فرمائیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’غصہ نہ کیا کر۔‘‘ اس نے کئی بار یہی درخواست کی،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے (ہر بار یہی) فرمایا:’’غصہ نہ کیا کر۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5104] رواہ البخاري (6016)`;