var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کسی کو پچھاڑنے والا شخص زیادہ طاقت ور نہیں،طاقت ور شخص تو وہ ہے جو غصے کے وقت اپنے آپ پر قابو رکھے۔‘‘ متفق علیہ۔";
mishkaat.description = `[5105] متفق علیہ، رواہ البخاري (6114) و مسلم (107/ 2609)`;