var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَتَوَضَّأ من الموطئ. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عبداللہ بن مسعود ؓ بیان کرتے ہیں،ہم رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے ساتھ نماز پڑھا کرتے تھے اور ہم گندگی پر چل کر جانے کی وجہ سے وضو نہیں کیا کرتے تھے۔ضعیف۔";
mishkaat.description = `[513] سندہ ضعیف، رواہ الترمذي (معلقًا بعد ح 143) [وأبو داود (204) و صححہ الحاکم (139/1)]<br>٭ الأعمش مدلس و عنعن و شک فیمن حدثہ فالسند لعلل .`;