var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اللَّهُمَّ اجْعَلْ رِزْقَ آلِ مُحَمَّدٍ قُوتًا» وَفِي رِوَايَةٍ «كفافا» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے دعا فرمائی:’’اے اللہ! آل محمد (صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم) کو صرف اتنا رزق عطا فرما کہ ان کے جسم و جان کا رشتہ برقرار رہ سکے۔‘‘ متفق علیہ۔\nایک دوسری روایت میں ہے:’’بقدر کفاف‘‘ (گزارہ لائق روزی عطا فرما)";
mishkaat.description = `[5164] متفق علیہ، رواہ البخاري (6460) و مسلم (1055/18)`;