var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قَدْ أَفْلَحَ مَنْ أَسْلَمَ وَرُزِقَ كَفَافًا وَقَنَّعَهُ اللَّهُ بِمَا آتَاهُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "عبداللہ بن عمرو ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس شخص نے فلاح پائی جس نے (اپنے رب کی) اطاعت کر لی اور اسے بقدر ضرورت رزق عطا کیا گیا اور اللہ نے جو اسے عطا کیا اس پر اس نے قناعت اختیار کی۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5165] رواہ مسلم (125/ 1054)`;