var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ وَلَكِنَّ الْغِنَى غِنَى النَّفس» مُتَّفق عَلَيْهِ.";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مال داری،مال اور سازو سامان کی کثرت سے حاصل نہیں ہوتی،بلکہ مال داری تو نفس کی مال داری (یعنی قناعت) ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[5170] متفق علیہ، رواہ البخاري (6446) و مسلم (1051/120)`;