var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَتَّخِذُوا الضَّيْعَةَ فَتَرْغَبُوا فِي الدُّنْيَا» . رَوَاهُ التِّرْمِذِيُّ وَالْبَيْهَقِيُّ فِي «شعب الْإِيمَان»";
mishkaat.urdu = "ابن مسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جاگیریں مت بناؤ ورنہ تم دنیا میں منہمک ہو جاؤ گے۔‘‘ حسن،رواہ الترمذی و البیھقی فی شعب الایمان۔";
mishkaat.description = `[5178] حسن، رواہ الترمذي (2328 وقال: حسن) و البیھقي في شعب الإیمان (10391)`;