var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي\nهُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لُعِنَ عَبْدُ الدِّينَارِ وَلُعِنَ عَبْدُ الدِّرْهَمِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’درہم و دینار کا بندہ ملعون ہے۔‘‘ اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[5180] إسنادہ ضعیف، رواہ الترمذي (2375 وقال: حسن غریب)<br>٭ یونس بن عبید و شیخہ الحسن البصري مدلسان و عنعنا و صح الحدیث بلفظ: ’’تعس عبد الدینار و الدرھم‘‘ (رواہ البخاري: 886 وغیرہ)`;