var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَيْسَ لِابْنِ آدَمَ حَقٌّ فِي سِوَى هَذِهِ الْخِصَالِ: بَيْتٌ يَسْكُنُهُ وَثَوْبٌ يُوَارِي بِهِ عَوْرَتَهُ وجلف الْخبز وَالْمَاء . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عثمان ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’انسان کو ان تین چیزوں،رہائش کے لیے گھر،ستر ڈھانپنے کے لیے کپڑے اور روٹی پانی کے سوا کسی چیز کا حق نہیں۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[5186] إسنادہ حسن، رواہ الترمذي (2341 وقال: صحیح)`;