var mishkaat = {};
mishkaat.arabic = "وَعَن كَعْب\nبن عِياضٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ لِكُلِّ أُمَّةٍ فِتْنَةً وَفِتْنَةُ أُمتي المالُ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "کعب بن عیاض ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’ہر امت کے لیے ایک فتنہ (آزمائش و امتحان) رہا ہے اور میری امت کا فتنہ مال ہے۔‘‘ اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[5194] إسنادہ صحیح، رواہ الترمذي (2336 وقال: حسن صحیح غریب)`;