var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رُبَّ أَشْعَثَ مَدْفُوعٍ بِالْأَبْوَابِ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بہت سے پراگندہ بالوں والے جنہیں دروازوں سے دھکیلا جاتا ہے اگر وہ اللہ پر قسم اٹھا لے تو اللہ اسے پوری فرما دیتا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5231] رواہ مسلم (138/ 2622)`;