var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي\nهُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَدْخُلُ الْفُقَرَاءُ الْجَنَّةَ قَبْلَ الْأَغْنِيَاءِ بِخَمْسِمِائَةِ عَامٍ نِصْفِ يَوْمٍ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’فقرا مال داروں سے پانچ سو سال پہلے جنت میں جائیں گے جو کہ آدھا دن ہے۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[5243] إسنادہ حسن، رواہ الترمذي (2353 وقال: غریب) و البیھقي في شعب الإیمان (10507)<br>٭ الحارث بن النعمان: ضعیف و للحدیث شواھد کلھا ضعیفۃ .`;