var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأُمَيَّةَ بْنِ خَالِدِ بْنِ عَبْدِ اللَّهِ بن أسيد عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ كَانَ يَسْتَفْتِحُ بِصَعَالِيكِ الْمُهَاجِرِينَ. رَوَاهُ فِي «شَرْحِ السّنة»";
mishkaat.urdu = "امیہ بن خالد بن عبداللہ بن اسید،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں کہ آپ مہاجر فقرا کی دعاؤں کے ذریعے فتح طلب کیا کرتے تھے۔اسنادہ ضعیف،رواہ فی شرح السنہ۔";
mishkaat.description = `[5247] إسنادہ ضعیف، رواہ البغوي في شرح السنۃ (14/ 264 ح 4062)<br>٭ السند مرسل و سفیان الثوري و أبو إسحاق مدلسان و عنعنا.`;