var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَزَالُ قَلْبُ الْكَبِيرِ شَابًّا فِي اثْنَيْنِ: فِي حُبِّ الدُّنْيَا وَطول الأمل . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بوڑھے شخص کا دل دو چیزوں کے بارے میں جوان ہی رہتا ہے: دنیا کی محبت کے بارے میں اور لمبی خواہشوں کے بارے میں۔‘‘ متفق علیہ۔";
mishkaat.description = `[5271] متفق علیہ، رواہ البخاري (6420) و مسلم (114/ 1046)`;