var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْذَرَ اللَّهُ إِلَى امْرِئٍ أَخَّرَ أَجَلَهُ حَتَّى بَلَّغَهُ سِتِّينَ سَنَةً» . رَوَاهُ الْبُخَارِيُّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ نے اس شخص سے (توبہ نہ کرنے اور نیک عمل نہ کرنے کا) عذر زائل کر دیا جس کی اجل کو مؤخر کیا حتیٰ کہ اسے ساٹھ سال تک پہنچا دیا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5272] رواہ البخاري (6419)`;