var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعْضِ جَسَدِي فَقَالَ: «كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سبيلٍ وعُدَّ نفسَكَ فِي أهل الْقُبُور» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے میرے جسم کے کسی حصے کو پکڑ کر فرمایا:’’دنیا میں ایسے رہو گویا تم ایک پردیسی یا راہ گیر ہو اور اپنے آپ کو اہل قبور (مُردوں) میں سے شمار کرو۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5274] رواہ البخاري (6416)`;