var mishkaat = {};
mishkaat.arabic = "عَنْ أَنَسٍ\nأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَذَا ابْنُ آدَمَ وَهَذَا أَجَلُهُ» وَوَضَعَ يَدَهُ عِنْدَ قَفَاهُ ثُمَّ بَسَطَ فَقَالَ: «وَثَمَّ أمله» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یہ انسان ہے اور یہ اس کی موت ہے۔‘‘ اور آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنا ہاتھ اپنی گدی کے پاس رکھا،پھر کھولا تو فرمایا:’’اور وہاں اس کی آرزوئیں ہیں۔‘‘ اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[5277] إسنادہ صحیح، رواہ الترمذي (2334 و قال: حسن صحیح)`;