var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي\nهُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عُمُرُ أُمَّتِي مِنْ سِتِّينَ سَنَةً إِلَى سَبْعِينَ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ";
mishkaat.urdu = "ابوہریرہ ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میری امت کی عمر ساٹھ اور ستر سال کے درمیان ہے۔‘‘ ترمذی،اور فرمایا: یہ حدیث غریب ہے۔اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[5279] إسنادہ حسن، رواہ الترمذي (2331)`;