var mishkaat = {};
mishkaat.arabic = "وَعَنْ سُفْيَانَ\nالثَّوْرِيِّ قَالَ: لَيْسَ الزُّهْدُ فِي الدُّنْيَا بِلُبْسِ الْغَلِيظِ وَالْخَشِنِ وَأَكْلِ الْجَشِبِ إِنَّمَا الزُّهْدُ فِي الدُّنْيَا قِصَرُ الْأَمَلِ. رَوَاهُ فِي «شرح السّنة»";
mishkaat.urdu = "سفیان ثوری ؒ نے فرمایا:’’موٹا،جھوٹا کپڑا پہننے اور روکھا سوکھا کھانے کا نام دنیا سے بے رغبتی نہیں،بلکہ آرزوؤں کا کم ہونا دنیا سے بے رغبتی ہے۔‘‘ اسنادہ ضعیف،رواہ فی شرح السنہ۔";
mishkaat.description = `[5282] إسنادہ ضعیف، رواہ البغوي في شرح السنۃ (14/ 286 بدون سند و لم أجدہ مسندًا)`;