var mishkaat = {};
mishkaat.arabic = "وَعَنْ زَيْدِ\nبْنِ الْحُسَيْنِ قَالَ: سَمِعْتُ مَالِكًا وَسُئِلَ أَيُّ شَيْءٍ الزُّهْدُ فِي الدُّنْيَا؟ قَالَ: طِيبُ الْكَسْبِ وَقِصَرُ الْأَمَلِ. رَوَاهُ الْبَيْهَقِيُّ فِي «شعب الْإِيمَان»";
mishkaat.urdu = "زید بن حسین ؒ بیان کرتے ہیں،میں نے امام مالک ؒ سے سنا،ان سے دریافت کیا گیا،دنیا سے بے رغبتی سے کیا مراد ہے؟ انہوں نے فرمایا: حلال کمائی اور امیدوں کا کم ہونا۔اسنادہ ضعیف،رواہ البیھقی فی شعب الایمان۔";
mishkaat.description = `[5283] إسنادہ ضعیف، رواہ البیھقي في شعب الإیمان (10779، نسخۃ محققۃ: 10293)<br>٭ زید بن الحسین مجھول: لم أجد من وثقہ .`;