var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ\nمَسْعُودٍ قَالَ: أَقْرَأَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (إِنِّي أَنَا الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ)\nرَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حسن صَحِيح";
mishkaat.urdu = "ابن مسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے یہ آیت سکھائی:’’بے شک میں ہی رزق عطا کرنے والا،قوت و طاقت والا ہوں۔‘‘ ابوداؤد،ترمذی،اور انہوں نے فرمایا: یہ حدیث حسن صحیح ہے۔صحیح،رواہ ابوداؤد و الترمذی۔";
mishkaat.description = `[5307] صحیح، رواہ أبو داود (3993) و الترمذي (2940)`;