var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَا ينظر إِلَى صوركُمْ وَلَا أموالِكم وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یقیناً اللہ تمہاری صورتوں اور اموال کو نہیں دیکھتا،بلکہ وہ تمہارے دلوں اور اعمال کو دیکھتا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5314] رواہ مسلم (34/ 2564)`;