var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا وَلَضَحِكْتُمْ قَلِيلا» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،ابوالقاسم صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر تم (نافرمانوں کے عذاب کے متعلق) جان لو جو میں جانتا ہوں تو تم زیادہ روؤ اور کم ہنسو۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5339] رواہ البخاري (6485)`;