var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ الْعَلَاءِ الْأَنْصَارِيَّةِ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ لَا أَدْرِي وَاللَّهِ لَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي وبكم» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ام علاء انصاریہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ کی قسم! میں نہیں جانتا،اللہ کی قسم! میں نہیں جانتا جبکہ میں اللہ کا رسول بھی ہوں کہ میرے ساتھ اور تمہارے ساتھ کیا سلوک کیا جائے گا؟‘‘ رواہ البخاری۔";
mishkaat.description = `[5340] رواہ البخاري (1243)`;