var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَنْزَلَ اللَّهُ بِقَوْمٍ عَذَابًا أَصَابَ الْعَذَابُ مَنْ كَانَ فِيهِمْ ثُمَّ بُعِثُوا عَلَى أَعْمَالِهِمْ» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب اللہ کسی قوم پر عذاب نازل کرتا ہے تو تمام لوگ اس عذاب کی لپیٹ میں آ جاتے ہیں،پھر وہ اپنے اپنے اعمال کے مطابق (روز قیامت) اٹھائے جائیں گے۔‘‘ متفق علیہ۔";
mishkaat.description = `[5344] متفق علیہ، رواہ البخاري (7108) و مسلم (84 / 2879)`;