var mishkaat = {};
mishkaat.arabic = "وَعَن أبي\nجُحَيْفَة قَالَ: قَالُوا: يَا رَسُولَ اللَّهِ قَدْ شِبْتَ. قَالَ: «شَيَّبَتْنِي سُورَةُ هُودٍ وَأَخَوَاتُهَا» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ابو جحیفہ ؓ بیان کرتے ہیں،صحابہ نے عرض کیا،اللہ کے رسول! آپ بوڑھے ہو گئے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’سورۂ ہود اور اس جیسی سورتوں نے مجھے بوڑھا کر دیا۔‘‘ سندہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[5353] سندہ ضعیف، رواہ الترمذي (فی الشمائل: 42) و الطبراني فی الکبیر (123/22 ح 317)<br>٭ أبو إسحاق عنعن وانظر الحدیث الآتي (5354)`;