var mishkaat = {};
mishkaat.arabic = "عَن\nأنسٍ قَالَ: إِنَّكُمْ لَتَعْمَلُونَ أَعْمَالًا هِيَ أَدَقُّ فِي أَعْيُنِكُمْ مِنَ الشَّعْرِ كُنَّا نَعُدُّهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ من الموبقات. يَعْنِي المهلكات. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "انس ؓ سے روایت ہے،انہوں نے فرمایا: تم ایسے اعمال کرتے ہو جو تمہاری نظروں میں بال سے بھی زیادہ باریک ہیں (یعنی نہایت معمولی ہیں) جبکہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے عہد میں ہم انہیں مہلک شمار کیا کرتے تھے۔رواہ البخاری۔";
mishkaat.description = `[5355] رواہ البخاري (6492)`;