var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا النَّاسُ كَالْإِبِلِ الْمِائَةِ لَا تَكَادُ تَجِدُ فِيهَا رَاحِلَةً» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’لوگ (اپنے حالات و صفات کے اختلاف کے لحاظ سے) ان سو اونٹوں کی طرح ہیں جن میں تم ایک بھی سواری کے قابل نہ پاؤ۔‘‘ متفق علیہ۔";
mishkaat.description = `[5360] متفق علیہ، رواہ البخاري (6498) و مسلم (232 / 2547)`;