var mishkaat = {};
mishkaat.arabic = "وَعَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَقْتُلُوا إِمَامَكُمْ وَتَجْتَلِدُوا بأسيافكم ويرَث دنياكم شرارُكم» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "حذیفہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قیامت قائم نہیں ہو گی جب تک تم اپنے خلیفہ کو قتل نہیں کرو گے،باہم قتل و غارت نہیں کرو گے اور تمہارے برے لوگ تمہاری دنیا کے وارث نہیں بن جائیں گے۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[5364] إسنادہ حسن، رواہ الترمذي (2170 و قال: حسن)`;