var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ أَنْ يَكُونَ خيرَ مالِ المسلمِ غنمٌ يتبع بهَا شغف الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوسعید ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قریب ہے کہ مسلمان کا بہترین مال بکریاں ہوں،وہ فتنوں سے اپنے دین کی حفاظت کے لیے ان بکریوں کو لے کر پہاڑوں کی چوٹیوں اور بارش برسنے کی جگہوں پر بھاگ جائے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5386] رواہ البخاري (19)`;