var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «حَقُّ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا يَغْسِلُ فِيهِ رَأسه وَجَسَده»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ہفتہ میں ایک روز غسل کرنا ہر مسلمان پر لازم ہے،جس میں وہ اپنا سر اور جسم (اچھی طرح) دھوئے۔‘‘ متفق علیہ۔";
mishkaat.description = `[539] متفق علیہ، رواہ البخاري (897) و مسلم (849/9)`;