var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ أَفْلَحَ مَنْ كَفَّ يَدَهُ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’عربوں کے لیے،شر سے جو کہ قریب آ چکا ہے،ہلاکت ہے،جس نے اپنا ہاتھ روک لیا وہ کامیاب ہو گیا۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[5404] إسنادہ ضعیف، رواہ أبو داود (4249)<br>٭ الأعمش مدلس و عنعن و للحدیث شواھد معنویۃ عند الحاکم (4/ 439) وغیرہ، غیر قولہ: ’’أفلح من کف یدہ‘‘.`;