var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بعصاه» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قیامت قائم نہیں ہو گی حتیٰ کہ قحطان سے ایک آدمی نکلے گا وہ لوگوں کو اپنی لاٹھی کے ساتھ ہانکے گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[5415] متفق علیہ، رواہ البخاري (3517) و مسلم (60/ 2910)`;