var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَتَفْتَحَنَّ عِصَابَةٌ مِنَ الْمُسْلِمِينَ كَنْزَ آلِ كِسْرَى الَّذِي فِي الْأَبْيَض» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’مسلمانوں کی ایک جماعت آل کسریٰ کے خزانے پر قبضہ کر لے گی جو کہ سفید محل میں ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5417] رواہ مسلم (78/ 2919)`;