var mishkaat = {};
mishkaat.arabic = "وَعَنِ\nابْنِ عُمَرَ قَالَ: يُوشِكُ الْمُسْلِمُونَ أَنْ يُحَاصَرُوا إِلَى الْمَدِينَةِ حَتَّى يَكُونَ أَبْعَدَ مَسَالِحِهِمْ سَلَاحٌ وَسَلَاحٌ: قَرِيبٌ مِنْ خَيْبَرَ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں: قریب ہے کہ مسلمانوں کو مدینہ تک محصور کر دیا جائے حتیٰ کہ ان کی سب سے دور والی سرحد سلاح ہو گی۔اور سلاح خیبر کے قریب ہے۔حسن،رواہ ابوداؤد۔";
mishkaat.description = `[5427] حسن، رواہ أبو داود (4250) [و الحاکم (4/ 511 ح 8560) و صححہ علی شرط مسلم ووافقہ الذہبي و سندہ حسن]`;