var mishkaat = {};
mishkaat.arabic = "وَعَنْ رَجُلٌ\nمِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «دَعُوا الْحَبَشَةَ مَا وَدَعُوكُمْ وَاتْرُكُوا التُّرْكَ مَا تَرَكُوكُمْ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ";
mishkaat.urdu = "نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے ایک صحابی سے روایت ہے،انہوں نے کہا:’’تم حبشیوں کو چھوڑے رکھو جب تک وہ تمہیں چھوڑے رکھیں اور (اسی طرح) جب تک ترک تمہیں چھوڑے رکھیں تم بھی ان کو چھوڑے رکھو۔‘‘ حسن،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[5430] حسن، رواہ أبو داود (4302) و النسائي (6/ 44 ح 3178 مطولاً)`;