var mishkaat = {};
mishkaat.arabic = "وَعَن أنسٍ\nقَالَ: فَتْحُ القسطنطينة مَعَ قِيَامِ السَّاعَةِ. رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ";
mishkaat.urdu = "انس ؓ سے روایت ہے،انہوں نے فرمایا: قسطنطنیہ کی فتح،قیامت کے ساتھ (یعنی قریب) ہو گی۔‘‘ ترمذی،اور انہوں نے فرمایا: یہ حدیث غریب ہے۔اسنادہ صحیح،رواہ الترمذی۔";
mishkaat.description = `[5436] إسنادہ صحیح، رواہ الترمذي (2239)<br>٭ و قال محمود (بن غیلان) فیہ: ’’ھذا حدیث غریب، و القسطنطنیۃ ھي مدینۃ الروم تفتح عند خروج الدجال، و القسطنطنیۃ قد فتحت في زمان بعض أصحاب النبي ﷺ‘‘`;