var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ بَيْنَ يَدَيِ السَّاعَةِ كَذَّابِينَ فَاحْذَرُوهُمْ» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،میں نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’قیامت سے پہلے (نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی طرف جھوٹی باتیں منسوب کرنے والے) کذاب ہوں گے،تم ان سے محتاط رہنا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5438] رواہ مسلم (10/ 1822)`;