var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَ فَلَا يَأْخُذْ مِنْهُ شَيْئًا» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قریب ہے کہ فرات اپنے سونے کے خزانے ظاہر کر دے،اس وقت جو موجود ہو وہ اس سے کچھ نہ لے۔‘‘ متفق علیہ۔";
mishkaat.description = `[5442] متفق علیہ، رواہ البخاري (7119) و مسلم (30/ 2894)`;