var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَخْرُجَ نَارٌ مِنْ أَرْضِ الْحِجَازِ تُضِيءُ أعناقَ الإِبلِ ببُصْرى» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قیامت قائم نہیں ہو گی حتیٰ کہ سر زمین حجاز سے آگ نکلے گی اور وہ بصریٰ (شام کا ایک شہر) میں اونٹوں کی گردنوں کو روشن کر دے گی۔‘‘ متفق علیہ۔";
mishkaat.description = `[5446] متفق علیہ، رواہ البخاري (7118) و مسلم (42/ 2902)`;