var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الدَّجَّالُ أَعْوَرُ الْعَيْنِ الْيُسْرَى جُفَالُ الشَّعَرِ مَعَهُ جَنَّتُهُ وَنَارُهُ فَنَارُهُ جِنَّةٌ وَجَنَّتُهُ نارٌ» . رَوَاهُ مُسلم";
mishkaat.urdu = "حذیفہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’دجال بائیں آنکھ سے کانا ہو گا،اس کے (جسم پر) بال گھنے ہوں گے،اس کے ساتھ اس کی جنت اور اس کی آگ ہو گی،اس کی آگ جنت ہو گی اور اس کی جنت حقیقت میں آگ ہو گی۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5474] رواہ مسلم (104 / 2934)`;