var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي بَكْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ عَلَى كُلِّ بَابٍ مَلَكَانِ» رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوبکرہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مدینہ (اس کے لوگوں کے دلوں) میں دجال کا رعب داخل نہیں ہو گا،اس دن اس (مدینے) کے سات دروازے ہوں گے اور ہر دروازے پر دو فرشتے مقرر ہوں گے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5481] رواہ البخاري (1879)`;