var mishkaat = {};
mishkaat.arabic = "وَعَنْهَا قَالَتْ: قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَاوِلِينِي الْخُمْرَةَ مِنَ الْمَسْجِدِ» . فَقُلْتُ: إِنِّي حَائِضٌ فَقَالَ: «إِنَّ حَيْضَتَكِ لَيْسَتْ فِي يدك» . رَوَاهُ مُسلم";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے فرمایا:’’مجھے مسجد سے چٹائی پکڑا دو۔‘‘ میں نے عرض کیا،میں حیض سے ہوں۔آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بے شک تیرا حیض تیرے ہاتھ میں نہیں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[549] رواہ مسلم (11/ 298)`;