var mishkaat = {};
mishkaat.arabic = "عَنْ نَافِعٍ قَالَ: كَانَ ابْنُ عُمَرَ يَقُولُ: وَاللَّهِ مَا أَشُكُّ أَنَّ الْمَسِيحَ الدَّجَّالَ ابْنُ صيَّادٍ. رَوَاهُ أَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي «كِتَابِ الْبَعْثِ والنشور»";
mishkaat.urdu = "نافع بیان کرتے ہیں،ابن عمر ؓ بیان کیا کرتے تھے،اللہ کی قسم! مجھے کوئی شک نہیں کہ مسیح دجال ابن صیاد ہی ہے۔اسنادہ صحیح،رواہ ابوداؤد و البیھقی فی کتاب البعث و النشور۔";
mishkaat.description = `[5501] إسنادہ صحیح، رواہ أبو داود (4330) و البیھقي فی البعث و النشور (لم أجدہ)`;