var mishkaat = {};
mishkaat.arabic = "عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُومُ السَّاعَةُ حَتَّى لَا يُقَالَ فِي الْأَرْضِ: اللَّهُ اللَّهُ . وَفِي رِوَايَةٍ: لَا تَقُومُ السَّاعَةُ عَلَى أَحَدٍ يَقُولُ: اللَّهُ الله . رَوَاهُ مُسلم";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تک زمین پر اللہ اللہ کہا جائے گا قیامت قائم نہیں ہو گی۔‘‘ ایک دوسری روایت میں ہے:’’کسی ایک پر قیامت قائم نہیں ہو گی جب تک وہ اللہ اللہ کہتا ہو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5516] رواہ مسلم (234/ 148)`;