var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ: (يَوْمَ تُبَدَّلُ الأرضُ غيرَ الأَرْض والسَّماواتُ)\nفَأَيْنَ يَكُونُ النَّاسُ يَوْمَئِذٍ؟ قَالَ: «عَلَى الصِّرَاطِ» . رَوَاهُ مُسلم";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے اللہ تعالیٰ کے اس فرمان:’’اس روز زمین کو دوسری زمین سے بدل دیا جائے گا۔‘‘ کے متعلق دریافت کیا کہ اس روز لوگ کہاں ہوں گے؟ فرمایا:’’پل پر۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5525] رواہ مسلم (29/ 2791)`;