var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الصُّورُ قَرْنٌ يُنْفَخُ فِيهِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ";
mishkaat.urdu = "عبداللہ بن عمرو ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’صور ایک سینگ ہے جس میں پھونک ماری جائے گی۔‘‘ اسنادہ صحیح،رواہ الترمذی و ابوداؤد و الدارمی۔";
mishkaat.description = `[5528] إسنادہ صحیح، رواہ الترمذي (2430 وقال: حسن صحیح) و أبو داود (4742) و الدارمي (325/2 ح 2801)`;