var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي\nسَعِيدٍ قَالَ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاحِبُ الصُّورِ وَقَالَ: «عَن يَمِينه جِبْرِيل عَن يسَاره مِيكَائِيل»";
mishkaat.urdu = "ابوسعید ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے صور والے (اسرافیل ؑ) کا ذکر کیا اور فرمایا:’’اس کے دائیں جبرائیل ؑ اور اس کے بائیں میکائیل ؑ ہوں گے۔‘‘ ضعیف،رواہ رزین (لم اجدہ)";
mishkaat.description = `[5530] ضعیف، رواہ رزین (لم أجدہ) [و أبو داود (3999)]<br>٭ عطیۃ العوفي ضعیف .`;