var mishkaat = {};
mishkaat.arabic = "عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ النَّقِيِّ لَيْسَ فِيهَا عَلَمٌ لأحدٍ» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "سہل بن سعد ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’لوگوں کو روزِ قیامت سفید سرخی مائل زمین پر جمع کیا جائے گا،وہ (زمین) میدے کی روٹی کی طرح ہو گی اس میں کسی کے لیے کوئی نشان نہیں ہو گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[5532] متفق علیہ، رواہ البخاري (6521) و مسلم (28/ 2790)`;