var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nإِذَا كَانَ يَوْمُ الْقِيَامَةِ دَفَعَ اللَّهُ إِلَى كُلِّ مُسْلِمٍ يَهُودِيًّا أَوْ نَصْرَانِيًّا فَيَقُولُ: هَذَا فِكَاكُكَ مِنَ النَّارِ رَوَاهُ مُسلم";
mishkaat.urdu = "ابوموسیٰ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب قیامت کا دن ہو گا تو اللہ ہر مسلمان کو ایک یہودی یا ایک عیسائی دے گا اور فرمائے گا: اس کے بدلے میں (جہنم کی) آگ سے تیری آزادی ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5552] رواہ مسلم (49/ 2767)`;