var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: كُنْتُ إِذَا حِضْتُ نَزَلْتُ عَن الْمِثَال على الْحَصِير فَلم نقرب رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ ندن مِنْهُ حَتَّى نطهر. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،جب مجھے حیض آتا تو میں بستر سے چٹائی پر آ جاتی،اور جب تک ہم پاک نہ ہو جاتیں ہم آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے قریب نہ جاتیں۔ضعیف۔";
mishkaat.description = `[556] إسنادہ ضعیف، رواہ أبو داود (271)<br>٭ أبو الیمان الرحال: مستور و أم ذرۃ: مجھولۃ الحال .`;