var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ خَالِصا من قلبه أونفسه\nرَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’روزِ قیامت میری شفاعت کے لحاظ سے سب سے زیادہ سعادت مند شخص وہ ہو گا جس نے خلوص دل سے ((لا الہ الا اللہ)) ’’اللہ کے سوا کوئی معبود برحق نہیں‘‘ پڑھا ہو گا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5574] رواہ البخاري (99)`;