var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nحُذَيْفَةَ فِي حَدِيثِ الشَّفَاعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَتُرْسَلُ الْأَمَانَةُ وَالرَّحِمُ فَتَقُومَانِ جَنَبَتَيِ الصِّرَاطِ يَمِينًا وَشِمَالًا»\nرَوَاهُ مُسلم";
mishkaat.urdu = "شفاعت سے متعلق حذیفہ ؓ سے مروی حدیث جو وہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،فرمایا:’’امانت اور صلہ رحمی کو چھوڑا جائے گا تو وہ پل صراط کے دونوں کناروں پر کھڑی ہو جائیں گی۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5576] رواہ مسلم (329/ 195)`;