var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَخْرُجُ مِنَ النَّار بالشفاعة كَأَنَّهُمْ الثعارير؟ قَالَ: «إِنَّه الضغابيس» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کچھ لوگ جہنم سے شفاعت کے ذریعے نکلیں گے گویا وہ ثغاریر ہیں۔‘‘ ہم نے عرض کیا: ثغاریر کیا ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ لکڑیاں ہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[5610] متفق علیہ، رواہ البخاري (6558) و مسلم (318/ 191)`;