var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَدْخُلُ الْجَنَّةَ يَنْعَمُ وَلَا يَبْأَسُ\nوَلَا تَبْلَى ثِيَابُهُ وَلَا يفْنى شبابُه» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص جنت میں داخل ہو گا وہ خوشحال رہے گا،بد حال نہیں ہو گا،نہ تو اس کا لباس پرانا ہو گا اور نہ اس کی جوانی ختم ہو گی۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5621] رواہ مسلم (21/ 2836)`;