var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ مِائَةُ عَامٍ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جنت میں سو درجے ہیں،ہر دو درجوں کے درمیان سو سال کی مسافت ہے۔‘‘ ترمذی،اور فرمایا: یہ حدیث حسن غریب ہے۔صحیح،رواہ الترمذی۔";
mishkaat.description = `[5632] صحیح، رواہ الترمذي (2529)`;