var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الصَّلَوَاتُ الْخَمْسُ وَالْجُمُعَةُ إِلَى الْجُمُعَةِ وَرَمَضَانُ إِلَى رَمَضَانَ مُكَفِّرَاتٌ لَمَّا بَيْنَهُنَّ إِذَا اجْتُنِبَتِ الْكَبَائِر» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب کبیرہ گناہوں سے بچا جائے تو پانچ نمازیں،جمعہ دوسرے جمعہ تک اور رمضان دوسرے رمضان تک ہونے والے صغیرہ گناہوں کا کفارہ ہیں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[564] رواہ مسلم (16/ 233)`;