var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا سَبْعُونَ أَلْفَ زِمَامٍ مَعَ كُلِّ زِمَامٍ سبعونَ ألفَ مَلَكٍ يجرُّونها» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابن مسعود ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جہنم کو لایا جائے گا،اس روز اس کی ستر ہزار لگامیں ہوں گی اور ہر لگام کے ساتھ ستر ہزار فرشتے ہوں گے جو اسے کھینچ رہے ہوں گے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5666] رواہ مسلم (29/ 2842)`;