var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا أَبُو طَالِبٍ وَهُوَ مُنْتَعِلٌ بِنَعْلَيْنِ يغلي مِنْهُمَا دماغه» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جہنم والوں میں سے سب سے ہلکا عذاب ابو طالب کو ہو گا،اس نے آگ کے دو جوتے پہنے ہوں گے،ان سے اس کا دماغ کھولے گا۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5668] رواہ البخاري (لم أجدہ) [و مسلم (362/ 212)]`;