var mishkaat = {};
mishkaat.arabic = "وَعَنِ\nابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْكَافِرَ لَيُسْحَبُ لسانُه الفرسَخ والفرسخين يتوطَّؤُه النَّاس» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَقَالَ: هَذَا حَيْثُ غَرِيب";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کافر اپنی زبان کو فرسخ (تین میل) اور دو فرسخ گھسیٹے گا اور لوگ اس کو پاؤں تلے روندیں گے۔‘‘ احمد،ترمذی،اور فرمایا: یہ حدیث غریب ہے۔حسن،رواہ احمد و الترمذی۔";
mishkaat.description = `[5676] حسن، رواہ أحمد (2/ 92 ح 5671) و الترمذي (2580)`;