var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي سَعِيدٍ الْخُدْرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:\nلِسُرَادِقِ النَّارِ أَرْبَعَةُ جُدُرِ كِثَف كل جِدَار مسيرَة أَرْبَعِينَ سنة . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوسعید ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جہنم کی آگ کا چار دیواروں سے احاطہ کیا گیا ہے،اور ہر دیوار کی موٹائی چالیس سال کی مسافت ہے۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[5681] حسن، رواہ الترمذي (1/ 2584) و الحاکم (4/ 601 ح 8775 و سندہ حسن)`;