var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ أَنَّ دَلْوًا مِنْ غَسَّاقٍ يَهَرَاقُ فِي الدُّنْيَا لَأَنْتَنَ أَهْلُ الدُّنْيَا» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوسعید ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر (جہنمیوں کے زخموں کی) پیپ کا ایک ڈول دنیا میں بہا دیا جائے تو دنیا والے بدبو دار بن جاتے۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[5682] حسن، رواہ الترمذي (2/ 2584) والحاکم (4/ 602 ح 8779 و سندہ حسن)`;