var mishkaat = {};
mishkaat.arabic = "وَعَن\nأبي بُردةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ فِي جَهَنَّمَ لَوَادِيًا يُقَالُ لَهُ: هَبْهَبُ يسكنُه كلُّ جبَّارٍ رَوَاهُ الدَّارمِيّ";
mishkaat.urdu = "ابو بُردہ ؓ اپنے والد سے روایت کرتے ہیں کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جہنم میں ایک وادی ہے جسے ھَبْھَبْ کہا جاتا ہے،اس میں ہر قسم کے سرکش اور باغی رہیں گے۔‘‘ اسنادہ ضعیف،رواہ الدارمی۔";
mishkaat.description = `[5689] إسنادہ ضعیف، رواہ الدارمي (2/ 331 ح 2819، نسخۃ محققۃ: 2858)<br>٭ فیہ أزھر بن سنان:ضعیف .`;