var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مثل الْمُنَافِق كَمثل الشَّاة الْعَائِرَةِ بَيْنَ الْغُنْمَيْنِ تَعِيرُ إِلَى هَذِهِ مَرَّةً وَإِلَى هَذِه مرّة» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’منافق کی مثال اس متردد بکری کی طرح ہے جو دو ریوڑوں کے درمیان ہو،کبھی وہ اس کی طرف جاتی ہے کبھی اس کی طرف۔‘‘ رواہ مسلم۔";
mishkaat.description = `[57] رواہ مسلم (2784/ 17)`;