var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خُلِقَتِ الْمَلَائِكَةُ مِنْ نُورٍ وَخُلِقَ الْجَانُّ مِنْ مَارِجٍ مِنْ نَارٍ وَخُلِقَ آدَمُ مِمَّا وصف لكم» . رَوَاهُ مُسلم";
mishkaat.urdu = "عائشہ ؓ،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتی ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’فرشتے نور سے پیدا کیے گئے،جن دھوئیں اور شعلے والی آگ سے پیدا کیے گئے جبکہ آدم ؑ اس چیز سے پیدا کیے گئے جو تمہیں بیان کر دی گئی ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5701] رواہ مسلم (60/ 2996)`;