var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةِ أَبِي سَعِيدٍ قَالَ: «لَا تُخَيِّرُوا بَيْنَ الْأَنْبِيَاءِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةِ أَبِي هُرَيْرَة: «لَا تفضلوا بَين أَنْبيَاء الله»";
mishkaat.urdu = "ابوسعید ؓ کی روایت میں ہے،فرمایا:’’انبیا کو ایک دوسرے پر برتری نہ دو۔‘‘ اور ابوہریرہ ؓ کی روایت میں ہے:’’انبیا کو ایک دوسرے پر فضیلت نہ دو۔‘‘ متفق علیہ۔";
mishkaat.description = `[5709] متفق علیہ، رواہ البخاري (6916) و مسلم (163 / 2374) وروایۃ سیدنا أبي ھریرۃ رضي اللہ عنہ، رواھا البخاري (3414) و مسلم (159/ 2372)`;