var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْغُلَامَ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا وَلَوْ عَاشَ لَأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابی بن کعب ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ غلام جسے خضر ؑ نے قتل کیا تھا وہ کافر پیدا ہوا تھا،اگر وہ زندہ رہتا تو وہ اپنے والدین کو سرکشی اور کفر پر مجبور کرتا۔‘‘ متفق علیہ۔";
mishkaat.description = `[5711] متفق علیہ، رواہ البخاري (لم أجدہ) و مسلم (29/ 2661)`;