var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا سُمِّيَ الْخَضِرُ لِأَنَّهُ جَلَسَ عَلَى فَرْوَةٍ بَيْضَاءَ فَإِذَا هِيَ تَهْتَزُّ من خَلْفِه خضراء» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’خضر ؑ کا نام خضر اس لیے رکھا گیا کہ وہ ایک خشک زمین پر بیٹھے تھے،تو وہ (زمین) ان کے بعد سرسبز ہو کر لہلہانے لگی۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5712] رواہ البخاري (3402)`;