var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَا سَيِّدُ وَلَدِ آدَمَ يَوْمَ الْقِيَامَةِ وَأَوَّلُ مَنْ يَنْشَقُّ عَنْهُ الْقَبْرُ وَأَوَّلُ شَافِعٍ وَأَوَّلُ مُشَفَّعٍ . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’روزِ قیامت آدم ؑ کی اولاد کا سردار میں ہوں گا۔سب سے پہلے مجھے قبر سے اٹھایا جائے گا،سب سے پہلے میں سفارش کروں گا اور سب سے پہلے میری سفارش قبول کی جائے گی۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5741] رواہ مسلم (3/ 2278)`;