var mishkaat = {};
mishkaat.arabic = "وَعَن زيد بن خَالِد الْجُهَنِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى سَجْدَتَيْنِ لَا يَسْهُو فِيهِمَا غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ» . رَوَاهُ أَحْمَدُ";
mishkaat.urdu = "زید بن خالد الجہنی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص حضور قلب سے دو رکعتیں پڑھتا ہے تو اللہ اس کے سابقہ گناہ معاف فرما دیتا ہے۔‘‘ حسن،رواہ احمد۔";
mishkaat.description = `[577] حسن، رواہ أحمد (5/ 194 ح 22033) [و أبو داود (905 مطولاً) و صححہ الحاکم علٰی شرط مسلم (132/1) ووافقہ الذھبي .]`;