var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ: مَكْتُوبٌ فِي التَّوْرَاةِ صِفَةُ مُحَمَّدٍ وَعِيسَى بن مَرْيَمَ يُدْفَنُ مَعَهُ قَالَ أَبُو مَوْدُودٍ: وَقَدْ بَقِي فِي الْبَيْت مَوضِع قَبره رَوَاهُ الترمذيُّ";
mishkaat.urdu = "عبداللہ بن سلام ؓ بیان کرتے ہیں،تورات میں محمد صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی صفت لکھی ہوئی ہے اور عیسیٰ ؑ محمد صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے ساتھ دفن کیے جائیں گے۔‘‘ ابو مودود (راوی) نے بیان کیا: (عائشہ ؓ کے) گھر میں ایک قبر کی جگہ باقی ہے۔حسن،رواہ الترمذی۔";
mishkaat.description = `[5772] حسن، رواہ الترمذي (3617 وقال: حسن غریب)`;