var mishkaat = {};
mishkaat.arabic = "وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سُرَّ اسْتَنَارَ وَجْهُهُ حَتَّى كَأَنَّ وَجْهَهُ قِطْعَةُ قَمَرٍ وَكُنَّا نَعْرِفُ ذَلِكَ. مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "کعب بن مالک ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم خوش ہوتے تھے تو آپ کا چہرہ چمک جاتا اور رخ انور ایسے لگتا جیسے کہ وہ چاند کا ٹکڑا ہے اور ہم یہ چیز پہچان لیتے تھے۔متفق علیہ۔";
mishkaat.description = `[5798] متفق علیہ، رواہ البخاري (3556) و مسلم (53/ 2769)`;