var mishkaat = {};
mishkaat.arabic = "عَنْ أَنَسٍ قَالَ: خَدَمْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشْرَ سِنِينَ فَمَا قَالَ لِي: أُفٍّ وَلَا: لِمَ صَنَعْتَ؟ وَلَا: أَلَّا صَنَعْتَ؟ مُتَّفق عَلَيْهِ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،میں نے دس سال نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی خدمت کی،لیکن آپ نے مجھے کبھی اُف تک نہ کہا،اور نہ ہی یہ کہا کہ تو نے یہ کام کیوں کیا اور وہ کام کیوں نہیں کیا۔متفق علیہ۔";
mishkaat.description = `[5801] متفق علیہ، رواہ البخاري (6038) و مسلم (51/ 2309)`;