var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاحِشًا وَلَا لَعَّانًا وَلَا سَبَّابًا كَانَ يَقُولُ عِنْدَ الْمَعْتَبَةِ: «مَا لَهُ تربَ جَبينُه؟» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم بدگو تھے نہ لعنت کرنے والے تھے،اور نہ ہی گالی دیتے تھے،ناراضی کے عالم میں آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم بس یہی فرماتے:’’اسے کیا ہوا؟ اس کی پیشانی خاک آلود ہو۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5811] رواہ البخاري (6031)`;