var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي هُرَيْرَةَ قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ ادْعُ عَلَى الْمُشْرِكِينَ. قَالَ: «إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے عرض کیا گیا،اللہ کے رسول! مشرکوں کے لیے بددعا فرمائیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مجھے لعنت کرنے کے لیے نہیں بھیجا گیا،مجھے تو باعث رحمت بنا کر بھیجا گیا ہے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5812] رواہ مسلم (87/ 2599)`;