var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا فَإِذَا رَأَى شَيْئًا يَكْرَهُهُ عَرَفْنَاهُ فِي وَجْهِهِ. مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم پردہ نشین کنواری لڑکیوں سے بھی زیادہ شرمیلے تھے،جب آپ کوئی ایسی چیز دیکھتے جو آپ کو ناگوار گزرتی تو ہم اسے آپ کے چہرے مبارک سے پہچان لیتے تھے۔متفق علیہ۔";
mishkaat.description = `[5813] متفق علیہ، رواہ البخاري (6102) و مسلم (67 /2320)`;