var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَجْمِعًا قَطُّ ضَاحِكًا حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ وَإِنَّمَا كَانَ يتبسم. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو اس طرح کھلکھلا کر ہنستے ہوئے کبھی نہیں دیکھا کہ آپ کے حلق کا آخری حصہ دیکھ سکوں کیونکہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم صرف تبسم فرمایا کرتے تھے۔رواہ البخاری۔";
mishkaat.description = `[5814] رواہ البخاري (6092)`;