var mishkaat = {};
mishkaat.arabic = "وَعَنْهَا قَالَتْ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ يَسْرُدُ الْحَدِيثَ كَسَرْدِكُمْ كَانَ يُحَدِّثُ حَدِيثًا لَوْ عَدَّهُ الْعَادُّ لَأَحْصَاهُ. مُتَّفق عَلَيْهِ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم تمہاری طرح نہایت تیز گفتگو نہیں فرماتے تھے،بلکہ آپ اس طرح گفتگو فرماتے تھے کہ اگر کوئی (الفاظ) شمار کرنے والا شمار کرنا چاہتا تو شمار کر سکتا تھا۔متفق علیہ۔";
mishkaat.description = `[5815] متفق علیہ، رواہ البخاري (3567۔ 3568) و مسلم (160/ 2493)`;