var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْرُدُ سَرْدَكُمْ هَذَا وَلَكِنَّهُ كَانَ يَتَكَلَّمُ بِكَلَامٍ بَيْنَهُ فَصْلٌ يَحْفَظُهُ من جَلَسَ إِلَيْهِ. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم تمہاری طرح نہایت تیز گفتگو نہیں فرماتے تھے،بلکہ آپ کا کلام الگ الگ ہوتا تھا،آپ کے پاس بیٹھنے والا اسے یاد کر لیتا تھا۔صحیح،رواہ الترمذی۔";
mishkaat.description = `[5828] صحیح، رواہ الترمذي (3639 وقال: حسن صحیح)`;