var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ\nاللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ قَالَ: مَا رَأَيْتُ أَحَدًا أَكْثَرَ تَبَسُّمًا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عبداللہ بن حارث بن جزء ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے زیادہ کسی کو مسکراتے ہوئے نہیں دیکھا۔سندہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[5829] سندہ ضعیف، رواہ الترمذي (3641)<br>٭ عبد اللہ بن لھیعۃ حدّث بہ قبل اختلاطہ و لکنہ مدلس و عنعن فالسند ضعیف و حدیث الترمذي (3642) یغني عنہ .`;