var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَأَعْرِفُ حَجَرًا بِمَكَّةَ كَانَ يُسَلِّمُ عَلَيَّ قَبْلَ أَنْ أُبعث إِني لأعرفه الْآن» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں مکہ میں اس پتھر کو پہچانتا ہوں جو کہ میری بعثت سے قبل مجھے سلام کیا کرتا تھا،اور میں اسے اب بھی پہچانتا ہوں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5853] رواہ مسلم (2/ 2277)`;