var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَمَّارٍ حِينَ يَحْفِرُ الْخَنْدَقَ فَجَعَلَ يَمْسَحُ رَأسه وَيَقُول: «بؤس بن سميَّة تقتلك الفئة الباغية» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوقتادہ ؓ سے روایت ہے کہ خندق کھودتے وقت رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے عمار ؓ سے فرمایا،آپ اس وقت ان کے سر پر ہاتھ پھیر رہے تھے اور فرما رہے تھے:’’سمیہ کے بیٹے! تجھے تکالیف کا سامنا ہو گا اور تجھے باغی گروہ شہید کرے گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[5878] رواہ مسلم (71، 70/ 2915)`;