var mishkaat = {};
mishkaat.arabic = "وَعَن\nسليمانَ بن صُرَد قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَجْلَى الْأَحْزَابَ عَنْهُ: «الْآنَ نَغْزُوهُمْ وَلَا يغزونا نَحن نسير إِلَيْهِم» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "سلیمان بن صرد ؓ بیان کرتے ہیں،جب گروہ متفرق ہو گئے تو نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اب ہم ان پر چڑھائی کریں گے،وہ ہم پر چڑھائی نہ کر سکیں گے،اب ہم ان کی طرف پیش قدمی کریں گے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[5879] رواہ البخاري (4019۔ 4110)`;