var mishkaat = {};
mishkaat.arabic = "وَفِي\nرِوَايَةٍ لِلْبُخَارِيِّ قَالَ أَنَسٌ: كَأَنِّي أَنْظُرُ إِلَى الْغُبَارِ سَاطِعًا فِي زُقَاقِ بَنِيَ غَنْمٍ موكبَ جِبْرِيل عَلَيْهِ السَّلَامُ حِينَ سَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى بني قُرَيْظَة";
mishkaat.urdu = "صحیح بخاری کی روایت میں ہے،انس ؓ نے بیان کیا،گویا میں بنو غنم کی گلیوں میں اٹھتی ہوئی غبار دیکھ رہا ہوں جو جبریل ؑ کے ساتھیوں کی وجہ سے اڑ رہی تھی،یہ اس وقت ہوا جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم بنو قریظہ کی طرف چلے تھے۔متفق علیہ۔";
mishkaat.description = `[5881] رواہ البخاري (4118)`;