var mishkaat = {};
mishkaat.arabic = "وَعَن أبي أَيُّوب قا ل: خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ وَجَبَتِ الشَّمْسُ فَسَمِعَ صَوْتًا فَقَالَ: «يَهُودُ تُعَذَّبَ فِي قبورها» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوایوب ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم باہر تشریف لائے اس وقت سورج غروب ہو چکا تھا،آپ نے ایک آواز سنی تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’یہودیوں کو ان کی قبروں میں عذاب دیا جا رہا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[5899] متفق علیہ، رواہ البخاري (1375) و مسلم (69/ 2869)`;