var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nبُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَمَّا انْتَهَيْنَا إِلَى بَيْتِ الْمَقْدِسِ قَالَ جِبْرِيل بِأُصْبُعِهِ فَخَرَقَ بِهَا الْحَجَرَ فَشَدَّ بِهِ الْبُرَاقَ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "بریدہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب ہم بیت المقدس پہنچے تو جبریل نے اپنی انگلی سے اشارہ فرمایا تو اس کے ساتھ پتھر میں سوراخ کر دیا اور اس کے ساتھ براق کو باندھ دیا۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[5921] إسنادہ حسن، رواہ الترمذي (3132 وقال: غریب)`;