var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَقْتَسِمُ وَرَثَتِي دِينَارًا مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمُؤْنَةِ عَامِلِي فَهُوَ صَدَقَةٌ» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میرا ورثہ دینار کی صورت میں تقسیم نہیں ہو گا،میں نے اپنی ازواج مطہرات کے خرچے اور عاملوں کی ضروریات کے اخراجات کے بعد جو چھوڑا ہے وہ صدقہ ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[5975] متفق علیہ، رواہ البخاري (2776) و مسلم (55/ 1760)`;