var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «النَّاسُ تَبَعٌ لِقُرَيْشٍ فِي هَذَا الشَّأْن مسلمهم تبع مسلمهم وكافرهم تبع لكافرهم» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس (دین یا خلافت) کے معاملے میں لوگ قریش کے تابع ہیں،ان (لوگوں) کے مسلمان،قریشی مسلمانوں کے تابع ہیں،اور ان (عام لوگوں) کے کافر،ان (قریش کے) کافروں کے تابع ہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[5979] متفق علیہ، رواہ البخاري (3495) و مسلم (2/ 1818)`;