var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قُرَيْشٌ وَالْأَنْصَارُ وَجُهَيْنَةُ وَمُزَيْنَةُ وَأَسْلَمُ وَغِفَارُ وَأَشْجَعُ مَوَالِيَّ لَيْسَ لَهُمْ مَوْلًى دُونَ اللَّهِ وَرَسُولِهِ» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’قریش،انصار،جہینہ،مزینہ،اسلم،غفار اور اشجع قبیلے میرے حمایتی ہیں،اور اللہ اور اس کے رسول کے سوا ان کا کوئی حمایتی نہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[5985] متفق علیہ، رواہ البخاري (3512) و مسلم (189/ 2520)`;