var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ أَذَقْتَ أَوَّلَ قُرَيْشٍ نَكَالًا فَأَذِقْ آخِرَهُمْ نَوَالًا» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اے اللہ! تو نے (بدر و احزاب میں) قریش کے پہلے افراد کو عذاب میں مبتلا کیا،تو ان کے بعد والوں کو انعام عطا فرما۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[5989] حسن، رواہ الترمذي 3908 وقال: حسن صحیح غریب)`;