var mishkaat = {};
mishkaat.arabic = "وَعَن\nعمرَان بن حُصَيْن قَالَ: مَاتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَكْرَهُ ثَلَاثَةَ أَحْيَاءٍ: ثَقِيفٌ وَبَنِي حَنِيفَةَ وَبَنِي أُمَيَّةَ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب";
mishkaat.urdu = "عمران بن حصین ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے وفات پائی تو وہ تین قبیلوں کو ناپسند فرماتے تھے،ثقیف،بنو حنیفہ اور بنو امیہ۔ترمذی،اور فرمایا: یہ حدیث غریب ہے۔اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[5992] إسنادہ ضعیف، رواہ الترمذي (3943)<br>٭ فیہ ھشام بن حسان و الحسن البصري مدلسان و عنعنا.`;