var mishkaat = {};
mishkaat.arabic = "وَعَن جَابر\nقَالَ: قَالُوا: يَا رَسُولَ اللَّهِ أَحْرَقَتْنَا نِبَالُ ثَقِيفٍ فَادْعُ اللَّهَ عَلَيْهِمْ. قَالَ: «اللَّهُمَّ اهْدِ ثقيفا» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،صحابہ ؓ نے عرض کیا،اللہ کے رسول! ثقیف قبیلے کے تیروں نے ہمیں جلا کر رکھ دیا ہے،آپ ان کے لیے اللہ سے بددعا فرمائیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اے اللہ! ثقیف قبیلے کو ہدایت عطا فرما۔‘‘ سندہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[5995] سندہ ضعیف، رواہ الترمذي (3942 وقال: صحیح غریب)`;