var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مِمَّنْ أَنْتَ؟ قُلْتُ: مِنْ دَوْسٍ. قَالَ: «مَا كُنْتُ أَرَى أَنَّ فِي دَوْسٍ أحدا فِيهِ خير» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے فرمایا:’’تم کس قبیلے سے ہو؟‘‘ میں نے عرض کیا،دوس سے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں نہیں سمجھتا تھا کہ دوس قبیلے کے کسی شخص میں بھلائی ہو۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[5997] إسنادہ حسن، رواہ الترمذي (3838 وقال: غریب صحیح)`;