var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ\nعُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: إِذا رَأَيْتُمْ الَّذِينَ يَسُبُّونَ أَصْحَابِي فَقُولُوا: لَعْنَةُ اللَّهِ عَلَى شركم . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم ایسے لوگوں کو دیکھو جو میرے صحابہ کو برا کہتے ہوں تو تم کہو: تمہارے شر پر اللہ کی لعنت ہو۔‘‘ اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[6017] إسنادہ ضعیف، رواہ الترمذي (3866)<br>٭ نصر بن حماد: ضعیف و سیف بن عمر: ضعیف فی الحدیث و ضعیف فی التاریخ علی الراجح .`;