var mishkaat = {};
mishkaat.arabic = "وَعَن\nابْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ: «أَنْتَ صَاحِبِي فِي الْغَارِ وصاحبي على الْحَوْض» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن عمر ؓ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے روایت کرتے ہیں،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ابوبکر ؓ سے فرمایا:’’تم میرے غار کے ساتھی ہو،اور حوض پر میرے ساتھی ہو گے۔‘‘ اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[6028] إسنادہ ضعیف، رواہ الترمذي (3670 و قال: حسن صحیح غریب)<br>٭ کثیر النواء: ضعیف و جمیع بن عمیر: ضعیف رافضي .`;