var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ كَانَ فِيمَا قَبْلَكُمْ مِنَ الْأُمَمِ مُحَدَّثُونَ فَإِنْ يَكُ فِي أمّتي أحدٌ فإِنَّه عمر» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم سے پہلی امتوں میں محدث (جنہیں الہام ہوتا ہو) ہوا کرتے تھے،اگر میری امت میں کوئی شخص (محدث) ہوتا تو وہ عمر ہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[6035] متفق علیہ، رواہ البخاري (3689) و مسلم (23/ 2398)`;