var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لوكان بَعْدِي نَبِيٌّ لَكَانَ عُمَرَ بْنَ الْخَطَّابِ» . رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ";
mishkaat.urdu = "عقبہ بن عامر ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر میرے بعد کوئی نبی ہوتا تو وہ عمر بن خطاب ہوتے۔‘‘ ترمذی،اور فرمایا: یہ حدیث غریب ہے۔اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[6047] إسنادہ حسن، رواہ الترمذي (3686)`;