var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَبُو بَكْرٍ وَعُمَرُ سَيِّدَا كُهُولِ أَهْلِ الْجَنَّةِ مِنَ الْأَوَّلِينَ وَالْآخِرِينَ إِلَّا النَّبِيين وَالْمُرْسلِينَ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ابوبکر اور عمر ؓ اہل جنت کے اولین و آخرین کے عمر رسیدہ لوگوں کے سردار ہوں گے البتہ انبیا ؑ اور رسول اس سے مستثنیٰ ہوں گے۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[6059] حسن، رواہ الترمذي (3664 وقال: غریب) و للحدیث شواھد وھو بھا حسن .`;