var mishkaat = {};
mishkaat.arabic = "وَعَنْ حُذَيْفَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنِّي لَا أَدْرِي مَا بَقَائِي فِيكُمْ؟ فَاقْتَدُوا بِاللَّذَيْنِ مِنْ بَعْدِي: أَبِي بكر وَعمر . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "حذیفہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں نہیں جانتا کہ میں تم میں کتنی دیر باقی رہوں گا،میرے بعد تم ابوبکر اور عمر دونوں کی اقتدا کرنا۔‘‘ حسن،راہ الترمذی۔";
mishkaat.description = `[6061] حسن، رواہ الترمذي (3663)`;