var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي سَهْلَةَ قَالَ: قَالَ لِي عُثْمَانُ يَوْمَ الدَّارِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عَهِدَ إِلَيَّ عَهْدًا وَأَنَا صَابِرٌ عَلَيْهِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
mishkaat.urdu = "ابوسہلہ ؓ بیان کرتے ہیں،عثمان ؓ نے محاصرے کے دن مجھے فرمایا کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھ سے ایک عہد لیا تھا اور اس پر میں قائم ہوں۔‘‘ ترمذی،اور انہوں نے فرمایا: یہ حدیث حسن صحیح ہے۔صحیح،رواہ الترمذی۔";
mishkaat.description = `[6079] صحیح، رواہ الترمذي (3711)`;