var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةً لِوَقْتِهَا الْآخِرِ مَرَّتَيْنِ حَتَّى قَبَضَهُ اللَّهُ تَعَالَى. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اپنی پوری زندگی میں صرف دو مرتبہ نماز کو آخر وقت میں پڑھا ہے۔حسن،رواہ الترمذی۔";
mishkaat.description = `[608] حسن، رواہ الترمذي (174 وقال: غریب ولیس إسنادہ بمتصل .) [و وصلہ الحاکم (190/1) و صححہ علٰی شرط الشیخین ووافقہ الذہبي، وللحدیث شواھد .]`;