var mishkaat = {};
mishkaat.arabic = "عَن سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ: «أَنْتَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى إِلَّا أَنَّهُ لَا نَبِيَّ بَعْدِي» . مُتَّفَقٌ عَلَيْهِ";
mishkaat.urdu = "سعد بن ابی وقاص ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے علی ؓ سے فرمایا:’’آپ میرے لیے ایسے ہیں جیسے موسی ؑ کے لیے ہارون ؑ تھے،البتہ میرے بعد کوئی نبی نہیں۔‘‘ متفق علیہ۔";
mishkaat.description = `[6087] متفق علیہ، رواہ البخاري (3706) و مسلم (30/ 2404)`;