var mishkaat = {};
mishkaat.arabic = "وَعَن زيد بن أَرقم أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كُنْتُ مَوْلَاهُ فَعَلِيٌّ مَوْلَاهُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ";
mishkaat.urdu = "زید بن ارقم ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں جس کا دوست ہوں،علی اس کے دوست ہیں۔‘‘ اسنادہ صحیح،رواہ احمد و الترمذی۔";
mishkaat.description = `[6091] إسنادہ صحیح، رواہ أحمد (4/ 368 ح 19494) والترمذي (3713 وقال: حسن غریب)<br>٭ و للحدیث طریق کثیرۃ جدًا فھو من الأحادیث المتواترۃ .`;