var mishkaat = {};
mishkaat.arabic = "وَعَن\nبُرَيْدَة قَالَ: خطب أبي بَكْرٍ وَعُمَرُ فَاطِمَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهَا صَغِيرَةٌ» ثُمَّ خَطَبَهَا عليٌّ فزوَّجها مِنْهُ. رَوَاهُ النَّسَائِيّ";
mishkaat.urdu = "بریدہ ؓ بیان کرتے ہیں،ابوبکر و عمر ؓ نے فاطمہ ؓ سے شادی کا پیغام بھیجا تو رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ تو چھوٹی (کم سن) ہیں۔‘‘ پھر علی ؓ نے انہیں پیغام بھیجا تو آپ نے ان کی شادی ان سے کر دی۔اسنادہ صحیح،رواہ النسائی۔";
mishkaat.description = `[6104] إسنادہ صحیح، رواہ النسائي (6/ 62 ح 3223) و السند صحیح علی شرط مسلم .`;