var mishkaat = {};
mishkaat.arabic = "وَعَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَعْتِمُوا بِهَذِهِ الصَّلَاةِ فَإِنَّكُمْ قَدْ فُضِّلْتُمْ بِهَا عَلَى سَائِرِ الْأُمَمِ وَلَمْ تُصَلِّهَا أُمَّةٌ قَبْلَكُمْ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "معاذ بن جبل ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اس نماز (یعنی عشاء) کو دیر سے پڑھو،کیونکہ اس کی وجہ سے تمہیں دیگر امتوں پر فضیلت دی گئی ہے،تم سے پہلے کسی امت نے یہ نماز نہیں پڑھی۔‘‘ صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[612] إسنادہ صحیح، رواہ أبو داود (421)`;