var mishkaat = {};
mishkaat.arabic = "عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: لَمَّا نزلت هَذِه الْآيَة [ندْعُ أبناءنا وأبناءكم] دَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِيًّا وَفَاطِمَةَ وَحَسَنًا وَحُسَيْنًا فَقَالَ: «اللَّهُمَّ هَؤُلَاءِ أهل بَيْتِي» رَوَاهُ مُسلم";
mishkaat.urdu = "سعد بن ابی وقاص ؓ بیان کرتے ہیں،جب یہ آیت (نَدْعُ اَبْنَاءَ نَا وَ اَبْنَاءَ کُمْ) نازل ہوئی تو رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے علی،فاطمہ،حسن اور حسین ؓ کو بلایا اور فرمایا:’’اے اللہ! یہ میرے اہل بیت ہیں۔‘‘ رواہ مسلم۔";
mishkaat.description = `[6135] رواہ مسلم (32/ 2404)`;