var mishkaat = {};
mishkaat.arabic = "وَعَنِ الْبَرَاءِ قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْحَسَنُ بْنُ عَلِيٍّ عَلَى عَاتِقِهِ يَقُولُ: «اللَّهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ» مُتَّفق عَلَيْهِ";
mishkaat.urdu = "براء ؓ بیان کرتے ہیں،میں نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو دیکھا اس وقت حسن بن علی ؓ آپ کے کندھے پر تھے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم فرما رہے تھے:’’اے اللہ! میں اس سے محبت کرتا ہوں تو بھی اس سے محبت فرما۔‘‘ متفق علیہ۔";
mishkaat.description = `[6142] متفق علیہ، رواہ البخاري (3749) و مسلم (58/ 2422)`;