var mishkaat = {};
mishkaat.arabic = "وَعَن\nابْن عَبَّاس قَالَ: ضَمَّنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى صَدْرِهِ فَقَالَ: «اللَّهُمَّ عَلِّمْهُ الْحِكْمَةَ»\nوَفِي رِوَايَة: «علمه الْكتاب» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھے سینے سے لگا کر فرمایا:’’اے اللہ! اسے حکمت کی تعلیم عطا فرما۔‘‘ ایک دوسری روایت میں ہے:’’اسے کتاب کی تعلیم عطا فرما۔‘‘ رواہ البخاری۔";
mishkaat.description = `[6147] رواہ البخاري (3756)`;