var mishkaat = {};
mishkaat.arabic = "عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: «كُنَّا نُصَلِّي الْعَصْرَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ تُنْحَرُ الْجَزُورُ فَتُقْسَمُ عَشْرَ قِسَمٍ ثُمَّ تُطْبَخُ فَنَأْكُلُ لَحْمًا نَضِيجًا قَبْلَ مَغِيبِ الشَّمْس»";
mishkaat.urdu = "رافع بن خدیج ؓ بیان کرتے ہیں،ہم رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے ساتھ نماز عصر ادا کرتے،پھر اونٹ نحر کیا جاتا،اس کے دس حصے کیے جاتے،پھر اسے پکایا جاتا تو ہم غروب آفتاب سے پہلے پکا ہوا گوشت کھا لیتے تھے۔متفق علیہ۔";
mishkaat.description = `[615] متفق علیہ، رواہ البخاري (2485) و مسلم (625/198)`;