var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رَأَيْتُ جَعْفَرًا يَطِيرُ فِي الْجَنَّةِ مَعَ الْمَلَائِكَةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میں نے جعفر کو جنت میں فرشتوں کے ساتھ پرواز کرتے ہوئے دیکھا ہے۔‘‘ ترمذی،اور انہوں نے فرمایا: یہ حدیث غریب ہے۔حسن،رواہ الترمذی۔";
mishkaat.description = `[6162] حسن، رواہ الترمذي (3763)`;