var mishkaat = {};
mishkaat.arabic = "وَعَنِ\nابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْحَسَنَ وَالْحُسَيْنَ هُمَا رَيْحَانَيَّ مِنَ الدُّنْيَا» . رَوَاهُ التِّرْمِذِيُّ وَقَدْ سبَق فِي الْفَصْل الأول";
mishkaat.urdu = "ابن عمر ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’حسن و حسین دونوں دنیا میں میرے دو پھول ہیں۔‘‘ ترمذی۔یہ حدیث فصل اول میں بھی گزر چکی ہے۔صحیح،رواہ الترمذی۔";
mishkaat.description = `[6164] صحیح، رواہ الترمذي (3770 و قال: صحیح) [و ھو في صحیح البخاري (3753)]<br>٭ وانظر الحدیث السابق (6136)`;