var mishkaat = {};
mishkaat.arabic = "وَعَن\nيعلى بن مرَّة قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «حُسَيْنٌ مِنِّي وَأَنَا مِنْ حُسَيْنٍ أَحَبَّ اللَّهُ مَنْ أَحَبَّ حُسَيْنًا حُسَيْنٌ سِبَطٌ مِنَ الأسباط» رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "یعلی بن مرہ ؓ بیان کرتے ہیں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’حسین مجھ سے ہیں اور میں حسین سے ہوں،جو شخص حسین سے محبت کرتا ہے تو اللہ اس سے محبت کرے اور حسین میری اولاد سے ہیں۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[6169] إسنادہ حسن، رواہ الترمذي (3775 وقال: حسن)`;