var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الصَّلَوَاتِ نَحْوًا مِنْ صَلَاتِكُمْ وَكَانَ يُؤَخِّرُ الْعَتَمَةَ بَعْدَ صَلَاتكُمْ شَيْئا وَكَانَ يخف الصَّلَاة. رَوَاهُ مُسلم";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم تمہاری نمازوں کے اوقات کے مطابق ہی نمازیں پڑھا کرتے تھے،لیکن آپ نماز عشاء تمہاری نماز سے کچھ تاخیر سے پڑھا کرتے تھے،اور آپ نماز ہلکی پڑھایا کرتے تھے۔رواہ مسلم۔";
mishkaat.description = `[617] رواہ مسلم (227/ 643)`;