var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَحِبُّوا اللَّهَ لِمَا يَغْذُوكُمْ مِنْ نِعَمِهِ فَأَحِبُّونِي لِحُبِّ اللَّهِ وَأَحِبُّوا أَهْلَ بَيْتِي لحبِّي» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ سے محبت کرو کہ اس نے تمہیں نعمتوں سے نوازا ہے،اور اللہ کی محبت کی خاطر مجھ سے محبت کرو اور میری محبت کی خاطر میرے اہل بیت سے محبت کرو۔‘‘ اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[6182] إسنادہ حسن، رواہ الترمذي (3789 وقال: حسن غریب)`;