var mishkaat = {};
mishkaat.arabic = "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ تَعْجِيلًا لِلظُّهْرِ مِنْكُمْ وَأَنْتُمْ أَشَدُّ تَعْجِيلًا لِلْعَصْرِ مِنْهُ. رَوَاهُ أَحْمد وَالتِّرْمِذِيّ";
mishkaat.urdu = "ام سلمہ ؓ بیان کرتی ہیں،نماز ظہر جلد پڑھنے میں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم تم سے زیادہ سخت تھے اور نماز عصر جلدی پڑھنے میں تم ان سے زیادہ سخت ہو۔‘‘ صحیح،رواہ احمد و الترمذی۔";
mishkaat.description = `[619] صحیح، رواہ أحمد (289/6 ح 27011) والترمذي (161 وقال: حسن .)`;