var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nمُوسَى بْنِ طَلْحَةَ قَالَ: مَا رَأَيْتُ أَحَدًا أَفْصَحَ مِنْ عَائِشَةَ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ";
mishkaat.urdu = "موسی بن طلحہ ؓ بیان کرتے ہیں کہ ہم نے فصاحت و بلاغت میں عائشہ ؓ سے بڑھ کر کسی کو نہیں دیکھا۔اسے امام ترمذی نے روایت کیا ہے اور اسے حسن صحیح غریب کہا ہے۔اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[6195] إسنادہ ضعیف، رواہ الترمذي (3884)<br>٭ فیہ عبد الملک بن عمیر مدلس و عنعن و المفھوم صحیح .`;