var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اهْتَزَّ الْعَرْشُ لِمَوْتِ سَعْدِ بْنِ مُعَاذٍ»\nوَفِي رِوَايَةٍ: «اهْتَزَّ عَرْشُ الرَّحْمَنِ لِمَوْتِ سَعْدِ بن معَاذ» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،میں نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’سعد بن معاذ ؓ کی وفات پر عرش ہل گیا تھا۔‘‘ ایک دوسری روایت میں ہے:’’سعد بن معاذ ؓ کی موت پر رحمن کا عرش ہل گیا تھا۔‘‘ متفق علیہ۔";
mishkaat.description = `[6206] متفق علیہ، رواہ البخاري (3803) و مسلم (124/ 2466)`;