var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ حَبِّبْ عُبَيْدَكَ هَذَا» يَعْنِي أَبَا هُرَيْرَةَ «وَأُمَّهُ إِلَى عِبَادِكَ الْمُؤْمِنِينَ وَحَبِّبْ إِليهم الْمُؤمنِينَ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اے اللہ! اپنے اس بندے یعنی ابوہریرہ اور ان کی والدہ کو اپنے مومن بندوں کا محبوب بنا دے اور مومنوں کو ان کا محبوب بنا دے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[6213] رواہ مسلم (158/ 2491)`;