var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: كُنَّا يَوْمَ الْحُدَيْبِيَةِ أَلْفًا وَأَرْبَعَمِائَةٍ. قَالَ لَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنْتُمُ الْيَوْمَ خَيْرُ أَهْلِ الأَرْض» . مُتَّفق عَلَيْهِ";
mishkaat.urdu = "جابر ؓ نے فرمایا: صلح حدیبیہ کے موقع پر ہم چودہ سو افراد تھے،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہمیں فرمایا:’’آج زمین والوں میں سے تم سب سے بہتر ہو۔‘‘ متفق علیہ۔";
mishkaat.description = `[6228] متفق علیہ، رواہ البخاري (4154) و مسلم (71/ 1856)`;