var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم: «إِنَّ الْجَنَّةَ تَشْتَاقُ إِلَى ثَلَاثَةٍ عَلِيٍّ وَعَمَّارٍ وسلمان» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جنت تین اشخاص،علی،عمار اور سلمان ؓ کی مشتاق ہے۔‘‘ اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[6234] إسنادہ ضعیف، رواہ الترمذي (3797 و قال: حسن غریب)<br>٭ فیہ الحسن البصري مدلس مشھور و عنعن .`;