var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: اسْتَأْذَنَ عَمَّارٌ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «ائْذَنُوا لَهُ مَرْحَبًا بِالطَّيِّبِ الْمُطَيَّبِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "علی ؓ بیان کرتے ہیں،عمر ؓ نے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے اندر آنے کی اجازت طلب کی تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’انہیں اجازت دے دو۔بہت ہی اچھے شخص کے لیے خوش آمدید۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[6235] حسن، رواہ الترمذي (3798 و قال: حسن صحیح)`;