var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَبْدِ اللَّهِ بْنِ عَمْرٌو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا أَظَلَّتِ الْخَضْرَاءُ وَلَا أَقَلَّتِ الْغَبْرَاءُ أَصْدَقَ مِنْ أبي ذَر» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عبداللہ بن عمرو ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’آسمان تلے روئے زمین پر ابوذر سے زیادہ سچا آدمی کوئی نہیں۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[6238] حسن، رواہ الترمذي (3801 وقال: حسن غریب)`;