var mishkaat = {};
mishkaat.arabic = "عَن عمَارَة بن روبية قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَنْ يَلِجَ النَّارَ أَحَدٌ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا» يَعْنِي الْفَجْرَ وَالْعصر. (رَوَاهُ مُسلم)";
mishkaat.urdu = "عمارہ بن رویبہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جو شخص طلوع آفتاب سے پہلے اور غروب آفتاب سے پہلے یعنی فجر اور نماز عصر پڑھے تو وہ جہنم میں نہیں جائے گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[624] رواہ مسلم (213/ 634)`;