var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَسْلَمَ النَّاسُ وآمن عَمْرو بنُ الْعَاصِ» . رَوَاهُ التِّرْمِذِيّ وقا ل: هَذَا حَدِيث غَرِيب وَلَيْسَ إِسْنَاده بِالْقَوِيّ";
mishkaat.urdu = "عقبہ بن عامر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’لوگوں نے اسلام قبول کیا اور عمرو بن عاص ایمان لائے۔‘‘ ترمذی،اور انہوں نے فرمایا: یہ حدیث غریب ہے۔اس کی اسناد قوی نہیں۔اسنادہ حسن،رواہ الترمذی۔";
mishkaat.description = `[6245] إسنادہ حسن، رواہ الترمذي (3844) و للحدیث شاھد .`;