var mishkaat = {};
mishkaat.arabic = "وَعنهُ قا\nل: اسْتَغْفَرَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خمْسا وَعشْرين مرّة. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے میرے لیے پچیس مرتبہ مغفرت طلب کی۔اسنادہ ضعیف،رواہ الترمذی۔";
mishkaat.description = `[6247] إسنادہ ضعیف، رواہ الترمذي (3852 وقال: حسن غریب صحیح)<br>٭ فیہ أبو الزبیر مدلس و عنعن و أخرج مسلم (ح 715 بعد ح 1599) من حدیث أبی الزبیر بغیر ھذا اللفظ وھو الصحیح المحفوظ .`;