var mishkaat = {};
mishkaat.arabic = "وَعَنِ\nابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُبْغِضُ الْأَنْصَارَ أَحَدٌ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
mishkaat.urdu = "ابن عباس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ اور روز آخرت پر ایمان رکھنے والا کوئی شخص انصار سے دشمنی نہیں رکھے گا۔‘‘ ترمذی،اور انہوں نے فرمایا: یہ حدیث حسن صحیح ہے۔صحیح،رواہ الترمذی۔";
mishkaat.description = `[6250] صحیح، رواہ الترمذي (3906)`;