var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nزَيْدِ بْنِ أَرْقَمَ قَالَ: قَالَتِ الْأَنْصَارُ: يَا نَبِيَّ اللَّهِ لِكُلِّ نَبِيٍّ أَتْبَاعٌ وَإِنَّا قَدِ اتَّبَعْنَاكَ فَادْعُ اللَّهَ أَنْ يَجْعَلَ أَتْبَاعَنَا منا فَدَعَا بِهِ رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "زید بن ارقم ؓ بیان کرتے ہیں،انصار نے عرض کیا،اللہ کے نبی! ہر نبی کے پیروکار ہوتے ہیں،ہم نے بھی آپ کی اتباع کی ہے،آپ اللہ سے دعا فرمائیں کہ وہ ہمارے متبعین کو ہم میں شریک فرما دے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے اس کی دعا فرمائی۔رواہ البخاری۔";
mishkaat.description = `[6263] رواہ البخاري (3787)`;