var mishkaat = {};
mishkaat.arabic = "عَنْ أَنَسٍ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَظَرَ قِبَلَ الْيَمَنِ فَقَالَ: «اللَّهُمَّ أَقْبِلْ بِقُلُوبِهِمْ وَبَارِكْ لَنَا فِي صاعِنا ومُدِّنا» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "انس ؓ زید بن ثابت ؓ سے روایت کرتے ہیں کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے یمن کی طرف دیکھا تو فرمایا:’’اے اللہ! ان کے دلوں کو (ہماری طرف) متوجہ فرما،اور ہمارے صاع اور ہمارے مد میں برکت فرما۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[6272] حسن، رواہ الترمذي (3934 وقال: حسن غریب)`;