var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nأَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْخِلَافَةُ بِالْمَدِينَةِ وَالْمُلْكُ بِالشَّام»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’خلافت مدینہ میں ہے جبکہ بادشاہت شام میں ہے۔‘‘ اسنادہ ضعیف،رواہ البیھقی فی دلائل النبوۃ۔";
mishkaat.description = `[6279] إسنادہ ضعیف، رواہ البیہقی فی دلائل النبوۃ (6/ 447) والحاکم (3/ 72 ح 4440) فیہ سلیمان بن ابی سلیمان الھاشمی مولی ابن عباس: لا یعرف وھشیم مدلس وعنعن`;