var mishkaat = {};
mishkaat.arabic = "وَعَنْ\nعَبْدِ الرَّحْمَنِ بْنِ سُلَيْمَانَ قَالَ: سَيَأْتِي مَلِكٌ مِنْ مُلُوكِ الْعَجَمِ فَيَظْهَرُ عَلَى الْمَدَائِنِ كلِّها إِلا دمشق. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "عبد الرحمن بن سلیمان بیان کرتے ہیں،عجمی بادشاہ ظاہر ہو گا تو وہ دمشق کے علاوہ تمام شہروں پر غالب آ جائے گا۔‘‘ اسنادہ ضعیف،رواہ ابوداؤد۔";
mishkaat.description = `[6282] إسنادہ ضعیف، رواہ أبو داود (4639)<br>٭ فیہ عبد العزیز: لم أجدہ لہ ترجمۃ و لعلہ عبد اللہ بن العلاء کما یظھر من تھذیب الکمال و إن صح فالسند صحیح .`;