var mishkaat = {};
mishkaat.arabic = "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَعَالَى تَجَاوَزَ عَنْ أُمَّتِي مَا وَسْوَسَتْ بِهِ صُدُورُهَا مَا لم تعْمل بِهِ أَو تَتَكَلَّم»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بے شک اللہ نے میری امت کے دلوں میں پیدا ہونے والے وسوسوں سے درگزر فرمایا ہے جب تک وہ ان کے مطابق عمل نہ کر لیں یا بات نہ کر لیں۔‘‘ متفق علیہ،رواہ البخاری (۲۵۲۸) و مسلم۔";
mishkaat.description = `[63] متفق علیہ، رواہ البخاري (2528) و مسلم (127/ 202)`;