var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ فَكَأَنَّمَا قَامَ نِصْفَ اللَّيْلِ وَمَنْ صَلَّى الصُّبْحَ فِي جَمَاعَةٍ فَكَأَنَّمَا صَلَّى اللَّيْل كُله» . رَوَاهُ مُسلم";
mishkaat.urdu = "عثمان ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جس شخص نے نماز عشاء با جماعت ادا کی تو گویا اس نے نصف شب کا قیام کیا اور جس نے نماز صبح با جماعت ادا کی تو گویا اس نے پوری رات کا قیام کیا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[630] رواہ مسلم (260 / 656)`;