var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ الْخَنْدَقِ: حَبَسُونَا عَنْ صَلَاةِ الْوُسْطَى: صَلَاةِ الْعَصْرِ مَلَأَ اللَّهُ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا)\n(مُتَّفَقٌ عَلَيْهِ)";
mishkaat.urdu = "علی ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے غزوہ خندق کے روز فرمایا:’’انہوں نے ہمیں نماز عصر سے روک دیا،اللہ ان کے گھروں اور ان کی قبروں کو آگ سے بھر دے۔‘‘ متفق علیہ۔";
mishkaat.description = `[633] متفق علیہ، رواہ البخاري (4533) و مسلم (205 / 627)`;