var mishkaat = {};
mishkaat.arabic = "عَن ابْن مَسْعُود وَسمرَة بن جُنْدُب قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَلَاةُ الْوُسْطَى صَلَاةُ الْعَصْرِ» . رَوَاهُ التِّرْمِذِيُّ";
mishkaat.urdu = "ابن مسعود اور سمرہ بن جندب ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’درمیانی نماز سے مراد نماز عصر ہے۔‘‘ صحیح،رواہ الترمذی۔";
mishkaat.description = `[634] صحیح، رواہ الترمذي (181 حدیث ابن مسعود و قال: حدیث حسن صحیح، 182، حدیث سمرۃ بن جندب وقال: حدیث حسن .) [ورواہ مسلم: 628 من حدیث ابن مسعود رضي اللہ عنہ .]`;