var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَسْمَعُ مَدَى صَوْتِ الْمُؤَذِّنِ جِنٌّ وَلَا إِنْسٌ وَلَا شَيْءٌ إِلَّا شَهِدَ لَهُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مؤذن کی آواز کو جن و انس اور جو دوسری چیزیں سنتی ہیں وہ (سب) قیامت کے دن اس کے حق میں گواہی دیں گی۔‘‘ رواہ البخاری۔";
mishkaat.description = `[656] رواہ البخاري (609)`;