var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من أذن سبع سِنِين محتسبا كتبت لَهُ بَرَاءَةٌ مِنَ النَّارِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه.";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص ثواب کی نیت سے سات برس اذان دیتا ہے تو اس کے لیے جہنم سے خلاصی لکھ دی جاتی ہے۔‘‘ ضعیف۔";
mishkaat.description = `[664] إسنادہ ضعیف جدًا، رواہ الترمذي (206 وقال: غریب .) و أبو داود (لم أجدہ) و ابن ماجہ (727)<br>٭ فیہ جابر بن یزید الجعفي وھو ضعیف جدًا مدلس .`;