var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُرَدُّ الدُّعَاءُ بَيْنَ الْأَذَان وَالْإِقَامَة» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ";
mishkaat.urdu = "انس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اذان و اقامت کے مابین دعا رد نہیں کی جاتی۔‘‘ صحیح،رواہ ابوداؤد و النسائی۔";
mishkaat.description = `[671] صحیح، رواہ أبو داود (521) والترمذي (212) [و صححہ ابن خزیمۃ (446، 447) و ابن حبان (296) وللحدیث شواھد .]`;