var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَمِعَ الْمُؤَذِّنَ يَتَشَهَّدُ قَالَ: «وَأَنَا وَأَنَا» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،جب نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم مؤذن کو اللہ کے معبود ہونے اور محمد صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے رسول ہونے کی گواہی دیتے ہوئے سنتے تو فرماتے:’’اور میں بھی،اور میں بھی (گواہی دیتا ہوں)۔‘‘ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[677] حسن، رواہ أبو داود (526) [و صححہ ابن حبان (الإحسان: 1681) والحاکم (1/ 204)]`;