var mishkaat = {};
mishkaat.arabic = "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خَصْلَتَانِ مُعَلَّقَتَانِ فِي أَعْنَاقِ الْمُؤَذِّنِينَ لِلْمُسْلِمِينَ: صِيَامُهُمْ وَصَلَاتُهُمْ . رَوَاهُ ابْنُ مَاجَه";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’مسلمانوں کے دو امور کی ذمہ داری و حفاظت مؤذنوں کی گردنوں میں معلق ہے،ان کے روزے اور ان کی نمازیں۔‘‘ ضعیف۔";
mishkaat.description = `[688] إسنادہ ضعیف جدًا، رواہ ابن ماجہ (712)<br>٭ مروان بن سالم: متروک متھم، و بقیۃ مدلس و عنعن .`;