var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَلَاةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا الْمَسْجِدَ الْحَرَام»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میری اس مسجد (مسجد نبوی) میں ایک نماز،مسجد حرام کے علاوہ،دیگر مساجد کی ہزار نماز سے بہتر ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[692] متفق علیہ، رواہ البخاري (1190) و مسلم (1394/505)`;