var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ: مَسْجِدِ الْحَرَامِ وَالْمَسْجِدِ الْأَقْصَى وَمَسْجِدِي هَذَا";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تین مساجد،مسجد حرام،مسجد اقصیٰ اور میری اس مسجد،کے سوا کسی اور مسجد کے لیے رخت سفر نہ باندھا جائے۔‘‘ متفق علیہ۔";
mishkaat.description = `[693] متفق علیہ، رواہ البخاري (1197) و مسلم (827/415 بعد ح 1338)`;