var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ ومنبري على حَوْضِي";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتےہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’میرے گھر اور میرے منبر کے درمیان جو جگہ ہے وہ جنت کا باغیچہ ہے،اور میرا منبر میرے حوض (کوثر) پر ہو گا۔‘‘ متفق علیہ۔";
mishkaat.description = `[694] متفق علیہ، رواہ البخاري (1196) و مسلم (502/ 1391)`;