var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ وَالنَّاسِ أَجْمَعِينَ»";
mishkaat.urdu = "انسؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’تم میں سے کوئی مومن نہیں ہو سکتا حتیٰ کہ میں اسے اس کے والد،اس کی اولاد اور تمام لوگوں سے زیادہ محبوب نہ ہو جاؤں۔‘‘ متفق علیہ،رواہ البخاری (۱۵) و مسلم";
mishkaat.description = `[7]	متفق علیہ، رواہ البخاري (15) و مسلم (44/ 70)`;