var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صِيَاحُ الْمَوْلُودِ حِينَ يَقَعُ نَزْغَةٌ من الشَّيْطَان»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب بچہ پیدائش کے وقت چیختا ہے تو اس کا یہ چیخنا شیطان کے کچوکے کی وجہ سے ہوتا ہے۔‘‘ متفق علیہ،رواہ البخاری (۴۵۴۸) و مسلم س۔";
mishkaat.description = `[70] متفق علیہ، رواہ البخاري (لم أجدہ، و لہ عندہ طریق آخر بغیر ھذا اللفظ: 4548) و مسلم (148/ 2367)`;