var mishkaat = {};
mishkaat.arabic = "وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْدَمُ مِنْ سَفَرٍ إِلَّا نَهَارًا فِي الضُّحَى فَإِذَا قَدِمَ بَدَأَ بِالْمَسْجِدِ فَصَلَّى فِيهِ رَكْعَتَيْنِ ثمَّ جلس فِيهِ";
mishkaat.urdu = "کعب بن مالک ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم چاشت کے وقت سفر سے (مدینہ) واپس آیا کرتے تھے،جب آپ واپس تشریف لاتے تو سب سے پہلے مسجد میں تشریف لاتے اور وہاں دو رکعتیں پڑھتے پھر وہاں بیٹھ جاتے۔‘‘ متفق علیہ۔";
mishkaat.description = `[705] متفق علیہ، رواہ البخاري (3088) و مسلم (74/ 716)`;