var mishkaat = {};
mishkaat.arabic = "وَعَن عَائِشَة قَالَت: أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبِنَاءِ الْمَسْجِدِ فِي الدُّورِ وَأَنْ يُنَظَّفَ وَيَطَيَّبَ. رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ وَابْن مَاجَه";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے محلوں میں مسجد بنانے اور انہیں پاک صاف رکھنے کا حکم فرمایا۔‘‘ صحیح،رواہ ابوداؤد و الترمذی و ابن ماجہ۔";
mishkaat.description = `[717] صحیح، رواہ أبو داود (455) والترمذي (594) و ابن ماجہ (758) [و صححہ ابن حبان: 306]`;