var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِن الشَّيْطَان قد أيس أَنْ يَعْبُدَهُ الْمُصَلُّونَ فِي جَزِيرَةِ الْعَرَبِ وَلَكِنَّ فِي التحريش بَينهم» . رَوَاهُ مُسلم";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’شیطان اس بات سے مایوس ہو چکا ہے کہ جزیرہ عرب میں نمازی اس کی پوجا کریں،لیکن وہ انہیں آپس میں لڑانے کی کوشش کرتا رہے گا۔‘‘ رواہ مسلم۔";
mishkaat.description = `[72] رواہ مسلم (65/ 2812)`;