var mishkaat = {};
mishkaat.arabic = "وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَشِّرِ الْمَشَّائِينَ فِي الظُّلَمِ إِلَى الْمَسَاجِدِ بِالنُّورِ التَّامِّ يَوْمَ الْقِيَامَةِ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد";
mishkaat.urdu = "بریدہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اندھیرے میں چل کر مسجد کی طرف آنے والوں کو روز قیامت مکمل نور کی خوشخبری سنا دو۔‘‘ صحیح۔";
mishkaat.description = `[721] صحیح، رواہ الترمذي (223 و قال: غریب .) و أبو داود (561) [وللحدیث شواھد .]`;