var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَتَى الْمَسْجِدَ لِشَيْءٍ فَهُوَ حَظُّهُ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص جس چیز کے لیے مسجد میں جاتا ہے وہی اس کا نصیب ہو گی،(جو اسے آخرت میں ملے گی)۔‘‘ ضعیف۔";
mishkaat.description = `[730] سندہ ضعیف، رواہ أبو داود (472)<br>٭ عثمان بن أبی العاتکۃ ضعیف ضعفہ الجمھور .`;