var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ\nقَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَلُّوا فِي مَرَابِضِ الْغَنَمِ وَلَا تُصَلُّوا فِي أَعْطَانِ الْإِبِلِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بکریوں کے باڑے میں نماز پڑھو لیکن اونٹوں کے باڑے میں نماز نہ پڑھو۔‘‘ حسن،رواہ الترمذی۔";
mishkaat.description = `[739] حسن، رواہ الترمذي (348 وقال: حسن صحیح .) [و ابن ماجہ (768) و صححہ ابن خزیمۃ (795) و ابن حبان (336) وللحدیث شواھد .]`;