var mishkaat = {};
mishkaat.arabic = "عَن عمر بن أبي سَلمَة قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُشْتَمِلًا بِهِ فِي بَيْتِ أُمِّ سَلَمَةَ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقيهِ";
mishkaat.urdu = "عمر بن ابی سلمہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو ام سلمہ ؓ کے گھر ایک کپڑے میں لپٹے ہوئے نماز پڑھتے دیکھا،آپ نے اس کپڑے کے دو کنارے اپنے کندھوں پر رکھے ہوئے تھے۔متفق علیہ۔";
mishkaat.description = `[754] متفق علیہ، رواہ البخاري (355، 356) و مسلم (278 /517)`;