var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ صَلَّى فِي ثَوْبٍ وَاحِدٍ فليخالف بَين طَرفَيْهِ» . رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،میں نے رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو فرماتے ہوئے سنا:’’جو شخص ایک کپڑے میں نماز پڑھے تو وہ اس کے دونوں کناروں کو ایک دوسرے کے مخالف سمت کر لے (دائیں کنارے کو بائیں کندھے پر اور بائیں کنارے کو دائیں کندھے پر)۔‘‘ رواہ البخاری۔";
mishkaat.description = `[756] رواہ البخاري (360)`;