var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُقْبَلُ صَلَاةُ حَائِضٍ إِلَّا بِخِمَارٍ» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کسی بالغہ عورت کی ننگے سر نماز قبول نہیں ہوتی۔‘‘ صحیح،رواہ ابوداؤد و الترمذی۔";
mishkaat.description = `[762] صحیح، رواہ أبو داود (641) والترمذي (377 وقال: حسن .) [و صححہ ابن خزیمۃ (775) و ابن حبان (الإحسان: 1708، 1709) والحاکم علٰی شرط مسلم (1/ 251) ووافقہ الذہبي .]`;