var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَهَى عَنِ السَّدْلِ فِي الصَّلَاةِ وَأَنْ يُغَطِّيَ الرَّجُلُ فَاهُ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے دوران نماز گلے میں کپڑا لٹکانے اور منہ ڈھانپنے سے منع فرمایا۔ضعیف۔";
mishkaat.description = `[764] إسنادہ ضعیف، رواہ أبو داود (643) و الترمذي (378)<br>٭ فیہ الحسن بن ذکوان مدلس و عنعن و فی السند الثاني: عسل بن سفیان ضعیف . وانظر أنوار الصحیفۃ (د 643)`;