var mishkaat = {};
mishkaat.arabic = "وَعَنْ شَدَّادِ بْنِ أَوْسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَالِفُوا الْيَهُودَ فَإِنَّهُمْ لَا يُصَلُّونَ فِي نِعَالِهِمْ وَلَا خِفَافِهِمْ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "شداد بن اوس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا: یہودیوں کی مخالفت کرو کیونکہ وہ اپنے جوتوں اور موزوں میں نماز نہیں پڑھتے۔‘‘ صحیح۔";
mishkaat.description = `[765] إسنادہ صحیح، رواہ أبو داود (652) [و صححہ ابن حبان (357) والحاکم (260/1) ووافقہ الذہبي .]`;