var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عُمَرَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْدُو إِلَى الْمُصَلَّى وَالْعَنَزَةُ بَيْنَ يَدَيْهِ تُحْمَلُ وَتُنْصَبُ بِالْمُصَلَّى بَيْنَ يَدَيْهِ فَيصَلي إِلَيْهَا. رَوَاهُ البُخَارِيّ";
mishkaat.urdu = "ابن عمر ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم صبح کے وقت عید گاہ کی طرف جاتے ایک چھوٹا نیزہ آپ کے آگے آگے اٹھا کر لے جایا جاتا اور اسے عید گاہ میں آپ کے سامنے گاڑ دیا جاتا،پھر آپ اس کی طرف رخ کر کے نماز پڑھتے۔رواہ البخاری۔";
mishkaat.description = `[772] رواہ البخاري (973)`;