var mishkaat = {};
mishkaat.arabic = "وَعَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا وَضَعَ أَحَدُكُمْ بَيْنَ يَدَيْهِ مِثْلَ مُؤْخِرَةِ الرَّحْلِ فَليصل وَلَا يبال من مر وَرَاء ذَلِك» . رَوَاهُ مُسلم";
mishkaat.urdu = "طلحہ بن عبید اللہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کوئی شخص پالان کی پچھلی لکڑی کے برابر کوئی چیز اپنے آگے رکھ لے تو وہ نماز پڑھے اور جو اس سے پرے گزرے اس کی کوئی پرواہ نہ کرے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[775] رواہ مسلم (241 / 499)`;