var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ وَأَنَا مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ كَاعْتِرَاضِ الْجَنَازَةِ";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نماز تہجد پڑھا کرتے تھے جبکہ میں،آپ کے اور قبلہ کے درمیان اس طرح لیٹی ہوتی تھی جس طرح (امام کے آگے) جنازہ رکھا ہوتا ہے۔متفق علیہ۔";
mishkaat.description = `[779] متفق علیہ، رواہ البخاري (383، 384) و مسلم (267/ 512)`;