var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْطَعُ الصَّلَاةَ شَيْء وادرؤوا مَا اسْتَطَعْتُمْ فَإِنَّمَا هُوَ شَيْطَانٌ» . رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "ابوسعید ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’کوئی چیز نماز کو نہیں توڑتی،پس مقدور بھر اسے روکو،کیونکہ وہ (گزرنے والا) شیطان ہے۔‘‘ حسن،رواہ ابوداؤد۔";
mishkaat.description = `[785] حسن، رواہ أبو داود (719) [و للحدیث شاھد قوي عند الدارقطني (1/ 367)]`;