var mishkaat = {};
mishkaat.arabic = "وَعَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّنَا فَيَأْخُذُ شِمَالَهُ بِيَمِينِهِ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَه";
mishkaat.urdu = "قبیصہ بن ہلب ؒ اپنے والد (ھُلب ؓ) سے روایت کرتے ہیں،انہوں نے کہا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ہمیں نماز پڑھاتے تو آپ دائیں ہاتھ سے بائیں کو پکڑ لیتے۔اسنادہ حسن،رواہ الترمذی و ابن ماجہ۔";
mishkaat.description = `[803] إسنادہ حسن، رواہ الترمذي (252 وقال: حسن .) و ابن ماجہ (809) [و عند أحمد (226/5): ’’یضع ھذہ علٰی صدرہ‘‘ وسندہ حسن]`;