var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَلِيِّ بْنِ الْحُسَيْنِ مُرْسَلًا قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي الصَّلَاة كلما خفض وَرفع فَلم تزل صلَاته حَتَّى لَقِي الله تَعَالَى. رَوَاهُ مَالك";
mishkaat.urdu = "علی بن حسین ؒ سے مرسل روایت ہے انہوں نے کہا: رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نماز میں جب جھکتے اور جب اٹھتے تو اللہ اکبر کہا کرتے تھے،آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم پوری زندگی اسی طرح نماز پڑھتے رہے۔صحیح،رواہ مالک۔";
mishkaat.description = `[808] صحیح، رواہ مالک (1/ 76 ح 161)<br>٭ السند مرسل و للحدیث شواھد کثیرۃ و ھو بھا صحیح .`;