var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ اسْتَقْبَلَ الْقِبْلَةَ وَرَفَعَ يَدَيْهِ وَقَالَ: الله أكبر. رَوَاهُ ابْن مَاجَه";
mishkaat.urdu = "ابوحمید ساعدی ؓ بیان کرتے ہیں،جب رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نماز کے لیے کھڑے ہوتے تو قبلہ رخ ہو کر ہاتھ اٹھاتے اور ’’اللہ اکبر‘‘ کہتے۔صحیح،رواہ ابن ماجہ۔";
mishkaat.description = `[810] إسنادہ صحیح، رواہ ابن ماجہ (803) [وتقدم طرفہ: 801]`;