var mishkaat = {};
mishkaat.arabic = "وَرَوَاهُ ابْنُ مَاجَهْ عَنْ أَبِي سَعِيدٍ\nوَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَارِثَةَ وَقَدْ تُكُلِّمَ فِيهِ مِنْ قِبَلِ حفظه";
mishkaat.urdu = "ابن ماجہ نے اسے ابوسعید ؓ سے روایت کیا ہے،اور امام ترمذی نے فرمایا: ہم اس حدیث کو صرف حارثہ کے واسطہ سے جانتے ہیں۔جبکہ اس کی کمزور قوت یادداشت کی وجہ سے اس پر کلام کیا گیا ہے۔حسن۔";
mishkaat.description = `[816] حسن، رواہ ابن ماجہ (804) [و أبو داود کما سیأتي (1217) و صححہ ابن خزیمۃ (467)]`;