var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْفَجْرِ ب (ق وَالْقُرْآن الْمجِيد)\nوَنَحْوِهَا وَكَانَتْ صَلَاتُهُ بَعْدُ تَخْفِيفًا. رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نماز فجر میں (ق والقرآن المجید،،،،،) اور اس طرح کی سورتیں پڑھا کرتے تھے،اور اس (یعنی نماز فجر) کے بعد آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی باقی نمازیں مختصر ہوتی تھیں۔رواہ مسلم۔";
mishkaat.description = `[835] رواہ مسلم (168/ 458)`;