var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يقْرَأ فِي الْفجْر يَوْم الْجُمُعَة ب (الم تَنْزِيلُ)\nفِي الرَّكْعَةِ الْأُولَى وَفِي الثَّانِيَةِ (هَل أَتَى على الْإِنْسَان)";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جمعہ کے روز نماز فجر کی پہلی رکعت میں سورۂ سجدہ اور دوسری رکعت میں سورۂ دہر پڑھا کرتے تھے۔متفق علیہ۔";
mishkaat.description = `[838] متفق علیہ، رواہ البخاري (891) و مسلم (65 / 880)`;