var mishkaat = {};
mishkaat.arabic = "عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتَتِحُ صَلَاتَهُ بِ (بِسم الله الرَّحْمَن الرَّحِيم)\nرَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَاكَ";
mishkaat.urdu = "ابن عباس ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اپنی نماز (بسم اللہ الرحمن الرحیم) سے شروع کیا کرتے تھے۔ترمذی،اور انہوں نے فرمایا: اس حدیث کی سند قوی نہیں۔حسن،رواہ الترمذی۔";
mishkaat.description = `[844] حسن، رواہ الترمذي (245)<br>٭ قلت: أخطأ الإمام الترمذي فضعفہ.`;