var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الْمَغْرِبِ لَيْلَةَ الْجُمُعَةِ: (قُلْ يَا أَيُّهَا الْكَافِرُونَ)\nو (قل هُوَ الله أحد)\nرَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "جابر بن سمرہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جمعہ کی رات نماز مغرب میں سورۃ الکافرون اور سورۃ الاخلاص تلاوت کیا کرتے تھے۔ضعیف۔";
mishkaat.description = `[849] ضعیف، رواہ البغوي في شرح السنۃ (3/ 81 تحت ح 605 بدون سند) [والبیھقي (2/ 391)] بإسناد ضعیف.<br>٭ سعید بن سماک بن حرب: ضعیف علٰی الراجح .`;