var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ قَالَ: قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْمَغْرِبِ بِ (حم الدُّخَانِ)\nرَوَاهُ النَّسَائِيّ مُرْسلا";
mishkaat.urdu = "عبداللہ بن عتبہ بن مسعود بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے نماز مغرب میں سورۃ الدخان تلاوت فرمائی۔امام نسائی نے اسے مرسل روایت کیا ہے۔صحیح،رواہ النسائی۔";
mishkaat.description = `[867] إسنادہ صحیح، رواہ النسائي (169/2 ح 989)<br>٭ عبد اللہ بن عتبۃ بن مسعود: ممن رأي النبي ﷺ وھو صحابي صغیر رضي اللہ عنہ .`;