var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ بن بُحَيْنَة قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ فَرَّجَ بَيْنَ يَدَيْهِ حَتَّى يَبْدُوَ بَيَاض إبطَيْهِ";
mishkaat.urdu = "عبداللہ بن مالک بن بحینہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم جب سجدہ کرتے تو اپنے ہاتھوں کے مابین فاصلہ رکھتے حتیٰ کہ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی بغلوں کی سفیدی نظر آ جاتی۔متفق علیہ۔";
mishkaat.description = `[891] متفق علیہ، رواہ البخاري (390) و مسلم (235 / 495)`;