var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي سُجُودِهِ: «اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ وَأَوَّلَهُ وَآخره وعلانيته وسره» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اپنے سجدوں میں یہ دعا کیا کرتے تھے:’’اے اللہ! میرے چھوٹے،بڑے،پہلے،پچھلے،ظاہر اور پوشیدہ تمام گناہ معاف فرما دے۔‘‘ رواہ مسلم۔";
mishkaat.description = `[892] رواہ مسلم (216/ 483)`;