var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ ساجد فَأَكْثرُوا الدُّعَاء» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’بندہ سجدے کی حالت میں اپنے رب کے انتہائی قریب ہوتا ہے،پس (سجدے کی حالت میں) زیادہ دعائیں کرو۔‘‘ رواہ مسلم۔";
mishkaat.description = `[894] رواہ مسلم (215 / 482)`;