var mishkaat = {};
mishkaat.arabic = "وَعَن الْعَبَّاس بن عبد الْمطلب قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ذَاقَ طَعْمَ الْإِيمَانِ مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا» . رَوَاهُ مُسْلِمٌ";
mishkaat.urdu = "عباس بن عبدالمطلبؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جو شخص اللہ کے رب ہونے،اسلام کے دین ہونے اور محمد صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے رسول ہونے پر راضی ہو گیا اس نے ایمان کی لذت کو پا لیا۔‘‘ رواہ مسلم";
mishkaat.description = `[9]	رواہ مسلم (34/ 56)`;