var mishkaat = {};
mishkaat.arabic = "وَعَن طلق بن عَليّ الْحَنَفِيّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَى صَلَاةِ عَبْدٍ لَا يُقِيمُ فِيهَا صُلْبَهُ بَيْنَ ركوعها وسجودها» . رَوَاهُ أَحْمد";
mishkaat.urdu = "طلق بن علی حنفی ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اللہ عزوجل اس بندے کی نماز کی طرف دیکھتا بھی نہیں جو دوران نماز رکوع و سجود میں اپنی کمر سیدھی نہیں کرتا۔‘‘ ضعیف۔";
mishkaat.description = `[904] سندہ ضعیف، رواہ أحمد (4/ 22 ح 16393)<br>٭ السند منقطع و عکرمۃ بن عمار عنعن .`;