var mishkaat = {};
mishkaat.arabic = "وَعَنْهُ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَرَّارِيِّ الْمُشْرِكِينَ قَالَ: «اللَّهُ أعلم بِمَا كَانُوا عاملين»";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے مشرکین کی اولاد کے بارے میں دریافت کیا گیا،تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’ان کے اعمال کے متعلق اللہ بہتر جانتا ہے۔‘‘ متفق علیہ،رواہ البخاری (۱۳۸۴) و مسلم۔";
mishkaat.description = `[93] متفق علیہ، رواہ البخاري (1384) و مسلم (27 / 2659)`;