var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: مَنْ صَلَّى عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ وَمَلَائِكَتُهُ سَبْعِينَ صَلَاةً. رَوَاهُ أَحْمد";
mishkaat.urdu = "عبداللہ بن عمرو ؓ نے فرمایا: جو شخص نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم پر ایک مرتبہ درود بھیجتا ہے تو اللہ اور اس کے فرشتے اس پر ستر رحمتیں نازل فرماتے ہیں۔ضعیف۔";
mishkaat.description = `[935] إسنادہ ضعیف، رواہ أحمد (2/ 187 ح 6754)<br>٭ عبد اللہ بن لھیعۃ مدلس و ضعیف لإختلاطہ و لم یحدث بہ قبل اختلاطہ .`;