var mishkaat = {};
mishkaat.arabic = "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِنَّ الدُّعَاءَ مَوْقُوفٌ بَيْنَ السَّمَاءِ وَالْأَرْضِ لَا يَصْعَدُ مِنْهُ شَيْءٌ حَتَّى تُصَلِّيَ عَلَى نبيك. رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عمر بن خطاب ؓ بیان کرتے ہیں،جب تک تم اپنے نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم پر درود نہ بھیجو تو تمہاری دعا آسمان اور زمین کے درمیان موقوف رہتی ہے اور اس میں سے کوئی چیز بھی اوپر نہیں چڑھتی۔ضعیف۔";
mishkaat.description = `[938] إسنادہ ضعیف، رواہ الترمذي (486)<br>٭ فیہ أبو قرۃ الأسدي: مجھول .`;