var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَ: كُنْتُ أَرَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ حَتَّى أرى بَيَاض خَدّه. رَوَاهُ مُسلم";
mishkaat.urdu = "عامر بن سعد ؓ اپنے والد سے روایت کرتے ہیں،انہوں نے کہا: میں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کو دائیں بائیں سلام پھیرتے ہوئے دیکھتا تھا حتیٰ کہ میں آپ کے رخسار کی سفیدی بھی دیکھتا تھا۔رواہ مسلم۔";
mishkaat.description = `[943] رواہ مسلم (119/ 582)`;