var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ أَكْثَرُ انْصِرَافِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ صَلَاتِهِ إِلَى شِقِّهِ الْأَيْسَرِ إِلَى حُجْرَتِهِ. رَوَاهُ فِي شرح السّنة";
mishkaat.urdu = "عبداللہ بن مسعود ؓ بیان کرتے ہیں،نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم زیادہ تر اپنی نماز سے اپنی بائیں طرف،اپنے حجرے کی طرف پھرا کرتے تھے۔";
mishkaat.description = `[952] حسن، رواہ البغوي في شرح السنۃ (3/ 211 تحت ح 702) بدون سند [و رواہ أحمد (1/ 459) وسندہ حسن .]`;