var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَضَّهُمْ عَلَى الصَّلَاةِ وَنَهَاهُمْ أَنْ يَنْصَرِفُوا قَبْلَ انْصِرَافِهِ مِنَ الصَّلَاةِ. رَوَاهُ أَبُو دَاوُدَ";
mishkaat.urdu = "انس ؓ سے روایت ہے کہ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے انہیں نماز پر ترغیب دلائی اور آپ نے انہیں آپ کے (ان کی طرف پھرنے) سے پہلے اٹھ کر جانے سے منع فرمایا۔صحیح،رواہ ابوداؤد۔";
mishkaat.description = `[954] صحیح، رواہ أبو داود (624) [و للحدیث طریق آخر عند أحمد (3/ 240 ح 13561)]`;