var mishkaat = {};
mishkaat.arabic = "وَعَنْ جَابِرٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي صَلَاتِهِ بَعْدَ التَّشَهُّدِ: «أَحْسَنُ الْكَلَامِ كَلَامُ اللَّهِ وَأَحْسَنُ الْهَدْيِ هدي مُحَمَّد» . رَوَاهُ النَّسَائِيّ";
mishkaat.urdu = "جابر ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم اپنی نماز میں تشہد کے بعد یہ کہا کرتے تھے:’’بہترین کلام اللہ کا کلام ہے اور سب سے بہترین طریقہ محمد (صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم) کا طریقہ ہے۔‘‘ صحیح،رواہ النسائی۔";
mishkaat.description = `[956] صحیح، رواہ النسائي (3/ 58 ح 1312)`;