var mishkaat = {};
mishkaat.arabic = "وَعَنْ سَمُرَةَ قَالَ: أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَرُدَّ عَلَى الْإِمَامِ وَنَتَحَابَّ وَأَنْ يُسَلِّمَ بَعْضُنَا عَلَى بَعْضٍ. رَوَاهُ أَبُو دَاوُد";
mishkaat.urdu = "سمرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہمیں حکم دیا کہ ہم امام کے سلام کا جواب دیں،باہم محبت کریں اور ایک دوسرے کو سلام کریں۔ضعیف۔";
mishkaat.description = `[958] إسنادہ ضعیف، رواہ أبو داود (1001) [و ابن ماجہ: 921]<br>٭ قتادۃ مدلس و عنعن .`;