var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي أُمَامَةَ قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ أَيُّ الدُّعَاءِ أَسْمَعُ؟ قَالَ: «جَوْفُ اللَّيْلِ الآخر ودبر الصَّلَوَات المكتوبات» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "ابوامامہ ؓ بیان کرتے ہیں،عرض کیا گیا،اللہ کے رسول! کون سی دعا زیادہ قبول ہوتی ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’آخری نصف شب میں اور فرض نمازوں کے بعد کی گئی دعا۔‘‘ ضعیف";
mishkaat.description = `[968] إسنادہ ضعیف، رواہ الترمذي (3499 وقال: حسن .) [و سیأتي (1231)]<br>٭ عبد الرحمٰن بن سابط عن أبي أمامۃ رضي اللہ عنہ منقطع، لم یسمع منہ .`;