var mishkaat = {};
mishkaat.arabic = "وَرَوَى التِّرْمِذِيُّ نَحْوَهُ عَنْ أَبِي ذَرٍّ إِلَى قَوْلِهِ: «إِلَّا الشِّرْكَ» وَلَمْ يَذْكُرْ: «صَلَاةَ الْمَغْرِبِ وَلَا بِيَدِهِ الْخَيْرُ» وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيح غَرِيب";
mishkaat.urdu = "امام ترمذی ؒ نے ((الا الشرک)) تک ابوذر ؓ سے اسی طرح روایت کیا ہے اور انہوں نے نماز مغرب اور ((بیدہ الخیر)) کا ذکر نہیں کیا،اور انہوں نے کہا: یہ حدیث حسن صحیح غریب ہے۔حسن۔";
mishkaat.description = `[976] حسن، رواہ الترمذي (3474)<br>٭ شھر بن حوشب حسن الحدیث و ثقہ الجمھور کما حققتہ في تخریج النھایۃ فی الفتن و الملاحم (260)`;