var mishkaat = {};
mishkaat.arabic = "وَعَنْ مُعَيْقِيبٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يُسَوِّي التُّرَابَ حَيْثُ يَسْجُدُ؟ قَالَ: «إِنْ كُنْتَ فَاعِلًا فَوَاحِدَةً»";
mishkaat.urdu = "معیقیب ؓ نبی صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے اس شخص کے بارے میں روایت کرتے ہیں،جو سجدہ کی جگہ پر مٹی درست کرتا ہے؟ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’اگر تم نے ضرور ہی کرنا ہے تو پھر ایک مرتبہ کر لے۔‘‘ متفق علیہ۔";
mishkaat.description = `[980] متفق علیہ، رواہ البخاري (1207) و مسلم (47/ 546)`;