var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الِالْتِفَاتِ فِي الصَّلَاةِ فَقَالَ: «هُوَ اختلاس يختلسه الشَّيْطَان من صَلَاة العَبْد»";
mishkaat.urdu = "عائشہ ؓ بیان کرتی ہیں،میں نے نماز میں ادھر ادھر دیکھنے کے بارے میں رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم سے دریافت کیا تو آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’وہ تو اچک لینا ہے،شیطان بندے کی نماز سے اچک لیتا ہے۔‘‘ متفق علیہ۔";
mishkaat.description = `[982] متفق علیہ، رواہ البخاري (751) و مسلم (لم أجدہ)`;