var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ رَفْعِهِمْ أَبْصَارَهُمْ عِنْدَ الدُّعَاءِ فِي الصَّلَاةِ إِلَى السَّمَاءِ أَوْ لَتُخْطَفَنَّ أَبْصَارهم» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوہریرہ ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’لوگوں کو دوران نماز،دعا کے وقت اپنی آنکھیں آسمان کی طرف اٹھانے سے باز آ جانا چاہیے،یا ان کی آنکھیں اچک لی جائیں گی۔‘‘ رواہ مسلم۔";
mishkaat.description = `[983] رواہ مسلم (118/ 429)`;