var mishkaat = {};
mishkaat.arabic = "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَكْظِمْ مَا اسْتَطَاعَ فَإِنَّ الشَّيْطَانَ يَدْخُلُ» . رَوَاهُ مُسلم";
mishkaat.urdu = "ابوسعید خدری ؓ بیان کرتے ہیں،رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا:’’جب تم میں سے کسی شخص کو دوران نماز جمائی آئے تو جس قدر ہو سکے اسے روکے کیونکہ (منہ کھلا ہو تو) شیطان داخل ہو جاتا ہے۔‘‘ اسے مسلم نے روایت کیا ہے۔رواہ مسلم۔";
mishkaat.description = `[985] رواہ مسلم (59/ 2996)`;