var mishkaat = {};
mishkaat.arabic = "وَفِي رِوَايَةِ الْبُخَارِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ: إِذَا تَثَاءَبَ أَحَدُكُمْ فِي الصَّلَاةِ فَلْيَكْظِمْ مَا اسْتَطَاعَ وَلَا يَقُلْ: هَا فَإِنَّمَا ذَلِكُمْ مِنَ الشَّيْطَان يضْحك مِنْهُ";
mishkaat.urdu = "اور ابوہریرہ ؓ سے مروی صحیح بخاری کی روایت میں ہے:’’جب تم میں سے کسی شخص کو دوران نماز جمائی آئے،تو جس قدر ہو سکے اسے روکے،ہا ہا نہ کرے،یہ تو محض شیطان کی طرف سے ہے،وہ اس پر ہنستا ہے۔‘‘ رواہ البخاری۔";
mishkaat.description = `[986] رواہ البخاري (6226)`;