var mishkaat = {};
mishkaat.arabic = "وَعَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنْ جَدِّهِ رَفَعَهُ قَالَ: «الْعُطَاسُ وَالنُّعَاسُ وَالتَّثَاؤُبُ فِي الصَّلَاةِ وَالْحَيْضُ وَالْقَيْءُ وَالرُّعَافُ مِنَ الشَّيْطَانِ» . رَوَاهُ التِّرْمِذِيّ";
mishkaat.urdu = "عدی بن ثابت اپنے باپ سے اور وہ اپنے دادا سے مرفوع روایت کرتے ہیں،فرمایا:’’دوران نماز چھینکیں،اونگھ،جمائی،حیض،قے کا آنا نیز نکسیر کا پھوٹنا شیطان کی طرف سے ہے۔‘‘ ضعیف۔";
mishkaat.description = `[999] إسنادہ ضعیف، رواہ الترمذي (2748 وقال: غریب .) [و ابن ماجہ: 969]<br>٭ أبو الیقظان عثمان بن عمیر: ضعیف .`;