var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا ذَهَبَ الْمَذْهَبَ أَبْعَدَ";
abudawood.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ جب خلا (پیشاب پاخانے) کے لیے جاتے تو (آبادی سے) دور چلے جاتے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `محمد بن عمرو بن علقمۃ اللیثی: وثقہ الجمہور`;