var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى عَنْ أَبِي زَيْدٍ عَنْ مَعْقِلِ بْنِ أَبِي مَعْقِلٍ الْأَسَدِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَقْبِلَ الْقِبْلَتَيْنِ بِبَوْلٍ أَوْ غَائِطٍ قَالَ أَبُو دَاوُد وَأَبُو زَيْدٍ هُوَ مَوْلَى بَنِي ثَعْلَبَةَ";
abudawood.urdu = "سیدنا معقل بن ابی معقل رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے پیشاب پاخانے کے وقت قبلتین (بیت الحرام اور بیت المقدس) کی جانب منہ کرنے سے منع فرمایا ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں: ’’ابوزید،بنو ثعلبہ قبیلے کے آزاد کردہ غلام تھے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (319)<br>قال البوصیري في زوائد ابن ماجہ: ’’أبو زید مجہول الحال فالحدیث ضعیف بہ‘‘<br>وضعفہ الحافظ في فتح الباري (1/ 246)`;
abudawood.anwaar = [13,1];