var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو الْوَلِيدِ وَسَهْلُ بْنُ حَمَّادٍ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ قَالَ جَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْرَجْنَا لَهُ مَاءً فِي تَوْرٍ مِنْ صُفْرٍ فَتَوَضَّأَ";
abudawood.urdu = "سیدنا عبداللہ بن زید رضی اللہ عنہ کہتے ہیں کہ (ایک بار) رسول اللہ ﷺ ہمارے ہاں تشریف لائے تو ہم نے آپ ﷺ کے لیے پیتل کے برتن میں پانی پیش کیا اور آپ ﷺ نے اس سے وضو کیا۔";
abudawood.hukam = "صحیح بخاری (191، 197) صحیح مسلم (235)";
abudawood.description = ``;