var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ أَبُو الْجَمَاهِرِ،حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ،عَنْ قَتَادَةَ عَنِ الْحَسَنِ،عَنْ سَمُرَةَ،قَالَ: أَمَرَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَرُدَّ عَلَى الْإِمَامِ،وَأَنْ نَتَحَابَّ،وَأَنْ يُسَلِّمَ بَعْضُنَا عَلَى بَعْضٍ.";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے ہمیں حکم فرمایا کہ امام کو (اس کے سلام کا) جواب دیں،اور یہ کہ آپس میں محبت رکھیں اور ایک دوسرے کو سلام کیا کریں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (922)<br>قتادۃ عنعن`;
abudawood.anwaar = [47,1];