var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ عِيسَى بْنِ حِطَّانَ،عَنْ مُسْلِمِ بْنِ سَلَّامٍ،عَنْ عَلِيِّ بْنِ طَلْقٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا فَسَا أَحَدُكُمْ فِي الصَّلَاةِ, فَلْيَنْصَرِفْ فَلْيَتَوَضَّأْ،وَلْيُعِدْ صَلَاتَهُ";
abudawood.urdu = "سیدنا علی بن طلق رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی نماز میں پھسکی مارے،(ہوا خارج کرے) تو چاہیئے کہ نماز توڑ دے اور وضو کرے اور اپنی نماز دہرائے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (205)`;