var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادٌ وَعَبْدُ الْوَارِثِ،عَنْ لَيْثٍ عَنِ الْحَجَّاجِ بْنِ عُبَيْدٍ،عَنْ إِبْرَاهِيمَ بْنِ إِسْمَاعِيلَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيَعْجِزُ أَحَدُكُمْ, قَالَ عَنْ عَبْدِ الْوَارِثِ: أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ،أَوْ عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ . زَادَ فِي حَدِيثِ حَمَّادٍ فِي الصَّلَاةِ .-يَعْنِي: فِي السُّبْحَةِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کیا تم اس بات سے عاجز ہو کہ (فرضوں کے بعد) آگے،پیچھے یا دائیں،بائیں ہو جاؤ،یعنی نفل پڑھنے کے لیے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1427)<br>لیث بن أبي سلیم ضعیف<br>وھذا الحدیث ضعفہ البخاري في صحیحہ (848)`;
abudawood.anwaar = [48,1];