var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى عَنْ يَعْقُوبَ بْنِ سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ تَعَالَى عَلَيْهِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہرسول اللہ ﷺ نے فرمایا ’’جس کا وضو نہیں اس کی نماز نہیں اور جو شخص وضو کے شروع میں اللہ کا نام نہ لے («بسم اللہ» نہ پڑھے) اس کا وضو نہیں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (403)
وللحدیث شواہد منہا ما أخرجہ ابن ماجہ (397) وسندہ حسن`;