var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنِ الْأَوْزَاعِيِّ عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِي هُرَيْرَةَ... بِهَذِهِ الْقِصَّةِ. قَالَ: وَلَمْ يَسْجُدْ سَجْدَتَيِ السَّهْوِ،حَتَّى يَقَّنَهُ اللَّهُ ذَلِكَ.";
abudawood.urdu = "سعید بن مسیب،ابوسلمہ اور عبیداللہ بن عبداللہ (تینوں) سیدنا ابوہریرہ رضی اللہ عنہ سے یہ قصہ بیان کرتے ہیں،انہوں نے کہا کہ نبی کریم ﷺ نے سہو کے سجدے نہیں کیے حتیٰ کہ اﷲ نے آپ کو اس کا یقین دلا دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن کثیر الصنعاني ضعیف`;
abudawood.anwaar = [48,1];