var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا شُعْبَةُ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ سَمِعَ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ،فَسَلَّمَ فِي الرَّكْعَتَيْنِ،فَقِيلَ لَهُ: نَقَصْتَ الصَّلَاةَ! فَصَلَّى رَكْعَتَيْنِ،ثُمَّ سَجَدَ سَجْدَتَيْنِ.";
abudawood.urdu = "ابوسلمہ بن عبدالرحمٰن،سیدنا ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی کریم ﷺ نے ظہر کی نماز پڑھائی تو آپ ﷺ نے دو رکعتوں پر سلام پھیر دیا۔آپ ﷺ سے کہا گیا: (کیا) نماز کم ہو گئی ہے؟ تب آپ ﷺ نے دو رکعتیں (مزید) پڑھیں پھر دو سجدے کیے۔";
abudawood.hukam = "صحیح بخاری (715)";
abudawood.description = ``;