var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ،حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ،عَنْ ضَمْضَمِ بْنِ جَوْسٍ الْهِفَّانِيِّ،حَدَّثَنِي أَبُو هُرَيْرَةَ... بِهَذَا الْخَبَرِ. قَالَ: ثُمَّ سَجَدَ سَجْدَتَيِ السَّهْوِ بَعْدَ مَا سَلَّمَ.";
abudawood.urdu = "ضمضم بن جوس ہفانی نے سیدنا ابوہریرہ رضی اللہ عنہ سے یہ خبر بیان کی،کہا کہ پھر آپ نے سلام کے بعد سہو کے دو سجدے کیے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `عکرمۃ بن عمار صرح بالسماع عند النسائي (1331 وسندہ حسن)`;