var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ الدَّرَاوَرْدِيِّ قَالَ وَذَكَرَ رَبِيعَةُ أَنَّ تَفْسِيرَ حَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ أَنَّهُ الَّذِي يَتَوَضَّأُ وَيَغْتَسِلُ وَلَا يَنْوِي وُضُوءًا لِلصَّلَاةِ وَلَا غُسْلًا لِلْجَنَابَةِ";
abudawood.urdu = "جناب ربیعہ (ربیعہ الرای ایک تابعی اور مفتی مدینہ) نے نبی کریم ﷺ کی حدیث ’’جو شخص وضو کے شروع میں اللہ کا نام نہ لے اس کا وضو نہیں۔“ کی شرح میں کہا ہے کہ اس سے مراد وہ شخص ہے جو وضو اور غسل کرتا ہے اور وضو سے نماز کی اور غسل سے طہارت کی نیت نہیں کرتا (ایسے شخص کا وضو اور غسل درست نہ ہو گا)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن وہب المصري مدلس (طبقات ابن سعد: 518/7،الفتح المبین: ص 25) و عنعن`;
abudawood.anwaar = [16,1];