var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا الْأَعْمَشُ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ... بِهَذَا،قَالَ: ...فَإِذَا نَسِيَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ،ثُمَّ تَحَوَّلَ،فَسَجَدَ سَجْدَتَيْنِ. قَالَ أَبو دَاود: رَوَاهُ حُصَيْنٌ نَحْوَ حَدِيثِ الْأَعْمَشِ.";
abudawood.urdu = "سیدنا علقمہ نے سیدنا عبداللہ رضی اللہ عنہ سے یہی خبر بیان کی کہ آپ نے فرمایا ’’جب تم میں سے کوئی بھول جائے تو دو سجدے کرے۔‘‘ پھر آپ مڑے اور آپ نے دو سجدے کیے۔امام ابوداؤد رحمہ اللہ نے کہا: حصین نے اعمش کی مانند روایت کیا ہے۔";
abudawood.hukam = "صحیح مسلم (572)";
abudawood.description = ``;