var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ،أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى،عَنْ عَبْدِ اللَّهِ بْنِ كَيْسَانَ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمَّى سَجْدَتَيِ السَّهْوِ: الْمُرْغِمَتَيْنِ.";
abudawood.urdu = "جناب عکرمہ،سیدنا ابن عباس رضی اللہ عنہما سے راوی ہیں کہ نبی کریم ﷺ نے سہو کے سجدوں کو شیطان کے لیے ذلت کا باعث بیان فرمایا۔";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شواھد من حدیث السابق (1024)`;