var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي رَزِينٍ وَأَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَلَا يَغْمِسْ يَدَهُ فِي الْإِنَاءِ حَتَّى يَغْسِلَهَا ثَلَاثَ مَرَّاتٍ فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی رات کو جاگے تو اپنا ہاتھ دھوئے بغیر برتن میں نہ ڈبوئے حتیٰ کہ تین بار دھو لے کیونکہ وہ نہیں جانتا کہ اس کا ہاتھ (سوتے میں) کہاں کہاں لگتا رہا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (278)";
abudawood.description = ``;