var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ،حَدَّثَنَا يَعْقُوبُ،حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ،عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ بِهَذَا الْحَدِيثِ،بِإِسْنَادِهِ زَادَ: وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ.";
abudawood.urdu = "جناب زہری کا بھتیجا (محمد بن عبداللہ) راوی ہے کہ محمد بن مسلم (زہری) نے اپنی سند سے یہ حدیث بیان کی اور کہا کہ (سجدے کرے) ’’جبکہ وہ بیٹھا ہوا ہو ‘ سلام سے پہلے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1030)`;