var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَجَّاجٌ،حَدَّثَنَا يَعْقُوبُ،أَخْبَرَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ،حَدَّثَنِي مُحَمَّدُ بْنُ مُسْلِمٍ الزُّهْرِيُّ بِإِسْنَادِهِ وَمَعْنَاهُ،قَالَ: فَلْيَسْجُدْ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ،ثُمَّ لِيُسَلِّمْ.";
abudawood.urdu = "ابن اسحاق راوی ہیں کہ محمد بن مسلم زہری نے اپنی سند سے مذکورہ بالا حدیث کے ہم معنی بیان کیا اور کہا ’’سلام سے پہلے دو سجدے کرے،پھر سلام پھیرے۔“";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ ابن ماجہ (1216) ورواہ البیھقي (2/339) قال معاذ علی زئی: ولہ شاھد حسن لذاتہ عند أحمد (3/ 72 ح 11689، وسندہ حسن) ولفظہ: ’’إذا شك أحدكم في صلاته، فلم يدر كم صلى، فليبن على اليقين، حتى إذا استيقن أن قد أتم، فليسجد ‌سجدتين ‌قبل ‌أن ‌يسلم…‘‘`;