var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا حَجَّاجٌ عَنِ ابْنِ جُرَيْجٍ،أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُسَافِعٍ،أَنَّ مُصْعَبَ بْنَ شَيْبَةَ أَخْبَرَهُ،عَنْ عُتْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ،عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ شَكَّ فِي صَلَاتِهِ, فَلْيَسْجُدْ سَجْدَتَيْنِ بَعْدَمَا يُسَلِّمُ.";
abudawood.urdu = "سیدنا عبداللہ بن جعفر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جسے اپنی نماز میں شک ہو،اسے چاہیئے کہ سلام کے بعد دو سجدے کرے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `صححہ ابن خزیمۃ (1033 وسندہ حسن)`;