var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى،حَدَّثَنِي أَشْعَثُ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ خَالِدٍ يَعْنِي الْحَذَّاءَ،عَنْ أَبِي قِلَابَةَ،عَنْ أَبِي الْمُهَلَّبِ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ،فَسَهَا،فَسَجَدَ سَجْدَتَيْنِ،ثُمَّ تَشَهَّدَ،ثُمَّ سَلَّمَ.";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے ان کو نماز پڑھائی اور بھول گئے تو دو سجدے کیے پھر تشہد پڑھا اور سلام پھیرا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1019)
أخرجہ الترمذي (395 وسندہ صحیح) وأعل الذھبي بعلۃ غیر قادحۃ وأشعث بن عبد الملک ثقۃ فقیہ فزیادتہ مقبولۃ`;