var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي بِهَذَا الْحَدِيثِ قَالَ مَرَّتَيْنِ أَوْ ثَلَاثًا وَلَمْ يَذْكُرْ أَبَا رَزِينٍ";
abudawood.urdu = "امام مسدد سے عیسیٰ بن یونس کے واسطے سےبھی مذکورہ بالا حدیث مروی ہے مگر اس میں ہے کہ دوبار دھوئے یا تین بار۔اس سند میں ابورزین کا ذکر نہیں ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `وانظر الحدیث السابق (103)`;