var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا شُعْبَةُ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ قَبِيصَةَ بْنِ هُلْبٍ-رَجُلٍ مِنْ طَيِّئٍ-،عَنْ أَبِيهِ،أَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَكَانَ يَنْصَرِفُ عَنْ شِقَّيْهِ.";
abudawood.urdu = "جناب قبیصہ بن ہلب طائی اپنے والد ہلب رضی اللہ عنہ سے بیان کرتے ہیں کہ انہوں نے نبی کریم ﷺ کے ساتھ نماز پڑھی تو آپ ﷺ اپنی دونوں اطراف سے (مقتدیوں کی طرف) پھرا کرتے تھے۔(یعنی کبھی دائیں جانب سے اور کبھی بائیں جانب سے)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (301 وسندہ حسن) ورواہ ابن ماجہ (809، 929 وسندھما حسن)`;