var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ،حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ،أَخْبَرَنِي نَافِعٌ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اجْعَلُوا فِي بُيُوتِكُمْ مِنْ صَلَاتِكُمْ،وَلَا تَتَّخِذُوهَا قُبُورًا.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اپنی نماز کا کچھ حصہ اپنے گھروں میں بھی پڑھا کرو اور انہیں قبرستان نہ بنا چھوڑو۔‘‘";
abudawood.hukam = "صحیح بخاری (432) صحیح مسلم (777)";
abudawood.description = ``;