var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ،عَنْ إِبْرَاهِيمَ بْنِ أَبِي النَّضْرِ،عَنْ أَبِيهِ،عَنْ بُسْرِ بْنِ سَعِيدٍ،عَنْ زَيْدِ بْنِ ثَابِتٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: صَلَاةُ الْمَرْءِ فِي بَيْتِهِ أَفْضَلُ مِنْ صَلَاتِهِ فِي مَسْجِدِي هَذَا, إِلَّا الْمَكْتُوبَةَ.";
abudawood.urdu = "سیدنا بسر بن سعید،سیدنا زید بن ثابت رضی اللہ عنہ سے راوی ہیں کہ نبی کریم ﷺ نے فرمایا ’’میری اس مسجد میں نماز پڑھنے کے مقابلے میں انسان کا اپنے گھر میں نماز پڑھنا زیادہ افضل ہے سوائے فرض نماز کے۔‘‘";
abudawood.hukam = "صحیح بخاری (6113) صحیح مسلم (781)";
abudawood.description = `مشکوۃ المصابیح (1300)
وانظر الحدیث الآتي (1447)`;