var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ أَنَّ الْجُلَاحَ مَوْلَى عَبْدِ الْعَزِيزِ حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَال:َ يَوْمُ الْجُمُعَةِ ثِنْتَا عَشْرَةَ –يُرِيدُ: سَاعَةً-،لَا يُوجَدُ مُسْلِمٌ يَسْأَلُ اللَّهَ عَزَّ وَجَلَّ شَيْئًا, إِلَّا أَتَاهُ اللَّهُ عَزَّ وَجَلَّ،فَالْتَمِسُوهَا آخِرَ سَاعَةٍ بَعْدَ الْعَصْرِ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما راوی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جمعہ کے دن میں بارہ گھڑیاں ہیں،جو بھی مسلمان اس حالت میں پایا جائے کہ اللہ تعالیٰ سے کوئی سوال کرتا ہو تو اللہ تعالیٰ اسے وہ چیز عنایت فرما دیتا ہے،لہٰذا اسے عصر کے بعد کی آخری ساعت میں تلاش کرو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1360)
أخرجہ النسائي (1390 وسندہ صحیح)`;