var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ،ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ, غُفِرَ لَهُ مَا بَيْنَ الْجُمُعَةِ إِلَى الْجُمُعَةِ،وَزِيَادَةَ ثَلَاثَةِ أَيَّامٍ،وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص وضو کرے اور اچھا وضو کرے پھر جمعہ کے لیے آئے اور غور سے سنے اور خاموش رہے تو اس کے جمعے سے جمعے تک کے اور مزید تین دن کے گناہ بخش دیے جاتے ہیں اور جو (خطبے کے دوران میں) کنکریوں سے کھیلا اس نے لغو کام کیا۔‘‘";
abudawood.hukam = "صحیح مسلم (758)";
abudawood.description = ``;