var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،قَالَ: حَدَّثَنِي عَبِيدَةُ بْنُ سُفْيَانَ الْحَضْرَمِيُّ،عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ-وَكَانَتْ لَهُ صُحْبَةٌ-،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ تَرَكَ ثَلَاثَ جُمَعٍ تَهَاوُنًا بِهَا, طَبَعَ اللَّهُ عَلَى قَلْبِهِ.";
abudawood.urdu = "سیدنا ابو الجعد ضمری رضی اللہ عنہ (صحابی) سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص غفلت اور سستی سے تین جمعے چھوڑ دے اللہ تعالیٰ اس کے دل پر مہر لگا دیتا ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1371)
أخرجہ الترمذي (500 وسندہ حسن) والنسائي (1370 وسندہ حسن) وابن ماجہ (1125 وسندہ حسن) محمد بن عمرو بن علقمۃ اللیثي وثقہ الجمھور`;