var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا هَمَّامٌ،حَدَّثَنَا قَتَادَةُ،عَنْ قُدَامَةَ بْنِ وَبَرَةَ الْعُجَيْفِيِّ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ, فَلْيَتَصَدَّقْ بِدِينَارٍ،فَإِنْ لَمْ يَجِدْ, فَبِنِصْفِ دِينَار. قَالَ أَبو دَاود: وَهَكَذَا رَوَاهُ خَالِدُ بْنُ قَيْسٍ وَخَالَفَهُ فِي الْإِسْنَادِ وَوَافَقَهُ فِي الْمَتْنِ.";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ،نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس نے کسی عذر کے بغیر جمعہ چھوڑ دیا ہو وہ ایک دینار صدقہ کرے،اگر نہ پائے تو آدھا دینار۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں: خالد بن قیس نے ایسے ہی روایت کیا ہے مگر سند میں اختلاف کیا ہے اور متن میں موافقت کی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (1373ب) ابن ماجہ (1128)<br>قتادۃ عنعن`;
abudawood.anwaar = [48,2];