var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي عَمْرٌو،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ،عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،أَنَّهَا قَالَتْ: كَانَ النَّاسُ يَنْتَابُونَ الْجُمُعَةَ مِنْ مَنَازِلِهِمْ،وَمِنَ الْعَوَالِي .";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ لوگ اپنے ڈیروں سے اور بالائے مدینہ (عوالی) سے جمعہ کے لیے آیا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (902) صحیح مسلم (847)";
abudawood.description = ``;