var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا هَمَّامٌ،عَنْ قَتَادَةَ،عَنْ أَبِي الْمَلِيحِ،عَنْ أَبِيهِ أَنَّ يَوْمَ حُنَيْنٍ كَانَ يَوْمَ مَطَرٍ،فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنَادِيَهُ أَنَّ: الصَّلَاةَ فِي الرِّحَالِ. حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى.";
abudawood.urdu = "ابوملیح اپنے والد سے روایت کرتے ہیں کہ جنگ حنین کے دن بارش تھی،تو نبی کریم ﷺ نے اپنے منادی (مؤذن) کو حکم دیا کہ (اعلان کرے کہ) نماز اپنے اپنے پڑاؤ ہی پر پڑھیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ النسائي (855 وسندہ صحیح)`;