var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ, قَالَ سُفْيَانُ بْنُ حَبِيبٍ خَبَّرَنَا،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ أَبِي قِلَابَةَ،عَنْ أَبِي الْمَلِيحِ،عَنْ أَبِيهِ, أَنَّهُ شَهِدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-زَمَنَ الْحُدَيْبِيَةِ-فِي يَوْمِ جُمُعَةٍ،وَأَصَابَهُمْ مَطَرٌ لَمْ تَبْتَلَّ أَسْفَلُ نِعَالِهِمْ،فَأَمَرَهُمْ أَنْ يُصَلُّوا فِي رِحَالِهِمْ.";
abudawood.urdu = "ابوملیح اپنے والد سے روایت کرتے ہیں کہ وہ حدیبیہ کے دنوں میں نبی کریم ﷺ کے ہاں حاضر تھے۔جمعے کا دن تھا اور بارش ہو گئی۔اتنی کہ ان کے جوتوں کے تلوے بھی نہ بھیگے تو آپ ﷺ نے ان کو حکم دیا کہ اپنے اپنے پڑاؤ ہی پر نمازیں پڑھیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ ابن ماجہ (936 وسندہ صحیح) وانظر الحدیث السابق (605)`;