var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ: أَنَّ ابْنَ عُمَرَ –يَعْنِي: أَذَّنَ بِالصَّلَاةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ-،فَقَالَ: أَلَا صَلُّوا فِي الرِّحَالِ،ثُمَّ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ أَوْ ذَاتُ مَطَرٍ, يَقُولُ: أَلَا صَلُّوا فِي الرِّحَالِ.";
abudawood.urdu = "جناب نافع سے روایت ہے کہ سیدنا ابن عمر رضی اللہ عنہما نے ایک رات جب کہ سردی تھی اور ہوا چل رہی تھی،اذان کہی تو کہا: «ألا صلوا فی الرحال» پھر بیان کیا کہ رسول اللہ ﷺ،جب رات ٹھنڈی ہوتی یا بارش والی ہوتی تو مؤذن کو حکم دیتے کہ یوں کہے «ألا صلوا فی الرحال»۔";
abudawood.hukam = "صحیح بخاری (666) صحیح مسلم (697)";
abudawood.description = ``;