var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ،حَدَّثَنَا زُهَيْرٌ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَمُطِرْنَا،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لِيُصَلِّ مَنْ شَاءَ مِنْكُمْ فِي رَحْلِهِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ ہم رسول اللہ ﷺ کے ساتھ سفر میں تھے تو بارش ہو گئی۔رسول اللہ ﷺ نے فرمایا ’’تم میں سے جو چاہے اپنے پڑاؤ میں نماز پڑھ لے۔‘‘";
abudawood.hukam = "صحیح مسلم (698)";
abudawood.description = ``;