var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى وَعُمَرُ بْنُ حَفْصٍ الْوَصَّابِيُّ الْمَعْنَى،قَالَا: حَدَّثَنَا بَقِيَّةُ،حَدَّثَنَا شُعْبَةُ عَنِ الْمُغِيرَةِ الضَّبِّيِّ،عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: قَدِ اجْتَمَعَ فِي يَوْمِكُمْ هَذَا عِيدَانِ،فَمَنْ شَاءَ, أَجْزَأَهُ مِنَ الْجُمُعَةِ،وَإِنَّا مُجَمِّعُونَ.\nقَالَ عُمَرُ: عَنْ شُعْبَةَ.";
abudawood.urdu = "حضرت ابو ہریرہ رضی اللہ نبیﷺسے روایت کرتے ہیں کہ آپ نے فرمایا.ّتمہارےاس دن میں دو عیدیں جمع ہو گئی‘توجوچاہئے اس کے لیےیہ(نماز عید)جمعہ کہ بدلے کافی ہے اور ہم جمعہ پڑھیں گے-‘‘عمر بن حفص کی سند میں عنعنہ ہے-(یعنی اس نے’’عن شعبہ‘‘کہا ہے)";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ابن ماجہ (1311)<br>مغیرۃ بن مقسم مدلس(طبقات المدلسین : 3/107) وعنعن<br>والحدیث السابق (الأصل : 1070) یغني عنہ`;
abudawood.anwaar = [49,1];