var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ مُخَوَّلِ بْنِ رَاشِدٍ،عَنْ مُسْلِمٍ الْبَطِينِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ: تَنْزِيلُ السَّجْدَةَ،وَ: هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ جمعہ کے روز فجر کی نماز میں سورۃ «الم تنزیل السجدۃ» اور «ہل أتی علی الإنسان حین من الدہر» پڑھا کرتے تھے۔";
abudawood.hukam = "صحیح مسلم (879)";
abudawood.description = ``;