var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ عَجْلَانَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الشِّرَاءِ وَالْبَيْعِ فِي الْمَسْجِدِ،وَأَنْ تُنْشَدَ فِيهِ ضَالَّةٌ،وَأَنْ يُنْشَدَ فِيهِ شِعْرٌ،وَنَهَى عَنِ التَّحَلُّقِ قَبْلَ الصَّلَاةِ يَوْمَ الْجُمُعَةِ.";
abudawood.urdu = "عمرو بن شعیب اپنے والد (شعیب) سے اور وہ اپنے دادا عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے مسجد میں خرید و فروخت سے منع فرمایا اور اس سے بھی کہ گمشدہ چیز کا اس میں اعلان کیا جائے یا شعر پڑھے جائیں۔اور اس سے بھی منع فرمایا ہے کہ جمعہ کے روز نماز سے پہلے حلقہ بنا کر بیٹھا جائے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (732)
أخرجہ النسائي (715 وسندہ حسن) ابن عجلان صرح بالسماع عند أحمد (2/179) `;