var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ،حَدَّثَنَا أَبُو عَاصِمٍ،عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ،عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ،قَال:َ كَانَ بَيْنَ مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْحَائِطِ, كَقَدْرِ مَمَرِّ الشَّاةِ.";
abudawood.urdu = "سیدنا سلمہ بن اکوع رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کے منبر اور (مسجد کی) دیوار کے درمیان اتنا فاصلہ تھا کہ اس میں سے بکری گزر جائے۔";
abudawood.hukam = "صحیح بخاری (497) صحیح مسلم (509)";
abudawood.description = ``;