var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،حَدَّثَنِي فُلَيْحُ بْنُ سُلَيْمَانَ،حَدَّثَنِي عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ التَّيْمِيُّ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْجُمُعَةَ إِذَا مَالَتِ الشَّمْسُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ سورج ڈھلنے پر جمعہ پڑھا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (904)";
abudawood.description = ``;