var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِ،يُحَدِّثُ عَنْ أَبِيهِ قَالَ: كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ،ثُمَّ نَنْصَرِفُ،وَلَيْسَ لِلْحِيطَانِ فَيْءٌ.";
abudawood.urdu = "ایاس بن سلمہ بن اکوع اپنے والد (سیدنا سلمہ بن اکوع رضی اللہ عنہ) سے بیان کرتے ہیں کہ ہم رسول اللہ ﷺ کے ساتھ جمعہ پڑھا کرتے تھے،اس کے بعد جب واپس لوٹتے تو دیواروں کا سایہ نہ ہوتا تھا۔";
abudawood.hukam = "صحیح بخاری (4168) صحیح مسلم (860)";
abudawood.description = ``;