var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنِ الزُّهْرِيِّ عَنِ السَّائِبِ بْنِ يَزِيدَ،قَالَ: كَانَ يُؤَذَّنُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, إِذَا جَلَسَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ،عَلَى بَابِ الْمَسْجِدِ،وَأَبِي بَكْرٍ وَعُمَرَ... ثُمَّ سَاقَ نَحْوَ حَدِيثِ يُونُسَ.";
abudawood.urdu = "سیدنا سائب بن یزید رضی اللہ عنہ بیان کرتے ہیں کہ جمعہ کے روز جب رسول اللہ ﷺ منبر پر بیٹھ جاتے تو آپ ﷺ کے سامنے مسجد کے دروازے کے پاس اذان کہی جاتی تھی۔اور سیدنا ابوبکر و عمر رضی اللہ عنہما کے دور میں بھی ایسے ہی ہوتا تھا۔اور (گزشتہ) حدیث یونس کی مانند بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن وفي حدیث الطبراني (الکبیر146/7) في روایۃ سلیمان التیمي: ’’ عند المنبر‘‘`;
abudawood.anwaar = [49,1];