var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ،حَدَّثَنَا عَبْدَةُ،عَنْ مُحَمَّدٍ يَعْنِي ابْنَ إِسْحَاقَ عَنِ الزُّهْرِيِّ عَنِ السَّائِبِ،قَالَ: لَمْ يَكُنْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مُؤَذِّنٌ وَاحِدٌ, بِلَالٌ... ثُمَّ ذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "سیدنا سائب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کا ایک ہی مؤذن تھا۔یعنی بلال اور (ابن اسحاق نے) سابقہ حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1088)`;
abudawood.anwaar = [49,1];