var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ،حَدَّثَنَا أَبِي،عَنْ صَالِحٍ عَنِ ابْنِ شِهَابٍ،أَنَّ السَّائِبَ بْنَ يَزِيدَ ابْنَ أُخْتِ نَمِرٍ أَخْبَرَهُ, قَالَ: وَلَمْ يَكُنْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ مُؤَذِّنٍ وَاحِدٍ... وَسَاقَ هَذَا الْحَدِيثَ،وَلَيْسَ بِتَمَامِهِ.";
abudawood.urdu = "سیدنا سائب بن یزید رضی اللہ عنہ نے ان کو خبر دی کہ رسول اللہ ﷺ کا ایک ہی مؤذن تھا۔صالح نے یہ حدیث بیان کی،مگر کامل نہیں ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انظر الحدیث السابق (1087)`;