var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ،حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ عَنِ الْعُمَرِيِّ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ خُطْبَتَيْنِ،كَانَ يَجْلِسُ إِذَا صَعِدَ الْمِنْبَرَ،حَتَّى يَفْرَغَ-أُرَاهُ قَالَ: الْمُؤَذِّنُ-،ثُمَّ يَقُومُ فَيَخْطُبُ،ثُمَّ يَجْلِسُ فَلَا يَتَكَلَّمُ،ثُمَّ يَقُومُ فَيَخْطُبُ.";
abudawood.urdu = "نافع،سیدنا عبداللہ بن عمر رضی اللہ عنہما سے بیان کرتے ہیں کہ نبی کریم ﷺ دو خطبے ارشاد فرمایا کرتے تھے۔آپ ﷺ جب منبر پر تشریف لاتے تو بیٹھ جاتے،حتیٰ کہ مؤذن اذان سے فارغ ہو جاتا۔پھر آپ ﷺ کھڑے ہوتے اور خطبہ دیتے،پھر بیٹھ جاتے اور کلام نہ کرتے،پھر کھڑے ہوتے اور (دوسرا) خطبہ دیتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث الآتی (1133 ب)<br>عبدالوہاب بن عطاء مدلس(طبقات المدلسین 3/85) وعنعن<br>وحدیث البخاري (928) یغني عنہ`;
abudawood.anwaar = [49,1];