var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى،عَنْ أَبِي الْأَحْوَصِ،حَدَّثَنَا سِمَاكٌ،عَنْ جَابِرِ بْنِ سَمُرَةَ قَال:َ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَتَانِ كَانَ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَيُذَكِّرُ النَّاسَ.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کے دو خطبے ہوا کرتے تھے۔آپ ان دونوں کے درمیان میں بیٹھا کرتے تھے۔آپ قرآن پڑھتے اور لوگوں کو وعظ و نصیحت فرمایا کرتے تھے۔";
abudawood.hukam = "صحیح مسلم (862)";
abudawood.description = ``;