var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا،ثُمَّ يَقْعُدُ قَعْدَةً لَا يَتَكَلَّمُ... وَسَاقَ الْحَدِيثَ.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی کریم ﷺ کو دیکھا کہ کھڑے ہو کر خطبہ ارشاد فرماتے پھر مختصر سا بیٹھ جاتے اور اس دوران میں کوئی گفتگو نہ کرتے تھے اور حدیث بیان کی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;