var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ بْنِ سَعِيدٍ،حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ،عَنْ تَمِيمٍ الطَّائِيِّ،عَنْ عَدِيِّ بْنِ حَاتِمٍ،أَنَّ خَطِيبًا خَطَبَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: مَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ،وَمَنْ يَعْصِهِمَا! فَقَالَ: قُمْ-أَوِ اذْهَبْ-،بِئْسَ الْخَطِيبُ أَنْتَ!.";
abudawood.urdu = "سیدنا عدی بن حاتم رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ کے سامنے ایک خطیب نے خطبہ دیا اور اس نے کہا «من یطع اللہ ورسولہ فقد رشد ومن یعصہما» ’’جس نے اللہ اور اس کے رسول کی اطاعت کی اور جس نے ان دونوں کی نافرمانی کی۔‘‘ آپ ﷺ نے فرمایا: ’’کھڑے ہو جاؤ۔‘‘ یا فرمایا ’’چلے جاؤ تم بہت برے خطیب ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (870)";
abudawood.description = ``;