var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،قَالَ: حَدَّثَنِي سِمَاكٌ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ: كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَصْدًا،وَخُطْبَتُهُ قَصْدًا،يَقْرَأُ آيَاتٍ مِنَ الْقُرْآنِ،وَيُذَكِّرُ النَّاسَ.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کی نماز اور آپ ﷺ کا خطبہ درمیانہ درمیانہ ہوتے تھے۔آپ ﷺ قرآن کریم کی چند آیات تلاوت فرماتے اور لوگوں کو وعظ و نصیحت فرمایا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `ورواہ مسلم (866) نحوہ`;