var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا الْعَلَاءُ بْنُ صَالِحٍ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ أَبِي رَاشِدٍ،عَنْ عَمَّارِ ابْنِ يَاسِرٍ،قَالَ: أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِقْصَارِ الْخُطَبِ.";
abudawood.urdu = "سیدنا عمار بن یاسر رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے ہم کو خطبے مختصر رکھنے کا حکم دیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `العلاء بن صالح: وثقہ الجمہور، وأبو راشد: ذکرہ ابن حبان فی الثقات وقال الحاکم فی حدیثہ: ’’صحيح الإسناد‘‘ وقال الذھبي فی حدیثہ: ’’صحیح‘‘`;