var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا الْوَلِيدُ،أَخْبَرَنِي شَيْبَانُ أَبُو مُعَاوِيَةَ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ السُّوَائِيِّ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُطِيلُ الْمَوْعِظَةَ يَوْمَ الْجُمُعَةِ،إِنَّمَا هُنَّ كَلِمَاتٌ يَسِيرَاتٌ.";
abudawood.urdu = "سیدنا جابر بن سمرہ سوائی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جمعہ کے روز لمبا وعظ نہ فرمایا کرتے تھے بلکہ چند مختصر سے کلمات ہوا کرتے تھے۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (1101)`;