var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ وَجَدْتُ فِي كِتَابِ أَبِي بِخَطِّ يَدِهِ وَلَمْ أَسْمَعْهُ مِنْهُ قَالَ قَتَادَةُ،عَنْ يَحْيَى بْنِ مَالِكٍ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: احْضُرُوا الذِّكْرَ،وَادْنُوا مِنَ الْإِمَامِ, فَإِنَّ الرَّجُلَ لَا يَزَالُ يَتَبَاعَدُ،حَتَّى يُؤَخَّرَ فِي الْجَنَّةِ،وَإِنْ دَخَلَهَا.";
abudawood.urdu = "جناب معاذ بن ہشام کہتے ہیں کہ میں نے اپنے والد کی بیاض میں ان کے ہاتھ کا لکھا ہوا پایا اور سنا نہیں۔کہ قتادہ نے کہا یحییٰ بن مالک سے وہ سمرہ بن جندب رضی اللہ عنہ سے روایت کرتے ہیں کہ اللہ کے نبی ﷺ نے فرمایا ’’ذکر (خطبہ اور وعظ) میں حاضر ہوا کرو اور امام کے قریب بیٹھا کرو۔انسان (اگر خیر کے مقامات سے) پیچھے رہنے کو معمول بنا لے تو جنت میں بھی پیچھے کر دیا جائے گا اگرچہ اس میں داخل ہو ہی جائے-“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [50,1];