var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ،حَدَّثَنَا الْمُقْرِئُ،حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ،عَنْ أَبِي مَرْحُومٍ،عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ،عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْحُبْوَةِ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ.";
abudawood.urdu = "سہل بن معاذ بن انس اپنے والد سے راوی ہیں کہ رسول اللہ ﷺ نے جمعہ کے روز جب امام خطبہ دے رہا ہو «حبوۃ» (بیٹھنے کی ایک صورت) سے منع فرمایا ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1393)
أخرجہ الترمزي (514 وسندہ حسن)`;