var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا قُلْتَ: أَنْصِتْ-وَالْإِمَامُ يَخْطُبُ-فَقَدْ لَغَوْتَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول ﷺ نے فرمایا ’’جب تم یہ کہو کہ خاموش ہو جاؤ اور امام خطبہ دے رہا ہو تو تم نے لغو کام کیا‘‘۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ النسائي (1578 وسندہ صحیح) ورواہ البخاري (934) ومسلم (851)`;