var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ،حَدَّثَنَا حَمَّادٌ،عَنْ عَمْرٍو وَهُوَ ابْنُ دِينَارٍ،عَنْ جَابِرٍ،أَنَّ رَجُلًا جَاءَ يَوْمَ الْجُمُعَةِ-وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ-،فَقَالَ: أَصَلَّيْتَ يَا فُلَانُ؟ قَالَ: لَا،قَالَ: قُمْ فَارْكَعْ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ کا بیان ہے کہ جمعہ کے دن ایک شخص آیا اور نبی کریم ﷺ خطبہ دے رہے تھے۔آپ ﷺ نے اس سے فرمایا ’’اے فلاں! کیا تم نے نماز پڑھی ہے؟‘‘ اس نے کہا: نہیں! آپ ﷺ نے فرمایا ’’کھڑے ہو جاؤ اور نماز پڑھو۔‘‘";
abudawood.hukam = "صحیح بخاری (930) صحیح مسلم (875)";
abudawood.description = ``;