var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،عَنْ سَعِيدٍ عَنِ الْوَلِيدِ أَبِي بِشْرٍ،عَنْ طَلْحَةَ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ: يُحَدِّثُ أَنَّ سُلَيْكًا جَاءَ... فَذَكَرَ نَحْوَهُ،زَادَ: ثُمَّ أَقْبَلَ عَلَى النَّاسِ, قَالَ: إِذَا جَاءَ أَحَدُكُمْ وَالْإِمَامُ يَخْطُبُ, فَلْيُصَلِّ رَكْعَتَيْنِ يَتَجَوَّزْ فِيهِمَا.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کر رہے تھے کہ جناب سلیک آئے۔اور مذکورہ بالا حدیث کی مانند ذکر کیا۔مزید یہ کہا کہ پھر نبی کریم ﷺ لوگوں کی طرف متوجہ ہوئے اور فرمایا ’’جب تم میں سے کوئی آئے اور امام خطبہ دے رہا ہو تو اسے چاہیئے کہ مختصر سی دو رکعتیں پڑھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1117)`;