var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدَةَ عَنْ ابْنِ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا نَعَسَ أَحَدُكُمْ وَهُوَ فِي الْمَسْجِدِ فَلْيَتَحَوَّلْ مِنْ مَجْلِسِهِ ذَلِكَ إِلَى غَيْرِهِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’جب کسی کو اونگھ آنے لگے اور وہ مسجد میں ہو تو چاہیئے کہ اپنی جگہ بدل کر کسی اور جگہ بیٹھ جائے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1394)
أخرجہ الترمذي (526 وسندہ حسن) ابن صرح بالسماع عند أحمد (2/135)`;