var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ أَدْرَكَ رَكْعَةً مِنَ الصَّلَاةِ،فَقَدْ أَدْرَكَ الصَّلَاةَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ و سلم نے فرمایا ’’جس نے نماز سے ایک رکعت پالی اس نے نماز پالی۔‘‘";
abudawood.hukam = "صحیح بخاری (580) صحیح مسلم (607)";
abudawood.description = ``;