var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ،أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ: مَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ؟ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ فَقَالَ: كَانَ يَقْرَأُ بِ: هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ[أول سورة الغاشية].";
abudawood.urdu = "جناب ضحاک بن قیس نے سیدنا نعمان بن بشیر رضی اللہ عنہ سے پوچھا کہ رسول اللہ صلی اللہ علیہ و سلم جمعہ کے روز سورۃ الجمعہ کی تلاوت کے بعد کون سی سورت پڑھا کرتے تھے۔کہا کہ «ہل أتاک حدیث الغاشیۃ » (یعنی دوسری رکعت میں) پڑھتے تھے۔";
abudawood.hukam = "صحیح مسلم (878)";
abudawood.description = ``;