var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ شُعْبَةَ،عَنْ مَعْبَدِ بْنِ خَالِدٍ،عَنْ زَيْدِ بْنِ عُقْبَةَ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى[أول سورة الأعلى]،وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ[أول سورة الغاشية].";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ ﷺ نماز جمعہ میں «سبح اسم ربک الأعلی» اور«ہل أتاک حدیث الغاشیۃ» پڑھا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (1423 وسندہ صحیح)`;