var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،قَالَتْ: صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حُجْرَتِهِ وَالنَّاسُ يَأْتَمُّونَ بِهِ مِنْ وَرَاءِ الْحُجْرَةِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے اپنے حجرہ (اعتکاف) میں نماز پڑھی اور لوگ حجرے سے باہر آپ ﷺ کی اقتدا کر رہے تھے۔";
abudawood.hukam = "صحیح بخاری (729)";
abudawood.description = `مشکوۃ المصابیح (1114)`;