var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا إِسْمَاعِيلُ،أَخْبَرَنَا أَيُّوبُ،عَنْ نَافِعٍ،قَالَ: كَانَ ابْنُ عُمَرَ يُطِيلُ الصَّلَاةَ قَبْلَ الْجُمُعَةِ،وَيُصَلِّي بَعْدَهَا رَكْعَتَيْنِ فِي بَيْتِهِ،وَيُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ.";
abudawood.urdu = "جناب نافع کا بیان ہے کہ سیدنا ابن عمر رضی اللہ عنہما جمعہ سے پہلے لمبی نماز پڑھا کرتے تھے اور جمعے کے بعد گھر جا کر دو رکعتیں پڑھتے اور بیان کرتے کہ رسول اللہ ﷺ یہی کیا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انظر الحدیث السابق (1127)`;