var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ.\nقَالَ أَبو دَاود: وَكَذَلِكَ رَوَاهُ عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنِ ابْنِ عُمَرَ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ جمعہ کے بعد اپنے گھر میں دو رکعتیں پڑھا کرتے تھے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ عبداللہ بن دینار نے بھی سیدنا ابن عمر رضی اللہ عنہما سے ایسے ہی روایت کیا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (1429 وسندہ صحیح) ورواہ البخاري (1165) ومسلم (882)`;