var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،قَالَ: قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ،وَلَهُمْ يَوْمَانِ يَلْعَبُونَ فِيهِمَا،فَقَالَ: مَا هَذَانِ الْيَوْمَانِ؟،قَالُوا: كُنَّا نَلْعَبُ فِيهِمَا فِي الْجَاهِلِيَّةِ! فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللَّهَ قَدْ أَبْدَلَكُمْ بِهِمَا خَيْرًا مِنْهُمَا, يَوْمَ الْأَضْحَى وَيَوْمَ الْفِطْرِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما کا بیان ہے کہ نبی کریم ﷺ دو خطبے ارشاد فرمایا کرتے تھے۔منبر پر آنے کے بعد بیٹھ جاتے،حتی کہ مؤذن فارغ ہو جاتا۔پھر آپ ﷺ کھڑے ہوتے اور خطبہ دیتے۔پھر بیٹھ جاتے اور کلام نہ کرتے۔پھر کھڑے ہوتے اور خطبہ دیتے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1439)
أخرجہ النسائي (1557 وسندہ صحیح) سلسلۃ حمید الطویل عن أنس صحیح وحمید صرح بالسماع عند أحمد (3/250)`;