var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا أَبُو الْمُغِيرَةِ،حَدَّثَنَا صَفْوَانُ،حَدَّثَنَا يَزِيدُ بْنُ خُمَيْرٍ الرَّحَبِيُّ،قَالَ: خَرَجَ عَبْدُ اللَّهِ بْنُ بُسْرٍ-صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-مَعَ النَّاسِ فِي يَوْمِ عِيدِ فِطْرٍ أَوْ أَضْحَى،فَأَنْكَرَ إِبْطَاءَ الْإِمَامِ،فَقَال:َ إِنَّا كُنَّا قَدْ فَرَغْنَا سَاعَتَنَا هَذِهِ, وَذَلِكَ حِينَ التَّسْبِيحِ.";
abudawood.urdu = "جناب یزید بن خمیر الرجی بیان کرتے ہیں کہ حضرت عبداللہ بن بسررضی اللہ عنہ صحابئی رسول لوگوں کے ساتھ عید فطر یا عید اضحٰی کے لیےتشریف لائے توامام کے تاخیر کر دینےکو انہوں نے ناپسند کیا اور کہا.ّہم تواس وقت فارغ ہو چکے ہوتے تھے‘یعنی اشراق کے وقت";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;