var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ،عَنْ حَفْصَةَ بِنْتِ سِيرِينَ،عَنْ أُمِّ عَطِيَّةَ،قَالَتْ: كُنَّا نُؤْمَرُ.بِهَذَا الْخَبَرِ. قَالَتْ: وَالْحُيَّضُ يَكُنَّ خَلْفَ النَّاسِ،فَيُكَبِّرْنَ مَعَ النَّاسِ";
abudawood.urdu = "سیدہ ام عطیہ رضی اللہ عنہا بیان کرتی ہیں کہ ہمیں حکم دیا جاتا تھا۔اور یہ حدیث بیان کی۔اور کہا کہ حیض والیاں لوگوں کے پیچھے ہوں اور لوگوں کے ساتھ تکبیریں کہیں۔";
abudawood.hukam = "صحیح بخاری (971) صحیح مسلم (890)";
abudawood.description = ``;