var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ... فِي هَذَا الْحَدِيثِ. قَالَ: فَجَعَلَتِ الْمَرْأَةُ تُعْطِي الْقُرْطَ وَالْخَاتَمَ،وَجَعَلَ بِلَالٌ يَجْعَلُهُ فِي كِسَائِهِ،قَالَ: فَقَسَمَهُ عَلَى فُقَرَاءِ الْمُسْلِمِينَ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے اس حدیث میں بیان کیا کہ کوئی عورت اپنی بالی دینے لگی اور کوئی اپنی انگوٹھی اور بلال رضی اللہ عنہ انہیں اپنے کپڑے میں جمع کرتے جاتے تھے۔پھر آپ ﷺ نے اس مال کو فقیر مسلمانوں میں تقسیم کر دیا۔";
abudawood.hukam = "صحیح بخاری (98) صحیح مسلم (884)";
abudawood.description = ``;