var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا ابْنُ عُيَيْنَةَ،عَنْ أَبِي جَنَابٍ،عَنْ يَزِيدَ بْنِ الْبَرَاءِ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُووِلَ يَوْمَ الْعِيدِ قَوْسًا،فَخَطَبَ عَلَيْهِ.";
abudawood.urdu = "جناب یزید بن براء اپنے والد سے راوی ہیں کہ نبی کریم ﷺ کو عید کے روز کمان دی گئی تو آپ ﷺ نے اس کے سہارے خطبہ دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو جناب ضعیف و صرح بالسماع<br>والحدیث السابق (الأصل : 1096) یغني عن حدیثہ ھذا`;
abudawood.anwaar = [50,1];