var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ جُرَيْجٍ عَنِ الْحَسَنِ بْنِ مُسْلِمٍ،عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْعِيدَ بِلَا أَذَانٍ وَلَا إِقَامَةٍ،وَأَبَا بَكْرٍ وَعُمَرَ أَوْ عُثْمَانَ. شَكَّ يَحْيَى.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما راوی ہیں کہ رسول اللہ ﷺ نے عید (کی نماز) اذان اور اقامت کے بغیر پڑھائی۔اور (ایسے ہی) ابوبکر و عمر و عثمان رضی اللہ عنہما نے بھی۔یحییٰ کو شک ہوا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن جریج مدلس وعنعن في ھذا اللفظ<br>وحدیث ابن ماجۃ (1274) وأحمد (227/1 ح2004) والبخاري (962) ومسلم (884) یغني عنہ`;
abudawood.anwaar = [50,2];