var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَنَّادٌ،قَالَا: حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ سِمَاكٍ يَعْنِي ابْنَ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ: صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ،الْعِيدَيْنِ, بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ میں نے ایک دو بار نہیں بلکہ کئی بار نبی کریم ﷺ کے ساتھ عیدین کی نماز پڑھی ہے۔اذان اور اقامت کے بغیر۔";
abudawood.hukam = "صحیح مسلم (887)";
abudawood.description = ``;