var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ عُقَيْلٍ عَنِ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَبِّرُ فِي الْفِطْرِ وَالْأَضْحَى: فِي الْأُولَى سَبْعَ تَكْبِيرَاتٍ،وَفِي الثَّانِيَةِ خَمْسًا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ ﷺ عید الفطر اور عید الاضحی میں پہلی رکعت میں سات اور دوسری میں پانچ تکبیریں کہا کرتے تھے۔";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شواھد انظر الحدیث الآتي (1151)`;