var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الطُّوسِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا فِطْرٌ عَنْ أَبِي فَرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ رَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَغَسَلَ ذِرَاعَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَاحِدَةً ثُمَّ قَالَ هَكَذَا تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "عبدالرحمٰن بن ابی لیلیٰ کہتے ہیں کہ میں نے سیدنا علی رضی اللہ عنہ کو دیکھا،انہوں نے وضو کیا تو اپنا چہرہ دھویا تین بار،اور اپنی کلائیاں دھوئیں تین بار اور سر کا مسح کیا ایک بار،پھر فرمایا: رسول اللہ ﷺ نے ایسے ہی وضو کیا تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;