var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا الْمُعْتَمِرُ،قَالَ: سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ الطَّائِفِيَّ يُحَدِّثُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ،قَالَ: قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ التَّكْبِيرُ فِي الْفِطْرِ: سَبْعٌ فِي الْأُولَى،وَخَمْسٌ فِي الْآخِرَةِ،وَالْقِرَاءَةُ بَعْدَهُمَا كِلْتَيْهِمَا.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو بن العاص رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’نماز عید الفطر میں تکبیریں پہلی رکعت میں سات ہیں اور دوسری میں پانچ اور قرآت ان دونوں کے بعد ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1441)
عبد اللہ بن عبد الرحمن الطائفي حسن الحدیث وللحدیث شاھد حسن عند أحمد (2/357) ابن لھیعۃ حدث بہ قبل اختلاطہ`;