var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ،أَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ: مَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْأَضْحَى وَالْفِطْرِ؟ قَالَ: كَانَ يَقْرَأُ فِيهِمَا: ق. وَالْقُرْآنِ الْمَجِيدِ[أول سورة ق]،وَاقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ[أول سورة القمر].";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ نے سیدنا ابوواقد لیثی رضی اللہ عنہ سے پوچھا کہ رسول اللہ ﷺ عید الاضحی اور عید الفطر میں کیا قرآت کیا کرتے تھے؟ کہا کہ «ق والقرآن المجید» اور «اقتربت الساعۃ وانشق القمر»۔";
abudawood.hukam = "صحیح مسلم (891)";
abudawood.description = ``;