var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ عُمَرَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ يَوْمَ الْعِيدِ فِي طَرِيقٍ،ثُمَّ رَجَعَ فِي طَرِيقٍ آخَرَ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے عید کو جانے کے لیے ایک راستہ اختیار فرمایا اور واپسی میں دوسرے راستے سے تشریف لائے۔";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ ابن ماجہ (1299 وسندہ حسن) عبد اللہ بن عمر العمري عن نافع قوي، وثقہ ابن معین في روایتہ عن نافع`;