var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ جَعْفَرِ بْنِ أَبِي وَحْشِيَّةَ،عَنْ أَبِي عُمَيْرِ بْنِ أَنَسٍ،عَنْ عُمُومَةٍ لَهُ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّ رَكْبًا جَاءُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،يَشْهَدُونَ أَنَّهُمْ رَأَوُا الْهِلَالَ بِالْأَمْسِ،فَأَمَرَهُمْ أَنْ يُفْطِرُوا،وَإِذَا أَصْبَحُوا أَنْ يَغْدُوا إِلَى مُصَلَّاهُمْ.";
abudawood.urdu = "جناب ابوعمیر بن انس اپنے چچوں سے،جو کہ نبی کریم ﷺ کے صحابہ تھے،بیان کرتے ہیں کہ ایک قافلے والے نبی کریم ﷺ کے پاس آئے اور انہوں نے شہادت دی کہ ہم نے کل شام کو چاند دیکھا ہے۔تو آپ ﷺ نے لوگوں کو حکم دیا کہ روزہ افطار کر لیں اور اگلے دن صبح کو عید گاہ میں پہنچیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1450)
أخرجہ النسائي (1558 وسندہ صحیح) ورواہ ابن ماجہ (1653 وسندہ صحیح)`;