var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَأَبُو تَوْبَةَ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ ح و حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي حَيَّةَ قَالَ رَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ فَذَكَرَ وُضُوءَهُ كُلَّهُ ثَلَاثًا ثَلَاثًا قَالَ ثُمَّ مَسَحَ رَأْسَهُ ثُمَّ غَسَلَ رِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثُمَّ قَالَ إِنَّمَا أَحْبَبْتُ أَنْ أُرِيَكُمْ طُهُورَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "ابوحیہ کہتے ہیں کہ میں نے سیدنا علی رضی اللہ عنہ کو دیکھا کہ انہوں نے وضو کیا اور ابوحیہ نے بتایا کہ انہوں نے سارا وضو تین تین بار کیا۔اور کہا: پھر اپنے سر کا مسح کیا۔اس کے بعد اپنے دونوں پاؤں دھوئے ٹخنوں تک پھر فرمایا میں نے چاہا کہ تمہیں رسول اللہ ﷺ کا وضو دکھلا دوں۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (410)
ورواہ شعبۃ عن أبی إسحاق السبیعی بہ عند النسائی (136) وسندہ حسن، وغسل الرجلین عن علي: رواہ أحمد (1/110) وسندہ حسن`;