var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ،عَنْ يَحْيَى،عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ،عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ،أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمُصَلَّى يَسْتَسْقِي،وَأَنَّهُ لَمَّا أَرَادَ أَنْ يَدْعُوَ اسْتَقْبَلَ الْقِبْلَةَ،ثُمَّ حَوَّلَ رِدَاءَهُ.";
abudawood.urdu = "سیدنا عبداللہ بن زید رضی اللہ عنہ نے خبر دی کہ رسول اللہ ﷺ نماز استسقاء کے لیے نماز گاہ کی طرف نکلے۔آپ ﷺ نے جب دعا کا ارادہ فرمایا تو قبلے کی طرف رخ کر لیا اور اپنی چادر پلٹ لی۔";
abudawood.hukam = "صحیح بخاری (1023) صحیح مسلم (894)";
abudawood.description = ``;