var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ زَيْدٍ الْمَازِنِيَّ،يَقُولُ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمُصَلَّى،فَاسْتَسْقَى،وَحَوَّلَ رِدَاءَهُ حِينَ اسْتَقْبَلَ الْقِبْلَةَ.";
abudawood.urdu = "سیدنا عبداللہ بن زید مازنی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نماز گاہ کی طرف نکلے اور نماز استسقاء پڑھی اور جب قبلے کی طرف رخ کیا تو اپنے چادر پلٹی۔";
abudawood.hukam = "صحیح بخاری (1023) صحیح مسلم (894)";
abudawood.description = ``;