var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ،عَنْ حَيْوَةَ وَعُمَرَ بْنِ مَالِكٍ عَنِ ابْنِ الْهَادِ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ عُمَيْرٍ-مَوْلَى بَنِي آبِي اللَّحْمِ-،أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي عِنْدَ أَحْجَارِ الزَّيْتِ-قَرِيبًا مِنَ الزَّوْرَاءِ-،قَائِمًا يَدْعُو يَسْتَسْقِي،رَافِعًا يَدَيْهِ قِبَلَ وَجْهِهِ،لَا يُجَاوِزُ بِهِمَا رَأْسَهُ";
abudawood.urdu = "سیدنا عمیر مولیٰ بنی آبی اللحم رضی اللہ عنہ کا بیان ہے کہ انہوں نے نبی کریم ﷺ کو مقام زوراء کے قریب ’’احجار زیت‘‘ کے پاس بارش کی دعا کرتے دیکھا،آپ ﷺ اپنے چہرے کے سامنے ہاتھ اٹھائے کھڑے تھے،مگر ہاتھ سر سے اونچے نہ تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1504)
عبد اللہ بن وھب صرح بالسماع عند أحمد (5/223) وللحدیث طرق أخریٰ عند الحاکم (1/327، 535، 3/623) وغیرہ`;