var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ أَبِي خَلَفٍ،حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا مِسْعَرٌ،عَنْ يَزِيدَ الْفَقِيرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: أَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَوَاكِي،فَقَالَ: اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا،مَرِيئًا مَرِيعًا،نَافِعًا غَيْرَ ضَارٍّ،عَاجِلًا غَيْرَ آجِلٍ. قَالَ: فَأَطْبَقَتْ عَلَيْهِمُ السَّمَاءُ";
abudawood.urdu = "جابربن عبداللہ رضی اللہ عنہ کا بیان ہیں کہ رسول اللہ ﷺ کے پاس کچھ لوگ (بارش نہ برسنے کی وجہ سے) روتے ہوئے آئے تو آپ ﷺ نے یوں دعا فرمائی «اللہم اسقنا غیثا مغیثا مریئا نافعا غیر ضار عاجلا غیر آجل» ’’اے اللہ! ہمیں بارش عنایت فرما،ازحد مفید،مددگار،بہترین انجام والی،جو شادابی لائے،نفع آور ہو،کسی ضرر کا باعث نہ بنے اور جلدی آئے،دیر نہ کرے۔‘‘ سیدنا جابر رضی اللہ عنہ نے بیان کیا کہ (اس دعا کے بعد فوراً) ان پر بادل چھا گیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1507)
صححہ ابن خزیمۃ (1416 وسندہ حسن)`;