var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنَ الدُّعَاءِ, إِلَّا فِي الِاسْتِسْقَاءِ،فَإِنَّهُ كَانَ يَرْفَعُ يَدَيْهِ،حَتَّى يُرَى بَيَاضُ إِبِطَيْهِ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ کسی دعا میں اپنے ہاتھ اتنے بلند نہ کرتے تھے جتنے کہ استسقاء میں،یہاں تک کہ آپ ﷺ کی بغلوں کی سفیدی دکھائی دیتی تھی۔";
abudawood.hukam = "صحیح بخاری (3565) صحیح مسلم (896)";
abudawood.description = ``;