var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ،حَدَّثَنَا عَفَّانُ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا ثَابِتٌ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَسْقِي هَكَذَا-يَعْنِي: وَمَدَّ يَدَيْهِ،وَجَعَلَ بُطُونَهُمَا مِمَّا يَلِي الْأَرْضَ-،حَتَّى رَأَيْتُ بَيَاضَ إِبِطَيْهِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ بارش کے لیے اس طرح دعا کرتے تھے،اور انہوں نے ہاتھ لمبے کر کے دکھائے اور ہتھیلیوں کو زمین کی طرف کیا،(اور اتنے بلند کیے کہ) میں نے ان کی بغلوں کی سفیدی دیکھی۔";
abudawood.hukam = "صحیح مسلم (896)";
abudawood.description = ``;