var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا شُعْبَةُ،عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ: أَخْبَرَنِي مَنْ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو عِنْدَ أَحْجَارِ الزَّيْتِ بَاسِطًا كَفَّيْهِ";
abudawood.urdu = "جناب محمد بن ابراہیم کہتے ہیں کہ مجھے ان صاحب نے خبر دی جنہوں نے نبی کریم ﷺ کو ’’احجار زیت‘‘ کے پاس اپنی ہتھیلیاں پھیلائے دعا کرتے دیکھا تھا۔(گزشتہ حدیث .ّ1168)";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وانظر الحدیث السابق (1168)`;