var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ،أَخْبَرَنَا اللَّيْثُ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ شَرِيكِ ابْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ،عَنْ أَنَسٍ،أَنَّهُ سَمِعَهُ يَقُولُ... فَذَكَرَ نَحْوَ. حَدِيثِ عَبْدِ الْعَزِيزِ قَالَ: فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ بِحِذَاءِ وَجْهِهِ،فَقَالَ: اللَّهُمَّ اسْقِنَا.. وَسَاقَ نَحْوَهُ";
abudawood.urdu = "شریک بن عبداللہ بن ابی نمر نے سیدنا انس رضی اللہ عنہ کو کہتے ہوئے سنا اور حدیث عبدالعزیز (یعنی سابقہ حدیث) کی مانند ذکر کیا اور (اس میں اضافہ بیان کرتے ہوئے) کہا: رسول اللہ ﷺ نے اپنے دونوں ہاتھ اپنے چہرے کے برابر اٹھائے اور دعا فرمانے لگے «اللہم اسقنا ***» اور اسی کے مثل حدیث بیان کی۔";
abudawood.hukam = "صحیح بخاری (1013) صحیح مسلم (897)";
abudawood.description = ``;