var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَنْبَسَةُ،حَدَّثَنَا يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ كَانَ كَثِيرُ بْنُ عَبَّاسٍ يُحَدِّثُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ،كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي كُسُوفِ الشَّمْسِ مِثْلَ حَدِيثِ عُرْوَةَ،عَنْ عَائِشَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى رَكْعَتَيْنِ،فِي كُلِّ رَكْعَةٍ رَكْعَتَيْنِ.";
abudawood.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے سورج گہن میں نماز پڑھی جیسے کہ «عروۃ ،عن عائشۃ ،عن رسول اللہ ﷺ» کی (مذکورہ بالا) حدیث میں گزرا ہے۔یعنی آپ ﷺ نے دو رکعتیں پڑھائیں اور ہر رکعت میں دو رکوع کیے۔";
abudawood.hukam = "صحیح بخاری (1046) صحیح مسلم (902)";
abudawood.description = ``;