var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا رَيْحَانُ بْنُ سَعِيدٍ،حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ هِلَالِ بْنِ عَامِرٍ أَنَّ قَبِيصَةَ الْهِلَالِيَّ: حَدَّثَهُ أَنَّ الشَّمْسَ كُسِفَتْ... بِمَعْنَى حَدِيثِ مُوسَى قَالَ: حَتَّى بَدَتِ النُّجُومُ.";
abudawood.urdu = "سیدنا قبیصہ ہلالی رضی اللہ عنہ سے مروی ہے کہسورج کو گہن لگا۔اور موسیٰ بن اسماعیل کی (مذکورہ بالا) حدیث کی مانند بیان کیا۔اس میں بیان کیا حتیٰ کہ ستارے ظاہر ہو گئے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عباد ضعیف مدلس<br>وتابعہ أنیس بن سوار : مجہول الحال،روی عنہ جماعۃ ووثقہ ابن حبان وحدہ (8 / 134) !`;
abudawood.anwaar = [51,2];