var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ،أَخْبَرَنِي أَبِي،حَدَّثَنَا الْأَوْزَاعِيُّ،أَخْبَرَنِي الزُّهْرِيُّ،أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ قِرَاءَةً طَوِيلَةً،فَجَهَرَ بِهَا –يَعْنِي: فِي صَلَاةِ الْكُسُوفِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے لمبی قرآت کی اور اونچی آواز سے۔یعنی نماز کسوف میں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أصلہ عند البخاري (1066) ومسلم (901)`;