var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَطَاءِ بْنِ يَسَارٍ عَنِ ابْنِ عَبَّاسٍ قَالَ: خُسِفَتِ الشَّمْسُ،فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَالنَّاسُ مَعَهُ،فَقَامَ قِيَامًا طَوِيلًا بِنَحْوٍ مِنْ سُورَةِ الْبَقَرَةِ،ثُمَّ رَكَعَ... وَسَاقَ الْحَدِيثَ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے کہا کہ سورج گہن ہوا تو رسول اللہ ﷺ نے نماز پڑھی،لوگ آپ ﷺ کے ساتھ تھے۔آپ ﷺ نے سورۃ البقرہ کے قریب لمبا قیام کیا،پھر رکوع کیا۔اور باقی حدیث بیان کی۔";
abudawood.hukam = "صحیح بخاری (1052) صحیح مسلم (907)";
abudawood.description = ``;