var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدٌ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ بِهَذَا الْحَدِيثِ قَالَ فَمَضْمَضَ وَاسْتَنْشَقَ مِنْ كَفٍّ وَاحِدَةٍ يَفْعَلُ ذَلِكَ ثَلَاثًا ثُمَّ ذَكَرَ نَحْوَهُ";
abudawood.urdu = "جناب مسدد کی سند سے بھی مذکورہ بالا حدیث مروی ہے کہ کلی کی اور ناک میں پانی چڑھایا،ایک ہی چلو سے،ایسا تین بار کیا،پھر راوی نے مذکورہ بالا حدیث کے مطابق روایت بیان کی۔";
abudawood.hukam = "صحیح بخاری (191) صحیح مسلم (235)";
abudawood.description = `مشکوۃ المصابیح (412)`;