var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ،حَدَّثَنَا الْوَلِيدُ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ أَنَّهُ سَأَلَ الزُّهْرِيَّ فَقَالَ الزُّهْرِيُّ،أَخْبَرَنِي عُرْوَةُ،عَنْ عَائِشَةَ،قَالَتْ: كُسِفَتِ الشَّمْسُ،فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا فَنَادَى أَنِ: الصَّلَاةُ جَامِعَةٌ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ سورج گہنایا تو رسول اللہ ﷺ نے ایک آدمی کو حکم دیا اس نے اعلان کیا «الصلاۃ جامعۃ» یعنی نماز کے لیے جمع ہو جاؤ۔";
abudawood.hukam = "صحیح بخاری (1066) صحیح مسلم (901)";
abudawood.description = ``;