var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الشَّمْسُ وَالْقَمَرُ لَا يُخْسَفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ،فَإِذَا رَأَيْتُمْ ذَلِكَ,فَادْعُوا اللَّهَ عَزَّ وَجَلَّ،وَكَبِّرُوا وَتَصَدَّقُوا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’سورج اور چاند کسی کی موت یا ولادت کی وجہ سے نہیں گہناتے۔جب تم یہ (کیفیت) دیکھو تو اللہ عزوجل سے دعا کیا کرو،اس کی تکبیر بیان کرو اور صدقہ دیا کرو۔‘‘";
abudawood.hukam = "صحیح بخاری (1044) صحیح مسلم (901)";
abudawood.description = ``;