var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ،حَدَّثَنِي الْحَارِثُ بْنُ عُمَيْرٍ الْبَصْرِيُّ،عَنْ أَيُّوبَ السَّخْتِيَانِيِّ،عَنْ أَبِي قِلَابَةَ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ،قَالَ: كُسِفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَجَعَلَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ،وَيَسْأَلُ عَنْهَا،حَتَّى انْجَلَتْ.";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ کے دور میں سورج کو گہن لگا تو آپ ﷺ دو دو رکعتیں پڑھنے لگے اور سورج کے متعلق بھی دریافت فرماتے جاتے تھے حتیٰ کہ وہ صاف ہو گیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>نسائی (1486) ابن ماجہ (1262)<br>قال البیہقي : ’’ ھذا مرسل،أبو قلابۃ لم یسمع من النعمان بن بشیر،إنما رواہ عن رجل عن النعمان‘‘ (3/ 333)`;
abudawood.anwaar = [52,1];