var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ صَالِحِ بْنِ كَيْسَانَ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،قَالَت:ْ فُرِضَتِ الصَّلَاةُ رَكْعَتَيْنِ رَكْعَتَيْنِ،فِي الْحَضَرِ وَالسَّفَرِ،فَأُقِرَّتْ صَلَاةُ السَّفَرِ،وَزِيدَ فِي صَلَاةِ الْحَضَرِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ (شروع میں) سفر اور حضر کی نماز دو دو رکعتیں ہی فرض ہوئی تھی،پھر سفر کی نماز بحال رکھی گئی اور مقیم کی نماز میں اضافہ کر دیا گیا۔";
abudawood.hukam = "صحیح بخاری (350) صحیح مسلم (685)";
abudawood.description = ``;