var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ لَقَدْ ارْتَقَيْتُ عَلَى ظَهْرِ الْبَيْتِ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى لَبِنَتَيْنِ مُسْتَقْبِلَ بَيْتِ الْمَقْدِسِ لِحَاجَتِهِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں (ایک بار) گھر کی چھت پر چڑھا تو دیکھا کہ رسول اللہ ﷺ قضائے حاجت کے لیے دو اینٹوں پر بیٹھے ہیں اور آپ ﷺ کا منہ بیت المقدس کی جانب ہے۔";
abudawood.hukam = "صحیح بخاری (145) صحیح مسلم (266)";
abudawood.description = ``;