var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَمُحَمَّدُ بْنُ بَكْرٍ قَالَا،أَخْبَرَنَا ابْنُ جُرَيْجٍ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي عَمَّارٍ يُحَدِّثُ فَذَكَرَهُ نَحْوَهُ.\nقَالَ أَبو دَاود: رَوَاهُ أَبُو عَاصِمٍ وَحَمَّادُ بْنُ مَسْعَدَةَ كَمَا رَوَاهُ ابْنُ بَكْرٍ.";
abudawood.urdu = "جناب ابن جریج کہتے ہیں کہ میں نے عبداللہ بن ابی عمار کو سنا،وہ بیان کرتے تھے۔اور مذکورہ بالا حدیث کی مانند روایت کیا۔امام ابوداؤد رحمہ اللہ نے کہا کہ ابوعاصم اور حماد بن مسعدہ نے بھی ابن بکر کی مانند روایت کیا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1199)`;