var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ يَحْيَى بْنِ يَزِيدَ الْهُنَائِيِّ،قَالَ: سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قَصْرِ الصَّلَاةِ؟ فَقَالَ أَنَسٌ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مَسِيرَةَ ثَلَاثَةِ أَمْيَالٍ-أَوْ ثَلَاثَةِ فَرَاسِخَ-شَكَّ شُعْبَةُ-يُصَلِّي رَكْعَتَيْنِ.";
abudawood.urdu = "یحیی بن یزید ہنائی کہتے ہیں کہ میں نے سیدنا انس بن مالک رضی اللہ عنہ سے نماز قصر کرنے کے بارے میں سوال کیا،تو انہوں نے فرمایا ’’رسول اللہ ﷺ جب تین میل یا تین فرسخ کی مسافت پر جاتے تو دو رکعتیں پڑھا کرتے تھے۔‘‘ یہ شک شعبہ کو ہوا ہے۔";
abudawood.hukam = "صحیح مسلم (691)";
abudawood.description = ``;