var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا ابْنُ عُيَيْنَةَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ سَمِعَا أَنَسَ بْنَ مَالِكٍ،يَقُولُ: صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا،وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کے ساتھ مدینے میں ظہر کی نماز چار رکعت پڑھی اور عصر کی نماز ذوالحلیفہ میں دو رکعت۔";
abudawood.hukam = "صحیح بخاری (1089) صحیح مسلم (690)";
abudawood.description = ``;