var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ شُعْبَةَ،حَدَّثَنِي حَمْزَةُ الْعَائِذِيُّ رَجُلٌ مِنْ بَنِي ضَبَّةَ،قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَزَلَ مَنْزِلًا,لَمْ يَرْتَحِلْ حَتَّى يُصَلِّيَ الظُّهْرَ،فَقَالَ لَهُ رَجُلٌ: وَإِنْ كَانَ بِنِصْفِ النَّهَارِ؟ قَالَ: وَإِنْ كَانَ بِنِصْفِ النَّهَارِ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ فرماتے تھے کہ رسول اللہ ﷺ جب کسی منزل پر پڑاؤ کرتے تو اس وقت تک کوچ نہ کرتے جب تک کہ ظہر کی نماز نہ پڑھ لیتے۔ایک شخص نے ان سے کہا: اگرچہ نصف النہار ہی ہوتا؟ انہوں نے کہا کہ (ہاں!) اگرچہ نصف النہار ہی ہوتا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (499 وسندہ صحیح)`;