var abudawood = {};
abudawood.arabic = "حَدَّثَنَاإِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،أَخْبَرَنَا عِيسَى عَنِ ابْنِ جَابِرٍ بِهَذَا الْمَعْنَى.\nقَالَ أَبو دَاود: وَرَوَاهُ عَبْدُ اللَّهِ بْنُ الْعَلَاءِ،عَنْ نَافِعٍ،قَالَ: حَتَّى إِذَا كَانَ عِنْدَ ذَهَابِ الشَّفَقِ,نَزَلَ فَجَمَعَ بَيْنَهُمَا.";
abudawood.urdu = "عیسیٰ نے ابن جابر سے اسی کے ہم معنی روایت کیا ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ عبداللہ بن علاء نے نافع سے روایت کرتے ہوئے کہا ہے۔جب شفق غروب ہونے لگی تو وہ (ابن عمر) اترے اور نمازیں جمع کر کے پڑھیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (596 وسندہ صحیح)`;