var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدٍ الْجَارِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ مَالِكٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَابَتْ لَهُ الشَّمْسُ بِمَكَّةَ،فَجَمَعَ بَيْنَهُمَا بِسَرِفٍ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ کو سورج مکہ میں غروب ہو گیا۔پھر آپ ﷺ نے (مغرب اور عشاء کی نمازیں) وادی سرف میں جا کر جمع کر کے پڑھیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (594)<br>أبو الزبیر مدلس (طبقات المدلسین : 101 / 3) و عنعن`;
abudawood.anwaar = [52,1];