var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي جَابِرُ بْنُ إِسْمَاعِيلَ،عَنْ عُقَيْلٍ... بِهَذَا الْحَدِيثِ،بِإِسْنَادِهِ. قَالَ: وَيُؤَخِّرُ الْمَغْرِبَ،حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ،حِينَ يَغِيبُ الشَّفَقُ.";
abudawood.urdu = "جناب عقیل نے اپنی سند سے یہ حدیث بیان کی انہوں نے کہا اور مغرب کو مؤخر کر لیتے اور عشاء کے ساتھ جمع کر کے پڑھتے،جبکہ شفق غروب ہو چکی ہوتی۔";
abudawood.hukam = "صحیح بخاری (1112) صحیح مسلم (704)";
abudawood.description = ``;