var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنِ الْبَرَاءِ،قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ،فَصَلَّى بِنَا الْعِشَاءَ الْآخِرَةَ،فَقَرَأَ فِي إِحْدَى الرَّكْعَتَيْنِ بِالتِّينِ وَالزَّيْتُونِ[أول سورة التين].";
abudawood.urdu = "سیدنا براء رضی اللہ عنہ بیان کرتے ہیں کہ ہم رسول اللہ ﷺ کے ساتھ ایک سفر میں نکلے،آپ ﷺ نے ہمیں عشاء کی نماز پڑھائی تو آپ ﷺ نے اس کی ایک رکعت میں سورۃ «والتین والزیتون» تلاوت فرمائی۔";
abudawood.hukam = "صحیح بخاری (767) صحیح مسلم (464)";
abudawood.description = ``;