var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ صَفْوَانَ بْنِ سُلَيْمٍ،عَنْ أَبِي بُسْرَةَ الْغِفَارِيِّ عَنِ الْبَرَاءِ بْنِ عَازِبٍ الْأَنْصَارِيِّ،قَالَ: صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةَ عَشَرَ سَفَرًا,فَمَا رَأَيْتُهُ تَرَكَ رَكْعَتَيْنِ إِذَا زَاغَتِ الشَّمْسُ قَبْلَ الظُّهْرِ.";
abudawood.urdu = "سیدنا براء بن عازب انصاری رضی اللہ عنہ بیان کرتے ہیں کہ میں اٹھارہ سفروں میں رسول اللہ ﷺ کے ساتھ رہا ہوں۔میں نے نہیں دیکھا کہ آپ ﷺ نے سورج ڈھل جانے کے بعد ظہر سے پہلے دو رکعتیں چھوڑی ہوں۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1352)
أخرجہ الترمذي (550 وسندہ حسن)`;