var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،عَنْ سَالِمٍ،عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَبِّحُ عَلَى الرَّاحِلَةِ أَيَّ وَجْهٍ تَوَجَّهَ،وَيُوتِرُ عَلَيْهَا،غَيْرَ أَنَّهُ لَا يُصَلِّي الْمَكْتُوبَةَ عَلَيْهَا.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ اپنی سواری پر نفل اور وتر پڑھا کرتے تھے،اس کا رخ خواہ کسی طرف ہی ہوتا مگر آپ ﷺ فرض نماز اس پر نہ پڑھتے تھے۔";
abudawood.hukam = "صحیح بخاری (1098) صحیح مسلم (700)";
abudawood.description = ``;