var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا رِبْعِيُّ بْنُ عَبْدِ اللَّهِ بْنِ الْجَارُودِ،حَدَّثَنِي عَمْرُو بْنُ أَبِي الْحَجَّاجِ،حَدَّثَنِي الْجَارُودُ بْنُ أَبِي سَبْرَةَ،حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ فَأَرَادَ أَنْ يَتَطَوَّعَ,اسْتَقْبَلَ بِنَاقَتِهِ الْقِبْلَةَ فَكَبَّرَ،ثُمَّ صَلَّى حَيْثُ وَجَّهَهُ رِكَابُهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ جب سفر میں ہوتے اور نفل پڑھنا چاہتے تو اپنی اونٹنی کو قبلہ رخ کرتے اور تکبیر تحریمہ کہہ کر نماز شروع کر لیتے،پھر نماز پڑھتے رہتے،خواہ اس کا رخ کسی بھی طرف ہوتا رہتا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1345)`;