var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ،عَنْ أَبِي الْحُبَابِ سَعِيدِ بْنِ يَسَارٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّهُ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى حِمَارٍ,وَهُوَ مُتَوَجِّهٌ إِلَى خَيْبَرَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ اپنے گدھے پر نماز پڑھ رہے تھے اور آپ ﷺ کا منہ خیبر کی طرف تھا۔";
abudawood.hukam = "صحیح مسلم (700)";
abudawood.description = ``;