var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَاجَةٍ،قَالَ: فَجِئْتُ وَهُوَ يُصَلِّي عَلَى رَاحِلَتِهِ نَحْوَ الْمَشْرِقِ،وَالسُّجُودُ أَخْفَضُ مِنَ الرُّكُوعِ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے مجھے کسی کام کے لیے بھیجا۔میں واپس آیا تو دیکھا کہ آپ ﷺ اپنی اونٹنی پر نماز پڑھ رہے تھے،آپ ﷺ کا رخ مشرق کی طرف تھا اور آپ ﷺ سجدے کے لیے رکوع سے زیادہ جھکتے تھے۔";
abudawood.hukam = "صحیح مسلم (540)";
abudawood.description = `مشکوۃ المصابیح (1346)`;