var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ ح،وحَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،أَخْبَرَنَا ابْنُ عُلَيَّةَ وَهَذَا لَفْظُهُ،أَخْبَرَنَا عَلِيُّ ابْنُ زَيْدٍ،عَنْ أَبِي نَضْرَةَ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،قَالَ: غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَشَهِدْتُ مَعَهُ الْفَتْحَ،فَأَقَامَ بِمَكَّةَ ثَمَانِي عَشْرَةَ لَيْلَةً،لَا يُصَلِّي إِلَّا رَكْعَتَيْنِ وَيَقُولُ: يَا أَهْلَ الْبَلَدِ! صَلُّوا أَرْبَعًا,فَإِنَّا قَوْمٌ سَفْرٌ.";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کے ساتھ غزوے کیے ہیں اور فتح مکہ میں بھی آپ ﷺ کے ساتھ تھا۔آپ ﷺ مکہ میں اٹھارہ راتیں ٹھہرے۔ان دنوں میں آپ دو دو رکعتیں ہی پڑھتے رہے اور فرماتے: ’’اے اہل شہر! تم چار رکعتیں پڑھو،ہم لوگ مسافر ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (545)<br>علي بن زید بن جدعان ضعیف مشہور<br>ولأصل الحدیث شواہد کثیرۃ جدًا`;
abudawood.anwaar = [52,1];