var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ وَهِشَامُ بْنُ خَالِدٍ الْمَعْنَى قَالَا حَدَّثَنَا الْوَلِيدُ بِهَذَا الْإِسْنَادِ قَالَ وَمَسَحَ بِأُذُنَيْهِ ظَاهِرِهِمَا وَبَاطِنِهِمَا زَادَ هِشَامٌ وَأَدْخَلَ أَصَابِعَهُ فِي صِمَاخِ أُذُنَيْهِ";
abudawood.urdu = "ولید بن مسلم نے مذکورہ بالا سند سے روایت کیا ہے اور کہا کہ رسول اللہ ﷺ نے اپنے کانوں کے باہر اور اندر کی طرف مسح کیا۔ہشام نے مزید کہا کہ آپ ﷺ نے اپنی انگلیاں کانوں کے سوراخوں میں داخل کیں۔";
abudawood.hukam = "حسن";
abudawood.description = `وانظر سنن أبی داود (122، 135)`;