var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،أَخْبَرَنِي أَبِي،حَدَّثَنَا شَرِيكٌ عَنِ ابْنِ الْأَصْبَهَانِيِّ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ بِمَكَّةَ سَبْعَ عَشْرَةَ يُصَلِّي رَكْعَتَيْنِ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ مکہ میں سترہ دن ٹھہرے اور دو دو رکعتیں پڑھتے رہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شاھد انظر الحدیث السابق (1230)`;