var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ ابْنِ ثَوْبَانَ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: أَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَبُوكَ عِشْرِينَ يَوْمًا,يَقْصُرُ الصَّلَاةَ.\nقَالَ أَبو دَاود: غَيْرُ مَعْمَرٍ يُرْسِلُهُ لَا يُسْنِدُهُ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ تبوک میں بیس دن ٹھہرے اور نماز قصر کرتے رہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ صرف معمر ہی نے اسے مسند بیان کیا ہے۔(دوسرے مرسل بیان کرتے ہیں۔)";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یحیی بن أبي کثیر مدلس ولم أجد تصریح سماعہ في ھذا الحدیث ولأصل الحدیث شواہد`;
abudawood.anwaar = [52,1];