var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَسَعِيدُ بْنُ مَنْصُورٍ،قَالَا: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ،عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: فَرَضَ اللَّهُ تَعَالَى الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا،وَفِي السَّفَرِ رَكْعَتَيْنِ،وَفِي الْخَوْفِ رَكْعَةً.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما کہتے ہیں کہ اللہ عزوجل نے تمہارے نبی کریم ﷺ کی زبان پر نماز فرض کی ہے۔اقامت میں چار رکعتیں،سفر میں دو رکعتیں اور خوف میں ایک رکعت۔";
abudawood.hukam = "صحیح مسلم (687)";
abudawood.description = ``;