var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى،حَدَّثَنَا ابْنُ عُلَيَّةَ،حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ،حَدَّثَنِي النُّعْمَانُ بْنُ سَالِمٍ،عَنْ عَمْرِو بْنِ أَوْسٍ،عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ،عَنْ أُمِّ حَبِيبَةَ،قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا,بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ.";
abudawood.urdu = "ام المؤمنین سیدہ ام حبیبہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ نے فرمایا ’’جو شخص ایک دن میں بارہ رکعتیں بطور نفل نماز پڑھتا ہے اس کے لیے ان کے بدلے جنت میں ایک گھر بنا دیا جاتا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (728)";
abudawood.description = ``;