var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ وَبَعْدَ صَلَاةِ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لَا يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ ظہر سے پہلے دو رکعتیں اور اس (ظہر) کے بعد دو رکعتیں،مغرب کے بعد دو رکعتیں اپنے گھر میں اور نماز عشاء کے بعد دو رکعتیں پڑھا کرتے تھے۔اور جمعہ کے بعد نہیں پڑھتے تھے حتیٰ کہ لوٹ آتے اور دو رکعتیں پڑھتے۔";
abudawood.hukam = "صحیح بخاری (937) صحیح مسلم (882)";
abudawood.description = ``;