var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرَ وَرَكْعَتَيْنِ قَبْلَ صَلَاةِ الْغَدَاةِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ ظہر سے پہلے چار رکعتیں اور نماز فجر سے پہلے کی دو رکعتیں نہ چھوڑا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (1182)";
abudawood.description = ``;