var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي عَطَاءٌ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ عَلَى شَيْءٍ مِنْ النَّوَافِلِ أَشَدَّ مُعَاهَدَةً مِنْهُ عَلَى الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ کسی نوافل پر اتنی پابندی نہ فرماتے تھے جتنی فجر کی سنتوں کی کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (1169) صحیح مسلم (724)";
abudawood.description = ``;