var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ،حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ،حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي رَكْعَتَيِ الْفَجْرِ: قُلْ يَا أَيُّهَا الْكَافِرُونَ[أول سورة الكافرون] وَ قُلْ هُوَ اللَّهُ أَحَدٌ[أول سورة الإخلاص].";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم ﷺ نے فجر کی سنتوں میں «قل یا أیہا الکافرون» اور «قل ہو اللہ أحد» کی قرآت فرمائی۔";
abudawood.hukam = "صحیح مسلم (726)";
abudawood.description = ``;