var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا خَالِدٌ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ إِسْحَاقَ الْمَدَنِيَّ عَنِ ابْنِ زَيْدٍ عَنِ ابْنِ سَيْلَانَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَدَعُوهُمَا وَإِنْ طَرَدَتْكُمُ الْخَيْلُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’فجر کی دو سنتیں مت چھوڑو اگرچہ دشمن کے گھوڑے تم کو کھدیڑ رہے ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>(عبد ربہ) ابن سیلان لم یوثقہ غیر ابن حبان وقال ابن القطان الفاسي : ’’ فحالہ مجہولۃ لاتعرف‘‘ (بیان الوھم والإیھام 3/ 386 ح 1127)`;
abudawood.anwaar = [53,1];