var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ،عَنْ زِيَادِ بْنِ سَعْدٍ عَمَّنْ حَدَّثَهُ ابْنُ أَبِي عَتَّابٍ أَوْ غَيْرُهُ،عَنْ أَبِي سَلَمَةَ،قَالَ قَالَتْ: عَائِشَةُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى رَكْعَتَيِ الْفَجْرِ,فَإِنْ كُنْتُ نَائِمَةً اضْطَجَعَ،وَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ جب فجر کی دو رکعتیں پڑھ لیتے،تو اگر میں سوئی ہوتی تو لیٹ جاتے اور اگر جاگ رہی ہوتی تو مجھ سے باتیں کرنے لگتے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1262)`;