var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى الْبَلْخِيُّ،قَالَ: قَالَ سُفْيَانُ: كَانَ عَطَاءُ بْنُ أَبِي رَبَاحٍ يُحَدِّثُ بِهَذَا الْحَدِيثِ،عَنْ سَعْدِ بْنِ سَعِيدٍ قَالَ أَبو دَاود: وَرَوَى عَبْدُ رَبِّهِ وَيَحْيَى ابْنَا سَعِيدٍ هَذَا الْحَدِيثَ مُرْسَلًا أَنَّ جَدَّهُمْ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ,بِهَذِهِ الْقِصَّةِ.";
abudawood.urdu = "حامد بن یحییٰ بلخی نے کہا کہ سفیان نے کہا: عطاء بن ابی رباح یہ حدیث سعد بن سعید سے بیان کرتے تھے۔امام ابوداؤد رحمہ اللہ نے کہا کہ عبدربہ اور یحییٰ،ابنائے سعید نے یہ حدیث مرسل روایت کی کہ ان کے دادا زید نے نبی کریم ﷺ کے ساتھ نماز پڑھی اور یہ قصہ بیان کیا .";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (1267)`;