var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَقِيلٍ بِهَذَا الْحَدِيثِ يُغَيِّرُ بَعْضَ مَعَانِي بِشْرٍ قَالَ فِيهِ وَتَمَضْمَضَ وَاسْتَنْثَرَ ثَلَاثًا";
abudawood.urdu = "جناب اسحاق بن اسماعیل کے واسطے سے یہ بھی روایت مروی ہے لیکن اس میں مذکورہ بالا روایت بشر (بشر بن مفضل) کے بعض معانی میں فرق ہے اس میں کہا ہے: ’’کلی کی اور ناک جھاڑی تین بار۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (126)`;
abudawood.anwaar = [17,1];