var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا أَبُو دَاوُدَ،حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الْقُرَشِيُّ،حَدَّثَنِي جَدِّي أَبُو الْمُثَنَّى عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: رَحِمَ اللَّهُ امْرَأً صَلَّى قَبْلَ الْعَصْرِ أَرْبَعًا.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہا بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اللہ تعالیٰ اس شخص پر رحم فرمائے جو عصر سے پہلے چار رکعتیں پڑھے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1170)
أخرجہ الترمذي (430 وسندہ حسن) وصححہ ابن خزیمۃ (1193 وسندہ حسن)`;