var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي إِسْحَاقَ،عَنْ عَاصِمِ بْنِ ضَمْرَةَ،عَنْ عَلِيٍّ عَلَيْهِ السَّلَام،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الْعَصْرِ رَكْعَتَيْنِ.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ عصر سے پہلے دو رکعتیں پڑھا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1172)
صححہ النووي في ریاض الصالحین (1121 بتحقیقي) ولم أر لمضعفہ حجۃً قویۃً`;