var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ هِلَالِ بْنِ يَسَافٍ،عَنْ وَهْبِ بْنِ الْأَجْدَعِ،عَنْ عَلِيٍّ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الصَّلَاةِ بَعْدَ الْعَصْرِ,إِلَّا وَالشَّمْسُ مُرْتَفِعَةٌ.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے عصر کے بعد نماز سے منع فرمایا ہے الا یہ کہ سورج اونچا ہو۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (574 وسندہ صحیح) وصححہ ابن خزیمۃ (1284 وسندہ صحیح)`;