var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنْ عَاصِمِ بْنِ ضَمْرَةَ،عَنْ عَلِيٍّ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي إِثْرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ رَكْعَتَيْنِ،إِلَّا الْفَجْرَ وَالْعَصْرَ.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ انہوں نے کہا: رسول اللہ ﷺ فجر اور عصر کے علاوہ ہر فرض نماز کے بعد دو رکعت پڑھا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن و ھو مدلس`;
abudawood.anwaar = [53,1];