var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي إِسْحَاقَ عَنِ الْأَسْوَدِ،وَمَسْرُوقٍ،قَالَا: نَشْهَدُ عَلَى عَائِشَةَ رَضِي اللَّهُ عَنْهَا،أَنَّهَا قَالَتْ: مَا مِنْ يَوْمٍ يَأْتِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،إِلَّا صَلَّى بَعْدَ الْعَصْرِ رَكْعَتَيْنِ.";
abudawood.urdu = "اسود اور مسروق (دونوں) نے کہا کہ ہم سیدہ عائشہ رضی اللہ عنہا کی بابت گواہی دیتے ہیں کہ انہوں نے بیان کیا کہ کوئی دن ایسا نہ گزرتا تھا کہ نبی کریم ﷺ عصر کے بعد دو رکعتیں نہ پڑھتے ہوں۔یعنی (ہر روز بلا ناغہ پڑھا کرتے تھے۔)";
abudawood.hukam = "صحیح بخاری (593) صحیح مسلم (835)";
abudawood.description = ``;