var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدٍ الْهَمْدَانِيُّ قَالَا حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ ابْنِ عَفْرَاءَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ عِنْدَهَا فَمَسَحَ الرَّأْسَ كُلَّهُ مِنْ قَرْنِ الشَّعْرِ كُلِّ نَاحِيَةٍ لِمُنْصَبِّ الشَّعْرِ لَا يُحَرِّكُ الشَّعْرَ عَنْ هَيْئَتِهِ";
abudawood.urdu = "سیدہ ربیع بنت معوذ ابن عفراء رضی اللہ عنہا کہتی ہیں کہ رسول اللہ ﷺ نے ان کے ہاں وضو کیا تو پورے سر کا مسح کیا،اوپر سے سر کا مسح شروع کرتے تھے،ہر جانب سے بالوں کی لٹوں کے رخ پر ہاتھ پھیرتے تھے۔اور آپ بالوں کو ان کی ہیت سے حرکت نہ دیتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (390)<br>محمد بن عجلان مدلس (طبقات المدلسین: 3/98) ولم أجد تصریح سماعہ<br>وعبد اللّٰہ بن محمد بن عقیل: ضعیف،ضعفہ الجمہور و أخطأ من زعم خلافہ وضعفہ ھو الراجح`;
abudawood.anwaar = [17,1];