var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ،حَدَّثَنَا عَمِّي،حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ،عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ،عَنْ ذَكْوَانَ-مَوْلَى عَائِشَةَ-،أَنَّهَا حَدَّثَتْهُ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْعَصْرِ،وَيَنْهَى عَنْهَا،وَيُوَاصِلُ،وَيَنْهَى عَنِ الْوِصَالِ.";
abudawood.urdu = "جناب ذکوان مولیٰ سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ سیدہ عائشہ رضی اللہ عنہا نے ان سے بیان کیا کہ رسول اللہ ﷺ عصر کے بعد نماز پڑھا کرتے تھے جب کہ لوگوں کو اس سے منع کرتے تھے۔خود وصال کرتے (یعنی دو دو دن کے اکھٹے روزے رکھتے یا اس سے زیادہ کے بھی اور درمیان میں افطار نہ کرتے) اور لوگوں کو وصال سے منع فرماتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن`;
abudawood.anwaar = [53,1];