var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ،حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنِ الْحُسَيْنِ الْمُعَلِّمِ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ،عَنْ عَبْدِ اللَّهِ الْمُزَنِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ،ثُمَّ قَالَ: صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ،لِمَنْ شَاءَ,خَشْيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً.";
abudawood.urdu = "سیدنا عبداللہ مزنی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’نماز مغرب سے پہلے دو رکعتیں پڑھا کرو‘‘ پھر فرمایا ’’نماز مغرب سے پہلے دو رکعتیں پڑھا کرو،جو چاہے۔‘‘ یہ اس ڈر سے کہ کہیں لوگ اسے سنت نہ بنا لیں۔";
abudawood.hukam = "صحیح بخاری (563)";
abudawood.description = ``;