var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا ابْنُ عُلَيَّةَ عَنِ الْجُرَيْرِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ،بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ,لِمَنْ شَاءَ.";
abudawood.urdu = "سیدنا عبداللہ بن مغفل رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’ہر دو اذانوں کے درمیان نماز ہے۔ہر دو اذانوں کے درمیان نماز ہے،جو چاہے۔‘‘";
abudawood.hukam = "صحیح بخاری (624) صحیح مسلم (838)";
abudawood.description = ``;