var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ،حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ،عَنْ يَحْيَى بْنِ الْحَارِثِ عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي أُمَامَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: صَلَاةٌ فِي إِثْرِ صَلَاةٍ لَا لَغْوَ بَيْنَهُمَا كِتَابٌ فِي عِلِّيِّينَ.";
abudawood.urdu = "سیدنا ابوامامہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’ایک نماز کے بعد دوسری نماز،اس طرح کہ ان کے مابین کوئی لغو نہ ہو،(اس عمل سے) علیین میں نام درج ہو جاتا ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `انظر الحدیث السابق (558)`;