var abudawood = {};
abudawood.arabic = "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ،حَدَّثَنَا الْوَلِيدُ،عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ،عَنْ مَكْحُولٍ،عَنْ كَثِيرِ بْنِ مُرَّةَ أَبِي شَجَرَةَ،عَنْ نُعَيْمِ بْنِ هَمَّارٍ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: يَقُولُ اللَّهُ عَزَّ وَجَلَّ: يَا ابْنَ آدَمَ! لَا تُعْجِزْنِي مِنْ أَرْبَعِ رَكَعَاتٍ فِي أَوَّلِ نَهَارِكَ,أَكْفِكَ آخِرَهُ.";
abudawood.urdu = "سیدنا نعیم بن ہمار رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،فرماتے تھے ’’اللہ عزوجل فرماتا ہے،اے ابن آدم! تو میرے لیے شروع دن میں چار رکعات پڑھنے سے عاجز نہ رہ،میں آخر دن تک تیری کفایت کروں گا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1314)
وللحدیث شاھد عند أحمد (4/201، 153 وسندہ صحیح)`;