var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ عَنْ ابْنِ عَجْلَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ أَنَّ رُبَيِّعَ بِنْتَ مُعَوِّذٍ ابْنِ عَفْرَاءَ أَخْبَرَتْهُ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ قَالَتْ فَمَسَحَ رَأْسَهُ وَمَسَحَ مَا أَقْبَلَ مِنْهُ وَمَا أَدْبَرَ وَصُدْغَيْهِ وَأُذُنَيْهِ مَرَّةً وَاحِدَةً";
abudawood.urdu = "سیدہ ربیع بنت معوذ ابن عفراء رضی اللہ عنہا نے کہا کہ میں نے رسول اللہ ﷺ کو وضو کرتے دیکھا۔وہ کہتی ہیں کہ آپ ﷺ نے اپنے سر کا مسح کیا،اگلے حصے کا،پچھلے حصے کا،کنپٹیوں کا اور دونوں کانوں کا ایک بار۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (34)،ابن ماجہ (441)<br>ابن عقیل ضعیف (تقدم: 128)`;
abudawood.anwaar = [17,1];