var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ نُفَيْلٍ وَأَحْمَدُ بْنُ يُونُسَ،قَالَا: حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا سِمَاكٌ،قَالَ: قُلْتُ لِجَابِرِ بْنِ سَمُرَةَ: أَكُنْتَ تُجَالِسُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ,كَثِيرًا،فَكَانَ لَا يَقُومُ مِنْ مُصَلَّاهُ الَّذِي صَلَّى فِيهِ الْغَدَاةَ،حَتَّى تَطْلُعَ الشَّمْسُ،فَإِذَا طَلَعَتْ قَامَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "جناب سماک کہتے ہیں کہ میں نے سیدنا جابر بن سمرہ رضی اللہ عنہ سے پوچھا کہ کیا آپ رسول اللہ ﷺ کی مجلس میں بیٹھا کرتے تھے؟ انہوں نے کہا: ہاں بہت زیادہ۔آپ ﷺ جہاں فجر کی نماز ادا فرماتے وہاں سے اس وقت تک نہ اٹھتے جب تک کہ سورج طلوع نہ ہو جاتا۔جب (سورج) طلوع ہو جاتا تو پھر آپ ﷺ کھڑے ہو جاتے۔";
abudawood.hukam = "صحیح مسلم (670)";
abudawood.description = ``;