var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ،أَخْبَرَنَا شُعْبَةُ،عَنْ يَعْلَى بْنِ عَطَاءٍ،عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْبَارِقِيِّ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَال:َ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’رات اور دن کی نماز دو دو رکعت ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ الترمذي (597 وسندہ حسن) وللحدیث شواھد، انظر الموطأ (260 بتحقیقي)`;