var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ يُحَدِّثُ عَنْ أَبَانَ بْنِ صَالِحٍ عَنْ مُجَاهِدٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ نَهَى نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِبَوْلٍ فَرَأَيْتُهُ قَبْلَ أَنْ يُقْبَضَ بِعَامٍ يَسْتَقْبِلُهَا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے منع فرمایا کہ ہم پیشاب کے لیے قبلے کی طرف منہ کریں۔پھر میں نے آپ ﷺ کی وفات سے ایک سال پہلے آپ کو دیکھا کہ آپ ﷺ قبلے کی طرف منہ کر کے (قضائے حاجت کے لیے) بیٹھے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `محمد بن إسحاق صرح بالسماع عند أحمد (3/360)`;