var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ سُفْيَانَ بْنِ سَعِيدٍ عَنْ ابْنِ عَقِيلٍ عَنْ الرُّبَيِّعِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ بِرَأْسِهِ مِنْ فَضْلِ مَاءٍ كَانَ فِي يَدِهِ";
abudawood.urdu = "سیدہ ربیع (ربیع بنت معوذ) رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ نے سر کا مسح کیا،اور اسی پانی سے کیا جو ان کے ہاتھوں میں (پہلے سے) بچا ہوا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سفیان بن سعید الثوري مدلس (طبقات المدلسین بتحقیقي: 2/51،والراجح أنہ من المرتبۃ الثالثۃ) وعنعن<br>وابن عقیل ضعیف (تقدم: 128)`;
abudawood.anwaar = [17,1];