var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي الْأَسْوَدِ،حَدَّثَنِي أَبُو مُطَرِّفٍ مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ،حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْفِطْرِيُّ،عَنْ سَعْدِ بْنِ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى مَسْجِدَ بَنِي عَبْدِ الْأَشْهَلِ،فَصَلَّى فِيهِ الْمَغْرِبَ،فَلَمَّا قَضَوْا صَلَاتَهُمْ,رَآهُمْ يُسَبِّحُونَ بَعْدَهَا،فَقَالَ: هَذِهِ صَلَاةُ الْبُيُوتِ.";
abudawood.urdu = "سیدنا کعب بن عجرہ سے روایت ہے کہ نبی کریم ﷺ قبیلہ بنی عبدالاشہل کی مسجد میں تشریف لائے اور وہاں مغرب کی نماز پڑھی۔نماز کے بعد آپ ﷺ نے ان کو دیکھا کہ وہ اس کے بعد نفل پڑھ رہے ہیں۔آپ ﷺ نے فرمایا ’’یہ گھروں کی نماز ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1182)
أخرجہ الترمذي (604 وسندہ حسن) والنسائي (1601 وسندہ حسن) وصححہ ابن خزیمۃ (1201 وسندہ حسن) إسحاق بن کعب بن عجرۃ: حسن الحدیث علی الراجح`;