var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،قَالَ: حَدَّثَنَا أَبُو دَاوُدَ،قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ يَزِيدَ بْنِ خُمَيْرٍ،قَالَ: سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي قَيْسٍ،يَقُولُ: قَالَتْ عَائِشَةُ رَضِي اللَّهُ عَنْهَا: لَا تَدَعْ قِيَامَ اللَّيْلِ, فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَدَعُهُ،وَكَانَ إِذَا مَرِضَ أَوْ كَسِلَ,صَلَّى قَاعِدًا.";
abudawood.urdu = "سیدنا عبداللہ بن ابی قیس رضی اللہ عنہ بیان کرتے ہیں کہ سیدہ عائشہ رضی اللہ عنہا نے فرمایا ’’رات کا قیام مت چھوڑو کیونکہ رسول اللہ ﷺ اسے نہ چھوڑتے تھے۔اگر آپ ﷺ بیمار ہوتے یا کسل مندی کی کیفیت ہوتی تو بیٹھ کر نماز پڑھ لیا کرتے تھے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;