var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ ابْنِ عَفْرَاءَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَأَدْخَلَ إِصْبَعَيْهِ فِي حُجْرَيْ أُذُنَيْهِ";
abudawood.urdu = "سیدہ ربیع بنت معوذ رضی اللہ عنہا کہتی ہیں کہ نبی کریم ﷺ نے وضو کیا تو اپنی دونوں انگلیاں اپنے کانوں کے سوراخوں میں داخل کیں۔";
abudawood.hukam = "حسن";
abudawood.description = `ولہ شواہد انظر الحدیث الآتي (135)`;