var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ هَمَّامِ بْنِ مُنَبِّهٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ،فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ,فَلْيَضْطَجِعْ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی رات کو اٹھ کر نماز پڑھے اور پھر قرآن کو اپنی زبان پر بھاری محسوس کرنے لگے،اسے معلوم نہ ہو کہ کیا کہہ رہا ہے تو چاہیئے کہ سو جائے۔‘‘";
abudawood.hukam = "صحیح مسلم (787)";
abudawood.description = ``;