var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الْكُوفِيُّ،حَدَّثَنَا حَفْصٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: إِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُوقِظُهُ اللَّهُ عَزَّ وَجَلَّ بِاللَّيْلِ،فَمَا يَجِيءُ السَّحَرُ،حَتَّى يَفْرُغَ مِنْ حِزْبِهِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ بلاشبہ اللہ عزوجل رسول اللہ ﷺ کو رات میں جگا دیتا تھا۔چنانچہ سحر (صبح) نہ ہو پاتی تھی کہ آپ اپنے معمول کی عبادت سے فارغ ہو چکے ہوتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حفص بن غیاث عنعن وھو مدلس`;
abudawood.anwaar = [54,1];