var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،حَدَّثَنَا أَبُو الْأَحْوَصِ ح،وحَدَّثَنَا هَنَّادٌ،عَنْ أَبِي الْأَحْوَصِ وَهَذَا حَدِيثُ إِبْرَاهِيمَ،عَنْ أَشْعَثَ،عَنْ أَبِيهِ،عَنْ مَسْرُوقٍ،قَالَ: سَأَلْتُ عَائِشَةَ رَضِي اللَّهُ عَنْهَا عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقُلْتُ لَهَا: أَيَّ حِينٍ كَانَ يُصَلِّي؟ قَالَتْ: كَانَ إِذَا سَمِعَ الصُّرَاخَ قَامَ فَصَلَّى.";
abudawood.urdu = "مسروق کہتے ہیں کہ میں نے ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے رسول اللہ ﷺ کی نماز کے متعلق پوچھا کہ آپ ﷺ کس وقت نماز پڑھا کرتے تھے؟ تو انہوں نے کہا: آپ ﷺ جب مرغ کی پکار سنتے تو اٹھ کھڑے ہوتے اور نماز پڑھتے تھے۔";
abudawood.hukam = "صحیح بخاری (1132) صحیح مسلم (741)";
abudawood.description = ``;