var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى،حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا،عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ،عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الدُّؤَلِيِّ،عَنْ عَبْدِ الْعَزِيزِ ابْنِ أَخِي حُذَيْفَةَ،عَنْ حُذَيْفَةَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَزَبَهُ أَمْرٌ صَلَّى.";
abudawood.urdu = "سیدنا حذیفہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ کو جب کوئی غم لاحق ہوتا تو نماز پڑھنے لگتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن عبد اللّٰہ بن أبي قدامۃ الدؤلي مجہول (التحریر : 6041) وثقہ ابن حبان وحدہ وفی السند اختلاف<br>وحدیث أحمد (4/ 333 ح 18937 وسندہ صحیح) یغني عنہ`;
abudawood.anwaar = [54,2];