var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،فِي هَذِهِ الْآيَةِ-تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّارَزَقْنَاهُمْ يُنْفِقُونَ[السجدة: 16]-،قَالَ: كَانُوا يَتَيَقَّظُونَ مَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ,يُصَلُّونَ. وَكَانَ الْحَسَنُ يَقُولُ قِيَامُ اللَّيْلِ .";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ اس آیت کریمہ «تتجا فی جنوبہم عن المضاجع یدعون ربہم خوفا وطمعا ومما رزقناہم ینفقون» ’’ان کے پہلو بستروں سے دور رہتے ہیں،وہ اپنے رب کو خوف اور امید سے پکارتے ہیں اور جو ہم نے ان کو دیا اس میں سے خرچ کرتے ہیں۔‘‘ کی تفسیر میں فرماتے ہیں کہ یہ لوگ (صحابہ) مغرب اور عشاء کے درمیان جاگتے تھے،یعنی نماز پڑھتے تھے۔اور جناب حسن بصری اس سے رات کا قیام (تہجد) مراد لیتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ وسعید بن أبي عروبۃ مدلسان (تقدما : 29،33) وعنعنا`;
abudawood.anwaar = [55,1];