var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَابْنُ أَبِي عَدِيٍّ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ,فِي قَوْلِهِ عَزَّ وَجَلَّ:كَانُوا قَلِيلًا مِنَ اللَّيْلِ مَا يَهْجَعُونَ[الذاريات: 17]،قَالَ: كَانُوا يُصَلُّونَ فِيمَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ. زَادَ فِي حَدِيثِ يَحْيَى وَكَذَلِكَ: تَتَجَافَى جُنُوبُهُمْ[السجدة: 16].";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ نے آیت کریمہ«کانوا قلیلا من اللیل ما یہجعون» ’’یہ لوگ رات میں بہت کم سوتے تھے۔‘‘ کی تفسیر میں فرمایا کہ صحابہ کرام رضی اللہ عنہم مغرب اور عشاء کے مابین نماز پڑھا کرتے تھے۔اور یحییٰ کی روایت میں یہ اضافہ ہے کہ آیت کریمہ «تجافی جنوبہم» سے بھی یہی مراد ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1321)`;
abudawood.anwaar = [55,1];