var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا ابْنُ حَنْبَلٍ يَعْنِي أَحْمَدَ،حَدَّثَنَا حَجَّاجٌ،قَالَ: قَالَ ابْنُ جُرَيْجٍ،أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ،عَنْ عَلِيٍّ الْأَزْدِيِّ،عَنْ عُبَيْدِ بْنِ عُمَيْرٍ،عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ: أَيُّ الْأَعْمَالِ أَفْضَلُ؟ قَالَ: طُولُ الْقِيَامِ.";
abudawood.urdu = "سیدنا عبداللہ بن حبشی خثعمی رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ سے پوچھا گیا: کون سا عمل افضل ہے؟ آپ ﷺ نے فرمایا ’’(نماز میں) لمبا قیام۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (2527 وسندہ حسن)`;