var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى،فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ,صَلَّى رَكْعَةً وَاحِدَةً،تُوتِرُ لَهُ مَا قَدْ صَلَّى.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ ایک شخص نے رسول اللہ ﷺ سے رات کی نماز کے بارے میں پوچھا،تو آپ ﷺ نے فرمایا ’’رات کی نماز دو دو رکعت ہے۔جب تم میں سے کسی کو صبح ہو جانے کا اندیشہ ہو تو ایک رکعت پڑھ لے۔یہ اس کی پڑھی ہوئی نماز کو وتر بنا دے گی۔‘‘";
abudawood.hukam = "صحیح بخاری (990) صحیح مسلم (749)";
abudawood.description = ``;