var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرَكَانِيُّ،حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ،عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو مَوْلَى الْمُطَّلِبِ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،قَال:َ كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَدْرِ مَا يَسْمَعُهُ مَنْ فِي الْحُجْرَةِ,وَهُوَ فِي الْبَيْتِ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ (رات کی نماز میں) نبی کریم ﷺ کی قرآت اس قدر (بلند) ہوتی تھی کہ صحن میں بیٹھا آدمی سن سکتا تھا جب کہ آپ ﷺ گھر میں (یعنی کمرے میں) ہوتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1203)`;