var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ عِمْرَانَ بْنِ زَائِدَةَ،عَنْ أَبِيهِ،عَنْ أَبِي خَالِدٍ الْوَالِبِيِّ،عَنْ أَبِي هُرَيْرَةَ،أَنَّهُ قَالَ: كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ,يَرْفَعُ طَوْرًا،وَيَخْفِضُ طَوْرًا.\nقَالَ أَبو دَاود: أَبُو خَالِدٍ الْوَالِبِيُّ اسْمُهُ هُرْمُزُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ رات کو کبھی بلند آواز سے اور کبھی دھیمی آواز سے قرآت کرتے تھے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابوخالد والبی کا نام ہرمز ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1202)
صححہ ابن خزیمۃ (1159 وسندہ حسن)`;