var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبَّادُ بْنُ مَنْصُورٍ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ فَذَكَرَ الْحَدِيثَ كُلَّهُ ثَلَاثًا ثَلَاثًا قَالَ وَمَسَحَ بِرَأْسِهِ وَأُذُنَيْهِ مَسْحَةً وَاحِدَةً";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ انہوں نے رسول اللہ ﷺ کو وضو کرتے دیکھا،اور ساری حدیث میں (اعضائے وضو کو دھونے کا) تین تین بار ذکر کیا۔(مگر سر کے بارے میں کہا) ’’اور اپنے سر اور کانوں کا مسح ایک بار کیا۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عباد بن منصور ضعیف مدلس،انظر طبقات المدلسین (121/ 4) وضعفہ الجمھور`;
abudawood.anwaar = [17,2];