var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي سَعِيدٍ،قَالَ: اعْتَكَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ،فَسَمِعَهُمْ يَجْهَرُونَ بِالْقِرَاءَةِ،فَكَشَفَ السِّتْرَ،وَقَالَ: أَلَا إِنَّ كُلَّكُمْ مُنَاجٍ رَبَّهُ،فَلَا يُؤْذِيَنَّ بَعْضُكُمْ بَعْضًا،وَلَا يَرْفَعْ بَعْضُكُمْ عَلَى بَعْضٍ فِي الْقِرَاءَةِ-أَوْ قَالَ: فِي الصَّلَاةِ-";
abudawood.urdu = "سیدنا ابوسعید (خدری) رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مسجد میں اعتکاف فرمایا۔آپ نے لوگوں کو سنا کہ وہ اونچی آواز سے قرآت کر رہے ہیں۔آپ ﷺ نے پردہ ہٹایا اور فرمایا ’’خبردار! تم بلاشبہ سب کے سب اپنے رب سے مناجات کر رہے ہو مگر کوئی دوسرے کو ہرگز ایذا نہ دے اور قرآت میں اپنی آواز دوسرے پر بلند نہ کرے۔‘‘ یا فرمایا ’’نماز میں (اپنی آواز بلند نہ کرے)۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (856)
صححہ ابن خزیمۃ (1162 وسندہ صحیح)`;