var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ،عَنْ بَحِيرِ بْنِ سَعْدٍ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ،عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْجَاهِرُ بِالْقُرْآنِ كَالْجَاهِرِ بِالصَّدَقَةِ،وَالْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ.";
abudawood.urdu = "سیدنا عقبہ بن عامر جھنی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’قرآن کو اونچی آواز سے پڑھنے والا ایسے ہے جیسے کوئی دکھا کر صدقہ کرے۔اور دھیمی آواز سے قرآن پڑھنے والا ایسے ہے جیسے کوئی مخفی طور پر صدقہ دے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2202)
إسماعیل بن عیاش تابعہ معاویۃ بن صالح عند النسائي (2562 وسندہ حسن)`;