var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ حَنْظَلَةَ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ عَشْرَ رَكَعَاتٍ،وَيُوتِرُ بِسَجْدَةٍ،وَيَسْجُدُ سَجْدَتَيِ الْفَجْرِ،فَذَلِكَ ثَلَاثَ عَشْرَةَ رَكْعَةً.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ رات میں دس رکعتیں پڑھا کرتے،اور ایک رکعت وتر پڑھتے۔اور (بعد ازاں) دو رکعتیں فجر کی پڑھتے۔اس طرح یہ کل تیرہ رکعات ہوئیں۔";
abudawood.hukam = "صحیح بخاری (1140) صحیح مسلم (738)";
abudawood.description = ``;