var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِاللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً،ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے منقول ہے کہ رسول اللہ ﷺ رات کو تیرہ رکعات پڑھا کرتے،پھر جب صبح کی اذان سنتے تو ہلکی سی دو رکعتیں پڑھتے۔";
abudawood.hukam = "صحیح بخاری (1170)";
abudawood.description = ``;