var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ سَعِيدٍ بِهَذَا الْحَدِيثِ،قَالَ: ابْنُ بَشَّارٍ بِنَحْوِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ إِلَّا أَنَّهُ قَالَ: وَيُسَلِّمُ تَسْلِيمَةً يُسْمِعُنَا.";
abudawood.urdu = "محمد بن بشار نے ابن عدی سے،انہوں نے سعید سے یہی حدیث روایت کی۔ابن بشار نے یحییٰ بن سعید کی حدیث کی مانند بیان کیا،مگر کہا: آپ سلام کہتے ایک سلام اور ہمیں سنواتے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1342، 1343، 1344) قتادۃ صرح بالسماع عند البیھقي (2/499، 500)`;