var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ،عَنْ بَهْزِ بْنِ حَكِيمٍ،عَنْ زُرَارَةَ بْنِ أَوْفَى،عَنْ سَعْدِ بْنِ هِشَامٍ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا... بِهَذَا الْحَدِيثِ،وَلَيْسَ فِي تَمَامِ حَدِيثِهِمْ.";
abudawood.urdu = "بہز بن حکیم،زرارہ بن اوفی سے،وہ سعد بن ہشام سے وہ سیدہ عائشہ رضی اللہ عنہا سے یہی حدیث روایت کرتے ہیں مگر یہ حدیث ان کی روایت کے برابر نہیں ہے۔(روایات یزید بن ہارون،ابن ابی عدی اور مروان بن معاویہ)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1342)`;