var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ،عَنْ خَالِدٍ،عَنْ حُصَيْنٍ... نَحْوَهُ،قَالَ: وَأَعْظِمْ لِي نُورًا.\nقَالَ أَبو دَاود: وَكَذَلِكَ قَالَ أَبُو خَالِدٍ الدَّالَانِيُّ،عَنْ حَبِيبٍ فِي هَذَا وَكَذَلِكَ قَالَ فِي هَذَا الْحَدِيثِ وَقَالَ سَلَمَةُ ابْنُ كُهَيْلٍ،عَنْ أَبِي رِشْدِينَ: عَنِ ابْنِ عَبَّاسٍ.";
abudawood.urdu = "خالد نے حصین سے اس کے مثل بیان کیا ہے اور کہا وأعظم لی نورا » یعنی « اللہم » کے بغیر۔امام ابوداؤد رحمہ اللہ کہتے ہیں:ابوخالد دالانی نے حبیب سے سابقہ روایت میں اور اس روایت میں بھی ایسے ہی کہا ہے۔اور سلمہ بن کہیل نے بواسطہ ابورشدین،سیدنا ابن عباس رضی اللہ عنہما سے روایت کی ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (58) ورواہ مسلم (763)`;