var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا زَيْدٌ يَعْنِي ابْنَ الْحُبَابِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ ثَوْبَانَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْفَضْلِ الْهَاشِمِيُّ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ مَرَّتَيْنِ مَرَّتَيْنِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ (ایک بار) نبی کریم ﷺ نے وضو کیا تو دو دو بار کیا (یعنی اعضائے وضو کو دو دو بار دھویا)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;