var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ عِرَاكِ بْنِ مَالِكٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،أَنَّهَا أَخْبَرَتْهُ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَيُصَلِّي بِاللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً،بِرَكْعَتَيِ الْفَجْرِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ رات میں فجر کی سنتوں سمیت تیرہ رکعات پڑھا کرتے تھے۔";
abudawood.hukam = "صحیح مسلم (737)";
abudawood.description = ``;