var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،قَالَ: سَأَلْتُ عَائِشَةَ: كَيْفَ كَانَ عَمَلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ هَلْ كَانَ يَخُصُّ شَيْئًا مِنَ الْأَيَّامِ؟ قَالَتْ: لَا،كَانَ كُلُّ عَمَلِهِ دِيمَةً،وَأَيُّكُمْ يَسْتَطِيعُ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَطِيعُ؟!";
abudawood.urdu = "جناب علقمہ بیان کرتے ہیں،میں نے سیدہ عائشہ رضی اللہ عنہا سے پوچھا کہ رسول اللہ ﷺ کے اعمال کا کیا انداز تھا،کیا آپ ﷺ نے کوئی دن خاص کر رکھے تھے؟ انہوں نے کہا: نہیں،آپ ﷺ کے ہر عمل میں ہمیشگی ہوتی تھی اور تم میں وہ استطاعت کہاں جو رسول اللہ ﷺ کو حاصل تھی۔";
abudawood.hukam = "صحیح بخاری (6466) صحیح مسلم (783)";
abudawood.description = ``;