var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَلَا أُخْبِرُكُمْ بِوُضُوءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَوَضَّأَ مَرَّةً مَرَّةً";
abudawood.urdu = "جناب عطاء بن یسار سے روایت ہے کہ سیدنا ابن عباس رضی اللہ عنہما نے کہا: کیا میں تمہیں رسول اللہ ﷺ کا وضو نہ بتاؤں؟ چنانچہ انہوں نے اعضائے وضو کو ایک ایک بار دھویا۔";
abudawood.hukam = "صحیح بخاری (157)";
abudawood.description = ``;