var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ أَخْبَرَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ فِي تَاسِعَةٍ تَبْقَى وَفِي سَابِعَةٍ تَبْقَى وَفِي خَامِسَةٍ تَبْقَى";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما،نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’لیلۃ القدر کو رمضان کی آخری دس (راتوں) میں تلاش کرو۔آخری نویں،ساتویں اور پانچویں رات میں۔‘‘";
abudawood.hukam = "صحیح بخاری (2021)";
abudawood.description = ``;