var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَكِيمُ بْنُ سَيْفٍ الرَّقِّيُّ أَخْبَرَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَمْرٍو عَنْ زَيْدٍ يَعْنِي ابْنَ أَبِي أُنَيْسَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطْلُبُوهَا لَيْلَةَ سَبْعَ عَشْرَةَ مِنْ رَمَضَانَ وَلَيْلَةَ إِحْدَى وَعِشْرِينَ وَلَيْلَةَ ثَلَاثٍ وَعِشْرِينَ ثُمَّ سَكَتَ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ رسول اللہ ﷺ نے ہم سے فرمایا ’’اسے (یعنی لیلۃ القدر کو) رمضان کی سترھویں،اکیسویں اور تئیسویں رات میں تلاش کرو۔‘‘ پھر خاموش ہو رہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن`;
abudawood.anwaar = [55,1];