var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ أَنَّهُ سَمِعَ مُطَرِّفًا عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي لَيْلَةِ الْقَدْرِ قَالَ لَيْلَةُ الْقَدْرِ لَيْلَةُ سَبْعٍ وَعِشْرِينَ";
abudawood.urdu = "سیدنا معاویہ بن ابی سفیان رضی اللہ عنہما،نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’ستائیسویں کی رات شب قدر ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `ورواہ البیھقي (4/312) بسند صحیح عن شعبۃ بہ موقوفًا وروی الطحاوي في معاني الآثار (3/84) بسند صحیح عن ابن عمر من قولہ موقوفًا علیہ وھو صحیح`;