var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْعَلَاءِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَفْقَهُ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاثٍ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو بن العاص رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس شخص نے تین دن سے کم میں قرآن پڑھا اس نے اسے سمجھا ہی نہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2201)
سعید بن ابی عروبہ تابعہ شعبۃ عند الدارمي (1534، نسخہ أخری: 1517 وسندہ صحیح / معاذ علی زئی)`;