var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ أَخْبَرَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ سَأَلْتُ أَبَا مَسْعُودٍ وَهُوَ يَطُوفُ بِالْبَيْتِ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ الْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ";
abudawood.urdu = "عبدالرحمٰن بن یزید بیان کرتے ہیں کہ میں نے سیدنا ابومسعود رضی اللہ عنہ سے پوچھا جبکہ وہ بیت اللہ کا طواف کر رہے تھے،انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص رات کو سورۃ البقرہ کی آخری دو آیتیں پڑھ لے،یہ اس کو کافی ہو جاتی ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (5008) صحیح مسلم (807)";
abudawood.description = ``;