var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ أَخْبَرَنَا قَتَادَةُ عَنْ عَبَّاسٍ الْجُشَمِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سُورَةٌ مِنْ الْقُرْآنِ ثَلَاثُونَ آيَةً تَشْفَعُ لِصَاحِبِهَا حَتَّى يُغْفَرَ لَهُ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ،نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’قرآن کریم کی ایک سورت تیس آیتوں والی،اپنے پڑھنے والے کے لیے سفارش کرے گی،حتیٰ کہ اسے بخش دیا جائے گا۔‘‘ (مراد ہے) « تبارک الذی بیدہ الملک »۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2153)
أخرجہ الترمذي (2891 وسندہ حسن) وابن ماجہ (3786 وسندہ حسن)`;