var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ أَنَّ مِشْرَحَ بْنَ هَاعَانَ أَبَا الْمُصْعَبِ حَدَّثَهُ أَنَّ عُقْبَةَ بْنَ عَامِرٍ حَدَّثَهُ قَالَ قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفِي سُورَةِ الْحَجِّ سَجْدَتَانِ قَالَ نَعَمْ وَمَنْ لَمْ يَسْجُدْهُمَا فَلَا يَقْرَأْهُمَا";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے کہا: اے اللہ کے رسول! کیا سورۃ الحج میں دو سجدے ہیں؟ آپ ﷺ نے فرمایا ’’ہاں! اور جو یہ نہ کرنا چا ہے وہ ان کی تلاوت ہی نہ کرے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1030)
ابن لھیعۃ صرح بالسماع و حدث بہ قبل اختلاطہ و مشرح بن ھاعان حسن الحدیث فالحدیث قوي خلافًا لما ذھب إلیہ الإمام الترمذي رحمہ اللہ (578)`;