var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ قَالَ مُحَمَّدٌ رَأَيْتُهُ بِمَكَّةَ حَدَّثَنَا أَبُو قُدَامَةَ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَسْجُدْ فِي شَيْءٍ مِنْ الْمُفَصَّلِ مُنْذُ تَحَوَّلَ إِلَى الْمَدِينَةِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے مدینہ تشریف لانے کے بعد جز ء مفصل میں کسی مقام پر سجدہ نہیں کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو قدامۃ الحارث بن عبید : ضعیف`;
abudawood.anwaar = [56,1];