var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ،أَخْبَرَنَا ابْنُ وَهْبٍ،حَدَّثَنَا أَبُو صَخْرٍ عَنِ ابْنِ قُسَيْطٍ،عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ،عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ. قَالَ أَبو دَاود: كَانَ زَيْدٌ الْإِمَامَ،فَلَمْ يَسْجُدْ فِيهَا";
abudawood.urdu = "خارجہ بن زید بن ثابت اپنے والد سے وہ نبی کریم ﷺ سے مذکورہ بالا حدیث کے ہم معنی روایت کرتے ہیں۔امام ابوداؤد رحمہ اللہ بیان کرتے ہیں کہ زید امام تھے اور انہوں نے سجدہ نہیں کیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الدارقطني (1/409، 410 ح 1512 وسندہ حسن) وصححہ ابن خزیمۃ (566 وسندہ حسن) والحدیث السابق (1404) شاھد لہ`;