var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ لَيْسَ ص مِنْ عَزَائِمِ السُّجُودِ وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ فِيهَا";
abudawood.urdu = "عکرمہ سے روایت ہے کہ سیدنا ابن عباس رضی اللہ عنہما نے بیان کیا کہ سورۃ ص کا سجدہ واجبی سجدوں میں سے نہیں ہے،جب کہ میں نے رسول اللہ ﷺ کو دیکھا ہے کہ آپ اس میں سجدہ کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (1069)";
abudawood.description = ``;