var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ قَارِظٍ عَنْ أَبِي غَطَفَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَنْثِرُوا مَرَّتَيْنِ بَالِغَتَيْنِ أَوْ ثَلَاثًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’ناک جھاڑو (اور صاف کرو) دو بار یا تین بار،خوب اچھی طرح۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;