var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ أَبُو الْجَمَاهِرِ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ مُصْعَبِ بْنِ ثَابِتِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ عَامَ الْفَتْحِ سَجْدَةً فَسَجَدَ النَّاسُ كُلُّهُمْ مِنْهُمْ الرَّاكِبُ وَالسَّاجِدُ فِي الْأَرْضِ حَتَّى إِنَّ الرَّاكِبَ لَيَسْجُدُ عَلَى يَدِهِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فتح مکہ کے موقع پر سجدے کی آیت تلاوت فرمائی تو سب لوگوں نے سجدہ کیا۔ان میں سے کچھ سواریوں پر سوار تھے اور کچھ زمین پر سجدہ کرنے والے تھے۔سوار لوگوں نے اپنے اپنے ہاتھ پر سجدہ کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مصعب بن ثابت ضعیف`;
abudawood.anwaar = [56,1];