var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْفُرَاتِ أَبُو مَسْعُودٍ الرَّازِيُّ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَيْنَا الْقُرْآنَ فَإِذَا مَرَّ بِالسَّجْدَةِ كَبَّرَ وَسَجَدَ وَسَجَدْنَا مَعَهُ قَالَ عَبْدُ الرَّزَّاقِ وَكَانَ الثَّوْرِيُّ يُعْجِبُهُ هَذَا الْحَدِيثُ قَالَ أَبُو دَاوُد يُعْجِبُهُ لِأَنَّهُ كَبَّرَ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ ہم پر قرآن پڑھا کرتے تھے۔جب سجدے کی آیت سے گزرتے تو «اللہ اکبر» کہتے اور سجدے میں چلے جاتے اور ہم بھی آپ کے ساتھ سجدہ کرتے۔جناب عبد الرزاق نے بیان کیا کہ امام ثوری کو یہ حدیث بہت پسند تھی۔امام ابوداؤد رحمہ اللہ نے بیان کیا کیونکہ اس میں تکبیر کا ذکر ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1032)
عبد اللہ العمري حسن الحدیث عن نافع، ضعیف الحدیث عن غیرہ`;