var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ عَنِ الْأَعْمَشِ،عَنْ عَمْرِو بْنِ مُرَّةَ،عَنْ أَبِي عُبَيْدَةَ،عَنْ عَبْدِ اللَّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. بِمَعْنَاهُ،زَادَ: فَقَالَ أَعْرَابِيٌّ: مَا تَقُولُ؟ فَقَالَ:(لَيْسَ لَكَ،وَلَا لِأَصْحَابِكَ).";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ نے نبی کریم ﷺ سے اس کے ہم معنی روایت کی ہے اور مزید یہ اضافہ کیا ہے کہ ایک دیہاتی بولا،آپ کیا کہتے ہیں؟ (سیدنا عبداللہ رضی اللہ عنہما نے) کہا: یہ حکم تمہیں اور تمہارے ساتھیوں کے لیے نہیں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1170)<br>أبو عبیدۃ عن أبیہ منقطع کما`;
abudawood.anwaar = [57,1];