var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا أَبُو إِسْحَقَ الطَّالْقَانِيُّ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الْعَتَكِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْوِتْرُ حَقٌّ فَمَنْ لَمْ يُوتِرْ فَلَيْسَ مِنَّا الْوِتْرُ حَقٌّ فَمَنْ لَمْ يُوتِرْ فَلَيْسَ مِنَّا الْوِتْرُ حَقٌّ فَمَنْ لَمْ يُوتِرْ فَلَيْسَ مِنَّا";
abudawood.urdu = "عبداللہ بن بریدہ اپنے والد سے روایت کرتے ہیں،ان کا بیان ہے کہ میں نے رسول اللہ ﷺ کو سنا،آپ ﷺ فرماتے تھے: ’’وتر حق ہے،جو وتر نہ پڑھے وہ ہم میں سے نہیں۔وتر حق ہے،جو وتر نہ پڑھے وہ ہم میں سے نہیں۔وتر حق ہے،جو وتر نہ پڑھے وہ ہم میں سے نہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>أبو المنیب حسن الحدیث في غیر ما أنکر علیہ<br>انظر تحفۃ الأقویاء في تحقیق کتاب الضعفاء للبخاري (215) وھذا الحدیث مما أنکر علیہ<br>انظر میزان الإعتدال (11/3)`;
abudawood.anwaar = [57,1];