var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ ابْنِ عُمَرَ أَنَّ رَجُلًا مِنْ أَهْلِ الْبَادِيَةِ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ بِأُصْبُعَيْهِ هَكَذَا مَثْنَى مَثْنَى وَالْوِتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ ایک دیہاتی آدمی نے نبی کریم ﷺ سے رات کی نماز کے بارے میں پوچھا تو آپ ﷺ نے اپنی انگلیوں سے اشارہ کرتے ہوئے فرمایا: ’’اس طرح دو دو رکعت۔اور وتر ایک رکعت ہے رات کے آخر میں۔‘‘";
abudawood.hukam = "صحیح مسلم (749)";
abudawood.description = ``;