var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ حَدَّثَنِي قُرَيْشُ بْنُ حَيَّانَ الْعِجْلِيُّ حَدَّثَنَا بَكْرُ بْنُ وَائِلٍ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوِتْرُ حَقٌّ عَلَى كُلِّ مُسْلِمٍ فَمَنْ أَحَبَّ أَنْ يُوتِرَ بِخَمْسٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِثَلَاثٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِوَاحِدَةٍ فَلْيَفْعَلْ";
abudawood.urdu = "سیدنا ابو ایوب انصاری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’وتر نماز ہر مسلمان پر حق ہے،چنانچہ جو پانچ پڑھنا چاہے،(پانچ) پڑھ لے۔اور جو تین پڑھنا چاہے،(تین) پڑھ لے۔اور جو ایک پڑھنا چاہے،وہ ایک پڑھ لے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1265)
أخرجہ النسائي (1712) والزھري صرح بالسماع عند ابن ماجہ (1190 وسندہ صحیح)`;