var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ،حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،حَدَّثَنَا خُصَيْفٌ،عَنْ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ،قَالَ: سَأَلْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ: بِأَيِّ شَيْءٍ كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟... فَذَكَرَ مَعْنَاهُ،قَالَ: وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ[أول سورة الإخلاص]،وَالْمُعَوِّذَتَيْنِ.";
abudawood.urdu = "عبدالعزیز بن جریج کہتے ہیں کہ میں نے ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے سوال کیا کہ رسول اللہ ﷺ وتروں میں کیا پڑھا کرتے تھے؟ تو مذکورہ بالا حدیث کے ہم معنی بیان کیا اور کہا: ’’تیسری رکعت میں «قل ہو اللہ أحد» اور ’’معوذتین‘‘ (سورۃ الفلق اور سورۃ الناس) پڑھا کرتے تھے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (463) ابن ماجہ (1173)<br>خصیف ضعیف،ضعفہ الجمہور،ولہ شاہد حسن لذاتہ عند ابن حبان (2423) دون قولہ: ’’والمعوذتین‘‘ انظر مشکوۃ المصابیح (1/ 420 ح 1269)`;
abudawood.anwaar = [57,1];