var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا أَبُو إِسْحَاقَ بِإِسْنَادِهِ وَمَعْنَاهُ،قَالَ فِي آخِرِهِ: قَالَ هَذَا: يَقُولُ فِي الْوِتْرِ فِي الْقُنُوتِ،وَلَمْ يَذْكُرْ: أَقُولُهُنَّ فِي الْوِتْرِ. أَبُو الْحَوْرَاءِ رَبِيعَةُ بْنُ شَيْبَانَ";
abudawood.urdu = "ابواسحاق نے اپنی سند سے مذکورہ حدیث کے ہم معنی بیان کیا۔اس روایت کے آخر میں ہے کہ اسے وتر کے قنوت میں کہے اور جملہ نہیں کہا کہ میں انہیں وتر میں کہوں۔ابو الحوراء کا نام ربیعہ بن شیبان ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1425)`;