var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ أَنَّ أُبَيَّ بْنَ كَعْبٍ أَمَّهُمْ يَعْنِي فِي رَمَضَانَ وَكَانَ يَقْنُتُ فِي النِّصْفِ الْآخِرِ مِنْ رَمَضَانَ";
abudawood.urdu = "محمد بن سیرین اپنے بعض اصحاب سے روایت کرتے ہیں کہ سیدنا ابی بن کعب رضی اللہ عنہ نے ان کی رمضان میں امامت کرائی اور وہ رمضان کے نصف آخر میں قنوت پڑھا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>’’ بعض أصحابہ ‘‘ مجہول`;
abudawood.anwaar = [57,1];