var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ كَثِيرٍ عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبْرَةَ عَنْ أَبِيهِ وَافِدِ بَنِي الْمُنْتَفِقِ أَنَّهُ أَتَى عَائِشَةَ فَذَكَرَ مَعْنَاهُ قَالَ فَلَمْ يَنْشَبْ أَنْ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَقَلَّعُ يَتَكَفَّأُ وَقَالَ عَصِيدَةٌ مَكَانَ خَزِيرَةٍ";
abudawood.urdu = "جناب عاصم بن لقیط بن صبرہ اپنے والد (لقیط بن صبرہ رضی اللہ عنہ) سے راوی ہیں،جو کہ وفد بنی منتفق کے سردار تھے کہ وہ سیدہ عائشہ رضی اللہ عنہا کے پاس آئے اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔اس روایت میں ہے۔ہم بیٹھے ہی تھے کہ اتنے میں رسول اللہ ﷺ زور سے قدم اٹھاتے ہوئے،آگے کو جھک کر چلتے ہوئے تشریف لائے۔اور اس روایت میں «خزیرۃ» کی بجائے «عصیدۃ» ذکر ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3260)
وانظر الحدیث السابق (142)`;