var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُبَيْدَةَ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ طَلْحَةَ الْأَيَامِيِّ عَنْ ذَرٍّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ فِي الْوِتْرِ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ";
abudawood.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ جب وتر سے سلام پھیرتے تو کہتے «سبحان الملک القدوس» ’’پاک ہے وہ ذات جو حاکم مطلق ہے اور ہر اعتبار سے پاک ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1274)
أخرجہ النسائي (1735 وسندہ صحیح)`;