var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ عَنْ أَبِي غَسَّانَ مُحَمَّدِ بْنِ مُطَرِّفٍ الْمَدَنِيِّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ وِتْرِهِ أَوْ نَسِيَهُ فَلْيُصَلِّهِ إِذَا ذَكَرَهُ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص اپنے وتر پڑھنے سے سو جائے (اور نہ پڑھ سکے) یا بھول جائے تو جب یاد آئے پڑھ لے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1279)
وللحدیث شواھد کثیرۃ عند البخاري (1178، 1981) ومسلم (721) وغیرھما`;