var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ قَتَادَةَ عَنْ أَبِي سَعِيدٍ مِنْ أَزْدِ شَنُوءَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ لَا أَدَعُهُنَّ فِي سَفَرٍ وَلَا حَضَرٍ رَكْعَتَيْ الضُّحَى وَصَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ الشَّهْرِ وَأَنْ لَا أَنَامَ إِلَّا عَلَى وِتْرٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ میرے خلیل ﷺ نے مجھے تین باتوں کی وصیت فرمائی،میں انہیں سفر و حضر میں نہیں چھوڑتا،چاشت کی دو رکعتیں،ہر مہینے میں تین روزے اور یہ کہ وتر پڑھے بغیر نہ سوؤں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن و أبو سعید الأزدي مجھول الحال<br>و أحادیث البخاري (1178،1981) و مسلم (721) تغني عنہ`;
abudawood.anwaar = [58,1];