var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا أَبُو الْيَمَانِ عَنْ صَفْوَانَ بْنِ عَمْرٍو عَنْ أَبِي إِدْرِيسَ السَّكُونِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِي الدَّرْدَاءِ قَالَ أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ لَا أَدَعُهُنَّ لِشَيْءٍ أَوْصَانِي بِصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَلَا أَنَامُ إِلَّا عَلَى وِتْرٍ وَبِسُبْحَةِ الضُّحَى فِي الْحَضَرِ وَالسَّفَرِ";
abudawood.urdu = "سیدنا ابوالدرداء بیان کرتے کہ میرے خلیل ﷺ نے مجھے تین باتوں کی وصیت فرمائی تھی،میں انہیں کسی صورت نہیں چھوڑتا۔مجھے وصیت فرمائی کہ ہر مہینے تین دن کے روزے رکھوں،وتر پڑھ کر سویا کروں اور ضحٰی کے نفل پڑھوں سفر اور حضر میں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>صفوان سمعہ من بعض المشیخۃ عن أبي إدریس کما في مسند أحمد (6/ 440) وحدیث مسلم (722) یغني عنہ`;
abudawood.anwaar = [58,1];