var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ قَالَ قُلْتُ لِعَائِشَةَ مَتَى كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كُلَّ ذَلِكَ قَدْ فَعَلَ أَوْتَرَ أَوَّلَ اللَّيْلِ وَوَسَطَهُ وَآخِرَهُ وَلَكِنْ انْتَهَى وِتْرُهُ حِينَ مَاتَ إِلَى السَّحَرِ";
abudawood.urdu = "مسروق بیان کرتے ہیں کہ میں نے سیدہ عائشہ رضی اللہ عنہا سے دریافت کیا کہ رسول ﷺ کس وقت وتر پڑھا کرتے تھے؟ انہوں نے کہا: آپ ﷺ نے سب ہی اوقات میں وتر پڑھے ہیں۔رات کے شروع میں،درمیان میں اور آخر میں بھی۔لیکن آخری زندگی میں آپ ﷺ کے وتر سحر کے وقت ہونے لگے تھے۔";
abudawood.hukam = "صحیح مسلم (745)";
abudawood.description = ``;