var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَادِرُوا الصُّبْحَ بِالْوِتْرِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’صبح ہونے سے پہلے پہلے وتر پڑھ لو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (467 وسندہ صحیح) ولہ طریق آخر عند مسلم (750)`;