var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ سُئِلَ هَلْ قَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ فَقَالَ نَعَمْ فَقِيلَ لَهُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَ الرُّكُوعِ قَالَ بَعْدَ الرُّكُوعِ قَالَ مُسَدَّدٌ بِيَسِيرٍ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے پوچھا گیا کیا نبی کریم ﷺ نے نماز فجر میں قنوت پڑھی تھی؟ انہوں نے کہا: ہاں۔پوچھا گیا: رکوع سے پہلے یا بعد؟ کہا: رکوع کے بعد۔مسدد کی روایت میں ہے کہ تھوڑی مدت تک۔";
abudawood.hukam = "صحیح بخاری (1001) صحیح مسلم (677)";
abudawood.description = ``;