var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ مُفَضَّلٍ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ حَدَّثَنِي مَنْ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْغَدَاةِ فَلَمَّا رَفَعَ رَأْسَهُ مِنْ الرَّكْعَةِ الثَّانِيَةِ قَامَ هُنَيَّةً";
abudawood.urdu = "جناب محمد بن سیرین کہتے ہیں مجھے اس شخص نے بیان کیا جس نے نبی کریم ﷺ کے ساتھ فجر کی نماز پڑھی تھی کہ جب آپ نے دوسری رکعت سے سر اٹھایا تو تھوڑی دیر کھڑے رہے (قنوت کے لیے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (1073)<br>یونس بن عبید مدلس (طبقات المدلسین : 2/64 وھو من المرتبۃ الثالثۃ وروایۃ یزید بن زریع عنہ محمولۃ علی السماع،انظر الفتح المبین ص 48) و عنعن`;
abudawood.anwaar = [58,1];