var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنَا نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلُوا فِي بُيُوتِكُمْ مِنْ صَلَاتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اپنی نمازوں کا کچھ حصہ گھروں میں بھی پڑھا کرو اور انہیں قبرستان مت بنا ڈالو۔‘‘";
abudawood.hukam = "صحیح بخاری (432) صحیح مسلم (77)";
abudawood.description = ``;