var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ الْأَعْمَشِ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ الْأَغَرِّ أَبِي مُسْلِمٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَأَبِي هُرَيْرَةَ قَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَيْقَظَ مِنْ اللَّيْلِ وَأَيْقَظَ امْرَأَتَهُ فَصَلَّيَا رَكْعَتَيْنِ جَمِيعًا كُتِبَا مِنْ الذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ";
abudawood.urdu = "سیدنا ابو سعید خدری اور سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص رات کو جاگے اور اپنی بیوی کو بھی جگائے،پھر وہ دونوں دو رکعتیں پڑھیں تو ان کا شمار ذاکرین و ذاکرات میں ہوتا ہے جو اللہ کو بہت زیادہ یاد کرنے والے ہوتے ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>انظر الحدیث السابق (1309)`;
abudawood.anwaar = [58,1];