var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ وَهَمَّامٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ مَاهِرٌ بِهِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَؤُهُ وَهُوَ يَشْتَدُّ عَلَيْهِ فَلَهُ أَجْرَانِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’جو شخص قرآن پڑھتا ہے اور وہ اس میں ماہر ہے،وہ اعمال نامہ لکھنے والے معزز اور اطاعت گزار فرشتوں کے ساتھ ہو گا۔اور جو شخص قرآن پڑھتا ہے،مگر اسے پڑھنے میں مشقت ہوتی ہے (اٹک اٹک کر پڑھتا ہے) تو اس کے لیے دو اجر ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (4937) صحیح مسلم (897)";
abudawood.description = ``;