var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ثَوْرٍ عَنْ رَاشِدِ بْنِ سَعْدٍ عَنْ ثَوْبَانَ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فَأَصَابَهُمْ الْبَرْدُ فَلَمَّا قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُمْ أَنْ يَمْسَحُوا عَلَى الْعَصَائِبِ وَالتَّسَاخِينِ";
abudawood.urdu = "سیدنا ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے ایک (جہادی) مہم بھیجی تو ان لوگوں کو سردی نے آ لیا۔جب یہ لوگ رسول اللہ ﷺ کے پاس آئے تو آپ ﷺ نے انہیں حکم دیا کہ وہ اپنی پگڑیوں اور موزوں پر مسح کر لیا کریں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وللحدیث علۃ غیر قادحہ، انظر نصب الرایہ (1/ 165)`;