var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ وَهُوَ عَلَى نَاقَةٍ يَقْرَأُ بِسُورَةِ الْفَتْحِ وَهُوَ يُرَجِّعُ";
abudawood.urdu = "سیدنا عبداللہ بن مغفل رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فتح مکہ کے دن دیکھا کہ آپ ﷺ اپنی اونٹنی پر سوار سورۃ الفتح پڑھ رہے تھے اور ترجیع سے پڑھ رہے تھے۔";
abudawood.hukam = "صحیح بخاری (7540) صحیح مسلم (794)";
abudawood.description = ``;