var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ طَلْحَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ";
abudawood.urdu = "سیدنا براء بن عازب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اپنی آوازوں سے قرآن کو زینت دو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2199)
أخرجہ النسائي (1016 وسندہ صحیح) ورواہ ابن ماجہ (1342 وسندہ صحیح) وصححہ ابن خزیمۃ (1551 وسندہ حسن)`;