var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ إِدْرِيسَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عِيسَى بْنِ فَائِدٍ عَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ امْرِئٍ يَقْرَأُ الْقُرْآنَ ثُمَّ يَنْسَاهُ إِلَّا لَقِيَ اللَّهَ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ أَجْذَمَ";
abudawood.urdu = "سیدنا سعد بن عبادہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص قرآن پڑھ کر بھلا دے،وہ قیامت کے روز اللہ سے اس حالت میں ملے گا کہ وہ جذام زدہ ہو گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یزید ضعیف وعیسی بن فائد مجہول وروایتہ عن الصحابۃ مرسلۃ (تق :5319) ولم یسمع من سعد بن عبادۃ رضي اللّٰہ عنہ بینھما رجل مجہول`;
abudawood.anwaar = [59,1];