var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ ذَرٍّ عَنْ يُسَيْعٍ الْحَضْرَمِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الدُّعَاءُ هُوَ الْعِبَادَةُ قَالَ رَبُّكُمْ ادْعُونِي أَسْتَجِبْ لَكُمْ";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’دعا عبادت ہی ہے۔تمہارے رب نے فرمایا ہے مجھے پکارو،میں قبول کروں گا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2230)
أخرجہ الترمذي (2969) وابن ماجہ (3828) ولہ شاھد حسن لذاتہ عند البیھقي في شعب الإیمان (1/372 ح 6996)`;