var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ عَمْرٍو عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ الْمُسْتَوْرِدِ بْنِ شَدَّادٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأَ يَدْلُكُ أَصَابِعَ رِجْلَيْهِ بِخِنْصَرِهِ";
abudawood.urdu = "سیدنا مستورد بن شداد رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ جب وضو کرتے تو اپنے پاؤں کی انگلیوں کو اپنی چھنگلی سے ملتے تھے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (407)
ورواہ اللیث بن سعد وغیرہ عن یزید بن عمرو بہ عند ابن ابی حاتم فی تقدمۃ الجرح والتعدیل، ص 31، 32 والبیہقی: 1/ 76، 77 وعندھما فائدۃ ھامۃ`;