var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ الْأَسْوَدِ بْنِ شَيْبَانَ عَنْ أَبِي نَوْفَلٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَحِبُّ الْجَوَامِعَ مِنْ الدُّعَاءِ وَيَدَعُ مَا سِوَى ذَلِكَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ ﷺ جامع دعائیں پسند فرمایا کرتے تھے اور اس کے علاوہ کو چھوڑ دیتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2246)`;