var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقُولَنَّ أَحَدُكُمْ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ اللَّهُمَّ ارْحَمْنِي إِنْ شِئْتَ لِيَعْزِمْ الْمَسْأَلَةَ فَإِنَّهُ لَا مُكْرِهَ لَهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’تم میں کوئی ایسے دعا مت کرے کہ یا اللہ! مجھے بخش دے اگر چاہے تو۔یا اللہ! مجھ پر رحم فرما اگر چاہے تو۔جو مانگنا ہے عزیمت اور پختگی سے مانگو۔اللہ کو کوئی مجبور نہیں کر سکتا۔‘‘";
abudawood.hukam = "صحیح بخاری (6339)";
abudawood.description = ``;