var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عُبَيْدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُسْتَجَابُ لِأَحَدِكُمْ مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے ایک کی دعا قبول ہوتی رہتی ہے جب تک کہ وہ جلدی نہ کرے۔یعنی یوں کہے کہ میں نے دعا مانگی تھی مگر قبول نہیں ہوئی۔‘‘";
abudawood.hukam = "صحیح بخاری (6340) صحیح مسلم (2735)";
abudawood.description = ``;