var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ عَنْ عُمَرَ بْنِ نَبْهَانَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو هَكَذَا بِبَاطِنِ كَفَّيْهِ وَظَاهِرِهِمَا";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا آپ اپنے ہاتھوں کی ہتھیلیوں کی جانب سے اور پشت کی جانب سے بھی دعا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عمر بن نبھان : ضعیف`;
abudawood.anwaar = [59,1];