var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ مَيْمُونٍ صَاحِبَ الْأَنْمَاطِ حَدَّثَنِي أَبُو عُثْمَانَ عَنْ سَلْمَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رَبَّكُمْ تَبَارَكَ وَتَعَالَى حَيِيٌّ كَرِيمٌ يَسْتَحْيِي مِنْ عَبْدِهِ إِذَا رَفَعَ يَدَيْهِ إِلَيْهِ أَنْ يَرُدَّهُمَا صِفْرًا";
abudawood.urdu = "سیدنا سلمان فارسی رضی اللہ عنہ سے روایت ہے انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’بلاشبہ تمہارا رب بہت حیا والا اور سخی ہے۔بندہ جب اس کی طرف اپنے ہاتھ اٹھاتا ہے تو اسے حیا آتی ہے کہ انہیں خالی لوٹا دے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `ولہ شاھد حسن عند امالی المحاملی (433 وسندہ حسن، /ندیم ظہیر)`;