var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ يَعْنِي ابْنَ خَالِدٍ،حَدَّثَنِي الْعَبَّاسُ بْنُ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،قَال:َ الْمَسْأَلَةُ أَنْ تَرْفَعَ يَدَيْكَ حَذْوَ مَنْكِبَيْكَ،أَوْ نَحْوَهُمَا،وَالِاسْتِغْفَارُ أَنْ تُشِيرَ بِأُصْبُعٍ وَاحِدَةٍ،وَالِابْتِهَالُ أَنْ تَمُدَّ يَدَيْكَ جَمِيعًا.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ سوال (یعنی دعا کا ادب) یہ ہے کہ تم اپنے ہاتھ اپنے کندھوں کے برابر یا اس کے قریب بلند کرو۔اور استغفار یہ ہے کہ اپنی ایک انگلی سے اشارہ کرو اور ابتہال (عجز و انکساری) یوں ہے کہ اپنے دونوں ہاتھوں کو لمبا کرو۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2256)
انظر الحدیث الآتي (1491)`;