var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ،حَدَّثَنَا سُفْيَانُ،حَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ... بِهَذَا الْحَدِيثِ،قَالَ فِيهِ: وَالِابْتِهَالُ هَكَذَا, وَرَفَعَ يَدَيْهِ وَجَعَلَ ظُهُورَهُمَا مِمَّا يَلِي وَجْهَهُ.";
abudawood.urdu = "عباس بن عبداللہ بن معبد بن عباس نے اس مذکورہ حدیث کو بیان کیا تو اس میں کہا کہ ابتہال (عجز و انکسار اور دعا میں مبالغہ) ایسے ہے اور (عملاً) اپنے دونوں ہاتھ اٹھائے اور ان کی پشت کو اپنے چہرے کی طرف کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2256)
انظر الحدیث الآتي (1491)`;