var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ،عَنْ أَخِيهِ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ... فَذَكَرَ نَحْوَهُ.";
abudawood.urdu = "عباس بن عبداللہ بن معبد بن عباس اپنے بھائی ابراہیم بن عبداللہ سے،وہ سیدنا ابن عباس رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا اور اسی کی مانند ذکر کیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;