var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ حَفْصِ بْنِ هَاشِمِ بْنِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَعَا فَرَفَعَ يَدَيْهِ مَسَحَ وَجْهَهُ بِيَدَيْهِ";
abudawood.urdu = "سائب بن یزید اپنے والد سے بیان کرتے ہیں کہ نبی کریم ﷺ جب دعا کرتے اور اپنے ہاتھ اٹھاتے تو اپنے چہرے پر پھیر لیا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حفص بن ہاشم مجہول`;
abudawood.anwaar = [59,2];