var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اسْمُ اللَّهِ الْأَعْظَمُ فِي هَاتَيْنِ الْآيَتَيْنِ وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لَا إِلَهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحِيمُ وَفَاتِحَةِ سُورَةِ آلِ عِمْرَانَ الم اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ";
abudawood.urdu = "شہر بن خوشب،سیدہ اسماء بنت یزید رضی اللہ عنہا سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’اللہ کا اسم اعظم ان دو آیتوں میں ہے «وإلہکم إلہ واحد لا إلہ إلا ہو الرحمن الرحیم» اور سورۃ آل عمران کی ابتدائی آیت میں «اللہ لا إلہ إلا ہو الحی القیوم»۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2291)
أخرجہ الترمذي (3478 وسندہ حسن)`;