var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَطَاءٍ عَنْ عَائِشَةَ قَالَتْ سُرِقَتْ مِلْحَفَةٌ لَهَا فَجَعَلَتْ تَدْعُو عَلَى مَنْ سَرَقَهَا فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُسَبِّخِي عَنْهُ قَالَ أَبُو دَاوُد لَا تُسَبِّخِي أَيْ لَا تُخَفِّفِي عَنْهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ ان کا ایک لحاف چوری ہو گیا تو وہ چور پر بد دعا کرنے لگیں۔نبی کریم ﷺ فرمانے لگے ’’اس کے گناہ کو ہلکا مت کر۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں «لا تسبخی» کے معنی «لا تخففی» ہیں،یعنی ’’ہلکا نہ کر،کم نہ کر۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>وانظر الحدیث الآتی (4909)<br>حبیب عنعن<br>وللحدیث شاھد ضعیف عند أحمد (215/6)`;
abudawood.anwaar = [60,1];