var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ هَانِئِ بْنِ عُثْمَانَ عَنْ حُمَيْضَةَ بِنْتِ يَاسِرٍ عَنْ يُسَيْرَةَ أَخْبَرَتْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُنَّ أَنْ يُرَاعِينَ بِالتَّكْبِيرِ وَالتَّقْدِيسِ وَالتَّهْلِيلِ وَأَنْ يَعْقِدْنَ بِالْأَنَامِلِ فَإِنَّهُنَّ مَسْئُولَاتٌ مُسْتَنْطَقَاتٌ";
abudawood.urdu = "سیدہ یسیرہ رضی اللہ عنہا نے خبر دی کہ نبی کریم ﷺ نے انہیں (صحابیات کو) حکم دیا تھا کہ وہ اللہ کی تکبیر «اللہ اکبر» تقدیس «سبحان الملک القدوس» اور تہلیل «لا إلہ إلا اللہ» کی پابندی اختیار کریں اور یہ کہ اپنی انگلیوں پر شمار کیا کریں کیونکہ ان سے سوال ہو گا اور یہ بلوائی جائیں گی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2316)
أخرجہ الترمذي (3583 وسندہ حسن)`;