var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ وَمُحَمَّدُ بْنُ قُدَامَةَ فِي آخَرِينَ قَالُوا حَدَّثَنَا عَثَّامٌ عَنْ الْأَعْمَشِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُ التَّسْبِيحَ قَالَ ابْنُ قُدَامَةَ بِيَمِينِهِ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ اپنے ہاتھ (کی انگلیوں) پر تسبیح شمار کرتے تھے۔(استاذ) ابن قدامہ نے وضاحت کی کہ اپنے دائیں ہاتھ سے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش عنعن في ھذا اللفظ وصح الحدیث بلفظ: ’’ رأیت النبي ﷺ یعقد التسبیح ‘‘ (ت 3411)<br>وصححہ الذھبي في تلخیص المستدرک (1/ 547)`;
abudawood.anwaar = [60,1];