var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ،حَدَّثَنَا عَبْدَةُ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِي الزُّبَيْرِ،قَالَ: كَانَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ يُهَلِّلُ فِي دُبُرِ كُلِّ صَلَاةٍ،فَذَكَرَ نَحْوَ هَذَا الدُّعَاءِ،زَادَ فِيهِ: وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ،لَا إِلَهَ إِلَّا اللَّهُ،لَا نَعْبُدُ إِلَّا إِيَّاهُ،لَهُ النِّعْمَةُ... وَسَاقَ بَقِيَّةَ الْحَدِيثِ.";
abudawood.urdu = "ابوالزبیر کہتے ہیں کہ سیدنا عبداللہ بن زبیر رضی اللہ عنہما ہر نماز کے بعد «لا إلہ إلا اللہ وحدہ *** » پڑھا کرتے تھے اور مذکورہ بالا حدیث کی مانند دعا ذکر کی اور یہ اضافہ کیا «ولا حول ولا قوۃ إلا باللہ لا إلہ إلا اللہ لا نعبد إلا إیاہ لہ النعمۃ *** » اور بقیہ حدیث بیان کی۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (963)
انظر الحدیث السابق (1506) وھذا طرفہ`;