var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،أَخْبَرَنَا عِيسَى عَنِ الْأَوْزَاعِيِّ،عَنْ أَبِي عَمَّارٍ،عَنْ أَبِي أَسْمَاءَ،عَنْ ثَوْبَانَ-مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنْصَرِفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثَ مَرَّاتٍ،ثُمَّ قَالَ: اللَّهُمَّ... فَذَكَرَ مَعْنَى حَدِيثِ عَائِشَةَ رَضِي اللَّهُ عَنْهَا.";
abudawood.urdu = "سیدنا ثوبان رضی اللہ عنہ (مولیٰ رسول اللہ ﷺ) سے منقول ہے کہ نبی کریم ﷺ جب نماز سے اٹھ کر جانا چاہتے تو تین بار استغفار «استغفر اللہ» کہتے تھے۔پھر اس کے بعد پڑھتے «اللہم أنت السلام *** » اور حدیث سیدہ عائشہ رضی اللہ عنہا کی حدیث کے ہم معنی بیان کی۔";
abudawood.hukam = "صحیح مسلم (591)";
abudawood.description = ``;