var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ حَدَّثَنَا عُثْمَانُ بْنُ وَاقِدٍ الْعُمَرِيُّ عَنْ أَبِي نُصَيْرَةَ عَنْ مَوْلًى لِأَبِي بَكْرٍ الصِّدِّيقِ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَصَرَّ مَنْ اسْتَغْفَرَ وَإِنْ عَادَ فِي الْيَوْمِ سَبْعِينَ مَرَّةٍ";
abudawood.urdu = "سیدنا ابوبکر صدیق رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو استغفار کو اختیار کر لے وہ ’’مصر‘‘ (اصرار کرنے والے) لوگوں میں نہیں،خواہ ایک دن میں ستر بار گناہ کا اعادہ کرے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2340)
وللحدیث شاھد حسن لذاتہ عند الطبراني فی الدعاء (1797) فیہ أبو شیبۃ سعید بن عبد الرحمن الأسدي حسن الحدیث`;