var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَبِي بُرْدَةَ عَنْ الْأَغَرِّ الْمُزَنِيِّ قَالَ مُسَدَّدٌ فِي حَدِيثِهِ وَكَانَتْ لَهُ صُحْبَةٌ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَيُغَانُ عَلَى قَلْبِي وَإِنِّي لَأَسْتَغْفِرُ اللَّهَ فِي كُلِّ يَوْمٍ مِائَةَ مَرَّةٍ";
abudawood.urdu = "سیدنا اغر مزنی رضی اللہ عنہ سے مروی ہے،مسدد کی روایت میں ہے کہ ان کو شرف صحبت حاصل تھا،کہ رسول اللہ ﷺ نے فرمایا ’’میرے دل پر بھی پردہ سا آ جاتا ہے اور میں اللہ سے ایک ایک دن میں سو سو بار استغفار کرتا ہوں۔‘‘";
abudawood.hukam = "صحیح مسلم (2702)";
abudawood.description = ``;