var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ مُحَمَّدِ بْنِ سُوقَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ إِنْ كُنَّا لَنَعُدُّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَجْلِسِ الْوَاحِدِ مِائَةَ مَرَّةٍ رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ بلاشبہ ہم شمار کرتے تھے کہ رسول اللہ ﷺ ایک ایک مجلس میں سو سو بار یہ کلمہ دہراتے تھے «رب اغفر لی وتب علی إنک أنت التواب الرحیم» ’’اے میرے رب! مجھے بخش دے اور (رحمت کے ساتھ) میری طرف رجوع فرما۔بلاشبہ تو بہت زیادہ رجوع فرمانے والا ہے اور رحم کرنے والا ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2352)
أخرجہ ابن ماجہ (3814 وسندہ صحیح)`;