var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْحَكَمُ بْنُ مُصْعَبٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ أَنَّهُ حَدَّثَهُ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ حَدَّثَهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَزِمَ الِاسْتِغْفَارَ جَعَلَ اللَّهُ لَهُ مِنْ كُلِّ ضِيقٍ مَخْرَجًا وَمِنْ كُلِّ هَمٍّ فَرَجًا وَرَزَقَهُ مِنْ حَيْثُ لَا يَحْتَسِبُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جس نے استغفار کا التزام کیا،اللہ تعالیٰ اس کے لیے ہر تنگی سے نکلنے کی راہ اور ہر غم سے راحت کا سامان پیدا فرما دے گا۔اور ایسے ایسے مقامات سے رزق مہیا فرمائے گا جس کا اسے وہم و گمان بھی نہ ہو گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3819)<br>الحکم بن مصعب مجہول (تقریب التہذیب: 1461)<br>وأخطأ الحاکم فصحح حدیثہ (4/ 262) فردہ الذھبي`;
abudawood.anwaar = [60,1];