var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ صَادِقًا بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ";
abudawood.urdu = "ابوامامہ بن سہل بن حنیف اپنے والد سے روایت کرتے ہیں وہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس شخص نے سچے دل سے شہادت کا سوال کیا اللہ تعالیٰ اس کو شہدا کی منازل تک پہنچا دے گا خواہ اپنے بستر ہی پر اسے موت آئے۔‘‘";
abudawood.hukam = "صحیح مسلم (1909)";
abudawood.description = ``;