var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ أَنَّ حُنَيْنَ بْنَ أَبِي حَكِيمٍ حَدَّثَهُ عَنْ عَلِيِّ بْنِ رَبَاحٍ اللَّخْمِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقْرَأَ بِالْمُعَوِّذَاتِ دُبُرَ كُلِّ صَلَاةٍ";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ سے منقول ہے انہوں نے کہا کہ رسول اللہ ﷺ نے مجھے حکم دیا تھا کہ ہر نماز کے بعد معوذات پڑھا کروں۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (969)
أخرجہ النسائي (1337 وسندہ حسن) والترمذي (2903 وسندہ حسن) وصححہ ابن خزیمۃ (755 وسندہ حسن) ابن وھب صرح بالسماع عند أحمد (4/201)`;