var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سُوَيْدٍ السَّدُوسِيُّ حَدَّثَنَا أَبُو دَاوُدَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعْجِبُهُ أَنْ يَدْعُوَ ثَلَاثًا وَيَسْتَغْفِرَ ثَلَاثًا";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کو یہ بات پسند تھی کہ دعا کے کلمات تین تین بار دہرائیں اور تین بار استغفار کریں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن`;
abudawood.anwaar = [60,2];