var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو صَالِحٍ مَحْبُوبُ بْنُ مُوسَى،أَخْبَرَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ،عَنْ عَاصِمٍ،عَنْ أَبِي عُثْمَانَ،عَنْ أَبِي مُوسَى... بِهَذَا الْحَدِيثِ،وَقَالَ فِيهِ: فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَا أَيُّهَا النَّاسُ! ارْبَعُوا عَلَى أَنْفُسِكُمْ.";
abudawood.urdu = "ابوعثمان نے سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے یہی حدیث روایت کی ہے اور اس میں کہا کہ نبی کریم ﷺ نے فرمایا ’’لوگو! اپنے آپ پر رحم کرو (چلاؤ نہیں)۔‘‘";
abudawood.hukam = "صحیح بخاری (6206) صحیح مسلم (2704)";
abudawood.description = ``;