var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ نُبَيْحٍ الْعَنَزِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ امْرَأَةً قَالَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلِّ عَلَيَّ وَعَلَى زَوْجِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى اللَّهُ عَلَيْكِ وَعَلَى زَوْجِكِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ ایک عورت نے نبی کریم ﷺ سے کہا میرے اور میرے شوہر کے لیے دعائے رحمت فرما دیجئیے تو نبی کریم ﷺ نے فرمایا ’’اللہ تجھ پر اور تیرے شوہر پر اپنی رحمتیں (اور برکتیں) نازل فرمائے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;