var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَسْرَعَ الدُّعَاءِ إِجَابَةً دَعْوَةُ غَائِبٍ لِغَائِبٍ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’بہت جلد قبول ہونے والی دعا یہ ہے کہ انسان کسی غیر موجود کے لیے غائبانہ دعا کرے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1980)<br>الإفریقي ضعیف`;
abudawood.anwaar = [61,1];