var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ يَحْيَى عَنْ أَبِي جَعْفَرٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثُ دَعَوَاتٍ مُسْتَجَابَاتٌ لَا شَكَّ فِيهِنَّ دَعْوَةُ الْوَالِدِ وَدَعْوَةُ الْمُسَافِرِ وَدَعْوَةُ الْمَظْلُومِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ نبی کریم ﷺ نے فرمایا ’’تین دعاؤں کے قبول ہونے میں شک نہیں۔باپ کی دعا،مسافر کی دعا اور مظلوم کی دعا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2250)
یحیی بن أبي کثیر صرح بالسماع عند أحمد (2/348 ح 8564) وأبو جعفر المؤذن حسن الحدیث حسن لہ الترمذي وابن حجر العسقلاني`;