var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ بْنِ عَبْدِ اللَّهِ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَافَ قَوْمًا قَالَ اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ نبی کریم ﷺ کو جب کسی قوم سے کوئی اندیشہ ہوتا تو اس طرح دعا کرتے «اللہم إنا نجعلک فی نحورہم،ونعوذ بک من شرورہم» ’’اے اللہ! ہم تجھے ان کے مقابلے میں پیش کرتے ہیں اور ان کی شرارتوں سے تیری پناہ میں آتے ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن ولم یسمع من أ بي بردۃ<br>انظر جامع التحصیل (ص 255)`;
abudawood.anwaar = [61,1];