var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ خَمْسٍ مِنْ الْجُبْنِ وَالْبُخْلِ وَسُوءِ الْعُمُرِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ الْقَبْرِ";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ نے کہا کہ نبی کریم ﷺ پانچ باتوں سے اللہ کی پناہ مانگا کرتے تھے بزدلی،بخیلی،انتہائی بڑھاپے اور لاچاری کی عمر سے،سینے کے فتنے سے (حسد،کینہ اور برے اخلاق و عقائد سے) اور عذاب قبر سے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3844)<br>أبو إسحاق عنعن وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [61,1];