var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ وَمِنْ شَرِّ الْغِنَى وَالْفَقْرِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ ﷺ ان کلمات سے دعا فرمایا کرتے تھے «اللہم إنی أعوذ بک من فتنۃ النار،وعذاب النار،ومن شر الغنی،والفقر» ’’اے اللہ! میں تیری پناہ چاہتا ہوں آگ کے فتنے سے اور آگ کے عذاب سے،مالداری کے شر سے اور فقیری کے شر سے۔‘‘";
abudawood.hukam = "صحیح بخاری (6368) صحیح مسلم (589 بعد ح 2705)";
abudawood.description = ``;