var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ یہ دعا فرمایا کرتے تھے «اللہم إنی أعوذ بک من الفقر،والقلۃ،والذلۃ،وأعوذ بک من أن أظلم أو أظلم» ’’اے اللہ! میں تیری پناہ چاہتا ہوں محتاجی سے،قلت سے اور ذلت سے،اور تیری پناہ چاہتا ہوں اس بات سے کہ میں ظلم کا ارتکاب کروں یا مجھ پر ظلم کیا جائے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2467)
أخرجہ النسائي (5462 وسندہ صحیح)`;