var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا ضُبَارَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي السُّلَيْكِ عَنْ دُوَيْدِ بْنِ نَافِعٍ حَدَّثَنَا أَبُو صَالِحٍ السَّمَّانُ قَالَ قَالَ أَبُو هُرَيْرَةَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الشِّقَاقِ وَالنِّفَاقِ وَسُوءِ الْأَخْلَاقِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ انہوں نے کہا،رسول اللہ ﷺ یہ دعا فرمایا کرتے تھے «اللہم إنی أعوذ بک من الشقاق،والنفاق،وسوء الأخلاق» ’’اے اللہ! میں تیری پناہ چاہتا ہوں اس بات سے کہ (حق کی) مخالفت کروں یا منافق اور بداخلاق بنوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (5473)<br>ضبارۃ مجہول`;
abudawood.anwaar = [61,1];