var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ عَنْ ابْنِ إِدْرِيسَ عَنْ ابْنِ عَجْلَانَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْجُوعِ فَإِنَّهُ بِئْسَ الضَّجِيعُ وَأَعُوذُ بِكَ مِنْ الْخِيَانَةِ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ یہ دعا فرمایا کرتے تھے «اللہم إنی أعوذ بک من الجوع فإنہ بئس الضجیع،وأعوذ بک من الخیانۃ فإنہا بئست البطانۃ» ’’اے اللہ! میں تیری پناہ چاہتا ہوں بھوک سے،بیشک یہ بہت بری ہم خواب ہے۔اور میں تیری پناہ چاہتا ہوں خیانت سے،بیشک پوشیدہ خصلتوں میں سے یہ بہت بری خصلت ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (5470)<br>محمد بن عجلان مدلس وعنعن`;
abudawood.anwaar = [61,1];