var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ،حَدَّثَنَا الْمُعْتَمِرُ،قَالَ: قَالَ أَبُو الْمُعْتَمِرِ: أُرَى أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَنَا،أَنَّ رَسُولَ صَلَّى عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ صَلَاةٍ لَا تَنْفَعُ»،وَذَكَرَ دُعَاءً آخَرَ";
abudawood.urdu = "حضرت انس بن مالک رضی اللہ عنہ نے بیان کیاکہ بنیﷺ یہ دعا کیاکرتے تھے.ّ(اللّھم!انّی اعوذبک من صلاۃِِالّا تنفع)اے اللہ!میں تیری پناہ چاہتا ہوںایسی نمازسےجوفائدہ نہ دے-‘‘اور ایک دوسری دعا بھی ذکر کی-";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الراوي شک في سندہ فالسند معلل`;
abudawood.anwaar = [61,1];