var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ وَمِنْ سَيِّئْ الْأَسْقَامِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ یہ دعا فرمایا کرتے تھے «اللہم إنی أعوذ بک من البرص،والجنون،والجذام،ومن سیئ الأسقام» ’’اے اللہ! میں تیری پناہ چاہتا ہوں برص (پھلبہری) سے،پاگل پن سے،کوڑھ سے اور بری بیماریوں سے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (5495)<br>قتادۃ عنعن`;
abudawood.anwaar = [61,1];