var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ وَسُلَيْمَانُ بْنُ دَاوُدَ قَالَا،أَخْبَرَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ عَنِ الزُّهْرِيِّ هَذَا الْحَدِيثَ،قَالَ: قَالَ أَبُو بَكْرٍ: إِنَّ حَقَّهُ أَدَاءُ الزَّكَاةِ،وَقَالَ: عِقَالًا.";
abudawood.urdu = "یونس نے زہری سے یہ حدیث روایت کرتے ہوئے کہا کہ سیدنا ابوبکر رضی اللہ عنہ نے فرمایا مال کا حق ہے کہ زکوٰۃ ادا کی جائے۔اور اس روایت میں لفظ «عقالا» ’’رسی‘‘ بیان کیا۔";
abudawood.hukam = "صحیح بخاری (7284، 7285) صحیح مسلم (20)";
abudawood.description = ``;