var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’پانچ اونٹوں سے کم میں زکوٰۃ نہیں۔اور پانچ اوقیہ (چاندی) سے کم میں زکوٰۃ نہیں۔اور پانچ وسق سے کم (غلے) میں زکوٰۃ نہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (1447) صحیح مسلم (979)";
abudawood.description = ``;