var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا إِدْرِيسُ بْنُ يَزِيدَ الْأَوْدِيُّ،عَنْ عَمْرِو بْنِ مُرَّةَ الْجَمَلِيِّ،عَنْ أَبِي الْبَخْتَرِيِّ الطَّائِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،يَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ زَكَاةٌ،وَالْوَسْقُ سِتُّونَ مَخْتُومًا.قَالَ أَبو دَاود: أَبُو الْبَخْتَرِيُّ لَمْ يَسْمَعْ مِنْ أَبِي سَعِيدٍ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ نبی کریم ﷺ کی طرف نسبت کرتے ہوئے بیان کرتے ہیں ’’پانچ وسق سے کم (غلے) میں زکوٰۃ نہیں۔‘‘ اور ایک ’’وسق‘‘ ساٹھ معیاری ’’صاع‘‘ کا ہوتا ہے۔¤ امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ ابوالبختری نے سیدنا ابو سعید خدری رضی اللہ عنہ سے براہ راست نہیں سنا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1832)<br>بیّن المؤلف علتھا وھي الإنقطاع،والشطر الأول صحیح دون قولہ ’’والوسق ستون مختومًا ‘‘`;
abudawood.anwaar = [62,1];