var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا ابْنُ حَيٍّ هُوَ الْحَسَنُ بْنُ صَالِحٍ عَنْ بُكَيْرِ بْنِ عَامِرٍ الْبَجَلِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ عَلَى الْخُفَّيْنِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنَسِيتَ قَالَ بَلْ أَنْتَ نَسِيتَ بِهَذَا أَمَرَنِي رَبِّي عَزَّ وَجَلَّ";
abudawood.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے (جب اپنے) موزوں پر مسح کیا تو میں نے عرض کیا: اے اللہ کے رسول! آپ بھول رہے ہیں؟ فرمایا ’’(نہیں) بلکہ تم بھول رہے ہو۔مجھے میرے رب نے اسی بات کا حکم دیا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>بکیر بن عامر: ضعیف،وقال الھیثمي: وضعفہ جمہور الأئمۃ (مجمع الزوائد: 4/ 111)<br>وانظر : ح 3402`;
abudawood.anwaar = [18,1];