var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى أَبُو دَاوُدَ حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ بْنِ جُنْدُبٍ حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ سُلَيْمَانَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ أَمَّا بَعْدُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا أَنْ نُخْرِجَ الصَّدَقَةَ مِنْ الَّذِي نُعِدُّ لِلْبَيْعِ";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ نے فرمایا ’’امابعد! بلاشبہ رسول اللہ ﷺ ہمیں حکم دیا کرتے تھے کہ جو مال ہم تجارت کے لیے تیار کریں اس سے صدقہ (زکوٰۃ) دیا کریں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خبیب : مجہول<br>وجعفر : ضعیف<br>انظر الحدیث المتقدم (975)`;
abudawood.anwaar = [62,1];