var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَتَّابٌ يَعْنِي ابْنَ بَشِيرٍ عَنْ ثَابِتِ بْنِ عَجْلَانَ عَنْ عَطَاءٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ كُنْتُ أَلْبَسُ أَوْضَاحًا مِنْ ذَهَبٍ فَقُلْتُ يَا رَسُولَ اللَّهِ أَكَنْزٌ هُوَ فَقَالَ مَا بَلَغَ أَنْ تُؤَدَّى زَكَاتُهُ فَزُكِّيَ فَلَيْسَ بِكَنْزٍ";
abudawood.urdu = "سیدہ ام سلمہ رضی اللہ عنہا بیان کرتی ہیں کہ میں سونے کے ہار پہنا کرتی تھی۔میں نے رسول اللہ ﷺ سے دریافت کیا،اے اللہ کے رسول! کیا یہ کنز ہیں؟ آپ ﷺ نے فرمایا ’’جو زکوٰۃ کی مقدار کو پہنچ جائے اور اس کی زکوٰۃ ادا کر دی جائے تو وہ کنز نہیں ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عطاء بن أبي رباح لم یسمع من أم سلمۃ رضي اللّٰہ عنھا کما قال علي بن المدیني:(المراسیل لابن أبي حاتم ص155)<br>وللمرفوع شواہد`;
abudawood.anwaar = [62,2];