var abudawood = {};
abudawood.arabic = "حَدَّثَنَا صَفْوَانُ بْنُ صَالِحٍ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،حَدَّثَنَا سُفْيَانُ،عَنْ عُمَرَ بْنِ يَعْلَى فَذَكَرَ الْحَدِيثَ،نَحْوَ حَدِيثِ الْخَاتَمِ. قِيلَ لِسُفْيَانَ-كَيْفَ تُزَكِّيهِ؟ قَالَ: تَضُمُّهُ إِلَى غَيْرِهِ.";
abudawood.urdu = "سفیان نے عمر بن یعلیٰ سے روایت کی اور انگوٹھی والی حدیث کی مانند ذکر کیا،سفیان سے پوچھا گیا کہ اس کی زکوٰۃ کیسے دے؟ (یعنی انگوٹھی وغیرہ کی) تو انہوں نے فرمایا دوسرے زیورات کے ساتھ ملا لے (اور نصاب کے مطابق زکوٰۃ دے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عمر بن عبد اللّٰہ بن یعلی ضعیف (تق : 4933)`;
abudawood.anwaar = [63,1];