var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْوَاسِطِيُّ،أَخْبَرَنَا سُفْيَانُ بْنُ حُسَيْنٍ بِإِسْنَادِهِ وَمَعْنَاهُ،قَالَ: فَإِنْ لَمْ تَكُنِ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ. وَلَمْ يَذْكُرْ كَلَامَ الزُّهْرِيِّ.";
abudawood.urdu = "سفیان بن حسین نے اپنی (مذکورہ بالا) سند سے اور اسی کے ہم معنی بیان کیا،اور کہا ’’اگر بنت مخاض (ایک سالہ اونٹنی) نہ ہو تو ابن لبون (دو سالہ نر) پیش کر دے۔‘‘ اور زہری کا کلام ذکر نہیں کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث الآتي (1570 وسندہ صحیح)`;