var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ،عَنْ مُعَاذٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،لَمَّا وَجَّهَهُ إِلَى الْيَمَنِ،أَمَرَهُ أَنْ يَأْخُذَ مِنَ الْبَقَرِ مِنْ كُلِّ ثَلَاثِينَ تَبِيعًا،-أَوْ تَبِيعَةً-،وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً،وَمِنْ كُلِّ حَالِمٍ-يَعْنِي: مُحْتَلِمًا-دِينَارًا،أَوْ عَدْلَهُ مِنَ الْمَعَافِرِ-ثِيَابٌ تَكُونُ بِالْيَمَنِ.";
abudawood.urdu = "سیدنا معاذ رضی اللہ عنہ سے منقول ہے کہ نبی کریم ﷺ نے جب ان کو یمن کی طرف بھیجا تو فرمایا تھا ’’گائیوں میں ہر تیس میں ایک سالہ بچھڑا یا بچھڑی لینا اور ہر چالیس میں سے دو سالہ۔اور ہر (غیر مسلم) بالغ سے ایک دینار یا اس کے برابر معافری کپڑا جو کہ یمن میں ہوتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (2455) الحدیث الآتي (3038)<br>الأعمش مدلس وعنعن`;
abudawood.anwaar = [63,1];