var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَالنُّفَيْلِيُّ وَابْنُ الْمُثَنَّى قَالُوا،حَدَّثَنَا أَبُو مُعَاوِيَةَ،حَدَّثَنَا الْأَعْمَشُ،عَنْ إِبْرَاهِيمَ،عَنْ مَسْرُوقٍ،عَنْ مُعَاذٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ.";
abudawood.urdu = "جناب مسروق نے سیدنا معاذ رضی اللہ عنہ سے انہوں نے نبی کریم ﷺ سے اسی کے مثل بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (623) نسائی (2454) ابن ماجہ (1803)<br>الأعمش مدلس وعنعن<br>ومسروق تکلموا في سماعہ عن معاذ رضي اللّٰہ عنہ`;
abudawood.anwaar = [63,1];