var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعْدِ بْنِ سِنَانٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُعْتَدِي الْمُتَعَدِّي فِي الصَّدَقَةِ كَمَانِعِهَا";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے فرمایا ’’زکوٰۃ وصول کرنے میں زیادتی کرنے والا،اسی طرح ہے جیسے کہ زکوٰۃ نہ دینے والا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (646) ابن ماجہ (1808)<br>سعد بن سنان صدوق لکن : روایۃ یزید بن أبي حبیب عن سعد بن سنان منکرۃ کما فی الضعفاء الکبیر للعقیلي (119/2) عن أحمد بن حنبل و سندہ حسن و ھذہ منھا وللحدیث شاھد ضعیف عند الطبراني فی الکبیر (306/2)`;
abudawood.anwaar = [64,1];