var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَيَحْيَى بْنُ مُوسَى،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ،عَنْ أَيُّوبَ بِإِسْنَادِهِ وَمَعْنَاهُ،إِلَّا أَنَّهُ قَالَ: قُلْنَا: يَا رَسُولَ اللَّهِ! إِنَّ أَصْحَابَ الصَّدَقَةِ يَعْتَدُونَ قَالَ أَبو دَاود: رَفَعَهُ عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ.";
abudawood.urdu = "ایوب نے اپنی سند سے مذکورہ بالا حدیث کے ہم معنی روایت کیا۔البتہ انہوں نے کہا کہ ہم نے کہا: اے اللہ کے رسول! زکوٰۃ وصول کرنے والے کارندے زیادتی کرتے ہیں۔امام ابوداؤد رحمہ اللہ کہتے ہیں اسے عبدالرزاق نے معمر سے مرفوع روایت کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1586)`;
abudawood.anwaar = [64,1];