var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا جَلَبَ وَلَا جَنَبَ وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْ";
abudawood.urdu = "سیدنا عمرو بن شعیب اپنے والد سے،وہ اپنے دادا (عبداللہ بن عمرو رضی اللہ عنہما) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’نہ «جلب» ہے اور نہ «جنب» اور ان کے مالوں کی زکوٰۃ ان کے گھروں ہی پر وصول کی جائے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1786)
محمد بن إسحاق صرح بالسماع عند أحمد (2/180، 216) وتابعہ عبد الرحمن بن حارث عند أحمد (2/215)`;