var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ حَمَلَ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَوَجَدَهُ يُبَاعُ فَأَرَادَ أَنْ يَبْتَاعَهُ فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ لَا تَبْتَعْهُ وَلَا تَعُدْ فِي صَدَقَتِكَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ سیدنا عمر بن خطاب رضی اللہ عنہ نے اللہ کی راہ میں ایک گھوڑا دیا،پھر دیکھا کہ اسے بیچا جا رہا ہے تو انہوں نے اسے خرید لینا چاہا اور رسول اللہ ﷺ سے اس بارے میں دریافت کیا تو آپ ﷺ نے فرمایا ’’اسے مت خریدو اور اپنا صدقہ مت واپس لو۔‘‘";
abudawood.hukam = "صحیح بخاری (2636) صحیح مسلم (1620)";
abudawood.description = ``;