var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ يَحْيَى بْنِ فَيَّاضٍ قَالَا حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ رَجُلٍ عَنْ مَكْحُولٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِي الْخَيْلِ وَالرَّقِيقِ زَكَاةٌ إِلَّا زَكَاةُ الْفِطْرِ فِي الرَّقِيقِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’گھوڑے اور غلام میں زکوٰۃ نہیں،البتہ غلام کی طرف سے صدقہ فطر دیا جائے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شاھد قوي عند الدارقطني (2/127) ولہ طرق أخریٰ عند مسلم (982)`;