var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’مسلمان پر اس کے غلام اور گھوڑے میں زکوٰۃ نہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (1463) صحیح مسلم (982)";
abudawood.description = ``;