var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا سَقَتْ الْأَنْهَارُ وَالْعُيُونُ الْعُشْرُ وَمَا سُقِيَ بِالسَّوَانِي فَفِيهِ نِصْفُ الْعُشْرِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو زمین دریاؤں سے سیراب ہوتی ہو یا چشموں سے تو ان میں دسواں حصہ ہے۔اور جن کو اونٹنیوں سے (رہٹ کے ذریعے سے) سیراب کیا جاتا ہو تو ان میں بیسواں حصہ ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (981)";
abudawood.description = ``;