var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ وَحُسَيْنُ بْنُ الْأَسْوَدِ الْعَجَلِيُّ قَالَا قَالَ وَكِيعٌ الْبَعْلُ الْكَبُوسُ الَّذِي يَنْبُتُ مِنْ مَاءِ السَّمَاءِ قَالَ ابْنُ الْأَسْوَدِ وَقَالَ يَحْيَى يَعْنِي ابْنَ آدَمَ سَأَلْتُ أَبَا إِيَاسٍ الْأَسَدِيَّ عَنْ الْبَعْلِ فَقَالَ الَّذِي يُسْقَى بِمَاءِ السَّمَاءِ و قَالَ النَّضْرُ بْنُ شُمَيْلٍ الْبَعْلُ مَاءُ الْمَطَرِ";
abudawood.urdu = "جناب وکیع نے بیان کیا کہ <عربی> «البعل الکبوس» </عربی> سے مراد وہ کھیتی ہے جو بارش سے سیراب ہوتی ہو۔ابن اسود کہتے ہیں کہ یحییٰ بن آدم نے کہا کہ میں نے ابو ایاس اسدی سے «بعل» کے متعلق وضاحت پوچھی تو کہا،جو کھیتی بارش سے سیراب ہوتی ہو۔نضر بن شمیل نے کہا «بعل» سے مراد بارش کا پانی ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;