var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ أَنَّ بَطْنًا مِنْ فَهْمٍ... بِمَعْنَى الْمُغِيرَةِ،قَالَ: مِنْ عَشْرِ قِرَبٍ قِرْبَةٌ،وَقَالَ: وَادِيَيْنِ لَهُمْ.";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے وہ اپنے دادا سے روایت کرتے ہیں کہ قبیلہ فہم کا ایک گروہ،اس کے بعد حدیث مغیرہ کی مانند بیان کیا کہا: دس مشکوں میں سے ایک مشک (دیتے تھے) اور دونوں وادیاں انہی کے لیے مخصوص رہیں۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `صححہ ابن خزیمۃ (2325 وسندہ حسن) ورواہ ابن ماجہ (1824 وسندہ حسن)`;