var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ السَّرِيِّ النَّاقِطُ،حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ ابْنِ الْمُسَيِّبِ،عَنْ عَتَّابِ بْنِ أَسِيدٍ،قَالَ: أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُخْرَصَ الْعِنَبُ،كَمَا يُخْرَصُ النَّخْلُ،وَتُؤْخَذُ زَكَاتُهُ زَبِيبًا،كَمَا تُؤْخَذُ زَكَاةُ النَّخْلِ تَمْرًا.";
abudawood.urdu = "جناب زہری نے سعید بن مسیب سے،انہوں نے سیدنا عتاب بن اسید رضی اللہ عنہ سے روایت کی کہ رسول اللہ ﷺ نے حکم دیا ’’انگوروں کے کچے پھل کا اندازہ لگایا جائے جیسے کہ کھجوروں کا لگایا جاتا ہے۔اور ان کی زکوٰۃ کشمش کی صورت میں وصول کی جائے،جیسے کہ کھجوروں میں خشک کھجور کی صورت میں لی جاتی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (644) نسائی (2619) ابن ماجہ (1819)<br>قال المنذري :’’ انقطاعہ ظاہر،لأن مولد سعید في خلافۃ عمر ومات عتاب یوم مات أبوبکر‘‘ (انظر عون المعبود 24/2)`;
abudawood.anwaar = [64,2];