var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ،عَنْ مُحَمَّدِ بْنِ صَالِحٍ التَّمَّارِ،عَنِ ابْنِ شِهَابٍ بِإِسْنَادِهِ وَمَعْنَاهُ.قَالَ أَبو دَاود: سَعِيدٌ لَمْ يَسْمَعْ مِنْ عَتَّابٍ شَيْئًا.";
abudawood.urdu = "محمد بن صالح التمار نے ابن شہاب سے ان کی سند سے مذکورہ بالا حدیث کے ہم معنی بیان کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ سعید (ابن مسیب) نے سیدنا عتاب سے کچھ نہیں سنا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `[1603] إسنادہ ضعیف<br>ترمذی (644) نسائی (2619) ابن ماجہ (1819)<br>قال المنذري :’’ انقطاعہ ظاہر،لأن مولد سعید في خلافۃ عمر ومات عتاب یوم مات أبوبکر‘‘ (انظر عون المعبود 24/2)`;
abudawood.anwaar = [64,2];