var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أُخْبِرْتُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةِ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْ وَهِيَ تَذْكُرُ شَأْنَ خَيْبَرَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْعَثُ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ إِلَى يَهُودَ فَيَخْرُصُ النَّخْلَ حِينَ يَطِيبُ قَبْلَ أَنْ يُؤْكَلَ مِنْهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے خیبر کے سلسلے میں ذکر کیا کہ نبی کریم ﷺ،سیدنا عبداللہ بن رواحہ رضی اللہ عنہ کو یہودیوں کی طرف بھیجا کرتے تھے اور وہ کھجوروں کے پھلوں کا اندازہ لگایا کرتے تھے جبکہ وہ خوب تیار ہو جاتے،کھانے کے قابل ہونے سے پہلے پہلے یہ کام کیا جاتا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>والحدیث الآتي (3413)<br>مخبر ابن جریج مجھول وللحدیث شواھد مرسلۃ عند مالک فی الموطأ (2/ 703) وغیرہ والحدیث الآتي (الأصل : 3415) یغني عنہ`;
abudawood.anwaar = [65,1];