var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ قَالَ ذَكَرَهُ أَبِي عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمْسَحُ عَلَى الْخُفَّيْنِ و قَالَ غَيْرُ مُحَمَّدٍ عَلَى ظَهْرِ الْخُفَّيْنِ";
abudawood.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ موزوں پر مسح کیا کرتے تھے۔محمد بن صباح کے علاوہ (دوسرے مشائخ) نے کہا کہ آپ نے موزوں کی پشت (یعنی پاؤں کی اوپر والی جانب) پر مسح کیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (522)
قال الذہبی فی عبدالرحمٰن بن ابی الزناد: ’’حدیثہ من قبیل الحسن‘‘ (سیر اعلام النبلاء: 8/ 168، 169)`;