var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِزَكَاةِ الْفِطْرِ أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلَاةِ قَالَ فَكَانَ ابْنُ عُمَرَ يُؤَدِّيهَا قَبْلَ ذَلِكَ بِالْيَوْمِ وَالْيَوْمَيْنِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے ہمیں صدقہ فطر کے متعلق حکم فرمایا تھا کہ اسے لوگوں کے نماز عید کی طرف جانے سے پہلے پہلے ادا کر دیا جائے۔(نافع نے) کہا: سیدنا ابن عمر رضی اللہ عنہما اسے عید سے ایک دو دن پہلے ہی ادا کر دیا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (1509) صحیح مسلم (986)";
abudawood.description = ``;