var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا مَالِكٌ وَقَرَأَهُ عَلَيَّ مَالِكٌ أَيْضًا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَضَ زَكَاةَ الْفِطْرِ قَالَ فِيهِ فِيمَا قَرَأَهُ عَلَيَّ مَالِكٌ زَكَاةُ الْفِطْرِ مِنْ رَمَضَانَ صَاعٌ مِنْ تَمْرٍ أَوْ صَاعٌ مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنْ الْمُسْلِمِينَ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے رمضان میں صدقہ فطر فرض فرمایا،اس طرح کہ ہر مسلمان آزاد،غلام،مرد اور عورت کی طرف سے کھجور یا ’’جَو‘‘ کا ایک صاع دیا جائے۔";
abudawood.hukam = "صحیح بخاری (1504) صحیح مسلم (984)";
abudawood.description = ``;