var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَسُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ قَالَ قَالَ عَبْدُ اللَّهِ فَعَدَلَ النَّاسُ بَعْدُ نِصْفَ صَاعٍ مِنْ بُرٍّ قَالَ وَكَانَ عَبْدُ اللَّهِ يُعْطِي التَّمْرَ فَأُعْوِزَ أَهْلُ الْمَدِينَةِ التَّمْرَ عَامًا فَأَعْطَى الشَّعِيرَ";
abudawood.urdu = "جناب نافع نے کہا کہ سیدنا عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ پھر لوگ گندم کا آدھا صاع دینے لگے۔انہوں نے کہا کہ سیدنا عبداللہ رضی اللہ عنہما کھجور دیا کرتے تھے مگر ایک سال اہل مدینہ کو کھجور کی تنگی آ گئی،تو انہوں نے ’’جَو‘‘ دیے۔";
abudawood.hukam = "صحیح بخاری (1511) صحیح مسلم (984)";
abudawood.description = ``;