var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ أَخْبَرَنَا إِسْمَعِيلُ لَيْسَ فِيهِ ذِكْرُ الْحِنْطَةِ قَالَ أَبُو دَاوُد وَقَدْ ذَكَرَ مُعَاوِيَةُ بْنُ هِشَامٍ فِي هَذَا الْحَدِيثِ عَنْ الثَّوْرِيِّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضٍ عَنْ أَبِي سَعِيدٍ نِصْفَ صَاعٍ مِنْ بُرٍّ وَهُوَ وَهْمٌ مِنْ مُعَاوِيَةَ بْنِ هِشَامٍ أَوْ مِمَّنْ رَوَاهُ عَنْهُ";
abudawood.urdu = "مسدد بواسطہ اسمٰعیل کی روایت میں ’’گندم‘‘ کا ذکر نہیں ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ معاویہ بن ہشام نے ثوری سے مروی اس حدیث میں ابوسعید سے ’’گندم کا آدھا صاع‘‘ ذکر کیا ہے مگر یہ معاویہ بن ہشام کا یا ان سے روایت کرنے والوں میں سے کسی کا وہم ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الثوري مدلس و عنعن<br>والحدیث السابق (الأصل : 1616) یغني عنہ`;
abudawood.anwaar = [65,1];