var abudawood = {};
abudawood.arabic = "ِ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ وَقَالَ ابْنُ شِهَابٍ قَالَ عَبْدُ اللَّهِ بْنُ ثَعْلَبَةَ قَالَ ابْنُ صَالِحٍ قَالَ الْعَدَوِيُّ وَإِنَّمَا هُوَ الْعُذْرِيُّ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّاسَ قَبْلَ الْفِطْرِ بِيَوْمَيْنِ بِمَعْنَى حَدِيثِ الْمُقْرِئِ";
abudawood.urdu = "ابن جریج کا بیان ہے کہ ابن شہاب نے (راوی کا نام) ’’عبداللہ بن ثعلبہ‘‘ ہی روایت کیا ہے۔اور احمد بن صالح نے اس کو العدوی کہا۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ وہ درحقیقت العذری ہے۔(روایت یہ ہے کہ) رسول اللہ ﷺ نے عید الفطر سے دو دن پہلے لوگوں کو خطبہ دیا،اور (عبداللہ بن یزید مکی) المقری کی (مذکورہ بالا) روایت کی مانند بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن جریج عنعن`;
abudawood.anwaar = [65,1];