var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ التَّمْرَةُ وَالتَّمْرَتَانِ وَالْأَكْلَةُ وَالْأَكْلَتَانِ وَلَكِنَّ الْمِسْكِينَ الَّذِي لَا يَسْأَلُ النَّاسَ شَيْئًا وَلَا يَفْطِنُونَ بِهِ فَيُعْطُونَهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’مسکین وہ نہیں جسے ایک کھجور،دو کھجور اور ایک لقمہ یا دو لقمے پلٹا دیں بلکہ مسکین وہ ہے جو لوگوں سے مانگتا نہ ہو اور نہ لوگوں کو اس کے بارے میں اندازہ ہو کہ اسے دیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شاھد عند البخاري (1476) ومسلم (1039)`;