var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلَّا لِخَمْسَةٍ لِغَازٍ فِي سَبِيلِ اللَّهِ أَوْ لِعَامِلٍ عَلَيْهَا أَوْ لِغَارِمٍ أَوْ لِرَجُلٍ اشْتَرَاهَا بِمَالِهِ أَوْ لِرَجُلٍ كَانَ لَهُ جَارٌ مِسْكِينٌ فَتُصُدِّقَ عَلَى الْمِسْكِينِ فَأَهْدَاهَا الْمِسْكِينُ لِلْغَنِيِّ";
abudawood.urdu = "جناب عطاء بن یسار رحمہ اللہ (تابعی) سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’پانچ صورتوں کے علاوہ کسی غنی کے لیے صدقہ حلال نہیں۔جو اللہ کی راہ میں غازی اور مجاہد ہو۔یا صدقات کا تحصیلدار (وصول کرنے والا) ہو۔یا چٹی بھرنے والا ہو۔یا جو اپنے مال سے صدقہ کی چیز خرید لے۔یا وہ آدمی کہ کوئی مسکین اس کا ہمسایہ ہو،اس مسکین کو صدقہ دیا گیا تو اس نے اس میں سے غنی کو ہدیہ دے دیا ہو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1833)
انظر الحدیث الآتي (1636)`;