var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنِي سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ عَنْ بُشَيْرِ بْنِ يَسَارٍ زَعَمَ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ سَهْلُ بْنُ أَبِي حَثْمَةَ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَاهُ بِمِائَةٍ مِنْ إِبِلِ الصَّدَقَةِ يَعْنِي دِيَةَ الْأَنْصَارِيِّ الَّذِي قُتِلَ بِخَيْبَرَ";
abudawood.urdu = "سیدنا سہل بن ابی حثمہ انصاری رضی اللہ عنہ نے خبر دی کہ نبی کریم ﷺ نے ان کو صدقہ کے اونٹوں سے دیت ادا کی تھی۔یعنی اس انصاری کی دیت جو خیبر میں قتل کر دیا گیا تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `متفق علیہ رواہ البخاري (6898) ومسلم (1669) وانظر الحدیث الآتي (4523)`;