var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ زَيْدِ بْنِ عُقْبَةَ الْفَزَارِيِّ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَسَائِلُ كُدُوحٌ يَكْدَحُ بِهَا الرَّجُلُ وَجْهَهُ فَمَنْ شَاءَ أَبْقَى عَلَى وَجْهِهِ وَمَنْ شَاءَ تَرَكَ إِلَّا أَنْ يَسْأَلَ الرَّجُلُ ذَا سُلْطَانٍ أَوْ فِي أَمْرٍ لَا يَجِدُ مِنْهُ بُدًّا";
abudawood.urdu = "سیدنا سمرہ رضی اللہ عنہ،نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’سوال کرنا اپنے آپ کو نوچنا ہے،اس سے انسان اپنا چہرہ چھیلتا اور نوچتا ہے۔چنانچہ جو چاہے اپنے چہرے کی آبرو باقی رکھے اور جو چاہے ضائع کر دے،تاہم اگر کوئی حکمران سے سوال کرے یا بہت ہی لاچار ہو جائے،تو کوئی مضائقہ نہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1846)
أخرجہ النسائي (2600 وسندہ صحیح) عبد الملک بن عمیر صرح بالسماع عند أحمد (5/22)`;