var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ مُسْلِمِ بْنِ مَخْشِيٍّ عَنْ ابْنِ الْفِرَاسِيِّ أَنَّ الْفِرَاسِيَّ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُ يَا رَسُولَ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَإِنْ كُنْتَ سَائِلًا لَا بُدَّ فَاسْأَلْ الصَّالِحِينَ";
abudawood.urdu = "ابن الفراسی سے روایت ہے کہ فراسی رضی اللہ عنہ نے رسول اللہ ﷺ سے کہا: اے اللہ کے رسول! کیا میں سوال کر لیا کروں؟ تو نبی کریم ﷺ نے فرمایا ’’نہیں،اگر ضرور ہی مانگنا ہو تو صالح اور نیک بندوں سے سوال کر لیا کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (2588)<br>ابن الفراسي لم أجد من وثقہ وھو مجہول،انظر التحریر (8485)<br>مسلم بن مخشي وثقہ ابن حبان وحدہ فھو مجہول،راجع التحریر (6646)`;
abudawood.anwaar = [66,1];