var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمُرُّ بِالتَّمْرَةِ الْعَائِرَةِ فَمَا يَمْنَعُهُ مِنْ أَخْذِهَا إِلَّا مَخَافَةَ أَنْ تَكُونَ صَدَقَةً";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے منقول ہے کہ نبی کریم ﷺ کسی گری پڑی کھجور کے پاس سے گزرتے تو اس کو اٹھا لینے سے صرف اس لیے گریز کرتے کہ کہیں صدقے کی نہ ہو۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتي (1652)`;