var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبِي عَنْ خَالِدِ بْنِ قَيْسٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَدَ تَمْرَةً فَقَالَ لَوْلَا أَنِّي أَخَافُ أَنْ تَكُونَ صَدَقَةً لَأَكَلْتُهَا قَالَ أَبُو دَاوُد رَوَاهُ هِشَامٌ عَنْ قَتَادَةَ هَكَذَا";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے (کسی راستے میں) ایک کھجور پائی،تو فرمایا ’’اگر مجھے یہ اندیشہ نہ ہوتا کہ یہ صدقے کی ہو گی تو میں اسے کھا لیتا۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ اسے ہشام نے قتادہ سے اسی طرح روایت کیا ہے۔";
abudawood.hukam = "صحیح بخاری (2055) صحیح مسلم (1071)";
abudawood.description = ``;