var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ بَعَثَنِي أَبِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِبِلٍ أَعْطَاهَا إِيَّاهُ مِنْ الصَّدَقَةِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ میرے والد نے مجھے نبی کریم ﷺ کی خدمت میں بھیجا،ان اونٹوں کے سلسلے میں جو آپ ﷺ نے انہیں صدقہ سے دیے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش وحبیب مدلسان وعنعنا`;
abudawood.anwaar = [66,2];