var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ أَبِي عُبَيْدَةَ عَنْ أَبِيهِ عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ نَحْوَهُ زَادَ أَبِي يُبَدِّلُهَا لَهُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مذکورہ بالا کی مانند مروی ہے (ابوعبیدہ نے) یہ اضافہ کیا،کہ میرے والد نے مجھے بھیجا کہ آپ ان اونٹوں کو بدل دیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش وحبیب مدلسان وعنعنا`;
abudawood.anwaar = [66,2];