var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ قَالَ أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَحْمٍ قَالَ مَا هَذَا قَالُوا شَيْءٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ کی خدمت میں گوشت پیش کیا گیا تو آپ ﷺ نے پوچھا ’’یہ کیا ہے؟‘‘ کہنے لگے،بریرہ کو صدقہ دیا گیا تھا (یہ اسی میں سے ہے) آپ ﷺ نے فرمایا ’’وہ اس کے لیے صدقہ اور ہمارے لیے ہدیہ ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (1495) صحیح مسلم (1074)";
abudawood.description = ``;