var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَ كُنَّا نَعُدُّ الْمَاعُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَوَرَ الدَّلْوِ وَالْقِدْرِ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ ہم لوگ رسول اللہ ﷺ کے زمانے میں «الماعون» سے مراد یہ لیتے تھے کہ کسی کو استعمال کی غرض سے عاریتاً ڈول دے دیا یا ہنڈیا دے دی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;