var abudawood = {};
abudawood.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ،حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،عَنْ هِشَامِ بْنِ سَعْدٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ... صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ،قَالَ فِي قِصَّةِ الْإِبِلِ،بَعْدَ قَوْلِهِ: لَا يُؤَدِّي حَقَّهَا،قَالَ: وَمِنْ حَقِّهَا حَلَبُهَا يَوْمَ وِرْدِهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے نبی کریم ﷺ سے اسی کی مانند بیان کیا۔اور اونٹوں کے بیان میں جو ذکر ہوا کہ ’’جو ان کے حق ادا نہ کرتا رہا تھا۔‘‘ کے بعد کہا ’’اور ان کے حق میں سے یہ ہے کہ جس دن انہیں پانی پلانے کے لیے لائے ان کا دودھ دوہے۔‘‘";
abudawood.hukam = "صحیح بخاری (2371) صحیح مسلم (987)";
abudawood.description = ``;