var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ،حَدَّثَنَا أَبُو عَاصِمٍ عَنِ ابْنِ جُرَيْجٍ،قَالَ: قَالَ أَبُو الزُّبَيْرِ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ،قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ! مَا حَقُّ الْإِبِلِ؟... فَذَكَرَ نَحْوَهُ،زَادَ: وَإِعَارَةُ دَلْوِهَا.";
abudawood.urdu = "سیدنا عبید بن عمیر رحمہ اللہ (تابعی) بیان کرتے ہیں کہ ایک شخص نے کہا: اے اللہ کے رسول! اونٹوں کا کیا حق ہے؟ تو مذکورہ بالا کی مانند ذکر کیا اور مزید کہا: ’’اس کا ڈول عاریتاً دے دینا۔‘‘";
abudawood.hukam = "صحیح مسلم (988)";
abudawood.description = ``;