var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ مِنْ كُلِّ جَادِّ عَشْرَةِ أَوْسُقٍ مِنْ التَّمْرِ بِقِنْوٍ يُعَلَّقُ فِي الْمَسْجِدِ لِلْمَسَاكِينِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے کھجوروں کا پھل توڑنے والے سب لوگوں کو حکم دیا تھا کہ جو کوئی دس وسق کھجور کاٹے وہ ایک خوشہ مساکین کے لیے مسجد میں لٹکا دیا کرے۔";
abudawood.hukam = "حسن";
abudawood.description = `محمد بن إسحاق صرح بالسماع عند أحمد (3/359 ح 14866)`;