var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا مُصْعَبُ بْنُ مُحَمَّدِ بْنِ شُرَحْبِيلَ حَدَّثَنِي يَعْلَى بْنُ أَبِي يَحْيَى عَنْ فَاطِمَةَ بِنْتِ حُسَيْنٍ عَنْ حُسَيْنِ بْنِ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلسَّائِلِ حَقٌّ وَإِنْ جَاءَ عَلَى فَرَسٍ";
abudawood.urdu = "سیدنا حسین بن علی رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا ’’سائل کا حق ہے،خواہ وہ گھوڑے ہی پر سوار ہو کر آئے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2988)
صححہ ابن خزیمۃ (2468 وسندہ حسن) یعلیٰ بن أبي یحیی وثقہ ابن خزیمۃ وابن حبان وجھلہ أبو حاتم وغیرہ فھو حسن الحدیث`;