var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا زُهَيْرٌ عَنْ شَيْخٍ قَالَ رَأَيْتُ سُفْيَانَ عِنْدَهُ عَنْ فَاطِمَةَ بِنْتِ حُسَيْنٍ عَنْ أَبِيهَا عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ";
abudawood.urdu = "سیدنا حسین رضی اللہ عنہ نے اپنے والد سیدنا علی رضی اللہ عنہ سے،انہوں نے نبی کریم ﷺ سے،مذکورہ بالا حدیث کے مثل روایت کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (1665)`;