var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ هُوَ ابْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ رَجُلٍ مِنْ ثَقِيفٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ ثُمَّ نَضَحَ فَرْجَهُ";
abudawood.urdu = "مجاہد،بنو ثقیف کے ایک شخص سے،وہ اپنے والد سے روایت کرتے ہیں کہ ان کے والد کہتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ نے پیشاب کیا اور پھر اپنی شرمگاہ پر چھینٹے مارے۔";
abudawood.hukam = "حسن";
abudawood.description = `فیہ رجل مجہول، وانظر الحدیث السابق`;