var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْعَبَّاسِ الْقِلَّوْرِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَقَ الْحَضْرَمِيُّ عَنْ سُلَيْمَانَ بْنِ مُعَاذٍ التَّمِيمِيِّ حَدَّثَنَا ابْنُ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُسْأَلُ بِوَجْهِ اللَّهِ إِلَّا الْجَنَّةُ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے فرمایا ’’اللہ کے چہرے کا واسطہ دے کر صرف جنت ہی کا سوال کیا جا سکتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سلیمان بن معاذ : ضعفہ الجمہور من جھۃ حفظہ وأخرج لہ مسلم (ح 2640) متابعۃ فھو ضعیف`;
abudawood.anwaar = [67,1];