var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ ابْنِ إِسْحَقَ بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ خُذْ عَنَّا مَالَكَ لَا حَاجَةَ لَنَا بِهِ";
abudawood.urdu = "ابن اسحٰق نے اپنی مذکورہ سند سے اور اسی کے ہم معنی بیان کیا۔اس میں مزید یہ ہے کہ آپ ﷺ نے فرمایا ’’ہم سے اپنا مال لے جاؤ ہمیں اس کی کوئی ضرورت نہیں۔‘‘ (نبی کریم ﷺ نے اسے قبول نہیں فرمایا۔)";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن<br>وانظر الحدیث السابق (1673)`;
abudawood.anwaar = [67,4];