var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ خَيْرَ الصَّدَقَةِ مَا تَرَكَ غِنًى أَوْ تُصُدِّقَ بِهِ عَنْ ظَهْرِ غِنًى وَابْدَأْ بِمَنْ تَعُولُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’بلاشبہ بہترین صدقہ وہ ہے جو غنا (لوگوں سے بے نیازی) کو باقی رہنے دے یا یہ کہ اس کیفیت میں صدقہ کیا جائے کہ خود محتاج اور ضرورت مند نہ ہو (بلکہ غنی ہو) اور ان سے شروع کرو جن کی کفالت کے تم ذمہ دار ہو۔‘‘";
abudawood.hukam = "صحیح بخاری (5355)";
abudawood.description = ``;