var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الرَّمْلِيُّ قَالَا حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ جُهْدُ الْمُقِلِّ وَابْدَأْ بِمَنْ تَعُولُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے،انہوں نے پوچھا کہ اے اللہ کے رسول! کون سا صدقہ افضل ہے؟ آپ ﷺ نے فرمایا ’’کم مال والے کا محنت مشقت کر کے دینا اور شروع ان سے کرو جن کی کفالت کے تم ذمہ دار ہو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1938)
صححہ ابن خزیمۃ (2444 وسندہ صحیح، 2451)`;