var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ سَعِيدٍ أَنَّ سَعْدًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيُّ الصَّدَقَةِ أَعْجَبُ إِلَيْكَ قَالَ الْمَاءُ";
abudawood.urdu = "سیدنا سعد (سعد بن عبادہ) رضی اللہ عنہ نبی کریم ﷺ کی خدمت میں آئے اور پوچھا کہ آپ کے نزدیک کون ساتھ صدقہ زیادہ پسندیدہ ہے؟ آپ ﷺ نے فرمایا ’’پانی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3694) ابن ماجہ (3684)<br>ذکرہ الحاکم فی المستدرک فقال الذہبي ’’ لا،فإنہ غیرمتصل ‘‘ (تلخیص المستدرک : 1/ 414)<br>یعني سعید ابن المسیب لم یدرک سعد بن عبادۃ<br>وللحدیث شواھد ضعیفۃ عند النسائي (3696) وغیرہ`;
abudawood.anwaar = [68,1];