var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ الْمُهَاجِرِ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا زَائِدَةُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ الْحَكَمِ أَوْ ابْنِ الْحَكَمِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ ثُمَّ تَوَضَّأَ وَنَضَحَ فَرْجَهُ";
abudawood.urdu = "مجاہد،حکم یا ابن حکم سے،وہ اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے پیشاب کیا،پھر وضو کیا اور اپنی شرمگاہ پر پانی کے چھینٹے مارے۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابقین`;