var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ وَالْحَسَنِ عَنْ سَعْدِ بْنِ عُبَادَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ";
abudawood.urdu = "محمد بن عبدالرحیم اپنی سند سے سیدنا سعد بن عبادہ رضی اللہ عنہ سے،وہ نبی کریم ﷺ سے مذکورہ بالاحدیث کی مانند روایت کرتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3694) ابن ماجہ (3684)<br>ذکرہ الحاکم فی المستدرک فقال الذہبي ’’ لا،فإنہ غیرمتصل ‘‘ (تلخیص المستدرک : 1/ 414)<br>یعني سعید ابن المسیب لم یدرک سعد بن عبادۃ<br>وللحدیث شواھد ضعیفۃ عند النسائي (3696) وغیرہ`;
abudawood.anwaar = [68,1];