var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ رَجُلٍ عَنْ سَعْدِ بْنِ عُبَادَةَ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّ سَعْدٍ مَاتَتْ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ الْمَاءُ قَالَ فَحَفَرَ بِئْرًا وَقَالَ هَذِهِ لِأُمِّ سَعْدٍ";
abudawood.urdu = "سیدنا سعد بن عبادہ رضی اللہ عنہ سے منقول ہے انہوں نے کہا: اے اللہ کے رسول! (میری والدہ) ام سعد فوت ہو گئی ہیں تو کون سا صدقہ افضل ہے؟ (جو میں ان کی طرف سے کروں) آپ ﷺ نے فرمایا ’’پانی‘‘ چنانچہ انہوں نے ایک کنواں کھدوایا اور کہا کہ یہ (میری والدہ) ام سعد کی طرف سے ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3694) ابن ماجہ (3684)<br>ذکرہ الحاکم فی المستدرک فقال الذہبي ’’ لا،فإنہ غیرمتصل ‘‘ (تلخیص المستدرک : 1/ 414)<br>یعني سعید ابن المسیب لم یدرک سعد بن عبادۃ<br>وللحدیث شواھد ضعیفۃ عند النسائي (3696) وغیرہ`;
abudawood.anwaar = [68,1];