var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ وَهْبِ بْنِ جَابِرٍ الْخَيْوَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَفَى بِالْمَرْءِ إِثْمًا أَنْ يُضَيِّعَ مَنْ يَقُوتُ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’انسان کے گناہ گار ہونے کے لیے یہ (عمل) کافی ہے کہ جن کے رزق و اخراجات کا یہ ذمہ دار ہو،انہیں ضائع کر دے۔“";
abudawood.hukam = "صحیح";
abudawood.description = `ابو اسحاق السبیعی صرح بالسماع عند الطیالسی (2281) ولہ طریق آخر عند مسلم (996)`;