var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٌ وَيَعْقُوبُ بْنُ كَعْبٍ وَهَذَا حَدِيثُهُ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَرَّهُ أَنْ يُبْسَطَ عَلَيْهِ فِي رِزْقِهِ وَيُنْسَأَ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جسے یہ بات اچھی لگتی ہو کہ اس کا رزق فراخ اور عمر طویل ہو تو اسے چاہیئے کہ اپنے عزیز و اقارب سے میل ملاپ رکھے۔‘‘";
abudawood.hukam = "صحیح بخاری (2067) صحیح مسلم (2557)";
abudawood.description = ``;