var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ أَنَا الرَّحْمَنُ وَهِيَ الرَّحِمُ شَقَقْتُ لَهَا اسْمًا مِنْ اسْمِي مَنْ وَصَلَهَا وَصَلْتُهُ وَمَنْ قَطَعَهَا بَتَتُّهُ";
abudawood.urdu = "سیدنا عبدالرحمٰن بن عوف رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا آپ فرماتے تھے ’’اللہ تعالیٰ فرماتا ہے میں رحمن ہوں (بےانتہا رحم کرنے والا) اور یہ قرابت داریاں جسے کہ «رحم» کہتے ہیں،اس کا لفظ میں نے اپنے نام سے نکالا ہے،تو جو اپنے عزیز قرابت داروں سے میل جول رکھتا ہے (صلہ رحمی کرتا ہے) میں اس سے جڑتا ہوں اور جو اس کو کاٹتا اور توڑتا ہے میں اس سے کٹ جاتا ہوں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4930)
انظر الحدیث الآتي (1695) فھو شاھد لہ`;