var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي أَبُو سَلَمَةَ أَنَّ الرَّدَّادَ اللَّيْثِيَّ أَخْبَرَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ";
abudawood.urdu = "محمد بن متوکل عسقلانی کی سند سے مروی ہے کہ عبدالرحمٰن بن عوف رضی اللہ عنہ نے رسول اللہ ﷺ سے سنا۔اور مذکورہ بالا حدیث کے ہم معنی روایت کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وللحدیث شواھد`;