var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ قَاطِعُ رَحِمٍ";
abudawood.urdu = "سیدنا جبیر بن مطعم رضی اللہ عنہ سے مروی ہے وہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’قطع رحمی کرنے والا جنت میں داخل نہیں ہو گا۔‘‘";
abudawood.hukam = "صحیح بخاری (5984) صحیح مسلم (2556)";
abudawood.description = ``;