var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ وَالْحَسَنِ بْنِ عَمْرٍو وَفِطْرٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ سُفْيَانُ وَلَمْ يَرْفَعْهُ سُلَيْمَانُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَفَعَهُ فِطْرٌ وَالْحَسَنُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ الْوَاصِلُ بِالْمُكَافِئِ وَلَكِنْ هُوَ الَّذِي إِذَا قُطِعَتْ رَحِمُهُ وَصَلَهَا";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’بدلے میں میل ملاپ کرنے والا صلہ رحمی کرنے والا نہیں ہے،بلکہ صلہ رحمی کرنے والا وہ ہے جو توڑے جانے والے رشتے کو جوڑے۔‘‘";
abudawood.hukam = "صحیح بخاری (5991)";
abudawood.description = ``;