var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةِ أَنَّهَا ذَكَرَتْ عِدَّةً مِنْ مَسَاكِينَ قَالَ أَبُو دَاوُد و قَالَ غَيْرُهُ أَوْ عِدَّةً مِنْ صَدَقَةٍ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِي وَلَا تُحْصِي فَيُحْصَى عَلَيْكِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ انہوں نے کئی مساکین کو شمار کیا،یا کئی صدقات گنوائے تو رسول اللہ ﷺ نے ان سے فرمایا ’’(عائشہ!) دو اور گنو نہیں،ورنہ تمہیں بھی گن گن کر دیا جائے گا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;