var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ شُعْبَةَ بِمَعْنَاهُ،قَالَ: عَرِّفْهَا حَوْلًا،وَقَالَ: ثَلَاثَ مِرَارٍ،قَالَ: فَلَا أَدْرِي قَالَ لَهُ ذَلِكَ: فِي سَنَةٍ أَوْ فِي ثَلَاثِ سِنِينَ!";
abudawood.urdu = "شعبہ نے مذکورہ بالا حدیث کے ہم معنی روایت کیا (اس میں ہے آپ ﷺ نے) فرمایا ’’ایک سال تک اس کا اعلان کرو‘‘ آپ نے یہ بات تین دفعہ کہی۔(سلمہ بن کبیل نے) کہا: مجھے نہیں معلوم کہ اس کا مفہوم ایک سال میں تین بار اعلان کرنا تھا یا تین سال تک اعلان کرنا۔";
abudawood.hukam = "صحیح بخاری (2426) صحیح مسلم (1723)";
abudawood.description = ``;