var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا وُهَيْبٌ الْمَعْنَى عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ يَعْنِي ابْنَ عَبْدِ اللَّهِ عَنْ عِيَاضِ بْنِ حِمَارٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدَ لُقَطَةً فَلْيُشْهِدْ ذَا عَدْلٍ أَوْ ذَوِي عَدْلٍ وَلَا يَكْتُمْ وَلَا يُغَيِّبْ فَإِنْ وَجَدَ صَاحِبَهَا فَلْيَرُدَّهَا عَلَيْهِ وَإِلَّا فَهُوَ مَالُ اللَّهِ عَزَّ وَجَلَّ يُؤْتِيهِ مَنْ يَشَاءُ";
abudawood.urdu = "سیدنا عیاض بن حمار رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جسے کوئی گری پڑی چیز ملے تو اسے چاہیئے کہ ایک یا دو عادل گواہ بنا لے۔اور چھپائے نہیں اور نہ غائب کرے،پھر اگر اس کے مالک کو پائے تو اسے لوٹا دے،ورنہ وہ اللہ کا مال ہے جسے چاہتا ہے عنایت فرما دیتا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3039)
أخرجہ ابن ماجہ (2505 وسندہ صحیح)`;