var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا شَرِيكٌ عَنْ عَمْرِو بْنِ عَامِرٍ الْبَجَلِيِّ قَالَ مُحَمَّدٌ هُوَ أَبُو أَسَدِ بْنُ عَمْرٍو قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ الْوُضُوءِ فَقَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ لِكُلِّ صَلَاةٍ وَكُنَّا نُصَلِّي الصَّلَوَاتِ بِوُضُوءٍ وَاحِدٍ";
abudawood.urdu = "جناب عمرو بن عامر بجلی یعنی ابو اسد محمد بن عمرو کہتے ہیں کہ میں نے سیدنا انس بن مالک رضی اللہ عنہ سے وضو کے بارے میں پوچھا تو انہوں نے کہا کہ نبی کریم ﷺ ہر نماز کے لیے وضو کیا کرتے تھے،جبکہ ہم ایک ہی وضو سے کئی نمازیں پڑھ لیا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (214)";
abudawood.description = ``;