var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ ح،وحَدَّثَنَا ابْنُ الْعَلَاءِ،حَدَّثَنَا ابْنُ إِدْرِيسَ عَنِ ابْنِ إِسْحَاقَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا... قَالَ فِي ضَالَّةِ الشَّاءِ: فَاجْمَعْهَا،حَتَّى يَأْتِيَهَا بَاغِيهَا.";
abudawood.urdu = "ابن اسحٰق،عمرو بن شعیب سے،وہ (عمرو) اپنے والد سے،وہ اپنے دادا (عبداللہ بن عمرو بن عاص رضی اللہ عنہ) سے،وہ نبی کریم ﷺ سے یہی روایت کرتے ہیں تو ان کے لفظ ہیں «فاجمعہا حتی یأتیہا باغیہا » ’’اس کو اپنے مال کے ساتھ ملا لے حتیٰ کہ اس کا متلاشی آ جائے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (1710)`;