var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سَعْدِ بْنِ أَوْسٍ عَنْ بِلَالِ بْنِ يَحْيَى الْعَبْسِيِّ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ الْتَقَطَ دِينَارًا فَاشْتَرَى بِهِ دَقِيقًا فَعَرَفَهُ صَاحِبُ الدَّقِيقِ فَرَدَّ عَلَيْهِ الدِّينَارَ فَأَخَذَهُ عَلِيٌّ وَقَطَعَ مِنْهُ قِيرَاطَيْنِ فَاشْتَرَى بِهِ لَحْمًا";
abudawood.urdu = "بلال بن یحییٰ عبسی سیدنا علی رضی اللہ عنہ سے نقل کرتے ہیں کہ انہیں ایک دینار ملا،تو انہوں نے اس سے آٹا خریدا،آٹے والے نے سیدنا علی رضی اللہ عنہ کو پہچان لیا تو اس نے دینار ان کو واپس کر دیا۔تو سیدنا علی رضی اللہ عنہ نے وہ لے لیا اور اس میں سے دو قیراط کاٹ کر ان کا گوشت خریدا۔";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شواھد منھا الحدیث الآتي (1716)`;