var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ عِكْرِمَةَ أَحْسَبُهُ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ضَالَّةُ الْإِبِلِ الْمَكْتُومَةُ غَرَامَتُهَا وَمِثْلُهَا مَعَهَا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’گمشدہ اونٹ پکڑنے والا اگر چھپا لے تو اس پر جرمانہ ہے اور (مزید) اس کے ساتھ اس کا مثل بھی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>وقع الشک فی السند بین عکرمۃ وأبي ھریرۃ فالسند معلل<br>وعمرو بن مسلم ھو غیر الجندي،واللّٰہ أعلم !`;
abudawood.anwaar = [68,1];