var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنٍ لِأَبِي وَاقِدٍ اللَّيْثِيِّ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِأَزْوَاجِهِ فِي حَجَّةِ الْوَدَاعِ هَذِهِ ثُمَّ ظُهُورَ الْحُصْرِ";
abudawood.urdu = "سیدنا ابوواقد اللیثی رضی اللہ عنہ سے منقول ہے کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ اپنی ازواج سے حجتہ الوداع میں فرما رہے تھے ’’حج بس یہ ہے،پھر (گھر کی) چٹائیوں کو لازم پکڑنا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ أحمد (5/ 218 ح 21905) وابو یعلی الموصلی (1444 وفیہ روایتہ: عن زيد بن أسلم عن ابن لأبي واقد الليثي صاحب رسول الله ﷺ عن أبيه) وصححہ الحافظ في فتح الباري (4/ 74 وقال: وإسناد حديث أبي واقد صحيح)`;