var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ،حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ،عَنْ أَبِيهِ أَنَّ أَبَا هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَحِلُّ لِامْرَأَةٍ مُسْلِمَةٍ تُسَافِرُ مَسِيرَةَ لَيْلَةٍ إِلَّا وَمَعَهَا رَجُلٌ ذُو حُرْمَةٍ مِنْهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کسی مسلمان خاتون کو اپنے کسی محرم کی معیت کے بغیر ایک رات کا سفر بھی حلال نہیں ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (1339)";
abudawood.description = ``;