var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى،عَنْ جَرِيرٍ،عَنْ سُهَيْلٍ،عَنْ سَعِيدِ ابْنِ أَبِي سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ إِلَّا أَنَّهُ قَالَ: بَرِيدًا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا اور مذکورہ بالا حدیث کی مانند ذکر کیا،مگر «بریدا» کا لفظ کہا۔(یعنی کسی مسلمان عورت کو اپنے محرم کے بغیر ایک برید کا سفر بھی حلال نہیں)۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `صححہ ابن خزیمۃ (2527 وسندہ صحیح، 2526) وانظر الحدیث السابق (1724)`;