var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَنَّادٌ أَنَّ أَبَا مُعَاوِيَةَ وَوَكِيعًا حَدَّثَاهُمْ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُسَافِرَ سَفَرًا فَوْقَ ثَلَاثَةِ أَيَّامٍ فَصَاعِدًا إِلَّا وَمَعَهَا أَبُوهَا أَوْ أَخُوهَا أَوْ زَوْجُهَا أَوْ ابْنُهَا أَوْ ذُو مَحْرَمٍ مِنْهَا";
abudawood.urdu = "سیدنا ابوسعید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’وہ عورت جو اللہ اور آخرت پر ایمان رکھتی ہو اس کے لیے حلال نہیں کہ اپنے باپ،بھائی،خاوند،بیٹے یا کسی محرم کی معیت کے بغیر تین دن یا اس سے زیادہ کا سفر کرے۔‘‘";
abudawood.hukam = "صحیح مسلم (1340)";
abudawood.description = ``;