var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَافِرُ الْمَرْأَةُ ثَلَاثًا إِلَّا وَمَعَهَا ذُو مَحْرَمٍ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’عورت اپنے محرم کے بغیر تین دن کا (بھی) سفر نہ کرے۔‘‘";
abudawood.hukam = "صحیح بخاری (1087) صحیح مسلم (1338)";
abudawood.description = ``;