var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ كَانَ يُرْدِفُ مَوْلَاةً لَهُ يُقَالُ لَهَا صَفِيَّةُ تُسَافِرُ مَعَهُ إِلَى مَكَّةَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ وہ اپنی لونڈی کو اپنے ساتھ بٹھا کر لے جاتے تھے۔اس کا نام صفیہ تھا۔وہ ان کے ساتھ مکہ کا سفر کرتی تھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ البیھقي (5/226) سفیان الثوري تابعہ عقبۃ بن خالد`;