var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ يَعْنِي سُلَيْمَانَ بْنَ حَيَّانَ الْأَحْمَرَ عَنْ ابْنِ جُرَيْجٍ عَنْ عُمَرَ بْنِ عَطَاءٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَرُورَةَ فِي الْإِسْلَامِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اسلام میں «صرورۃ» نہیں ہے۔‘‘ (کوئی شخص باوجود استطاعت کے حج کرنے سے اعراض کر لے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عمر بن عطاء اختلف في تعینہ و ھو ابن وراز وھو ضعیف (تق : 4949)`;
abudawood.anwaar = [69,1];