var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا جَرِيرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ قَرَأَ هَذِهِ الْآيَةَ قرآن لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُم/قرآن قَالَ كَانُوا لَا يَتَّجِرُونَ بِمِنًى فَأُمِرُوا بِالتِّجَارَةِ إِذَا أَفَاضُوا مِنْ عَرَفَاتٍ";
abudawood.urdu = "جناب مجاہد بیان کرتے ہیں کہ سیدنا عبداللہ بن عباس رضی اللہ عنہما نے آیت کریمہ <قرآن> «لیس علیکم جناح أن تبتغوا فضلا من ربکم» </قرآن> ’’تم پر کوئی گناہ نہیں کہ اپنے رب کا فضل تلاش کرو۔‘‘ پڑھی اور فرمایا: کچھ لوگ منٰی میں تجارت نہ کرتے تھے تو انہیں حکم دیا گیا کہ جب عرفات سے واپس لوٹیں تو تجارت کر سکتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یزید بن أبي زیاد ضعیف<br>وحدیث البخاري (1770) یغني عنہ`;
abudawood.anwaar = [69,1];