var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ مُحَمَّدُ بْنُ خَازِمٍ عَنْ الْحَسَنِ بْنِ عَمْرٍو عَنْ مِهْرَانَ أَبِي صَفْوَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَرَادَ الْحَجَّ فَلْيَتَعَجَّلْ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو حج کرنا چاہے تو چاہیئے کہ جلد ہی کر لے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2523)
أخرجہ أحمد (1/225 وسندہ حسن، أبو صفوان وثقہ الحاکم وابن حبان)`;