var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ وَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ وَلِأَهْلِ الشَّامِ الْجُحْفَةَ وَلِأَهْلِ نَجْدٍ قَرْنَ وَبَلَغَنِي أَنَّهُ وَقَّتَ لِأَهْلِ الْيَمَنِ يَلَمْلَمَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے فرماتے ہیں کہ رسول اللہ ﷺ نے اہل مدینہ کے لیے ذوالحلیفہ (موجودہ آبارعلی)،اہل شام کے لیے جحفہ اہل نجد کے لیے قرن المنازل کے مقامات متعین فرمائے تھے۔اور مجھے یہ خبر بھی پہنچی ہے کہ آپ ﷺ نے اہل یمن کے لیے یلملم متعین کیا تھا۔";
abudawood.hukam = "صحیح بخاری (1525) صحیح مسلم (1182)";
abudawood.description = ``;