var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هِشَامُ بْنُ بَهْرَامَ الْمَدَائِنِيُّ حَدَّثَنَا الْمُعَافِىُّ بْنُ عِمْرَانَ عَنْ أَفْلَحَ يَعْنِي ابْنَ حُمَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْعِرَاقِ ذَاتَ عِرْقٍ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے رسول اللہ ﷺ نے اہل عراق کے لیے ’’ذات عرق‘‘ کا مقام متعین فرمایا تھا (احرام کے لیے)۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2531)
أخرجہ النسائي (2654 وسندہ صحیح)`;