var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ نُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ بِالشَّجَرَةِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ أَنْ تَغْتَسِلَ فَتُهِلَّ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ اسماء بنت عمیس رضی اللہ عنہا (زوجہ ابوبکر صدیق رضی اللہ عنہ) نے شجرہ کے مقام پر محمد بن ابی بکر رضی اللہ عنہ کو جنم دیا تو رسول اللہ ﷺ نے ابوبکر رضی اللہ عنہ سے فرمایا ’’اسے چاہیئے کہ غسل کر کے احرام باندھ لے۔‘‘";
abudawood.hukam = "صحیح مسلم (1209)";
abudawood.description = ``;