var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِإِحْلَالِهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں رسول اللہ ﷺ کو آپ کے احرام باندھنے کے وقت،احرام سے پہلے خوشبو لگایا کرتی تھی اور ایسے ہی احرام کھولنے کے بعد،بیت اللہ کا طواف کرنے سے پہلے۔";
abudawood.hukam = "صحیح بخاری (1539) صحیح مسلم (1189)";
abudawood.description = ``;