var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الْمِسْكِ فِي مَفْرِقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے،فرماتی ہیں کہ گویا میں کستوری کی اس چمک کو دیکھ رہی ہوں جو رسول اللہ ﷺ کی مانگ میں لگی ہوتی جب کہ آپ ﷺ احرام میں ہوتے۔";
abudawood.hukam = "صحیح مسلم (1190)";
abudawood.description = ``;