var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ يَعْنِي ابْنَ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهِلُّ مُلَبِّدًا";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو تلبیہ پکارتے ہوئے سنا جب کہ آپ ﷺ اپنے سر کے بال جمائے ہوئے تھے۔";
abudawood.hukam = "صحیح بخاری (1540) صحیح مسلم (1184)";
abudawood.description = ``;