var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ عَنْ آلِ مُحَمَّدٍ فِي حَجَّةِ الْوَدَاعِ بَقَرَةً وَاحِدَةً";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے حجتہ الوداع میں آل محمد کی طرف سے ایک گائے ذبح کی تھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شاھد عند النسائي فی الکبریٰ  (4129 وسندہ حسن)`;