var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ وَمُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَبَحَ عَمَّنْ اعْتَمَرَ مِنْ نِسَائِهِ بَقَرَةً بَيْنَهُنَّ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے اپنی ازواج کی طرف سے،جنہوں نے عمرہ کیا تھا،ایک گائے ذبح کی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3133)<br>یحیی بن أبي کثیر مدلس وعنعن<br>وحدیث البخاري (1709) و مسلم (125 / 1211،1319) یغني عنہ`;
abudawood.anwaar = [69,2];