var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ بِهَذَا الْحَدِيثِ بِمَعْنَى أَبِي الْوَلِيدِ قَالَ ثُمَّ سَلَتَ الدَّمَ بِيَدِهِ قَالَ أَبُو دَاوُد رَوَاهُ هَمَّامٌ قَالَ سَلَتَ الدَّمَ عَنْهَا بِأُصْبُعِهِ قَالَ أَبُو دَاوُد هَذَا مِنْ سُنَنِ أَهْلِ الْبَصْرَةِ الَّذِي تَفَرَّدُوا بِهِ";
abudawood.urdu = "شعبہ نے یہ حدیث ابو الولید کے ہم معنی روایت کی،کہا کہ انگلی سے خون چپڑا۔امام ابوداؤد رحمہ اللہ نے کہا: یہ روایت اہل بصرہ کے تفردات میں سے ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1752)`;