var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ وَمَرْوَانُ بْنُ الْحَكَمِ أَنَّهُمَا قَالَا خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ فَلَمَّا كَانَ بِذِي الُحُلَيْفَةِ قَلَّدَ الْهَدْيَ وَأَشْعَرَهُ وَأَحْرَمَ";
abudawood.urdu = "مسور بن مخرمہ اور مروان (بن حکم) بیان کرتے ہیں کہ تو آپ ﷺ نے قربانی کو قلاوہ پہنایا،اس کا اشعار کیا اور احرام باندھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ النسائي (2772)`;