var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ وَالْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَى غَنَمًا مُقَلَّدَةً";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے بکریاں بطور ہدی (حرم کی طرف) بھجوائیں اور ان کی گردنوں میں قلاوے ڈالے۔";
abudawood.hukam = "صحیح بخاری (1701) صحیح مسلم (1321)";
abudawood.description = ``;