var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ الْهَمَدَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ أَنَّ اللَّيْثَ بْنَ سَعْدٍ حَدَّثَهُمْ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهْدِي مِنْ الْمَدِينَةِ فَأَفْتِلُ قَلَائِدَ هَدْيِهِ ثُمَّ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ مدینہ سے ھدی بھیجا کرتے تھے۔میں ان کے قلاووں کی رسیاں بٹا کرتی تھی اور پھر آپ کسی چیز سے اجتناب نہ کرتے جس سے کہ محرم اجتناب کرتا ہے۔";
abudawood.hukam = "صحیح بخاری (1698) صحیح مسلم (1321)";
abudawood.description = ``;