var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ فَقَالَ ارْكَبْهَا وَيْلَكَ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے ایک شخص کو دیکھا کہ وہ اپنی قربانی کا اونٹ ہانکے جا رہا تھا (اور خود پیدل چل رہا تھا) تو آپ ﷺ نے اس سے فرمایا ’’اس پر سوار ہو جاؤ۔‘‘ اس نے کہا: یہ قربانی کے لیے ہے۔آپ ﷺ نے فرمایا ’’اس پر سوار ہو جاؤ،تم پر افسوس!‘‘ آپ نے یہ (افسوس کا لفظ) دوسری یا تیسری بار میں فرمایا۔";
abudawood.hukam = "صحیح بخاری (1689) صحیح مسلم (1322)";
abudawood.description = ``;