var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ رُكُوبِ الْهَدْيِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ارْكَبْهَا بِالْمَعْرُوفِ إِذَا أُلْجِئْتَ إِلَيْهَا حَتَّى تَجِدَ ظَهْرًا";
abudawood.urdu = "جناب ابو الزبیر کہتے ہیں کہ میں نے سیدنا جابر بن عبداللہ رضی اللہ عنہ سے قربانی کے جانور پر سواری کے متعلق پوچھا تو انہوں نے کیا: میں نے رسول اللہ ﷺ سے سنا ہے،آپ فرما رہے تھے ’’جب تم مجبور ہو جاؤ تو (احسان کے ساتھ اور) معروف انداز سے اس پر سواری کرو حتیٰ کہ تمہیں کوئی اور سواری مل جائے۔‘‘";
abudawood.hukam = "صحیح مسلم (1324)";
abudawood.description = ``;