var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ نَاجِيَةَ الْأَسْلَمِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مَعَهُ بِهَدْيٍ فَقَالَ إِنْ عَطِبَ مِنْهَا شَيْءٌ فَانْحَرْهُ ثُمَّ اصْبُغْ نَعْلَهُ فِي دَمِهِ ثُمَّ خَلِّ بَيْنَهُ وَبَيْنَ النَّاسِ";
abudawood.urdu = "سیدنا ناجیہ اسلمی رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے ان کے ہاتھ اپنی قربانی بھجوائی اور انہیں فرمایا ’’اگر ان میں سے کوئی جانور ہلاک ہونے لگے تو اسے نحر کر دینا،اس کے جوتے کو اس کے خون سے رنگ دینا،پھر اسے لوگوں کے لیے چھوڑ دینا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2642)
أخرجہ الترمذي (910 وسندہ صحیح) وابن ماجہ (3106 وسندہ صحیح) وصححہ ابن خزیمۃ (2577 وسندہ صحیح)`;