var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدٌ وَيَعْلَى ابْنَا عُبَيْدٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ لَمَّا نَحَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُدْنَهُ فَنَحَرَ ثَلَاثِينَ بِيَدِهِ وَأَمَرَنِي فَنَحَرْتُ سَائِرَهَا";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے جب اپنے اونٹ نحر کیے تو تیس اونٹ اپنے ہاتھ سے نحر کیے اور باقی کے متعلق مجھے حکم فرمایا اور میں نے انہیں نحر کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق سمعہ من رجل،مجہول،عن ابن أبي نجیح بہ(أحمد 1/ 260)<br>وابن أبي نجیح مدلس`;
abudawood.anwaar = [70,1];