var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ سَابِطٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ كَانُوا يَنْحَرُونَ الْبَدَنَةَ مَعْقُولَةَ الْيُسْرَى قَائِمَةً عَلَى مَا بَقِيَ مِنْ قَوَائِمِهَا";
abudawood.urdu = "جناب ابوخالد احمر،ابن جریج سے،وہ ابو الزبیر سے اور وہ سیدنا جابر رضی اللہ عنہ سے روایت کرتے ہیں اور (ابن جریج نے کہا) مجھے عبدالرحمٰن بن سابط نے خبر دی کہ ’’نبی کریم ﷺ اور آپ کے صحابہ اونٹ کو ’’نحر‘‘ کیا کرتے تھے جبکہ اس کا بایاں پاؤں بندھا ہوتا اور وہ باقی تین پاؤں پر کھڑا ہوتا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الزبیرمدلس وابن جریج مدلس عنعنا<br>وحدیث ابن سابط مرسل`;
abudawood.anwaar = [70,1];