var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ أَخْبَرَنِي زِيَادُ بْنُ جُبَيْرٍ قَالَ كُنْتُ مَعَ ابْنِ عُمَرَ بِمِنًى فَمَرَّ بِرَجُلٍ وَهُوَ يَنْحَرُ بَدَنَتَهُ وَهِيَ بَارِكَةٌ فَقَالَ ابْعَثْهَا قِيَامًا مُقَيَّدَةً سُنَّةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "جناب زیاد بن جبیر کہتے ہیں کہ میں منٰی میں سیدنا عبداللہ بن عمر رضی اللہ عنہما کے ساتھ تھا کہ وہ ایک آدمی کے پاس سے گزرے اور وہ اپنی اونٹنی کو نحر کرنا چاہ رہا تھا جبکہ وہ بیٹھی ہوئی تھی۔تو سیدنا ابن عمر رضی اللہ عنہما نے فرمایا ’’اسے کھڑی کرو،(ایک) پاؤں بندھا ہوا ہو،یہی محمد ﷺ کی سنت ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (1713) صحیح مسلم (1320)";
abudawood.description = ``;