var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ أَحَدُكُمْ فِي الصَّلَاةِ فَوَجَدَ حَرَكَةً فِي دُبُرِهِ أَحْدَثَ أَوْ لَمْ يُحْدِثْ فَأَشْكَلَ عَلَيْهِ فَلَا يَنْصَرِفْ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے بیان فرمایا ’’جب تم میں سے کوئی نماز میں ہو اور اپنی دبر میں کوئی حرکت محسوس کرے،آیا ہوا خارج ہوئی ہے یا نہیں اور اسے شبہ ہو گیا ہو تو نماز چھوڑ کر نہ جائے حتیٰ کہ آواز سنے یا بو محسوس کرے۔‘‘";
abudawood.hukam = "صحیح مسلم (362)";
abudawood.description = ``;