var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ بَيْدَاؤُكُمْ هَذِهِ الَّتِي تَكْذِبُونَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا مَا أَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ عِنْدِ الْمَسْجِدِ يَعْنِي مَسْجِدَ ذِي الْحُلَيْفَةِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ تم لوگ اس میدان بیداء کے بارے میں رسول اللہ ﷺ کے متعلق غلط کہتے ہو۔آپ ﷺ نے تو مسجد ہی کے پاس تلبیہ پکارنا شروع کر دیا تھا یعنی ذوالحلیفہ کی مسجد کے پاس سے۔";
abudawood.hukam = "صحیح بخاری (1541) صحیح مسلم (1186)";
abudawood.description = ``;