var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ رَاحِلَتَهُ فَلَمَّا عَلَا عَلَى جَبَلِ الْبَيْدَاءِ أَهَلَّ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے منقول ہے کہ نبی کریم ﷺ نے ظہر کی نماز پڑھی،پھر اپنی سواری پر سوار ہوئے اور جب میدان بیداء کے ریتلے ٹیلے کی بلندی پر پہنچے تو آپ نے تلبیہ پکارا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (2663)<br>الحسن البصري مدلس وعنعن`;
abudawood.anwaar = [70,1];