var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا وَهْبٌ يَعْنِي ابْنَ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ يُحَدِّثُ عَنْ أَبِي الزِّنَادِ عَنْ عَائِشَةَ بِنْتِ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَتْ قَالَ سَعْدُ بْنُ أَبِي وَقَّاصٍ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ طَرِيقَ الْفُرْعِ أَهَلَّ إِذَا اسْتَقَلَّتْ بِهِ رَاحِلَتُهُ وَإِذَا أَخَذَ طَرِيقَ أُحُدٍ أَهَلَّ إِذَا أَشْرَفَ عَلَى جَبَلِ الْبَيْدَاءِ";
abudawood.urdu = "جناب سعد بن ابی وقاص رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ جب «فرع» کی راہ اختیار کرتے تو اس وقت تلبیہ پکارنا شروع کرتے جب آپ کی سواری آپ کو لے کر سیدھی کھڑی ہو جاتی۔اور جب احد کی راہ سے چلنے لگتے تو اس وقت تلبیہ کہتے جب بیداء کے ٹیلے پر چڑھتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن`;
abudawood.anwaar = [70,2];