var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ حَبِيبٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبَّلَ امْرَأَةً مِنْ نِسَائِهِ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ قَالَ عُرْوَةُ مَنْ هِيَ إِلَّا أَنْتِ فَضَحِكَتْ قَالَ أَبُو دَاوُد هَكَذَا رَوَاهُ زَائِدَةُ وَعَبْدُ الْحَمِيدِ الْحِمَّانِيُّ عَنْ سُلَيْمَانَ الْأَعْمَشِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ نے (ایک بار) اپنی کسی بیوی کا بوسہ لیا اور نماز کے لیے تشریف لے گئے اور وضو نہیں کیا۔عروہ بن زبیر کہتے ہیں (یہ سیدہ عائشہ رضی اللہ عنہا کے بھانجے تھے) میں نے کہا: یہ آپ ہی ہوں گی،تو وہ ہنس دیں۔امام ابوداؤد رحمہ اللہ کہتے ہیں: زائدہ اور عبدالحمید حمانی نے سلیمان اعمش سے ایسے ہی روایت کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (86)،ابن ماجہ (502)<br>الأعمش مدلس وعنعن<br>وحبیب لم یسمع من عروۃ`;
abudawood.anwaar = [19,2];