var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ قَالَ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ وَعَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ وَحُمَيْدٌ الطَّوِيلُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُمْ سَمِعُوهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي بِالْحَجِّ وَالْعُمْرَةِ جَمِيعًا يَقُولُ لَبَّيْكَ عُمْرَةً وَحَجًّا لَبَّيْكَ عُمْرَةً وَحَجًّا";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو سنا کہ آپ ﷺ حج اور عمرے کا تلبیہ اکٹھے پڑھتے ہوئے کہہ رہے تھے۔<عربی> «لبیک عمرۃ وحجا،لبیک عمرۃ وحجا»۔</عربی>";
abudawood.hukam = "صحیح مسلم (1251)";
abudawood.description = ``;