var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ قَالَ قَالَ الصُّبَيُّ بْنُ مَعْبَدٍ أَهْلَلْتُ بِهِمَا مَعًا فَقَالَ عُمَرُ هُدِيتَ لِسُنَّةِ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "ابووائل بیان کرتے کہ جناب صبی بن معبد نے کہا میں نے حج اور عمرے دونوں کا اکٹھے ہی تلبیہ کہا ہے تو سیدنا عمر بن خطاب رضی اللہ عنہ نے کہا تمہیں اپنے نبی کریم ﷺ کے طریقے کی ہدایت ملی ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (2720 وسندہ صحیح)`;