var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ أَبِيهِ عَنْ خَالِدِ بْنِ سَلَمَةَ يَعْنِي الْفَأْفَاءَ عَنْ الْبَهِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ اللَّهَ عَزَّ وَجَلَّ عَلَى كُلِّ أَحْيَانِهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان فرماتی ہیں کہ رسول اللہ ﷺ ہر وقت اللہ تعالیٰ کا ذکر کیا کرتے تھے۔";
abudawood.hukam = "صحیح مسلم (373)";
abudawood.description = `زکریا بن ابی زائدۃ صرح بالسماع عند احمد (6/ 278)`;