var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَمَخْلَدُ بْنُ خَالِدٍ وَمُحَمَّدُ بْنُ يَحْيَى الْمَعْنَى قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ مُعَاوِيَةَ قَالَ لَهُ أَمَا عَلِمْتَ أَنِّي قَصَّرْتُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِشْقَصِ أَعْرَابِيٍّ عَلَى الْمَرْوَةِ زَادَ الْحَسَنُ فِي حَدِيثِهِ لِحَجَّتِهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ سیدنا معاویہ رضی اللہ عنہ نے ان سے کہا: کیا تمہیں معلوم نہیں کہ میں نے مروہ پر ایک بدوی کے تیر (کے پھل) سے رسول اللہ ﷺ کے بال کاٹے تھے۔حسن بن علی کی روایت میں اضافہ ہے ’’حج کے موقع پر۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أنظر الحدیث السابق (1802)`;