var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ يَعْنِي ابْنَ السَّرِيِّ عَنْ ابْنِ أَبِي زَائِدَةَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ سُلَيْمِ بْنِ الْأَسْوَدِ أَنَّ أَبَا ذَرٍّ كَانَ يَقُولُ فِيمَنْ حَجَّ ثُمَّ فَسَخَهَا بِعُمْرَةٍ لَمْ يَكُنْ ذَلِكَ إِلَّا لِلرَّكْبِ الَّذِينَ كَانُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ اس شخص کے بارے میں کہا کرتے تھے جو حج کی نیت کرے پھر اسے فسخ کر کے عمرہ بنا دے،یہ صرف ان لوگوں کے لیے تھا جو رسول اللہ ﷺ کی معیت میں تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن<br>ولأصل الحدیث شواھد عند مسلم (1224) والحمیدي (133،134) وغیرہما و فیھا غنیۃ عن ھذا الحدیث الضعیف`;
abudawood.anwaar = [71,1];