var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ أَخْبَرَنِي رَبِيعَةُ بْنُ أَبِي عَبْدِ الرَّحْمَنِ عَنْ الْحَارِثِ بْنِ بِلَالِ بْنِ الْحَارِثِ عَنْ أَبِيهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ فَسْخُ الْحَجِّ لَنَا خَاصَّةٌ أَوْ لِمَنْ بَعْدَنَا قَالَ بَلْ لَكُمْ خَاصَّةٌ";
abudawood.urdu = "حارث بن بلال اپنے والد سے بیان کرتے ہیں کہ انہوں نے کہا: اے اللہ کے رسول! کیا حج کو فسخ کر دینا ہمارے لیے خاص ہے یا ہمارے بعد والوں کے لیے بھی ہے؟ آپ ﷺ نے فرمایا ’’بلکہ یہ تمہارے ہی لیے خاص ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ ابن ماجہ (2984 وسندہ حسن) الحارث بن بلال حسن الحدیث وثقہ الحاکم والذہبي وابن الجارود`;