var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ بِمَعْنَاهُ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ عَنْ عَمْرِو بْنِ أَوْسٍ عَنْ أَبِي رَزِينٍ قَالَ حَفْصٌ فِي حَدِيثِهِ رَجُلٌ مِنْ بَنِي عَامِرٍ أَنْهِ قَال يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ الْحَجَّ وَلَا الْعُمْرَةَ وَلَا الظَّعْنَ قَالَ احْجُجْ عَنْ أَبِيكَ وَاعْتَمِرْ";
abudawood.urdu = "بنو عامر کے ایک شخص ابورزین نے بیان کیا کہ انہوں نے پوچھا تھا کہ اے اللہ کے رسول! میرے والد بہت بوڑھے ہیں اور حج عمرے کی طاقت نہیں رکھتے اور نہ سواری پر سوار ہو سکتے ہیں۔آپ ﷺ نے فرمایا ’’اپنے باپ کی طرف سے حج کرو اور عمرہ (بھی)۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2528)
أخرجہ الترمذي (930 وسندہ صحیح) والنسائي (2622 وسندہ صحیح) وابن ماجہ (2906 وسندہ صحیح) وصححہ ابن خزیمۃ (3040)`;