var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّى حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ";
abudawood.urdu = "سیدنا فضل بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ (دسویں ذوالحجہ کو) جمرہ عقبہ کو کنکریاں مارنے تک تلبیہ کہتے رہے۔";
abudawood.hukam = "صحیح بخاری (1685) صحیح مسلم (1280)";
abudawood.description = ``;