var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ غَدَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مِنًى إِلَى عَرَفَاتٍ مِنَّا الْمُلَبِّي وَمِنَّا الْمُكَبِّرُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے منقول ہے،کہتے ہیں کہ ہم (نویں تاریخ کو) صبح کے وقت منیٰ سے عرفات کی طرف روانہ ہوئے تو کچھ لوگ ہم میں سے تلبیہ پکار رہے تھے اور کچھ تکبیر۔";
abudawood.hukam = "صحیح مسلم (1284)";
abudawood.description = ``;