var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ عَطَاءٍ عَنْ يَعْلَى بْنِ أُمَيَّةَ وَهُشيْمٌ عَنْ الْحَجَّاجِ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ بِهَذِهِ الْقِصَّةِ قَالَ فِيهِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْلَعْ جُبَّتَكَ فَخَلَعَهَا مِنْ رَأْسِهِ وَسَاقَ الْحَدِيثَ";
abudawood.urdu = "سیدنا یعلیٰ بن امیہ رضی اللہ عنہ یہ قصہ روایت کرتے ہوئے کہتے ہیں کہ نبی کریم ﷺ نے اس سے فرمایا ’’اپنا جبہ اتار دو۔‘‘ چنانچہ اس نے اسے اپنے سر کی طرف سے اتار دیا۔اور حدیث بیان کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عطاء عن یعلی منقطع<br>والحجاج بن أرطاۃ ضعیف مدلس (الفتح المبین في تحقیق طبقات المدلسین ص 70 وتحفۃ الأقویاء :75) و قال النووي : ضعیف عند الجمھور (المجموع شرح المھذب 1/ 274) و قال ابن حجر : فإن الأکثر علی تضعیفہ (التلخیص الحبیر 2/ 226 ح 962)<br>و الحدیث السابق (الأصل : 1819) یغني عنہ`;
abudawood.anwaar = [72,1];