var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الْهَمَدَانِيُّ الرَّمْلِيُّ قَالَ حَدَّثَنِي اللَّيْثُ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ ابْنِ يَعْلَى ابْنِ مُنْيَةَ عَنْ أَبِيهِ بِهَذَا الْخَبَرِ قَالَ فِيهِ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْزِعَهَا نَزْعًا وَيَغْتَسِلَ مَرَّتَيْنِ أَوْ ثَلَاثًا وَسَاقَ الْحَدِيثَ";
abudawood.urdu = "سیدنا یعلیٰ ابن منیہ رضی اللہ عنہ نے یہ خبر روایت کی اس میں ہے کہ رسول اللہ ﷺ نے اسے حکم دیا کہ اسے اتار دو (جبہ کو) اور غسل کرو دو بار یا تین بار۔اور حدیث بیان کی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;