var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرِمٍ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ قَيْسَ بْنَ سَعْدٍ يُحَدِّثُ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى بْنِ أُمَيَّةَ عَنْ أَبِيهِ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْجِعْرَانَةِ وَقَدْ أَحْرَمَ بِعُمْرَةٍ وَعَلَيْهِ جُبَّةٌ وَهُوَ مُصَفِّرٌ لِحْيَتَهُ وَرَأْسَهُ وَسَاقَ هَذَا الْحَدِيثَ";
abudawood.urdu = "جناب صفوان اپنے والد یعلیٰ بن امیہ رضی اللہ عنہ سے نقل کرتے ہیں کہ جعرانہ مقام پر ایک شخص نبی کریم ﷺ کی خدمت میں آیا،اس نے عمرے کا احرام باندھا ہوا تھا،جبہ پہنے ہوئے تھا اور اس کی ڈاڑھی اور سر میں زرد رنگ کی خوشبو لگی ہوئی تھی۔اور مذکورہ بالا حدیث بیان کی۔";
abudawood.hukam = "صحیح مسلم (1180)";
abudawood.description = ``;