var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْمَدِينِيُّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمَةُ لَا تَنْتَقِبُ وَلَا تَلْبَسُ الْقُفَّازَيْنِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’احرام والی عورت نہ نقاب لگائے اور نہ دستانے پہنے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `الحدیث السابق (1825) شاھد لہ`;