var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ وَجَدَ الْقُرَّ فَقَالَ أَلْقِ عَلَيَّ ثَوْبًا يَا نَافِعُ فَأَلْقَيْتُ عَلَيْهِ بُرْنُسًا فَقَالَ تُلْقِي عَلَيَّ هَذَا وَقَدْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَلْبَسَهُ الْمُحْرِمُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ انہیں سردی لگی تو انہوں نے کہا: اے نافع! مجھ پر کوئی کپڑا ڈال دو۔چنانچہ میں (نافع) نے ان پر ایک برنس (ایک قمیص جس کا ایک حصہ بطور ٹوپی استعمال ہوتا ہے) ڈال دی۔تو وہ بولے مجھ پر یہ ڈال رہا ہے حالانکہ رسول اللہ ﷺ نے محرم کو اس کے پہننے سے منع فرمایا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2692)
أخرجہ الحمیدي (696 وسندہ صحیح)`;