var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ،عَنْ قَيْسِ بْنِ طَلْقٍ،عَنْ أَبِيهِ بِإِسْنَادِهِ وَمَعْنَاهُ وَقَالَ:فِي الصَّلَاةِ.";
abudawood.urdu = "محمد بن جابر،قیس بن طلق سے،وہ اپنے والد سے اسی سند سے اور مذکورہ بالا حدیث کے ہم معنی روایت کرتے ہیں۔اس میں ہے کہ ’’دوران نماز میں‘‘ (اگر کوئی ہاتھ لگائے تو فرمایا کہ یہ اس کے جسم کا ایک ٹکڑا ہی ہے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن جابر ضعیف ضعفہ الجمہور وقال الھیثمي: وھو ضعیف عند الجمھور (مجمع الزوائد 5/ 191)`;
abudawood.anwaar = [20,1];