var abudawood = {};
abudawood.arabic = "حَدَّثَنَاأَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ عَائِشَةَ قَالَتْ كَانَ الرُّكْبَانُ يَمُرُّونَ بِنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحْرِمَاتٌ فَإِذَا حَاذَوْا بِنَا سَدَلَتْ إِحْدَانَا جِلْبَابَهَا مِنْ رَأْسِهَا عَلَى وَجْهِهَا فَإِذَا جَاوَزُونَا كَشَفْنَاهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ ہم رسول اللہ ﷺ کے ساتھ احرام سے ہوتی تھیں اور قافلے والے ہمارے سامنے سے گزرتے تو ہم اپنے پردے کی چادر کو سر سے چہرے پر لٹکا لیتیں۔جب وہ گزر جاتے تو چہرہ کھول لیتی تھیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2935)<br>یزید بن أبي زیاد ضعیف`;
abudawood.anwaar = [72,1];