var abudawood = {};
abudawood.arabic = "حَدَّثَنَاعُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ فِي رَأْسِهِ مِنْ دَاءٍ كَانَ بِهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے احرام کی حالت میں اپنے سر میں ایک بیماری کی بنا پر سینگی لگوائی۔";
abudawood.hukam = "صحیح بخاری (5700)";
abudawood.description = `مشکوۃ المصابیح (4543)`;