var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ عَلَى ظَهْرِ الْقَدَمِ مِنْ وَجَعٍ كَانَ بِهِ قَالَ أَبُو دَاوُد سَمِعْت أَحْمَدَ قَالَ ابْنُ أَبِي عَرُوبَةَ أَرْسَلَهُ يَعْنِي عَنْ قَتَادَةَ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے بحالت احرام اپنے پاؤں کی پشت پر،ایک تکلیف کی وجہ سے سینگی لگوائی۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ میں نے امام احمد سے سنا،وہ کہتے تھے کہ ابن ابی عروبہ نے اس روایت کو قتادہ سے مرسل بیان کیا۔(یعنی جناب انس کا واسطہ ذکر نہیں کیا۔)";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (2852)<br>قتادۃ مدلس وعنعن<br>وللحدیث شاھد ضعیف یأتي(3863)`;
abudawood.anwaar = [72,1];