var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُمْ حَدَّثَنَا سَعِيدٌ عَنْ مَطَرٍ ويَعْلَى بْنِ حَكِيمٍ عَنْ نَافِعٍ عَنْ نُبَيْهِ بْنِ وَهْبٍ عَنْ أَبَانَ بْنِ عُثْمَانَ عَنْ عُثْمَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ مِثْلَهُ زَادَ وَلَا يَخْطُبُ";
abudawood.urdu = "جناب ابان بن عثمان،سیدنا عثمان رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا اور مذکورہ بالا حدیث کے مثل ذکر کیا۔اور مذید کہا: ’’اور نہ شادی کا پیغام دے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1841)`;