var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حَبِيبِ بْنِ الشَّهِيدِ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ يَزِيدَ بْنِ الْأَصَمِّ ابْنِ أَخِي مَيْمُونَةَ عَنْ مَيْمُونَةَ قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ حَلَالَانِ بِسَرِفَ";
abudawood.urdu = "ام المؤمنین سیدہ میمونہ رضی اللہ عنہا کے بھتیجے یزید بن اصم سیدہ میمونہ رضی اللہ عنہا سے روایت کرتے ہیں وہ کہتی ہیں کہ رسول اللہ ﷺ نے مجھ سے مقام سرف میں نکاح کیا تھا اور ہم دونوں حلال تھے۔";
abudawood.hukam = "صحیح مسلم (1411)";
abudawood.description = ``;