var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ رَجُلٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ وَهِمَ ابْنُ عَبَّاسٍ فِي تَزْوِيجِ مَيْمُونَةَ وَهُوَ مُحْرِمٌ";
abudawood.urdu = "جناب سعید بن مسیب رحمہ اللہ کہتے ہیں کہ سیدنا ابن عباس رضی اللہ عنہما کو سیدہ میمونہ رضی اللہ عنہا کے نکاح کے معاملے میں وہم ہوا ہے کہ وہ احرام میں تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>’’ رجل ‘‘ لم أعرفہ،والثوري عنعن`;
abudawood.anwaar = [72,1];