var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ حَدَّثَنِي مُحَمَّدُ بْنُ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ قَتْلُهُنَّ حَلَالٌ فِي الْحُرُمِ الْحَيَّةُ وَالْعَقْرَبُ وَالْحِدَأَةُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے فرمایا ’’پانچ قسم کے جانوروں کو حرم میں قتل کرنا حلال ہے،یعنی سانپ،بچھو،چیل،چوہا اور کاٹنے والا کتا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `الحدیث السابق (1846) شاھد لہ`;