var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي نُعْمٍ الْبَجَلِيُّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَمَّا يَقْتُلُ الْمُحْرِمُ قَالَ الْحَيَّةُ وَالْعَقْرَبُ وَالْفُوَيْسِقَةُ وَيَرْمِي الْغُرَابَ وَلَا يَقْتُلُهُ وَالْكَلْبُ الْعَقُورُ وَالْحِدَأَةُ وَالسَّبُعُ الْعَادِي";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ سے پوچھا گیا کہ محرم کون سے جانور قتل کر سکتا ہے؟ آپ ﷺ نے فرمایا ’’سانپ،بچھو،چوہا،کوے کو پتھر مارے قتل نہ کرے،کاٹنے والا کتا،چیل اور ہر حملہ آور درندہ۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (838) ابن ماجہ (3089)<br>یزید : ضعیف`;
abudawood.anwaar = [72,1];