var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَ يَا زَيْدَ بْنَ أَرْقَمَ هَلْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُهْدِيَ إِلَيْهِ عَضُدُ صَيْدٍ فَلَمْ يَقْبَلْهُ وَقَالَ إِنَّا حُرُمٌ قَالَ نَعَمْ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے انہوں نے کہا: اے زید بن ارقم! کیا تمہیں معلوم ہے کہ رسول اللہ ﷺ کو ایک شکار کا عضو ہدیہ دیا گیا تھا تو آپ ﷺ نے اسے قبول نہیں کیا تھا اور فرمایا تھا‘‘ ہم احرام میں ہیں؟ ’’سیدنا زید رضی اللہ عنہ نے جواب دیا،ہاں!۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (2823 وسندہ صحیح)`;