var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَمَّادٌ عَنْ مَيْمُونِ بْنِ جَابَانَ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجَرَادُ مِنْ صَيْدِ الْبَحْرِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’ٹڈی سمندر کے شکار (کی قسم) میں سے ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2701)
میمون بن جابان وثقہ العجلي وابن حبان والذہبي فی الکاشف فحدیثہ لا ینزل عن درجۃ الحسن`;