var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ إِنْ شِئْتَ فَانْسُكْ نَسِيكَةً وَإِنْ شِئْتَ فَصُمْ ثَلَاثَةَ أَيَّامٍ وَإِنْ شِئْتَ فَأَطْعِمْ ثَلَاثَةَ آصُعٍ مِنْ تَمْرٍ لِسِتَّةِ مَسَاكِينَ";
abudawood.urdu = "سیدنا کعب بن عجرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ان سے فرمایا ’’چاہو تو قربانی دے دو،چاہو تو تین دن روزے رکھ لو اور اگر چاہو تو تین صاع کھجور چھ مسکینوں کو کھلا دو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1856)`;