var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ أَخْبَرَهُ عَنْ كَعْبِ بْنِ عُجْرَةَ وَكَانَ قَدْ أَصَابَهُ فِي رَأْسِهِ أَذًى فَحَلَقَ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُهْدِيَ هَدْيًا بَقَرَةً";
abudawood.urdu = "سیدنا کعب بن عجرہ رضی اللہ عنہ سے مروی ہے۔اور ان کی حالت یہ تھی کہ سر میں اذیت تھی (یعنی جوئیں پڑ گئی تھیں) تو انہوں نے اپنا سر منڈوا لیا تھا۔پس نبی کریم ﷺ نے ان کو حکم دیا تھا کہ ایک گائے کی قربانی کریں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من الأنصار مجھول`;
abudawood.anwaar = [73,1];