var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ مَالِكٍ الْجَزَرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ فِي هَذِهِ الْقِصَّةِ زَادَ أَيُّ ذَلِكَ فَعَلْتَ أَجْزَأَ عَنْكَ";
abudawood.urdu = "سیدنا کعب بن عجرہ رضی اللہ عنہ سے اس قصے میں مروی ہے کہ (آپ ﷺ نے فرمایا) ’’ان (تین کاموں) میں سے جو بھی کرو گے تم سے کفایت کرے گا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `وھو فی الموطأ (1/417)`;