var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ حَجَّاجٍ الصَّوَّافِ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ قَالَ سَمِعْتُ الْحَجَّاجَ بْنَ عَمْرٍو الْأَنْصَارِيَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كُسِرَ أَوْ عَرِجَ فَقَدْ حَلَّ وَعَلَيْهِ الْحَجُّ مِنْ قَابِلٍ قَالَ عِكْرِمَةُ سَأَلْتُ ابْنَ عَبَّاسٍ وَأَبَا هُرَيْرَةَ عَنْ ذَلِكَ فَقَالَا صَدَقَ";
abudawood.urdu = "سیدنا حجاج بن عمرو انصاری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس کی ہڈی ٹوٹ جائے یا لنگڑا ہو جائے تو وہ حلال ہو گیا۔(یعنی اس کے لیے حلال ہو جانا مباح ہے) اور آئندہ کے لیے اس پر حج ہے۔‘‘ جناب عکرمہ کہتے ہیں میں نے سیدنا ابن عباس رضی اللہ عنہما اور ابوہریرہ رضی اللہ عنہ سے اس بارے میں پوچھا،ان دونوں نے (حجاج کی روایت کی) تصدیق کی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2713)
یحیی بن أبي کثیر صرح بالسماع عند ابن ماجہ (3077 وسندہ صحیح)`;