var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ وَسَلَمَةُ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ عَنْ الْحَجَّاجِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كُسِرَ أَوْ عَرِجَ أَوْ مَرِضَ فَذَكَرَ مَعْنَاهُ قَالَ سَلَمَةُ بْنُ شَبِيبٍ قَالَ أَنْبَأَنَا مَعْمَرٌ";
abudawood.urdu = "سیدنا حجاج بن عمرو نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس کی ہڈی ٹوٹ جائے یا وہ لنگڑا ہو جائے یا بیمار پڑ جائے۔‘‘ اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔(امام ابوداؤد رحمہ اللہ کے شیخ) جناب سلمہ بن شبیب نے اپنی سند میں «أنبأنا» (یعنی ہم کو خبر دی) کا کلمہ استعمال کیا۔(اس طرح انہوں نے اپنے شیخ سے سماع کی تصریح کر دی۔)";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2713)
انظر الحدیث السابق (1862) فھو شاھد لہ`;