var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ كَانَ إِذَا قَدِمَ مَكَّةَ بَاتَ بِذِي طَوًى حَتَّى يُصْبِحَ وَيَغْتَسِلَ ثُمَّ يَدْخُلَ مَكَّةَ نَهَارًا وَيَذْكُرُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَعَلَهُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ وہ جب بھی مکہ آتے تو وادی ذی طویٰ میں رات گزارتے حتیٰ کہ صبح ہو جاتی اور غسل کرتے۔پھر دن چڑھے مکہ میں داخل ہوتے۔اور نبی کریم ﷺ کے متعلق بیان کرتے کہ آپ ﷺ نے ایسے ہی کیا تھا۔";
abudawood.hukam = "صحیح بخاری (1553، 1573) صحیح مسلم (1259)";
abudawood.description = ``;