var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ مِنْ طَرِيقِ الشَّجَرَةِ وَيَدْخُلُ مِنْ طَرِيقِ الْمُعَرَّسِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ (مدینہ منورہ سے) نکلتے ہوئے شجرہ والی راہ اختیار فرماتے۔(یعنی ذوالحلیفہ والی،جہاں اس زمانے میں ایک درخت بھی تھا۔) اور واپسی میں معرس والی جانب سے داخل ہوتے۔(یعنی مدینہ میں)۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ أحمد (2/142 وسندہ صحیح) وانظر الحدیث السابق (1866)`;