var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ مَكَّةَ دَخَلَ مِنْ أَعْلَاهَا وَخَرَجَ مِنْ أَسْفَلِهَا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ جب مکہ میں داخل ہوتے تو اس کی بالائی جانب سے تشریف لاتے۔(اسی راستے میں مکہ کا معروف قبرستان ہے اور اس طرف سے آنے میں آپ ﷺ کو آسانی تھی اور واپسی کے لیے) زیریں جانب سے نکلتے تھے۔(اور یہی وہ راہ ہے جس میں آج کل مقام ’’جرول‘‘ آتا ہے)۔";
abudawood.hukam = "صحیح بخاری (1577) صحیح مسلم (1258)";
abudawood.description = ``;