var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا مَالِكٌ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَطَاءِ بْنِ يَسَارٍ عَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ كَتِفَ شَاةٍ،ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے (ایک بار) بکری کا گوشت تناول فرمایا اور وہ دستی (شانے) کا گوشت تھا،پھر نماز پڑھی اور وضو نہیں کیا۔";
abudawood.hukam = "صحیح بخاری (207) صحیح مسلم (354)";
abudawood.description = ``;