var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا سَلَّامُ بْنُ مِسْكِينٍ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ الْأَنْصَارِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا دَخَلَ مَكَّةَ طَافَ بِالْبَيْتِ وَصَلَّى رَكْعَتَيْنِ خَلْفَ الْمَقَامِ يَعْنِي يَوْمَ الْفَتْحِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ جب مکہ میں داخل ہوئے تو بیت اللہ کا طواف کیا اور مقام ابراہیم کے پیچھے دو رکعتیں پڑھیں،یعنی فتح مکہ والے دن۔";
abudawood.hukam = "إسنادہ صحیح، صحیح مسلم (1780)";
abudawood.description = ``;