var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَابِسِ بْنِ رَبِيعَةَ عَنْ عُمَرَ أَنَّهُ جَاءَ إِلَى الْحَجَرِ فَقَبَّلَهُ فَقَالَ إِنِّي أَعْلَمُ أَنَّكَ حَجَرٌ لَا تَنْفَعُ وَلَا تَضُرُّ وَلَوْلَا أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ مَا قَبَّلْتُكَ";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ سے مروی ہے کہ وہ حجر اسود کے پاس آئے اور اس کو بوسہ دیا،پھر کہا: بلاشبہ میں جانتا ہوں کہ تو محض ایک پتھر ہی ہے،نفع دے سکتا ہے نہ نقصان اگر میں نے رسول اللہ ﷺ کو نہ دیکھا ہوتا کہ انہوں نے تجھے بوسہ دیا تھا تو میں تجھے بوسہ نہ دیتا۔";
abudawood.hukam = "صحیح بخاری (1597) صحیح مسلم (1270)";
abudawood.description = ``;