var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ لَمْ أَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ مِنْ الْبَيْتِ إِلَّا الرُّكْنَيْنِ الْيَمَانِيَّيْنِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا آپ ﷺ بیت اللہ کے صرف دو یمانی ارکان ہی کو ہاتھ لگاتے تھے۔";
abudawood.hukam = "صحیح بخاری (1609) صحیح مسلم (1267)";
abudawood.description = ``;