var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدَعُ أَنْ يَسْتَلِمَ الرُّكْنَ الْيَمَانِيَ وَالْحَجَرَ فِي كُلِّ طَوْفَةٍ قَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَفْعَلُهُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ طواف کے کسی چکر میں بھی رکن یمانی اور حجر اسود کا استلام (یعنی اسے مس کرنا) نہ چھوڑتے تھے۔(نافع نے) کہا: اور سیدنا عبداللہ بن عمر رضی اللہ عنہما بھی ایسے ہی کیا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (2950 وسندہ حسن)`;