var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ يَعْنِي ابْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے حجۃ الوداع میں اونٹ پر سوار ہو کر طواف کیا۔آپ ﷺ اپنے عصا سے رکن (حجر اسود) کو مس کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (1607) صحیح مسلم (1272)";
abudawood.description = ``;