var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ مَكَّةَ وَهُوَ يَشْتَكِي فَطَافَ عَلَى رَاحِلَتِهِ كُلَّمَا أَتَى عَلَى الرُّكْنِ اسْتَلَمَ الرُّكْنَ بِمِحْجَنٍ فَلَمَّا فَرَغَ مِنْ طَوَافِهِ أَنَاخَ فَصَلَّى رَكْعَتَيْنِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ مکہ مکرمہ تشریف لائے تو آپ ﷺ کی طبیعت ناساز تھی چنانچہ آپ ﷺ نے اپنی سواری پر (سوار ہو کر) طواف کیا۔آپ ﷺ جب بھی حجر اسود کے پاس آتے تو اپنے عصا سے اس کو مس کرتے۔پس جب آپ ﷺ اپنے طواف سے فارغ ہو گئے تو آپ ﷺ نے (اپنی اونٹنی کو) بٹھا دیا اور دو رکعتیں ادا کیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یزید ضعیف`;
abudawood.anwaar = [73,1];