var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ يَعْلَى عَنْ يَعْلَى قَالَ طَافَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُضْطَبِعًا بِبُرْدٍ أَخْضَرَ";
abudawood.urdu = "سیدنا یعلیٰ بن امیہ رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ نے طواف کیا جبکہ آپ ﷺ اضطباع کیے ہوئے تھے اور چادر سبز رنگ کی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (859) ابن ماجہ (2954)<br>ابن جریج وسفیان الثوري مدلسان وعنعنا`;
abudawood.anwaar = [73,1];