var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا جُعِلَ الطَّوَافُ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ وَرَمْيُ الْجِمَارِ لِإِقَامَةِ ذِكْرِ اللَّهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’بیت اللہ کا طواف،صفا مروہ کی سعی اور جمرات کو کنکریاں مارنا،یہ سب اللہ کا ذکر قائم کرنے کے لیے ہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (902 وسندہ حسن) وصححہ ابن خزیمۃ (2882، 2970 وسندھما حسن)`;