var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو الْأَحْوَصِ،حَدَّثَنَا سِمَاكٌ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ: أَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتِفًا،ثُمَّ مَسَحَ يَدَهُ بِمِسْحٍ كَانَ تَحْتَهُ،ثُمَّ قَامَ فَصَلَّى.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ نے دستی کا گوشت تناول فرمایا اور اپنے ہاتھ نیچے بچھی دری (یا ٹاٹ) سے صاف کیے،پھر نماز پڑھنے کھڑے ہو گئے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (488)<br>سماک ضعیف عن عکرمۃ وصحیح الحدیث عن غیرہ (تقدم: 68)<br>ولأصل الحدیث شواھد`;
abudawood.anwaar = [20,1];