var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ أَبِي الطُّفَيْلِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ اعْتَمَرُوا مِنْ الْجِعْرَانَةِ فَرَمَلُوا بِالْبَيْتِ ثَلَاثًا وَمَشَوْا أَرْبَعًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ اور آپ ﷺ کے صحابہ نے جعرانہ سے عمرہ کیا تو انہوں نے بیت اللہ میں رمل کیا اور (آخری) چار چکروں میں عام رفتار سے چلے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `رواہ ابن ماجہ (2953 وسندہ حسن) وانظر الحدیث السابق (1884)`;