var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا سُلَيْمُ بْنُ أَخْضَرَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ رَمَلَ مِنْ الْحَجَرِ إِلَى الْحَجَرِ وَذَكَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ ذَلِكَ";
abudawood.urdu = "نافع بیان کرتے ہیں کہ سیدنا ابن عمر رضی اللہ عنہما نے حجر اسود سے حجر اسود تک رمل کیا۔(یعنی پورے چکر میں) اور ذکر کیا کہ رسول اللہ ﷺ نے یہ عمل کیا تھا۔";
abudawood.hukam = "صحیح مسلم (1262)";
abudawood.description = ``;