var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ يَحْيَى بْنِ عُبَيْدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا بَيْنَ الرُّكْنَيْنِ قرآن رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ /قرآن";
abudawood.urdu = "سیدنا عبداللہ بن سائب رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو سنا آپ ﷺ رکن یمانی اور حجر اسود کے مابین یہ دعا پڑھ رہے تھے <قرآن> «ربنا آتنا فی الدنیا حسنۃ وفی الآخرۃ حسنۃ وقنا عذاب النار» </قرآن> ’’اے ہمارے رب ہمیں دنیا میں خیر و بھلائی عنایت فرما اور آخرت میں بھی خیر و بھلائی دے اور ہمیں آگ کے عذاب سے محفوظ رکھ‘‘۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2581)
أخرجہ أحمد (3/411) والنسائي فی الکبریٰ (3943) وصححہ ابن خزیمۃ (2721 وسندہ حسن) ابن جریج صرح بالسماع`;