var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا طَافَ فِي الْحَجِّ وَالْعُمْرَةِ أَوَّلَ مَا يَقْدَمُ فَإِنَّهُ يَسْعَى ثَلَاثَةَ أَطْوَافٍ وَيَمْشِي أَرْبَعًا ثُمَّ يُصَلِّي سَجْدَتَيْنِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ حج اور عمرہ میں (مکہ میں) آتے ہی جو پہلا طواف (طواف قدوم) کرتے تو اس کے تین چکروں میں (آہستہ آہستہ) دوڑتے اور چار میں عام رفتار سے چلتے،پھر دو رکعتیں ادا کرتے۔";
abudawood.hukam = "صحیح بخاری (1616) صحیح مسلم (1261)";
abudawood.description = ``;