var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ لَمْ يَطُفْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا أَصْحَابُهُ بَيْنَ الصَّفَا وَالْمَرْوَةِ إِلَّا طَوَافًا وَاحِدًا طَوَافَهُ الْأَوَّلَ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ اور آپ ﷺ کے صحابہ نے صفا اور مروہ کے مابین ایک ہی بار سعی کی تھی۔یعنی پہلی بار طواف قدوم یا طواف عمرہ کے ساتھ۔";
abudawood.hukam = "صحیح مسلم (1215)";
abudawood.description = ``;