var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِينَ كَانُوا مَعَهُ لَمْ يَطُوفُوا حَتَّى رَمَوْا الْجَمْرَةَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ اصحاب رسول اللہ ﷺ جو آپ ﷺ کے ساتھ تھے انہوں نے جمرہ کو کنکریاں مارنے کے بعد ہی طواف کیا تھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1781)`;