var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ،حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْتَهَشَ مِنْ كَتِفٍ،ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہا سے منقول ہے کہ نبی کریم ﷺ نے دستی کا گوشت دانتوں سے نوچ کر کھایا،پھر نماز پڑھی اور وضو نہیں کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شواھد کثیرۃ عند البخاری: 3340 و مسلم: 194 وغیرھما`;