var abudawood = {};
abudawood.arabic = "حَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ أَخْبَرَنَا إِسْحَقُ بْنُ يُوسُفَ أَخْبَرَنَا شَرِيكٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى بِهَذَا الْحَدِيثِ زَادَ ثُمَّ أَتَى الصَّفَا وَالْمَرْوَةَ فَسَعَى بَيْنَهُمَا سَبْعًا ثُمَّ حَلَقَ رَأْسَهُ";
abudawood.urdu = "اسمعیل بن ابی خالد کہتے ہیں میں نے سیدنا عبداللہ بن ابی اوفی رضی اللہ عنہ سے یہ حدیث سنی۔اور یہ مزید کہا: پھر آپ صفا مروہ کی طرف آئے اور ان کے درمیان سات چکر لگائے پھر اپنا سر منڈایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شریک القاضي عنعن وتفرد بقولہ ’’ ثم حلق رأسہ ‘‘ وباقی الحدیث صحیح`;
abudawood.anwaar = [74,1];