var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْأَحْوَصُ بْنُ جَوَّابٍ الضَّبِّىُّ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ يَوْمَ التَّرْوِيَةِ وَالْفَجْرَ يَوْمَ عَرَفَةَ بِمِنًى";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے ترویہ کے روز (یعنی آٹھویں ذی الحجہ کو) ظہر کی نماز اور عرفہ کے روز (نویں ذی الحجہ کو) فجر کی نماز منیٰ میں پڑھی تھی۔";
abudawood.hukam = "حسن";
abudawood.description = `ولہ شواھد عند ابن ماجہ (3005 وسندہ حسن) وانظر الحدیث الآتي (1913)`;