var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ عَنْ ابْنِ أَبِي زَائِدَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ رَجُلٍ مِنْ بَنِي ضَمْرَةَ عَنْ أَبِيهِ أَوْ عَمِّهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ بِعَرَفَةَ";
abudawood.urdu = "بنی ضمرہ کا ایک شخص اپنے والد یا چچا سے بیان کرتا ہے کہ میں نے رسول اللہ ﷺ کو عرفات کے روز منبر پر دیکھا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من بني ضمرۃ لم أعرفہ`;
abudawood.anwaar = [74,1];