var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ رَجُلٍ مِنْ الْحَيِّ عَنْ أَبِيهِ نُبَيْطٍ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا بِعَرَفَةَ عَلَى بَعِيرٍ أَحْمَرَ يَخْطُبُ";
abudawood.urdu = "سلمہ بن نبیط اپنے قبیلہ کے ایک شخص سے وہ اس کے والد نبیط رضی اللہ عنہ سے روایت کرتا ہے کہ اس نے نبی کریم ﷺ کو عرفات میں وقوف کیے ہوئے دیکھا۔آپ ﷺ سرخ اونٹ پر خطبہ دے رہے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3010) ابن ماجہ (1286)<br>رجل من الحي مجھول<br>والحدیث الآتي (الأصل : 1917) یغني عنہ`;
abudawood.anwaar = [74,1];