var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ سَهْلٍ أَبُو عِمْرَانَ الرَّمْلِيُّ،حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ،حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرٍ،قَالَ: كَانَ آخِرَ الْأَمْرَيْنِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: َرْكُ الْوُضُوءِ مِمَّا غَيَّرَتِ النَّارُ. قَالَ أَبُو دَاوُد: هَذَا اخْتِصَارٌ مِنَ الْحَدِيثِ الْأَوَّلِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ کا آخری عمل یہ تھا کہ آپ ﷺ نے آگ پر پکی چیزوں کے استعمال سے وضو کرنا چھوڑ دیا تھا۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ یہ روایت پہلی حدیث کا اختصار ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وصححہ ابن خزیمۃ (43) وذکر الشافعي لہ علۃ – إن صحۃ – فالحدیث حسن، وانظر أنوار السنن (168)`;