var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ عُقْبَةَ عَنْ كُرَيْبٍ مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أُسَامَةَ قَالَ كُنْتُ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا وَقَعَتْ الشَّمْسُ دَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "سیدنا اسامہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نبی کریم ﷺ کے پیچھے سوار تھا،جب سورج غروب ہو گیا تو رسول اللہ ﷺ وہاں سے روانہ ہوئے (یعنی عرفات سے)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;