var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ بِإِسْنَادِهِ وَمَعْنَاهُ وَقَالَ بِإِقَامَةٍ إِقَامَةِ جَمْعٍ بَيْنَهُمَا قَالَ أَحْمَدُ قَالَ وَكِيعٌ صَلَّى كُلَّ صَلَاةٍ بِإِقَامَةٍ";
abudawood.urdu = "زہری رحمہ اللہ نے اپنی سند سے مذکورہ بالا حدیث کے ہم معنی روایت کی اور کہا ایک ایک اقامت سے ان دونوں نمازوں کو جمع کیا۔امام احمد رحمہ اللہ نے کہا: وکیع نے بیان کیا کہ آپ نے ہر نماز (الگ) اقامت سے پڑھی۔";
abudawood.hukam = "صحیح بخاری (1673)";
abudawood.description = ``;