var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ قَالَ صَلَّيْتُ مَعَ ابْنِ عُمَرَ الْمَغْرِبَ ثَلَاثًا وَالْعِشَاءَ رَكْعَتَيْنِ فَقَالَ لَهُ مَالِكُ بْنُ الْحَارِثِ مَا هَذِهِ الصَّلَاةُ قَالَ صَلَّيْتُهُمَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَكَانِ بِإِقَامَةٍ وَاحِدَةٍ";
abudawood.urdu = "عبداللہ بن مالک (بن حارث) بیان کرتے ہیں کہ میں نے سیدنا عبداللہ بن عمر رضی اللہ عنہما کے ساتھ نماز پڑھی۔مغرب کی تین اور عشاء کی دو رکعتیں۔مالک بن حارث نے ان سے کہا: یہ کس طرح کی نماز ہے؟ انہوں نے کہا: میں نے ان کو رسول اللہ ﷺ کے ساتھ اس جگہ ایک ہی تکبیر کے ساتھ پڑھا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (887)<br>أبو إسحاق مدلس وعنعن<br>والحدیث السابق (الأصل: 1927) یغني عنہ<br>وانظر الحدیث الآتي (الأصل : 1930)`;
abudawood.anwaar = [74,1];