var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا إِسْحَقُ يَعْنِي ابْنَ يُوسُفَ عَنْ شَرِيكٍ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ وَعَبْدِ اللَّهِ بْنِ مَالِكٍ قَالَا صَلَّيْنَا مَعَ ابْنِ عُمَرَ بِالْمُزْدَلِفَةِ الْمَغْرِبَ وَالْعِشَاءَ بِإِقَامَةٍ وَاحِدَةٍ فَذَكَرَ مَعْنَى حَدِيثِ ابْنِ كَثِيرٍ";
abudawood.urdu = "سعید بن جبیر اور عبداللہ بن مالک دونوں سے روایت ہے کہ ہم نے ابن عمر رضی اللہ عنہما سے ساتھ مزدلفہ میں مغرب اور عشاء کی نمازیں ایک تکبیر کے ساتھ پڑھیں۔اور محمد بن کثیر کی روایت کے ہم معنی بیان کیا۔";
abudawood.hukam = "صحیح مسلم (1288)";
abudawood.description = ``;