var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ عَنْ زَيْدِ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيٍّ قَالَ فَلَمَّا أَصْبَحَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَقَفَ عَلَى قُزَحَ فَقَالَ هَذَا قُزَحُ وَهُوَ الْمَوْقِفُ وَجَمْعٌ كُلُّهَا مَوْقِفٌ وَنَحَرْتُ هَا هُنَا وَمِنًى كُلُّهَا مَنْحَرٌ فَانْحَرُوا فِي رِحَالِكُمْ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ بیان کرتے ہیں کہ (مزدلفہ میں) جب نبی کریم ﷺ نے صبح کی اور جبل قزح پر وقوف کیا تو فرمایا ’’یہ قزح ہے اور جائے وقوف ہے۔اور مزدلفہ سارا ہی جائے وقوف ہے۔میں نے اس جگہ قربانی کی ہے اور منیٰ سب ہی قربان گاہ ہے۔سو اپنے اپنے پڑاؤ پر قربانیاں کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (885) ابن ماجہ (3010)<br>سفیان الثوري عنعن<br>وانظر الحدیث السابق : 1922`;
abudawood.anwaar = [75,1];