var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عَطَاءٍ قَالَ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ عَرَفَةَ مَوْقِفٌ وَكُلُّ مِنًى مَنْحَرٌ وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ وَكُلُّ فِجَاجِ مَكَّةَ طَرِيقٌ وَمَنْحَرٌ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’عرفات سارا ہی مقام وقوف ہے اور منٰی سارا ہی قربان گاہ ہے اور مزدلفہ پورا ہی وقوف کی جگہ ہے۔اور مکہ کے سب راستے (یہاں آنے کی) راہ ہیں اور قربان گاہ بھی۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2596)
أخرجہ ابن ماجہ (3048 وسندہ حسن)`;