var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ كَانَ أَهْلُ الْجَاهِلِيَّةِ لَا يُفِيضُونَ حَتَّى يَرَوْا الشَّمْسَ عَلَى ثَبِيرٍ فَخَالَفَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَ قَبْلَ طُلُوعِ الشَّمْسِ";
abudawood.urdu = "عمر بن خطاب رضی اللہ عنہ نے بیان کیا کہ اہل جاہلیت (مزدلفہ سے) اس وقت تک روانہ نہیں ہوتے تھے جب تک کہ کوہ ثبیر پر سورج کو (طلوع ہوتا) نہ دیکھ لیتے۔سو نبی کریم ﷺ نے ان کی مخالفت کی اور طلوع آفتاب سے پہلے ہی وہاں سے روانہ ہو لیے۔";
abudawood.hukam = "صحیح بخاری (3838)";
abudawood.description = ``;