var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُ أَنَا مِمَّنْ قَدَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْمُزْدَلِفَةِ فِي ضَعْفَةِ أَهْلِهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ میں رسول اللہ ﷺ کے اہل کے ان ضعیف افراد میں شامل تھا جن کو آپ ﷺ نے مزدلفہ کی رات قبل از وقت روانہ فرما دیا تھا۔";
abudawood.hukam = "صحیح بخاری (1678) صحیح مسلم (1293)";
abudawood.description = ``;