var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْوَلِيدُ بْنُ عُقْبَةَ حَدَّثَنَا حَمْزَةُ الزَّيَّاتُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَدِّمُ ضُعَفَاءَ أَهْلِهِ بِغَلَسٍ وَيَأْمُرُهُمْ يَعْنِي لَا يَرْمُونَ الْجَمْرَةَ حَتَّى تَطْلُعَ الشَّمْسُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ اپنے اہل کے ضعیف افراد کو اندھیرے ہی میں آگے روانہ فرما دیا کرتے تھے۔اور انہیں حکم دیتے تھے کہ سورج طلوع ہونے تک جمرہ کو کنکریاں نہ ماریں۔";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شواھد حسن عند الطحاوي في مشکل الآثار (9/119 ح 3494 وسندہ حسن) والبخاري (1678) وغیرھما`;