var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ أَخْبَرَنِي مُخْبِرٌ عَنْ أَسْمَاءَ أَنَّهَا رَمَتْ الْجَمْرَةَ قُلْتُ إِنَّا رَمَيْنَا الْجَمْرَةَ بِلَيْلٍ قَالَتْ إِنَّا كُنَّا نَصْنَعُ هَذَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "ایک خبر دینے والے نے بیان کیا کہ سیدہ اسماء (بنت ابی بکر) رضی اللہ عنہا نے جمرہ کی رمی کی تو میں نے کہا: ہم نے تو رات میں رمی کی ہے۔(کنکریاں ماری ہیں) انہوں نے جواب دیا کہ رسول اللہ ﷺ کے زمانے میں ہم یہی کیا کرتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `المخبر ومولی أسماء: عبد اللہ بن کیسان التیمي`;