var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ السَّكِينَةُ وَأَمَرَهُمْ أَنْ يَرْمُوا بِمِثْلِ حَصَى الْخَذْفِ وَأَوْضَعَ فِي وَادِي مُحَسِّرٍ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ (مزدلفہ سے) روانہ ہوئے اور بڑے سکون اور آرام سے چلے۔اور لوگوں کو حکم دیا کہ چھوٹی چھوٹی کنکریاں ماریں (مگر) وادی محسر میں سے تیزی سے نکلے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2611)
رواہ مسلم (1299 مختصرًا جدًا) وللحدیث شواھد صحیحۃ ما رواہ النسائي (3023)`;