var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا هِشَامٌ يَعْنِي ابْنَ الْغَازِ حَدَّثَنَا نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَفَ يَوْمَ النَّحْرِ بَيْنَ الْجَمَرَاتِ فِي الْحَجَّةِ الَّتِي حَجَّ فَقَالَ أَيُّ يَوْمٍ هَذَا قَالُوا يَوْمُ النَّحْرِ قَالَ هَذَا يَوْمُ الْحَجِّ الْأَكْبَرِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ اپنے حج میں قربانی والے دن جمرات کے درمیان کھڑے ہوئے اور پوچھا ’’یہ کون سا دن ہے؟‘‘ لوگوں نے کہا: یہ قربانی کا دن ہے۔آپ ﷺ نے فرمایا ’’یہ حج اکبر کا دن ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;