var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ إِبْرَاهِيمَ بْنِ نَافِعٍ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ أَبِيهِ عَنْ رَجُلَيْنِ مِنْ بَنِي بَكْرٍ قَالَا رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بَيْنَ أَوْسَطِ أَيَّامِ التَّشْرِيقِ وَنَحْنُ عِنْدَ رَاحِلَتِهِ وَهِيَ خُطْبَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّتِي خَطَبَ بِمِنًى";
abudawood.urdu = "ابن ابی نجیح اپنے والد سے،وہ بنو بکر کے دو آدمیوں سے روایت کرتے ہیں انہوں نے بیان کیا کہ ہم نے رسول اللہ ﷺ کو ایام تشریق کے درمیانی دن میں خطبہ دیتے ہوئے دیکھا۔ہم آپ ﷺ کی سواری کے قریب ہی تھے اور یہ رسول اللہ ﷺ کا وہ خطبہ تھا جو آپ ﷺ نے منٰی میں ارشاد فرمایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن أبي نجیح مدلس وعنعن`;
abudawood.anwaar = [75,1];