var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا عِكْرِمَةُ حَدَّثَنِي الْهِرْمَاسُ بْنُ زِيَادٍ الْبَاهِلِيُّ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ عَلَى نَاقَتِهِ الْعَضْبَاءِ يَوْمَ الْأَضْحَى بِمِنًى";
abudawood.urdu = "سیدنا ہرماس بن زیاد باہلی رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ منٰی میں قربانی والے دن اپنی عضباء اونٹنی پر لوگوں کو خطبہ دے رہے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `صححہ ابن خزیمۃ (2953 وسندہ حسن)`;