var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلٌ يَعْنِي ابْنَ الْفَضْلِ الْحَرَّانِيَّ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا ابْنُ جَابِرٍ حَدَّثَنَا سُلَيْمُ بْنُ عَامِرٍ الْكَلَاعِيُّ سَمِعْتُ أَبَا أُمَامَةَ يَقُولُ سَمِعْتُ خُطْبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى يَوْمَ النَّحْرِ";
abudawood.urdu = "سیدنا ابوامامہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے منٰی میں قربانی والے دن رسول اللہ ﷺ کا خطبہ سنا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أصلہ عند الترمذي (616 وسندہ حسن)`;