var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الرَّحِيمِ الدِّمَشْقِيُّ حَدَّثَنَا مَرْوَانُ عَنْ هِلَالِ بْنِ عَامِرٍ الْمُزْنِيِّ حَدَّثَنِي رَافِعُ بْنُ عَمْرٍو الْمُزْنِيُّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ بِمِنًى حِينَ ارْتَفَعَ الضُّحَى عَلَى بَغْلَةٍ شَهْبَاءَ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يُعَبِّرُ عَنْهُ وَالنَّاسُ بَيْنَ قَاعِدٍ وَقَائِمٍ";
abudawood.urdu = "جناب رافع بن عمرو مزنی رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ منٰی میں اپنے سفید خچر پر لوگوں کو خطبہ دے رہے تھے جبکہ دن اونچا آ چکا تھا اور سیدنا علی رضی اللہ عنہ آپ ﷺ کی بات آگے پہنچا رہے تھے۔لوگ کچھ بیٹھے تھے اور کچھ کھڑے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2671)
مروان بن معاویۃ الفزاري صرح بالسماع عند النسائي فی الکبریٰ (4096) وتابعہ یعلٰی بن عبید، انظر الحدیث الآتي (4073)`;