var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي حَرِيزٌ أَوْ أَبُو حَرِيزٍ الشَّكّ مِنْ يَحْيَى أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ فَرُّوخٍ يَسْأَلُ ابْنَ عُمَرَ قَالَ إِنَّا نَتَبَايَعُ بِأَمْوَالِ النَّاسِ فَيَأْتِي أَحَدُنَا مَكَّةَ فَيَبِيتُ عَلَى الْمَالِ فَقَالَ أَمَّا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَاتَ بِمِنًى وَظَلَّ";
abudawood.urdu = "عبدالرحمٰن بن فروخ نے سیدنا ابن عمر رضی اللہ عنہما سے پوچھا کہ ہم لوگوں کے ساتھ خرید و فروخت کرتے ہیں،تو ہم میں سے کوئی مکہ بھی آ جاتا ہے اور اپنے مال کے ساتھ رات گزارتا ہے تو انہوں نے جواب دیا کہ رسول اللہ ﷺ نے تو راتیں منٰی میں گزاری تھیں اور دن بھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حریز أو أبو حریز : مجہول (تق : 1185)`;
abudawood.anwaar = [75,1];