var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ اسْتَأْذَنَ الْعَبَّاسُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيتَ بِمَكَّةَ لَيَالِيَ مِنًى مِنْ أَجْلِ سِقَايَتِهِ فَأَذِنَ لَهُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ سیدنا عباس رضی اللہ عنہ نے رسول اللہ ﷺ سے اجازت طلب کی تھی کہ لوگوں کو پانی پلانے کی غرض سے منٰی کی راتیں مکہ میں گزار لیں تو آپ ﷺ نے ان کو اجازت دے دی تھی۔";
abudawood.hukam = "صحیح بخاری (1745) صحیح مسلم (1315)";
abudawood.description = ``;