var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ عُقَيْلٍ عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا،فَدَعَا بِمَاءٍ فَتَمَضْمَضَ،ثُمَّ قَالَ: إِنَّ لَهُ دَسَمًا";
abudawood.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما راوی ہیں کہ نبی کریم ﷺ نے (ایک بار) دودھ نوش فرمایا،پھر پانی طلب کیا اور کلی کی اور فرمایا ’’اس میں چکنائی ہوتی ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (211) صحیح مسلم (358)";
abudawood.description = ``;