var abudawood = {};
abudawood.arabic = "رٌّ حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ أَنَّ عُثْمَانَ إِنَّمَا صَلَّى بِمِنًى أَرْبَعًا لِأَنَّهُ أَجْمَعَ عَلَى الْإِقَامَةِ بَعْدَ الْحَجِّ";
abudawood.urdu = "امام زہری رحمہ اللہ سے مروی ہے کہ سیدنا عثمان نے منٰی میں چار رکعات اس لیے پڑھی تھیں کہ انہوں نے حج کے بعد وہیں اقامت کا عزم کر لیا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الزھري لم یدرک عثمان رضي اللّٰہ عنہ (اتحاف المھرۃ 81/11)`;
abudawood.anwaar = [75,1];