var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ الْمُغِيرَةِ عَنْ إِبْرَاهِيمَ قَالَ إِنَّ عُثْمَانَ صَلَّى أَرْبَعًا لِأَنَّهُ اتَّخَذَهَا وَطَنًا";
abudawood.urdu = "جناب ابراہیم نخعی رحمہ اللہ سے مروی ہے کہ سیدنا عثمان رضی اللہ عنہ کے چار رکعت پڑھنے کہ وجہ یہ تھی کہ انہوں نے اسے وطن بنا لیا تھا۔(یہاں انہوں نے شادی کر لی تھی۔)";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>إبراہیم النخعي لم یدرک عثمان رضي اللّٰہ عنہ،ولد سنۃ 46ھـ بعد شہادۃ عثمان رضي اللّٰہ عنہ`;
abudawood.anwaar = [75,1];