var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ لَمَّا اتَّخَذَ عُثْمَانُ الْأَمْوَالَ بِالطَّائِفِ وَأَرَادَ أَنْ يُقِيمَ بِهَا صَلَّى أَرْبَعًا قَالَ ثُمَّ أَخَذَ بِهِ الْأَئِمَّةُ بَعْدَهُ";
abudawood.urdu = "امام زہری رحمہ اللہ سے منقول ہے کہ سیدنا عثمان رضی اللہ عنہ نے جب طائف میں اپنی جائیداد لے لی اور یہاں اقامت کا ارادہ کر لیا تو چار رکعتیں پڑھیں۔ان کے بعد دیگر ائمہ (بنی امیہ) نے یہی عمل اختیار کر لیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث المتقدم (1961)`;
abudawood.anwaar = [75,1];