var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ الزُّهْرِيِّ أَنَّ عُثْمَانَ بْنَ عَفَّانَ أَتَمَّ الصَّلَاةَ بِمِنًى مِنْ أَجْلِ الْأَعْرَابِ لِأَنَّهُمْ كَثُرُوا عَامَئِذٍ فَصَلَّى بِالنَّاسِ أَرْبَعًا لِيُعَلِّمَهُمْ أَنَّ الصَّلَاةَ أَرْبَعٌ";
abudawood.urdu = "امام زہری رحمہ اللہ سے روایت ہے کہ سیدنا عثمان رضی اللہ عنہ نے منٰی میں بدوی لوگوں کی وجہ سے پوری نماز پڑھی تھی کیونکہ وہ اس سال بہت کثیر تعداد میں آئے تھے تو انہوں نے لوگوں کو چار رکعتیں پڑھائیں تاکہ ان بدویوں کو معلوم رہے کہ نماز چار رکعات ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیثین السابقین (1961 و 1962)`;
abudawood.anwaar = [75,1];