var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو ثَوْرٍ إِبْرَاهِيمُ بْنُ خَالِدٍ وَوَهْبُ بْنُ بَيَانٍ قَالَا حَدَّثَنَا عُبَيْدَةُ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ جَمْرَةِ الْعَقَبَةِ رَاكِبًا وَرَأَيْتُ بَيْنَ أَصَابِعِهِ حَجَرًا فَرَمَى وَرَمَى النَّاسُ";
abudawood.urdu = "سلیمان بن عمرو بن الاحوص کی والدہ کا بیان ہے کہ میں نے رسول اللہ ﷺ کو جمرہ عقبہ کے پاس دیکھا۔آپ ﷺ سواری پر تھے۔میں نے آپ ﷺ کی انگلیوں میں کنکریاں دیکھیں۔آپ ﷺ نے وہ ماریں تو پھر اور لوگوں نے بھی ماریں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1966)`;
abudawood.anwaar = [76,1];