var abudawood = {};
abudawood.arabic = "حَدَّثَنَاالْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يَأْتِي الْجِمَارَ فِي الْأَيَّامِ الثَّلَاثَةِ بَعْدَ يَوْمِ النَّحْرِ مَاشِيًا ذَاهِبًا وَرَاجِعًا وَيُخْبِرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ";
abudawood.urdu = "نافع رحمہ اللہ نے سیدنا ابن عمر رضی اللہ عنہما کے متعلق بتایا کہ وہ قربانی کے دن (یعنی دس ذوالحجہ) کے بعد تین دنوں میں جمرات کے پاس پیدل ہی آتے جاتے تھے اور بیان کرتے تھے کہ نبی کریم ﷺ ایسے ہی کیا کرتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ البیھقي (5/131 وسندہ حسن)`;