var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،عَنْ زَيْدِ بْنِ الْحُبَابِ،عَنْ مُطِيعِ بْنِ رَاشِدٍ،عَنْ تَوْبَةَ الْعَنْبَرِيِّ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا،فَلَمْ يُمَضْمِضْ،وَلَمْ يَتَوَضَّأْ،وَصَلَّى. قَالَ: زَيْدٌ دَلَّنِي شُعْبَةُ عَلَى هَذَا الشَّيْخِ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ (ایک بار) رسول اللہ ﷺ نے دودھ پیا مگر (اس کے بعد) کلی کی نہ وضو کیا اور نماز پڑھ لی۔زید (زید بن حباب) کہتے ہیں کہ شعبہ نے مجھے اس شیخ (مطیع بن راشد) کی راہنمائی کی تھی (کہ اس سے حدیث حاصل کروں)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `وحسنہ الحافظ ابن حجر فی فتح الباری: 1/ 313`;