var abudawood = {};
abudawood.arabic = "حَدَّثَنَاأَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي عَلَى رَاحِلَتِهِ يَوْمَ النَّحْرِ يَقُولُ لِتَأْخُذُوا مَنَاسِكَكُمْ فَإِنِّي لَا أَدْرِي لَعَلِّي لَا أَحُجُّ بَعْدَ حَجَّتِي هَذِهِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں،میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ قربانی والے دن اپنی سواری پر سے کنکریاں مار رہے تھے اور فرماتے تھے ’’مجھ سے اپنے اعمال حج سیکھ لو،میں نہیں جانتا،شاید میں اپنے اس حج کے بعد حج نہ کر سکوں۔‘‘";
abudawood.hukam = "صحیح مسلم (1297)";
abudawood.description = ``;