var abudawood = {};
abudawood.arabic = "حَدَّثَنَاأَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي عَلَى رَاحِلَتِهِ يَوْمَ النَّحْرِ ضُحًى فَأَمَّا بَعْدَ ذَلِكَ فَبَعْدَ زَوَالِ الشَّمْسِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں،میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ قربانی والے دن چاشت کے وقت اپنی سواری پر سے رمی کر رہے تھے۔مگر اس کے بعد کے دنوں میں سورج ڈھلنے کے بعد کی۔";
abudawood.hukam = "صحیح مسلم (1299)";
abudawood.description = ``;