var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ مِسْعَرٍ عَنْ وَبَرَةَ قَالَ سَأَلْتُ ابْنَ عُمَرَ مَتَى أَرْمِي الْجِمَارَ قَالَ إِذَا رَمَى إِمَامُكَ فَارْمِ فَأَعَدْتُ عَلَيْهِ الْمَسْأَلَةَ فَقَالَ كُنَّا نَتَحَيَّنُ زَوَالَ الشَّمْسِ فَإِذَا زَالَتْ الشَّمْسُ رَمَيْنَا";
abudawood.urdu = "وبرہ(بن عبدالرحمٰن سلمی) کہتے ہیں،میں نے سیدنا ابن عمر رضی اللہ عنہما سے پوچھا کہ میں کس وقت جمرات کو کنکریاں ماروں؟ انہوں نے کہا: جب تمہارا امام مارے تم بھی مار لو۔میں نے اپنا سوال دہرایا تو بولے ہم سورج ڈھلنے کا انتظار کیا کرتے تھے۔جب سورج ڈھل جاتا تو رمی کرتے تھے( قربانی والے دن کے بعد کے ایام میں)";
abudawood.hukam = "صحیح بخاری (1746)";
abudawood.description = ``;