var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ وَمُحَمَّدُ ابْنَيْ أَبِي بَكْرٍ عَنْ أَبِيهِمَا عَنْ أَبِي الْبَدَّاحِ بْنِ عَدِيٍّ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرِّعَاءِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا";
abudawood.urdu = "ابوالبداح بن عدی اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے چرواہوں کو رخصت دی تھی کہ ایک دن رمی کریں اور ایک دن چھوڑ دیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1975)`;