var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَبَا مِجْلَزٍ يَقُولُ سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ شَيْءٍ مِنْ أَمْرِ الْجِمَارِ قَالَ مَا أَدْرِي أَرَمَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسِتٍّ أَوْ بِسَبْعٍ";
abudawood.urdu = "ابومجلز بیان کرتے ہیں کہ میں نے سیدنا ابن عباس رضی اللہ عنہما سے رمی جمار کے بارے میں پوچھا تھا تو انہوں نے کہا: مجھے معلوم نہیں کہ رسول اللہ ﷺ نے چھ کنکریاں ماری تھیں یا سات۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (3080 وسندہ صحیح)`;