var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنِ زِيَادٍ حَدَّثَنَا الْحَجَّاجُ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَمَى أَحَدُكُمْ جَمْرَةَ الْعَقَبَةِ فَقَدْ حَلَّ لَهُ كُلُّ شَيْءٍ إِلَّا النِّسَاءَ قَالَ أَبُو دَاوُد هَذَا حَدِيثٌ ضَعِيفٌ الْحَجَّاجُ لَمْ يَرَ الزُّهْرِيَّ وَلَمْ يَسْمَعْ مِنْهُ";
abudawood.urdu = "سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی (دسویں تاریخ کو) جمرہ عقبہ کی رمی کر لے تو اس کے لیے بیویوں کے سوا ہر شے حلال ہو گئی۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: یہ حدیث ضعیف ہے۔حجاج (حجاج بن ارطاۃ) نے زہری کو نہ دیکھا ہے اور نہ اس سے کچھ سنا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الحجاج بن أرطاۃ ضعیف مدلس`;
abudawood.anwaar = [76,1];