var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ الْعَتَكِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ بَلَغَنِي عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ بْنِ عُثْمَانَ قَالَتْ أَخْبَرَتْنِي أُمُّ عُثْمَانَ بِنْتُ أَبِي سُفْيَانَ أَنَّ ابْنَ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى النِّسَاءِ حَلْقٌ إِنَّمَا عَلَى النِّسَاءِ التَّقْصِيرُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’عورتوں کے لیے سر منڈانا نہیں ہے۔ان کے لیے صرف بال کترنا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2654)
انظر الحدیث الآتي (1985)`;