var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَمَرَ عُمْرَتَيْنِ عُمْرَةً فِي ذِي الْقِعْدَةِ وَعُمْرَةً فِي شَوَّالٍ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے دو عمرے کیے تھے ایک ذوالقعدہ میں اور ایک شوال میں۔";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ البیھقي في دلائل النبوۃ (5/455) وصححہ ابن الملقن في تحفۃ المحتاج (1058)`;