var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ مُجَاهِدٍ قَالَ سُئِلَ ابْنُ عُمَرَ كَمْ اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَرَّتَيْنِ فَقَالَتْ عَائِشَةُ لَقَدْ عَلِمَ ابْنُ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ اعْتَمَرَ ثَلَاثًا سِوَى الَّتِي قَرَنَهَا بِحَجَّةِ الْوَدَاعِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے پوچھا گیا کہ رسول اللہ ﷺ نے کتنے عمرے کیے؟ انہوں نے کہا: دو۔عائشہ رضی اللہ عنہا نے کہا: ابن عمر رضی اللہ عنہما کو تو معلوم ہے کہ رسول اللہ ﷺ نے تین عمرے کیے تھے،سوائے اس کے جسے آپ ﷺ نے حجتہ الوداع کے ساتھ ملا کر کیا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن<br>وأصل الحدیث متفق علیہ (خ 1775 م 1255) بغیر ھذا اللفظ`;
abudawood.anwaar = [76,1];