var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ وَقُتَيْبَةُ قَالَا حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ عُمَرٍ عُمْرَةَ الْحُدَيْبِيَةِ وَالثَّانِيَةَ حِينَ تَوَاطَئُوا عَلَى عُمْرَةٍ مَنْ قَابِلٍ وَالثَّالِثَةَ مِنْ الْجِعْرَانَةِ وَالرَّابِعَةَ الَّتِي قَرَنَ مَعَ حَجَّتِهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے چار عمرے کیے تھے۔عمرہ حدیبیہ (جس سے آپ ﷺ کو واپس جانا پڑا تھا) دوسرا وہ جو حسب اتفاق معاہدہ اگلے سال کیا۔تیسرا جعرانہ سے اور چوتھا جو آپ ﷺ نے اپنے حج کے ساتھ ملا کر کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (816 وسندہ صحیح)`;