var abudawood = {};
abudawood.arabic = "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ أَبَانَ بْنِ صَالِحٍ وَعَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ فِي عُمْرَةِ الْقَضَاءِ ثَلَاثًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ عمرہ قضاء میں (مکہ کے اندر) تین دن ٹھہرے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق وابن أبي نجیح مدلسان وعنعنا`;
abudawood.anwaar = [76,1];