var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَاضَ يَوْمَ النَّحْرِ ثُمَّ صَلَّى الظُّهْرَ بِمِنًى يَعْنِي رَاجِعًا";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے قربانی والے دن طواف افاضہ کیا،پھر لوٹ کر منٰی میں ظہر کی نماز پڑھی۔";
abudawood.hukam = "صحیح مسلم (1308)";
abudawood.description = ``;