var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ أَخْبَرَنَا إِسْمَعِيلُ بْنُ عَبْدِ الْمَلِكِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ الْبَرَازَ انْطَلَقَ حَتَّى لَا يَرَاهُ أَحَدٌ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ کو جب پیشاب،پاخانے کی حاجت ہوتی تو (آبادی سے) دور چلے جاتے حتیٰ کہ آپ ﷺ کو کوئی نہ دیکھ سکتا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (335)<br>إسماعیل بن عبدالملک ضعیف ضعفہ الجمہور وقال الحافظ: صدوق کثیر الوھم (تقریب التہذیب: 465) وأبو الزبیر مدلس (یأتي: 1215) وللحدیث شواہد دون قولہ ’’حتی لا یراہ أحد ‘‘`;
abudawood.anwaar = [13,1];