var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ عَائِشَةَ وَابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَّرَ طَوَافَ يَوْمِ النَّحْرِ إِلَى اللَّيْلِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا اور سیدنا ابن عباس رضی اللہ عنہما سے منقول ہے کہ نبی کریم ﷺ نے قربانی کے روز طواف کو رات تک مؤخر کیا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (920) ابن ماجہ (3059)<br>أبو الزبیر مدلس ولم أجد تصریح سماعہ و تابعہ محمد بن طارق ولکنہ عن طاووس : مرسل`;
abudawood.anwaar = [76,1];