var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي ابْنُ جُرَيْجٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَرْمُلْ فِي السَّبْعِ الَّذِي أَفَاضَ فِيهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے اپنے طواف افاضہ میں رمل نہیں کیا تھا (آہستہ آہستہ نہیں دوڑے تھے جیسے کہ طواف قدوم میں کیا تھا۔)";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2673)
صححہ ابن خزیمۃ (2943 وسندہ حسن) حدیث ابن جریج عن عطاء قوي وإن عنعن`;