var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّاسُ يَنْصَرِفُونَ فِي كُلِّ وَجْهٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ الطَّوَافَ بِالْبَيْتِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما فرماتے ہیں کہ لوگ (حج کے بعد) ہر جانب واپس چلے جاتے تھے۔تو نبی کریم ﷺ نے فرمایا ’’کوئی شخص ہرگز نہ جائے حتیٰ کہ اس کا آخری عمل بیت اللہ کا طواف ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (1327)";
abudawood.description = ``;