var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ صَفِيَّةَ بِنْتَ حُيَيٍّ فَقِيلَ إِنَّهَا قَدْ حَاضَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّهَا حَابِسَتُنَا قَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ أَفَاضَتْ فَقَالَ فَلَا إِذًا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے سیدہ صفیہ بنت حیی کا ذکر کیا تو بتایا گیا کہ اسے حیض آ گیا ہے تو رسول اللہ ﷺ نے فرمایا ’’شاید یہ ہمیں روکنے والی ہے؟‘‘ (گھر والوں نے) کہا: اے اﷲ کے رسول! اس نے طواف افاضہ کر لیا ہے تو آپ ﷺ نے فرمایا ’’تب نہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أصلہ عند مسلم (1211)`;