var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ أَفْلَحَ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ أَحْرَمْتُ مِنْ التَّنْعِيمِ بِعُمْرَةٍ فَدَخَلْتُ فَقَضَيْتُ عُمْرَتِي وَانْتَظَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْأَبْطَحِ حَتَّى فَرَغْتُ وَأَمَرَ النَّاسَ بِالرَّحِيلِ قَالَتْ وَأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ فَطَافَ بِهِ ثُمَّ خَرَجَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں نے تنعیم سے عمرے کا احرام باندھا،پھر حرم میں داخل ہوئی اور اپنا عمرہ پورا کیا۔اور رسول اللہ ﷺ نے وادی ابطح میں میرا انتظار کیا حتیٰ کہ میں فارغ ہو گئی۔اور آپ ﷺ نے لوگوں کو کوچ کرنے کا حکم دیا اور کہتی ہیں کہ رسول اللہ ﷺ بیت اللہ میں تشریف لائے،اس کا طواف کیا پھر روانہ ہو گئے۔";
abudawood.hukam = "إسنادہ صحیح، صحیح بخاری (1560) صحیح مسلم (1211)";
abudawood.description = `مشکوۃ المصابیح (2667)
انظر الحدیث الآتي (2006)`;