var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ إِنَّمَا نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُحَصَّبَ لِيَكُونَ أَسْمَحَ لِخُرُوجِهِ وَلَيْسَ بِسُنَّةٍ فَمَنْ شَاءَ نَزَلَهُ وَمَنْ شَاءَ لَمْ يَنْزِلْهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ وادی محصب میں اس لیے اترے تھے تاکہ آپ ﷺ کو (مکہ سے) نکلنے میں آسانی رہے۔یہ کوئی مشروع سنت نہیں ہے۔جو چاہے یہاں اتر جائے اور جو چاہے نہ اترے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رواہ البخاري (1765) ومسلم (1311)`;