var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا عُمَرُ حَدَّثَنَا أَبُو عَمْرٍو يَعْنِي الْأَوْزَاعِيَّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حِينَ أَرَادَ أَنْ يَنْفِرَ مِنْ مِنًى نَحْنُ نَازِلُونَ غَدًا فَذَكَرَ نَحْوَهُ وَلَمْ يَذْكُرْ أَوَّلَهُ وَلَا ذَكَرَ الْخَيْفَ الْوَادِي";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے جب منٰی سے روانگی کا ارادہ کیا تو فرمایا ’’ہم کل (خیف بنی کنانہ میں) اتریں گے۔‘‘ اور مذکورہ بالا کی مانند ذکر کیا۔مگر (اوزاعی نے) روایت کا پہلا حصہ (اسامہ کا سوال جواب) ذکر نہیں کیا اور نہ ’’الخیف‘‘ کا کہ یہ وادی ہے۔";
abudawood.hukam = "صحیح بخاری (1590) صحیح مسلم (1314)";
abudawood.description = ``;