var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى أَبُو سَلَمَةَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ وَأَيُّوبَ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ كَانَ يَهْجَعُ هَجْعَةً بِالْبَطْحَاءِ ثُمَّ يَدْخُلُ مَكَّةَ وَيَزْعُمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ";
abudawood.urdu = "جناب نافع رحمہ اللہ کہتے ہیں کہ(منٰی سے واپسی پر) سیدنا ابن عمر رضی اللہ عنہما بطحاء (ابطح،محصب) میں ذرا دیر سوتے،پھر مکہ میں داخل ہوتے۔اور کہتے تھے کہ رسول اللہ ﷺ ایسے ہی کیا کرتے تھے۔(یعنی طواف وداع کیا کرتے تھے)۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البخاري (1768 مطولًا)`;