var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا حُمَيْدٌ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ وَأَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ بِالْبَطْحَاءِ ثُمَّ هَجَعَ بِهَا هَجْعَةً ثُمَّ دَخَلَ مَكَّةَ وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے بطحاء میں ظہر،عصر،مغرب اور عشاء کی نمازیں پڑھیں،پھر کچھ دیر سوئے،پھر مکہ میں داخل ہوئے۔اور ابن عمر رضی اللہ عنہما ایسے ہی کیا کرتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2012)`;