var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ جَعْفَرِ بْنِ يَحْيَى بْنِ ثَوْبَانَ أَخْبَرَنِي عِمَارَةُ بْنُ ثَوْبَانَ حَدَّثَنِي مُوسَى بْنُ بَاذَانَ قَالَ أَتَيْتُ يَعْلَى بْنَ أُمَيَّةَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ احْتِكَارُ الطَّعَامِ فِي الْحَرَمِ إِلْحَادٌ فِيهِ";
abudawood.urdu = "سیدنا یعلیٰ بن امیہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’حرم میں غلے کا ذخیرہ کرنا (لوگوں سے روک رکھنا) الحاد (بے دینی) ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>موسی بن باذان مجہول(تق : 6949)<br>وجعفر بن یحیی:مقبول(أي مجہول الحال)<br>وعمارۃ بن ثوبان مستور (تقریب التہذیب: 962،4839)`;
abudawood.anwaar = [77,1];