var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَقَ الْأَذْرَمِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكٍ بِهَذَا الْحَدِيثِ لَمْ يَذْكُرْ السَّوَارِيَ قَالَ ثُمَّ صَلَّى وَبَيْنَهُ وَبَيْنَ الْقِبْلَةِ ثَلَاثَةُ أَذْرُعٍ";
abudawood.urdu = "امام مالک رحمہ اللہ نے یہ حدیث روایت کی مگر ستونوں کا ذکر نہیں کیا،کہا: پھر آپ ﷺ نے نماز پڑھی۔آپ ﷺ اور قبلہ کی دیوار کے درمیان تین ہاتھ کا فاصلہ تھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2023)`;