var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ الْقَعْنَبِيِّ قَالَ وَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّى";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نبی کریم ﷺ سے نقل کرتے ہیں اور قعنبی کی (مذکورہ بالا) روایت کی مانند بیان کیا۔کہا: میں یہ پوچھنا بھول گیا کہ آپ ﷺ نے کتنی رکعتیں پڑھیں؟";
abudawood.hukam = "صحیح";
abudawood.description = `تقدم طرفہ (1959) وھو متفق علیہ وانظر الحدیث السابق (2023)`;