var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ صَفْوَانَ قَالَ قُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ كَيْفَ صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ دَخَلَ الْكَعْبَةَ قَالَ صَلَّى رَكْعَتَيْنِ";
abudawood.urdu = "عبدالرحمٰن بن صفوان کہتے ہیں کہ میں نے سیدنا عمر بن خطاب رضی اللہ عنہ سے پوچھا کہ رسول اللہ ﷺ جب کعبہ میں داخل ہوئے تو کیا کیا تھا؟ انہوں نے کہا: آپ ﷺ نے دو رکعتیں پڑھی تھیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللمتن شواھد عند البخاري (397) وغیرہ، فالحدیث صحیح`;