var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ الْحِمْصِيُّ فِي آخَرِينَ قَالُوا،حَدَّثَنَا بَقِيَّةُ عَنِ الْوَضِينِ بْنِ عَطَاءٍ،عَنْ مَحْفُوظِ بْنِ عَلْقَمَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَائِذٍ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: وِكَاءُ السَّهِ الْعَيْنَانِ, فَمَنْ نَامَ فَلْيَتَوَضَّأْ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’آنکھیں سرین کا تسمہ ہیں،تو جو سو جائے وہ وضو کرے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (477)<br>عبد الرحمٰن بن عائذ عن علي رضي اللّٰہ عنہ مرسل کما قال أبو زرعۃ (المراسیل لإبن أبي حاتم ص 124 رقم: 446) وحدیث الترمذي (96) یغني عنہ`;
abudawood.anwaar = [20,1];