var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ وَمَسْجِدِي هَذَا وَالْمَسْجِدِ الْأَقْصَى";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’پالان نہ کسے (یعنی سفر نہ کئے) جائیں مگر تین مساجد کی طرف،یعنی مسجد الحرام (بیت اللہ) میری یہ مسجد (مسجد نبوی) اور مسجد الاقصیٰ کی طرف۔‘‘";
abudawood.hukam = "صحیح بخاری (1189) صحیح مسلم (1397)";
abudawood.description = ``;