var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ زَيْدَ بْنَ الْحُبَابِ حَدَّثَهُمْ حَدَّثَنَا سُلَيْمَانُ بْنُ كِنَانَةَ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِي سُفْيَانَ عَنْ عَدِيِّ بْنِ زَيْدٍ قَالَ حَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلَّ نَاحِيَةٍ مِنْ الْمَدِينَةِ بَرِيدًا بَرِيدًا لَا يُخْبَطُ شَجَرُهُ وَلَا يُعْضَدُ إِلَّا مَا يُسَاقُ بِهِ الْجَمَلُ";
abudawood.urdu = "سیدنا عدی بن زید رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مدینہ منورہ کی ہر طرف سے ایک ایک برید (بارہ میل) کو محفوظ علاقہ قرار دیا تھا کہ نہ اس کے درخت کاٹے جائیں اور نہ پتے توڑے جائیں،مگر اونٹ کے چارے کے بقدر جائز ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سلیمان بن کنانۃ : مجھول الحال (تق : 2603)<br>ولأصل الحدیث شواہد کثیرۃ`;
abudawood.anwaar = [77,1];