var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَفْصٍ أَبُو عَبْدِ الرَّحْمَنِ الْقَطَّانُ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ أَخْبَرَنِي خَارِجَةُ بْنُ الْحَارِثِ الْجُهَنِيُّ أَخْبَرَنِي أَبِي عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُخْبَطُ وَلَا يُعْضَدُ حِمَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ يُهَشُّ هَشًّا رَفِيقًا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’اللہ کے رسول ﷺ کے محفوظ کردہ علاقے سے نہ پتے توڑے جائیں اور نہ درخت کاٹے جائیں مگر ہلکے انداز میں پتے جھاڑ لیے جائیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف`;
abudawood.anwaar = [78,1];