var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ عَنْ ابْنِ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي قِبَاءَ مَاشِيًا وَرَاكِبًا زَادَ ابْنُ نُمَيْرٍ وَيُصَلِّي رَكْعَتَيْنِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ قباء تشریف لے جایا کرتے تھے۔کبھی پیدل اور کبھی سوار ہو کر۔ابن نمیر نے مزید کہا: اور (مسجد میں) دو رکعتیں پڑھا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (1194) صحیح مسلم (1399)";
abudawood.description = ``;