var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ حَدَّثَنَا الْمُقْرِئُ حَدَّثَنَا حَيْوَةُ عَنْ أَبِي صَخْرٍ حُمَيْدِ بْنِ زِيَادٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَيَّ إِلَّا رَدَّ اللَّهُ عَلَيَّ رُوحِي حَتَّى أَرُدَّ عَلَيْهِ السَّلَامَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص بھی مجھے سلام کہتا ہے تو اللہ مجھ پر میری روح لوٹا دیتا ہے اور میں اس کے سلام کا جواب دیتا ہوں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (925)
یزید بن عبد اللہ بن قسیط ثبت سماعہ من أبي ھریرۃ عند البیھقي (1/ 122)`;