var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ قَرَأْتُ عَلَى عَبْدِ اللَّهِ بْنِ نَافِعٍ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْعَلُوا بُيُوتَكُمْ قُبُورًا وَلَا تَجْعَلُوا قَبْرِي عِيدًا وَصَلُّوا عَلَيَّ فَإِنَّ صَلَاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’اپنے گھروں کو قبرستان مت بناؤ۔اور نہ میری قبر کو عید (میلہ گاہ) بناؤ اور مجھ پر درود پڑھو۔تم جہاں کہیں بھی ہو گے تمہارا درود مجھ کو پہنچ جائے گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (926)`;