var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَاخَ بِالْبَطْحَاءِ الَّتِي بِذِي الْحُلَيْفَةِ فَصَلَّى بِهَا فَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَفْعَلُ ذَلِكَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے ذوالحلیفہ کے قریب بطحاء (کھلے میدان) میں اپنی اونٹنی بٹھائی اور وہاں نماز پڑھی۔چنانچہ عبداللہ بن عمر رضی اللہ عنہما اس پر عمل کیا کرتے تھے۔(درج ذیل اثر میں اس کی وضاحت ہے۔)";
abudawood.hukam = "صحیح بخاری (1532) صحیح مسلم (1257 بعد ح 1345)";
abudawood.description = ``;