var abudawood = {};
abudawood.arabic = "حَدَّثَنَا اَحْمَدُ بنُ صَالحٍ قال:قَرَأَتُ عَلَى عَبْدِالله بنِ نَافِعٍ قال: حَدَّثنى عَبْدُالله يَعنى الْعُمَرِيَّ عن نَافِعٍ،عن ابنِ عُمَرَ: اَنَّ رَسُوْلَ الله كَانَ اِذَاقَدِمَ باتَ بالمُعُرَّسِ حتى يُغّتَدِيَ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ جب (مکہ سے مدینہ واپس) آتے تو مقام معرس میں رات گزارتے حتیٰ کہ صبح کو روانہ ہوتے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `الف: انظر الحدیث السابق (2044)، ب: روایۃ عبداللہ العمري عن نافع قویۃ`;