var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،أَخْبَرَنَا الْأَعْمَشُ،عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَتَزَوَّجْتَ؟،قُلْتُ: نَعَمْ،قَالَ: بِكْرًا،أَمْ ثَيِّبًا؟،فَقُلْتُ: ثَيِّبًا،قَال:َ أَفَلَا بِكْرٌ! تُلَاعِبُهَا وَتُلَاعِبُكَ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے مجھ سے پوچھا ’’کیا تو نے شادی کر لی ہے؟‘‘ میں نے عرض کیا: ہاں! آپ ﷺ نے فرمایا ’’کنواری سے یا بیوہ سے؟‘‘ میں نے کہا،بیوہ سے۔فرمانے لگے ’’کنواری سے کیوں نہیں کی؟ تم اس سے کھیلتے وہ تم سے کھیلتی۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `أصلہ عند مسلم (715 بعد ح 599) وللحدیث طرق`;