var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ عِيسَى بْنِ حِطَّانَ،عَنْ مُسْلِمِ بْنِ سَلَّامٍ،عَنْ عَلِيِّ بْنِ طَلْقٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا فَسَا أَحَدُكُمْ فِي الصَّلَاةِ, فَلْيَنْصَرِفْ فَلْيَتَوَضَّأْ،وَلْيُعِدِ الصَّلَاةَ";
abudawood.urdu = "سیدنا علی بن طلق رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’نماز کے دوران میں جو کوئی پھسکی مارے (یعنی بغیر آواز کے اس کے مقعد سے ہوا خارج ہو) تو چاہیئے کہ وہ (نماز چھوڑ کر) چلا جائے،وضو کرے اور نماز دہرائے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (314، 1006)`;