var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَأَبُو مَعْمَرٍ،قَالَا: حَدَّثَنَا عَبْدُ الْوَارِثِ،عَنْ حَبِيبٍ،حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَنْكِحُ الزَّانِي الْمَجْلُودُ إِلَّا مِثْلَهُ. وقَالَ أَبُو مَعْمَرٍ:،حَدَّثَنِي حَبِيبٌ الْمُعَلِّمُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’کوئی زانی،جسے زنا کی حد لگی ہو،کسی اپنے جیسی عورت ہی سے نکاح کرتا ہے۔‘‘ ابومعمر نے اپنی سند میں یوں کہا <عربی> «حدثنی حبیب المعلم ،عن عمرو بن شعیب» </عربی>۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;