var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ،حَدَّثَنَا عَبْثَرٌ،عَنْ مُطَرِّفٍ،عَنْ عَامِرٍ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ مَنْ أَعْتَقَ جَارِيَتَهُ وَتَزَوَّجَهَا, كَانَ لَهُ أَجْرَانِ.";
abudawood.urdu = "سیدنا ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص اپنی لونڈی کو آزاد کر کے خود ہی اس سے نکاح کر لے،تو ایسے شخص کے لیے دہرا اجر ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (2544) صحیح مسلم (154 بعد ح 1427)";
abudawood.description = ``;