var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ،أَخْبَرَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ،وَجَعَلَ عِتْقَهَا صَدَاقَهَ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے منقول ہے کہ نبی کریم ﷺ نے صفیہ رضی اللہ عنہا کو آزاد فرمایا (اور پھر اپنے حرم میں داخل کرنے کا شرف بخشا) اور ان کے آزاد کرنے ہی کو ان کا حق مہر ٹھہرایا۔";
abudawood.hukam = "صحیح بخاری (947) صحیح مسلم (1365 بعد ح 1427)";
abudawood.description = ``;