var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلَادَةِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’رضاعت کی بنا پر وہ تمام رشتے حرام ہو جاتے ہیں جو ولادت کے تعلق سے حرام ہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;