var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ أَنَّ سُلَيْمَانَ بْنَ الْمُغِيرَةِ حَدَّثَهُمْ،عَنْ أَبِي مُوسَى،عَنْ أَبِيهِ عَنِ ابْنٍ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنِ ابْنِ مَسْعُودٍ،قَالَ: لَا رِضَاعَ إِلَّا مَا شَدَّ الْعَظْمَ،وَأَنْبَتَ اللَّحْمَ. فَقَالَ أَبُو مُوسَى: لَا تَسْأَلُونَا وَهَذَا الْحَبْرُ فِيكُمْ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا ’’رضاعت وہی معتبر ہے جو ہڈیوں کو مضبوط کرے اور گوشت پیدا کرے۔‘‘ ابوموسیٰ نے کہا: تم میں جب تک یہ عظیم عالم موجود ہے ہم سے مت کچھ پوچھا کرو۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو موسی الھلالي مجھول وأبوہ مجھول کما قال أبو حاتم الرازي (الجرح والتعدیل 9/ 438)`;
abudawood.anwaar = [78,1];