var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ،حَدَّثَنَا وَكِيعٌ،عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ،عَنْ أَبِي مُوسَى الْهِلَالِيِّ،عَنْ أَبِيهِ عَنِ ابْنِ مَسْعُودٍ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ... بِمَعْنَاهُ،وَقَالَ: أَنْشَزَ الْعَظْمَ .";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ نے نبی کریم ﷺ سے مذکورہ بالا حدیث کے ہم معنی بیان کیا اور لفظ «أنشز العظم» ذکر کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو موسی الھلالي وأبوہ مجھولان،انظر الحدیث السابق (2059) والموقوف صحیح،کما فی الموطأ بتحقیقي (روایۃ یحیی ح1327)`;
abudawood.anwaar = [78,1];