var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ،حَدَّثَنَا إِسْمَاعِيلُ،عَنْ أَيُّوبَ عَنِ ابْنِ أَبِي مُلَيْكَةَ،عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تُحَرِّمُ الْمَصَّةُ وَلَا الْمَصَّتَانِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’ایک بار چوسنا یا دو بار چوسنا حرام نہیں کرتا۔‘‘";
abudawood.hukam = "صحیح بخاری (1450)";
abudawood.description = ``;