var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا أَبُو مُعَاوِيَةَ ح،وحَدَّثَنَا ابْنُ الْعَلَاءِ،حَدَّثَنَا ابْنُ إِدْرِيسَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ حَجَّاجِ بْنِ حَجَّاجٍ،عَنْ أَبِيهِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ! مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرَّضَاعَةِ؟ قَالَ: الْغُرَّةُ: الْعَبْدُ،أَوِ الْأَمَةُ. قَالَ النُّفَيْلِيُّ: حَجَّاجُ بْنُ حَجَّاجٍ الْأَسْلَمِيُّ،وَهَذَا لَفْظُهُ.";
abudawood.urdu = "جناب حجاج بن حجاج اپنے والد سے روایت کرتے ہیں،کہتے ہیں کہ میں نے کہا: اے اللہ کے رسول! میں دودھ پلانے کا حق کس طرح ادا کر سکتا ہوں؟ آپ ﷺ نے فرمایا ’’ایک غلام یا لونڈی (لے کر اسے دے دے)۔‘‘ نفیلی نے کہا حجاج بن حجاج،بنو اسلم سے تعلق رکھتا ہے اور یہ اسی کے لفظ ہیں۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3174)
أخرجہ الترمذي (1153 وسندہ حسن) والنسائي (3331 وسندہ حسن) وللحدیث شواھد انظر مجمع الزوائد (4/262)`;