var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ،عَنْ عَامِرٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا،وَلَا الْعَمَّةُ عَلَى بِنْتِ أَخِيهَا،وَلَا الْمَرْأَةُ عَلَى خَالَتِهَا،وَلَا الْخَالَةُ عَلَى بِنْتِ أُخْتِهَا،وَلَا تُنْكَحُ الْكُبْرَى عَلَى الصُّغْرَى،وَلَا الصُّغْرَى عَلَى الْكُبْرَى.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’نہ نکاح کی جائے کوئی عورت اس کی پھوپھی پر۔نہ پھوپھی اس کی بھتیجی پر۔اور نہ نکاح کی جائے کوئی عورت اس کی خالہ پر۔نہ خالہ اس کی بھانجی پر۔نہ نکاح کی جائے بڑی چھوٹی پر اور نہ چھوٹی بڑی پر۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3171)
أخرجہ الترمذي (1126 وسندہ صحیح) والنسائي (3298 وسندہ صحیح)`;