var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَنْبَسَةُ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ،يَقُولُ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا،وَبَيْنَ الْمَرْأَةِ وَعَمَّتِهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے تھے کہ رسول اللہ ﷺ نے اس سے منع فرمایا ہے کہ عورت اور اس کی خالہ یا عورت اور اس کی پھوپھی کو جمع کیا جائے۔";
abudawood.hukam = "صحیح بخاری (5110) صحیح مسلم (1408)";
abudawood.description = ``;