var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا خَطَّابُ بْنُ الْقَاسِمِ،عَنْ خُصَيْفٍ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ كَرِهَ أَنْ يُجْمَعَ بَيْنَ الْعَمَّةِ وَالْخَالَةِ،وَبَيْنَ الْخَالَتَيْنِ وَالْعَمَّتَيْنِ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے حرام کیا اس بات کو کہ جمع کی جائے پھوپھی اور خالہ یا دو خالائیں اور دو پھوپھیاں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خصیف : ضعیف`;
abudawood.anwaar = [78,1];