var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ, عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ وَعَنْ أَيُّوبَ عَنِ ابْنِ أَبِي مَُلَيْكَةَ بِهَذَا،الْخَبَرِ قَالَ: فَسَكَتَ عَلِيٌّ،عَنْ ذَلِكَ النِّكَاحِ.";
abudawood.urdu = "معمر نے زہری سے بواسطہ عروہ روایت کیا اور دوسری سند میں ایوب سے بواسطہ ابن ابی ملیکہ (اسی طرح) بیان کیا (البتہ اس روایت میں یہ اضافہ کیا کہ) سیدنا علی رضی اللہ عنہ اس (دوسرے) نکاح سے خاموش ہو گئے۔";
abudawood.hukam = "صحیح بخاری (5230) صحیح مسلم (2449)";
abudawood.description = ``;