var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ،حَدَّثَنَا عَبْدُ الْوَارِثِ،عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ عَنِ الزُّهْرِيِّ،قَالَ: كُنَّا عِنْدَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ،فَتَذَاكَرْنَا مُتْعَةَ النِّسَاءِ،فَقَالَ لَهُ رَجُلٌ-يُقَالُ لَهُ: رَبِيعُ بْنُ سَبْرَةَ-: أَشْهَدُ عَلَى أَبِي أَنَّهُ حَدَّثَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فِي حَجَّةِ الْوَدَاعِ.";
abudawood.urdu = "زہری رحمہ اللہ کہتے ہیں کہ ہم سیدنا عمر بن عبدالعزیز رحمہ اللہ کی مجلس میں تھے کہ عورتوں سے نکاح متعہ کا ذکر چل پڑا۔تو ربیع بن سبرہ نامی ایک شخص نے کہا: میں اپنے والد (سبرہ) کے متعلق گواہی دیتا ہوں کہ انہوں نے بیان کیا کہ رسول اللہ ﷺ نے اس سے حجۃ الوداع میں منع فرما دیا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف لشذوذہ<br>رجالہ ثقات ولکنہ شاذ مخالف لما رواہ الثقات،والصواب :’’ نہی عنھا في عام الفتح ‘‘ کما رواہ مسلم (1406)`;
abudawood.anwaar = [78,1];