var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنِي إِسْمَاعِيلُ،عَنْ عَامِرٍ عَنِ الْحَارِثِ،عَنْ عَلِيٍّ رَضِي اللَّهُ عَنْهُ،قَالَ: إِسْمَاعِيلُ وَأُرَاهُ قَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ لَعَنَ اللَّهُ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’حلالہ کرنے والا اور جس کے لیے کیا گیا ہے (دونوں) ملعون ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1119) ابن ماجہ (1935)<br>الحارث الأعور ضعیف جدًا وللمتن شواہد ضعیفۃ وروی أحمد (2/ 323) و ابن الجارود (684 واللفظ لہ) بسند حسن عن أبي ہریرۃ قال ’’ لعن رسول اللّٰہ ﷺ المحلل والمحلل لہ ‘‘ وھوالصواب`;
abudawood.anwaar = [78,2];