var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ ابْنُ بَقِيَّةَ،عَنْ خَالِدٍ،عَنْ حُصَيْنٍ،عَنْ عَامِرٍ عَنِ الْحَارِثِ الْأَعْوَرِ،عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: فَرَأَيْنَا أَنَّهُ عَلِيٌّ عَلَيْهِ السَّلَام،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِمَعْنَاهُ.";
abudawood.urdu = "حارث اعور،نبی کریم ﷺ کے صحابہ میں سے ایک شخص سے روایت کرتا ہے اور ہم سمجھتے ہیں کہ وہ علی رضی اللہ عنہ ہیں،انہوں نے نبی کریم ﷺ سے مذکورہ بالا حدیث کے ہم معنی روایت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1119) ابن ماجہ (1935)<br>الحارث الأعور ضعیف جدًا وللمتن شواہد ضعیفۃ وروی أحمد (2/ 323) و ابن الجارود (684 واللفظ لہ) بسند حسن عن أبي ہریرۃ قال ’’ لعن رسول اللّٰہ ﷺ المحلل والمحلل لہ ‘‘ وھوالصواب`;
abudawood.anwaar = [78,2];