var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ, وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ, وَهَذَا لَفْظُ إِسْنَادِهِ وَكِلَاهُمَا،عَنْ وَكِيعٍ،حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ, فَهُوَ عَاهِرٌ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو غلام اپنے مالک کی اجازت کے بغیر نکاح کر لے وہ زانی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1111)<br>ابن عقیل ضعیف<br>وللحدیث شواہد ضعیفۃ عند ابن ماجہ (1959،1960) وغیرہ<br>وروی البیہقي (127/7) وابن أبي شیبۃ (261/4 ح 16858 واللفظ لہ) بسند قوي عن ابن عمر قال : ’’ نکاح العبد بغیر إذن سیدہ زنا ویعاقب الذي زوّجہ ‘‘`;
abudawood.anwaar = [79,1];