var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’کوئی شخص اپنے بھائی کے پیغام نکاح پر اپنا پیغام نہ بھیجے۔‘‘";
abudawood.hukam = "صحیح بخاری (2140) صحیح مسلم (1413)";
abudawood.description = ``;