var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَخْطُبْ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ،وَلَا يَبِعْ عَلَى بَيْعِ أَخِيهِ, إِلَّا بِإِذْنِهِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے کوئی شخص اپنے بھائی کے پیغام نکاح پر اپنا پیغام نہ بھیجے اور نہ اپنے بھائی کے سودے پر سودا کرے مگر اس کی اجازت سے۔‘‘";
abudawood.hukam = "صحیح بخاری (5142) صحیح مسلم (1412)";
abudawood.description = ``;