var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ جَعْفَرٍ يَعْنِي ابْنَ رَبِيعَةَ عَنِ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ. قَالَ أَبو دَاود: جَعْفَرٌ لَمْ يَسْمَعْ مِنَ الزُّهْرِيِّ كَتَبَ إِلَيْهِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے نبی کریم ﷺ سے مذکورہ بالا حدیث کے ہم معنی بیان کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ جعفر بن ربیعہ نے زہری سے سنا نہیں بلکہ (یہ حدیث) انہوں نے اس کی طرف لکھ بھیجی تھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2083)`;