var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ،حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ،عَنْ يُونُسَ وَإِسْرَائِيلَ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا نِكَاحَ إِلَّا بِوَلِيٍّ . قَالَ أَبو دَاود: وَهُوَ يُونُسُ،عَنْ أَبِي بُرْدَةَ وَإِسْرَائِيلُ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي بُرْدَةَ.";
abudawood.urdu = "سیدنا ابوموسیٰ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’ولی کے بغیر کوئی نکاح نہیں۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں اس سند میں یونس نے ابوبردہ رحمہ اللہ سے،اور اسرائیل نے ابواسحٰق سے اور انہوں نے ابوبردہ سے روایت کی ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3130)
انظر الحدیث السابق (2083)`;