var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ،عَنْ أُمِّ حَبِيبَةَ،أَنَّهَا كَانَتْ عِنْدَ ابْنِ جَحْشٍ،فَهَلَكَ عَنْهَا،وَكَانَ فِيمَنْ هَاجَرَ إِلَى أَرْضِ الْحَبَشَةِ،فَزَوَّجَهَا النَّجَاشِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, وَهِيَ عِنْدَهُمْ.";
abudawood.urdu = "جناب عروہ بن زبیر رحمہ اللہ ام المؤمنین سیدہ ام حبیبہ رضی اللہ عنہا کے متعلق بتاتے ہیں کہ یہ پہلے ابن حجش کی زوجیت میں تھیں،وہ فوت ہو گیا اور وہ ان لوگوں میں سے تھا جو حبشہ کی جانب ہجرت کر کے گئے تھے،تو نجاشی نے ان کا نکاح رسول اللہ ﷺ سے کر دیا جبکہ یہ ان کے ہاں (حبشہ ہی میں) تھیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3352) ویأتي (2107)<br>الزھري مدلس وعنعن و ھذا مشہور عند أھل السیر`;
abudawood.anwaar = [79,1];