var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ ح،وحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا هَمَّامٌ ح،وحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ الْمَعْنَى،عَنْ قَتَادَةَ عَنِ الْحَسَنِ،عَنْ سَمُرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ, فَهِيَ لِلْأَوَّلِ مِنْهُمَا،وَأَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ, فَهُوَ لِلْأَوَّلِ مِنْهُمَا.";
abudawood.urdu = "سیدنا سمرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’جب دو ولی کسی عورت کا نکاح کر دیں تو یہ ان میں سے پہلے والے کے لیے ہو گی۔اور جب کسی شخص نے ایک چیز کا دو آدمیوں سے سودا کر دیا ہو تو یہ پہلے والے کی ہو گی۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3156)
ورواہ شعبۃ عن قتادۃ بہ انظر سنن النسائي (4686 وسندہ صحیح) روایۃ الحسن عن سمرۃ من کتابہ والروایۃ عن الکتاب صحیحۃ عن جمھور المحدثین`;