var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ شَبُّوَيْهِ الْمَرْوَزِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ،عَنْ عِيسَى ابْنِ عُبَيْدٍ،عَنْ عُبَيْدِ اللَّهِ مَوْلَى عُمَرَ عَنِ الضَّحَّاكِ بِمَعْنَاهُ, قَالَ: فَوَعَظَ اللَّهُ ذَلِكَ.";
abudawood.urdu = "عبیداللہ(عبیداللہ مولیٰ عمر)نے ضحاک سے اس کے ہم معنی بیان کیا اور لفظ یہ تھے «فوعظ اللہ ذلک» ’’اللہ نے اس بارے میں نصیحت فرمائی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبیداللّٰہ مولی عمر بن سالم الباھلي مجھول الحال وثقہ ابن حبان وحدہ<br>والحدیث السابق (الأصل : 2090) یغني عنہ`;
abudawood.anwaar = [79,1];