var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،عَنْ سُفْيَانَ،عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ،حَدَّثَنِي الثِّقَةُ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: آمِرُوا النِّسَاءَ فِي بَنَاتِهِنَّ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’لڑکیوں کے سلسلے میں عورتوں سے (ان کی ماؤں سے) مشورہ کر لیا کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الثقۃ : لم أعرفہ`;
abudawood.anwaar = [79,1];