var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ،حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،أَنَّ جَارِيَةً بِكْرًا أَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَذَكَرَتْ أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ؟ فَخَيَّرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ ایک جوان کنواری لڑکی نبی کریم ﷺ کے پاس آئی۔اس نے بتایا کہ اس کے باپ نے اس کی شادی کر دی ہے مگر میں اسے ناپسند کرتی ہوں۔تو نبی کریم ﷺ نے اسے اختیار دے دیا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3136)
أخرجہ ابن ماجہ (1875 وسندہ حسن) وللحدیث شواھد`;