var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ. قَالَ أَبو دَاود: لَمْ يَذْكُرِ ابْنَ عَبَّاسٍ وَكَذَلِكَ رَوَاهُ النَّاسُ مُرْسَلًا مَعْرُوفٌ.";
abudawood.urdu = "عکرمہ نبی کریم ﷺ سے یہی روایت بیان کرتے ہیں۔امام ابوداؤد رحمہ اللہ نے کہا کہ (عکرمہ نے) ابن عباس رضی اللہ عنہما کا نام ذکر نہیں کیا،اور محدثین کے ہاں اس روایت کو اسی طرح مرسل روایت کرنا ہی معروف ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2096)`;