var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَا،أَخْبَرَنَا مَالِكٌ،عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ،عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا،وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا،وَإِذْنُهَا صُمَاتُهَا. وَهَذَا لَفْظُ الْقَعْنَبِيِّ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’بیوہ اپنی ذات کے بارے میں اپنے ولی کی بہ نسبت زیادہ حقدار ہے۔اور کنواری سے بھی اس کے اپنے بارے میں مشورہ کیا جائے،اس کی اجازت اس کی خاموشی ہے۔‘‘ اور یہ لفظ قعنبی (عبداللہ بن مسلمہ) کے ہیں۔";
abudawood.hukam = "صحیح مسلم (1421)";
abudawood.description = ``;