var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا سُفْيَانُ،عَنْ زِيَادِ بْنِ سَعْدٍ،عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ: الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا،وَالْبِكْرُ يَسْتَأْمِرُهَا أَبُوهَا. قَالَ أَبو دَاود: أَبُوهَا لَيْسَ بِمَحْفُوظٍ.";
abudawood.urdu = "عبداللہ بن فضل نے اپنی سند سے اور مذکورہ بالا حدیث کے ہم معنی روایت کیا اور کہا ’’بیوہ اپنے ولی کی بہ نسبت اپنے بارے میں زیادہ حقدار ہے۔اور کنواری سے اس کا باپ مشورہ کرے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں «أبوہا» ’’اس کا باپ‘‘ کا لفظ محفوظ نہیں۔";
abudawood.hukam = "صحیح مسلم (1421)";
abudawood.description = ``;