var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ كَانَ لَا يَسْتَتِرُ مِنْ بَوْلِهِ وَقَالَ أَبُو مُعَاوِيَةَ يَسْتَنْزِهُ";
abudawood.urdu = "ابن عباس رضی اللہ عنہما سے مرفوعاً اس کے ہم معنی روایت بیان کی ہے۔جریر نے کہا «کان لا یستتر من بولہ» اور ابومعاویہ (محمد بن خازم) کے لفظ ہیں «کان لا یستنزہ من بولہ»۔";
abudawood.hukam = "صحیح بخاری (216)";
abudawood.description = ``;