var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ صَالِحِ بْنِ كَيْسَانَ،عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَيْسَ لِلْوَلِيِّ مَعَ الثَّيِّبِ أَمْرٌ،وَالْيَتِيمَةُ تُسْتَأْمَرُ،وَصَمْتُهَا إِقْرَارُهَا.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے رسول اللہ ﷺ نے فرمایا ’’ولی کو بیوہ کے معاملے میں کوئی دخل حاصل نہیں ہے۔اور یتیم لڑکی سے مشورہ کیا جائے اور اس کی خاموشی اس کا اقرار ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ النسائي (3265)`;