var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ أَبِيهِ،عَنْ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَيْ يَزِيدَ الْأَنْصَارِيَّيْنِ،عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الْأَنْصَارِيَّةِ،أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ،فَجَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَذَكَرَتْ ذَلِكَ لَهُ،فَرَدَّ نِكَاحَهَا.";
abudawood.urdu = "سیدہ خنساء بنت خذام انصاریہ رضی اللہ عنہا کا بیان ہے کہ اس کے والد نے اس کی شادی کر دی جبکہ وہ بیوہ تھی۔اس نے یہ نکاح ناپسند کیا اور پھر رسول اللہ ﷺ کی خدمت میں آئی اور آپ ﷺ کے سامنے اس کا ذکر کیا تو رسول اللہ ﷺ نے اس کا نکاح رد (فسخ کر دیا) کر دیا۔";
abudawood.hukam = "صحیح بخاری (5138)";
abudawood.description = ``;