var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ أَبِي سَلَمَةَ،قَالَ: سَأَلْتُ عَائِشَةَ رَضِي اللَّهُ عَنْهَا عَنْ صَدَاقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَت:ْ ثِنْتَا عَشْرَةَ أُوقِيَّةً وَنَشٌّ،فَقُلْتُ: وَمَا نَشٌّ؟ قَالَتْ: نِصْفُ أُوقِيَّةٍ.";
abudawood.urdu = "ابوسلمہ کہتے ہیں کہ میں نے سیدہ عائشہ رضی اللہ عنہا سے رسول اللہ ﷺ کے حق مہر کے بارے میں پوچھا تو انہوں نے بتایا کہ بارہ اوقیہ اور نش۔میں نے کہا: نش کیا ہے؟ انہوں نے کہا:،آدھا اوقیہ۔";
abudawood.hukam = "صحیح مسلم (1426)";
abudawood.description = ``;