var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ،حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ عَنِ ابْنِ الْمُبَارَكِ،عَنْ يُونُسَ عَنِ الزُّهْرِيِّ،أَنَّ النَّجَاشِيَّ زَوَّجَ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, عَلَى صَدَاقِ أَرْبَعَةِ آلَافِ دِرْهَمٍ،وَكَتَبَ بِذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَبِلَ.";
abudawood.urdu = "امام زہری رحمہ اللہ کا بیان ہے کہ نجاشی نے ام حبیبہ بنت ابی سفیان رضی اللہ عنہا کا رسول اللہ ﷺ سے نکاح کر دیا،اور چار ہزار درہم مہر ادا کیا۔اور یہ خبر رسول اللہ ﷺ کو لکھ بھیجی تو آپ ﷺ نے اسے قبول فرما لیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل<br>وانظر الحدیث السابق (2107)`;
abudawood.anwaar = [80,1];