var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ،حَدَّثَنِي أَبِي حَفْصُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ الْبَاهِلِيِّ،عَنْ عِسْلٍ،عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ،عَنْ أَبِي هُرَيْرَةَ... نَحْوَ هَذِهِ الْقِصَّةِ, لَمْ يَذْكُرِ الْإِزَارَ وَالْخَاتَمَ فَقَالَ: مَا تَحْفَظُ مِنَ الْقُرْآنِ؟،قَالَ: سُورَةَ الْبَقَرَةِ،أَوِ الَّتِي تَلِيهَا،قَالَ: فَقُمْ،فَعَلِّمْهَا عِشْرِينَ آيَةً،وَهِيَ امْرَأَتُكَ . حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے اسی قصہ کی مانند ذکر کیا مگر اس میں تہ بند اور چھلے کا ذکر نہیں ہے۔آپ ﷺ نے اس سے پوچھا ’’تجھے قرآن کس قدر یاد ہے؟‘‘ اس نے کہا: سورۃ البقرہ یا اس کے ساتھ والی۔آپ ﷺ نے فرمایا ’’جاؤ،اسے بیس آیتیں پڑھا دو اور یہ تمہاری بیوی ہوئی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عسل : ضعیف وضعفہ جمھور الأئمۃ (مجمع الزوائد 267/2)`;
abudawood.anwaar = [80,1];