var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبِي،حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ،عَنْ مَكْحُولٍ نَحْوَ خَبَرِ سَهْلٍ, قَالَ: وَكَانَ مَكْحُولٌ يَقُولُ: لَيْسَ ذَلِكَ لِأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
abudawood.urdu = "محمد بن راشد نے مکحول سے سیدنا سہل بن سعد رضی اللہ عنہ کی روایت کی مانند بیان کیا،مکحول کہا کرتے تھے کہ یہ عمل رسول اللہ ﷺ کے بعد کسی اور کے لیے روا نہیں ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `إسنادہ حسن إلی مکحول، وھذا من قولہ`;