var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ،أَخْبَرَنَا شُعْبَةُ عَنِ الْعَلَاءِ ابْنَ أَخِي شُعَيْبٍ الرَّازِيِّ،عَنْ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ،عَنْ رَجُلٍ مِنْ بَنِي سُلَيْمٍ،قَالَ: خَطَبْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَامَةَ بِنْتَ عَبْدِ الْمُطَّلِبِ،فَأَنْكَحَنِي مِنْ غَيْرِ أَنْ يَتَشَهَّدَ.";
abudawood.urdu = "اسمعیل بن ابراہیم،بنو سلیم کے ایک شخص روایت کرتے ہیں کہ میں نے نبی کریم ﷺ سے امامہ بنت عبدالمطلب کا رشتہ طلب کیا تو آپ ﷺ نے اس کا مجھ سے نکاح کر دیا اور خطبہ بھی نہ پڑھا۔ہمیں ابوعیسیٰ نے بتایا کہ امام ابوداؤد رحمہ اللہ سے پوچھا گیا: کیا یہ جائز ہے؟ انہوں نے کہا: ہاں،اس بارے میں نبی کریم ﷺ سے احادیث آتی ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>إسماعیل بن إبراہیم : مجہول،(تقریب التہذیب: 422)<br>وسمع من رجل عن العلاء بہ والرجل إسحاق بن عبد اللّٰہ کما في ھامش التاریخ الکبیر للبخاري (343/1)<br>وللحدیث شاہد ’’ إسنادہ مجہول ‘‘`;
abudawood.anwaar = [80,1];