var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَأَبُو كَامِلٍ،قَالَا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ: قَالَتْ: تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سَبْعٍ, قَالَ سُلَيْمَانُ-أَوْ سِتٍّ،وَدَخَلَ بِي وَأَنَا بِنْتُ تِسْعٍ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے مجھ سے شادی کی تو اس وقت میری عمر سات سال تھی۔سلیمان نے کہا: یا چھ سال۔اور مجھ سے ملاپ ہوا (میں آپ ﷺ کے گھر بھیجی گئی) تو میں نو سال کی تھی۔";
abudawood.hukam = "صحیح بخاری (3896) صحیح مسلم (1422)";
abudawood.description = ``;