var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ،عَنْ هُشَيْمٍ،عَنْ حُمَيْدٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: لَمَّا أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةَ, أَقَامَ عِنْدَهَا ثَلَاثًا-. زَادَ عُثْمَانُ وَكَانَتْ ثَيِّبًا. وقَالَ،حَدَّثَنِي هُشَيْمٌ،أَخْبَرَنَا حُمَيْدٌ،أَخْبَرَنَا أَنَسٌ.";
abudawood.urdu = "سیدناانس بن مالک رضی اللہ عنہ کا بیان ہے کہ جب رسول اللہ ﷺ نے صفیہ (صفیہ بنت حیی) کو لے لیا (شادی کر لی) تو ان کے ہاں تین دن اقامت کی۔عثمان بن ابی شیبہ نے مزید کہا کہ وہ بیوہ تھیں۔اور (ان کی سند میں تصریح تحدیث و اخبار ہے۔) انہوں نے کہا: «حدثنی ہشیم ،أخبرنا حمید ،أخبرنا أنس»۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;