var abudawood = {};
abudawood.arabic = "حَدَّثَنَا كَثِيرٌ يَعْنِي ابْنَ عُبَيْدٍ،حَدَّثَنَا أَبُو حَيْوَةَ،عَنْ شُعَيْبٍ،عَنْ غَيْلَانَ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ مِثْلَهُ.";
abudawood.urdu = "عکرمہ رحمہ اللہ،سیدنا ابن عباس رضی اللہ عنہما سے اس کی مثل روایت کرتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>غیلان بن أنس مستور (مجھول الحال) روی عنہ جماعۃ وذکرہ ابن حبان فی الثقات (13/9)<br>ولحدیثہ بعض الشواھد منھا الحدیث السابق (الأصل : 2125)`;
abudawood.anwaar = [80,2];