var abudawood = {};
abudawood.arabic = "حَدَّثَنَامُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ،حَدَّثَنَا شَرِيكٌ،عَنْ مَنْصُورٍ،عَنْ طَلْحَةَ،عَنْ خَيْثَمَةَ،عَنْ عَائِشَةَ, قَالَتْ: أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُدْخِلَ امْرَأَةً عَلَى زَوْجِهَا،قَبْلَ أَنْ يُعْطِيَهَا شَيْئًا. قَالَ أَبو دَاود: وَخَيْثَمَةُ لَمْ يَسْمَعْ مِنْ عَائِشَةَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ ﷺ نے مجھے حکم دیا کہ کسی عورت کو اس کے شوہر پر پیش نہ کروں جب تک کہ وہ اس کو کوئی چیز نہ دیدے۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ خیثمہ (عبدالرحمٰن جعفی) نے سیدہ عائشہ رضی اللہ عنہا سے نہیں سنا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1992)<br>خیثمۃ لم یسمع من عائشۃ رضي اللّٰہ عنھا کما قال أبو داود وغیرہ و شریک القاضي عنعن`;
abudawood.anwaar = [81,1];