var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ،عَنْ سُهَيْلٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَّأَ الْإِنْسَانَ إِذَا تَزَوَّجَ،قَالَ: بَارَكَ اللَّهُ لَكَ،وَبَارَكَ عَلَيْكَ،وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب کسی کو اس کی شادی کی مبارک باد دیتے تو فرماتے «بارک اللہ لک وبارک علیک وجمع بینکما فی خیر» اللہ تمہیں برکت دے،تم پر اپنی برکت فرمائے اور تم دونوں کو خیر کے ساتھ اکٹھا رکھے؟";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2445)
أخرجہ الترمذي (1091 وسندہ صحیح)`;