var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ،حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمُبَارَكِ،عَنْ يَحْيَى،عَنْ يَزِيدَ بْنِ نُعَيْمٍ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ... أَنَّ رَجُلًا, يُقَالُ لَهُ: بَصْرَةُ بْنُ أَكْثَمَ نَكَحَ امْرَأَةً فَذَكَرَ مَعْنَاهُ زَادَ: وَفَرَّقَ بَيْنَهُمَا. وَحَدِيثُ ابْنِ جُرَيْجٍ أَتَمُّ.";
abudawood.urdu = "یحییٰ بن ابی کثیر نے یزید بن نعیم سے انہوں نے سعید بن مسیب رحمہ اللہ سے روایت کیا کہ ایک شخص نے،جسے بصرہ بن اکثم کہا جاتا تھا،ایک عورت سے نکاح کیا،اور مذکورہ بالا حدیث کے ہم معنی بیان کیا،اور اضافہ کیا کہ ان کے مابین تفریق کر دی۔اور ابن جریج کی روایت زیادہ کامل ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل،سعید بن المسیب رحمہ اللّٰہ من کبار التابعین (انظر التقریب : 2396)`;
abudawood.anwaar = [81,1];