var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا هَمَّامٌ،حَدَّثَنَا قَتَادَةُ عَنِ النَّضْرِ بْنِ أَنَسٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَال:َ مَنْ كَانَتْ لَهُ امْرَأَتَانِ،فَمَالَ إِلَى إِحْدَاهُمَا, جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ مَائِلٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ،نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس شخص کی دو بیویاں ہوں اور پھر وہ کسی ایک کی طرف مائل ہو گیا تو وہ قیامت کے روز اس کیفیت میں آئے گا کہ اس کا ایک پہلو جھکا ہوا ہو گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1141) نسائی (339) ابن ماجہ (1969)<br>قتادۃ عنعن<br>وللحدیث شاہد عند أبي نعیم في أخبار أصبہان (300/2) فیہ محمد بن الحارث الحارثي ضعیف (تقریب التہذیب: 5797)`;
abudawood.anwaar = [81,1];