var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ فَيَعْدِلُ،وَيَقُولُ: اللَّهُمَّ هَذَا قَسْمِي فِيمَا أَمْلِكُ،فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُ. قَالَ أَبو دَاود: يَعْنِي الْقَلْبَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ (اپنی ازواج محترمات کے مابین) تقسیم کرتے اور عدل کرتے اور فرمایا کرتے ’’اے اللہ! یہ میری تقسیم ہے جو میرے بس میں ہے۔اور اس بات میں مجھے ملامت نہ فرمانا جس کا تو مالک ہے اور میرا اس پر اختیار نہیں۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: اس سے مراد دل (کا میلان) ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3235)
أخرجہ الترمذي (1140 وسندہ صحیح) والنسائي (3395 وسندہ صحیح) وابن ماجہ (1971 وسندہ صحیح) أبو قلابۃ برئ من التدلیس وباقی السند صحیح`;