var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ،أَخْبَرَنِي اللَّيْثُ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ أَبِي الْخَيْرِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, أَنَّهُ قَالَ: إِنَّ أَحَقَّ الشُّرُوطِ أَنْ تُوفُوا بِهِ: مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ.";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ رسول اللہ ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’شرطوں میں سے اہم ترین شرط جس کا پورا کرنا تم پر واجب ہے،وہ ہے جس کی بنا پر تم نے (بیویوں کی) عصمتوں کو حلال کیا ہو۔‘‘";
abudawood.hukam = "صحیح بخاری (2721) صحیح مسلم (1418)";
abudawood.description = ``;