var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ،حَدَّثَنَا جَرِيرٌ عَنِ الْأَعْمَشِ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَال:َ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ،فَلَمْ تَأْتِهِ فَبَاتَ غَضْبَانَ عَلَيْهَا, لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’جب شوہر بیوی کو اپنے بستر پر بلائے اور وہ نہ آئے اور شوہر غصہ میں رات گزار دے تو فرشتے اس بیوی پر صبح ہونے تک لعنت کرتے رہتے ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (5193) صحیح مسلم (1436)";
abudawood.description = ``;