var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ عَلِيِّ بْنِ زَيْدٍ،عَنْ أَبِي حُرَّةَ الرَّقَاشِيِّ،عَنْ عَمِّهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ فَإِنْ خِفْتُمْ نُشُوزَهُنَّ, فَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ. قَالَ حَمَّادٌ: يَعْنِي: النِّكَاحَ.";
abudawood.urdu = "ابوحرہ رقاشی اپنے چچا سے بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’اگر تمہیں ان سے نافرمانی اور عدم اطاعت کا اندیشہ ہو تو انہیں بستروں سے علیحدہ کر دو۔‘‘ حماد نے کہا: اس سے مراد مباشرت ہے۔(ہمبستری نہ کرو۔)";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>علي بن زید بن جدعان ضعیف<br>والقرآن یغني عن حدیثہ`;
abudawood.anwaar = [81,1];