var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ الْأَوْدِيِّ،عَنْ عَبْدِ الرَّحْمَنِ الْمُسْلِيِّ عَنِ الْأَشْعَثِ بْنِ قَيْسٍ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يُسْأَلُ الرَّجُلُ فِيمَا ضَرَبَ امْرَأَتَهُ.";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’شوہر سے بیوی کو مارنے کے سلسلے میں سوال نہیں کیا جائے گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3268)`;