var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،حَدَّثَنِي يُونُسُ بْنُ عُبَيْدٍ،عَنْ عَمْرِو بْنِ سَعِيدٍ،عَنْ أَبِي زُرْعَةَ،عَنْ جَرِيرٍ،قَال:َ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظْرَةِ الْفَجْأَةِ؟ فَقَالَ: اصْرِفْ بَصَرَكَ.";
abudawood.urdu = "سیدنا جریر بن عبداللہ بجلی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے اچانک نظر پڑ جانے کے متعلق پوچھا تو آپ ﷺ نے فرمایا ’’اپنی نظر پھیر لو۔‘‘";
abudawood.hukam = "صحیح مسلم (2159)";
abudawood.description = ``;