var abudawood = {};
abudawood.arabic = "حَدَّثَنَاإِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ،أَخْبَرَنَا شَرِيكٌ،عَنْ أَبِي رَبِيعَةَ الْإِيَادِيِّ عَنِ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ: يَا عَلِيُّ! لَا تُتْبِعِ النَّظْرَةَ النَّظْرَةَ, فَإِنَّ لَكَ الْأُولَى،وَلَيْسَتْ لَكَ الْآخِرَةُ.";
abudawood.urdu = "ابن بریدہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے سیدنا علی رضی اللہ عنہ نے فرمایا ’’اے علی! نظر کے پیچھے نظر مت لگاؤ،پہلی تمہارے لیے معاف ہے (جو اچانک پڑ گئی) دوسری نہیں (عمدا دیکھنا)۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2777)<br>شریک القاضي مدلس وعنعن<br>وللحدیث شاھد ضعیف عند الحاکم (3/ 123)`;
abudawood.anwaar = [81,2];