var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الْبَزَّازُ الرَّازِيُّ،حَدَّثَنَا مُبَشِّرٌ الْحَلَبِيُّ،عَنْ مُحَمَّدٍ أَبِي غَسَّانَ،عَنْ أَبِي حَازِمٍ،عَنْ سَهْلِ بْنِ سَعْدٍ،حَدَّثَنِي أُبَيُّ بْنُ كَعْبٍ،أَنَّ الْفُتْيَا الَّتِي كَانُوا يَفْتُونَ-أَنَّ الْمَاءَ مِنَ الْمَاءِ-, كَانَتْ رُخْصَةً رَخَّصَهَا رَسُولُ اللَّهِ فِي بَدْءِ الْإِسْلَامِ،ثُمَّ أَمَرَ بِالِاغْتِسَالِ بَعْدُ";
abudawood.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ نے بیان کیا کہ وہ فتویٰ جو لوگ دیا کرتے تھے کہ ’’پانی،پانی سے (لازم آتا) ہے‘‘ ایک رخصت تھی جس کی رسول اللہ ﷺ نے ابتدائے اسلام میں اجازت دی تھی لیکن اس کے بعد غسل کا حکم ارشاد فرمایا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;