var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ عَنِ ابْنِ مَسْعُودٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ, لِتَنْعَتَهَا لِزَوْجِهَا،كَأَنَّمَا يَنْظُرُ إِلَيْهَا.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’کوئی عورت کسی دوسری عورت کے ساتھ بغل گیر ہو کر یا چمٹ کر نہ لیٹے اور پھر اپنے شوہر کو اس کے متعلق بتانے لگے گویا وہ اس کی طرف دیکھ رہا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (5241)";
abudawood.description = ``;