var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ عَنِ ابْنِ عَجْلَانَ عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ قَالَ: وَالْأُذُنُ زِنَاهَا الِاسْتِمَاعُ.";
abudawood.urdu = "سیدناابوہریرہ رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی کریم ﷺ سے مذکورہ قصہ بیان کیا،فرمایا ’’کان زنا کرتے ہیں اور ان کی بدکاری سننا ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شاھد في صحیح مسلم (2657) وبہ صح الحدیث`;