var abudawood = {};
abudawood.arabic = "حَدَّثَنَاعَمْرُو بْنُ عَوْنٍ،أَخْبَرَنَا شَرِيكٌ،عَنْ قَيْسِ بْنِ وَهْبٍ،عَنْ أَبِي الْوَدَّاكِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ-وَرَفَعَهُ-،أَنَّهُ قَالَ فِي سَبَايَا أَوْطَاسَ: لَا تُوطَأُ حَامِلٌ حَتَّى تَضَعَ،وَلَا غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَة.";
abudawood.urdu = "سیدناابو سعید خدری رضی اللہ عنہ نے رسول اللہ ﷺ کی طرف نسبت کرتے ہوئے بیان کیا کہ آپ ﷺ نے اوطاس میں پکڑی جانے والی عورتوں کے بارے میں فرمایا تھا ’’کسی حاملہ سے مباشرت نہ کی جائے حتیٰ کہ اس کے بچے کی ولادت ہو جائے اور غیر حاملہ سے بھی مباشرت نہ کی جائے حتیٰ کہ اسے ایک حیض آ جائے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شریک القاضي مدلس وعنعن<br>وحدیث أبي داود الطیالسي (1678) یغني عنہ`;
abudawood.anwaar = [82,1];