var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ الْفَرَاهِيدِيُّ،حَدَّثَنَا هِشَامٌ وَشُعْبَةُ،عَنْ قَتَادَةَ عَنِ الْحَسَنِ،عَنْ أَبِي رَافِعٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَعَدَ بَيْنَ شُعَبِهَا الْأَرْبَعِ،وَأَلْزَقَ الْخِتَانَ بِالْخِتَانِ, فَقَدْ وَجَبَ الْغُسْلُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’(شوہر) جب اس (بیوی) کی چار شاخوں کے درمیان بیٹھے اور ختنے کو ختنے سے ملا دے تو غسل واجب ہو گیا۔‘‘";
abudawood.hukam = "صحیح بخاری (291) صحیح مسلم (248)";
abudawood.description = ``;