var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ،عَنْ وَكِيعٍ،عَنْ سُفْيَانَ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنِ الْحَارِثِ بْنِ مَخْلَدٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَلْعُونٌ مَنْ أَتَى امْرَأَتَهُ فِي دُبُرِهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’ملعون ہے وہ شخص جو بیوی سے دبر میں مباشرت کرتا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3193)
أخرجہ ابن ماجہ (1923 وسندہ حسن) وللحدیث شواھد کثیرۃ جدًا وھو من الأحادیث المتواترۃ`;