var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَمُسَدَّدٌ،قَالَا: حَدَّثَنَا حَفْصٌ عَنِ الشَّيْبَانِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ،عَنْ خَالَتِهِ مَيْمُونَةَ بِنْتِ الْحَارِثِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يُبَاشِرَ امْرَأَةً مِنْ نِسَائِهِ وَهِيَ حَائِضٌ, أَمَرَهَا أَنْ تَتَّزِرَ،ثُمَّ يُبَاشِرُهَا.";
abudawood.urdu = "ام المؤمنین سیدہ میمونہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ جب اپنی کسی بیوی کے ساتھ لیٹنا چاہتے اور وہ حیض سے ہوتی،تو اسے کہتے کہ اپنی تہ بند خوب اچھی طرح باندھ لے،پھر اس کے ساتھ لیٹ جاتے۔";
abudawood.hukam = "صحیح بخاری (303) صحیح مسلم (293)";
abudawood.description = ``;