var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ شُعْبَةَ وَغَيْرُهُ،عَنْ سَعِيدٍ،حَدَّثَنِي الْحَكَمُ،عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ مِقْسَمٍ عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, فِي الَّذِي يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ؟ قَالَ: يَتَصَدَّقُ بِدِينَارٍ،أَوْ بِنِصْفِ دِينَارٍ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما،نبی کریم ﷺ سے نقل کرتے ہیں کہ وہ شخص جو اپنی بیوی سے اس کے ایام حیض میں مجامعت کر بیٹھے (اس کی بابت) آپ ﷺ نے فرمایا ’’ایک دینار صدقہ دے یا آدھا دینار۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابو داود (264) ترمذی (136،137) ابن ماجہ (640) نسائی (290)<br>روایۃ الإمام شعبۃ عن المدلسین محمولۃ علٰی سماعہم فالسند صحیح و لکن شعبۃ رجع عن رفع ھذا الحدیث،ولعل الموقوف أرجح`;
abudawood.anwaar = [82,1];