var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ،حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ،عَنْ عَلِيِّ بْنِ الْحَكَمِ الْبُنَانِيِّ،عَنْ أَبِي الْحَسَنِ الْجَزَرِيِّ،عَنْ مِقْسَمٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: إِذَا أَصَابَهَا فِي الدَّمِ, فَدِينَارٌ،وَإِذَا أَصَابَهَا فِي انْقِطَاعِ الدَّمِ, فَنِصْفُ دِينَارٍ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما کہتے ہیں کہ اگر خون کے دنوں میں مباشرت کی ہو تو ایک دینار صدقہ کرے اور اگر خون رک جانے کے دنوں میں کی ہو تو آدھا دینار۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>انظر حدیث السابق (265)`;
abudawood.anwaar = [82,1];