var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي عَمْرٌو عَنِ ابْنِ شِهَابٍ،عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْمَاءُ مِنَ الْمَاءِ. وَكَانَ أَبُو سَلَمَةَ يَفْعَلُ ذَلِكَ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’پانی پانی سے ہے۔“ اور ابوسلمہ بن عبدالرحمٰن (سیدنا ابوسعید خدری رضی اللہ عنہ سے روایت کرنے والے) یہی کرتے تھے۔(یعنی انزال ہونے ہی پر غسل کو واجب جانتے تھے)";
abudawood.hukam = "صحیح مسلم (343)";
abudawood.description = ``;