var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ،عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى،عَنْ عِكْرِمَةَ،عَنْ يَحْيَى بْنِ يَعْمَرَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ،قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَيْسَ مِنَّا مَنْ خَبَّبَ امْرَأَةً عَلَى زَوْجِهَا،أَوْ عَبْدًا عَلَى سَيِّدِهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’وہ شخص ہم میں سے نہیں ہے جو کسی عورت کو اس کے شوہر کے خلاف ابھارے یا غلام کو اس کے مالک کے خلاف کر دے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;