var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لَا تَسْأَلِ الْمَرْأَةُ طَلَاقَ أُخْتِهَا, لِتَسْتَفْرِغَ صَحْفَتَهَا وَلِتَنْكِحَ, فَإِنَّمَا لَهَا مَا قُدِّرَ لَهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’کوئی عورت اپنی (دینی) بہن کی طلاق کا مطالبہ نہ کرے کہ اس طرح اس کا پیالہ (اپنی خاطر) خالی کرا لے۔اسے چاہیئے کہ نکاح کر لے،اس کو وہی کچھ ملے گا جو اس کے لیے مقدر کیا گیا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6601)";
abudawood.description = ``;