var abudawood = {};
abudawood.arabic = "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ،حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ،عَنْ مُعَرِّفِ بْنِ وَاصِلٍ،عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: أَبْغَضُ الْحَلَالِ إِلَى اللَّهِ تَعَالَى الطَّلَاقُ.";
abudawood.urdu = "محارب بن دثار،سیدنا ابن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’اللہ کے ہاں حلال کاموں میں سب سے ناپسندیدہ کام طلاق ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3280)
محمد بن خالد الوھبي صدوق انظر التقریب (5848)`;