var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طْلَحَةَ،عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ،أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ،فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مُرْهُ فَلْيُرَاجِعْهَا،ثُمَّ لِيُطَلِّقْهَا إِذَا طَهُرَتْ أَوْ وَهِيَ حَامِلٌ.";
abudawood.urdu = "سالم‘سیدنا ابن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ انہوں نے اپنی بیوی کو ایام حیض میں طلاق دے دی تو سیدنا عمر رضی اللہ عنہ نے نبی کریم ﷺ سے اس کا ذکر کیا۔آپ ﷺ نے فرمایا ’’اس کو حکم دو کہ اس سے رجوع کرے،پھر جب پاک ہو تو طلاق دے یا جب وہ حمل سے ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (1471)";
abudawood.description = ``;