var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ أَيُّوبَ عَنِ ابْنِ سِيرِينَ،أَخْبَرَنِي يُونُسُ بْنُ جُبَيْرٍ،أَنَّهُ سَأَلَ ابْنَ عُمَرَ،فَقَالَ: كَمْ طَلَّقْتَ امْرَأَتَكَ؟ فَقَالَ: وَاحِدَةً.";
abudawood.urdu = "یونس بن جبیر کہتے ہیں کہ میں نے سیدنا ابن عمر رضی اللہ عنہما سے پوچھا تھا کہ آپ نے اپنی بیوی کو کتنی طلاقیں دی تھیں؟ انہوں نے کہا: ایک۔";
abudawood.hukam = "إسنادہ صحیح، صحیح بخاری (5333) صحیح مسلم (1471)";
abudawood.description = ``;