var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ ح،وحَدَّثَنَا ابْنُ الصَّبَّاحِ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ،قَالَا: حَدَّثَنَا مَطَرٌ الْوَرَّاقُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا طَلَاقَ إِلَّا فِيمَا تَمْلِكُ،وَلَا عِتْقَ إِلَّا فِيمَا تَمْلِكُ،وَلَا بَيْعَ إِلَّا فِيمَا تَمْلِكُ زَادَ ابْنُ الصَّبَّاحِ: وَلَا وَفَاءَ نَذْرٍ إِلَّا فِيمَا تَمْلِكُ.";
abudawood.urdu = "عمرو بن شعیب اپنے والد (شعیب) سے اور وہ اپنے دادا (عبداللہ بن عمرو رضی اللہ عنہما) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’مالک بنے بغیر طلاق نہیں،مالک بنے بغیر آزاد کرنا نہیں،اور مالک بنے بغیر فروخت نہیں۔‘‘ ابن صباح نے یہ اضافہ بھی بیان کیا ’’اور مالک بنے بغیر کسی نذر کا پورا کرنا نہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3282)
رواہ الترمذي (1181 وسندہ حسن) وابن ماجہ (2047 وسندہ حسن)`;