var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،أَخْبَرَنَا أَبُو أُسَامَةَ عَنِ الْوَلِيدِ بْنِ كَثِيرٍ،حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ،عَنْ عَمْرِو بْنِ شُعَيْبٍ بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ مَنْ حَلَفَ عَلَى مَعْصِيَةٍ, فَلَا يَمِينَ لَهُ،وَمَنْ حَلَفَ عَلَى قَطِيعَةِ رَحِمٍ, فَلَا يَمِينَ لَهُ.";
abudawood.urdu = "عبدالرحمٰن بن حارث نے بواسطہ عمرو بن شعیب اس کی سند سے (عبداللہ بن عمرو رضی اللہ عنہما سے) مذکورہ بالا حدیث کے ہم معنی روایت کیا اور مزید کہا ’’جس نے کسی معصیت اور گناہ کے کام پر قسم اٹھائی ہو،اس کی قسم نہیں،اور جس نے قطع رحمی کی قسم اٹھائی ہو،اس کی قسم نہیں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2190)`;