var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ يَحْيَى ابْنِ عَبْدِ اللَّهِ بْنِ سَالِمٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ الْمَخْزُومِيِّ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... قَالَ فِي هَذَا الْخَبَرِ زَادَ وَلَا نَذْرَ إِلَّا فِيمَا ابْتُغِيَ بِهِ وَجْهُ اللَّهِ تَعَالَى ذِكْرُهُ.";
abudawood.urdu = "عبدالرحمٰن بن حارث مخزومی نے بواسطہ عمرو بن شعیب،اپنے والد سے اور وہ اپنے دادا سے،انہوں نے نبی کریم ﷺ سے یہی مذکورہ خبر روایت کی اور مزید کہا: ’’نذر وہی معتبر ہے جس میں اللہ کی رضا طلب کی گئی ہو۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2190)`;