var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَبِيبٍ،عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنِ ابْنِ مَاهَكَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثَلَاثٌ جَدُّهُنَّ جَدٌّ،وَهَزْلُهُنَّ جَدٌّ: النِّكَاحُ،وَالطَّلَاقُ،وَالرَّجْعَةُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’تین باتیں ایسی ہیں اگر کوئی ان کو حقیقت اور سنجیدگی میں کہے،تو حقیقت ہیں اور ہنسی مزاح میں کہے،تو بھی حقیقت ہیں۔نکاح،طلاق اور (طلاق سے) رجوع۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3284)
أخرجہ الترمذي (1184 وسندہ حسن) وابن ماجہ (2039 وسندہ حسن)`;