var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ،حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ أَبِي الْمُتَوَكِّلِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ،ثُمَّ بَدَا لَهُ أَنْ يُعَاوِدَ, فَلْيَتَوَضَّأْ بَيْنَهُمَا وُضُوءًا";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’تم میں سے جو کوئی اپنی اہلیہ کے پاس آئے،پھر اس کا خیال دوبارہ آنے کا ہو تو چاہیئے کہ ان دونوں (باریوں) کے درمیان وضو کر لے۔‘‘";
abudawood.hukam = "صحیح مسلم (308)";
abudawood.description = ``;