var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي الضُّحَى،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ،قَالَتْ: خَيَّرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَرْنَاهُ،فَلَمْ يَعُدَّ ذَلِكَ شَيْئًا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے ہم کو اختیار دیا تو ہم نے آپ ﷺ ہی کو اختیار کیا تھا،چنانچہ اس کو کچھ بھی شمار نہ کیا گیا۔";
abudawood.hukam = "صحیح بخاری (5262) صحیح مسلم (1477)";
abudawood.description = ``;