var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يُونُسَ النَّسَائِيُّ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ حَدَّثَهُمْ،عَنْ مُحَمَّدِ بْنِ إِدْرِيسَ،حَدَّثَنِي عَمِّي مُحَمَّدُ بْنُ عَلِيٍّ عَنِ ابْنِ السَّائِبِ،عَنْ نَافِعِ بْنِ عُجَيْرٍ،عَنْ رُكَانَةَ بْنِ عَبْدِ يَزِيدَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, بِهَذَا الْحَدِيثِ.";
abudawood.urdu = "محمد بن یونس نسائی اپنی سند سے نافع بن عجیر سے،وہ رکانہ بن عبد یزید سے وہ نبی کریم ﷺ سے یہی حدیث بیان کرتے ہیں۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2206)`;