var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ،عَنْ قَتَادَةَ،عَنْ زُرَارَةَ بْنِ أَوْفَى،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِنَّ اللَّهَ تَجَاوَزَ لِأُمَّتِي عَمَّا لَمْ تَتَكَلَّمْ بِهِ،أَوْ تَعْمَلْ بِهِ،وَبِمَا حَدَّثَتْ بِهِ أَنْفُسَهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’بلاشبہ اللہ عزوجل نے میری امت سے وہ امور معاف فرما دیے ہیں جن کے متعلق انہوں نے گفتگو نہ کی ہو یا عمل نہ کیا ہو،اور وہ جس کے متعلق محض دل میں خیال آیا ہو۔‘‘";
abudawood.hukam = "صحیح بخاری (2528) صحیح مسلم (127)";
abudawood.description = ``;