var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّهُ قَالَ: ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ تُصِيبُهُ الْجَنَابَةُ مِنَ اللَّيْلِ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ نے رسول اللہ ﷺ سے ذکر کیا کہ مجھے رات کو جنابت لاحق ہو جاتی ہے (یعنی نہانے کی ضرورت پڑتی ہے) تو آپ ﷺ نے فرمایا ’’وضو کرو،اپنی شرمگاہ دھو اور پھر سو جایا کرو۔‘‘";
abudawood.hukam = "صحیح بخاری (290) صحیح مسلم (306)";
abudawood.description = ``;