var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ ح،وحَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا عَبْدُ الْوَاحِدِ وَخَالِدٌ الطَّحَّانُ الْمَعْنَى كُلُّهُمْ،عَنْ خَالِدٍ،عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ،أَنَّ رَجُلًا قَالَ لِامْرَأَتِهِ: يَا أُخَيَّةُ! فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أُخْتُكَ هِيَ؟!. فَكَرِهَ ذَلِكَ،وَنَهَى عَنْهُ.";
abudawood.urdu = "ابو تمیمہ ھجیمی سے روایت ہے کہ ایک شخص نے اپنی بیوی کو کہا: اے بہن! تو رسول اللہ ﷺ نے فرمایا ’’کیا یہ تیری بہن ہے؟‘‘ پس آپ ﷺ نے اس انداز گفتگو کو ناپسند کیا اور اس سے منع فرمایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل : أبو تمیمۃ الھجیمي طریف بن مجالد : تابعي من الطبقۃ الثالثۃ<br>انظر التقریب(3014)`;
abudawood.anwaar = [83,1];