var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ الْحَرَّانِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنِ ابْنِ إِسْحَاقَ بِهَذَا الْإِسْنَادِ نَحْوَهُ إِلَّا أَنَّهُ قَالَ: وَالْعَرَقُ: مِكْتَلٌ يَسَعُ ثَلَاثِينَ صَاعًا. قَالَ أَبو دَاود: وَهَذَا أَصَحُّ مِنْ حَدِيثِ يَحْيَى بْنِ آدَمَ.";
abudawood.urdu = "ابن اسحاق نے اسی سند سے مذکورہ روایت کی مانند روایت کیا مگر کہا کہ «العرق» وہ ٹوکرا ہوتا ہے جس میں تیس صاع کھجور آتی ہے۔امام ابوداؤد رحمہ اللہ فرماتے ہیں: یہ روایت یحییٰ بن آدم کی (مذکورہ بالا) روایت سے زیادہ صحیح ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (2214)`;
abudawood.anwaar = [84,1];