var abudawood = {};
abudawood.arabic = "حَدَّثَنَاابْنُ السَّرْحِ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي ابْنُ لَهِيعَةَ وَعَمْرُو بْنُ الْحَارِثِ،عَنْ بُكَيْرِ بْنِ الْأَشَجِّ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ... بِهَذَا الْخَبَرِ،قَالَ: فَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ،فَأَعْطَاهُ إِيَّاهُ،وَهُوَ قَرِيبٌ مِنْ خَمْسَةِ عَشَرَ صَاعًا،قَالَ: تَصَدَّقْ بِهَذَا،قَالَ: يَا رَسُولَ اللَّهِ! عَلَى أَفْقَرَ مِنِّي،وَمِنْ أَهْلِي؟! فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كُلْهُ أَنْتَ وَأَهْلُكَ.";
abudawood.urdu = "سلیمان بن یسار نے یہ خبر بیان کی اور کہا کہ رسول اللہ ﷺ کے پاس کھجور لائی گئی،آپ نے یہ اسے دے دی جو پندرہ صاع کے قریب تھی اور فرمایا ’’اسے صدقہ کر دو۔‘‘ تو اس نے کہا: اے اللہ کے رسول! کیا اپنے اور اپنے گھر والوں سے زیادہ فقیر لوگوں پر صدقہ کروں؟ آپ ﷺ نے فرمایا ’’تم کھا لو اور تمہارے گھر والے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل<br>وانظر الحدیث السابق (2213)`;
abudawood.anwaar = [84,1];