var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ أَنَّ جَمِيلَةَ،كَانَتْ تَحْتَ أَوْسِ بْنِ الصَّامِتِ،وَكَانَ رَجُلًا بِهِ لَمَمٌ،فَكَانَ إِذَا اشْتَدَّ لَمَمُهُ ظَاهَرَ مِنْ امْرَأَتِهِ،فَأَنْزَلَ اللَّهُ تَعَالَى فِيهِ كَفَّارَةَ الظِّهَارِ.";
abudawood.urdu = "ہشام بن عروہ سے روایت ہے کہ جمیلہ،سیدنا اوس بن صامت کی زوجیت میں تھی اور اوس میں جنسی شہوت کا مادہ زیادہ تھا،جب ان پر اس کا غلبہ ہوتا تو وہ اپنی بیوی سے ظہار کر لیا کرتے تھے۔تو اللہ تعالیٰ نے ان کے مسئلے میں ظہار کے کفارہ کا حکم نازل فرمایا تھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتي (2220)`;