var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَقُتَيْبَةُ بْنُ سَعِيدٍ،قَالَا: حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ: إِذَا أَرَادَ أَنْ يَنَامَ،وَهُوَ جُنُبٌ, تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ کو جب غسل لازم ہوتا اور آپ ﷺ سونا چاہتے تو وضو کر لیتے،نماز والا وضو۔";
abudawood.hukam = "صحیح مسلم (305)";
abudawood.description = ``;