var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ الطَّالَقَانِيُّ،حَدَّثَنَا سُفْيَانُ،حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ،عَنْ عِكْرِمَةَ،أَنَّ رَجُلًا ظَاهَرَ مِنِ امْرَأَتِهِ،ثُمَّ وَاقَعَهَا قَبْلَ أَنَّ يُكَفِّرَ،فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَأَخْبَرَهُ،فَقَالَ: مَا حَمَلَكَ عَلَى مَا صَنَعْتَ؟،قَالَ: رَأَيْتُ بَيَاضَ سَاقِهَا فِي الْقَمَرِ! قَالَ: فَاعْتَزِلْهَا حَتَّى تُكَفِّرَ عَنْكَ .";
abudawood.urdu = "جناب عکرمہ (مولیٰ ابن عباس رضی اللہ عنہما) سے منقول ہے کہ ایک شخص نے اپنی بیوی سے ظہار کر لیا،پھر کفارہ ادا کرنے سے پہلے اس کے ساتھ ہمبستر بھی ہو گیا،اس کے بعد نبی کریم ﷺ کے پاس آیا اور اپنا واقعہ بیان کیا۔آپ ﷺ نے پوچھا ’’تو نے ایسا کیوں کیا؟‘‘ کہنے لگا: میں نے چاندنی میں اس کی پنڈلیوں کی سفیدی دیکھ لی تھی۔آپ ﷺ نے فرمایا ’’تو پھر اب اس سے دور رہنا حتیٰ کہ اپنا کفارہ دے لے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3302)
انظر الحدیث الآتي (2223)`;