var abudawood = {};
abudawood.arabic = "حَدَّثَنَاالزَّعْفَرَانِيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الْحَكَمِ بْنِ أَبَانَ،عَنْ عِكْرِمَةَ،أَنَّ رَجُلًا ظَاهَرَ مِنِ امْرَأَتِهِ،فَرَأَى بَرِيقَ سَاقِهَا فِي الْقَمَرِ،فَوَقَعَ عَلَيْهَا،فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَأَمَرَهُ أَنْ يُكَفِّرَ.";
abudawood.urdu = "جناب عکرمہ رحمہ اللہ سے مروی ہے کہ ایک شخص نے اپنی بیوی سے ظہار کر لیا،پھر چاند کی چاندنی میں اس کی پنڈلی کی سفیدی دیکھی تو اس سے مجامعت کر بیٹھا،تب نبی کریم ﷺ کی خدمت میں آیا،تو آپ ﷺ نے اس کو کفارہ ادا کرنے کا حکم دیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث الآتي (2223)`;