var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ،حَدَّثَنَا إِسْمَاعِيلُ،حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَلَمْ يَذْكُرِ السَّاقَ.";
abudawood.urdu = "جناب عکرمہ رحمہ اللہ سیدنا ابن عباس رضی اللہ عنہما سے وہ نبی کریم ﷺ سے،اسی کی مثل بیان کرتے ہیں،مگر اس میں (اسماعیل راوی نے) ’’پنڈلی‘‘ کا ذکر نہیں کیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (1199 وسندہ حسن) والنسائي (3487 وسندہ حسن) وابن ماجہ (2065 وسندہ حسن)`;