var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ،حَدَّثَنَا حَمَّادٌ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ أَبِي أَسْمَاءَ،عَنْ ثَوْبَانَ،قَالَ: قَالَ: رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّمَا امْرَأَةٍ سَأَلَتْ زَوْجَهَا طَلَاقًا،فِي غَيْرِ مَا بَأْسٍ, فَحَرَامٌ عَلَيْهَا رَائِحَةُ الْجَنَّةِ.";
abudawood.urdu = "سیدنا ثوبان بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو عورت بغیر کسی وجہ کے اپنے شوہر سے طلاق مانگتی ہے اس پر جنت کی خوشبو حرام ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3279)
أخرجہ ابن ماجہ (2055 وسندہ صحیح)`;