var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا عَفَّانُ،حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،أَنَّ زَوْجَ بَرِيرَةَ كَانَ عَبْدًا أَسْوَدَ،يُسَمَّى مُغِيثًا،فَخَيَّرَهَا-يَعْنِي: النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-،وَأَمَرَهَا أَنْ تَعْتَدَّ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے منقول ہے کہ بریرہ رضی اللہ عنہا کا خاوند کالے رنگ کا غلام تھا،جس کا نام مغیث تھا۔رسول اللہ ﷺ نے بریرہ کو اختیار دیا تھا۔(اپنے شوہر کی زوجیت میں رہے یا اس سے آزاد ہو جائے) اور اسے حکم دیا تھا کہ عدت گزارے۔";
abudawood.hukam = "صحیح بخاری (5280)";
abudawood.description = ``;