var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،فِي قِصَّةِ بَرِيرَةَ،قَالَتْ كَانَ زَوْجُهَا عَبْدًا: فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَارَتْ نَفْسَهَا وَلَوْ كَانَ حُرًّا لَمْ يُخَيِّرْهَا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بریرہ کے قصے میں بیان کرتی ہیں کہ اس کا شوہر غلام تھا۔رسول اللہ ﷺ نے بریرہ کو اختیار دیا تو اس نے اپنے آپ کو اختیار کر لیا۔اگر شوہر آزاد ہوتا تو اس کو اختیار نہ دیتے۔";
abudawood.hukam = "صحیح بخاری (2563) صحیح مسلم (1504)";
abudawood.description = ``;