var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ وَالْوَلِيدُ بْنُ عُقْبَةَ،عَنْ زَائِدَةَ،عَنْ سِمَاكٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ بَرِيرَةَ خَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،-وَكَانَ زَوْجُهَا عَبْدًا-.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ بریرہ کو رسول اللہ ﷺ نے اختیار دیا تھا،جبکہ اس کا شوہر غلام تھا۔";
abudawood.hukam = "صحیح مسلم (1504)";
abudawood.description = ``;