var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،أَنَّ زَوْجَ بَرِيرَةَ كَانَ حُرًّا حِينَ أُعْتِقَتْ،وَأَنَّهَا خُيِّرَتْ فَقَالَتْ: مَا أُحِبُّ أَنْ أَكُونَ مَعَهُ،وَأَنَّ لِي كَذَا وَكَذَا .";
abudawood.urdu = "اسود بن یزید،سیدہ عائشہ رضی اللہ عنہا سے بیان کرتے ہیں کہ بریرہ کو جب آزاد کیا گیا تو اس کا شوہر بھی آزاد تھا۔اور بریرہ کو اختیار دیا گیا تو وہ کہنے لگی: میں اس کے ساتھ رہنا پسند نہیں کرتی خواہ مجھے اس اس قدر (مال) بھی کیوں نہ دے دیا جائے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1155) ابن ماجہ (2074)<br>إبراہیم النخعي عنعن وھو مدلس (طبقات المدلسین : 2/35وھو عندنا من الثالثۃ) ولو ثبت عن الأسود لکان معللاً لمخالفۃ جمع من الرواۃ والعدد الکثیر أولی بالحفظ (عند التعارض) من الواحد`;
abudawood.anwaar = [84,1];