var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ،حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ أَبِي جَعْفَرٍ وَعَنْ أَبَانَ بْنِ صَالِحٍ،عَنْ مُجَاهِدٍ وَعَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ بَرِيرَةَ أُعْتِقَتْ وَهِيَ عِنْدَ مُغِيثٍ-عَبْدٍ لِآلِ أَبِي أَحْمَدَ-،فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَقَالَ لَهَا: إِنْ قَرِبَكِ فَلَا خِيَارَ لَكِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ بریرہ کو آزاد کیا گیا تو وہ مغیث کی زوجیت میں تھی جو کہ آل ابی احمد کا غلام تھا،تو رسول اللہ ﷺ نے اس کو اختیار دے دیا اور فرمایا ’’اگر وہ تم سے قریب ہو گیا تو تمہارا اختیار باقی نہیں رہے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن ولہ متابعۃ مردودۃ،عند البیہقي (225/7) والدار قطني (294/3 ح 3733) من أجل محمد بن إبراہیم الشامي لأنہ کذاب`;
abudawood.anwaar = [84,2];