var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،عَنْ إِسْرَائِيلَ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَجُلًا جَاءَ مُسْلِمًا عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَاءَتِ امْرَأَتُهُ مُسْلِمَةً بَعْدَهُ،فَقَالَ: يَا رَسُولَ اللَّهِ! إِنَّهَا قَدْ كَانَتْ أَسْلَمَتْ مَعِي،فَرُدَّهَا عَلَيَّ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ کے دور میں ایک شخص مسلمان ہو کر آیا۔پھر اس کے بعد اس کی بیوی بھی مسلمان ہو کر آ گئی تو اس شخص نے کہا: اے اللہ کے رسول! یہ عورت بھی میرے ساتھ ہی مسلمان ہوئی ہے۔تو آپ ﷺ نے اس کو اس (کے شوہر) کی طرف لوٹا دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1144،2008)<br>سماک عن عکرمۃ :سلسلۃ ضعیفۃ،وإلیہ أشار فی التقریب (2624) وأما عن غیر عکرمۃ فسماک : صدوق حسن الحدیث،إذا روی قبل اختلاطہ`;
abudawood.anwaar = [85,1];