var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،حَدَّثَنَا شُعْبَةُ عَنِ الْحَكَمِ،عَنْ إِبْرَاهِيمَ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ: إِذَا أَرَادَ أَنْ يَأْكُلَ أَوْ يَنَامَ, تَوَضَّأَ –تَعْنِي: وَهُوَ جُنُبٌ-";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ اگر حالت جنابت میں ہوتے اور کچھ کھانا چاہتے یا سونا چاہتے تو وضو کر لیا کرتے تھے۔";
abudawood.hukam = "صحیح مسلم (305)";
abudawood.description = `مشکوۃ المصابیح (4442)`;