var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الرَّحْمَنِ قَاضِي الْكُوفَةِ،عَنْ عِيسَى ابْنِ الْمُخْتَارِ عَنِ ابْنِ أَبِي لَيْلَى،عَنْ حُمَيْضَةَ بْنِ الشَّمَرْدَلِ،عَنْ قَيْسِ بْنِ الْحَارِثِ... بِمَعْنَاهُ.";
abudawood.urdu = "احمد بن ابراہیم نے بیان کیا کہ ہم سے بکر بن عبدالرحمٰن،قاضی کوفہ نے بیان کیا،انہوں نے عیسیٰ بن مختار سے،انہوں نے ابن ابی لیلیٰ سے،انہوں نے حمیضہ بن شمرذل سے،انہوں نے سیدنا قیس بن حارث رضی اللہ عنہ سے مذکورہ بالا حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1952)<br>انظر الحدیث السابق (2241)`;
abudawood.anwaar = [85,1];