var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ،حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ،عَنْ أَبِيهِ،قَالَ: سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ يُحَدِّثُ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ أَبِي وَهْبٍ الْجَيْشَانِيِّ عَنِ الضَّحَّاكِ بْنِ فَيْرُوزَ،عَنْ أَبِيهِ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ! إِنِّي أَسْلَمْتُ وَتَحْتِي أُخْتَانِ؟ قَال:َ طَلِّقْ أَيَّتَهُمَا شِئْتَ.";
abudawood.urdu = "سیدنا فیروز (دیلمی) رضی اللہ عنہ سے مروی ہے،وہ کہتے ہیں کہ میں نے کہا: اے اللہ کے رسول! میں نے اسلام قبول کیا ہے اور میری زوجیت میں دو بہنیں ہیں۔آپ ﷺ نے فرمایا ’’ان میں سے کسی ایک کو طلاق دے دو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3178)
أبو وھب الجیشاني والضحاک بن فیروز صدوقان وثقھما الترمذي وابن حبان وغیرھما`;