var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى،حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،حَدَّثَنِي عَبَّاسُ بْنُ سَهْلٍ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَاصِمِ ابْنِ عَدِيٍّ: أَمْسِكِ الْمَرْأَةَ عِنْدَكَ حَتَّى تَلِدَ.";
abudawood.urdu = "سیدنا سہل بن سعد ساعدی رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے عاصم بن عدی سے فرمایا ’’عورت کو اپنے ہاں روکے رکھو حتیٰ کہ بچہ جن لے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;