var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ, قَالَ: أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ, قَالَ: حَضَرْتُ لِعَانَهُمَا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَأَنَا ابْنُ خَمْسَ عَشْرَةَ سَنَةً... وَسَاقَ الْحَدِيثَ. قَالَ فِيهِ: ثُمَّ خَرَجَتْ حَامِلًا،فَكَانَ الْوَلَدُ يُدْعَى إِلَى أُمِّهِ.";
abudawood.urdu = "سیدنا سہل بن سعد ساعدی رضی اللہ عنہ کہتے ہیں کہ میں ان کے لعان کے موقع پر رسول اللہ ﷺ کے ہاں حاضر تھا۔میری عمر اس وقت پندرہ سال تھی۔اور حدیث بیان کی۔اس میں ذکر کیا کہ پھر وہ حاملہ نکلی اور بچہ اپنی ماں کی طرف منسوب کیا جاتا تھا۔";
abudawood.hukam = "صحیح مسلم (1492)";
abudawood.description = ``;