var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ،حَدَّثَنَا الْفِرْيَابِيُّ عَنِ الْأَوْزَاعِيِّ عَنِ الزُّهْرِيِّ،عَنْ سَهْلِ... بْنِ سَعْدٍ السَّاعِدِيِّ بِهَذَا الْخَبَرِ،قَالَ: فَكَانَ يُدْعَى-يَعْنِي: الْوَلَدَ-لِأُمِّهِ. حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ.";
abudawood.urdu = "سیدنا سہل بن سعد ساعدی رضی اللہ عنہ نے یہ خبر بیان کی تو کہا کہ پس بچے کو اپنی ماں کی طرف نسبت کر کے پکارا جاتا تھا۔";
abudawood.hukam = "صحیح بخاری (4745)";
abudawood.description = ``;