var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ،حَدَّثَنَا فُلَيْحٌ عَنِ الزُّهْرِيِّ،عَنْ سَهْلِ... بْنِ سَعْدٍ فِي هَذَا الْحَدِيثِ وَكَانَتْ حَامِلًا،فَأَنْكَرَ حَمْلَهَا،فَكَانَ ابْنُهَا يُدْعَى إِلَيْهَا،ثُمَّ جَرَتِ السُّنَّةُ فِي الْمِيرَاثِ أَنْ يَرِثَهَا،وَتَرِثَ مِنْهُ مَا فَرَضَ اللَّهُ عَزَّ وَجَلَّ لَهَا.";
abudawood.urdu = "سیدنا سہل بن سعد رضی اللہ عنہ اس حدیث میں بیان کرتے ہیں کہ وہ عورت حاملہ تھی تو شوہر نے اس کے حمل کا انکار کیا۔چنانچہ لڑکے کو ماں کی نسبت سے پکارا جاتا تھا۔اور پھر وراثت میں بھی یہی طریقہ چل پڑا کہ بچہ اپنی ماں کا وارث بنتا اور ماں اپنے بچے کی وارث بنتی جتنا کہ اللہ عزوجل نے اس کا حصہ مقرر کیا ہے۔";
abudawood.hukam = "صحیح بخاری (6746)";
abudawood.description = ``;