var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ الشُّعَيْرِيُّ،حَدَّثَنَا سُفْيَانُ،عَنْ عَاصِمِ بْنِ كُلَيْبٍ،عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَمَرَ رَجُلًا-حِينَ أَمَرَ الْمُتَلَاعِنَيْنِ أَنْ يَتَلَاعَنَا-،أَنْ يَضَعَ يَدَهُ عَلَى فِيهِ عِنْدَ الْخَامِسَةِ،يَقُولُ: إِنَّهَا مُوجِبَةٌ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے جب لعان کرنے والوں سے قسمیں کھانے کو کہا تو پانچویں قسم کے وقت آپ نے ایک شخص سے فرمایا ’’اس مرد کے منہ پر ہاتھ رکھو۔اسے کہو یہ واجب کرنے والی ہے (اﷲ کے غضب،لعنت اور عذاب کو)۔";
abudawood.hukam = "صحیح";
abudawood.description = `صرح سفیان بالسماع عند الحمیدي (519 وسندہ صحیح)`;