var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ أَعْرَابِيًّا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: إِنَّ امْرَأَتِي وَلَدَتْ غُلَامًا أَسْوَدَ،وَإِنِّي أُنْكِرُهُ... فَذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ ایک اعرابی نبی کریم ﷺ کی خدمت میں آیا اور کہا: میری بیوی نے بچے کو جنم دیا ہے جو کالے رنگ کا ہے اور مجھے اس پر تعجب ہے۔اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "صحیح بخاری (7314) صحیح مسلم (1500)";
abudawood.description = ``;