var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا مُعْتَمِرٌ،عَنْ سَلْمٍ يَعْنِي ابْنَ أَبِي الزَّيَّادِ،حَدَّثَنِي بَعْضُ أَصْحَابِنَا،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا مُسَاعَاةَ فِي الْإِسْلَامِ, مَنْ سَاعَى فِي الْجَاهِلِيَّةِ, فَقَدْ لَحِقَ بِعَصَبَتِهِ،وَمَنِ ادَّعَى وَلَدًا مِنْ غَيْرِ رِشْدَةٍ, فَلَا يَرِثُ وَلَا يُورَثُ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اسلام میں زناکاری کا کوئی تصور اور مقام نہیں،جس کسی نے ایام جاہلیت میں یہ عمل بد کیا ہو تو بچہ اس کے عصبہ ہی سے ملحق ہو گا۔اور جو کوئی نکاح صحیح کے بغیر کسی بچے کا دعوہ کرے (زنا کی وجہ سے) تو نہ وہ باپ اس بچے کا وارث ہو گا اور نہ وہ بیٹا اس باپ کا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>’’ بعض أصحابنا ‘‘ لم أعرفہ وقال المنذري :’’ في إسنادہ رجل مجہول ‘‘ (عون المعبود 247/2)`;
abudawood.anwaar = [86,1];