var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا أَبِي،عَنْ مُحَمَّدِ بْنِ رَاشِدٍ بِإِسْنَادِهِ وَمَعْنَاهُ،زَادَ: وَهُوَ وَلَدُ زِنَا لِأَهْلِ أُمِّهِ مَنْ كَانُوا, حُرَّةً أَوْ أَمَةً وَذَلِكَ فِيمَا اسْتُلْحِقَ فِي أَوَّلِ الْإِسْلَامِ،فَمَا اقْتُسِمَ مِنْ مَالٍ قَبْلَ الْإِسْلَامِ فَقَدْ مَضَى.";
abudawood.urdu = "محمد بن راشد نے اپنی سند سےاس مذکور حدیث کے ہم معنی بیان کیا اور مزید کہا: یہ ولد الزنا ہو گا اور اپنی ماں کے اہل کی ملکیت ہو گا خواہ کوئی ہوں،آزاد عورت ہو یا کوئی لونڈی۔اور یہ فیصلے اسلام کے اولین دور میں ہوئے تھے۔اور جو مال قبل از اسلام تقسیم ہو چکے وہ ہو چکے۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2265)`;