var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ،حَدَّثَنَا شُعْبَةُ،عَنْ عَلِيِّ بْنِ مُدْرِكٍ،عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ،عَنْ عَبْدِ اللَّهِ ابْنِ نُجَيٍّ،عَنْ أَبِيهِ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ صُورَةٌ وَلَا كَلْبٌ وَلَا جُنُبٌ";
abudawood.urdu = "سیدنا علی بن ابی طالب رضی اللہ عنہ نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس گھر میں تصویر،کتا اور جنبی موجود ہوں اس میں فرشتے داخل نہیں ہوتے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (463)
عبد اللہ بن نجیح وثقہ الجمہور وکذا أبوہ: حسن الحدیث`;