var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا شُعْبَةُ،عَنْ سَلَمَةَ سَمِعَ الشَّعْبِيَّ عَنِ الْخَلِيلِ-أَوِ: ابْنِ الْخَلِيلِ-قَالَ: أُتِيَ عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِي اللَّهُ عَنْهُ فِي امْرَأَةٍ وَلَدَتْ مِنْ ثَلَاثَةٍ،نَحْوَهُ.. لَمْ يَذْكُرِ الْيَمَنَ،وَلَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَلَا قَوْلَهُ: طِيبَا بِالْوَلَدِ.";
abudawood.urdu = "خلیل یا ابن خلیل سے مروی ہے کہ سیدنا علی رضی اللہ عنہ سے اس عورت کے بارے میں پوچھا گیا جس نے تین مردوں سے بچہ جنم دیا۔(تینوں نے اس سے صحبت کی تھی) اور مذکورہ بالا کی مانند بیان کیا۔اس روایت میں یمن کا یا نبی کریم ﷺ کا ذکر نہیں اور نہ یہ ہے کو خوشی خوشی بچے سے دست بردار ہو جاؤ۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2269)`;