var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَنَامُ وَهُوَ جُنُبٌ, مِنْ غَيْرِ أَنْ يَمَسَّ مَاءً. قَالَ أَبُو دَاوُد: حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْوَاسِطِيُّ،قَالَ: سَمِعْتُ يَزِيدَ بْنَ هَارُونَ يَقُولُ: هَذَا الْحَدِيثُ وَهْمٌ يَعْنِي حَدِيثَ أَبِي إِسْحَاقَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ ﷺ حالت جنابت میں سو جایا کرتے تھے،بغیر اس کے کہ پانی کو ہاتھ لگائیں۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ہم سے حسن بن علی واسطی نے بیان کیا وہ کہتے ہیں کہ میں نے یزید بن ہارون سے سنا،وہ کہتے تھے کہ یہ حدیث وہم ہے،یعنی ابواسحٰق کی حدیث۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (118)،ابن ماجہ (581583)<br>أبو إسحاق مدلس (تقدم: 162) صرح بالسماع عند البیہقي (1/ 201،202) ولکن السند إلیہ ضعیف (!)`;
abudawood.anwaar = [21,1];