var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَهْلُ بْنُ مُحَمَّدِ بْنِ الزُّبَيْرِ الْعَسْكَرِيُّ،حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ،عَنْ صَالِحِ بْنِ صَالِحٍ،عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،عَنْ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَّقَ حَفْصَةَ،ثُمَّ رَاجَعَهَا.";
abudawood.urdu = "سیدنا عمر رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے سیدہ حفصہ رضی اللہ عنہا کو طلاق دے دی،مگر پھر آپ ﷺ نے ان سے رجوع کر لیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;