var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ عَنِ الشَّعْبِيِّ،عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ أَنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا،فَلَمْ يَجْعَلْ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَقَةً وَلَا سُكْنَى.";
abudawood.urdu = "شعبی سیدہ فاطمہ بنت قیس رضی اللہ عنہا سے بیان کرتے ہیں کہ ان کے شوہر نے ان کو تین طلاقیں دی تھیں تو نبی کریم ﷺ نے اس کے لیے کوئی خرچہ اور رہائش (شوہر پر) لازم نہیں کی تھی۔";
abudawood.hukam = "صحیح مسلم (1480)";
abudawood.description = `انظر الحدیث السابق (2284)`;