var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ أَبِيهِ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ،أَنَّهُ قِيلَ لِعَائِشَةَ: أَلَمْ تَرَيْ إِلَى قَوْلِ فَاطِمَةَ؟ قَالَتْ: أَمَا إِنَّهُ لَا خَيْرَ لَهَا فِي ذَلِكَ.";
abudawood.urdu = "عروہ بن زبیر سے مروی ہے کہ سیدہ عائشہ رضی اللہ عنہا سے کہا گیا کہ کیا آپ کو فاطمہ کی بات معلوم نہیں ہوئی؟ تو انہوں نے کہا: اس بات کو ذکر کرنے میں اس کے لیے خیر نہیں ہے۔";
abudawood.hukam = "صحیح بخاری (5325، 5326) صحیح مسلم (1481)";
abudawood.description = ``;