var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ،حَدَّثَنَا مَيْمُونُ بْنُ مِهْرَانَ،قَالَ: قَدِمْتُ الْمَدِينَةَ،فَدُفِعْتُ إِلَى سَعِيدِ بْنِ الْمُسَيِّبِ،فَقُلْتُ: فَاطِمَةُ بِنْتُ قَيْسٍ طُلِّقَتْ،فَخَرَجَتْ مِنْ بَيْتِهَا؟ فَقَالَ سَعِيدٌ: تِلْكَ امْرَأَةٌ فَتَنَتْ النَّاسَ, إِنَّهَا كَانَتْ لَسِنَةً،فَوُضِعَتْ عَلَى يَدَيْ ابْنِ أُمِّ مَكْتُومٍ الْأَعْمَى.";
abudawood.urdu = "میمون بن مہران کہتے ہیں کہ میں مدینہ آیا تو سعید بن مسیب کے ہاں پہنچا میں نے کہا: فاطمہ بنت قیس کو طلاق ہوئی تو وہ اپنے گھر سے منتقل ہو گئی تھی،تو سعید نے کہا: اس عورت نے لوگوں کو فتنے میں ڈالا ہوا تھا،بہت زبان دراز تھی تو اسے ابن مکتوم نابینا کے ہاں رہائش دی گئی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>السند حسن إلی سعید بن المسیب ولکنہ لم یذکر من حدثہ بھذا فالخبر منقطع`;
abudawood.anwaar = [86,1];