var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ مِسْعَرٍ،عَنْ وَاصِلٍ،عَنْ أَبِي وَائِلٍ،عَنْ حُذَيْفَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَهُ،فَأَهْوَى إِلَيْهِ،فَقَالَ: إِنِّي جُنُبٌ،فَقَالَ: إِنَّ الْمُسْلِمَ لَا يَنْجُسُ";
abudawood.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ ان سے ملے اور (مصافحہ کے لیے) ان کی طرف اپنا ہاتھ بڑھایا تو انہوں نے کہا میں جنبی ہوں۔آپ ﷺ نے فرمایا ’’مسلمان ناپاک (پلید) نہیں ہوتا۔‘‘";
abudawood.hukam = "صحیح مسلم (372)";
abudawood.description = ``;