var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ،حَدَّثَنِي بُدَيْلٌ عَنِ الْحَسَنِ بْنِ مُسْلِمٍ،عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ،عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَال:َ الْمُتَوَفَّى عَنْهَا زَوْجُهَا،لَا تَلْبَسُ الْمُعَصْفَرَ مِنَ الثِّيَابِ،وَلَا الْمُمَشَّقَةَ،وَلَا الْحُلِيَّ،وَلَا تَخْتَضِبُ،وَلَا تَكْتَحِلُ.";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جس عورت کا شوہر فوت ہو جائے،وہ عصفر (زعفران) یا گیرو رنگ کے کپڑے نہ پہنے۔نہ زیور استعمال کرے،نہ مہندی لگائے اور نہ سرمہ۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3334)
أخرجہ النسائي (3565 وسندہ حسن)`;