var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَ عُثْمَانُ،حَدَّثَنَا وَقَالَ ابْنُ الْعَلَاءِ،أَخْبَرَنَا أَبُو مُعَاوِيَةَ،حَدَّثَنَا الْأَعْمَشُ،عَنْ مُسْلِمٍ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ،قَالَ: مَنْ شَاءَ لَاعَنْتُهُ, لَأُنْزِلَتْ سُورَةُ النِّسَاءِ الْقُصْرَى بَعْدَ الْأَرْبَعَةِ الْأَشْهُرِ وَعَشْرًا .";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ جو چاہے میں اس سے مباہلہ کر سکتا ہوں کہ چھوٹی سورۃ نساء (سورۃ الطلاق) چار ماہ دس دن (کے سابقہ حکم) کے بعد ہی نازل ہوئی تھی۔(یہ حکم سورۃ البقرہ کی آیت 234 میں وارد ہوا ہے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2030)<br>الأعمش مدلس وعنعن<br>وللحدیث شواھد ضعیفۃ (انظر ضعیف سنن النسائي : 3552)<br>وحدیث البخاري (4532) یغني عنہ`;
abudawood.anwaar = [86,1];