var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،عَنْ حَجَّاجٍ عَنِ ابْنِ جُرَيْجٍ قَالَ وَأَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: جَاءَتْ مِسْكِينَةٌ لِبَعْضِ الْأَنْصَارِ،فَقَالَتْ: إِنَّ سَيِّدِي يُكْرِهُنِي عَلَى الْبِغَاءِ! فَنَزَلَ فِي ذَلِكَ: وَلَا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ[النور: 33].";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ مسیکہ ایک انصاری کی لونڈی تھی،وہ آئی اور کہا: میرا مالک مجھے بدکاری کے لیے مجبور کرتا ہے۔چنانچہ اس سلسلے میں یہ آیت اتری «ولا تکرہوا فتیاتکم علی البغاء» ’’اور اپنی لونڈیوں کو بدکاری کے لیے مجبور مت کرو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;