var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ،حَدَّثَنَا مُعْتَمِرٌ-: عَنْ أَبِيهِ وَمَنْ يُكْرِهُّنَّ فَإِنَّ اللَّهَ مِنْ بَعْدِ إِكْرَاهِهِنَّ غَفُورٌ رَحِيمٌ[النور: 33]،قَالَ: قَالَ سَعِيدُ بْنُ أَبِي الْحَسَنِ: غَفُورٌ لَهُنَّ: الْمُكْرَهَاتِ.";
abudawood.urdu = "معتمر اپنے والد (سلیمان تیمی) سے بیان کرتے ہیں کہ آیت کریمہ «ومن یکرہہن فإن اللہ من بعد إکراہہن غفور رحیم» کی تفسیر میں سعید بن ابی الحسن کہتے ہیں کہ اللہ تعالیٰ ’’مجبور کردہ لونڈیوں کے لیے غفور رحیم ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قال یحیی بن معین : کان سلیمان التیمي یدلس (تاریخ ابن معین : 3600) وتقدم (1488)`;
abudawood.anwaar = [87,1];