var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ عَنِ ابْنِ أَبِي زَائِدَةَ،عَنْ عِيسَى بْنِ دِينَارٍ،عَنْ أَبِيهِ،عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ أَبِي ضِرَارٍ عَنِ ابْنِ مَسْعُودٍ،قَال:َ لَمَا صُمْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعًا وَعِشْرِينَ: أَكْثَرَ مِمَّا صُمْنَا مَعَهُ ثَلَاثِينَ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،انہوں نے کہا کہ ہم نے نبی کریم ﷺ کے ساتھ (رمضان میں) انتیس انتیس روزے بہت زیادہ رکھے ہیں اور تیس تیس کم۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (689 وسندہ صحیح)`;