var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ أَنَّ يَزِيدَ بْنَ زُرَيْعٍ حَدَّثَهُمْ،حَدَّثَنَا خَالِدٌ الْحَذَّاءُ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ،عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: شَهْرَا عِيدٍ لَا يَنْقُصَانِ, رَمَضَانُ،وَذُو الْحِجَّةِ.";
abudawood.urdu = "جناب عبدالرحمٰن بن ابی بکرہ اپنے والد سے،وہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’عید کے دونوں مہینے یعنی رمضان اور ذوالحجہ کم نہیں ہوتے ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (1912) صحیح مسلم (1089)";
abudawood.description = ``;