var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا حَمَّادٌ فِي حَدِيثِ أَيُّوبَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ أَبِي هُرَيْرَةَ،ذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ،قَال:َ وَفِطْرُكُمْ يَوْمَ تُفْطِرُونَ،وَأَضْحَاكُمْ يَوْمَ تُضَحُّونَ،وَكُلُّ عَرَفَةَ مَوْقِفٌ،وَكُلُّ مِنًى مَنْحَرٌ،وَكُلُّ فِجَاجِ مَكَّةَ مَنْحَرٌ،وَكُلُّ جَمْعٍ مَوْقِفٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے (یہ طویل حدیث کا ایک حصہ ہے) کہ نبی کریم ﷺ نے فرمایا ’’عید الفطر اسی دن ہے جب تم افطار کرو اور عید قرباں اسی دن ہے جب تم قربانی کرو۔سارا میدان عرفات وقوف کی جگہ ہے اور سارا منیٰ جائے قربانی ہے،مکہ کے تمام راستے قربانی کی جگہ ہیں اور سارا مزدلفہ وقوف کی جگہ ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;