var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ،قَالَ: سَمِعْتُ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،تَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَفَّظُ مِنْ شَعْبَانَ مَا لَا يَتَحَفَّظُ مِنْ غَيْرِهِ،ثُمَّ يَصُومُ لِرُؤْيَةِ رَمَضَانَ،فَإِنْ غُمَّ عَلَيْهِ, عَدَّ ثَلَاثِينَ يَوْمًا ثُمَّ صَامَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ شعبان کی تاریخوں کی اتنی نگہداشت رکھتے تھے کہ دوسرے مہینوں میں اتنی نگہداشت نہ رکھتے تھے۔پھر چاند دیکھ کر رمضان کے روزے رکھنے شروع کرتے اگر کبھی (شعبان کی انتیس تاریخ کو) مطلع ابرآلود ہوتا،تو تیس دن پورے کرتے اور پھر روزے رکھنا شروع کرتے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1980)
صححہ ابن خزیمۃ (1910 وسندہ صحیح)`;