var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ زِيَادٍ الْأَعْلَمِ عَنِ الْحَسَنِ،عَنْ أَبِي بَكْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: دَخَلَ فِي صَلَاةِ الْفَجْرِ،فَأَوْمَأَ بِيَدِهِ أَنْ: مَكَانَكُمْ ثُمَّ جَاءَ وَرَأْسُهُ يَقْطُرُ فَصَلَّى بِهِمْ.";
abudawood.urdu = "سیدنا ابوبکر رضی اللہ عنہ بیان کرتے ہیں کہ (ایک دن) رسول اللہ ﷺ فجر کی نماز میں داخل ہوئے،پھر اپنے ہاتھ سے اشارہ کیا کہ اپنی اپنی جگہوں پر ٹھہرے رہو۔پھر تشریف لائے تو (اس حال میں تھے کہ) آپ ﷺ کے سر سے پانی کے قطرات ٹپک رہے تھے اور آپ ﷺ نے انہیں نماز پڑھائی۔";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شاھد حسن عند أحمد (2/448 ح 9786) وسندہ حسن، وانظر صحیح البخاري (275) وصحیح مسلم (605)`;