var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ،حَدَّثَنَا أَبُو مُسْهِرٍ،قَالَ: كَانَ سَعِيدٌ يَعْنِي ابْنَ عَبْدِ الْعَزِيزِ،يَقُولُ: سِرُّهُ: أَوَّلُهُ. قَالَ أَبو دَاود: وَقَالَ بَعْضُهُمْ: سِرُّهُ وَسَطُهُ. وَقَالُوا: آخِرُهُ.";
abudawood.urdu = "جناب سعید بن عبدالعزیز بیان کرتے ہیں کہ «سرہ» کے معنی ’’ابتدائے مہینہ‘‘ ہیں۔امام ابوداؤد رحمہ اللہ نے کہا: کچھ اہل لغت اس کا ترجمہ ’’وسط‘‘ اور کئی ’’آخر مہینہ‘‘ بھی کرتے ہیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;