var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ،حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ عَمْرِو بْنِ قَيْسٍ،عَنْ أَبِي إِسْحَاقَ،عَنْ صِلَةَ،قَالَ: كُنَّا عِنْدَ عَمَّارٍ فِي الْيَوْمِ الَّذِي يُشَكُّ فِيهِ،فَأَتَى بِشَاةٍ،فَتَنَحَّى بَعْضُ الْقَوْمِ،فَقَالَ عَمَّارٌ: مَنْ صَامَ هَذَا الْيَوْمَ, فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ.";
abudawood.urdu = "جناب صلہ بیان کرتے ہیں کہ ہم سیدنا عمار رضی اللہ عنہ کی خدمت میں حاضر تھے اور وہ دن مشکوک تھا (چاند ہونے کی خبر واضح نہ ہوئی تھی) تو بکری کا گوشت پیش کیا گیا۔پس مجلس میں سے کچھ لوگ ایک طرف ہو گئے۔سیدنا عمار رضی اللہ عنہ نے کہا: جس نے اس دن کا روزہ رکھا ہے اس نے ابوالقاسم ﷺ کی نافرمانی کی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (686) نسائی (2190) ابن ماجہ (1645)<br>أبو إسحاق مدلس وعنعن<br>وللحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [87,1];