var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَال:َ لَا تُقَدِّمُوا صَوْمَ رَمَضَانَ بِيَوْمٍ وَلَا يَوْمَيْنِ, إِلَّا أَنْ يَكُونَ صَوْمٌ يَصُومُهُ رَجُلٌ, فَلْيَصُمْ ذَلِكَ الصَّوْمَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’رمضان سے ایک دو دن پہلے روزے مت رکھو مگر جو کوئی شخص کسی دن کا روزہ رکھتا رہا ہو تو وہ رکھ لے۔‘‘";
abudawood.hukam = "صحیح بخاری (1914) صحیح مسلم (1082)";
abudawood.description = ``;