var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ تَوْبَةَ الْعَنْبَرِيِّ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ أَبِي سَلَمَةَ،عَنْ أُمِّ سَلَمَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ: لَمْ يَكُنْ يَصُومُ مِنَ السَّنَةِ شَهْرًا تَامًّا, إِلَّا شَعْبَانَ يَصِلُهُ بِرَمَضَانَ.";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا،نبی کریم ﷺ کے متعلق بیان کرتی ہیں کہ آپ ﷺ سال میں کسی مہینے کے پورے روزے نہ رکھتے تھے مگر شعبان میں،کہ اسے رمضان کے ساتھ ملا دیتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1976)`;