var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ السَّمْرَقَنْدِيُّ وَأَنَا لِحَدِيثِهِ أَتْقَنُ،قَالَا: حَدَّثَنَا مَرْوَانُ هُوَ ابْنُ مُحَمَّدٍ،عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ،عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمٍ،عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ،عَنْ أَبِيهِ عَنِ ابْنِ عُمَرَ،قَالَ: تَرَاءَى النَّاسُ الْهِلَالَ،فَأَخْبَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي رَأَيْتُهُ،فَصَامَهُ،وَأَمَرَ النَّاسَ بِصِيَامِهِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما کا بیان ہے کہ لوگوں نے چاند دیکھنے کی کوشش کی۔پس میں نے رسول اللہ ﷺ کو خبر دی کہ میں نے دیکھ لیا ہے۔تو آپ ﷺ نے روزہ رکھا اور لوگوں کو روزہ رکھنے کو حکم فرمایا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1979، 2922)
عبد اللہ بن وھب المصري صرح بالسماع عند الدارقطني (2/165) وغیرہ`;