var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ مُوسَى بْنِ عَلِيِّ بْنِ رَبَاحٍ،عَنْ أَبِيهِ،عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ،عَنْ عَمْرِو بْنِ الْعَاصِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ, أَكْلَةُ السَّحَرِ.";
abudawood.urdu = "سیدنا عمرو بن العاص رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’ہمارے اور اہل کتاب کے روزے میں فرق ‘ سحری کے کھانے کا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (1096)";
abudawood.description = ``;