var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ،حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ،حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ،عَنْ يُونُسَ بْنِ سَيْفٍ عَنِ الْحَارِثِ بْنِ زِيَادٍ،عَنْ أَبِي رُهْمٍ عَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ،قَالَ: دَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى السَّحُورِ فِي رَمَضَانَ،فَقَالَ: هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ.";
abudawood.urdu = "سیدنا عرباض بن ساریہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے مجھے رمضان میں سحری کے لیے بلایا اور فرمایا ’’آؤ! مبارک کھانا «غداء» کھا لو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1997)
أخرجہ النسائي (2165 وسندہ حسن) الحارث بن زیاد حسن الحدیث وللحدیث شواھد عند ابن حبان (الموارد: 881) وغیرہ`;