var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُمَرُ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ،حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ أَبُو الْمُطَرِّفِ،حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: نِعْمَ سَحُورُ الْمُؤْمِنِ التَّمْرُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’کھجور مومن کی بہترین سحری ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1998)`;