var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ عَبْدِ اللَّهِ بْنِ سَوَادَةَ الْقُشَيْرِيِّ،عَنْ أَبِيهِ سَمِعْتُ سَمُرَةَ بْنَ جُنْدُبٍ يَخْطُبُ،وَهُوَ يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَمْنَعَنَّ مِنْ سُحُورِكُمْ أَذَانُ بِلَالٍ،وَلَا بَيَاضُ الْأُفْقِ-الَّذِي هَكَذَا-،حَتَّى يَسْتَطِيرَ.";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ نے خطبہ دیا اور بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’بلال کی اذان تمہیں تمہاری سحری سے ہرگز نہ روکے اور نہ افق کی سفیدی (جو کہ سیدھی اوپر کو چڑھتی ہے) حتیٰ کہ اطراف میں پھیلنے لگے۔‘‘";
abudawood.hukam = "صحیح مسلم (1094)";
abudawood.description = ``;