var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ،حَدَّثَنَا حَمَّادٌ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا سَمِعَ أَحَدُكُمُ النِّدَاءَ وَالْإِنَاءُ عَلَى يَدِهِ, فَلَا يَضَعْهُ،حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے جب کوئی اذان (فجر) سنے اور برتن اس کے ہاتھ میں ہو تو اسے رکھے نہیں بلکہ اپنی ضرورت پوری کر لے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1988)`;