var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ،عَنْ خَالِدٍ،عَنْ مُحَمَّدٍ يَعْنِي ابْنَ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا يَزَالُ الدِّينُ ظَاهِرًا،مَا عَجَّلَ النَّاسُ الْفِطْرَ, لِأَنَّ الْيَهُودَ وَالنَّصَارَى يُؤَخِّرُونَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے نقل کرتے ہیں کہ آپ ﷺ نے فرمایا ’’دین اس وقت تک غالب رہے گا جب تک لوگ افطار کرنے میں جلدی کرتے رہیں گے کیونکہ یہود و نصاریٰ تاخیر سے افطار کرتے ہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1995)
أخرجہ ابن ماجہ (1698 وسندہ حسن)`;