var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنِ الرَّبَابِ،عَنْ سَلْمَانَ بْنِ عَامِرٍ،عَمِّهَا،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلْيُفْطِرْ عَلَى التَّمْرِ،فَإِنْ لَمْ يَجِدِ التَّمْرَ فَعَلَى الْمَاءِ, فَإِنَّ الْمَاءَ طَهُورٌ.";
abudawood.urdu = "جناب سلمان بن عامر رضی اللہ عنہ (یہ رباب کے چچا ہیں) بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کسی نے روزہ رکھا ہو تو چاہیئے کہ کھجور سے افطار کرے۔اگر کھجور نہ پائے تو پانی سے افطار کرے ‘ بلاشبہ پانی پاک کرنے والا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1990)
أخرجہ ابن ماجہ (1699 وسندہ حسن) وصححہ ابن خزیمۃ (2067 وسندہ حسن) الرباب بنت صلیع ثقۃ وثقھا الترمذي وابن حبان والحاکم وأخطأ من جھلھا وضعّف الحدیث`;