var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ،حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُفْطِرُ عَلَى رُطَبَاتٍ قَبْلَ أَنْ يُصَلِّيَ،فَإِنْ لَمْ تَكُنْ رُطَبَاتٌ, فَعَلَى تَمَرَاتٍ،فَإِنْ لَمْ تَكُنْ, حَسَا حَسَوَاتٍ مِنْ مَاءٍ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نماز سے پہلے تازہ کھجوروں سے روزہ افطار فرماتے ‘ اگر تازہ کھجوریں نہ ہوتیں ‘ تو خشک کھجور تناول فرما لیتے ‘ یہ بھی نہ ہوتیں ‘ تو پانی کے چند گھونٹ پی لیا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1991)
أخرجہ الترمذي (696 وسندہ حسن) وصححہ الدارقطني (2/85) والحاکم (1/432) ووافقہ الذہبي`;