var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا هُشَيْمٌ،عَنْ حُصَيْنٍ،عَنْ مُعَاذِ بْنِ زُهْرَةَ،أَنَّهُ بَلَغَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَفْطَرَ, قَال:َ اللَّهُمَّ لَكَ صُمْتُ،وَعَلَى رِزْقِكَ أَفْطَرْتُ.";
abudawood.urdu = "جناب معاذ بن زہرہ (تابعی) سے مروی ہے کہ نبی کریم ﷺ افطار کے وقت یہ دعا پڑھتے تھے «اللہم لک صمت وعلی رزقک أفطرت» ’’اے اﷲ! میں نے تیرے لیے روزہ رکھا اور تیرے ہی رزق پر کھول رہا ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل<br>معاذ بن زھرۃ من التابعین<br>وجاء في تقریب التہذیب (6731) : ’’ مجہول ‘‘ ووثقہ ابن حبان وحدہ`;
abudawood.anwaar = [87,1];