var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْوِصَالِ،قَالُوا: فَإِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ! قَالَ: إِنِّي لَسْتُ كَهَيْئَتِكُمْ, إِنِّي أُطْعَمُ وَأُسْقَى.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے روزوں میں وصال کرنے سے منع فرمایا۔صحابہ نے کہا: اے اللہ کے رسول! آپ تو وصال کرتے ہیں؟ آپ ﷺ نے فرمایا ’’میں تمہاری طرح نہیں ہوں۔بیشک مجھے کھلایا پلایا جاتا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (1962) صحیح مسلم (1102)";
abudawood.description = ``;