var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الصِّيَامُ جُنَّةٌ،إِذَا كَانَ أَحَدُكُمْ صَائِمًا, فَلَا يَرْفُثْ وَلَا يَجْهَلْ،فَإِنِ امْرُؤٌ قَاتَلَهُ أَوْ شَاتَمَهُ, فَلْيَقُلْ: إِنِّي صَائِمٌ،إِنِّي صَائِمٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ نے فرمایا ’’جب تم میں سے کوئی روزے سے ہو تو کسی قسم کی فحش بات یا جہالت کا کام نہ کرے۔اگر کوئی دوسرا اس سے جھگڑے یا گالی گلوچ دے تو اسے چاہیئے کہ کہہ دے میں روزے سے ہوں،میں نے روزہ رکھا ہوا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (1894) صحیح مسلم (1151)";
abudawood.description = ``;