var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ،حَدَّثَنَا شَرِيكٌ ح،وحَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ،عَنْ أَبِيهِ،قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَاكُ وَهُوَ صَائِمٌ. زَادَ مُسَدَّدٌ مَا لَا أَعُدُّ وَلَا أُحْصِي.";
abudawood.urdu = "جناب عبیداللہ بن عامر بن ربیعہ اپنے والد (عامر بن ربیعہ) سے روایت کرتے ہیں،ان کا کہنا ہے کہ میں نے رسول اللہ ﷺ کو مسواک کرتے ہوئے دیکھا،حالانکہ آپ ﷺ روزے سے تھے۔مسدد نے مزید یوں کہا: میں نے آپ ﷺ کو بےشمار دفعہ (مسواک کرتے) دیکھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (725)<br>عاصم بن عبید اللّٰہ : ضعیف`;
abudawood.anwaar = [88,1];