var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ،عَنْ إِسْمَاعِيلَ بْنِ كَثِيرٍ،عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبْرَةَ،عَنْ أَبِيهِ لَقِيطِ بْنِ صَبْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ بَالِغْ فِي الِاسْتِنْشَاقِ, إِلَّا أَنْ تَكُونَ صَائِمًا.";
abudawood.urdu = "سیدنا لقیط بن صبرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’(وضو کرتے ہوئے) ناک میں خوب پانی چڑھاؤ،سوائے اس کے کہ روزے سے ہو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (788 وسندہ صحیح)`;