var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ،حَدَّثَنَا أَيُّوبُ،عَنْ أَبِي قِلَابَةَ،عَنْ أَبِي الْأَشْعَثِ،عَنْ شَدَّادِ بْنِ أَوْسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى عَلَى رَجُلٍ بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ،وَهُوَ آخِذٌ بِيَدِي, لِثَمَانِ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ،فَقَال:َ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ. قَالَ أَبو دَاود: وَرَوَى خَالِدٌ الْحَذَّاءُ،عَنْ أَبِي قِلَابَةَ بِإِسْنَادِ أَيُّوبَ مِثْلَهُ.";
abudawood.urdu = "سیدنا شداد بن اوس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ بقیع کے قریب ایک آدمی کے پاس سے گزرے اور وہ سینگی لگوا رہا تھا،جبکہ نبی کریم ﷺ میرا ہاتھ تھامے ہوئے تھے اور رمضان کی اٹھارہ تاریخ تھی،آپ ﷺ نے فرمایا ’’سینگی لگانے اور لگوانے والا (دونوں) روزہ کھولنے والے ہو گئے۔‘‘ ¤ امام ابوداؤد رحمہ اللہ نے کہا: خالد الخداء نے (بھی) ابوقلابہ سے بسند ایوب روایت کیا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2012)
انظر الحدیث السابق (2367، 2368)`;