var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ وَعَبْدُ الرَّزَّاقِ ح،وحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنِ ابْنِ جُرَيْجٍ،أَخْبَرَنِي مَكْحُولٌ أَنَّ شَيْخًا مِنَ الْحَيِّ قَالَ عُثْمَانُ فِي حَدِيثِهِ مُصَدَّقٌ أَخْبَرَهُ أَنَّ ثَوْبَانَ،مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ.";
abudawood.urdu = "سیدنا ثوبان رضی اللہ عنہ،مولیٰ نبی کریم ﷺ نے خبر دی کہ نبی کریم ﷺ نے فرمایا ’’سینگی لگانے والا اور لگوانے والا (دونوں) مفطر (روزہ کھولنے والے) ہو گئے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2367، 2368)`;