var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا مَرْوَانُ،حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ،أَخْبَرَنَا الْعَلَاءُ بْنُ الْحَارِثِ،عَنْ مَكْحُولٍ،عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ،عَنْ ثَوْبَانَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ. قَالَ أَبو دَاود: وَرَوَاهُ ابْنُ ثَوْبَانَ،عَنْ أَبِيهِ،عَنْ مَكْحُولٍ بِإِسْنَادِهِ مِثْلَهُ.";
abudawood.urdu = "سیدنا ثوبان رضی اللہ عنہ،نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’سینگی لگانے والا اور لگوانے والا مفطر (روزہ کھولنے والے) ہو گئے۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابن ثوبان نے بھی اپنے والد سے بسند مکحول اس کی مانند روایت کیا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2367، 2368)`;