var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ مِقْسَمٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ صَائِمٌ مُحْرِمٌ.";
abudawood.urdu = "مقسم،سیدنا ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے روزے اور احرام کی حالت میں سینگی لگوائی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (777)<br>یزید بن أبي زیاد : ضعیف<br>والحدیث السابق (الأصل : 2372) یغني عنہ`;
abudawood.anwaar = [88,1];