var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ رَجُلٍ مِنْ أَصْحَابِهِ،عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يُفْطِرُ مَنْ قَاءَ،وَلَا مَنِ احْتَلَمَ،وَلَا مَنِ احْتَجَمَ.";
abudawood.urdu = "ایک صحابی سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جسے قے آ جائے یا (نیند میں) احتلام ہو جائے یا جو سینگی لگوائے،تو اس کا روزہ نہیں ٹوٹتا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من أصحاب زید بن أسلم لم أعرفہ<br>وللحدیث شواھد ضعیفۃ عند الدارقطني (183/1) والبزار (1016،1017) وغیرھما`;
abudawood.anwaar = [88,1];