var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ،حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ النُّعْمَانِ بْنِ مَعْبَدِ بْنِ هَوْذَةَ،عَنْ أَبِيهِ،عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, أَنَّهُ أَمَرَ بِالْإِثْمِدِ الْمُرَوَّحِ عِنْدَ النَّوْمِ،وَقَالَ: لِيَتَّقِهِ الصَّائِمُ . قَالَ أَبو دَاود: قَالَ لِي يَحْيَى بْنُ مَعِينٍ هُوَ حَدِيثٌ مُنْكَرٌ يَعْنِي حَدِيثَ الْكُحْلِ.";
abudawood.urdu = "عبدالرحمٰن بن نعمان اپنے والد سے،وہ دادا سے،وہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے حکم دیا کہ سوتے وقت کستوری ملا سرمہ استعمال کیا جائے اور فرمایا ’’روزہ دار اس سے پرہیز کرے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ مجھے امام یحییٰ بن معین نے کہا: یہ سرمے والی حدیث منکر ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نعمان بن معبد مجہول (تقریب التہذیب: 7161) لم یوثقہ غیر ابن حبان`;
abudawood.anwaar = [88,1];