var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ،أَخْبَرَنَا أَبُو مُعَاوِيَةَ،عَنْ عُتْبَةَ أَبِي مُعَاذٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ،عَنْ أَنَسِ بْنِ مَالِكٍ, أَنَّهُ كَانَ يَكْتَحِلُ وَهُوَ صَائِمٌ .";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کے متعلق روایت ہے کہ وہ روزے کی حالت میں سرمہ لگایا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو معاویۃ الضریر عنعن وھو مدلس (طبقات المدلسین : 2/61 وھو من الثالثۃ)`;
abudawood.anwaar = [88,1];