var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْمُخَرِّمِيُّ وَيَحْيَى بْنُ مُوسَى الْبَلْخِيُّ،قَالَا: حَدَّثَنَا يَحْيَى بْنُ عِيسَى،عَنْ الْأَعْمَشِ،قَالَ: مَا رَأَيْتُ أَحَدًا مِنْ أَصْحَابِنَا يَكْرَهُ الْكُحْلَ لِلصَّائِمِ،وَكَانَ إِبْرَاهِيمُ يُرَخِّصُ أَنْ يَكْتَحِلَ الصَّائِمُ بِالصَّبِرِ.";
abudawood.urdu = "جناب اعمش کہتے ہیں (یہ صغار تابعین میں سے ہیں) میں نے اپنے اہل علم دوستوں (فقہاء و محدثین) میں سے کسی کو نہیں پایا کہ روزے دار کے لیے سرمے کو مکروہ سمجھتے ہوں۔اور ابراہیم نخعی اجازت دیتے تھے کہ روزے دار ایلوا کو بطور سرمہ استعمال کرے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند حسن إلی الأعمش وضعیف إلی إبراہیم لأن الأعمش مدلس<br>ولم یصرح بالسماع`;
abudawood.anwaar = [88,1];