var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ مَنْ ذَرَعَهُ قَيْءٌ وَهُوَ صَائِمٌ, فَلَيْسَ عَلَيْهِ قَضَاءٌ،وَإِنِ اسْتَقَاءَ فَلْيَقْضِ. قَالَ أَبو دَاود: رَوَاهُ أَيْضًا حَفْصُ بْنُ غِيَاثٍ،عَنْ هِشَامٍ مِثْلَهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس کسی کو قے آ جائے جبکہ وہ روزے سے ہو تو اس پر کوئی قضاء نہیں ہے،لیکن اگر وہ قصداً قے کرے تو قضاء دے۔‘‘ ¤ امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ اس روایت کو حفص بن غیاث نے بھی ہشام سے اسی کے مثل روایت کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (720) ابن ماجہ (1676)<br>ھشام بن حسان عنعن<br>وأخرج البیہقي (219/4) بأسانید صحیحۃ عن ابن عمر قال :’’ من ذرعہ القئ فلا قضاء علیہ ومن استقاء فعلیہ القضاء ‘‘`;
abudawood.anwaar = [88,1];