var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ عَنِ الْأَسْوَدِ وَعَلْقَمَةَ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ وَهُوَ صَائِمٌ،وَيُبَاشِرُ وَهُوَ صَائِمٌ،وَلَكِنَّهُ كَانَ أَمْلَكَ لِإِرْبِه.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ روزے کی حالت میں بوسہ لے لیا کرتے تھے اور روزے کی حالت میں بیوی کے ساتھ لیٹ بھی جاتے تھے،لیکن آپ ﷺ اپنے جذبات پر خوب ضبط رکھنے والے تھے۔";
abudawood.hukam = "صحیح بخاری (1927) صحیح مسلم (1106)";
abudawood.description = ``;