var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ يَعْنِي ابْنَ عُثْمَانَ الْقُرَشِيَّ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُنِي وَهُوَ صَائِمٌ وَأَنَا صَائِمَةٌ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ ﷺ میرا بوسہ لیا کرتے تھے جبکہ آپ روزے سے ہوتے اور میں بھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شواھد صحیحۃ عند مسلم (1106)`;