var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى،حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ،حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ الْعَبْدِيُّ،عَنْ مِصْدَعٍ أَبِي يَحْيَى،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَبِّلُهَا وَهُوَ صَائِمٌ،وَيَمُصُّ لِسَانَهَا. قَالَ ابْنُ الْأَعْرَابِيِّ: هَذَا الْإِسْنَادُ لَيْسَ بِصَحِيحٍ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ ان کا بوسہ لے لیتے جبکہ وہ روزے سے ہوتے اور ان کی زبان چوستے۔¤ ابن الاعرابی کہتے ہیں کہ مجھے امام ابوداؤد رحمہ اللہ سے یہ بات پہنچی ہے کہ یہ سند صحیح نہیں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن دینار اختلط في آخر عمرہ،انظر التقریب (5870)،وفی التحریر : ’’ ضعیف یعتبر بہ فی المتابعات والشواھد ‘‘ …… إلخ`;
abudawood.anwaar = [89,1];