var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،حَدَّثَنَا أَبُو أَحْمَدَ يَعْنِي الزُّبَيْرِيَّ،أَخْبَرَنَا إِسْرَائِيلُ،عَنْ أَبِي الْعَنْبَسِ عَنِ الْأَغَرِّ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُبَاشَرَةِ لِلصَّائِمِ؟ فَرَخَّصَ لَهُ،وَأَتَاهُ آخَرُ فَسَأَلَهُ؟ فَنَهَاهُ،فَإِذَا الَّذِي رَخَّصَ لَهُ شَيْخٌ،وَالَّذِي نَهَاهُ شَابٌّ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ ایک شخص نے نبی کریم ﷺ سے مسئلہ پوچھا کہ روزہ دار شخص بیوی کے ساتھ لیٹے یا نہ؟ آپ ﷺ نے اس کو اجازت دی۔پھر دوسرا آیا اور اس نے بھی آپ ﷺ سے یہ مسئلہ پوچھا۔آپ ﷺ نے اس کو منع فرما دیا۔دراصل آپ ﷺ نے جس کو اجازت دی،وہ بوڑھا تھا اور جس کو منع فرمایا،وہ جوان تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2006)
وللحدیث شاھد عند البیھقي (4/231، 232)`;