var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا أَبُو إِسْحَاقَ،أَخْبَرَنِي سُلَيْمَانُ بْنُ صُرَدٍ،عَنْ جُبَيْرِ بْنِ مُطْعِمٍ،َنَّهُمْ ذَكَرُوا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغُسْلَ مِنَ الْجَنَابَةِ؟ َقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَمَّا أَنَا, َأُفِيضُ عَلَى رَأْسِي ثَلَاثًا.-وَأَشَارَ بِيَدَيْهِ كِلْتَيْهِمَا";
abudawood.urdu = "سیدنا جبیر بن مطعم رضی اللہ عنہ راوی ہیں کہ کچھ لوگوں نے رسول اللہ ﷺ کے ہاں غسل جنابت کا ذکر کیا تو آپ ﷺ نے فرمایا ’’مگر میں تو اپنے سر پر پانی کے تین لپ ڈالتا ہوں۔‘‘ اور ساتھ ہی آپ ﷺ نے اپنے دونوں ہاتھوں سے اشارہ فرمایا۔";
abudawood.hukam = "صحیح بخاری (254) صحیح مسلم (327)";
abudawood.description = ``;