var abudawood = {};
abudawood.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ،حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ،عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ فِي رَمَضَانَ... بِهَذَا الْحَدِيثِ،قَالَ: فَأُتِيَ بِعَرَقٍ فِيهِ تَمْرٌ قَدْرُ خَمْسَةَ عَشَرَ صَاعًا،وَقَالَ فِيهِ: كُلْهُ أَنْتَ وَأَهْلُ بَيْتِكَ،وَصُمْ يَوْمًا،وَاسْتَغْفِرِ اللَّهَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک شخص نبی کریم ﷺ کی خدمت میں آیا جس نے رمضان کے دن میں روزہ توڑ لیا تھا،اور مذکورہ بالا حدیث بیان کی۔راوی نے کہا: پھر آپ ﷺ کے پاس ایک ٹوکرا لایا گیا،اس میں کھجور تھی تقریباً پندرہ صاع۔اس روایت میں ہے۔آپ ﷺ نے اس سے فرمایا ’’تو اور تیرے گھر والے یہ کھا لیں اور تو ایک دن کا روزہ رکھ اور اللہ سے استغفار کر۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن شھاب الزھري مدلس وعنعن`;
abudawood.anwaar = [89,1];