var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ،قَالَ:،حَدَّثَنَا شُعْبَةُ ح،وحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ،أَخْبَرَنَا شُعْبَةُ،عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ،عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنِ ابْنِ مُطَوِّسٍ،عَنْ أَبِيهِ قَالَ ابْنُ كَثِيرٍ،عَنْ أَبِي الْمُطَوِّسِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ،فِي غَيْرِ رُخْصَةٍ رَخَّصَهَا اللَّهُ لَهُ, لَمْ يَقْضِ عَنْهُ صِيَامُ الدَّهْرِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص رمضان میں روزہ توڑ دے،بغیر کسی رخصت کے جو اللہ نے دی ہے تو زمانہ بھر کے روزے بھی اس کی تلافی نہیں کر سکیں گے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (723) ابن ماجہ (1672)<br>أبو المطوس: لین الحدیث وأبو ہ مجہول (تق: 8374،6714)`;
abudawood.anwaar = [89,1];