var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ أَيُّوبَ وَحَبِيبٍ وَهِشَامٍ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: يَا رَسُولَ اللَّهِ! إِنِّي أَكَلْتُ وَشَرِبْتُ نَاسِيًا وَأَنَا صَائِمٌ؟ فَقَالَ: اللَّهُ أَطْعَمَكَ وَسَقَاكَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ ایک آدمی نبی کریم ﷺ کی خدمت میں آیا اور کہا: اے اللہ کے رسول! میں نے روزہ رکھا ہوا تھا اور بھول کر کھا پی بیٹھا ہوں۔آپ ﷺ نے فرمایا ’’اللہ نے تمہیں کھلایا اور پلایا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح، صحیح بخاری (1933) صحیح مسلم (1155)";
abudawood.description = ``;