var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،أَنَّهُ سَمِعَ عَائِشَةَ رَضِي اللَّه عَنْهَا تَقُولُ: إِنْ كَانَ لَيَكُونُ عَلَيَّ الصَّوْمُ مِنْ رَمَضَانَ،فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَهُ،حَتَّى يَأْتِيَ شَعْبَانُ .";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ صدیقہ رضی اللہ عنہا بیان کرتی ہیں کہ مجھ پر رمضان کے روزے باقی ہوتے اور میں ان کی قضاء نہ کر پاتی تھی کہ شعبان آ جاتا۔";
abudawood.hukam = "صحیح بخاری (1950) صحیح مسلم (1146)";
abudawood.description = ``;