var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ عَنْ حُكَيْمَةَ بِنْتِ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ عَنْ أُمِّهَا أَنَّهَا قَالَتْ كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدَحٌ مِنْ عِيدَانٍ تَحْتَ سَرِيرِهِ يَبُولُ فِيهِ بِاللَّيْلِ";
abudawood.urdu = "سیدہ امیمہ بنت رقیقہ رضی اللہ عنہا روایت کرتی ہیں کہ نبی کریم ﷺ کے پاس لکڑی کا ایک پیالہ تھا،جو آپ ﷺ کی چارپائی کے نیچے رکھا ہوتا تھا۔آپ ﷺ رات کو اس میں پیشاب کر لیا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (362)
ابن جریج صرح بالسماع عند النسائی (32)  وحکیمۃ وثقھا الجمہور`;