var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ أَبِي حُصَيْنٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: إِذَا مَرِضَ الرَّجُلُ فِي رَمَضَانَ،ثُمَّ مَاتَ وَلَمْ يَصُمْ, أُطْعِمَ عَنْهُ،وَلَمْ يَكُنْ عَلَيْهِ قَضَاءٌ،وَإِنْ كَانَ عَلَيْهِ نَذْرٌ, قَضَى عَنْهُ وَلِيُّهُ .";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما کا قول ہے کہ جب کوئی شخص رمضان میں بیمار ہوا اور پھر فوت ہو گیا اور روزے نہ رکھ سکا ہو تو اس کی طرف سے کھانا کھلا دیا جائے،اس پر قضاء نہیں ہے۔اگر اس نے نذر مانی تھی تو اس کا ولی قضاء دے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الثوري عنعن`;
abudawood.anwaar = [89,1];