var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ،قَالَا: حَدَّثَنَا حَمَّادٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ حَمْزَةَ الْأَسْلَمِيَّ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: يَا رَسُولَ اللَّهِ! إِنِّي رَجُلٌ أَسْرُدُ الصَّوْمَ،أَفَأَصُومُ فِي السَّفَرِ؟ قَالَ: صُمْ إِنْ شِئْتَ،وَأَفْطِرْ إِنْ شِئْتَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ سیدنا حمزہ اسلمی رضی اللہ عنہ نے نبی کریم ﷺ سے سوال کیا: اے اللہ کے رسول! میں تسلسل سے روزے رکھا کرتا ہوں،تو کیا سفر میں روزہ رکھا کروں؟ آپ ﷺ نے فرمایا ’’چاہو تو رکھ لو اور اگر چاہو تو افطار کر لو۔‘‘";
abudawood.hukam = "صحیح مسلم (1121)";
abudawood.description = ``;