var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زَائِدَةُ،عَنْ حُمَيْدٍ الطَّوِيلِ،عَنْ أَنَسٍ،قَالَ: سَافَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ،فَصَامَ بَعْضُنَا،وَأَفْطَرَ بَعْضُنَا،فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ،وَلَا الْمُفْطِرُ عَلَى الصَّائِمِ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے منقول ہے انہوں نے کہا کہ ہم نے رمضان میں رسول اللہ ﷺ کے ساتھ سفر کیا تو ہم میں سے کچھ نے روزہ رکھا اور کچھ نے نہ رکھا۔چنانچہ روزے داروں نے چھوڑنے والوں پر یا چھوڑنے والوں نے روزے داروں پر کوئی عیب نہ لگایا۔";
abudawood.hukam = "صحیح بخاری (1947) صحیح مسلم (1118)";
abudawood.description = ``;