var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا شُعْبَةُ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ سَعْدِ بْنِ زُرَارَةَ،عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَسَنٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُظَلَّلُ عَلَيْهِ،وَالزِّحَامُ عَلَيْهِ فَقَالَ: لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے دیکھا ایک شخص کو سایہ کیا جا رہا ہے اور لوگ اس پر ازدحام کیے ہوئے ہیں۔(روزے اور گرمی کے باعث وہ غش کھا گیا تھا) تو آپ ﷺ نے فرمایا ’’سفر میں روزہ رکھنا کوئی نیکی کا کام نہیں ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (1946) صحیح مسلم (1115)";
abudawood.description = ``;