var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى،حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ ح،وحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ،حَدَّثَنَا أَبُو قُتَيْبَةَ الْمَعْنَى،قَالَا: حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبِ بْنِ عَبْدِ اللَّهِ الْأَزْدِيُّ،حَدَّثَنِي حَبِيبُ بْنُ عَبْدِ اللَّهِ،قَالَ: سَمِعْتُ سِنَانَ بْنَ سَلَمَةَ بْنِ الْمُحَبَّقِ الْهُذَلِيِّ،يُحَدِّثُ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ كَانَتْ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبَعٍ, فَلْيَصُمْ رَمَضَانَ حَيْثُ أَدْرَكَهُ.";
abudawood.urdu = "جناب سنان بن سلمہ بن محبق ہذلی اپنے والد سے بیان کرتے ہیں انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’جس کے پاس سواری ہو کہ (اسے آرام سے منزل پر پہنچا دے اور) پیٹ بھر کر کھانا وغیرہ مل جائے تو اسے چاہیئے کہ رمضان کے روزے رکھے ‘ جہاں بھی آ جائے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حبیب بن عبد اللّٰہ مجہول و عبدالصمد ضعیف،ضعفہ الجمہور (انظر الحدیث المتقدم :1245)`;
abudawood.anwaar = [89,1];