var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ الْمُهَاجِرِ،حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ،حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبٍ،قَالَ: حَدَّثَنِي أَبِي،عَنْ سِنَانِ بْنِ سَلَمَةَ،عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ أَدْرَكَهُ رَمَضَانُ فِي السَّفَرِ... فَذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "سیدنا سلمہ بن محبق رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جسے رمضان آ پہنچے اور وہ سفر میں ہو تو۔“ اور مذکورہ بالا کے ہم معنی حدیث بیان کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (2410 ] 1245[)`;
abudawood.anwaar = [89,1];