var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ الْمُهَلَّبِ بْنِ أَبِي حَبِيبَةَ،حَدَّثَنَا الْحَسَنُ،عَنْ أَبِي بَكْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَقُولَنَّ أَحَدُكُمْ: إِنِّي صُمْتُ رَمَضَانَ كُلَّهُ! وَقُمْتُهُ كُلَّهُ!. فَلَا أَدْرِي أَكَرِهَ التَّزْكِيَةَ! أَوْ قَالَ: لَا بُدَّ مِنْ نَوْمَةٍ،أَوْ رَقْدَة؟!";
abudawood.urdu = "سیدنا ابوبکرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے کوئی شخص ہرگز یوں نہ کہے کہ میں نے سارا رمضان روزے رکھے اور میں نے سارے رمضان کا قیام کیا۔‘‘ کہتے ہیں مجھے معلوم نہیں آپ نے نیکی کو نمایاں کرنا مکروہ جانا یا یہ بتانا چاہا کہ بندہ اس دوران میں لازمی طور پر سوتا بھی رہا ہے۔(تو سارا رمضان صیام و قیام کیونکر ہو گیا؟)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (2111)<br>الحسن البصري عنعن`;
abudawood.anwaar = [90,1];