var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لَا يَصُمْ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ, إِلَّا أَنْ يَصُومَ قَبْلَهُ بِيَوْمٍ أَوْ بَعْدَهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اﷲ ﷺ نے فرمایا ’’تم میں سے کوئی شخص جمعے کا روزہ نہ رکھے مگر یہ کہ اس سے پہلے ایک دن روزہ رکھے یا ایک دن بعد۔‘‘";
abudawood.hukam = "صحیح بخاری (1985) صحیح مسلم (1144)";
abudawood.description = ``;