var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ،حَدَّثَنَا الْوَلِيدُ عَنِ الْأَوْزَاعِيِّ،قَالَ: مَا زِلْتُ لَهُ كَاتِمًا،حَتَّى رَأَيْتُهُ انْتَشَرَ.-يَعْنِي: حَدِيثَ عَبْدِ اللَّهِ بْنِ بُسْرٍ هَذَا،فِي صَوْمِ يَوْمِ السَّبْتِ-. قَالَ أَبو دَاود: قَالَ مَالِكٌ: هَذَا كَذِبٌ.";
abudawood.urdu = "امام اوزاعی نے کہا: میں ایک مدت تک اس روایت کو چھپائے رہا۔یعنی مذکورہ بالا حدیث عبداللہ بن بسر جو کہ ہفتے کے دن روزہ رکھنے کے بارے میں ہے حتیٰ کہ میں نے دیکھا کہ مشہور ہو گئی ہے۔امام ابوداؤد رحمہ اللہ نے کہا: امام مالک رحمہ اللہ نے اس کو ’’جھوٹ‘‘ کہا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الولید بن مسلم عنعن<br>و قول أبي داود عن مالک،ضعیف لإنقطاعہ`;
abudawood.anwaar = [90,1];