var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا مَهْدِيٌّ،حَدَّثَنَا غَيْلَانُ،عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ،عَنْ أَبِي قَتَادَةَ... بِهَذَا الْحَدِيثِ،زَادَ: قَالَ: يَا رَسُولَ اللَّهِ! أَرَأَيْتَ صَوْمَ يَوْمِ الِاثْنَيْنِ،وَيَوْمِ الْخَمِيسِ؟ قَالَ: فِيهِ وُلِدْتُ،وَفِيهِ أُنْزِلَ عَلَيَّ الْقُرْآنُ.";
abudawood.urdu = "سیدنا ابوقتادہ رضی اللہ عنہ سے اس روایت میں مروی ہے کہ (موسٰی بن اسماعیل نے) مزید کہا: اے اﷲ کے رسول! سوموار اور جمعرات کے روزے کے بارے میں آپ کیا فرماتے ہیں؟ آپ ﷺ نے فرمایا ’’اس روز میری ولادت ہوئی اور اسی میں مجھ پر قرآن نازل کیا گیا۔‘‘ (سوموار کے دن)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2425)`;