var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَقُتَيْبَةُ بْنُ سَعِيدٍ،قَالَا: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي بِشْرٍ،عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ: شَهْرُ اللَّهِ الْمُحَرَّمُ،وَإِنَّ أَفْضَلَ الصَّلَاةِ بَعْدَ الْمَفْرُوضَةِ: صَلَاةٌ مِنَ اللَّيْلِ. لَمْ يَقُلْ قُتَيْبَةُ شَهْرٌ قَالَ رَمَضَانُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’سب سے افضل روزے ماہ رمضان کے بعد،اللہ کے مہینے محرم کے روزے ہیں،اور سب سے افضل نماز فرضوں کے بعد رات کی نماز ہے۔‘‘ قتیبہ بن سعید نے «شہر» کا لفظ استعمال نہیں کیا،بلکہ صرف «رمضان» کہا۔";
abudawood.hukam = "صحیح مسلم (1163)";
abudawood.description = ``;