var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،حَدَّثَنَا عِيسَى،حَدَّثَنَا عُثْمَانُ يَعْنِي ابْنَ حَكِيمٍ،قَالَ: سَأَلْتُ سَعِيدَ بْنَ جُبَيْرٍ،عَنْ صِيَامِ رَجَبٍ؟ فَقَالَ: أَخْبَرَنِي ابْنُ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ،حَتَّى نَقُولَ: لَا يُفْطِرُ،وَيُفْطِرُ،حَتَّى نَقُولَ: لَا يَصُومُ.";
abudawood.urdu = "عثمان بن حکیم کہتے ہیں کہ میں نے سعید بن جبیر سے رجب کے روزے کے متعلق سوال کیا تو انہوں نے کہا: مجھے ابن عباس رضی اللہ عنہما نے خبر دی ہے کہ رسول اللہ ﷺ روزے رکھا کرتے تو ہم کہتے: اب نہیں چھوڑیں گے اور کبھی چھوڑ دیتے تو ہم کہتے: اب نہیں رکھیں گے۔";
abudawood.hukam = "صحیح بخاری (1971 مختصرًا) صحیح مسلم (1157)";
abudawood.description = ``;