var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ سَمِعَ عَائِشَةَ،تَقُولُ: كَانَ أَحَبَّ الشُّهُورِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَصُومَهُ شَعْبَانُ،ثُمَّ يَصِلُهُ بِرَمَضَانَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ روزے رکھنے کے لیے رسول اللہ ﷺ کو شعبان کا مہینہ سب سے زیادہ پسند تھا پھر آپ اسے (گویا) رمضان ہی سے ملا دیتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (2352 وسندہ صحیح)`;