var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ صَفْوَانَ بْنِ سُلَيْمٍ وَ سَعْدِ بْنِ سَعِيدٍ،عَنْ عُمَرَ بْنِ ثَابِتٍ الْأَنْصَارِيِّ،عَنْ أَبِي أَيُّوبَ-صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ بِسِتٍّ مِنْ شَوَّالٍ, فَكَأَنَّمَا صَامَ الدَّهْرَ.";
abudawood.urdu = "نبی کریم ﷺ کے صحابی سیدنا ابوایوب رضی اللہ عنہ،نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس نے رمضان کے روزے رکھے،پھر اس کے بعد شوال میں چھ روزے رکھے تو اس نے گویا زمانہ بھر روزے رکھے۔‘‘";
abudawood.hukam = "صحیح مسلم (1164)";
abudawood.description = ``;