var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِمَعْنَاهُ،زَادَ: كَانَ يَصُومُهُ إِلَّا قَلِيلًا،بَلْ كَانَ يَصُومُهُ كُلَّهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ،نبی کریم ﷺ کے متعلق بیان کرتے ہیں جیسے کہ مذکورہ بالا حدیث عائشہ میں گزرا ہے۔اور اس میں اس قدر زیادہ ہے کہ آپ ﷺ شعبان میں بہت کم ناغہ فرماتے تھے بلکہ (گویا) سارا شعبان ہی روزے رکھتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;