var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ عَنِ الْحُرِّ بْنِ الصَّبَّاحِ،عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنِ امْرَأَتِهِ،عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ تِسْعَ ذِي الْحِجَّةِ،وَيَوْمَ عَاشُورَاءَ،وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ،أَوَّلَ اثْنَيْنِ مِنَ الشَّهْرِ وَالْخَمِيسَ.";
abudawood.urdu = "امہات المؤمنین میں سے ایک کا بیان ہے کہ رسول اللہ ﷺ ذوالحجہ کے (پہلے) نو دن،عاشورہ محرم،ہر مہینے میں تین دن اور ہر مہینے کے پہلے سوموار اور جمعرات کو روزہ رکھا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وأخرجہ النسائي (2374 وسندہ صحیح) ھنیدۃ: صحابي، وامرأتہ: صحابیۃ`;