var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ شَوْكَرٍ،حَدَّثَنَا هُشَيْمٌ،عَنْ عُرْوَةَ الْهَمْدَانِيِّ،حَدَّثَنَا الشَّعْبِيُّ،قَالَ: قَالَتْ عَائِشَةُ-رَضِيَ اللَّهُ عَنْهَا-لَئِنْ شِئْتُمْ لَأُرِيَنَّكُمْ أَثَرَ يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَائِطِ, حَيْثُ كَانَ يَغْتَسِلُ مِنَ الْجَنَابَةِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے کہا کہ اگر چاہو تو میں تمہیں رسول اللہ ﷺ کے دیوار پر ہاتھ مارنے کے نشان دکھا سکتی ہوں جہاں کہ آپ ﷺ غسل جنابت کیا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الشعبي: لم یسمع من عائشۃ رضي اﷲ عنہا کما قال المنذري (عون المعبود 1/ 100)`;
abudawood.anwaar = [22,1];