var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ،حَدَّثَنَا حَوْشَبُ بْنُ عُقَيْلٍ،عَنْ مَهْدِيٍّ الْهَجَرِيِّ،حَدَّثَنَا عِكْرِمَةُ،قَالَ: كُنَّا عِنْدَ أَبِي هُرَيْرَةَ فِي بَيْتِهِ،فَحَدَّثَنَا: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے منع فرمایا ہے کہ عرفہ کے روز عرفات میں روزہ رکھا جائے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2062)
أخرجہ ابن ماجہ (1732 وسندہ حسن) وصححہ ابن خزیمۃ (2101 وسندہ حسن) مھدي بن حرب العبدي وثقہ ابن خزیمۃ والحاکم وغیرہما وأخطأ من جھلہ`;