var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ قَالَ،أَخْبَرَنِي نَافِعٌ عَنِ ابْنِ عُمَرَ،قَالَ: كَانَ عَاشُورَاءُ يَوْمًا نَصُومُهُ فِي الْجَاهِلِيَّةِ،فَلَمَّا نَزَلَ رَمَضَانُ, قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: هَذَا يَوْمٌ مِنْ أَيَّامِ اللَّه،ِ فَمَنْ شَاءَ صَامَهُ،وَمَنْ شَاءَ تَرَكَهُ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما کا بیان ہے کہ اسلام سے پہلے ہم دسویں محرم کو روزہ رکھا کرتے تھے۔جب رمضان کا حکم نازل ہوا تو رسول اللہ ﷺ نے فرمایا ’’یہ اللہ کے دنوں میں سے ایک دن ہے جو چاہے اس کا روزہ رکھ لے اور جو چاہے چھوڑ دے۔‘‘";
abudawood.hukam = "صحیح بخاری (4501) صحیح مسلم (1126)";
abudawood.description = ``;