var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْلَمَةَ،عَنْ عَمِّهِ،أَنَّ أَسْلَمَ أَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: صُمْتُمْ يَوْمَكُمْ هَذَا؟،قَالُوا: لَا،قَالَ: فَأَتِمُّوا بَقِيَّةَ يَوْمِكُمْ،وَاقْضُوهُ. قَالَ أَبو دَاود: يَعْنِي: يَوْمَ عَاشُورَاءَ.";
abudawood.urdu = "عبدالرحمٰن بن مسلمہ اپنے چچا سے روایت کرتے ہیں کہ قبیلہ اسلم کے لوگ نبی کریم ﷺ کی خدمت میں پہنچے تو آپ نے ان سے پوچھا ’’کیا تم نے آج کا روزہ رکھا ہے؟‘‘ انہوں نے کہا: نہیں۔آپ ﷺ نے فرمایا ’’تو بقیہ دن کو بطور روزہ کے پورا کرو اور اس کی قضاء کرنا۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: اس سے مراد عاشورا کا دن تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد الرحمٰن بن مسلمۃ مجہول<br>انظر التحریر (3884) لم یوثقہ غیر ابن حبان`;
abudawood.anwaar = [90,1];