var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،حَدَّثَنَا هَمَّامٌ،عَنْ أَنَسٍ أَخِي مُحَمَّدٍ عَنِ ابْنِ مِلْحَانَ الْقَيْسِيِّ،عَنْ أَبِيهِ, قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ نَصُومَ الْبِيضَ: ثَلَاثَ عَشْرَةَ،وَأَرْبَعَ عَشْرَةَ،وَخَمْسَ عَشْرَةَ،قَالَ: وَقَالَ: هُنَّ كَهَيْئَةِ الدَّهْرِ.";
abudawood.urdu = "ابن ملحان قیسی (عبدالملک بن قتادہ) اپنے والد (قتادہ بن ملحان رضی اللہ عنہ) سے بیان کرتے ہیں،وہ کہتے ہیں کہ رسول اللہ ﷺ ہم سے فرمایا کرتے تھے کہ ہم ایام بیض یعنی تیرہ،چودہ اور پندرہ تاریخ کے روزے رکھا کریں۔آپ ﷺ نے فرمایا ’’یہ روزے ایسے ہیں گویا سارے زمانے کے روزے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (2432-2434) ابن ماجہ (1707)<br>ابن ملحان : عبدالملک بن قتادۃ مستور،لم یوثقہ غیر ابن حبان`;
abudawood.anwaar = [90,1];