var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا أَبُو دَاوُدَ،حَدَّثَنَا شَيْبَانُ،عَنْ عَاصِمٍ،عَنْ زِرٍّ،عَنْ عَبْدِ اللَّهِ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ –يَعْنِي: مِنْ غُرَّةِ كُلِّ شَهْرٍ-ثَلَاثَةَ أَيَّامٍ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ ہر مہینے کی ابتداء میں تین دن روزے رکھا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2058)
أخرجہ الترمذي (742 وسندہ حسن)`;