var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ عَاصِمِ بْنِ بَهْدَلَةَ،عَنْ سَوَاءٍ الْخُزَاعِيِّ،عَنْ حَفْصَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ ثَلَاثَةَ أَيَّامٍ مِنَ الشَّهْرِ: الِاثْنَيْنِ وَالْخَمِيسَ،وَالِاثْنَيْنِ مِنَ الْجُمْعَةِ الْأُخْرَى.";
abudawood.urdu = "ام المؤمنین سیدہ حفصہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ مہینے میں تین روزے رکھا کرتے تھے۔(پہلے) سوموار اور جمعرات کو اور اگلے ہفتے میں (دوسرے) سوموار کو۔(اس طرح کل تین روزے ہو جاتے ہیں۔)";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (2368 وسندہ حسن) سواء الخزاعي وثقہ ابن حبان وابن خزیمۃ بتصحیح حدیثہ فھو حسن الحدیث`;