var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،حَدَّثَنَا الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ،عَنْ هُنَيْدَةَ الْخُزَاعِيِّ،عَنْ أُمِّهِ،قَالَتْ: دَخَلْتُ عَلَى أُمِّ سَلَمَةَ،فَسَأَلْتُهَا عَنِ الصِّيَامِ؟ فَقَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنِي أَنْ أَصُومَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ،أَوَّلُهَا: الِاثْنَيْنِ وَالْخَمِيسِ.";
abudawood.urdu = "ہنیدہ خزاعی اپنی والدہ سے بیان کرتے ہیں ‘ ان کا کہنا ہے کہ میں ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا کی خدمت میں حاضر ہوئی اور ان سے روزوں کے متعلق دریافت کیا تو انہوں نے کہا: رسول اﷲ ﷺ مجھے ارشاد فرمایا کرتے تھے کہ میں ہر مہینے میں تین روزے رکھ لیا کروں۔ان میں پہلا سوموار کا ہو اور (دوسرا) جمعرات کا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2060)
أخرجہ النسائي (2421 وسندہ صحیح) ھنیدۃ بن خالد وأمہ صحابیان`;