var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،حَدَّثَنَا مَعْمَرٌ،عَنْ هَمَّامِ بْنِ مُنَبِّهٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَصُومُ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ, غَيْرَ رَمَضَانَ،وَلَا تَأْذَنُ فِي بَيْتِهِ وَهُوَ شَاهِدٌ, إِلَّا بِإِذْنِهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اﷲ ﷺ نے فرمایا ’’عورت کو روا نہیں کہ شوہر موجود ہو تو اس کی اجازت کے بغیر روزہ رکھے مگر یہ کہ رمضان کے روزے ہوں۔اور ایسے ہی روا نہیں کہ شوہر موجود ہو تو اس کی اجازت کے بغیر کسی کو گھر میں آنے دے۔‘‘";
abudawood.hukam = "صحیح بخاری (5192) صحیح مسلم (1026)";
abudawood.description = ``;