var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ, فَلْيَقُلْ: إِنِّي صَائِمٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اﷲ ﷺ نے فرمایا ’’جب تم میں سے کسی کو کھانے میں بلایا جائے اور اس نے روزہ رکھا ہوا ہو تو کہہ دے کہ میں روزے سے ہوں۔‘‘";
abudawood.hukam = "صحیح مسلم (1150)";
abudawood.description = ``;