var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ عُقَيْلٍ عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ،حَتَّى قَبَضَهُ اللَّهُ،ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ رمضان مبارک کے آخری دہے میں اعتکاف کیا کرتے ہیں ‘ آخر حیات تک آپ کا یہ معمول رہا ‘ آپ کے بعد پھر آپ کی ازواج مطہرات بھی اعتکاف بیٹھا کرتی تھیں۔";
abudawood.hukam = "صحیح بخاری (2026) صحیح مسلم (1172)";
abudawood.description = ``;