var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا ثَابِتٌ،عَنْ أَبِي رَافِعٍ،عَنْ أُبَيِّ بْنِ كَعْبٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ،فَلَمْ يَعْتَكِفْ عَامًا،فَلَمَّا كَانَ فِي الْعَامِ الْمُقْبِلِ اعْتَكَفَ عِشْرِينَ لَيْلَةً.";
abudawood.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ رمضان کا آخری عشرہ اعتکاف فرمایا کرتے تھے۔ایک سال آپ ﷺ اعتکاف نہ بیٹھ سکے تو اگلے سال آپ ﷺ نے بیس رات تک اعتکاف فرمایا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2102، 2103)
أخرجہ ابن ماجہ (1770 وسندہ صحیح) وصححہ ابن خزیمۃ (2225 وسندہ صحیح)`;