var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ،عَنْ يُونُسَ أَنَّ نَافِعًا،أَخْبَرَهُ عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ. قَالَ نَافِعٌ: وَقَدْ أَرَانِي عَبْدُ اللَّهِ الْمَكَانَ الَّذِي كَانَ يَعْتَكِفُ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْمَسْجِدِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ رمضان کا آخری عشرہ اعتکاف فرمایا کرتے تھے۔نافع کہتے ہیں کہ سیدنا عبداللہ رضی اللہ عنہما نے مجھے مسجد نبوی میں وہ جگہ دکھائی جہاں رسول اﷲ ﷺ اعتکاف فرمایا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (2025) صحیح مسلم (1171)";
abudawood.description = ``;