var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ،عَنْ أَبِي بَكْرٍ،عَنْ أَبِي حُصَيْنٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْتَكِفُ كُلَّ رَمَضَانَ عَشَرَةَ أَيَّامٍ،فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ اعْتَكَفَ عِشْرِينَ يَوْمًا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی کریم ﷺ ہر رمضان کے آخری دس دن اعتکاف فرمایا کرتے تھے۔چنانچہ جس سال آپ ﷺ کا وصال ہوا آپ نے بیس دن اعتکاف فرمایا۔";
abudawood.hukam = "صحیح بخاری (2044)";
abudawood.description = ``;