var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ،عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اعْتَكَفَ يُدْنِي إِلَيَّ رَأْسَهُ فَأُرَجِّلُهُ،وَكَانَ لَا يَدْخُلُ الْبَيْتَ إِلَّا لِحَاجَةِ الْإِنْسَانِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اﷲ ﷺ اعتکاف کے دوران میں اپنا سر مبارک میری طرف جھکا دیتے اور میں اس میں کنگھی کر دیتی اور آپ ﷺ قضائے حاجت کے لیے ہی گھر میں تشریف لایا کرتے تھے۔";
abudawood.hukam = "صحیح مسلم (297)";
abudawood.description = ``;