var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ،قَالَا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكُونُ مُعْتَكِفًا فِي الْمَسْجِدِ،فَيُنَاوِلُنِي رَأْسَهُ مِنْ خَلَلِ الْحُجْرَةِ،فَأَغْسِلُ رَأْسَهُ. وَقَالَ مُسَدَّدٌ فَأُرَجِّلُهُ وَأَنَا حَائِضٌ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اﷲ ﷺ مسجد میں اعتکاف میں ہوتے ‘ آپ ﷺ حجرے میں سے اپنا سر میری طرف کر دیتے اور میں آپ ﷺ کا سر دھو دیتی۔مسدد کے الفاظ ہیں: میں آپ کی کنگھی کر دیتی جبکہ میں حائضہ ہوتی۔";
abudawood.hukam = "صحیح بخاری (295، 2030، 5925) صحیح مسلم (297)";
abudawood.description = ``;