var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا أَبُو الْيَمَانِ،أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ بِإِسْنَادِهِ بِهَذَا... قَالَتْ: حَتَّى إِذَا كَانَ عِنْدَ بَابِ الْمَسْجِدِ الَّذِي عِنْدَ بَابِ أُمِّ سَلَمَةَ, مَرَّ بِهِمَا رَجُلَانِ... وَسَاقَ مَعْنَاهُ.";
abudawood.urdu = "شعیب ‘ زہری سے ان کی سند سے یہ روایت بیان کرتے ہیں کہ (سیدہ صفیہ رضی اللہ عنہا بیان کرتی ہیں کہ) جب آپ مسجد کے دروازے کے قریب پہنچے جو کہ سیدہ ام سلمہ رضی اللہ عنہا کے گھر کے دروازے کے پاس تھا تو آپ کے پاس سے دو آدمی گزرے۔اور مذکورہ بالا (حدیث) کے ہم معنٰی بیان کیا۔";
abudawood.hukam = "صحیح بخاری (2035)";
abudawood.description = ``;