var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا أَبُو دَاوُدَ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُدَيْلٍ،عَنْ عَمْرِو بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ،أَنَّ عُمَرَ رَضِي اللَّهُ عَنْهُ جَعَلَ عَلَيْهِ أَنْ يَعْتَكِفَ فِي الْجَاهِلِيَّةِ لَيْلَةً-أَوْ يَوْمًا-عِنْدَ الْكَعْبَةِ،فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ: اعْتَكِفْ وَصُمْ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما روایت کرتے ہیں کہ سیدنا عمر رضی اللہ عنہ نے ایام جاہلیت میں یہ نذر مانی تھی کہ کعبہ میں ایک رات یا دن کا اعتکاف کروں گا۔پس انہوں نے اس کے متعلق نبی کریم ﷺ سے دریافت کیا تو آپ ﷺ نے فرمایا ’’اعتکاف کرو اور روزہ (بھی) رکھو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قال أبو بکر النیسا بوري : ’’ ھذا حدیث منکروابن بدیل ضعیف الحدیث‘‘ (سنن الدارقطني 200/2،201)<br>والحدیث الصحیح لیس فیہ ’’وصم ‘‘`;
abudawood.anwaar = [91,1];