var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَقُتَيْبَةُ بْنُ سَعِيدٍ،قَالَا: حَدَّثَنَا يَزِيدُ،عَنْ خَالِدٍ،عَنْ عِكْرِمَةَ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،قَالَتِ: اعْتَكَفَتْ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةٌ مِنْ أَزْوَاجِهِ،فَكَانَتْ تَرَى الصُّفْرَةَ،وَالْحُمْرَةَ،فَرُبَّمَا وَضَعْنَا الطَّسْتَ تَحْتَهَا،وَهِيَ تُصَلِّي.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ کی ازواج سے ایک نے آپ ﷺ کے ساتھ اعتکاف کیا۔اسے زردی مائل یا سرخ سا خون آتا تھا۔(استحاضہ کی وجہ سے) تو ہم کبھی اس کے نیچے لگن بھی رکھ دیا کرتے تھے اور وہ نماز پڑھا کرتی تھیں۔";
abudawood.hukam = "صحیح بخاری (2037)";
abudawood.description = ``;