var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،أَخْبَرَنَا عِيسَى،عَنْ حَرِيزِ بْنِ عُثْمَانَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَوْفٍ،عَنْ أَبِي هِنْدٍ،عَنْ مُعَاوِيَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: لَا تَنْقَطِعُ الْهِجْرَةُ حَتَّى تَنْقَطِعَ التَّوْبَةُ،وَلَا تَنْقَطِعُ التَّوْبَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا";
abudawood.urdu = "سیدنا معاویہ رضی اللہ عنہ سے مروی ہے،وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو سنا،آپ ﷺ فرماتے تھے ’’ہجرت ختم نہیں ہو سکتی،حتیٰ کہ توبہ منقطع ہو جائے،اور توبہ اس وقت تک منقطع نہیں ہو گی،حتیٰ کہ سورج مغرب سے طلوع ہو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2346)
وللحدیث شاھد عند أحمد (1/192) والطحاوي في مشکل الآثار (3/259)`;