var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،حَدَّثَنِي الْحَارِثُ بْنُ وَجِيهٍ،حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ تَحْتَ كُلِّ شَعْرَةٍ جَنَابَةً،فَاغْسِلُوا الشَّعْرَ،وَأَنْقُوا الْبَشَرَ. قَالَ أَبُو دَاوُد: الْحَارِثُ ابْنُ وَجِيهٍ،حَدِيثُهُ مُنْكَرٌ،وَهُوَ ضَعِيفٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’ہر ہر بال کے نیچے جنابت ہے،لہذا اپنے بالوں کو دھوو اور جسم کو صاف کرو۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: حارث بن وجیہ کی (مذکورہ) حدیث منکر ہے۔اور وہ ضعیف ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (106)،ابن ماجہ (597)<br>الحارث بن وجیہ: ضعیف ضعفہ أبو داود وقال ابن حجر : ضعیف (تقریب: 1056)`;
abudawood.anwaar = [22,1];