var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ مَنْصُورٍ،عَنْ مُجَاهِدٍ،عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-يَوْمَ الْفَتْحِ فَتْحِ مَكَّةَ-: لَا هِجْرَةَ،وَلَكِنْ جِهَادٌ وَنِيَّةٌ،وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فتح مکہ کے روز فرمایا ’’(اب) ہجرت نہیں ہے،لیکن جہاد اور نیت باقی ہے،جب تمہیں جہاد کے لیے دعوت دی جائے تو نکل کھڑے ہو۔‘‘";
abudawood.hukam = "صحیح بخاری (2018)";
abudawood.description = ``;