var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ قَتَادَةَ،عَنْ مُطَرِّفٍ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ،ظَاهِرِينَ عَلَى مَنْ نَاوَأَهُمْ،حَتَّى يُقَاتِلَ آخِرُهُمُ الْمَسِيحَ الدَّجَّالَ.";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’میری امت کا ایک گروہ ہمیشہ حق کے لیے قتال کرتا رہے گا اور وہ اپنے مقابل آنے والوں پر غالب رہیں گے حتیٰ کہ ان کا آخری گروہ مسیح دجال سے لڑائی کرے گا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3819)
قتادۃ تابعہ أبو العلاء یزید بن عبد اللہ بن الشخیر عند أحمد (4/434)`;