var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى،حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ،حَدَّثَنَا حَيْوَةُ عَنِ ابْنِ شُفَيٍّ،عَنْ شُفَيِّ بْنِ مَاتِعٍ،عَنْ عَبْدِ اللَّهِ-هُوَ ابْنُ عَمْرٍو-،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: قَفْلَةٌ كَغَزْوَةٍ.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جہاد سے واپس لوٹنا (فضیلت اور ثواب میں) ایسے ہے جیسے جہاد کے لیے جانا۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3841)`;