var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا،عَنْ مُطَرِّفٍ،عَنْ بِشْرٍ أَبِي عَبْدِ اللَّهِ،عَنْ بَشِيرِ بْنِ مُسْلِمٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَرْكَبُ الْبَحْرَ إِلَّا حَاجٌّ،أَوْ مُعْتَمِرٌ،أَوْ غَازٍ فِي سَبِيلِ اللَّهِ, فَإِنَّ تَحْتَ الْبَحْرِ نَارًا،وَتَحْتَ النَّارِ بَحْرًا.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’حج،عمرہ یا جہاد فی سبیل اللہ کی غرض کے سوا سمندری سفر نہ کیا جائے،بلاشبہ سمندر کے نیچے آگ ہے اور آگ کے نیچے سمندر ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>بشیر بن مسلم مجہول (تق : 721)<br>والحدیث ضعفہ البخاري وعبدالحق وابن الملقن وغیرھم`;
abudawood.anwaar = [92,1];