var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ،حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ جَعْفَرٍ عَنِ الْعَلَاءِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لَا يَجْتَمِعُ فِي النَّارِ كَافِرٌ وَقَاتِلُهُ أَبَدًا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کافر اور اس کا قاتل (مجاہد) آگ میں کبھی بھی اکٹھے نہیں ہو سکتے۔‘‘";
abudawood.hukam = "صحیح مسلم (1891)";
abudawood.description = ``;