var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ يَحْيَى بْنِ أَيُّوبَ وَسَعِيدِ بْنِ أَبِي أَيُّوبَ،عَنْ زَبَّانَ بْنِ فَائِدٍ،عَنْ سَهْلِ بْنِ مُعَاذٍ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّسهُ عَلَيْهِ وَسَلَّمَ: إِنَّ الصَّلَاةَ وَالصِّيَامَ وَالذِّكْرَ تُضَاعَفُ عَلَى النَّفَقَةِ فِي سَبِيلِ اللَّهِ بِسَبْعِ مِائَةِ ضِعْفٍ.";
abudawood.urdu = "جناب سہل بن معاذ اپنے والد (معاذ بن انس رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اللہ کی راہ میں جہاد کے دوران میں نماز،روزے اور ذکر کا اجر،اللہ کی راہ میں خرچ کرنے کے مقابلے میں سات سو گنا تک بڑھا دیا جاتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>زبان : ضعیف`;
abudawood.anwaar = [92,1];