var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اتَّقُوا اللَّاعِنَيْنِ قَالُوا وَمَا اللَّاعِنَانِ يَا رَسُولَ اللَّهِ قَالَ الَّذِي يَتَخَلَّى فِي طَرِيقِ النَّاسِ أَوْ ظِلِّهِمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’لعنت کے دو کاموں سے بچو۔‘‘ صحابہ کرام رضی اللہ عنہم نے پوچھا: اے اللہ کے رسول! لعنت کے وہ کون سے دو کام ہیں؟ آپ ﷺ نے فرمایا ’’جو لوگوں کے راستے میں یا ان کے سائے میں پاخانہ کرتا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (269)";
abudawood.description = ``;