var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا أَبُو إِسْحَاقَ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ،وَيُصَلِّي الرَّكْعَتَيْنِ،وَصَلَاةَ الْغَدَاةِ،وَلَا أَرَاهُ يُحْدِثُ وُضُوءًا بَعْدَ الْغُسْلِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ ﷺ غسل کرتے،دو رکعتیں ادا کرتے اور نماز فجر پڑھتے اور میں نہیں سمجھتی کہ آپ ﷺ غسل کے بعد وضو کی تجدید کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (107)،ابن ماجہ (579)<br>أبو إسحاق لم یصرح بالسماع في ھذا اللفظ (تقدم: 162)`;
abudawood.anwaar = [22,1];