var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،حَدَّثَنِي أَبُو هَانِئٍ،عَنْ عَمْرِو بْنِ مَالِكٍ،عَنْ فَضَالَةَ بْنِ عُبَيْدٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَال:َ كُلُّ الْمَيِّتِ يُخْتَمُ عَلَى عَمَلِهِ إِلَّا الْمُرَابِطَ, فَإِنَّهُ يَنْمُو لَهُ عَمَلُهُ إِلَى يَوْمِ الْقِيَامَةِ،وَيُؤَمَّنُ مِنْ فَتَّانِ الْقَبْرِ.";
abudawood.urdu = "سیدنا فضالہ بن عبید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’ہر مرنے والے کا عمل (اس کے مرنے پر) ختم ہو جاتا ہے،مگر مورچہ بند کہ اس کا عمل قیامت تک کے لیے بڑھتا رہتا ہے اور وہ قبر کے عذاب سے (یا منکر و نکیر کے سوال جواب) سے امن میں رہتا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3823)
أخرجہ الترمذي (1621 وسندہ حسن)`;