var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ الْمَرْوَزِيُّ،أَخْبَرَنَا ابْنُ الْمُبَارَكِ،أَخْبَرَنَا وُهَيْبٌ قَالَ عَبْدَةُ يَعْنِي ابْنَ الْوَرْدِ،أَخْبَرَنِي عُمَرُ ابْنُ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ مَاتَ وَلَمْ يَغْزُ،وَلَمْ يُحَدِّثْ نَفْسَهُ بِالْغَزْوِ, مَاتَ عَلَى شُعْبَةٍ مِنْ نِفَاقٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جو شخص اس حال میں مرا کہ اس نے جہاد نہیں کیا اور اپنے دل میں بھی جہاد کی نیت نہیں کی تو وہ نفاق کی ایک شاخ پر مرا۔‘‘";
abudawood.hukam = "صحیح مسلم (1910)";
abudawood.description = ``;