var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: جَاهِدُوا الْمُشْرِكِينَ بِأَمْوَالِكُمْ،وَأَنْفُسِكُمْ،وَأَلْسِنَتِكُمْ.";
abudawood.urdu = "سیدناانس رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’مشرکین سے جہاد کرو اپنے مالوں کے ساتھ،اپنی جانوں کے ساتھ اور اپنی زبانوں کے ساتھ۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3821)
ولہ شاھد فی المختارۃ للضیاء المقدسي (5/ 36 ح 1642)`;