var abudawood = {};
abudawood.arabic = "حَدَّثَنَاعُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ الْحَنَفِيِّ،حَدَّثَنِي نَجْدَةُ بْنُ نُفَيْعٍ،قَالَ: سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ هَذِهِ الْآيَةِ: إِلَّا تَنْفِرُوا يُعَذِّبْكُمْ عَذَابًا أَلِيمًا[التوبة: 39], قَالَ: فَأُمْسِكَ عَنْهُمُ الْمَطَرُ،وَكَانَ عَذَابَهُمْ .";
abudawood.urdu = "نجدہ بن نفیع کہتے ہیں کہ میں نے سیدنا ابن عباس رضی اللہ عنہما سے سورۃ التوبہ (کی آیت 39) کی تفسیر پوچھی،جس میں ہے کہ ’’اگر تم جہاد کے لیے نہ نکلو گے تو اللہ تمہیں درد ناک عذاب سے دوچار کر دے گا۔‘‘ انہوں نے فرمایا: ان سے بارش روک لی گئی اور یہی ان کا عذاب تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نجدۃ بن نفیع مجہول (تق : 7099)`;
abudawood.anwaar = [92,1];