var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ أَبُو مَعْمَرٍ،حَدَّثَنَا عَبْدُ الْوَارِثِ،حَدَّثَنَا الْحُسَيْنُ،حَدَّثَنِي يَحْيَى،حَدَّثَنِي أَبُو سَلَمَةَ،حَدَّثَنِي بُسْرُ بْنُ سَعِيدٍ،حَدَّثَنِي زَيْدُ بْنُ خَالِدٍ الْجُهَنِيُّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ فَقَدْ غَزَا،وَمَنْ خَلَفَهُ فِي أَهْلِهِ بِخَيْرٍ فَقَدْ غَزَا.";
abudawood.urdu = "سیدنا زید بن خالد جہنی رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس کسی نے مجاہد کو سامان جہاد دیا،تو بلاشبہ اس نے جہاد کیا،اور جو مجاہد کے اہل خانہ کی بحسن و خوبی خبرگیری کرتا رہا،تو بلاشبہ اس نے جہاد کیا۔‘‘";
abudawood.hukam = "صحیح بخاری (2843) صحیح مسلم (1895)";
abudawood.description = ``;