var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ،عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ،عَنْ مُوسَى بْنِ عَلِيِّ بْنِ رَبَاحٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ الْعَزِيزِ بْنِ مَرْوَانَ،قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: شَرُّ مَا فِي رَجُلٍ: شُحٌّ هَالِعٌ،وَجُبْنٌ خَالِعٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو سنا آپ ﷺ فرماتے تھے ’’انسان میں دو وصف بہت برے ہوتے ہیں۔ایک یہ کہ حریص و بخیل ہونے کے ساتھ ساتھ دل کا کچا ہو۔دوسرا یہ کہ اتنا بزدل ہو کہ گویا دل ہی نکل جائے گا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1874)`;