var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ،حَدَّثَنَا ابْنُ نَافِعٍ يَعْنِي الصَّائِغَ،عَنْ أُسَامَةَ عَنِ الْمَقْبُرِيِّ،عَنْ أُمِّ سَلَمَةَ،أَنَّ امْرَأَةً جَاءَتْ إِلَى أُمِّ سَلَمَةَ... بِهَذَا الْحَدِيثِ. قَالَتْ: فَسَأَلْتُ لَهَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ بِمَعْنَاهُ... قَالَ فِيهِ: وَاغْمِزِي قُرُونَكِ عِنْدَ كُلِّ حَفْنَةٍ";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا کہتی ہیں کہ ایک عورت ان کے پاس آئی اور یہی مسئلہ دریافت کیا۔وہ کہتی ہیں کہ میں نے اس کی خاطر رسول اللہ ﷺ سے پوچھا،اور اوپر کی حدیث کے ہم معانی بیان کیا،اس روایت میں ہے ’’ہر لپ ڈالنے کے بعد اپنے بالوں کی چوٹیاں نچوڑ ڈال۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;