var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا عَوْفٌ حَدَّثَتْنَا حَسْنَاءُ بِنْتُ مُعَاوِيَةَ الصَّرِيمِيَّةُ،قَالَتْ: حَدَّثَنَا عَمِّي،قَالَ: قُلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ فِي الْجَنَّةِ؟ قَالَ: النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنَّةِ،وَالشَّهِيدُ فِي الْجَنَّةِ،وَالْمَوْلُودُ فِي الْجَنَّةِ،وَالْوَئِيدُ فِي الْجَنَّةِ.";
abudawood.urdu = "حسناء بنت معاویہ صریمیہ بیان کرتی ہیں کہ ہم سے ہمارے چچا (اسلم بن سلیم رضی اللہ عنہ) نے بیان کیا،انہوں نے کہا: میں نے نبی کریم ﷺ سے عرض کیا کہ جنت میں کون ہو گا؟ آپ ﷺ نے فرمایا ’’نبی جنت میں ہوں گے،شہید جنت میں جائے گا،چھوٹا بچہ جنت میں جائے گا اور زندہ دفن کیا گیا بچہ جنت میں جائے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حسناء مجھولۃ الحال<br>وللحدیث شواھد ضعیفۃ<br>وفی الباب حدیث یخالفہ (الأصل : 4717)<br>کأن بعض الموؤدات فی الجنۃ وبعضھن فی النار،واللّٰہ أعلم`;
abudawood.anwaar = [92,1];