var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ،حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ الْفَضْلِ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،حَدَّثَنِي يَزِيدُ بْنُ رُومَانَ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،قَالَتْ: لَمَّا مَاتَ النَّجَاشِيُّ كُنَّا نَتَحَدَّثُ أَنَّهُ لَا يَزَالُ يُرَى عَلَى قَبْرِهِ نُورٌ .";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ جب نجاشی رحمہ اللہ کی وفات ہوئی تو ہم لوگ کہا کرتے تھے کہ اس کی قبر پر نور دکھائی دیتا ہے۔ابوسعید نے ہم سے کہا: احمد بن عبدالجبار نے ہمیں بیان کیا کہ ہم کو یزید بن بکیر نے ابن اسحاق سے اسی کی مانند روایت کیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (5947)
أخرجہ ابن ھشام فی السیرۃ (1/364 بتحقیقي)`;