var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِصِّيصِيُّ،حَدَّثَنَا حَجَّاجٌ يَعْنِي ابْنَ مُحَمَّدٍ ح،وحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ وَحَدَّثَنَا ابْنُ وَهْبٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ،عَنْ حَيْوَةَ بْنِ شُرَيْحٍ عَنِ ابْنِ شُفَيٍّ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لِلْغَازِي أَجْرُهُ،وَلِلْجَاعِلِ أَجْرُهُ،وَأَجْرُ الْغَازِي.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جہاد کرنے والے کو اپنا ثواب ملتا ہے اور جو کوئی کسی مجاہد کو تعاون دیتا ہے اسے اپنا ثواب ملتا ہے اور ساتھ ہی جہاد کرنے والے مجاہد کا بھی۔‘‘ (دگنا ثواب ملتا ہے۔)";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3842)`;