var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهِّرٍ،حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْزُو بِأُمِّ سُلَيْمٍ،وَنِسْوَةٍ مِنَ الْأَنْصَارِ،لِيَسْقِينَ الْمَاءَ،وَيُدَاوِينَ الْجَرْحَى.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہرسول اللہ ﷺ (میری والدہ) ام سلیم رضی اللہ عنہا اور انصار کی کچھ عورتوں کو جہاد میں ساتھ لے جایا کرتے تھے تاکہ وہ پانی پلائیں اور زخمیوں کی مرہم پٹی کریں۔";
abudawood.hukam = "صحیح مسلم (1810)";
abudawood.description = ``;