var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ،عَنْ عَمْرِو بْنِ سُوَيْدٍ،عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: كُنَّا نَغْتَسِلُ وَعَلَيْنَا الضِّمَادُ،وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحِلَّاتٌ وَمُحْرِمَاتٌ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ ہم غسل کیا کرتیں اور ہمارے سر پر لیپ ہوتا اور ہم رسول اللہ ﷺ کے ساتھ ہوتی تھیں۔احرام میں اور بغیر احرام میں بھی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;