var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ الطَّالْقَانِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ الْأَنْصَارِيُّ،حَدَّثَنِي عَقِيلُ بْنُ شَبِيبٍ،عَنْ أَبِي وَهْبٍ الْجُشَمِيِّ-وَكَانَتْ لَهُ صُحْبَةٌ-،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: عَلَيْكُمْ بِكُلِّ كُمَيْتٍ أَغَرَّ مُحَجَّلٍ،أَوْ أَشْقَرَ أَغَرَّ مُحَجَّلٍ،أَوْ أَدْهَمَ أَغَرَّ مُحَجَّلٍ.";
abudawood.urdu = "سیدنا ابو وہب جشمی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’ایسے گھوڑے منتخب کیا کرو جو کمیت اور پانچ کلیان ہوں (رنگ سرخ سیاہ ہو مگر پیشانی اور چاروں پاؤں سفید ہوں) یا اشقر پانچ کلیان ہوں (رنگ سرخ ہو اور پیشانی اور چاروں پاؤں سفید ہوں) یا مشکی (سیاہ رنگ) اور پانچ کلیان ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3595)<br>عقیل بن شبیب مجہول (تق : 4660)<br>ولبعض الحدیث شاہد حسن عند الترمذي (1696،1697) و ابن ماجہ (2789)`;
abudawood.anwaar = [93,1];