var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ،حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ،عَنْ شَيْبَانَ،عَنْ عِيسَى بْنِ عَلِيٍّ،عَنْ أَبِيهِ،عَنْ جَدِّهِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يُمْنُ الْخَيْلِ فِي شُقْرِهَا.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’گھوڑوں میں برکت ان کے سرخ رنگ والوں میں ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3879)`;