var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ الرَّقِيُّ،حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ،عَنْ أَبِي حَيَّانَ،حَدَّثَنَا أَبُو زَرْعَةَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُسَمِّي الْأُنْثَى مِنَ الْخَيْلِ فَرَسًا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ مادہ گھوڑی کو ’’فرس‘‘ کہا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مروان بن معاویۃ الفزاري صرح بالسماع عند الحاکم (2/144) والبیھقي`;