var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا مِسْكِينٌ يَعْنِي بْنَ بُكَيْرٍ،حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ،عَنْ رَبِيعَةَ بْنِ يَزِيدَ،عَنْ أَبِي كَبْشَةَ السَّلُولِيِّ،عَنْ سَهْلِ ابْنِ الْحَنْظَلِيَّةِ،قَالَ: مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعِيرٍ قَدْ لَحِقَ ظَهْرُهُ بِبَطْنِهِ،فَقَالَ: اتَّقُوا اللَّهَ فِي هَذِهِ الْبَهَائِمِ الْمُعْجَمَةِ،فَارْكَبُوهَا صَالِحَةً،وَكُلُوهَا صَالِحَةً.";
abudawood.urdu = "سیدنا سہل بن حنظلیہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ ایک اونٹ کے پاس سے گزرے جس کا پیٹ اس کی کمر سے لگ گیا تھا تو آپ ﷺ نے فرمایا ’’ان بے زبان جانوروں کے بارے میں اللہ سے ڈرو،ان پر سواری کرو تو بھلے انداز میں اور کھلاؤ تو بھی عمدہ طرح سے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3370)
انظر الحدیث السابق (1629) والآتي (2567)`;