var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ حَمْزَةَ الضَّبِيِّ،قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،قَالَ: كُنَّا إِذَا نَزَلْنَا مَنْزِلًا لَا نُسَبِّحُ حَتَّى تُحَلَّ الرِّحَالُ .";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ہم جب کسی منزل پر اترتے تو اس وقت تک نماز نہ پڑھتے تھے جب تک کہ اونٹوں پر سے کجاوے نہ اتار لیتے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3917)`;