var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ الطَّالْقَانِيُّ،أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ،حَدَّثَنِي عُقَيْلُ بْنُ شَبِيبٍ،عَنْ أَبِي وَهْبٍ الْجُشَمِيِّ-وَكَانَتْ لَهُ صُحْبَةٌ-،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: ارْتَبِطُوا الْخَيْلَ،وَامْسَحُوا بِنَوَاصِيهَا،وَأَعْجَازِهَا،-أَوْ قَالَ: أَكْفَالِهَا-وَقَلِّدُوهَا،وَلَا تُقَلِّدُوهَا الْأَوْتَارَ.";
abudawood.urdu = "صحابی رسول سیدنا ابو وہب جشمی رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’گھوڑوں کو باندھ کر رکھو (ان کی خوب دیکھ بھال کرو) ان کی پیشانیوں اور سرینوں پر ہاتھ پھیرا کرو۔‘‘ راوی کو شک ہے کہ آپ نے لفظ <حدیث> «أعجازہا» </حدیث> کہا یا <حدیث> «أکفالہا» </حدیث> اور گردنوں میں رسیاں باندھو مگر تانت کی رسی نہ ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیثین السابقین (2543،2544)`;
abudawood.anwaar = [94,1];