var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنْ سَالِمٍ،عَنْ أَبِي الْجَرَّاحِ مَوْلَى أُمِّ حَبِيبَةَ،عَنْ أُمِّ حَبِيبَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا تَصْحَبُ الْمَلَائِكَةُ رِفْقَةً فِيهَا جَرَسٌ.";
abudawood.urdu = "ام المؤمنین سیدہ ام حبیبہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ نے فرمایا ’’جس قافلہ اور جماعت میں گھنٹی ہو ‘ فرشتے اس کے ساتھ نہیں ہوتے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتي (2555)`;