var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لَا تَصْحَبُ الْمَلَائِكَةُ رِفْقَةً فِيهَا كَلْبٌ،أَوْ جَرَسٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’فرشتے اس جماعت کے ساتھ نہیں چلتے جن کے ساتھ کتا ہو یا گھنٹی۔‘‘";
abudawood.hukam = "صحیح مسلم (2113)";
abudawood.description = `مشکوۃ المصابیح (3924)`;