var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ،حَدَّثَنَا أَبُو بَكْرِ بْنُ أُوَيْسٍ،حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَرَسِ: مِزْمَارُ الشَّيْطَانِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے گھنٹی کے متعلق فرمایا ’’یہ شیطان کا باجا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2114)";
abudawood.description = ``;