var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ الرَّازِيُّ،أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْجَهْمِ،حَدَّثَنَا عَمْرٌو يَعْنِي ابْنَ أَبِي قَيْسٍ،عَنْ أَيُّوبَ السَّخْتَيَانِيِّ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْجَلَّالَةِ فِي الْإِبِلِ أَنْ يُرْكَبَ عَلَيْهَا.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے منقول ہے انہوں نے فرمایا کہ رسول اللہ ﷺ نے ایسے اونٹ کی سواری سے منع فرمایا جو گندگی کھاتا ہو۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;