var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ،حَدَّثَنَا شَرِيكٌ،عَنْ قَيْسِ بْنِ وَهْبٍ،عَنْ رَجُلٍ مِنْ بَنِي سُوَاءَةَ بْنِ عَامِرٍ،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ كَانَ يَغْسِلُ رَأْسَهُ بِالْخِطْمِيِّ وَهُوَ جُنُبٌ, يَجْتَزِئُ بِذَلِكَ وَلَا يَصُبُّ عَلَيْهِ الْمَاءَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نبی کریم ﷺ کے متعلق بیان کرتی ہیں کہ آپ ﷺ اپنا سر خطمی سے دھو لیا کرتے تھے جبکہ آپ ﷺ جنبی ہوتے اور آپ ﷺ اسی پر کفایت کرتے مزید پانی نہ بہاتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من بني سواءۃ: مجہول (تقریب: 8518)`;
abudawood.anwaar = [22,1];