var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،أَخْبَرَنَا يَحْيَى بْنُ آدَمَ،عَنْ قُطْبَةَ بْنِ عَبْدِ الْعَزِيزِ بْنِ سِيَاهٍ عَنِ الْأَعْمَشِ،عَنْ أَبِي يَحْيَى الْقَتَّاتِ،عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے اس بات سے منع فرمایا ہے کہ جانوروں کو آپس میں لڑایا جائے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1708)<br>الأعمش عنعن`;
abudawood.anwaar = [94,1];