var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ هِشَامِ بْنِ زَيْدٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَال:َ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَخٍ لِي حِينَ وُلِدَ لِيُحَنِّكَهُ،فَإِذَا هُوَ فِي مِرْبَدٍ يَسِمُ غَنَمًا-أَحْسَبُهُ قَالَ:-فِي آذَانِهَا.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کا بیان ہے کہ میرے بھائی (عبداللہ بن ابی طلحہ) کی ولادت ہوئی تو میں اسے لے کر نبی کریم ﷺ کی خدمت میں حاضر ہوا تاکہ آپ ﷺ اسے گھٹی دیں۔میں نے آپ ﷺ کو بکریوں کے باڑے میں پایا،آپ ﷺ بکریوں کو نشان لگا رہے تھے۔(شعبہ نے) کہا میرا خیال ہے،شیخ نے بیان کیا: آپ ﷺ ان کے کانوں پر نشان لگا رہے تھے۔";
abudawood.hukam = "صحیح بخاری (5542) صحیح مسلم (2119)";
abudawood.description = ``;