var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرَّ عَلَيْهِ بِحِمَارٍ قَدْ وُسِمَ فِي وَجْهِهِ،فَقَالَ: أَمَا بَلَغَكُمْ أَنِّي قَدْ لَعَنْتُ مَنْ وَسَمَ الْبَهِيمَةَ فِي وَجْهِهَا،أَوْ ضَرَبَهَا فِي وَجْهِهَا؟!. فَنَهَى عَنْ ذَلِكَ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ کے پاس سے ایک گدھا لے جایا گیا جس کے چہرے پر داغ دیا گیا تھا تو آپ ﷺ نے فرمایا ’’کیا تمہیں یہ بات نہیں پہنچی کہ میں نے ایسے شخص پر لعنت کی ہے جو کسی جانور کو اس کے چہرے پر داغے یا اس کے منہ پر مارے؟‘‘ چنانچہ آپ ﷺ نے اس کام سے منع فرما دیا۔";
abudawood.hukam = "صحیح مسلم (2117)";
abudawood.description = ``;