var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ أَبِي الْخَيْرِ عَنِ ابْنِ زُرَيْرٍ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِي اللَّهُ عَنْهُ،قَالَ: أُهْدِيَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَغْلَةٌ،فَرَكِبَهَا،فَقَالَ عَلِيٌّ: لَوْ حَمَلْنَا الْحَمِيرَ عَلَى الْخَيْلِ فَكَانَتْ لَنَا مِثْلُ هَذِهِ؟! قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّمَا يَفْعَلُ ذَلِكَ الَّذِينَ لَا يَعْلَمُونَ.";
abudawood.urdu = "سیدنا علی بن ابی طالب رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ کو ایک خچر ہدیہ دیا گیا تو آپ ﷺ اس پر سوار ہوئے۔سیدنا علی رضی اللہ عنہ نے کہا: اگر ہم گدھوں کو گھوڑیوں پر چڑھائیں (تو ان کے اس جنسی عمل سے) ہمیں اس طرح کے خچر حاصل ہو جائیں گے۔رسول اللہ ﷺ نے فرمایا ’’جاہل لوگ یہ کام کرتے ہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3883)
أخرجہ النسائي (3610 وسندہ صحیح) ولہ شاھد انظر الحدیث السابق (808)`;