var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ،حَدَّثَنَا ابْنُ عَيَّاشٍ،عَنْ يَحْيَى بْنِ أَبِي عَمْرٍو السَّيْبَانِيِّ عَنِ ابْنِ أَبِي مَرْيَمَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِيَّاكُمْ أَنْ تَتَّخِذُوا ظُهُورَ دَوَابِّكُمْ مَنَابِرَ, فَإِنَّ اللَّهَ إِنَّمَا سَخَّرَهَا لَكُمْ لِتُبَلِّغَكُمْ إِلَى بَلَدٍ لَمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ،وَجَعَلَ لَكُمُ الْأَرْضَ فَعَلَيْهَا فَاقْضُوا حَاجَتَكُمْ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’اپنے جانوروں کی پیٹھوں کو منبر بنانے سے بچو ‘ بلاشبہ اللہ عزوجل نے ان کو تمہارے تابع کیا ہے تاکہ تمہیں ایک شہر سے دوسرے شہر تک پہنچا دیں جہاں تم نفسوں کی مشقت کے بغیر پہنچ ہی نہیں سکتے تھے اور اس نے تمہارے لیے زمین بنائی ہے تو اپنی ضرورتیں اس پر پوری کیا کرو۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3916)
صححہ ابن خزیمۃ (2544 وسندہ حسن) والحاکم (2/100 وسندہ حسن)`;