var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،حَدَّثَنَا شَرِيكٌ،عَنْ قَيْسِ بْنِ وَهْبٍ،عَنْ رَجُلٍ مِنْ بَنِي سُوَاءَةَ بْنِ عَامِرٍ،عَنْ عَائِشَةَ-فِيمَا يَفِيضُ بَيْنَ الرَّجُلِ وَالْمَرْأَةِ مِنَ الْمَاءِ-،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْخُذُ كَفًّا مِنْ مَاءٍ يَصُبُّ عَلَيَّ الْمَاءَ،ثُمَّ يَأْخُذُ كَفًّا مِنْ مَاءٍ،ثُمَّ يَصُبُّهُ عَلَيْهِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ جو پانی مرد و عورت کے درمیان بہتا ہے،اس کے بارے میں انہوں نے کہا کہ رسول اللہ ﷺ پانی کا ایک چلو لیتے،(اور) مجھ پر پانی ڈالتے (یا پانی،مذی یا منی پر ڈالتے) پھر دوسرا چلو لیتے اور اس کو اپنے اوپر ڈال لیتے (یا مزید اس کے اوپر بہا دیتے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من بني سواءۃ: مجہول،(تقریب: 8518)`;
abudawood.anwaar = [22,1];