var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا هِشَامٌ عَنِ الْحَسَنِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَ هَذَا،قَالَ بَعْدَ قَوْلِهِ: حَقَّهَا: وَلَا تَعْدُوا الْمَنَازِلَ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما،نبی کریم ﷺ سے مذکورہ حدیث کے مثل بیان کرتے ہیں اس روایت میں «حقہا» کے بعد یہ اضافہ ہے کہ ’’(معروف) منازل (اور مسافت) سے تجاوز مت کیا کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3772)<br>ھشام بن حسان مدلس وعنعن ولہ طریق آخر عند ابن خزیمۃ (2548) وسندہ ضعیف`;
abudawood.anwaar = [94,1];