var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ،حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ،حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ عَنِ الرَّبِيعِ بْنِ أَنَسٍ،عَنْ أَنَسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: عَلَيْكُمْ بِالدُّلْجَةِ, فَإِنَّ الْأَرْضَ تُطْوَى بِاللَّيْلِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’رات کے پہلے پہر (یا رات کو بھی) سفر کیا کرو ‘ بلاشبہ رات کے وقت زمین لپیٹ لی جاتی ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3909)
السنن الکبریٰ للبیہقي (5/256 وسندہ حسن) وصححہ ابن خزیمۃ (2555)`;