var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ،عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا سَبَقَ إِلَّا فِي خُفٍّ،أَوْ فِي حَافِرٍ،أَوْ نَصْلٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مقابلہ صرف تین چیزوں میں جائز ہے اونٹ دوڑ ‘ گھوڑ دوڑ یا تیر اندازی۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3874)
أخرجہ الترمذي (1700 وسندہ حسن)`;