var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: سَبَّقَ بَيْنَ الْخَيْلِ وَفَضَّلَ الْقُرَّحَ فِي الْغَايَةِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے گھوڑ دوڑ کا مقابلہ کرایا تو جو گھوڑے پانچویں سال میں داخل ہو چکے تھے،ان کے لیے دوڑ کا فاصلہ زیادہ رکھا تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;