var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ سَعِيدِ بْنِ بَشِيرٍ عَنِ الزُّهْرِيِّ... بِإِسْنَادِ عَبَّادٍ وَمَعْنَاهُ. قَالَ أَبو دَاود: رَوَاهُ مَعْمَرٌ وَشُعَيْبٌ وَعَقِيلٌ،عَنِ الزُّهْرِيِّ،عَنْ رِجَالٍ مِنْ أَهْلِ الْعَلْمِ،وَهَذَا أَصَحُّ عِنْدَنَا.";
abudawood.urdu = "سیدنا زہری رحمہ اللہ نے بہ سند عباد بن عوام بیان کیا اور مذکورہ بالا کے ہم معنی ذکر کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں: اس روایت کو معمر،شعیب اور عقیل نے بواسطہ زہری کئی علماء سے نقل کیا ہے اور یہ ہمارے نزدیک صحیح تر ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سعید بن بشیر ضعیف (تق : 2276) و قال ابن الملقن : والأکثرون علی تضعیفہ (البدر المنیر 9/ 85)`;
abudawood.anwaar = [94,1];