var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ،حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ،قَالَ: كَانَتْ قَبِيعَةُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِضَّةً.\nقَالَ قَتَادَةُ: وَمَا عَلِمْتُ أَحَدًا تَابَعَهُ عَلَى ذَلِكَ.";
abudawood.urdu = "سعید بن ابی الحسن رحمہ اللہ کی روایت ہے کہ رسول اللہ ﷺ کی تلوار کے قبضہ کی ٹوپی چاندی کی تھی۔قتادہ کہتے ہیں: مجھے معلوم نہیں کہ کسی نے اس کی متابعت کی ہو۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شاھد عند النسائي (5375 وسندہ صحیح)`;