var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْروِ بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ التَّنُوخِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعِلْمُ ثَلَاثَةٌ وَمَا سِوَى ذَلِكَ فَهُوَ فَضْلٌ آيَةٌ مُحْكَمَةٌ أَوْ سُنَّةٌ قَائِمَةٌ أَوْ فَرِيضَةٌ عَادِلَةٌ";
abudawood.urdu = "حضرت انس بن مالک سے مذکورہ بالاحدیث کی مانند مروی ہے۔\nامام ابوداؤد � فرماتے ہیں: ان سب میں سعید بن ابی الحسن � کی روایت قوی ہے اورباقی ضعیف ہیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شاھد عند النسائي (5375 وسندہ صحیح)`;