var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ أَمَرَ رَجُلًا كَانَ يَتَصَدَّقُ بِالنَّبْلِ فِي الْمَسْجِدِ،أَنْ لَا يَمُرَّ بِهَا إِلَّا وَهُوَ آخِذٌ بِنُصُولِهَا.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے ایک شخص کو حکم دیا جو مسجد میں تیروں کو صدقہ تقسیم کرنے جا رہا تھا کہ وہ جب ان تیروں کو لے کر چلے تو پھلوں کی طرف سے پکڑے۔";
abudawood.hukam = "صحیح مسلم (2614)";
abudawood.description = ``;