var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُتَعَاطَى السَّيْفُ مَسْلُولًا";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے منقول ہے بیشک نبی کریم ﷺ نے منع فرمایا کہ تلوار کو اس کیفیت میں لیا دیا (لینا دینا) جائے کہ وہ ننگی ہو (میان میں نہ ہو)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2163)<br>أبو الزبیر مدلس وعنعن<br>وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [95,1];