var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ،حَدَّثَنَا أَشْعَثُ عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُقَدَّ السَّيْرُ بَيْنَ إِصْبَعَيْنِ";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے مروی ہے کہ بیشک رسول اللہ ﷺ نے منع فرمایا کہ چمڑے کے ٹکڑے کو دو انگلیوں کے درمیان رکھ کر کاٹا جائے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3528)
أخرجہ الطبراني (7/224 ح 5935) من حدیث قریش بن أنس بہ وصنیع الحافظ فی التھذیب یدل علٰی أن سماع محمد بن بشار وابن المدیني من قریش بن أنس قبل اختلاطہ وباقی السند صحیح، الحسن البصري عن سمرۃ بن جندب کتاب وروایۃ عن الکتاب صحیحۃ`;