var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ قَالَ حَسِبْتُ أَنِّي سَمِعْتُ يَزِيدَ بْنَ خُصَيْفَةَ يَذْكُرُ عَنِ السَّائِبِ بْنِ يَزِيدَ،عَنْ رَجُلٍ قَدْ سَمَّاهُ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ظَاهَرَ يَوْمَ أُحُدٍ بَيْنَ دِرْعَيْنِ،أَوْ لَبِسَ دِرْعَيْنِ.";
abudawood.urdu = "جناب سائب بن یزید رحمہ اللہ نے ایک شخص سے روایت کی اور اس کا نام بھی بتایا کہ رسول اللہ ﷺ نے احد کے دن اوپر تلے دو زرہیں پہنی ہوئی تھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3886)
وللحدیث شاھد عند الترمذي (3738)`;