var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ،أَخْبَرَنَا أَبُو يَعْقُوبَ الثَّقَفِيُّ،حَدَّثَنِي يُونُسُ بْنُ عُبَيْدٍ-مَوْلَى مُحَمَّدِ بْنِ الْقَاسِمِ-،قَالَ: بَعَثَنِي مُحَمَّدُ بْنُ الْقَاسِمِ إِلَى الْبَرَاءِ بْنِ عَازِبٍ،يَسْأَلُهُ،عَنْ رَايَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا كَانَتْ؟ فَقَالَ: كَانَتْ سَوْدَاءَ مُرَبَّعَةً مِنْ نَمِرَةٍ.";
abudawood.urdu = "سیدنا محمد بن قاسم رحمہ اللہ نے اپنے غلام کو سیدنا براء بن عازب رضی اللہ عنہ کی خدمت میں بھیجا کہ وہ ان سے رسول اللہ ﷺ کے علم (جھنڈے) کے متعلق پوچھ کر آئے کہ وہ کیسا تھا؟ تو انہوں نے بتایا کہ وہ کالے لکیر دار اونی کپڑے کا اور چوکور تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3888)`;