var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْمَرْوَزِيُّ وَهُوَ ابْنُ رَاهَوَيْهِ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،حَدَّثَنَا شَرِيكٌ،عَنْ عَمَّارٍ الدُّهْنِيِّ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،يَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ كَانَ لِوَاؤُهُ يَوْمَ دَخَلَ مَكَّةَ أَبْيَضَ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ نے نبی کریم ﷺ کے متعلق بتایا کہ جس دن آپ ﷺ مکے میں داخل ہوئے،اس دن آپ ﷺ کا جھنڈا سفید رنگ کا تھا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3889)
ولہ شاھد حسن عند ابن ماجہ (2818)`;