var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ،حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ الشَّعِيرِيُّ،عَنْ شُعْبَةَ،عَنْ سِمَاكٍ،عَنْ رَجُلٍ مِنْ قَوْمِهِ،عَنْ آخَرَ مِنْهُمْ قَالَ: رَأَيْتُ رَايَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفْرَاءَ.";
abudawood.urdu = "سیدنا سماک بن حرب اپنی قوم کے ایک آدمی سے اور وہ ایک دوسرے سے روایت کرتے ہیں انہوں نے کہا کہ میں نے رسول اللہ ﷺ کا علم (جھنڈا) دیکھا جو زرد رنگ کا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>’’رجل من قومہ ‘‘ : مجہول (انظر عون المعبود 337/2)`;
abudawood.anwaar = [95,1];