var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا يَزِيْدُ بْنُ هَارُونَ عَنِ الْحَجَّاجِ،عَنْ قَتَادَةَ عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،قَالَ: كَانَ شِعَارُ الْمُهَاجِرِينَ: عَبْدَ اللَّهِ،وَشِعَارُ الْأَنْصَارِ: عَبْدَ الرَّحْمَنِ";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ نے بیان کیا کہ (ایک جنگ میں) مہاجرین کا شعار ’’عبداللہ‘‘ اور انصار کا ’’عبدالرحمٰن‘‘ تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حجاج بن أرطاۃ ضعیف،مدلس`;
abudawood.anwaar = [95,1];