var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ عَنِ ابْنِ الْمُبَارَكِ،عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ،عَنْ إِيَاسِ بْنِ سَلَمَةَ،عَنْ أَبِيهِ قَالَ: غَزَوْنَا مَعَ أَبِي بَكْرٍ رَضِي اللَّهُ عَنْهُ زَمَنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَكَانَ شِعَارُنَا: أَمِتْ أَمِتْ.";
abudawood.urdu = "سیدنا ایاس بن سلمہ اپنے والد سے روایت کرتے ہیں کہ ہم نے رسول اللہ ﷺ کے زمانے میں سیدنا ابوبکر رضی اللہ عنہ کی معیت میں جہاد کیا تو ہمارا شعار تھا۔۔«أمت أمت» (معنی ہے مار دے،مار دے اور اس میں کفار کی ہزیمت اور مسلمانوں کی فتح کا تفاؤل تھا)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ ابن ماجہ (2840 وسندہ حسن) عکرمۃ صرح بالسماع عند ابن حبان (الإحسان: 4828)`;