var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ عَنِ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ،قَالَ: أَخْبَرَنِي مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنْ بُيِّتُّمْ فَلْيَكُنْ شِعَارُكُمْ: حم, لَا يُنْصَرُونَ.";
abudawood.urdu = "سیدنا مہلب بن ابی صفرہ کا کہنا ہے کہ مجھے اس شخص نے بیان کیا جس نے نبی کریم ﷺ سے سنا تھا آپ ﷺ نے فرمایا ’’اگر تم پر رات کو حملہ ہو جائے تو تمہارا شعار «حم لا ینصرون» ہونا چاہیئے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3948)
أبو إسحاق صرح بالسماع عند ابن أبي شیبۃ (7/414 ح 36787) وغیرہ`;