var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ سُوَيْدٍ الرَّمْلِيُّ وَعُمَرُ بْنُ الْخَطَّابِ أَبُو حَفْصٍ وَحَدِيثُهُ أَتَمُّ أَنَّ سَعِيدَ بْنَ الْحَكَمِ حَدَّثَهُمْ قَالَ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ حَدَّثَنِي حَيْوَةُ بْنُ شُرَيْحٍ أَنَّ أَبَا سَعِيدٍ الْحِمْيَرِيَّ حَدَّثَهُ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّقُوا الْمَلَاعِنَ الثَّلَاثَةَ الْبَرَازَ فِي الْمَوَارِدِ وَقَارِعَةِ الطَّرِيقِ وَالظِّلِّ";
abudawood.urdu = "سیدنا معاذ بن جبل رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’لعنت کے تین کاموں سے بچو۔“ (یعنی) پانی کے گھاٹ پر پاخانہ کرنے سے،عین راستے میں یا (لوگوں کے) سائے میں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (328)<br>أبو سعید الحمیري لم یدرک معاذ بن جبل رضي اللّٰہ عنہ<br>وللحدیث شاھد ضعیف عند أحمد (299/1)<br>وحدیث مسلم (269) یغني عنہ`;
abudawood.anwaar = [14,1];