var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،حَدَّثَنَا سُفْيَانُ،عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ صَفِيَّةَ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَضَعُ رَأْسَهُ فِي حِجْرِي،فَيَقْرَأُ وَأَنَا حَائِضٌ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بتاتی ہیں کہ رسول اللہ ﷺ اپنا سر مبارک میری گود میں رکھ دیتے اور قرآن پڑھنے لگتے،جبکہ میں ایام سے ہوتی تھی۔";
abudawood.hukam = "صحیح بخاری (297، 7549) صحیح مسلم (301)";
abudawood.description = ``;