var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ،عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ،عَنْ إِسْمَاعِيلَ بْنِ جَرِيرٍ،عَنْ قَزَعَةَ،قَالَ: قَالَ لِي ابْنُ عُمَرَ: هَلُمَّ أُوَدِّعْكَ كَمَا وَدَّعَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَسْتَوْدِعُ اللَّهَ دِينَكَ،وَأَمَانَتَكَ،وَخَوَاتِيمَ عَمَلِكَ.";
abudawood.urdu = "سیدنا قزعہ کہتے ہیں کہ سیدنا عبداللہ بن عمر رضی اللہ عنہما نے مجھ سے کہا: ادھر آؤ! میں تمہیں الوداع کہوں،جیسے کہ مجھے رسول اللہ ﷺ نے الوداع کہا تھا: «أستودع اللہ دینک وأمانتک وخواتیم عملک» ’’میں تیرے دین،تیری امانت اور تیرے عمل کے اختتام کو اﷲ تعالیٰ کے حوالے کرتا ہوں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2435)
ولہ شواھد عند الترمذي (3443 وسندہ حسن) وابن حبان (الإحسان: 2682 وسندہ حسن)`;