var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ السَّيْلَحِينِيُّ،حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ أَبِي جَعْفَرٍ الْخَطْمِيِّ،عَنْ مُحَمَّدِ بْنِ كَعْبٍ،عَنْ عَبْدِ اللَّهِ الْخَطْمِيِّ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَسْتَوْدِعَ الْجَيْشَ, قَالَ: أَسْتَوْدِعُ اللَّهَ دِينَكُمْ،وَأَمَانَتَكُمْ،وَخَوَاتِيمَ أَعْمَالِكُمْ.";
abudawood.urdu = "سیدنا عبداللہ خطمی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جب کسی لشکر کو الوداع کہنا چاہتے تو یوں فرماتے «أستودع اللہ دینکم وأمانتکم وخواتیم أعمالکم» ’’میں تمہارا دین،تمہاری امانتیں اور تمہارے اعمال کا اختتام اﷲ تعالیٰ کے سپرد کرتا ہوں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2436)`;