var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ يُونُسَ بْنِ يَزِيدَ عَنِ الزُّهْرِيِّ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ ابْنِ مَالِكٍ،عَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: قَلَّمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ فِي سَفَرٍ إِلَّا يَوْمَ الْخَمِيسِ.";
abudawood.urdu = "سیدنا کعب بن مالک رضی اللہ عنہ سے مروی ہے انہوں نے کہا کہ بہت کم ایسے ہوتا کہ رسول اللہ ﷺ جمعرات کے علاوہ کسی اور دن سفر کے لیے نکلتے۔";
abudawood.hukam = "صحیح بخاری (2948)";
abudawood.description = ``;