var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الرَّاكِبُ شَيْطَانٌ،وَالرَّاكِبَانِ شَيْطَانَانِ،وَالثَّلَاثَةُ رَكْبٌ.";
abudawood.urdu = "سیدنا عمرو بن شعیب اپنے والد (شعیب) سے اور وہ (شعیب) اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اکیلا سوار ایک شیطان ہے ‘ دو سوار دو شیطان ہیں اور تین سوار ایک قافلہ ہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3910)
أخرجہ الترمذي (1674 وسندہ حسن)`;