var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ،حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ،عَنْ نَافِعٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا كَانَ ثَلَاثَةٌ فِي سَفَرٍ فَلْيُؤَمِّرُوا أَحَدَهُمْ.\nقَالَ نَافِعٌ: فَقُلْنَا لِأَبِي سَلَمَةَ: فَأَنْتَ أَمِيرُنَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تین افراد سفر میں ہوں تو چاہیئے کہ ایک کو اپنا امیر بنا لیں۔‘‘ نافع رحمہ اللہ (مولیٰ ابن عمر رضی اللہ عنہما) نے کہا: (یہ حدیث سننے کے بعد) ہم نے ابوسلمہ (بن عبدالرحمٰن بن عوف) سے کہا: آپ ہمارے امیر ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (2608) لعلتہ وللحدیث طرق ضعیفۃ<br>وأخرج الطبراني (الکبیر 208/9 ح 8915) بإسناد حسن عن ابن مسعود قال : ’’ إذا کنتم ثلاثۃ في سفر فأمروا علیکم أحد کم ‘‘ إلخ`;
abudawood.anwaar = [95,1];