var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنِ الْقَاسِمِ،عَنْ عَائِشَةَ،قَالَتْ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَاوِلِينِي الْخُمْرَةَ مِنَ الْمَسْجِدِ،فَقُلْتُ: إِنِّي حَائِضٌ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ حَيْضَتَكِ لَيْسَتْ فِي يَدِكِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ مجھ سے رسول اللہ ﷺ نے فرمایا ’’مجھے مسجد میں سے چٹائی تھما دو۔‘‘ میں نے کہا: میں حیض سے ہوں۔آپ ﷺ نے فرمایا ’’تیرا حیض تیرے ہاتھ میں نہیں ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (298)";
abudawood.description = ``;