var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ.\nقَالَ مَالِكٌ: أُرَاهُ مَخَافَةَ أَنْ يَنَالَهُ الْعَدُوُّ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے انہوں نے کہا کہ رسول اللہ ﷺ نے منع فرمایا ہے کہ انسان قرآن مجید لے کر دشمن کے علاقے میں جائے۔امام مالک رحمہ اللہ فرماتے ہیں ‘ میرا خیال ہے اس نہی کی حکمت یہ ہے کہ کہیں یہ دشمن (کافر) کے ہاتھ نہ لگ جائے (اور وہ اس کی ہتک کرے۔)";
abudawood.hukam = "صحیح بخاری (2990) صحیح مسلم (1869)";
abudawood.description = ``;