var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ أَبُو خَيْثَمَةَ،حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ،حَدَّثَنَا أَبِي،قَالَ: سَمِعْتُ يُونُسَ عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: خَيْرُ الصَّحَابَةِ أَرْبَعَةٌ،وَخَيْرُ السَّرَايَا أَرْبَعُ مِائَةٍ،وَخَيْرُ الْجُيُوشِ أَرْبَعَةُ آلَافٍ،وَلَنْ يُغْلَبَ اثْنَا عَشَرَ أَلْفًا مِنْ قِلَّةٍ.\nقَالَ أَبو دَاود: وَالصَّحِيحُ أَنَّهُ مُرْسَلٌ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’بہترین رفقاء وہ ہیں جو چار کی تعداد میں ہوں اور بہترین دستہ وہ ہے جس میں چار سو شہسوار ہوں اور بہترین لشکر وہ ہے جو چار ہزار کی تعداد میں ہو اور بارہ ہزار قلت کی بنا پر ہرگز مغلوب نہیں ہو سکتے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں صحیح یہ ہے کہ یہ روایت مرسل ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1555)<br>الزہري عنعن`;
abudawood.anwaar = [95,1];