var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّقَ نَخْلَ بَنِي النَّضِيرِ،وَقَطَعَ-وَهِيَ البُوَيْرَةُ-،فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ:مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا[الحشر: 5].";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے بویرہ مقام پر قبیلہ بنو نضیر کی کھجوریں جلائی تھیں اور کاٹی بھی تھیں ‘ اس پر اﷲ تعالیٰ نے یہ آیت نازل فرمائی «ما قطعتم من لینۃ أو ترکتموہا» ’’جو کھجوریں تم نے کاٹ ڈالیں یا جڑوں پر قائم رہنے دیں سو وہ اﷲ کے حکم سے تھا ‘ اور تاکہ اﷲ تعالیٰ فاسقوں کو رسوا کر دے۔‘‘";
abudawood.hukam = "صحیح بخاری (4884) صحیح مسلم (1746)";
abudawood.description = ``;