var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنِ ابْنِ الْمُبَارَكِ،عَنْ صَالِحِ بْنِ أَبِي الْأَخْضَرِ عَنِ الزُّهْرِيِّ قَالَ عُرْوَةُ فَحَدَّثَنِي أُسَامَةُ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَهِدَ إِلَيْهِ،فَقَالَ: أَغِرْ عَلَى أُبْنَى صَبَاحًا وَحَرِّقْ.";
abudawood.urdu = "سیدنا اسامہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ان سے فرمایا تھا کہ ’’ابنی‘‘ کے علاقے پر صبح کے وقت چڑھائی کرنا اور اسے جلا دینا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2843)<br>صالح بن أبی الأخضر: ضعیف یعتبر بہ (تق :2844) و قال البوصیري : لینہ الجمھور (زوائد ابن ماجہ للبوصیري : 1098) و قال الھیثمي : و قد ضعفہ الجمھور (مجمع الزوائد 150/2)`;
abudawood.anwaar = [96,1];