var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ،حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ: بَعَثَ-يَعْنِي: النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-بُسْبَسَةَ عَيْنًا،يَنْظُرُ مَا صَنَعَتْ عِيرُ أَبِي سُفْيَانَ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ نے (واقعہ بدر سے پہلے) بسیسہ کو بطور جاسوس روانہ فرمایا تھا کہ وہ دیکھے کہ ابوسفیان کا قافلہ کس مرحلے میں ہے؟";
abudawood.hukam = "صحیح مسلم (1901)";
abudawood.description = ``;