var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ،حَدَّثَنَا أَيُّوبُ،عَنْ أَبِي قِلَابَةَ،عَنْ مُعَاذَةَ،أَنَّ امْرَأَةً سَأَلَتْ عَائِشَةَ: أَتَقْضِي الْحَائِضُ الصَّلَاةَ؟ فَقَالَتْ أَحَرُورِيَّةٌ أَنْتِ؟ لَقَدْ كُنَّا نَحِيضُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا نَقْضِي وَلَا نُؤْمَرُ بِالْقَضَاءِ.";
abudawood.urdu = "سیدہ معاذہ نے بیان کیا کہ ایک عورت نے سیدہ عائشہ رضی اللہ عنہا سے سوال کیا کہ آیا حائضہ (اپنے ایام حیض کی) نمازوں کی قضاء دے؟ تو انہوں نے کہا: کیا تو حروری ہے؟ بلاشبہ ہم رسول اللہ ﷺ کے ہوتے ہوئے حیض سے ہوتی تھیں تو ہم کسی نماز کی قضاء نہیں دیتی تھیں اور نہ ہمیں اس کا حکم ہی دیا جاتا تھا۔";
abudawood.hukam = "صحیح مسلم (335)";
abudawood.description = ``;