var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ،حَدَّثَنِي نَافِعٌ،عَنْ عَبْدِ اللَّهِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: السَّمْعُ وَالطَّاعَةُ عَلَى الْمَرْءِ الْمُسْلِمِ فِيمَا أَحَبَّ وَكَرِهَ،مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ،فَإِذَا أُمِرَ بِمَعْصِيَةٍ, فَلَا سَمْعَ وَلَا طَاعَةَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما کی روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’مسلمان پر واجب ہے کہ (تمام احکام) سنے اور مانے،خواہ اسے پسند آئیں یا ناپسند ہوں،جب تک اسے نافرمانی کا حکم نہ دیا جائے،جب معصیت کا حکم دیا جائے تو نہ سننا ہے اور نہ اطاعت ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (7144) صحیح مسلم (1839)";
abudawood.description = ``;