var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو،أَخْبَرَنَا سُفْيَانُ يَعْنِي ابْنَ عَبْدِ الْمَلِكِ عَنِ ابْنِ الْمُبَارَكِ،عَنْ مَعْمَرٍ،عَنْ أَيُّوبَ،عَنْ مُعَاذَةَ الْعَدَوِيَّةِ،عَنْ عَائِشَةَ بِهَذَا الْحَدِيثِ. قَالَ أَبُو دَاوُد: وَزَادَ فِيهِ فَنُؤْمَرُ بِقَضَاءِ الصَّوْمِ،وَلَا نُؤْمَرُ بِقَضَاءِ الصَّلَاةِ.";
abudawood.urdu = "سیدہ معاذہ عدویہ نے ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے یہی حدیث روایت کی ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ اس میں یہ اضافہ ہے‘‘ ہمیں روزے کی قضاء کرنے کا حکم دیا جاتا تھا اور نمازوں کی قضاء کرنے کا حکم نہ دیا جاتا تھا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق`;