var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ،حَدَّثَنَا بَقِيَّةُ عَنِ الْأَوْزَاعِيِّ،عَنْ أَسِيدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ فَرْوَةَ بْنِ مُجَاهِدٍ،عَنْ سَهْلِ بْنِ مُعَاذٍ،عَنْ أَبِيهِ قَالَ غَزَوْنَا مَعَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ.";
abudawood.urdu = "سہل بن معاذ اپنے والد (سیدنا معاذ بن انس جہنی رضی اللہ عنہ) سے بیان کرتے ہیں انہوں نے کہا کہ ہم نے اللہ کے نبی ﷺ کے ساتھ غزوے میں شرکت کی۔اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2629)`;