var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،أَخْبَرَنَا أَبِي،حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا غَزَا, قَالَ: اللَّهُمَّ أَنْتَ عَضُدِي،وَنَصِيرِي،بِكَ أَحُولُ،وَبِكَ أَصُولُ،وَبِكَ أُقَاتِلُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ جب غزوے کے لیے تشریف لے جاتے تو یوں دعا فرماتے «اللہم أنت عضدی ونصیری بک أحول وبک أصول وبک أقاتل» ’’اے اللہ! تو میرا بازو اور میرا مددگار ہے،تیری ہی مدد سے میں چلتا پھرتا اور حملہ کرتا ہوں اور لڑائی کرتا ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (3584)<br>قتادۃ عنعن`;
abudawood.anwaar = [96,1];