var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا ثَابِتٌ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُغِيرُ عِنْدَ صَلَاةِ الصُّبْحِ،وَكَانَ يَتَسَمَّعُ, فَإِذَا سَمِعَ أَذَانًا أَمْسَكَ،وَإِلَّا أَغَارَ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ نماز فجر کے وقت شب خون مارا کرتے تھے۔اور (اس سے پہلے) کان لگا کر سنتے،اگر اذان کی آواز سن لیتے تو باز رہتے ورنہ حملہ کر دیتے۔";
abudawood.hukam = "صحیح مسلم (382)";
abudawood.description = ``;