var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ عَبْدِ الْمَلِكِ بْنِ نَوْفَلِ بْنِ مُسَاحِقٍ عَنِ ابْنِ عِصَامٍ الْمُزَنِيِّ،عَنْ أَبِيهِ قَالَ: بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ،فَقَالَ: إِذَا رَأَيْتُمْ مَسْجِدًا،أَوْ سَمِعْتُمْ مُؤَذِّنًا, فَلَا تَقْتُلُوا أَحَدًا";
abudawood.urdu = "سیدنا عصام مزنی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے ہم کو ایک جہادی مہم میں روانہ کیا اور فرمایا ’’جب تم کوئی مسجد دیکھو یا کسی مؤذن کو سنو تو پھر کسی کو قتل نہ کرنا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1549)<br>ابن عصام : لا یعرف حالہ`;
abudawood.anwaar = [96,1];