var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الصَّمَدِ وَأَبُو عَامِرٍ،عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ،حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ،عَنْ أَبِيهِ قَالَ: أَمَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا أَبَا بَكْرٍ رَضِي اللَّهُ عَنْهُ فَغَزَوْنَا نَاسًا مِنَ الْمُشْرِكِينَ،فَبَيَّتْنَاهُمْ نَقْتُلُهُمْ،وَكَانَ شِعَارُنَا تِلْكَ اللَّيْلَةَ: أَمِتْ أَمِتْ. قَالَ سَلَمَةُ: فَقَتَلْتُ بِيَدِي تِلْكَ اللَّيْلَةَ سَبْعَةَ أَهْلِ أَبْيَاتٍ مِنَ الْمُشْرِكِينَ";
abudawood.urdu = "جناب ایاس بن سلمہ اپنے والد (سیدنا سلمہ بن اکوع رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے سیدنا ابوبکر صدیق رضی اللہ عنہ کو ہمارا امیر بنایا،پھر ہم مشرکین سے جہاد کے لیے نکلے۔ہم نے ان پر شب خون مارا۔اس رات ہمارا شعار تھا «أمت أمت» سلمہ کہتے ہیں کہ اس رات میں نے اپنے ہاتھ سے سات گھروں کے مشرکین کو قتل کیا تھا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3950)
انظر الحدیث السابق (2596)`;