var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ شَوْكَرٍ،حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ،حَدَّثَنَا الْحَجَّاجُ بْنُ أَبِي عُثْمَانَ،عَنْ أَبِي الزُّبَيْرِ،أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ،حَدَّثَهُمْ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّفُ فِي الْمَسِيرِ،فَيُزْجِي الضَّعِيفَ،وَيُرْدِفُ،وَيَدْعُو لَهُمْ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ دوران سفر میں پیچھے رہا کرتے تھے،ضعیفوں کی سواری ہانک لے جاتے اور انہیں اپنے پیچھے بٹھا لیتے اور ان کے لیے دعائیں کرتے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3913)
أخرجہ الحاکم (2/115) أبو الزبیر صرح بالسماع عندہ`;