var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ،عَنْ حُمَيْدٍ الطَّوِيلِ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أُمِرْتُ أَنْ أُقَاتِلَ الْمُشْرِكِينَ.. بِمَعْنَاهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا ’’مجھے مشرکین سے قتال کا حکم دیا گیا ہے۔‘‘ اور مذکورہ بالا حدیث کے ہم معنی روایت کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2641)`;