var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ عَنْ عَلِيِّ بْنِ الْحَكَمِ الْبُنَانِيِّ عَنْ أَبِي الْحَسَنِ الْجَزَرِيِّ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ،قَالَ: إِذَا أَصَابَهَا فِي أَوَّلِ الدَّمِ فَدِينَارٌ،وَإِذَا أَصَابَهَا فِي انْقِطَاعِ الدَّمِ فَنِصْفُ دِينَارٍ. قَالَ أَبُو دَاوُد: وَكَذَلِكَ قَالَ ابْنُ جُرَيْجٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ مِقْسَمٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما کا ارشاد ہے کہ اگر شوہر اپنی بیوی کے پاس خون حیض کے ابتدائی دنوں میں آئے تو ایک دینار دے اور اگر خون رک جانے کے ایام میں آئے تو آدھا دینار دے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابن جریج نے عبدالکریم سے انہوں نے مقسم سے ایسے ہی روایت کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یأتي (2169)<br>أبو الحسن الجزري: مجہول،أخطأمن سماہ عبدالحمید (تقریب: 8047)`;
abudawood.anwaar = [23,1];