var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ،عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ،عَنْ مَعْقِلِ ابْنِ يَسَارٍ أَنَّ النُّعْمَانَ يَعْنِي ابْنَ مُقَرِّنٍ،قَالَ: شَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،إِذَا لَمْ يُقَاتِلْ مِنْ أَوَّلِ النَّهَارِ،أَخَّرَ الْقِتَالَ،حَتَّى تَزُولَ الشَّمْسُ،وَتَهُبَّ الرِّيَاحُ, وَيَنْزِلَ النَّصْرُ.";
abudawood.urdu = "سیدنا نعمان بن مقرن رضی اللہ عنہ بیان کرتے ہیں کہ میں رسول اللہ ﷺ کے ہاں حاضر رہا ہوں،آپ ﷺ اگر دن کے ابتدائی حصے میں قتال نہ کرتے تو اس میں اتنی تاخیر فرماتے کہ سورج ڈھل جاتا،ہوائیں چلنے لگتیں اور نصرت نازل ہوتی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3933)
أخرجہ الترمذي (1613 وسندہ صحیح)`;