var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ ح،وحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا هِشَامٌ،حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ،عَنْ قَيْسِ بْنِ عُبَادٍ،قَالَ: كَانَ أَصْحَابُ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ يَكْرَهُونَ الصَّوْتَ عِنْدَ الْقِتَالِ.";
abudawood.urdu = "سیدنا قیس بن عباد رحمہ اللہ بیان کرتے ہیں کہ نبی کریم ﷺ کے صحابہ قتال کے دوران میں آوازیں نکالنے کو ناپسند کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ و الحسن البصري عنعنا`;
abudawood.anwaar = [97,1];