var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ،عَنْ هَمَّامٍ،حَدَّثَنِي مَطَرٌ،عَنْ قَتَادَةَ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بِمِثْلِ ذَلِكَ .";
abudawood.urdu = "سیدنا ابوبردہ اپنے والد (سیدنا ابوموسیٰ اشعری رضی اللہ عنہ) سے وہ نبی کریم ﷺ سے اسی کی مثل روایت کرتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (2656)`;
abudawood.anwaar = [97,1];