var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاقَ عَنِ الْبَرَاءِ،قَالَ: لَمَّا لَقِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُشْرِكِينَ يَوْمَ حُنَيْنٍ،فَانْكَشَفُوا،نَزَلَ عَنْ بَغْلَتِهِ،فَتَرَجَّلَ";
abudawood.urdu = "سیدنا براء رضی اللہ عنہ بیان کرتے ہیں کہ حنین کے دن جب نبی کریم ﷺ کا مشرکین کے ساتھ مقابلہ ہوا اور مسلمان آپ ﷺ کے پاس سے بھاگ گئے،تو آپ ﷺ اپنے خچر سے نیچے اتر کر پیدل ہو گئے۔";
abudawood.hukam = "صحیح بخاری (3042) صحیح مسلم (1776)";
abudawood.description = ``;