var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ عَوْفٍ،حَدَّثَنَا أَبُو الْيَمَانِ،أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ،أَخْبَرَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ بْنِ أَسِيدِ بْنِ جَارِيَةَ الثَّقَفِيُّ وَهُوَ حَلِيفٌ لِبَنِي زُهْرَةَ وَكَانَ مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ... فَذَكَرَ الْحَدِيثَ";
abudawood.urdu = "ابن عوف کی سند ہے کہ زہری نے کہا: مجھے عمرو بن ابی سفیان بن اسید بن جاریہ ثقفی نے بیان کیا اور یہ بنی زہرہ کے حلیف اور سیدنا ابوہریرہ رضی اللہ عنہ کے شاگردوں میں سے تھے اور حدیث بیان کی۔";
abudawood.hukam = "صحیح بخاری (3045)";
abudawood.description = ``;