var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى،حَدَّثَنَا إِسْحَاقُ بْنُ نَجِيحٍ وَلَيْسَ بِالْمَلْطِيِّ،عَنْ مَالِكِ بْنِ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ السَّاعِدِيِّ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-يَوْمَ بَدْرٍ-: إِذَا أَكْثَبُوكُمْ فَارْمُوهُمْ بِالنَّبْلِ،وَلَا تَسُلُّوا السُّيُوفَ،حَتَّى يَغْشَوْكُمْ";
abudawood.urdu = "سیدنا مالک بن حمزہ ابی اسید الساعدی اپنے والد سے وہ دادا (ابواسید مالک بن ربیعہ انصاری رضی اللہ عنہ) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے بدر والے دن فرمایا ’’جب وہ تمہارے قریب آ جائیں (اور تمہاری زد میں ہوں) تب ان پر تیر مارنا اور تلوار بھی اسی وقت سونتنا جب وہ تم پر چھا جائیں۔‘‘ (اور تلوار کی مار پر ہوں)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>إسحاق بن نجیح : مجہول (تق : 387)`;
abudawood.anwaar = [97,1];