var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَزِيَادُ بْنُ أَيُّوبَ،قَالَا: حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا مُغِيرَةُ،عَنْ شِبَاكٍ،عَنْ إِبْرَاهِيمَ،عَنْ هُنَيِّ بْنِ نُوَيْرَةَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’قتل کرنے کے معاملے میں سب سے اچھے لوگ اہل ایمان ہوتے ہیں۔‘‘ (وہ مقتول کے ناک کان وغیرہ نہیں کاٹتے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2681،2682)<br>مغیرۃ و إبراہیم النخعي عنعنا`;
abudawood.anwaar = [97,1];