var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ وَقُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ،قَالَا: حَدَّثَنَا اللَّيْثُ،عَنْ نَافِعٍ،عَنْ عَبْدِ اللَّهِ،أَنَّ امْرَأَةً وُجِدَتْ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتُولَةً،فَأَنْكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلَ النِّسَاءِ وَالصِّبْيَانِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ کسی غزوے میں دیکھا گیا کہ ایک عورت کو قتل کیا گیا ہے،تو رسول اللہ ﷺ نے عورتوں اور بچوں کے قتل کو بہت برا جانا۔";
abudawood.hukam = "صحیح بخاری (3014) صحیح مسلم (1744)";
abudawood.description = ``;