var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الرَّمْلِيُّ،حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ،عَنْ حَبِيبٍ مَوْلَى عُرْوَةَ،عَنْ نُدْبَةَ مَوْلَاةِ مَيْمُونَةَ،عَنْ مَيْمُونَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ: يُبَاشِرُ الْمَرْأَةَ مِنْ نِسَائِهِ وَهِيَ حَائِضٌ،إِذَا كَانَ عَلَيْهَا إِزَارٌ إِلَى أَنْصَافِ الْفَخِذَيْنِ أَوِ الرُّكْبَتَيْنِ تَحْتَجِزُ بِهِ.";
abudawood.urdu = "ام المؤمنین سیدہ میمونہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ اپنی ازواج میں سے کسی ایک کے ساتھ لیٹ جایا کرتے تھے جبکہ وہ حیض سے ہوتی اور اس پر آدھی رانوں تک یا گھٹنوں تک کپڑا ہوتا اور وہ اس کپڑے سے اپنے (زیریں) جسم ڈھانپے ہوتی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (288)<br>ند بۃ مولاۃ میمونۃ: مجھولۃ،لم یوثقھا غیر ابن حبان<br>وأحادیث البخاري (303) و مسلم (294،295) تغني عنہ`;
abudawood.anwaar = [23,1];