var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا هُشَيْمٌ،حَدَّثَنَا حَجَّاجٌ،حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اقْتُلُوا شُيُوخَ الْمُشْرِكِينَ،وَاسْتَبْقُوا شَرْخَهُمْ";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مشرکین کے بوڑھوں کو قتل کرو اور نو عمروں (نابالغ بچوں) کو زندہ رہنے دو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1583)<br>قتادۃ عنعن`;
abudawood.anwaar = [97,1];