var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ وَقُتَيْبَةُ أَنَّ اللَّيْثَ بْنَ سَعْدٍ حَدَّثَهُمْ،عَنْ بُكَيْرٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْثٍ،فَقَالَ: إِنْ وَجَدْتُمْ فُلَانًا وَفُلَانًا فَذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ہم کو ایک مہم پر روانہ کیا اور فرمایا ’’اگر تم فلاں فلاں کو پاؤ۔‘‘ اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "صحیح مسلم (3016)";
abudawood.description = ``;