var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ،أَخْبَرَنَا مُحَمَّدُ بْنُ زِيَادٍ،قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: عَجِبَ رَبُّنَا عَزَّ وَجَلَّ مِنْ قَوْمٍ يُقَادُونَ إِلَى الْجَنَّةِ فِي السَّلَاسِلِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ’’ہمارے رب عزوجل کو ایسے لوگوں پر تعجب آتا ہے جو زنجیروں میں جکڑے جنت کی طرف لے جائے جائیں گے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رواہ البخاري (3010)`;