var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَأْمُرُ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَنْ تَتَّزِرَ،ثُمَّ يُضَاجِعُهَا زَوْجُهَا-وَقَالَ مَرَّةً: يُبَاشِرُهَا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ ہم عورتوں کو حکم فرماتے کہ جب ہم میں سے کوئی حیض سے ہو تو اپنی چادر اچھی طرح باندھ لیا کرے۔پھر شوہر (کو اجازت ہے کہ) اس کے ساتھ لیٹ جائے۔اور (شعبہ نے) ایک بار <عربی> «یضاجعہا» </عربی> کی بجائے <عربی> «یباشرہا» </عربی> کا لفظ روایت کیا۔";
abudawood.hukam = "صحیح بخاری (300، 2030) صحیح مسلم (293)";
abudawood.description = ``;