var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،قَالَ:،حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،عَنْ مُحَمَّدِ بْنِ جُبَيْرِ ابْنِ مُطْعِمٍ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأُسَارَى بَدْرٍ: لَوْ كَانَ مُطْعِمُ بْنُ عَدِيٍّ حَيًّا،ثُمَّ كَلَّمَنِي فِي هَؤُلَاءِ النَّتْنَى لَأَطْلَقْتُهُمْ لَهُ.";
abudawood.urdu = "محمد بن جبیر بن مطعم اپنے والد سے بیان کرتے ہیں کہ نبی کریم ﷺ نے بدر کے قیدیوں کے متعلق فرمایا ’’اگر مطعم بن عدی زندہ ہوتا اور مجھ سے ان نجس بدبو داروں کے متعلق بات کرتا تو میں اس کی خاطر ان کو رہا کر دیتا۔‘‘";
abudawood.hukam = "صحیح بخاری (3139)";
abudawood.description = ``;