var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ الْعَيْشِيُّ،قَالَ:،حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ،قَالَ:،حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي الْعَنْبَسِ،عَنْ أَبِي الشَّعْثَاءِ عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ فِدَاءَ أَهْلِ الْجَاهِلِيَّةِ يَوْمَ بَدْرٍ أَرْبَعَ مِائَةٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے بدر کے موقع پر اہل جاہلیت (مشرک قیدیوں) کا فدیہ چار سو (درہم فی کس) مقرر کیا تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أبو العنبس حسن الحدیث`;