var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ الزُّبَيْرِيُّ،قَالَ:،حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ جَيْشًا غَنِمُوا فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا وَعَسَلًا،فَلَمْ يُؤْخَذْ مِنْهُمُ الْخُمُسُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ کے زمانے میں ایک لشکر کو غلہ اور شہد بطور غنیمت ملا،تو اس میں سے خمس نہیں لیا گیا تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4021)
رواہ البخاري (3154)`;