var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،قَالَ:،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ،أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ ابْنَ حَرْشَفٍ الْأَزْدِيَّ حَدَّثَهُ عَنِ الْقَاسِمِ مَوْلَى عَبْدِ الرَّحْمَنِ،عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: كُنَّا نَأْكُلُ الْجَزَرَ فِي الْغَزْوِ،وَلَا نَقْسِمُهُ،حَتَّى إِنْ كُنَّا لَنَرْجِعُ إِلَى رِحَالِنَا وَأَخْرِجَتُنَا مِنْهُ مُمْلَأَةٌ";
abudawood.urdu = "اصحاب نبی کریم ﷺ میں سے ایک صحابی کا بیان ہے کہا کہ جہاد کے دوران میں ہم اونٹ ذبح کر کے کھاتے اور (باقاعدہ) تقسیم نہ کرتے حتیٰ کہ جب ہم واپس لوٹتے ہمارے تھیلے اس گوشت سے بھرے ہوئے ہوتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن حرشف : مجہول (تق : 8463)`;
abudawood.anwaar = [98,1];