var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْجَبَّارِ،حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ،عَنْ أَبِي الْيَمَانِ،عَنْ أُمِّ ذَرَّةَ،عَنْ عَائِشَةَ،أَنَّهَا قَالَتْ: كُنْتُ إِذَا حِضْتُ نَزَلْتُ عَنِ الْمِثَالِ عَلَى الْحَصِيرِ،فَلَمْ نَقْرُبْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَلَمْ نَدْنُ مِنْهُ،حَتَّى نَطْهُرَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا روایت کرتی ہیں،فرماتی ہیں کہ جب مجھے حیض آتا تو میں بستر سے اتر کر چٹائی پر آ جاتی پھر ہم (زوجات) رسول اللہ ﷺ کے قریب نہ ہوتی تھیں حتیٰ کہ پاک ہو جاتیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الیمان الرحال: مستور (تقریب: 8456) أي: مجہول الحال`;
abudawood.anwaar = [23,1];