var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ،قَالَ:،حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ،قَالَ:،حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى أَبُو دَاوُدَ،قَالَ:،حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ بْنِ جُنْدُبٍ،حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ،عَنْ أَبِيهِ سُلَيْمَانَ بْنِ سَمُرَةَ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،قَالَ: أَمَّا بَعْدُ،وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ كَتَمَ غَالًّا فَإِنَّهُ مِثْلُهُ.";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ نے (خطبے میں بیان کیا) امابعد! اور رسول اللہ ﷺ فرمایا کرتے تھے ’’جس نے غنیمت میں کسی خائن کی خیانت پر پردہ ڈالا تو وہ بھی اسی خائن کی طرح ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خبیب : مجہول وجعفر :ضعیف،کما تقدم : 456`;
abudawood.anwaar = [99,1];