var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ أَيُّوبَ،عَنْ عِكْرِمَةَ،عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ،إِذَا أَرَادَ مِنَ الْحَائِضِ شَيْئًا أَلْقَى عَلَى فَرْجِهَا ثَوْبًا.";
abudawood.urdu = "جناب عکرمہ کسی زوجہ نبی کریم ﷺ سے راوی ہیں کہتی ہیں کہ نبی کریم ﷺ اگر اپنی کسی اہلیہ سے کچھ خواہش کرتے اور وہ حیض سے ہوتی تو اس کی شرمگاہ پر کپڑا ڈال دیتے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;