var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ،قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ أَبِيهِ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي عُبَيْدَةَ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ: نَفَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ سَيْفَ أَبِي جَهْلٍ،كَانَ قَتَلَهُ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے بدر کے روز مجھے ابوجہل کی تلوار عنایت فرمائی۔اس کا کام انہوں نے ہی تمام کیا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو عبیدۃ عن أبیہ : منقطع`;
abudawood.anwaar = [99,1];