var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْبُوبُ بْنُ مُوسَى أَبُو صَالِحٍ،أَخْبَرَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ،عَنْ كُلَيْبِ بْنِ وَائِلٍ،عَنْ هَانِئِ بْنِ قَيْسٍ،عَنْ حَبِيبِ بْنِ أَبِي مُلَيْكَةَ عَنِ ابْنِ عُمَرَ،قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ-يَعْنِي يَوْمَ بَدْرٍ-فَقَالَ: إِنَّ عُثْمَانَ انْطَلَقَ فِي حَاجَةِ اللَّهِ وَحَاجَةِ رَسُولِ اللَّهِ،وَإِنِّي أُبَايِعُ لَهُ. فَضَرَبَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمٍ،وَلَمْ يَضْرِبْ لِأَحَدٍ غَابَ غَيْرَهُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ بدر والے دن کھڑے ہوئے اور فرمایا ’’عثمان رضی اللہ عنہ،اللہ کے کام سے اور رسول اللہ کے کام سے گئے ہیں اور میں ان کی بیعت لے رہا ہوں۔‘‘ پھر آپ ﷺ نے غنیمت میں سے ان کا حصہ نکالا،اور ان کے سوا غائب رہنے والوں میں سے کسی کو کچھ نہیں دیا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4031)
ولہ طریق آخر صححہ الحاکم (3/98 وسندہ حسن) ووافقہ الذھبي`;