var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،قَالَ: كُنْتُ أَمِيحُ أَصْحَابِي الْمَاءَ يَوْمَ بَدْرٍ .";
abudawood.urdu = "سیدنا جابر (بن عبداللہ رضی اللہ عنہ) کا بیان ہے کہ میں بدر کے روز اپنے اصحاب کے لیے کنویں سے پانی بھرتا رہا تھا۔(کنویں میں اتر کر ہاتھوں سے ڈول بھرتا تھا کیونکہ نیچے پانی کم تھا)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش عنعن ویعارضہ حدیث مسلم (1813) وھو الصواب`;
abudawood.anwaar = [99,1];