var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَيَحْيَى بْنُ مَعِينٍ،قَالَا: حَدَّثَنَا يَحْيَى،عَنْ مَالِكٍ عَنِ الْفُضَيْلِ،عَنْ عَبْدِ اللَّهِ بْنِ نِيَارٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ, قَالَ يَحْيَى إِنَّ رَجُلًا مِنَ الْمُشْرِكِينَ لَحِقَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُقَاتِلَ مَعَهُ،فَقَالَ: ارْجِعْ, ثُمَّ اتَّفَقَا فَقَالَ إِنَّا لَا نَسْتَعِينُ بِمُشْرِكٍ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ مشرکین میں سے ایک آدمی نبی کریم ﷺ سے ملا،تاکہ آپ ﷺ کے ساتھ مل کر (مشرکین سے) قتال کرے۔آپ ﷺ نے فرمایا ’’واپس چلے جاؤ۔‘‘ (یہ الفاظ یحییٰ بن معین کے ہیں۔اس کے بعد مسدد اور یحییٰ دونوں باتفاق کہتے ہیں کہ) رسول اللہ ﷺ نے فرمایا ’’ہم مشرکین سے مدد نہیں لیتے۔‘‘";
abudawood.hukam = "صحیح مسلم (1817)";
abudawood.description = ``;