var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْهَمَ لِرَجُلٍ وَلِفَرَسِهِ ثَلَاثَةَ أَسْهُمٍ،سَهْمًا لَهُ, وَسَهْمَيْنِ لِفَرَسِهِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے مجاہد اور اس کے گھوڑے کے لیے تین حصے مقرر فرمائے تھے۔ایک حصہ مجاہد کا اور دو حصے اس کے گھوڑے کے۔";
abudawood.hukam = "إسنادہ صحیح، صحیح بخاری (2863) صحیح مسلم (1762)";
abudawood.description = ``;