var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ،حَدَّثَنِي الْمَسْعُودِيُّ،حَدَّثَنِي أَبُو عَمْرَةَ،عَنْ أَبِيهِ،قَالَ: أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَةَ نَفَرٍ وَمَعَنَا فَرَسٌ،فَأَعْطَى كُلَّ إِنْسَانٍ مِنَّا سَهْمًا،وَأَعْطَى لِلْفَرَسِ سَهْمَيْنِ";
abudawood.urdu = "سیدنا ابو عمرہ اپنے والد سے بیان کرتے ہیں کہ ہم رسول اللہ ﷺ کی خدمت میں حاضر ہوئے ہم چار آدمی تھے اور ہمارے پاس گھوڑا تھا تو آپ ﷺ نے ہم میں سے ہر ایک کو ایک ایک حصہ اور گھوڑے کو دو حصے عنایت فرمائے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو عمرۃ مجھول الحال والخبر معلل`;
abudawood.anwaar = [99,2];