var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ،حَدَّثَنَا الْمَسْعُودِيُّ،عَنْ رَجُلٍ مِنْ آلِ أَبِي عَمْرَةَ،عَنْ أَبِي عَمْرَةَ بِمَعْنَاهُ, إِلَّا أَنَّهُ قَالَ ثَلَاثَةُ نَفَرٍ زَادَ: فَكَانَ لِلْفَارِسِ ثَلَاثَةُ أَسْهُمٍ.";
abudawood.urdu = "(جناب مسدد کی سند سے ہے کہ) ابو عمرہ نے مذکورہ بالا حدیث کے ہم معنی بیان کیا مگر اس روایت میں ہے کہ ہم تین اشخاص آئے اور آپ نے گھوڑ سوار کو تین حصے عنایت فرمائے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو عمرۃ مجھول الحال والخبر معلل`;
abudawood.anwaar = [99,2];