var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ،حَدَّثَنَا هُشَيْمٌ قَالَ،أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ-يَوْمَ بَدْرٍ-: مَنْ قَتَلَ قَتِيلًا فَلَهُ كَذَا وَكَذَا،وَمَنْ أَسَرَ أَسِيرًا فَلَهُ كَذَا وَكَذَا،ثُمَّ سَاقَ نَحْوَهُ. وَحَدِيثُ خَالِدٍ أَتَمُّ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے بدر کے دن فرمایا ’’جس نے کسی کو قتل کیا تو اس کے لیے اتنا اتنا انعام ہے اور جو کسی کو پکڑ کر قید کر لے تو اس کے لیے اتنا اتنا ہے۔‘‘ پھر مذکورہ بالا حدیث کی مانند بیان کیا اور خالد کی حدیث زیادہ کامل ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3737)`;