var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ،قَالَ: حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ،قَالَ: حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ قَالَ،أَخْبَرَنِي دَاوُدُ بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ قَالَ: فَقَسَّمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالسَّوَاءِ. وَحَدِيثُ خَالِدٍ أَتَمُّ";
abudawood.urdu = "(ہارون بن محمد بن بکار کی سند سے مروی ہے) اور داود بن ابی ہند نے یہ حدیث اپنی سند سے روایت کی ہے،انہوں نے کہا کہ رسول اللہ ﷺ نے غنیمت کو برابر برابر تقسیم کیا۔اور خالد کی روایت زیادہ کامل ہے۔(مذکورہ بالا حدیث 2737)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3737)`;