var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْوَلِيدُ بْنُ عُتْبَةَ الدِّمَشْقِيُّ،قَالَ: قَالَ الْوَلِيدُ-يَعْنِي: ابْنَ مُسْلِمٍ-،حَدَّثْتُ ابْنَ الْمُبَارَكِ بِهَذَا الْحَدِيثِ،قُلْتُ: وَكَذَا،= حَدَّثَنَا ابْنُ أَبِي فَرْوَةَ،عَنْ نَافِعٍ،قَالَ: لَا تَعْدِلُ مَنْ سَمَّيْتَ بِمَالِكٍ،هَكَذَا أَوْ نَحْوَهُ-. يَعْنِي: مَالِكَ بْنَ أَنَسٍ-";
abudawood.urdu = "ولید بن عتبہ دمشقی کہتے ہیں کہ ولید بن مسلم نے کہا: میں نے ابن مبارک سے یہ حدیث بیان کی۔میں نے کہا: ہمیں ابن ابی فروہ نے بھی نافع سے یہ روایت بیان کی ہے۔ابن مبارک نے کہا: یہ لوگ،جن کا تم نے نام لیا ہے،مالک بن انس کے برابر نہیں ہو سکتے۔(امام مالک رحمہ اللہ کی روایت راجح ہے)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (2741)`;