var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ،أَخْبَرَنَا سُفْيَانُ،عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ الشَّامِيِّ،عَنْ مَكْحُولٍ،عَنْ زِيَادِ بْنِ جَارِيَةَ التَّمِيمِيِّ،عَنْ حَبِيبِ بْنِ مَسْلَمَةَ الْفِهْرِيِّ،أَنَّهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَفِّلُ الثُّلُثَ بَعْدَ الْخُمُسِ";
abudawood.urdu = "سیدنا خبیب بن مسلمہ فہری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ (غنیمت میں سے) پانچواں حصہ نکالنے کے بعد تیسرا حصہ نفل یعنی اضافی انعام کے طور پر تقسیم فرمایا کرتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مکحول صرح بالسماع عند الحاکم (2/133) وھو برئ من التدلیس`;