var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدِ بْنِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ،قَالَا: حَدَّثَنَا اللَّيْثُ،عَنْ نَافِعٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ رَجُلًا أَخْبَرَهُ،عَنْ أُمِّ سَلَمَةَ،أَنَّ امْرَأَةً كَانَتْ تُهَرَاقُ الدَّمَ... فَذَكَرَ مَعْنَاهُ،قَالَ: فَإِذَا خَلَّفَتْ ذَلِكَ وَحَضَرَتِ الصَّلَاةُ فَلْتَغْتَسِلْ... بِمَعْنَاهُ.";
abudawood.urdu = "ایک آدمی نے سیدہ ام سلمہ رضی اللہ عنہا سے روایت کیا کہ ایک عورت کو بہت خون آتا تھا۔اور مذکورہ بالا حدیث کی مانند بیان کیا،اس روایت میں ہے کہ جب یہ دن گزر جائیں اور نماز کا وقت آ جائے (یعنی نماز پڑھنے کے دن آ جائیں) تو چاہیئے کہ غسل کرے۔باقی روایت سابقہ حدیث کے ہم معنی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من الأنصار مجہول،وسقط ذکرہ فی السند السابق (274)`;
abudawood.anwaar = [23,1];