var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ الْغَادِرَ يُنْصَبُ لَهُ لِوَاءٌ يَوْمَ الْقِيَامَةِ،فَيُقَالُ: هَذِهِ غَدْرَةُ فُلَانِ بْنِ فُلَانٍ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’(عہد و پیمان میں) دھوکہ کرنے والے کے لیے قیامت کے روز ایک جھنڈا گاڑا جائے گا اور کہا جائے گا: یہ فلاں بن فلاں کا دھوکا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6178) صحیح مسلم (طریق الآخر ح1735)";
abudawood.description = ``;