var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ رَجُلٍ مِنَ الْأَنْصَارِ،أَنَّ امْرَأَةً كَانَتْ تُهَرَاقُ الدِّمَاءَ... فَذَكَرَ مَعْنَى حَدِيثِ اللَّيْثِ قَالَ: فَإِذَا خَلَّفَتْهُنَّ وَحَضَرَتِ الصَّلَاةُ, فَلْتَغْتَسِلْ.... وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ.";
abudawood.urdu = "ایک انصاری سے روایت ہے کہ ایک خاتون کو بہت زیادہ خون آتا تھا۔اور مذکورہ بالا حدیث لیث کے ہم معنی بیان کیا۔کہا کہ جب یہ ایام گزار لے اور نماز کا وقت آ جائے تو غسل کرے۔اور اس کے ہم معنی ذکر کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من الأنصار مجھول،انظر الحدیث السابق: 275 (وضعیف سنن ابن ماجہ: 623)`;
abudawood.anwaar = [23,2];