var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي بَكْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ, حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ.";
abudawood.urdu = "سیدنا ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کسی عہد والے کو بغیر کسی وجہ جواز کے قتل کیا تو اللہ نے اس پر جنت حرام کر دی۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (4751 وسندہ صحیح)`;