var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ: إِنْ كَانَتِ الْمَرْأَةُ لَتُجِيرُ عَلَى الْمُؤْمِنِينَ،فَيَجُوزُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ (دور رسالت میں) عورت کسی کو مومنوں سے پناہ دے دیتی تو وہ جائز اور قبول ہوا کرتی تھی (مسلمان اسے قتل نہ کر سکتے تھے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی فی الکبریٰ (8683)<br>إبراہیم النخعي عنعن`;
abudawood.anwaar = [100,1];