var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،حَدَّثَنَا ابْنُ إِدْرِيسَ،قَالَ: سَمِعْتُ ابْنَ إِسْحَاقَ عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ،وَمَرْوَانَ بْنِ الْحَكَمِ, أَنَّهُمُ اصْطَلَحُوا عَلَى وَضْعِ الْحَرْبِ عَشْرَ سِنِينَ،يَأْمَنُ فِيهِنَّ النَّاسُ،وَعَلَى أَنَّ بَيْنَنَا عَيْبَةً مَكْفُوفَةً،وَأَنَّهُ لَا إِسْلَالَ وَلَا إِغْلَالَ .";
abudawood.urdu = "سیدنا مسور بن مخرمہ اور مروان بن حکم سے منقول ہے کہ قریش نے اس بات پر صلح کی کہ دس سال تک کوئی جنگ نہیں ہو گی لوگ اس مدت میں ہر طرح امن سے رہیں گے ‘ (اس معاہدے کے متعلق) ہم دونوں فریقوں کے دل صاف رہیں گے ‘ چوری چھپے یا خیانت سے اس کی مخالفت نہ ہو گی۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4046)
انظر الحدیث السابق (2765)`;