var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُزَابَةَ،حَدَّثَنَا إِسْحَاقُ يَعْنِي ابْنَ مَنْصُورٍ،حَدَّثَنَا أَسْبَاطٌ الْهَمْدَانِيُّ عَنِ السُّدِّيِّ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: الْإِيمَانُ قَيَّدَ الْفَتْكَ, لَا يَفْتِكُ مُؤْمِنٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’ایمان نے دھوکے سے قتل کرنے کو بند کر دیا ہے ‘ کوئی صاحب ایمان دھوکے سے قتل نہیں کر سکتا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3548)
صححہ الحاکم علٰی شرط مسلم (4/352 وسندہ حسن) ووافقہ الذھبي وللحدیث شواھد`;