var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ،عَنْ نَافِعٍ بِإِسْنَادِ اللَّيْثِ وَبِمَعْنَاهُ قَالَ: فَلْتَتْرُكِ الصَّلَاةَ قَدْرَ ذَلِكَ،ثُمَّ إِذَا حَضَرَتِ الصَّلَاةُ فَلْتَغْتَسِلْ،وَلْتَسْتَثْفِرْ بِثَوْبٍ،ثُمَّ تُصَلِّي";
abudawood.urdu = "صخر بن جویریہ،نافع سے لیث کی اسناد سے اور اس کے ہم معنی روایت کرتے ہیں۔کہا: ’’ایام حیض کی گنتی کے مطابق نماز چھوڑ دے۔پھر جب نماز کا وقت ہو جائے (نماز کے ایام آ جائیں) تو غسل کرے اور کپڑے کا لنگوٹ باندھے اور نماز پڑھے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الأحادیث السابقۃ (274،275،276)`;
abudawood.anwaar = [24,1];