var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ،حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ،عَنْ أَبِيهِ،عَنْ يَزِيدَ النَّحْوِيِّ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،قَالَ:لَا يَسْتَأْذِنُكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ[التوبة: 44]،الْآيَةَ: نَسَخَتْهَا الَّتِي فِي النُّورِ:إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ-إِلَى قَوْلِهِ-غَفُورٌ رَحِيمٌ[النور: 62";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ سورۃ التوبہ کی آیت کریمہ «لا یستأذنک الذین یؤمنون باللہ والیوم الآخر» کو سورۃ نور کی آیت کریمہ «إنما المؤمنون الذین آمنوا باللہ ورسولہ» نے منسوخ کر دیا ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;