var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ،حَدَّثَنَا أَبُو عَاصِمٍ،عَنْ أَبِي بَكْرَةَ بَكَّارِ بْنِ عَبْدِ الْعَزِيزِ،أَخْبَرَنِي أَبِي عَبْدُ الْعَزِيزِ،عَنْ أَبِي بَكْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, أَنَّهُ كَانَ إِذَا جَاءَهُ أَمْرُ سُرُورٍ،أَوْ بُشِّرَ بِهِ, خَرَّ سَاجِدًا شَاكِرًا لِلَّهِ";
abudawood.urdu = "سیدنا ابوبکرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ کے پاس جب کوئی خوشی کی خبر آتی یا آپ ﷺ کو بشارت دی جاتی تو آپ ﷺ اللہ کا شکر کرتے ہوئے سجدے میں گر جاتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1494)
أخرجہ الترمذي (1578 وسندہ حسن) وابن ماجہ (1394 وسندہ حسن)`;