var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ،قَالَا: حَدَّثَنَا شُعْبَةُ،عَنْ مُحَارِبِ بْنِ دِثَارٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ أَنْ يَأْتِيَ الرَّجُلُ أَهْلَهُ طُرُوقًا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ اس بات کو ناپسند فرماتے تھے کہ انسان رات کے وقت اپنے گھر پہنچے۔";
abudawood.hukam = "صحیح بخاری (5243) صحیح مسلم (715 بعد ح1928)";
abudawood.description = ``;