var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ مُغِيرَةَ عَنِ الشَّعْبِيِّ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِنَّ أَحْسَنَ مَا دَخَلَ الرَّجُلُ عَلَى أَهْلِهِ،إِذَا قَدِمَ مِنْ سَفَرٍ, أَوَّلَ اللَّيْلِ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’سفر سے واپسی کے موقع پر گھر والوں کے پاس آنے کا بہترین وقت رات کا پہلا حصہ ہوتا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (5244) صحیح مسلم (715 بعد ح1928)";
abudawood.description = `مشکوۃ المصابیح (3921)`;