var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنِ السَّائِبِ بْنِ يَزِيدَ،قَالَ: لَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ مِنْ غَزْوَةِ تَبُوكَ, تَلَقَّاهُ النَّاسُ،فَلَقِيتُهُ مَعَ الصِّبْيَانِ عَلَى ثَنِيَّةِ الْوَدَاعِ";
abudawood.urdu = "سیدنا سائب بن یزید رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ جب غزوہ تبوک سے مدینہ تشریف لائے تو لوگوں نے آپ ﷺ کا استقبال کیا۔دوسرے بچوں کے ساتھ میں نے بھی ثنیۃ الوداع کے مقام پر آپ ﷺ کا استقبال کیا تھا۔";
abudawood.hukam = "صحیح بخاری (4427)";
abudawood.description = ``;