var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ،حَدَّثَنَا أَيُّوبُ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ أُمِّ سَلَمَةَ بِهَذِهِ الْقِصَّةِ قَالَ فِيهِ تَدَعُ الصَّلَاةَ وَتَغْتَسِلُ فِيمَا سِوَى ذَلِكَ،وَتَسْتَثْفِرُ بِثَوْبٍ وَتُصَلِّي.\nقَالَ أَبُو دَاوُد: سَمَّى الْمَرْأَةَ الَّتِي كَانَتِ اسْتُحِيضَتْ حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ فِي هَذَا الْحَدِيثِ قَالَ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ.";
abudawood.urdu = "سلیمان بن یسار،سیدہ ام سلمہ رضی اللہ عنہا سے یہی قصہ بیان کرتے ہیں۔اس میں ہے کہ ’’نماز چھوڑ دے اور اس کے علاوہ میں غسل کرے اور کپڑے کا لنگوٹ باندھے اور نماز پڑھے۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا کہ حماد بن زید نے بواسطہ ایوب یہ روایت بیان کی تو اس میں مستحاضہ خاتون کا نام فاطمہ بنت ابی حبیش رضی اللہ عنہا بتایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الأحادیث السابقۃ (274،275،276،277)`;
abudawood.anwaar = [24,1];