var abudawood = {};
abudawood.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ،حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،حَدَّثَنَا الزَّمْعِيُّ عَنِ الزُّبَيْرِ بْنِ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ سُرَاقَةَ أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ أَخْبَرَهُ, أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ،أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِيَّاكُمْ وَالْقُسَامَةَ،قَالَ: فَقُلْنَا: وَمَا الْقُسَامَةُ؟ قَالَ: الشَّيْءُ يَكُونُ بَيْنَ النَّاسِ فَيَجِيءُ فَيَنْتَقِصُ مِنْهُ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’قسامہ (تقسیم کرنے کی اجرت) سے بچو۔‘‘ ہم نے عرض کیا ’’قسامہ‘‘ سے کیا مراد ہے؟ آپ ﷺ نے فرمایا ’’کوئی چیز لوگوں میں مشترک ہو اور کوئی آئے اور اس میں سے (اپنے لیے) کچھ نکال لے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>زبیر بن عثمان وثقہ ابن حبان وحدہ فھو : مجہول کما فی التحریر (2000)`;
abudawood.anwaar = [100,1];