var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ الْقَعْنَبِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ،عَنْ شَرِيكٍ يَعْنِي ابْنَ أَبِي نَمِرٍ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَهُ،قَالَ: الرَّجُلُ يَكُونُ عَلَى الْفِئَامِ مِنَ النَّاسِ،فَيَأْخُذُ مِنْ حَظِّ هَذَا،وَحَظِّ هَذَا";
abudawood.urdu = "سیدنا عطاء بن یسار رحمہ اللہ،نبی کریم ﷺ سے اس کی مانند روایت کرتے ہیں۔بیان کیا کہ کوئی لوگوں پر امیر ہو تو (تقسیم کرتے ہوئے) کچھ اس کے حصے میں سے لے لے اور کچھ دوسرے کے حصے میں سے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ھذا حدیث مرسل کما قال البغوي (شرح السنۃ 90/10 ح 2494)`;
abudawood.anwaar = [100,1];