var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ،حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ،أَخْبَرَنَا سُلَيْمَانُ بْنُ مُوسَى أَبُو دَاوُدَ،حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ بْنِ جُنْدُبٍ،حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ،عَنْ أَبِيهِ سُلَيْمَانَ بْنِ سَمُرَةَ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ أَمَّا بَعْدُ, قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ جَامَعَ الْمُشْرِكَ وَسَكَنَ مَعَهُ, فَإِنَّهُ مِثْلُهُ";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ نے (اپنے ایک خطبے میں) بیان کیا امابعد! رسول اللہ ﷺ نے فرمایا ’’جو شخص کسی مشرک کی صحبت اختیار کرے اور اس کے ساتھ رہائش رکھے تو وہ بھی اسی کی طرح ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خبیب : مجہول،وجعفر : ضعیف کما<br>وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [100,2];