var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا شَرِيكٌ،عَنْ أَبِي الْحَسْنَاءِ عَنِ الْحَكَمِ،عَنْ حَنَشٍ،قَالَ: رَأَيْتُ عَلِيًّا يُضَحِّي بِكَبْشَيْنِ؟ فَقُلْتُ لَهُ: مَا هَذَا؟ فَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْصَانِي أَنْ أُضَحِّيَ عَنْهُ،فَأَنَا أُضَحِّي عَنْهُ";
abudawood.urdu = "جناب حنش (حنش الکنانی ‘ حنش صنعانی) سے روایت ہے وہ کہتے ہیں کہ میں نے سیدنا علی رضی اللہ عنہ کو دیکھا کہ وہ دو مینڈھوں کی قربانی کیا کرتے تھے۔میں نے ان سے پوچھا یہ کیا ہے؟ تو انہوں نے کہا: رسول اللہ ﷺ نے مجھے وصیت فرمائی تھی کہ میں ان کی طرف سے قربانی کیا کروں۔چنانچہ میں آپ ﷺ کی طرف سے قربانی کیا کرتا ہوں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1495)<br>شریک والحکم بن عتیبۃ مدلسان و عنعنا<br>و أبو الحسناء ’’مجہول‘‘ (تقریب التہذیب: 8053)`;
abudawood.anwaar = [101,1];