var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وَهْبٌ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَحَرَ سَبْعَ بَدَنَاتٍ بِيَدِهِ, قِيَامًا،وَضَحَّى بِالْمَدِينَةِ بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے سات اونٹنیاں اپنے ہاتھ سے کھڑی حالت میں نحر کیں۔اور مدینہ منورہ میں آپ ﷺ نے دو مینڈھے قربانی کیے جو سینگوں والے اور چتکبرے تھے۔";
abudawood.hukam = "صحیح بخاری (1712)";
abudawood.description = ``;