var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَّى بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ،يَذْبَحُ،وَيُكَبِّرُ،وَيُسَمِّي،وَيَضَعُ رِجْلَهُ عَلَى صَفْحَتِهِمَا";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے دو مینڈھے ذبح کیے جو سینگوں والے اور چتکبرے تھے۔ذبح کرتے ہوئے آپ ﷺ نے تکبیر پڑھی اور «بسم اللہ» کہا: («بسم اللہ واللہ اکبر») اور اپنا پاؤں ان کی گردن پر رکھا۔";
abudawood.hukam = "صحیح بخاری (3799)";
abudawood.description = ``;