var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ،حَدَّثَنَا حَفْصٌ،عَنْ جَعْفَرٍ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ،قَالَ: كَانَ رَسُولُ اللَّهِ يُضَحِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ،يَنْظُرُ فِي سَوَادٍ،وَيَأْكُلُ فِي سَوَادٍ،وَيَمْشِي فِي سَوَادٍ.";
abudawood.urdu = "سیدنا ابوسعید رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ ایسا مینڈھا قربانی کیا کرتے تھے جو سینگوں والا اور نر (غیر خصی) ہوتا ‘ جو سیاہی میں دیکھتا (آنکھیں سیاہ ہوتیں) ‘ سیاہی میں کھاتا (منہ کالا ہوتا) اور سیاہی میں چلتا تھا (پاؤں بھی کالے ہوتے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `سندہ ضعیف<br>ترمذی (1496) نسائی (4395 ابن ماجہ (3128)<br>حفص بن غیاث مدلس و عنعن<br>و أبو جعفر محمد بن علي لم یسمع من أبي سعید کما في اتحاف المھرۃ (403/5)<br>و حدیث مسلم (1967) یغني عنہ`;
abudawood.anwaar = [185,1];