var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ،حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ،حَدَّثَنَا أَبُو الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لَا تَذْبَحُوا إِلَّا مُسِنَّةً،إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ،فَتَذْبَحُوا جَذَعَةً مِنَ الضَّأْنِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’صرف دو دانتا جانور ہی ذبح کرو ‘ سوائے اس کے کہ تمہارے لیے بہت مشکل ہو جائے تو بھیڑ کا جذع ذبح کر سکتے ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (1963)";
abudawood.description = ``;