var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ عَنْ حُمَيْدٍ الْحِمْيَرِيِّ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ قَالَ لَقِيتُ رَجُلًا صَحِبَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا صَحِبَهُ أَبُو هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَمْتَشِطَ أَحَدُنَا كُلَّ يَوْمٍ أَوْ يَبُولَ فِي مُغْتَسَلِهِ";
abudawood.urdu = "حمید حمیری،عبدالرحمٰن کے صاحب زادے کہتے ہیں کہ میں ایک صاحب سے ملا جو رسول اللہ ﷺ کی صحبت سے فیض یافتہ تھے جیسے کہ سیدنا ابوہریرہ رضی اللہ عنہ آپ ﷺ کی صحبت میں رہے تھے،انہوں نے بیان کیا: رسول اللہ ﷺ نے منع فرمایا کہ ہمارا کوئی شخص ہر روز کنگھی کرے پا اپنے غسل خانے میں پیشاب کرے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (472)
وانظر الحدیث الآتی (81)`;