var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا هُشَيْمٌ،حَدَّثَنَا عَبْدُ الْمَلِكِ،عَنْ عَطَاءٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: كُنَّا نَتَمَتَّعُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, نَذْبَحُ الْبَقَرَةَ عَنْ سَبْعَةٍ،وَالْجَزُورَ عَنْ سَبْعَةٍ, نَشْتَرِكُ فِيهَا.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ ہم رسول اللہ ﷺ کے زمانے میں (حج) تمتع کرتے تھے ‘ سات افراد کی طرف سے ایک گائے ذبح کرتے تھے اور ہم سب اس میں شریک ہو جاتے تھے";
abudawood.hukam = "صحیح مسلم (1318)";
abudawood.description = ``;