var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ قَيْسٍ،عَنْ عَطَاءٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْبَقَرَةُ عَنْ سَبْعَةٍ،وَالْجَزُورُ عَنْ سَبْعَةٍ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’گائے سات افراد کی طرف سے ہے اور اونٹ بھی سات افراد کی طرف سے ہے";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1458)`;