var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّهُ قَالَ: نَحَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحُدَيْبِيَّةِ الْبَدَنَةَ عَنْ سَبْعَةٍ،وَالْبَقَرَةَ عَنْ سَبْعَةٍ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ہم نے رسول اللہ ﷺ کی معیت میں حدیبیہ میں اونٹ سات افراد کی طرف سے نحر کیا اور گائے سات افراد کی طرف سے ذبح کی۔";
abudawood.hukam = "صحیح مسلم (1318)";
abudawood.description = ``;