var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ أَنَّ أَبَا أُسَامَةَ حَدَّثَهُمْ،عَنْ أُسَامَةَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَذْبَحُ أُضْحِيَّتَهُ بِالْمُصَلَّى،وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے منقول ہے کہ نبی کریم ﷺ اپنی قربانی عید گاہ ہی میں ذبح کیا کرتے تھے اور سیدنا ابن عمر رضی اللہ عنہما کا بھی یہی عمل تھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ ابن ماجہ (3161 وسندہ حسن) وأصلہ عند البخاري (982)`;