var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا خَالِدٌ الْحَذَّاءُ،عَنْ أَبِي الْمَلِيحِ،عَنْ نُبَيْشَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّا كُنَّا نَهَيْنَاكُمْ عَنْ لُحُومِهَا أَنْ تَأْكُلُوهَا فَوْقَ ثَلَاثٍ, لِكَيْ تَسَعَكُمْ, فَقَدْ جَاءَ اللَّهُ بِالسَّعَةِ،فَكُلُوا،وَادَّخِرُوا،وَاتَّجِرُوا،أَلَا وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ،وَشُرْبٍ،وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ";
abudawood.urdu = "سیدنا نبیشہ ہذلی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’ہم نے تم لوگوں کو قربانیوں کا گوشت تین دن سے زیادہ رکھنے سے اس لیے منع کیا تھا کہ تم سب کو گوشت پہنچ جائے اور (اب) اللہ تعالیٰ نے تمہیں وسعت دے دی ہے (اور غنی کر دیا ہے) پس کھاؤ ‘ ذخیرہ کرو اور اجر کماؤ ‘ خبردار! یہ دن کھانے پینے اور اللہ کا ذکر کرنے کے دن ہیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2645)
أصلہ عند مسلم (1141)`;