var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ،قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ،عَنْ أَبِي الزَّاهِرِيَّةِ،عَنْ جُبَيْرِ بْنِ نُفَيْرٍ،عَنْ ثَوْبَانَ قَالَ: ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،ثُمَّ قَالَ: يَا ثَوْبَانُ! أَصْلِحْ لَنَا لَحْمَ هَذِهِ الشَّاةِ! قَالَ: فَمَا زِلْتُ أُطْعِمُهُ مِنْهَا،حَتَّى قَدِمْنَا الْمَدِينَةَ.";
abudawood.urdu = "سیدنا ثوبان رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے قربانی کی پھر فرمایا ’’اے ثوبان! ہمارے لیے اس بکری کا گوشت بناؤ۔‘‘ کہتے ہیں: پھر میں آپ ﷺ کو اس سے کھلاتا رہا حتیٰ کہ ہم مدینے آ گئے۔";
abudawood.hukam = "صحیح مسلم (1975)";
abudawood.description = ``;