var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ أَنَّ عَبْدَ الْوَاحِدِ بْنِ زِيَادٍ وَحَمَّادًا حَدَّثَاهُمْ الْمَعْنَى وَاحِدٌ،عَنْ عَاصِمٍ عَنِ الشَّعْبِيِّ،عَنْ مُحَمَّدِ بْنِ صَفْوَانَ-أَوْ صَفْوَانَ بْنِ مُحَمَّدٍ-قَالَ: اصَّدْتُ أَرْنَبَيْنِ فَذَبَحْتُهُمَا بِمَرْوَةٍ،فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُمَا؟ فَأَمَرَنِي بِأَكْلِهِمَا.";
abudawood.urdu = "محمد بن صفوان یا صفوان بن محمد رضی اللہ عنہ سے روایت ہے وہ کہتے ہیں کہ میں نے دو خرگوش شکار کیے تو میں نے ان کو پتھر سے ذبح کیا۔پھر میں نے ان کے متعلق رسول اللہ ﷺ سے دریافت کیا تو آپ ﷺ نے مجھے ان کے کھانے کا حکم دیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (4318 وسندہ حسن) وابن ماجہ (3175 وسندہ حسن)`;