var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ مُرَيِّ بْنِ قَطَرِيٍّ،عَنْ عَدِيِّ بْنِ حَاتِمٍ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ! أَرَأَيْتَ إِنْ أَحَدُنَا أَصَابَ صَيْدًا،وَلَيْسَ مَعَهُ سِكِّينٌ, أَيَذْبَحُ بِالْمَرْوَةِ وَشِقَّةِ الْعَصَا؟ فَقَالَ: أَمْرِرِ الدَّمَ بِمَا شِئْتَ،وَاذْكُرِ اسْمَ اللَّهِ عَزَّ وَجَلَّ";
abudawood.urdu = "سیدنا عدی بن حاتم رضی اللہ عنہ بیان کرتے ہیں کہتے ہیں کہ میں نے کہا: اے اللہ کے رسول! فرمائیے کہ ہم میں سے کوئی شکار کرتا ہے اور اس کے پاس چھری نہیں ہوتی تو کیا وہ اسے پتھر سے یا لکڑی کے تیز پھٹے سے ذبح کر لے؟ آپ ﷺ نے فرمایا ’’خون بہاؤ ‘ جس سے بھی تم چاہو اور اللہ کا نام ذکر کرو۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4081)
أخرجہ النسائي (4309 وسندہ حسن)`;