var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ رَاهَوَيْهِ،حَدَّثَنَا عَتَّابُ بْنُ بَشِيرٍ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ الْقَدَّاحُ الْمَكِّيُّ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: ذَكَاةُ الْجَنِينِ ذَكَاةُ أُمِّهِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’بچے کا ذبح کرنا اس کی ماں کے ذبح کرنے میں ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4091)
وللحدیث شاھد حسن عند ابن حبان (1077)`;