var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ هِشَامٍ بِإِسْنَادِ زُهَيْرٍ وَمَعْنَاهُ وَقَالَ: فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَاتْرُكِي الصَّلَاةَ،فَإِذَا ذَهَبَ قَدْرُهَا, فَاغْسِلِي الدَّمَ عَنْكِ وَصَلِّي";
abudawood.urdu = "قعنبی نے مالک کے واسطے سے ہشام سے بسند زہیر اس کے ہم معنی بیان کیا کہا: ’’جب حیض آئے تو نماز چھوڑ دو۔اور جب اس کے بقدر (بقدر عادت سابق ایام) گزر جائیں تو خون کو دھوو اور نماز پڑھو۔“";
abudawood.hukam = "صحیح بخاری (306)";
abudawood.description = ``;