var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ،عَنْ سِبَاعِ بْنِ ثَابِتٍ،عَنْ أُمِّ كُرْزٍ،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: عَنِ الْغُلَامِ شَاتَانِ مِثْلَانِ،وَعَنِ الْجَارِيَةِ شَاةٌ.قَالَ أَبو دَاود: هَذَا هُوَ الْحَدِيثُ وَحَدِيثُ سُفْيَانَ وَهْمٌ.";
abudawood.urdu = "سیدہ ام کرز رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’لڑکے کی طرف سے دو بکریاں ہیں ہم مثل (ایک جیسی) اور لڑکی کی طرف سے ایک بکری ہے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں: صحیح حدیث یہی ہے جبکہ سفیان کی حدیث وہم ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2835)`;