var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَّ عَنْ الْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے سیدنا حسن اور حسین رضی اللہ عنہما کے عقیقہ میں ایک ایک مینڈھا ذبح کیا تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4155)`;