var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ صَيْدٍ أَوْ زَرْعٍ انْتَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جس نے کتا پالا،سوائے اس کے کہ وہ جانوروں کی حفاظت کے لیے ہو،یا شکار کے لیے،یا کھیتی کے لیے تو ایسے شخص کے اجر میں سے ہر روز ایک قیراط کم ہوتا رہے گا۔";
abudawood.hukam = "صحیح مسلم (1575)";
abudawood.description = ``;