var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَمَرَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ حَتَّى إِنْ كَانَتْ الْمَرْأَةُ تَقْدَمُ مِنْ الْبَادِيَةِ يَعْنِي بِالْكَلْبِ فَنَقْتُلُهُ ثُمَّ نَهَانَا عَنْ قَتْلِهَا وَقَالَ عَلَيْكُمْ بِالْأَسْوَدِ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے (ابتدائی ایام میں) کتوں کو قتل کرنے کا حکم دیا تھا حتیٰ کہ اگر کوئی عورت دیہات سے آتی اور اس کے ساتھ کتا ہوتا تو ہم اسے بھی قتل کر ڈالتے تھے،اس کے بعد آپ ﷺ نے ہمیں اس سے منع کر دیا اور فرمایا ’’صرف کالے کتوں کو مارو۔“";
abudawood.hukam = "صحیح مسلم (1572)";
abudawood.description = `مشکوۃ المصابیح (4102)`;