var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي وَاقِدٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قُطِعَ مِنْ الْبَهِيمَةِ وَهِيَ حَيَّةٌ فَهِيَ مَيْتَةٌ";
abudawood.urdu = "سیدنا ابوواقد لیثی رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جانور سے جو گوشت کاٹا جائے ‘ جبکہ وہ جانور زندہ ہو تو وہ گوشت مردار (حرام) ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4095)
أخرجہ الترمذي (1480 وسندہ حسن) وللحدیث شاھد عند الحاکم (2/239)`;