var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى،حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا الْحَسَنُ بْنُ الْحَكَمِ النَّخَعِيُّ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ شَيْخٍ مِنَ الْأَنْصَارِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, بِمَعْنَى مُسَدَّدٍ (2859)،قَالَ: وَمَنْ لَزِمَ السُّلْطَانَ افْتُتِنَ... زَادَ: وَمَا ازْدَادَ عَبْدٌ مِنَ السُّلْطَانِ دُنُوًّا, إِلَّا ازْدَادَ مِنَ اللَّهِ بُعْدًا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس نے بادشاہ کی صحبت اختیار کی ‘ فتنے میں پڑا۔‘‘ اور مزید کہا: ’’جو بندہ کسی بادشاہ کے جس قدر قریب ہو گا ‘ اللہ تعالیٰ سے اسی قدر بعید ہو جائے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `<br>إسنادہ ضعیف<br>’’ شیخ من الأنصار ‘‘ : لم أعرفہ`;
abudawood.anwaar = [103,1];