var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَمَيْتَ الصَّيْدَ فَأَدْرَكْتَهُ بَعْدَ ثَلَاثِ لَيَالٍ وَسَهْمُكَ فِيهِ فَكُلْهُ مَا لَمْ يُنْتِنْ";
abudawood.urdu = "حضرت ابوثعلبہ خشنی رضی اللہ عنہ سے روایت ہے‘ نبی کریم ﷺ نے فرمایا ’’جب تم شکار کو (تیر) مارو اور پھر تین رات کے بعد اسے پاؤ جبکہ تمہارا تیر اس میں ہو تو اسے کھا لو۔جب تک کہ بو نہ دینے لگے۔‘‘";
abudawood.hukam = "صحیح مسلم (1931)";
abudawood.description = ``;