var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصِي فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’کسی بھی مسلمان کو لائق نہیں کہ اس کے پاس کوئی چیز ہو جس کے متعلق وہ کوئی وصیت کرنا چاہتا ہو تو وہ دو راتیں بھی نہ گزارے مگر اس حال میں کہ اس کی وصیت اس کے پاس لکھی ہوئی ہو۔‘‘";
abudawood.hukam = "صحیح بخاری (2738) صحیح مسلم (1627)";
abudawood.description = ``;