var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَمُحَمَّدُ بْنُ الْعَلَاءِ،قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ،قَالَتْ: مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِينَارًا،وَلَا دِرْهَمًا،وَلَا بَعِيرًا،وَلَا شَاةً،وَلَا أَوْصَى بِشَيْءٍ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان فرماتی ہیں کہ رسول اللہ ﷺ کوئی دینار ‘ درہم یا اونٹ ‘ بکری نہیں چھوڑ گئے اور نہ کسی چیز کے متعلق وصیت ہی فرمائی۔";
abudawood.hukam = "صحیح مسلم (1635)";
abudawood.description = ``;