var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ عَنْ شُرَحْبِيلَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ يَتَصَدَّقَ الْمَرْءُ فِي حَيَاتِهِ بِدِرْهَمٍ خَيْرٌ لَهُ مِنْ أَنْ يَتَصَدَّقَ بِمِائَةِ دِرْهَمٍ عِنْدَ مَوْتِهِ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’انسان کا اپنی زندگی میں ایک درہم صدقہ کرنا ‘ موت کے وقت سو (درہم) صدقہ کرنے کی بہ نسبت زیادہ افضل ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شرحبیل بن سعد اختلط وضعفہ الجمہور وھو ضعیف،و قال الھیثمي : و ضعفہ جمھور الأئمۃ (مجمع الزوائد 115/4) و قال : وھو ضعیف عند الجمھور (مجمع الزوائد 159/2)<br>وانظر الحدیث الآتي : 4813`;
abudawood.anwaar = [103,1];