var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ إِنْ تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالْأَقْرَبِينَ فَكَانَتْ الْوَصِيَّةُ كَذَلِكَ حَتَّى نَسَخَتْهَا آيَةُ الْمِيرَاثِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ آیت «إن ترک خیرا الوصیۃ للوالدین والأقربین»’’اگر مال چھوڑ جائے تو ماں باپ اور قرابت داروں کیلئے وصیت کرے۔‘‘ کا حکم ابتداء میں ایسے ہی تھا حتیٰ کہ اسے آیت میراث نے منسوخ کر دیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;