var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ شُرَحْبِيلَ بْنِ مُسْلِمٍ سَمِعْتُ أَبَا أُمَامَةَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ فَلَا وَصِيَّةَ لِوَارِثٍ";
abudawood.urdu = "سیدنا ابوامامہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ’’بلاشبہ اللہ تعالیٰ نے ہر حقدار کو اس کا حق دے دیا ہے۔پس وارث کے لیے کوئی وصیت نہیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3073)
أخرجہ الترمذي (2120 وسندہ حسن، إسماعیل بن عیاش صرح بالسماع عندہ) ورواہ ابن ماجہ (2713 وسندہ حسن)`;