var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ أَنَّ خَالِدَ بْنَ الْحَارِثِ حَدَّثَهُمْ حَدَّثَنَا حُسَيْنٌ يَعْنِي الْمُعَلِّمَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي فَقِيرٌ لَيْسَ لِي شَيْءٌ وَلِي يَتِيمٌ قَالَ فَقَالَ كُلْ مِنْ مَالِ يَتِيمِكَ غَيْرَ مُسْرِفٍ وَلَا مُبَادِرٍ وَلَا مُتَأَثِّلٍ";
abudawood.urdu = "سیدنا عمرو بن شعیب اپنے والد سے ‘ وہ اپنے دادا سے روایت کرتے ہیں کہ ایک شخص نبی کریم ﷺ کے پاس آیا اور کہا: میں فقیر ہوں اور میرے پاس کچھ نہیں ہے اور میرے ہاں ایک یتیم بھی ہے۔تو آپ ﷺ نے فرمایا ’’تو اپنے یتیم کے مال سے کھا سکتا ہے ‘ لیکن اسراف اور فضول خرچی ہو ‘ نہ جلدی کرنے والا ہو (کہ اس کے بڑے ہونے سے پہلے پہلے اس کے مال کو خرچ کر ڈالے) اور نہ اس کے مال سے تو کوئی جمع پونجی بنانے والا ہو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3355)
أخرجہ النسائي (3698 وسندہ حسن)`;