var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْروِ بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ التَّنُوخِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعِلْمُ ثَلَاثَةٌ وَمَا سِوَى ذَلِكَ فَهُوَ فَضْلٌ آيَةٌ مُحْكَمَةٌ أَوْ سُنَّةٌ قَائِمَةٌ أَوْ فَرِيضَةٌ عَادِلَةٌ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو بن العاص رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ ن فرمایا ’’علم تین چیزوں کا نام ہے،اور جو ان کے علاوہ ہے وہ اضافی ہے (بنیادی نہیں) محکم آیات،ثابت شدہ سنتیں اور مالی حقوق جو عدل پر مبنی ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (54)<br>الإفریقي ضعیف<br>ولحدیثہ شواہد ضعیفۃ`;
abudawood.anwaar = [104,1];