var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي دَاوُدُ بْنُ قَيْسٍ وَغَيْرُهُ مِنْ أَهْلِ الْعِلْمِ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ امْرَأَةَ سَعْدِ بْنِ الرَّبِيعِ،قَالَتْ: يَا رَسُولَ اللَّهِ! إِنَّ سَعْدًا هَلَكَ،وَتَرَكَ ابْنَتَيْنِ... وَسَاقَ نَحْوَهُ. قَالَ أَبو دَاود: وَهَذَا هُوَ أَصَحُّ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ سیدنا سعد بن ربیع رضی اللہ عنہ کی بیوہ نے کہا: اے اﷲ کے رسول! سعد شہید ہو گئے ہیں اور دو بیٹیاں چھوڑ گئے ہیں۔اور مذکورہ بالا کی مانند روایت کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں یہ روایت زیادہ صحیح ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `<br>إسنادہ ضعیف<br>انظر الحدیث السابق (2891)`;
abudawood.anwaar = [104,1];