var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنِي أَبُو حَسَّانَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ أَنَّ مُعَاذَ بْنَ جَبَلٍ وَرَّثَ أُخْتًا وَابْنَةً فَجَعَلَ لِكُلِّ وَاحِدَةٍ مِنْهُمَا النِّصْفَ وَهُوَ بِالْيَمَنِ وَنَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ حَيٌّ";
abudawood.urdu = "سیدنا معاذ بن جبل رضی اللہ عنہ نے ایک بہن اور ایک بیٹی کو میت کا وارث بنایا اور ہر ایک کو آدھا آدھا دیا جبکہ سیدنا معاذ رضی اللہ عنہ ان دنوں یمن میں تھے اور رسول اللہ ﷺ باحیات تھے۔";
abudawood.hukam = "صحیح بخاری (6734)";
abudawood.description = ``;