var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ أَخْبَرَنِي أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ أَبُو الْمُنِيبِ الْعَتَكِيِّ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ لِلْجَدَّةِ السُّدُسَ إِذَا لَمْ يَكُنْ دُونَهَا أُمٌّ";
abudawood.urdu = "سیدنا بریدہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے جدہ (دادی ‘ نانی) کے لیے چھٹا حصہ مقرر کیا تھا۔لیکن جب اس سے پہلے (ورے) ماں نہ ہو۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3049)`;