var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ يُونُسَ عَنْ الْحَسَنِ أَنْ عُمَرَ قَالَ أَيُّكُمْ يَعْلَمُ مَا وَرَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَدَّ فَقَالَ مَعْقِلُ بْنُ يَسَارٍ أَنَا وَرَّثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السُّدُسَ قَالَ مَعَ مَنْ قَالَ لَا أَدْرِي قَالَ لَا دَرَيْتَ فَمَا تُغْنِي إِذًا";
abudawood.urdu = "سیدنا عمر رضی اللہ عنہ نے پوچھا تم میں سے کوئی جانتا ہے کہ رسول اللہ ﷺ نے دادا کو کیا وراثت دی تھی؟ تو سیدنا معقل بن یسار رضی اللہ عنہ نے کہا: میں جانتا ہوں ‘ رسول اللہ ﷺ نے اسے چھٹا حصہ دیا تھا۔انہوں نے پوچھا: کس کے ساتھ؟ کہا: مجھے نہیں معلوم۔تو عمر رضی اللہ عنہ نے کہا: تم نے نہیں جانا (تمہارا ادھوری بات بتانے کا) کیا فائدہ؟";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2723)<br>الحسن عن عمر : لم یدرکہ (تحفۃ الأشراف 20/8) فالسند منقطع<br>والحدیث السابق (الأصل : 2895) یغني عنہ`;
abudawood.anwaar = [104,2];