var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَمخْلَدُ بْنُ خَالِدٍ وَهَذَا حَدِيثُ مَخْلَدٍ وَهُوَ الْأَشْبَعُ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْسِمْ الْمَالَ بَيْنَ أَهْلِ الْفَرَائِضِ عَلَى كِتَابِ اللَّهِ فَمَا تَرَكَتْ الْفَرَائِضُ فَلِأَوْلَى ذَكَرٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جن لوگوں کے حصے مقرر ہیں ‘ ان کے درمیان مال کو اسی طرح تقسیم کرو جیسے کتاب اﷲ میں ہے ‘ اور ان سے جو بچ رہے تو وہ قریب ترین مرد کا حق ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6732) صحیح مسلم (1615)";
abudawood.description = ``;