var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُبَالَ فِي الْجُحْرِ قَالُوا لِقَتَادَةَ مَا يُكْرَهُ مِنْ الْبَوْلِ فِي الْجُحْرِ قَالَ كَانَ يُقَالُ إِنَّهَا مَسَاكِنُ الْجِنِّ";
abudawood.urdu = "سیدنا عبداللہ بن سرجس رضی اللہ عنہ سے منقول ہے کہ نبی کریم ﷺ نے بل میں پیشاب کرنے سے منع فرمایا ہے۔لوگوں نے قتادہ سے کہا کہ بل میں پیشاب کیوں مکروہ و ممنوع ہے؟ تو انہوں نے کہا: کہا جاتا ہے کہ ان میں جن رہتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف،نسائی (34)<br>قتادۃ مدلس (طبقات المدلسین بتحقیقي: 3/92) وعنعن`;
abudawood.anwaar = [14,1];