var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَمْرُو بْنُ دِينَارٍ عَنْ عَوْسَجَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَجُلًا مَاتَ وَلَمْ يَدَعْ وَارِثًا إِلَّا غُلَامًا لَهُ كَانَ أَعْتَقَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ لَهُ أَحَدٌ قَالُوا لَا إِلَّا غُلَامًا لَهُ كَانَ أَعْتَقَهُ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ لَهُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہےکہ ایک شخص فوت ہو گیا۔اس کا کوئی وارث نہ تھا سوائے ایک غلام کے جس کو اس نے آزاد کیا تھا۔رسول اللہ ﷺ نے دریافت فرمایا ’’کیا اس کا کوئی وارث ہے؟ ’’لوگوں نے کہا: نہیں ‘ سوائے ایک آزاد کردہ غلام کے۔تو رسول اللہ ﷺ نے اس کی وراثت اسی کو دے دی۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3065)
أخرجہ ابن ماجہ (2741 وسندہ حسن) عوسجۃ: حسن الحدیث`;