var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنِي عُمَرُ بْنُ رُؤْبَةَ التَّغْلِبِيُّ عَنْ عَبْدِ الْوَاحِدِ بْنِ عَبْدِ اللَّهِ النَّصْرِيِّ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَرْأَةُ تُحْرِزُ ثَلَاثَةَ مَوَارِيثَ عَتِيقَهَا وَلَقِيطَهَا وَوَلَدَهَا الَّذِي لَاعَنَتْ عَنْهُ";
abudawood.urdu = "سیدنا واثلہ بن اسقع رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’عورت تین طرح کی وراثت جمع کر لیتی ہے۔اپنے غلام کی ‘ اس بچے کی جو اسے کہیں سے گرا پڑا مل گیا ہو اور اس بچے کی جس کے بارے میں اس نے (اپنے شوہر سے) لعان کیا ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2115) ابن ماجہ (2742)<br>عمر بن رؤبۃ ضعفہ البخاري والجمہور فھو ضعیف یعتبر بہ<br>انظر التحریر (4895)<br>وقال ابن عدي : ’’ وإنما أنکروا علیہ أحادیثہ عن عبدالواحد النصري ‘‘ (الکامل 1707/5)`;
abudawood.anwaar = [105,1];