var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ وَمُوسَى بْنُ عَامِرٍ قَالَا حَدَّثَنَا الْوَلِيدُ أَخْبَرَنَا ابْنُ جَابِرٍ حَدَّثَنَا مَكْحُولٌ قَالَ جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَ ابْنِ الْمُلَاعَنَةِ لِأُمِّهِ وَلِوَرَثَتِهَا مِنْ بَعْدِهَا";
abudawood.urdu = "جناب مکحول نے کہا کہ رسول اللہ ﷺ نے لعان والی عورت کے بچے کی میراث اس کی ماں کیلئے مخصوص کی تھی اور بعد ازاں اس عورت کے وارثوں کے لیے ہو گی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قال البیہقي : ’’ حدیث مکحول منقطع ‘‘ (السنن الکبری 6/ 259)<br>فالسند ضعیف<br>وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [105,1];