var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ عَامِرٍ حَدَّثَنَا الْوَلِيدُ أَخْبَرَنِي عِيسَى أَبُو مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ";
abudawood.urdu = "عمرو بن شعیب نے اپنے والد سے انہوں نے اپنے دادا سے ‘ انہوں نے نبی کریم ﷺ سے اسی کی مانند روایت کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الولید بن مسلم لم یصرح بالسماع المسلسل وکان یدلس تدلیس التسویۃ`;
abudawood.anwaar = [105,1];