var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حَبِيبٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْروٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ شَتَّى";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’دو مختلف ملتوں (اور دینوں) والے ایک دوسرے کے وارث نہیں بنتے";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3046)`;