var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الشَّعْثَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ قَسْمٍ قُسِمَ فِي الْجَاهِلِيَّةِ فَهُوَ عَلَى مَا قُسِمَ لَهُ وَكُلُّ قَسْمٍ أَدْرَكَهُ الْإِسْلَامُ فَهُوَ عَلَى قَسْمِ الْإِسْلَامِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جو تقسیم (قبل از اسلام) جاہلیت میں ہو چکی سو ہو چکی (وہ اسی کے مطابق رہے گی) اور جو اسلام قبول کرنے تک نہیں ہوئی،وہ اب اسلام کے دستور کے مطابق ہو گی۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `وللحدیث شواھد کثیرۃ`;