var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُسَيْنُ بْنُ مُعَاذٍ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ إِسْحَقَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَهَلَّ الْمَوْلُودُورّث";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’(نو مولود) بچہ جب آواز بلند کرے تو وارث ہو گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ابن إسحاق عنعن<br>وللحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [106,1];