var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَلِيُّ بْنُ حُسَيْنٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ وَالَّذِينَ آمَنُوا وَهَاجَرُوا وَالَّذِينَ آمَنُوا وَلَمْ يُهَاجِرُوا فَكَانَ الْأَعْرَابِيُّ لَا يَرِثُ الْمُهَاجِرَ وَلَا يَرِثُهُ الْمُهَاجِرُ فَنَسَخَتْهَا فَقَالَ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہےکہ انہوں نے آیت کریمہ «والذین آمنوا وہاجروا» اور «والذین آمنوا ولم یہاجروا» کی تفسیر میں فرمایا کہ دیہاتی (مسلمان جس نے ہجرت نہ کی ہوتی) مہاجر کا وارث نہ بنتا تھا۔پھر اس حکم کو آیت کریمہ «وأولو الأرحام بعضہم أولی ببعض» نے منسوخ کر دیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;