var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ وَابْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ زَكَرِيَّا عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حِلْفَ فِي الْإِسْلَامِ وَأَيُّمَا حِلْفٍ كَانَ فِي الْجَاهِلِيَّةِ لَمْ يَزِدْهُ الْإِسْلَامُ إِلَّا شِدَّةً";
abudawood.urdu = "سیدنا جبیر بن مطعم رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’اسلام میں کوئی (نیا) حلف نہیں ہے اور قیل از اسلام (ایام جاہلیت میں) جو عہد معاہد ے ہو چکے ان کو اسلام نے اور مضبوط کیا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2530)";
abudawood.description = ``;