var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ،حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ،عَنْ أَبِي سَلَمَةَ سُلَيْمَانَ بْنِ سُلَيْمٍ،عَنْ يَحْيَى بْنِ جَابِرٍ،عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ،عَنْ جَدِّهِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ عَلَى مَنْكِبِهِ،ثُمَّ قَالَ لَهُ: «أَفْلَحْتَ يَا قُدَيْمُ إِنْ مُتَّ وَلَمْ تَكُنْ أَمِيرًا،وَلَا كَاتِبًا وَلَا عَرِيفًا»";
abudawood.urdu = "سیدنا مقدام بن معدیکرب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اس کے کندھے پر ہاتھ مارا،پھر فرمایا ’’اے قدیم! (قاف کی پیش اور دال پر زبر کے ساتھ) تو کامیاب ہوا اگر اس حال میں فوت ہوا کہ نہ امیر بنا،نہ اس کا سیکرٹری اور نہ عریف (اپنی قوم کا سردار)۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>صالح بن یحیی لین و أبوہ مستور (تق : 2894،7653)`;
abudawood.anwaar = [106,1];