var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا نُوحُ بْنُ قَيْسٍ عَنْ يَزِيدَ بْنِ كَعْبٍ عَنْ عَمْرِو بْنِ مَالِكٍ عَنْ أَبِي الْجَوْزَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَ السِّجِلُّ كَاتِبٌ كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ السجل» نامی ایک شخص نبی کریم ﷺ کا کاتب تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>یزید بن کعب : مجہول (تق : 7766) لم یوثقہ غیر ابن حبان وللحدیث طریق آخر ضعیف عندالخطیب (175/8)`;
abudawood.anwaar = [106,1];