var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ الْأَسْبَاطِيُّ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعَامِلُ عَلَى الصَّدَقَةِ بِالْحَقِّ كَالْغَازِي فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ إِلَى بَيْتِهِ";
abudawood.urdu = "سیدنا رافع بن خدیج رضی اللہ عنہ سے روایت ہے وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’حق کے ساتھ صدقات جمع کرنے والا ایسے ہے جیسے کہ مجاہد فی سبیل اللہ حتیٰ کہ وہ گھر لوٹ آئے۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1785)
أخرجہ الترمذي (645 وسندہ حسن) وابن ماجہ (1809 وسندہ حسن) محمد بن إسحاق صرح بالسماع عند أحمد (4/143)`;