var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ صَاحِبُ مَكْسٍ";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’چنگی اور بھتہ لینے والا جنت میں نہیں جائے گا۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ابن إسحاق عنعن<br>وللحدیث شاہد ضعیف عند أحمد (109/4)`;
abudawood.anwaar = [106,2];