var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ كُنَّا نُبَايِعُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ وَيُلَقِّنُنَا فِيمَا اسْتَطَعْتَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ ہم نبی کریم ﷺ سے سمع اور اطاعت پر بیعت کرتے تھے (آپ کے احکام سنیں گے اور بخوشی عمل کریں گے) اور آپ ﷺ ہمیں تلقین فرماتے ’’ان میں جن میں تم طاقت رکھو۔";
abudawood.hukam = "صحیح بخاری (2702) صحیح مسلم (1867)";
abudawood.description = ``;