var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ أَبُو طَالِبٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ الْوَارِثِ بْنِ سَعِيدٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَرَزَقْنَاهُ رِزْقًا فَمَا أَخَذَ بَعْدَ ذَلِكَ فَهُوَ غُلُولٌ";
abudawood.urdu = "سیدنا بریدہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جسے ہم کسی کام پر متعین کریں اور اسے اس پر تنخواہ بھی دیں،تو جو وہ اس سے مزید لے گا وہ خیانت ہو گی۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3748)
صححہ ابن خزیمۃ (2369 وسندہ حسن)`;