var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا بِهِ أَبُو هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أُوتِيكُمْ مِنْ شَيْءٍ وَمَا أَمْنَعُكُمُوهُ إِنْ أَنَا إِلَّا خَازِنٌ أَضَعُ حَيْثُ أُمِرْتُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’میں تمہیں جو چیز بھی دیتا ہوں یا نہیں دیتا،تو اس کی وجہ یہ ہے کہ میں ایک خزانچی کی طرح ہوں،چیزوں کو وہیں رکھتا ہوں جہاں مجھے رکھنے کا حکم دیا گیا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وھو في صحیفۃ ھمام بن منبہ (43)`;