var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ مَنْ تَرَكَ مَالًا فَلِأَهْلِهِ وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَإِلَيَّ وَعَلَيَّ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ فرمایا کرتے تھے ’’میں مومنوں کے لیے ان کی جانوں سے بھی نزدیک تر ہوں (کہ میرا مقام پہچانیں اور بے چوں و چرا اطاعت کریں) چنانچہ جو کوئی مال چھوڑ جائے تو وہ اس کے گھر والوں کا حق ہے اور جو کوئی قرضہ چھوڑ جائے یا چھوٹے بچے ‘ تو وہ میری طرف ہیں اور میرے ذمے ہیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ مسلم (867)`;