var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ وَمَنْ تَرَكَ كَلًّا فَإِلَيْنَا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’جو مال چھوڑ جائے تو وہ اس کے وارثوں کا ہے اور جو عیال و اطفال چھوڑ جائے تو وہ ہماری طرف ہیں۔‘‘ (ہم ان کے ذمہ دار ہیں اور ہم ان کی کفالت کریں گے)۔";
abudawood.hukam = "صحیح بخاری (6763) صحیح مسلم (1619)";
abudawood.description = ``;