var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ فَأَيُّمَا رَجُلٍ مَاتَ وَتَرَكَ دَيْنًا فَإِلَيَّ وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہ سے منقول ہے کہ بی کریم ﷺ نے فرمایا ’’میں ہر مومن کے لیے اس کی جان سے بھی قریب تر ہوں ‘ جو شخص فوت ہو جائے اور اس پر قرضہ ہو تو وہ میرے ذمے ہے اور جو مال چھوڑ جائے تو وہ اس کے وارثوں کا حق ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شواھد منھا الحدیث السابق (2954)`;