var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُرِضَهُ يَوْمَ أُحُدٍ وَهُوَ ابْنُ أَرْبَعَ عَشْرَةَ فَلَمْ يُجِزْهُ وَعُرِضَهُ يَوْمَ الْخَنْدَقِ وَهُوَ ابْنُ خَمْسَ عَشْرَةَ سَنَةً فَأَجَازَهُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ ا ن کو غزوہ احد کے دن نبی کریم ﷺ پر پیش کیا گیا جبکہ ان کی عمر چودہ سال تھی ‘ تو آپ ﷺ نے اجازت نہ دی۔اور پھر (اگلے سال) خندق کے موقع پر پیش کیا گیا جبکہ اس وقت ان کی عمر پندرہ سال تھی ‘ تو آپ ﷺ نے اجازت دے دی۔";
abudawood.hukam = "صحیح بخاری (4097)";
abudawood.description = ``;