var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ مَكْحُولٍ عَنْ غُضَيْفِ بْنِ الْحَارِثِ عَنْ أَبِي ذَرٍّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ وَضَعَ الْحَقَّ عَلَى لِسَانِ عُمَرَ يَقُولُ بِهِ";
abudawood.urdu = "سیدنا ابوذر غفاری رضی اللہ عنہ سے منقول ہے کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا ‘ آپ ﷺ فرماتے تھے ’’بلاشبہ اللہ تعالیٰ نے عمر کی زبان پر حق جاری فرما دیا ہے اور وہ حق ہی کہتے ہیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (6043)
أخرجہ ابن ماجہ (108) محمد بن إسحاق صرح بالسماع عند یعقوب الفارسي فی المعرفۃ والتاریخ (1/461) وللحدیث شواھد کثیرۃ جدًا`;