var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ عَنِ الْأَعْمَشِ،عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،قَالَتْ: جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ خَبَرَهَا،وَقَالَ: ثُمَّ اغْتَسِلِي،ثُمَّ تَوَضَّئِي لِكُلِّ صَلَاةٍ وَصَلِّي";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،وہ کہتی ہیں کہ فاطمہ بنت ابی حبیش رضی اللہ عنہا نبی کریم ﷺ کے پاس آئیں اور (راوی نے) ان کا واقعہ ذکر کیا۔آپ نے فرمایا ’’پھر غسل کرو اور پھر ہر نماز کے لیے وضو کرو اور نماز پڑھتی رہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (624)<br>الأعمش عنعن (تقدم: 14)<br>وحبیب بن أبي ثابت مدلس و عنعن (طبقات المدلسین: 69/ 3)`;
abudawood.anwaar = [25,1];