var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ بِهَذِهِ الْقِصَّةِ قَالَ وَلَمْ يُخْدِمْهَا";
abudawood.urdu = "امام زہری رحمہ اللہ نے بواسطہ علی بن حسین رحمہ اللہ یہ قصہ بیان کیا ہے اور کہا کہ نبی کریم ﷺ نے سیدہ فاطمہ رضی اللہ عنہا کو کوئی خادم نہیں دیا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل،علي بن حسین بن علي بن أبي طالب من التابعین،والزہري مدلس`;
abudawood.anwaar = [108,1];