var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ الْقَطَّانُ الْوَاسِطِيُّ،حَدَّثَنَا يَزِيدُ،عَنْ أَيُّوبَ بْنِ أَبِي مِسْكِينٍ عَنِ الْحَجَّاجِ،عَنْ أُمِّ كُلْثُومٍ،-عَنْ عَائِشَةَ-فِي الْمُسْتَحَاضَةِ-: تَغْتَسِلُ-تَعْنِي: مَرَّةً وَاحِدَةً-،ثُمَّ تَوَضَّأُ إِلَى أَيَّامِ أَقْرَائِهَا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مستحاضہ کے بارے میں مروی ہے کہ وہ غسل کرے یعنی ایک ہی بار۔پھر ایام حیض آنے تک وضو ہی کرتی رہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتی (300)، حجاج بن أرطاۃ لم ینفرد بہ تابعہ شبرمۃ`;