var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ الشَّعْبِيِّ قَالَ كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَهْمٌ يُدْعَى الصَّفِيَّ إِنْ شَاءَ عَبْدًا وَإِنْ شَاءَ أَمَةً وَإِنْ شَاءَ فَرَسًا يَخْتَارُهُ قَبْلَ الْخُمُسِ";
abudawood.urdu = "عامر شعبی رحمہ اللہ بیان کرتے ہیں کہ نبی کریم ﷺ کا غنیمت میں ایک خاص حصہ ہوا کرتا تھا جسے «صفی» کہا جاتا تھا۔(آپ ﷺ) چاہتے تو غلام لے لیتے یا لونڈی یا گھوڑا (اور یہ) خمس نکالنے سے پہلے لے سکتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4150)<br>السند صحیح إلی الشعبي لکنہ مرسل`;
abudawood.anwaar = [108,1];