var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ وَأَزْهَرُ قَالَا حَدَّثَنَا ابْنُ عَوْنٍ قَالَ سَأَلْتُ مُحَمَّدًا عَنْ سَهْمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالصَّفِيِّ قَالَ كَانَ يُضْرَبُ لَهُ بِسَهْمٍ مَعَ الْمُسْلِمِينَ وَإِنْ لَمْ يَشْهَدْ وَالصَّفِيُّ يُؤْخَذُ لَهُ رَأْسٌ مِنْ الْخُمُسِ قَبْلَ كُلِّ شَيْءٍ";
abudawood.urdu = "ابن عون کہتے ہیں کہ میں نے محمد بن سیرین رحمہ اللہ سے نبی کریم ﷺ کے حصے اور « <عربی> صفی </عربی> » کے متعلق دریافت کیا تو انہوں نے کہا: آپ ﷺ خواہ کسی جہاد میں شریک نہ بھی ہوتے آپ کا حصہ نکالا جاتا تھا اور خمس میں سے سب سے پہلے آپ کے لیے کوئی خاص چیز نکال لی جاتی تھی اور اسے « <عربی> صفی </عربی> » کہا جاتا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل،محمد بن سیر ین من التابعین`;
abudawood.anwaar = [108,2];