var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ السُّلَمِيُّ حَدَّثَنَا عُمَرُ يَعْنِي ابْنَ عَبْدِ الْوَاحِدِ عَنْ سَعِيدٍ يَعْنِي ابْنَ بَشِيرٍ عَنْ قَتَادَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا غَزَا كَانَ لَهُ سَهْمٌ صَافٍ يَأْخُذُهُ مِنْ حَيْثُ شَاءَهُ فَكَانَتْ صَفِيَّةُ مِنْ ذَلِكَ السَّهْمِ وَكَانَ إِذَا لَمْ يَغْزُ بِنَفْسِهِ ضُرِبَ لَهُ بِسَهْمِهِ وَلَمْ يُخَيَّرْ";
abudawood.urdu = "جناب قتادہ رحمہ اللہ بیان کرتے ہیں کہ سیدہ صفیہ رضی اللہ عنہا (ام المؤمنین) اسی حصے میں سے تھیں ‘ اور جب آپ خود شریک نہ ہوتے تو آپ کا حصہ رکھا جاتا تھا ‘ مگر وہ آپ سے منتخب نہ کرایا جاتا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن وھو من التابعین`;
abudawood.anwaar = [109,1];