var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ صَارَتْ صَفِيَّةُ لِدِحْيَةَ الْكَلْبِيِّ ثُمَّ صَارَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ سیدہ صفیہ رضی اللہ عنہا کو پہلے دحیہ کلبی رضی اللہ عنہ نے چنا تھا مگر بعد میں (ان کے پورے حالات گوش گزار کیے جانے کے بعد) رسول اللہ ﷺ کے حصے میں آ گئیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ ابن ماجہ (1957 وسندہ صحیح)`;