var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا إِسْرَائِيلُ عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ الْغَائِطِ قَالَ غُفْرَانَكَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ جب بیت الخلاء سے فارغ ہو کر نکلتے تو کہتے «غفرانک» اے اللہ! میں تیری بخشش چاہتا ہوں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (359)`;