var abudawood = {};
abudawood.arabic = "حَدَّثَنَا دَاوُدُ بْنُ مُعَاذٍ حَدَّثَنَا عَبْدُ الْوَارِثِ ح و حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ وَزِيَادُ بْنُ أَيُّوبَ أَنَّ إِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَهُمْ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزَا خَيْبَرَ فَأَصَبْنَاهَا عَنْوَةً فَجُمِعَ السَّبْيُ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے خیبر پر چڑھائی کی۔پس ہم نے اسے قہر و قوت سے حاصل کیا اور قیدی اکٹھے کئے۔";
abudawood.hukam = "صحیح بخاری (371) صحیح مسلم (1365 بعد ح 1427)";
abudawood.description = ``;