var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ افْتَتَحَ خَيْبَرَ عَنْوَةً بَعْدَ الْقِتَالِ وَنَزَلَ مَنْ نَزَلَ مِنْ أَهْلِهَا عَلَى الْجَلَاءِ بَعْدَ الْقِتَالِ";
abudawood.urdu = "ابن شہاب زہری کہتے ہیں مجھے یہ بات پہنچی ہے کہ رسول اللہ ﷺ نے خیبر کو قتال کر کے بزور قوت فتح کیا تھا۔اور قتال کے بعد اس کے کچھ لوگوں نے یہ علاقہ چھوڑ دینے کی شرط پر اپنی قلعہ بندی کو ختم کیا (اور صلح کر لی)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل،سعید بن المسیب وابن شہاب الزہري من التابعین<br>والحدیث السابق (الأصل : 3005) یغني عنہ`;
abudawood.anwaar = [110,1];