var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ خَمَّسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ ثُمَّ قَسَمَ سَائِرَهَا عَلَى مَنْ شَهِدَهَا وَمَنْ غَابَ عَنْهَا مِنْ أَهْلِ الْحُدَيْبِيَةِ";
abudawood.urdu = "جناب ابن شہاب زہری رحمہ اللہ کی روایت ہے کہ رسول اللہ ﷺ نے خیبر کا خمس نکالا پھر اس سب کو اہل حدیبیہ پر بانٹ دیا ‘ خواہ کوئی حاضر تھا یا غیرحاضر۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (3018)`;
abudawood.anwaar = [110,1];