var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ مُحَمَّدِ بْنِ أَبِي إِسْمَاعِيلَ وَهُوَ مُحَمَّدُ بْنُ رَاشِدٍ،عَنْ مَعْقِلٍ الْخَثْعَمِيِّ،عَنْ عَلِيٍّ رَضِي اللَّهُ عَنْه قَالَ: الْمُسْتَحَاضَةُ إِذَا انْقَضَى حَيْضُهَا،اغْتَسَلَتْ كُلَّ يَوْمٍ،وَاتَّخَذَتْ صُوفَةً فِيهَا سَمْنٌ أَوْ زَيْتٌ.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ بیان کرتے ہیں کہ مستحاضہ کا حیض جب ختم ہو جائے تو وہ ہر روز غسل کیا کرے اور تھوڑی سی اون گھی یا زیتون کے تیل میں تر کر کے حمول کر لیا کرے۔(یعنی فرج میں رکھ لیا کرے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>معقل الخثعمي: مجہول الحال،لم یوثقہ غیر ابن حبان،وقال ابن حجر: ’’مجہول‘‘ (تقریب: 6801)`;
abudawood.anwaar = [25,1];