var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عُمَرَ قَالَ لَوْلَا آخِرُ الْمُسْلِمِينَ مَا فُتِحَتْ قَرْيَةٌ إِلَّا قَسَمْتُهَا كَمَا قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ";
abudawood.urdu = "سیدنا عمر رضی اللہ عنہ نے کہا کہ اگر مجھے بعد میں آنے والے مسلمانوں کا خیال نہ ہو ‘ تو جو بستی بھی فتح ہو میں اسے تقسیم کر دوں جیسے کہ رسول اللہ ﷺ نے خیبر کو تقسیم کیا تھا۔";
abudawood.hukam = "صحیح بخاری (2334)";
abudawood.description = ``;