var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ،عَنْ مُحَمَّدِ بْنِ عُثْمَانَ،أَنَّهُ سَأَلَ الْقَاسِمَ بْنَ مُحَمَّدٍ،عَنْ الْمُسْتَحَاضَةِ؟ فَقَالَ: تَدَعُ الصَّلَاةَ أَيَّامَ أَقْرَائِهَا،ثُمَّ تَغْتَسِلُ فَتُصَلِّي،ثُمَّ تَغْتَسِلُ فِي الْأَيَّامِ.";
abudawood.urdu = "محمد بن عثمان نے قاسم بن محمد سے مستحاضہ کے بارے میں سوال کیا تو انہوں نے کہا کہ اپنے حیض کے دنوں میں نماز چھوڑے رہے،پھر (ان کے ختم ہونے پر) غسل کرے اور نماز پڑھنا شروع کر دے اور پھر ان دنوں کے درمیان (موقع بموقع) غسل کرتی رہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انفرد بہ ابو داود`;