var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا أَبُو أَحْمَدَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنْ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ وَالْأَوَّلُ أَتَمُّ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ،سیدنا عمر رضی اللہ عنہ سے نقل کرتے ہیں کہ سول اللہ ﷺ نے فرمایا۔اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔پہلی حدیث زیادہ مکمل ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3030)`;