var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا عُمَرُ يَعْنِي ابْنَ عَبْدِ الْوَاحِدِ قَالَ قَالَ سَعِيدٌ يَعْنِي ابْنَ عَبْدِ الْعَزِيزِ جَزِيرَةُ الْعَرَبِ مَا بَيْنَ الْوَادِي إِلَى أَقْصَى الْيَمَنِ إِلَى تُخُومِ الْعِرَاقِ إِلَى الْبَحْرِ";
abudawood.urdu = "جناب سعید بن عبدالعزیز رحمہ اللہ سے روایت ہے کہ جزیرہ عرب سے مراد (وہ علاقہ ہے) جو وادی القریٰ سے انتہائے یمن تک اور دوسری جانب حدود عراق سے لے کر سمندر تک ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;