var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ حَدَّثَنَا سَهْلُ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ عَنْ أَنَسِ بْنِ مَالِكٍ وَعَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ خَالِدَ بْنَ الْوَلِيدِ إِلَى أُكَيْدِرِ دُومَةَ فَأُخِذَ فَأَتَوْهُ بِهِ فَحَقَنَ لَهُ دَمَهُ وَصَالَحَهُ عَلَى الْجِزْيَةِ";
abudawood.urdu = "جناب عاصم بن عمر رحمہ اللہ،سیدنا انس بن مالک رضی اللہ عنہ سے مرفوعاً اور جناب عثمان بن ابی سلیمان رحمہ اللہ سے موقوفاً روایت کرتے ہیں کہ بی کریم ﷺ نے سیدنا خالد بن ولید (اور کچھ دوسرے صحابہ رضی اللہ عنہم) کو دومہ کے بادشاہ اکیدر کی طرف روانہ کیا،تو انہوں نے اسے پکڑ لیا اور (نبی کریم ﷺ کے پاس) لے آئے۔تو آپ ﷺ نے اس کا خون معاف کر دیا اور جزیہ کی ادائیگی پر صلح کر لی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن إسحاق عنعن`;
abudawood.anwaar = [111,1];