var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ،عَنْ مُعَاذٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا وَجَّهَهُ إِلَى الْيَمَنِ, أَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ حَالِمٍ-يَعْنِي: مُحْتَلِمًا-دِينَارًا،أَوْ عَدْلَهُ مِنَ الْمُعَافِرِيِّ.-ثِيَابٌ تَكُونُ بِالْيَمَنِ";
abudawood.urdu = "سیدنا معاذ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے جب انہیں یمن کی طرف روانہ کیا تو ان کو حکم دیا کہ ہر بالغ سے ایک دینار یا اس کے برابر معافری کپڑا وصول کریں۔یہ کپڑا اسی علاقے میں بنا جاتا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ترمذی (623) نسائی (2455) ابن ماجہ (1803)`;
abudawood.anwaar = [111,1];