var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ حَرْبِ بْنِ عُبَيْدِ اللَّهِ عَنْ جَدِّهِ أَبِي أُمِّهِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْعُشُورُ عَلَى الْيَهُودِ وَالنَّصَارَى وَلَيْسَ عَلَى الْمُسْلِمِينَ عُشُورٌ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ حَرْبِ بْنِ عُبَيْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ خَرَاجٌ مَكَانَ الْعُشُورِ";
abudawood.urdu = "حرب بن عبیداللہ رحمہ اللہ اپنے نانا (عمر ثقفی) سے اور وہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’دسواں حصہ (جزیہ اور ٹیکس) یہودیوں اور عیسائیوں پر ہے اور مسلمان پر کوئی دسواں نہیں ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حرب بن عبیداللّٰہ : لین الحدیث (تق : 1167)<br>وثقہ ابن حبان وحدہ`;
abudawood.anwaar = [111,1];