var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ ابْنُ عُبَيْدٍ الْمُحَارِبِيُّ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَطَاءِ بْنِ السَّائِبِ،عَنْ حَرْبِ بْنِ عُبَيْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِمَعْنَاهُ،قَالَ: خَرَاجٌ مَكَانَ: الْعُشُورِ.";
abudawood.urdu = "حرب بن عبیداللہ رحمہ اللہ،نبی کریم ﷺ سے روایت کرتے ہیں اور مذکورہ بالا حدیث کے ہم معنی بیان کیا اور اس روایت میں لفظ «عشور» کی بجائے «خراج» ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (3046)`;
abudawood.anwaar = [111,1];