var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ عَطَاءٍ عَنْ رَجُلٍ مِنْ بَكْرِ بْنِ وَائِلٍ عَنْ خَالِهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أُعَشِّرُ قَوْمِي قَالَ إِنَّمَا الْعُشُورُ عَلَى الْيَهُودِ وَالنَّصَارَى";
abudawood.urdu = "جناب عطاء،بکر بن وائل کے ایک آدمی سے اور وہ اپنے ماموں سے نقل کرتے ہیں کہ میں نے کہا: اے اللہ کے رسول! کیا میں اپنی قوم سے دسواں حصہ لیا کروں؟ آپ ﷺ نے فرمایا ’’یہ دسواں حصہ یہودیوں اور عیسائیوں پر ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن ورجل من بکر بن وائل،لعلہ حرب إلا فمجہول`;
abudawood.anwaar = [111,1];