var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ،حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا أَبُو بِشْرٍ،عَنْ عِكْرِمَةِ،أَنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ اسْتُحِيضَتْ،فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَنْتَظِرَ أَيَّامَ أَقْرَائِهَا،ثُمَّ تَغْتَسِلُ وَتُصَلِّي،فَإِنْ رَأَتْ شَيْئًا مِنْ ذَلِكَ تَوَضَّأَتْ وَصَلَّتْ.";
abudawood.urdu = "جناب عکرمہ بیان کرتے ہیں کہ سیدہ ام حبیبہ بنت جحش رضی اللہ عنہا کو استحاضہ شروع ہو گیا تو نبی کریم ﷺ نے اسے حکم دیا ’’اپنے ایام حیض (کے ختم ہونے) کا انتظار کرے۔پھر غسل کرے اور نماز پڑھنا شروع کر دے۔اگر (خون کے علاوہ) کوئی حدث محسوس کرے تو وضو کرے اور نماز پڑھے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>وقال الخطابي: ’’وھذا الحدیث منقطع،عکرمۃ لم یسمع من أم حبیبۃ بنت جحش‘‘ (معالم السنن 1/ 80)<br>ولأصل الحدیث شواھد کثیرۃ`;
abudawood.anwaar = [25,2];