var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ عَنْ جَرِيرٍ عَنْ قَابُوسَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى الْمُسْلِمِ جِزْيَةٌ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ سُئِلَ سُفْيَانُ عَنْ تَفْسِيرِ هَذَا فَقَالَ إِذَا أَسْلَمَ فَلَا جِزْيَةَ عَلَيْهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’مسلمان پر جزیہ نہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (633)<br>قابوس ضعیف تقدم حالہ (3032) وھذا طرف منہ`;
abudawood.anwaar = [112,1];