var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا مُعَاوِيَةُ بِمَعْنَى إِسْنَادِ أَبِي تَوْبَةَ وَحَدِيثِهِ قَالَ عِنْدَ قَوْلِهِ مَا يَقْضِي عَنِّي فَسَكَتَ عَنِّي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاغْتَمَزْتُهَا";
abudawood.urdu = "محمود بن خالد نے مروان بن محمد سےانہوں نے معاویہ بن سلام سے روایت کیا۔اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔اور جہاں یہ آیا ہے کہ «ما یقضی عنی ***» ’’میں بھاگ جاتا ہوں اور مسلمان قبائل کے پاس چلا جاتا ہوں حتیٰ کہ اللہ اپنے رسول کو کچھ عنایت فرما دے جس سے میرا قرضہ ادا ہو جائے۔‘‘ (اس روایت میں ہے کہ) رسول اللہ ﷺ مجھ سے خاموش ہو رہے اور مجھے اس سے بڑی گرانی ہوئی۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (3055)`;