var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانُ عَنْ قَتَادَةَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عِيَاضِ بْنِ حِمَارٍ قَالَ أَهْدَيْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاقَةً فَقَالَ أَسْلَمْتَ فَقُلْتُ لَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي نُهِيتُ عَنْ زَبْدِ الْمُشْرِكِينَ";
abudawood.urdu = "سیدنا عیاض بن حماد رضی اللہ عنہ سے مروی ہے وہ کہتے ہیں کہ علیہ وسلم کی خدمت میں بطور ہدیہ ایک اونٹنی پیش کی تو آپ ﷺ نے پوچھا ’’کیا تم نے اسلام قبول کر لیا ہے؟‘‘ میں کہا: نہیں تو نبی کریم ﷺ نے فرمایا ’’مجھے مشرکین کے عطایا قبول کرنے سے روکا گیا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شاھد عند أحمد (3/402 وسندہ حسن)`;