var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَهُ أَرْضًا بِحَضْرَمُوتَ حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ بِإِسْنَادِهِ مِثْلَهُ";
abudawood.urdu = "سیدنا علقمہ بن وائل اپنے والد (سیدنا وائل بن حجر رضی اللہ عنہ) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے حضر موت کے علاقے میں ایک قطعہ زمین انہیں عطا فرمایا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (1381 وسندہ صحیح)`;