var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،أَخْبَرَنَا اللَّيْثُ،عَنْ رَبِيعَةَ،أَنَّهُ كَانَ لَا يَرَى عَلَى الْمُسْتَحَاضَةِ وُضُوءًا عِنْدَ كُلِّ صَلَاةٍ،إِلَّا أَنْ يُصِيبَهَا حَدَثٌ غَيْرُ الدَّمِ،فَتَوَضَّأُ.\nقَالَ أَبُو دَاوُد: هَذَا قَوْلُ مَالِكٍ يَعْنِي ابْنَ أَنَسٍ.";
abudawood.urdu = "ربیعہ (ربیعہ بن عبدالرحمٰن،المعروف ربیعہ الرای،تابعی) سے منقول ہے کہ وہ مستحاضہ پر ہر نماز کے لیے تجدید وضو کے قائل نہ تھے،الا یہ کہ اسے خون کے علاوہ کوئی اور حدث لاحق ہو تو وضو کرے۔امام ابوداؤد رحمہ اللہ بیان کرتے ہیں کہ جناب مالک بن انس کا بھی یہی قول ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انفرد بہ ابو داود`;