var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ فِطْرٍ حَدَّثَنِي أَبِي عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ خَطَّ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَارًا بِالْمَدِينَةِ بِقَوْسٍ وَقَالَ أَزِيدُكَ أَزِيدُكَ";
abudawood.urdu = "سیدنا عمرو بن حریث رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے مدینہ منورہ میں مجھے ایک گھر عنایت فرمایا جسے آپ ﷺ نے اپنی قوس سے ناپا اور فرمایا تھا ’’میں تجھے اور بھی دوں گا ‘ اور بھی دوں گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو فطر خلیفۃ المخزومي : لین الحدیث (تقریب التہذیب: 1749)`;
abudawood.anwaar = [112,1];