var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ غَيْرِ وَاحِدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ بِلَالَ بْنَ الْحَارِثِ الْمُزَنِيَّ مَعَادِنَ الْقَبَلِيَّةِ وَهِيَ مِنْ نَاحِيَةِ الْفُرْعِ فَتِلْكَ الْمَعَادِنُ لَا يُؤْخَذُ مِنْهَا إِلَّا الزَّكَاةُ إِلَى الْيَوْمِ";
abudawood.urdu = "جناب ربیعہ بن ابی عبدالرحمٰن کئی ایک سے روایت کرتے ہیں کہ نبی کریم ﷺ نے سیدنا بلال بن حارث مزنی رضی اللہ عنہ کو فرع کے اطراف میں مقام قبل کی کانیں عطا فرمائی تھیں۔ان کانوں سے آج تک سوائے زکوٰۃ کے اور کچھ نہیں لیا جاتا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (1812)
وللحدیث شاھد عند ابن الجارود (371 وسندہ حسن)`;