var abudawood = {};
abudawood.arabic = "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ،قَالَ: قَالَ مُحَمَّدُ بْنُ الْحَسَنِ الْمَخْزُومِيُّ،مَا لَمْ تَنَلْهُ أَخْفَافُ الْإِبِلِ.-يَعْنِي أَنَّ الْإِبِلَ تَأْكُلُ مُنْتَهَى رُءُوسِهَا وَيُحْمَى مَا فَوْقَهُ-.";
abudawood.urdu = "جناب محمد بن حسن مخزومی نے کہا کہ رسول اللہ ﷺ کے فرمان ’’وہ جنہیں اونٹوں کے پاؤں نہ پہنچتے ہوں۔‘‘ سے مراد یہ ہے کہ عام چرتے ہوئے اونٹ ان درختوں سے ‘ جہاں تک کہ ان کے منہ پہنچتے ہیں ‘ کھاتے ہیں ‘ تو تم انہیں روک نہیں سکتے ہو ‘ البتہ ان سے اوپر کو تم اپنی ملکیت میں لے سکتے ہو۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `سندہ صحیح إلٰی محمد بن الحسن المخزومي وھو متھم بالکذب بنفسہ`;