var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ آدَمَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ الزُّبَيْرَ نَخْلًا";
abudawood.urdu = "سیدہ اسماء بنت ابی بکر رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے (ان کے شوہر) زبیر (زبیر بن عوام رضی اللہ عنہ) کو کھجور کا ایک باغ عنایت فرمایا تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2997)
وللحدیث شواھد عند البخاري (5224) ومسلم (2182)`;