var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،أَخْبَرَنَا حَمَّادٌ،عَنْ قَتَادَةَ،عَنْ أُمِّ الْهُذَيْلِ،عَنْ أُمِّ عَطِيَّةَ-وَكَانَتْ بَايَعَتِ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ-،قَالَتْ: كُنَّا لَا نَعُدُّ الْكُدْرَةَ وَالصُّفْرَةَ بَعْدَ الطُّهْرِ شَيْئًا.";
abudawood.urdu = "سیدہ ام عطیہ رضی اللہ عنہا سے روایت ہے اور انہوں نے نبی کریم ﷺ سے بیعت کی تھی،بیان کرتی ہیں کہ ہم طہر شروع ہو جانے کے بعد میلے یا پیلے سے پانی آنے کو کچھ نہ سمجھتی تھیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتي (308)`;