var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ الزُّبَيْرَ حُضْرَ فَرَسِهِ فَأَجْرَى فَرَسَهُ حَتَّى قَامَ ثُمَّ رَمَى بِسَوْطِهِ فَقَالَ أَعْطُوهُ مِنْ حَيْثُ بَلَغَ السَّوْطُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے سیدنا زبیر (زبیر بن عوام رضی اللہ عنہ) کو جاگیر دی جہاں تک کہ ان کا گھوڑا دوڑ سکے۔چنانچہ انہوں نے اپنا گھوڑا دوڑایا حتیٰ کہ وہ کھڑا ہو گیا ‘ تو پھر انہوں نے اپنا کوڑا پھینک دیا۔پس آپ ﷺ نے فرمایا ’’جہاں تک ان کا کوڑا پہنچا ‘ انہیں دے دو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2998)
عبد اللہ العمري حسن الحدیث عن نافع و ضعیف الحدیث عن غیرہ`;