var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ،حَدَّثَنَا وَهْبٌ،عَنْ أَبِيهِ عَنِ ابْنِ إِسْحَاقَ بِإِسْنَادِهِ وَمَعْنَاهُ،إِلَّا أَنَّهُ قَالَ: عِنْدَ قَوْلِهِ مَكَانَ الَّذِي،حَدَّثَنِي هَذَا فَقَالَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-وَأَكْثَرُ ظَنِّي أَنَّهُ أَبُو سَعِيدٍ الْخُدْرِيُّ-: فَأَنَا رَأَيْتُ الرَّجُلَ يَضْرِبُ فِي أُصُولِ النَّخْلِ.";
abudawood.urdu = "جناب ابن اسحٰق نے اپنی سند سے مذکورہ بالا حدیث کے ہم معنی بیان کیا ‘ لیکن انہوں نے «الذی حدثنی ہذا» ’’جس نے مجھے یہ حدیث بیان کی‘‘ کے بجائے یوں کہا: مجھے اصحاب نبی ﷺ میں سے ایک شخص نے بیان کیا اور میرا غالب گمان یہ ہے کہ وہ سیدنا ابوسعید خدری رضی اللہ عنہ ہیں۔تو میں نے اس آدمی کو دیکھا کہ وہ کھجوروں کی جڑوں پر (کلہاڑا) مار رہا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (3074)`;
abudawood.anwaar = [113,1];