var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحَاطَ حَائِطًا عَلَى أَرْضٍ فَهِيَ لَهُ";
abudawood.urdu = "جناب عروہ بن زبیر رحمہ اللہ سے روایت ہے ‘ وہ کہتے ہیں میں گواہی دیتا ہوں کہ رسول اللہ ﷺ نے فیصلہ کیا تھا کہ زمین اﷲ کی ہے اور بندے بھی اﷲ کے ہیں ‘ تو جس نے کوئی بنجر لاوارث زمین آباد کی ‘ تو وہی اس کا مالک ہے۔ہمیں یہ بات نبی کریم ﷺ سے انہی لوگوں نے بیان کی ہے جنہوں نے آپ ﷺ سے نمازوں کے احکام بیان کیے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی فی الکبریٰ (5763)<br>قتادۃ مدلس وعنعن<br>ومع ذلک صححہ ابن الجا رود (1015) !`;
abudawood.anwaar = [113,1];