var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ قَالَ هِشَامٌ الْعِرْقُ الظَّالِمُ أَنْ يَغْرِسَ الرَّجُلُ فِي أَرْضِ غَيْرِهِ فَيَسْتَحِقَّهَا بِذَلِكَ قَالَ مَالِكٌ وَالْعِرْقُ الظَّالِمُ كُلُّ مَا أُخِذَ وَاحْتُفِرَ وَغُرِسَ بِغَيْرِ حَقٍّ";
abudawood.urdu = "جناب ہشام (ہشام بن عروہ) رحمہ اللہ بیان کرتے ہیں کہ «عرق الظالم» ’’ظالم رگ‘‘ کا مفہوم یہ ہے کہ یہ کوئی شخص کسی دوسرے کی زمین میں درخت لگا دے اور پھر اسی وجہ سے اس زمین کا مدعی بن جائے۔امام مالک رحمہ اللہ فرماتے ہیں کہ «عرق الظالم» سے مراد ہر وہ چیز ہے جو کسی سے بلا استحقاق (ظلم سے) چھین لی جائے ‘ وہاں کنواں";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;