var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا إِسْمَاعِيلُ،أَخْبَرَنَا أَيُّوبُ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أُمِّ عَطِيَّةَ بِمِثْلِهِ. قَالَ أبو دَاود: أُمُّ الْهُذَيْلِ هِيَ حَفْصَةُ بِنْتُ سِيرِينَ كَانَ ابْنُهَا اسْمُهُ هُذَيْلٌ وَاسْمُ زَوْجِهَا عَبْدُ الرَّحْمَنِ.";
abudawood.urdu = "جناب محمد بن سیرین نے سیدہ ام عطیہ رضی اللہ عنہا سے اسی کے مثل روایت کیا ہے۔امام ابوداؤد رحمہ اللہ نے کہا: ام ہذیل سے مراد حفصہ بنت سیرین ہیں۔ان کے بیٹے کا نام ہذیل اور شوہر کا نام عبدالرحمٰن تھا۔";
abudawood.hukam = "صحیح بخاری (326)";
abudawood.description = ``;