var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ أَخْبَرَنَا مُحَمَّدُ ابْنُ عِيسَى يَعْنِي ابْنَ سُمَيْعٍ حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ حَدَّثَنِي أَبُو عَبْدِ اللَّهِ عَنْ مُعَاذٍ أَنَّهُ قَالَ مَنْ عَقَدَ الْجِزْيَةَ فِي عُنُقِهِ فَقَدْ بَرِئَ مِمَّا عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "سیدنا معاذ رضی اللہ عنہ سے روایت ہے انہوں نے کہا کہ جس نے اپنی گردن میں جزیے کا قلادہ ڈالا وہ رسول اللہ ﷺ کے طریقے سے بری ہو گیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مسلم أبو عبد اللّٰہ الخزاعي لم أجد من وثقہ وھو مقبول (أي مجہول الحال) انظر التقریب (6658) وفي سماعہ من معاذ رضي اللّٰہ عنہ نظر`;
abudawood.anwaar = [113,1];