var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ الصَّعْبِ بْنِ جَثَّامَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا حِمَى إِلَّا لِلَّهِ وَلِرَسُولِهِ قَالَ ابْنُ شِهَابٍ وَبَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَمَى النَّقِيعَ";
abudawood.urdu = "سیدنا صعب بن جثامہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’کوئی چراگاہ نہیں ‘ مگر اﷲ اور اس کے رسول کے لیے۔‘‘ ابن شہاب رحمہ اللہ کہتے ہیں: مجھے یہ بات پہنچی ہے کہ رسول اللہ ﷺ نے موضع نقیع کو بطور چراگاہ محفوظ فرمایا ہوا تھا۔";
abudawood.hukam = "صحیح بخاری (2370)";
abudawood.description = ``;