var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ الصَّعْبِ بْنِ جَثَّامَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَمَى النَّقِيعَ وَقَالَ لَا حِمَى إِلَّا لِلَّهِ عَزَّ وَجَلَّ";
abudawood.urdu = "سیدنا صعب بن جثامہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے موضع نقیع کو بطور چراگاہ محفوظ کیا ہوا تھا اور فرمایا ’’«حمی» صرف اللہ عزوجل کے لیے ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3083)`;