var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ وَأَبِي سَلَمَةَ سَمِعَا أَبَا هُرَيْرَةَ يُحَدِّثُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الرِّكَازِ الْخُمُسُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’مال مدفون (حاصل ہو تو اس) میں پانچواں حصہ ہے۔‘‘ (بیت المال میں عام مسلمانوں کی منفعت کے لیے دے ‘ کیونکہ یہ بلا مشقت حاصل ہوا ہے۔)";
abudawood.hukam = "صحیح بخاری (1499) صحیح مسلم (1710)";
abudawood.description = ``;