var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ،حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ،عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنِ الشَّيْبَانِيِّ،عَنْ عِكْرِمَةَ،قَالَ: كَانَتْ أُمُّ حَبِيبَةَ تُسْتَحَاضُ،فَكَانَ زَوْجُهَا يَغْشَاهَا قَالَ أبو دَاود: و قَالَ يَحْيَى بْنُ مَعِينٍ مُعَلَّى ثِقَةٌ وَكَانَ أَحْمَدُ بْنُ حَنْبَلٍ لَا يَرْوِي عَنْهُ, لِأَنَّهُ كَانَ يَنْظُرُ فِي الرَّأْيِ .";
abudawood.urdu = "جناب عکرمہ نے بیان کیا کہ سیدہ ام حبیبہ رضی اللہ عنہا کو استحاضہ ہوتا تھا اور ان کا شوہر ان سے مجامعت کیا کرتا تھا۔امام ابوداؤد رحمہ اللہ نے کہا: یحییٰ بن معین نے معلی کو ثقہ کہا ہے۔جب کہ امام احمد بن حنبل رحمہ اللہ اس سے کچھ روایت نہ کرتے تھے کیونکہ وہ رائے اور قیاس کی طرف مائل تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف لإرسالہ<br>وانظر (ح 305)`;
abudawood.anwaar = [26,1];