var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي لَيْسَ بِرَاكِبِ بَغْلٍ وَلَا بِرْذَوْنٍ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ میری عیادت کے لیے تشریف لاتے ‘ بغیر اس کے کہ کسی خچر پر سوار ہوں یا گھوڑے پر۔";
abudawood.hukam = "صحیح بخاری (5664)";
abudawood.description = ``;