var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا شُعْبَةُ عَنِ الْحَكَمِ،عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ،عَنْ عَلِيٍّ قَال:َ مَا مِنْ رَجُلٍ يَعُودُ مَرِيضًا مُمْسِيًا, إِلَّا خَرَجَ مَعَهُ سَبْعُونَ أَلْفَ مَلَكٍ يَسْتَغْفِرُونَ لَهُ،حَتَّى يُصْبِحَ،وَكَانَ لَهُ خَرِيفٌ فِي الْجَنَّةِ،وَمَنْ أَتَاهُ مُصْبِحًا, خَرَجَ مَعَهُ سَبْعُونَ أَلْفَ مَلَكٍ،يَسْتَغْفِرُونَ لَهُ،حَتَّى يُمْسِيَ،وَكَانَ لَهُ خَرِيفٌ فِي الْجَنَّةِ.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ جو شخص شام کے وقت کسی مریض کی عیادت کے لیے نکلتا ہے تو اس کے ساتھ ستر ہزار فرشتے بھی نکلتے ہیں جو اس کے لیے صبح تک بخشش طلب کرتے رہتے ہیں اور جنت میں اسے ایک باغ بھی حاصل ہو گا ‘ اور جو کوئی صبح کے وقت عیادت کے لیے نکلے تو اس کے ساتھ ستر ہزار فرشتے نکلتے ہیں جو اس کے لیے شام تک بخشش مانگتے رہتے ہیں اور جنت میں اسے ایک باغ بھی حاصل ہو گا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الحکم بن عتیبۃ عنعن`;
abudawood.anwaar = [115,1];