var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ الرَّازِيُّ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْجَهْمِ،حَدَّثَنَا عَمْرُو بْنُ أَبِي قَيْسٍ،عَنْ عَاصِمٍ،عَنْ عِكْرِمَةَ،عَنْ حَمْنَةَ بِنْتِ جَحْشٍ،أَنَّهَا كَانَتْ مُسْتَحَاضَةً،وَكَانَ زَوْجُهَا يُجَامِعُهَا";
abudawood.urdu = "جناب عکرمہ،حمنہ بنت حجش رضی اللہ عنہا سے روایت کرتے ہیں کہ انہیں استحاضہ آتا تھا اور ان کا شوہر ان سے مباشرت کرتا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر (ح 305)`;
abudawood.anwaar = [26,1];