var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ لَمَّا أُصِيبَ سَعْدُ بْنُ مُعَاذٍ يَوْمَ الْخَنْدَقِ رَمَاهُ رَجُلٌ فِي الْأَكْحَلِ فَضَرَبَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْمَةً فِي الْمَسْجِدِ لِيَعُودَهُ مِنْ قَرِيبٍ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ سیدنا سعد بن معاذ رضی اللہ عنہ جنگ خندق میں زخمی ہو گئے۔ایک آدمی نے ان کے بازو کی رگ (رگ ہفت اندام) پر نشانہ مارا تھا تو رسول اللہ ﷺ نے ان کے لیے مسجد میں خیمہ لگوا لیا تاکہ قریب سے ان کی عیادت کرتے رہیں۔";
abudawood.hukam = "صحیح بخاری (463) صحیح مسلم (1769)";
abudawood.description = ``;