var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ يُونُسَ بْنِ أَبِي إِسْحَقَ عَنْ أَبِيهِ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ عَادَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ وَجَعٍ كَانَ بِعَيْنِي";
abudawood.urdu = "سیدنا زید بن ارقم رضی اللہ عنہ سے روایت ہے کہتے ہیں کہ رسول اللہ ﷺ میری عیادت کے لیے تشریف لائے جبکہ میری آنکھ میں درد تھا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (1551)
أبو إسحاق السبیعي صرح بالسماع عند البخاري فی الأدب المفرد (532 وسندہ صحیح)`;