var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ كَثِيرٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَطْعِمُوا الْجَائِعَ وَعُودُوا الْمَرِيضَ وَفُكُّوا الْعَانِيَ قَالَ سُفْيَانُ وَالْعَانِي الْأَسِيرُ";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’بھوکے کو کھانا کھلاؤ،مریض کی بیمار پرسی کرو اور قیدی کو چھڑاو۔‘‘ سفیان نے وضاحت کی کہ «العانی» سے مراد قیدی ہے۔";
abudawood.hukam = "صحیح بخاری (5373)";
abudawood.description = ``;