var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا أَبُو دَاوُدَ يَعْنِي الطَّيَالِسِيَّ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ... فَذَكَرَ مِثْلَهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’تم میں سے کوئی شخص ہرگز ہرگز موت کی تمنا نہ کرے۔‘‘ اور مذکورہ بالا روایت کے مثل بیان کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;