var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ مَنْصُورٍ عَنْ تَمِيمِ بْنِ سَلَمَةَ أَوْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ عُبَيْدِ بْنِ خَالِدٍ السُّلَمِيِّ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَرَّةً عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ مَرَّةً عَنْ عُبَيْدٍ قَالَ مَوْتُ الْفَجْأَةِ أَخْذَةُ أَسِفٍ";
abudawood.urdu = "سیدنا عبید بن خالد سلمی رضی اللہ عنہ سے روایت ہے جو کہ نبی کریم ﷺ کے صحابہ میں سے تھے انہوں (مسدد) نے ایک بار نبی کریم ﷺ سے اور ایک بار عبید سے روایت کیا: ’’اچانک موت ناراضی کی پکڑ ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;