var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَبْلَ مَوْتِهِ بِثَلَاثٍ قَالَ لَا يَمُوتُ أَحَدُكُمْ إِلَّا وَهُوَ يُحْسِنُ الظَّنَّ بِاللَّهِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ ﷺ کو سنا ‘ آپ ﷺ نے اپنی وفات سے تین روز پہلے فرمایا تھا ’’تم میں سے کسی کی موت نہ آئے مگر اس حال میں کہ وہ اللہ کے ساتھ عمدہ گمان رکھتا ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (2877)";
abudawood.description = ``;