var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَالِكُ بْنُ عَبْدِ الْوَاحِدِ الْمِسْمَعِيُّ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ حَدَّثَنِي صَالِحُ بْنُ أَبِي عَرِيبٍ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ آخِرُ كَلَامِهِ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ";
abudawood.urdu = "سیدنا معاذ بن جبل رضی اللہ عنہ سے رویت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس کی آخری بات «لا إلہ إلا اللہ» ہو وہ جنت میں داخل ہو گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1621)
وللحدیث شواھد عند ابن حبان (719) وغیرہ`;