var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرٌ حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ حَدَّثَنَا يَحْيَى بْنُ عُمَارَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِّنُوا مَوْتَاكُمْ قَوْلَ لَا إِلَهَ إِلَّا اللَّهُ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اپنے مرنے والوں کو کلمہ «لا إلہ إلا اللہ» کی تلقین کرو۔‘‘";
abudawood.hukam = "صحیح مسلم (916)";
abudawood.description = ``;