var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ لَمَّا قُتِلَ زَيْدُ بْنُ حَارِثَةَ وَجَعْفَرٌ وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ يُعْرَفُ فِي وَجْهِهِ الْحُزْنُ وَذَكَرَ الْقِصَّةَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے وہ بیان کرتی ہیں کہ جب سیدنا زید بن حارثہ ‘ جعفر بن ابی طالب اور عبداللہ بن رواحہ رضی اللہ عنہم کی شہادتیں ہوئیں تو رسول اللہ ﷺ مسجد میں بیٹھ گئے۔آپ ﷺ کے چہرے پر غم کے اثرات نمایاں تھے۔اور (راوی نے) قصہ بیان کیا۔";
abudawood.hukam = "صحیح بخاری (1305) صحیح مسلم (935)";
abudawood.description = ``;