var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ عَطِيَّةَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّائِحَةَ وَالْمُسْتَمِعَةَ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے انہوں نے کہا کہ رسول اللہ ﷺ نے نوحہ کرنے والی اور اسے سننے والی پر لعنت فرمائی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قال أبو حاتم الرازي: ’’ حدیث منکر،محمد بن الحسن (بن عطیۃ العوفي) وأبوہ وجدہ،ضعفاء فی الحدیث ‘‘ (علل الحدیث 369/1 ح 1095)<br>وانظر حدیث : 452 لضعف عطیۃ العوفي`;
abudawood.anwaar = [115,1];