var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي جَعْفَرُ بْنُ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اصْنَعُوا لِآلِ جَعْفَرٍ طَعَامًا فَإِنَّهُ قَدْ أَتَاهُمْ أَمْرٌ شَغَلَهُمْ";
abudawood.urdu = "سیدنا عبداللہ بن جعفر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا تھا ’’آل جعفر کے لیے کھانا تیار کرو بلاشبہ انہیں ایک ایسا معاملہ درپیش ہے جس نے انہیں مشغول کر دیا ہے۔‘‘ (ان کے پاس سیدنا جعفر رضی اللہ عنہ کی شہادت کی خبر آئی تھی۔)";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (1739)
أخرجہ الترمذي (998 وسندہ حسن) وابن ماجہ (1610 وسندہ حسن) سفیان بن عیینۃ صرح بالسماع عند الحمیدي والحاکم (1/372)`;