var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ وَعِيسَى بْنُ يُونُسَ قَالَا حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلَى أُحُدٍ أَنْ يُنْزَعَ عَنْهُمْ الْحَدِيدُ وَالْجُلُودُ وَأَنْ يُدْفَنُوا بِدِمَائِهِمْ وَثِيَابِهِمْ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے شہدائے احد کے متعلق فرمایا تھا ’’ان کے ہتھیار اور (چمڑے کی) پوستین اتار لیے جائیں اور انہیں ان کے خونوں اور کپڑوں ہی میں دفن کیا جائے۔‘‘ یہ الفاظ زیاد بن ایوب کے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1515)<br>عطاء بن السائب اختلط وعلي بن عاصم ضعیف (انظر ضعیف سنن الترمذي : 1073)`;
abudawood.anwaar = [115,2];