var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا أُسَامَةُ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِحَمْزَةَ وَقَدْ مُثِّلَ بِهِ وَلَمْ يُصَلِّ عَلَى أَحَدٍ مِنْ الشُّهَدَاءِ غَيْرِهِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ سیدنا حمزہ رضی اللہ عنہ کے پاس سے گزرے (اور دیکھا کہ) ان کا مثلہ کیا گیا ہے تو آپ ﷺ نے ان کے سوا کسی اور کا جنازہ نہیں پڑھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الزھري مدلس وعنعن`;
abudawood.anwaar = [116,1];