var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أُخْبِرْتُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُبْرِزْ فَخِذَكَ وَلَا تَنْظُرَنَّ إِلَى فَخِذِ حَيٍّ وَلَا مَيِّتٍ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’اپنی ران عریاں نہ کر اور نہ کبھی کسی زندہ یا میت کی ران کو دیکھ۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف جدًا<br>ابن ماجہ (1460) والحدیث الآتي (4015)<br>حبیب عنعن والواسطۃ بینہ وبین شیخہ ھو عمرو بن خالد الواسطي والواسطي متروک رماہ وکیع بالکذب (تق : 5021)`;
abudawood.anwaar = [116,1];