var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا عَبْدُ الْأَعْلَى،حَدَّثَنَا هِشَامٌ،عَنْ حَفْصَةَ بِنْتِ سِيرِينَ،عَنْ أُمِّ عَطِيَّةَ،قَالَتْ: وَضَفَّرْنَا رَأْسَهَا ثَلَاثَةَ قُرُونٍ،ثُمَّ أَلْقَيْنَاهَا خَلْفَهَا, مُقَدَّمَ رَأْسِهَا وَقَرْنَيْهَا.";
abudawood.urdu = "سیدہ ام عطیہ رضی اللہ عنہا بیان کرتی ہیں کہ ہم نے ان کے بالوں کی تین لٹیں بٹ دیں اور پھر ان لٹوں کو ان (محترمہ) کے پیچھے ڈال دیا،یعنی سر کے آگے کے بال اور دونوں اطراف والے۔";
abudawood.hukam = "صحیح بخاری (1263) صحیح مسلم (939)";
abudawood.description = ``;