var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا إِسْمَاعِيلُ،حَدَّثَنَا خَالِدٌ،عَنْ حَفْصَةَ بِنْتِ سِيرِينَ،عَنْ أُمِّ عَطِيَّةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُنَّ فِي غُسْلِ ابْنَتِه:ِ ابْدَأْنَ بِمَيَامِنِهَا،وَمَوَاضِعِ الْوُضُوءِ مِنْهَا.";
abudawood.urdu = "سیدہ ام عطیہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے انہیں اپنی صاحبزادی کے غسل کے بارے میں فرمایا تھا ’’ان کی دائیں اطراف اور اعضائے وضو سے غسل شروع کریں۔‘‘";
abudawood.hukam = "صحیح بخاری (167) صحیح مسلم (939)";
abudawood.description = ``;