var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا حَمَّادٌ،عَنْ أَيُّوبَ،عَنْ مُحَمَّدٍ،عَنْ أُمِّ عَطِيَّةَ بِمَعْنَى حَدِيثِ مَالِكٍ زَادَ فِي حَدِيثِ حَفْصَةَ،عَنْ أُمِّ عَطِيَّةَ... بِنَحْوِ هَذَا وَزَادَتْ فِيهِ: أَوْ سَبْعًا،أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّهُ.";
abudawood.urdu = "محمد بن سیرین رحمہ اللہ نے ام عطیہ رضی اللہ عنہا سے حدیث بیان کی جو امام مالک رحمہ اللہ کی روایت کے ہم معنی ہے۔اور حدیث حفصہ (حفصہ بنت سیرین) جو ام عطیہ رضی اللہ عنہا سے مروی ہے اس میں بھی اسی کی مانند ہے،لیکن اس میں یہ اضافہ ہے۔’’یا سات بار غسل دو یا اس سے زیادہ اگر ضرورت محسوس کرو۔‘‘";
abudawood.hukam = "صحیح بخاری (1253) صحیح مسلم (939)";
abudawood.description = ``;