var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ أَنَّهُ كَانَ يَأْخُذُ الْغُسْلَ عَنْ أُمِّ عَطِيَّةَ يَغْسِلُ بِالسِّدْرِ مَرَّتَيْنِ وَالثَّالِثَةَ بِالْمَاءِ وَالْكَافُورِ";
abudawood.urdu = "جناب محمد بن سیرین رحمہ اللہ غسل میت کی روایت سیدہ ام عطیہ رضی اللہ عنہا سے بیان کیا کرتے تھے۔(یا غسل میت کا طریقہ انہوں نے سیدہ ام عطیہ رضی اللہ عنہا سے سیکھا تھا) اور وہ میت کو دو بار بیری کے پانی سے نہلاتے اور تیسری بار کافور ملے پانی سے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن<br>والحدیث السابق (الأصل : 3142) یغني عنہ`;
abudawood.anwaar = [116,1];