var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ أُدْرِجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَوْبٍ حِبَرَةٍ ثُمَّ أُخِّرَ عَنْهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ کو (پہلے) «حبرۃ» (منقش دھاری دار چادر کا) کفن پہنایا گیا تھا مگر اسے اتار لیا گیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شاھد عند مسلم (941)`;