var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا إِسْمَعيِلُ يَعْنِي ابْنَ عَبْدِ الْكَرِيمِ حَدَّثَنِي إِبْرَاهِيمُ بْنُ عَقِيلِ بْنِ مَعْقِلٍ عَنْ أَبِيهِ عَنْ وَهْبٍ يَعْنِي ابْنَ مُنَبِّهٍ عَنْ جَابِرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا تُوُفِّيَ أَحَدُكُمْ فَوَجَدَ شَيْئًا فَلْيُكَفَّنْ فِي ثَوْبٍ حِبَرَةٍ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’ہم میں سے جب کوئی فوت ہو جائے اور اسے وسعت حاصل ہو،تو چاہیئے کہ اس کا کفن «حبرۃ» (منقش دھاری دار چادر) کا ہو۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `وللحدیث شاھد عند أحمد (3/319)`;