var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ هِشَامٍ قَالَ،أَخْبَرَنِي أَبِي أَخْبَرَتْنِي عَائِشَةُ،قَالَتْ: كُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ يَمَانِيَةٍ بِيضٍ،لَيْسَ فِيهَا قَمِيصٌ،وَلَا عِمَامَةٌ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ کو تین سفید یمنی کپڑوں میں کفن دیا گیا تھا ‘ ان میں قمیص تھی ‘ نہ پگڑی۔";
abudawood.hukam = "صحیح بخاری (1272) صحیح مسلم (941)";
abudawood.description = ``;