var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ يَزِيدَ يَعْنِي ابْنَ أَبِي زِيَادٍ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ نَجْرَانِيَّةٍ الْحُلَّةُ ثَوْبَانِ وَقَمِيصُهُ الَّذِي مَاتَ فِيهِ قَالَ أَبُو دَاوُد قَالَ عُثْمَانُ فِي ثَلَاثَةِ أَثْوَابٍ حُلَّةٍ حَمْرَاءَ وَقَمِيصِهِ الَّذِي مَاتَ فِيهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ کو تین نجرانی کپڑوں میں کفن دیا گیا۔ایک حلہ جو دو کپڑوں پر مشتمل تھا اور ایک ان کی اپنی قمیص جس میں ان کی وفات ہوئی۔امام ابوداؤد رحمہ اللہ فرماتے ہیں: عثمان بن ابی شیبہ نے کہا: تین کپڑوں میں کفن دیا گیا۔ایک سرخ حلہ اور ایک قمیص ‘ جس میں آپ ﷺ کی وفات ہوئی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ابن ماجہ (1471)<br>یزید ضعیف ولحدیثہ شواہد ضعیفۃ منھا طریق أحمد (253/1،313)`;
abudawood.anwaar = [116,1];