var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ حَدَّثَنَا عَمْرُو بْنُ هَاشِمٍ أَبُو مَالِكٍ الْجَنْبِيُّ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ عَامِرٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ لَا تُغَالِ لِي فِي كَفَنٍ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَغَالَوْا فِي الْكَفَنِ فَإِنَّهُ يُسْلَبُهُ سَلْبًا سَرِيعًا";
abudawood.urdu = "سیدنا علی بن ابی طالب رضی اللہ عنہ نے فرمایا کہ کفن مہنگا نہیں ہونا چاہیئے۔بیشک میں نے رسول اللہ ﷺ سے سنا ہے ‘ آپ ﷺ فرماتے تھے ’’کفن مہنگا مت بنایا کرو ‘ بلاشبہ یہ بہت جلد چھین لیا جاتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عمرو بن ھاشم الجنبي ضعیف وقال الحافظ ابن حجر : لین الحدیث،أفرط فیہ ابن حبان (تق : 5126)`;
abudawood.anwaar = [116,1];