var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنِي ابْنُ وَهْبٍ حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ عَنْ حَاتِمِ بْنِ أَبِي نَصْرٍ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ أَبِيهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ الْكَفَنِ الْحُلَّةُ وَخَيْرُ الْأُضْحِيَّةِ الْكَبْشُ الْأَقْرَنُ";
abudawood.urdu = "حضرت عبادہ بن صامت سے روابت ہے رسول اللہ ﷺ نے فرمایا بہترین کفن حلہ ہے (دو چادریں) اور بہترین قربانی مینڈا ہے جو سینگوں والا ہو۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1641)
أخرجہ ابن ماجہ (1473 وسندہ حسن) حاتم بن أبي نصر: حسن الحدیث و ثقہ ابن حبان والحاکم وغیرہما`;