var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا زَكَرِيَّا حَدَّثَنَا مُصْعَبُ بْنُ شَيْبَةَ عَنْ طَلْقِ بْنِ حَبِيبٍ الْعَنَزِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّهَا حَدَّثَتْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ مِنْ أَرْبَعٍ مِنْ الْجَنَابَةِ وَيَوْمَ الْجُمُعَةِ وَمِنْ الْحِجَامَةِ وَغُسْلِ الْمَيِّتِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم ﷺ چار باتوں سے غسل کیا کرتے تھے۔جنابت سے،جمعہ کے روز،سینگی لگوا کر اور میت کو غسل دے کر۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (542)
صححہ ابن خزیمۃ (256 وسندہ حسن) وانظر الحدیث السابق (348)`;