var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،حَدَّثَنِي ابْنُ أَبِي ذِئْبٍ عَنِ الْقَاسِمِ بْنِ عَبَّاسٍ،عَنْ عَمْرِو بْنِ عُمَيْرٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ مَنْ غَسَّلَ الْمَيِّتَ فَلْيَغْتَسِلْ،وَمَنْ حَمَلَهُ فَلْيَتَوَضَّأْ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص کسی میت کو نہلائے وہ غسل کرے اور جو اسے اٹھائے وہ وضو کرے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (541)
وللحدیث شواھد منھا الحدیث الآتي (3162)`;