var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ حَتَّى رَأَيْتُ الدُّمُوعَ تَسِيلُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ نے سیدنا عثمان بن مظعون رضی اللہ عنہ کو بوسہ دیا جبکہ وہ فوت ہو گئے تھے ‘ میں نے دیکھا کہ آپ ﷺ کے آنسو بہہ رہے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (989) ابن ماجہ (1456)<br>عاصم بن عبیداللّٰہ ضعیف<br>وللحدیث شواھد ضعیفۃ عند البزار (الکشف : 806) و أبي نعیم (حلیۃ الأولیاء :105/1) وغیرھما`;
abudawood.anwaar = [117,1];