var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ نُبَيْحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا حَمَلْنَا الْقَتْلَى يَوْمَ أُحُدٍ لِنَدْفِنَهُمْ فَجَاءَ مُنَادِي النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُكُمْ أَنْ تَدْفِنُوا الْقَتْلَى فِي مَضَاجِعِهِمْ فَرَدَدْنَاهُمْ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ ہم شہدائے احد کو دفن کرنے کے لیے اٹھا لائے تو رسول اللہ ﷺ کا منادی آیا اور کہا: بیشک رسول اللہ ﷺ تمہیں حکم دیتے ہیں کہ ان مقتولوں کو ان کے مقامات شہادت ہی پر دفن کرو ‘ چنانچہ ہم نے انہیں وہیں لوٹا دیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1704)
ورواہ الترمذي (1717 وسندہ صحیح، سفیان تابعہ شعبۃ)`;