var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،-يَرْوِيهِ-،قَالَ: مَنْ تَبِعَ جَنَازَةً فَصَلَّى عَلَيْهَا, فَلَهُ قِيرَاطٌ،وَمَنْ تَبِعَهَا حَتَّى يُفْرَغَ مِنْهَا, فَلَهُ قِيرَاطَانِ،أَصْغَرُهُمَا مِثْلُ أُحُدٍ،-أَوْ-أَحَدُهُمَا مِثْلُ أُحُدٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ جو شخص جنازے کے ساتھ گیا اور پھر اس پر نماز پڑھی تو اس کے لیے ایک قیراط اجر ہے ‘ اور جو اس کے ساتھ گیا حتیٰ کہ (دفن سے) فراغت ہو گئی تو اس کے لیے دو قیراط ہیں۔ان دونوں قیراطوں میں سے چھوٹا احد پہاڑ کے برابر ہو گا یا فرمایا کہ ان میں ایک قیراط احد پہاڑ جتنا ہو گا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الحمیدي بتحقیقي (1027 وسندہ صحیح) ورواہ مسلم (945)`;