var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ السَّكُونِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ مُسْلِمٍ يَمُوتُ فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلًا لَا يُشْرِكُونَ بِاللَّهِ شَيْئًا إِلَّا شُفِّعُوا فِيهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ میں نے نبی کریم ﷺ کو فرماتے سنا ’’جو کوئی مسلمان فوت ہو جائے اور پھر اس پر چالیس آدمی کھڑے ہو کر جنازہ پڑھیں ‘ جو اللہ کے ساتھ کسی کو شریک نہ ٹھہراتے ہوں ‘ تو اس میت کے بارے میں ان کی سفارش قبول کر لی جاتی ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (948)";
abudawood.description = ``;