var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ الصَّمَدِ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ قَالَا حَدَّثَنَا حَرْبٌ يَعْنِي ابْنَ شَدَّادٍ حَدَّثَنَا يَحْيَى حَدَّثَنِي بَابُ بْنُ عُمَيْرٍ حَدَّثَنِي رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُتْبَعُ الْجَنَازَةُ بِصَوْتٍ وَلَا نَارٍ زَادَ هَارُونُ وَلَا يُمْشَى بَيْنَ يَدَيْهَا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جنازے کے ساتھ کوئی آواز یا آگ نہ جائے۔‘‘ امام ابوداؤد رحمہ اللہ نے فرمایا (راوی حدیث) ہارون نے یہ اضافہ بیان کیا ہے: ’’آگ اس کے آگے آگے نہ لے جائی جائے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>باب بن عمیر مجہول (دیوان الضعفاء للذھبي: 544) وشیخہ و شیخ شیخہ مجہولان لا یعرفان أصلاً<br>انظر عون المعبود (172/3)`;
abudawood.anwaar = [117,1];