var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ عَامِرِ بْنِ رَبِيعَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ";
abudawood.urdu = "سیدنا عامر بن ربیعہ سے روایت ہے کہ انہیں نبی کریم ﷺ سے یہ حدیث پہنچی،جب تم جنازہ دیکھو تو اس کے لیے کھڑے ہو جاؤ حتیٰ کہ آگے گزر جائے یا اسے نیچے رکھ دیا جائے۔‘‘";
abudawood.hukam = "صحیح بخاری (1307) صحیح مسلم (958)";
abudawood.description = ``;