var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ سَمِعَ جَابِرَ بْنَ سَمُرَةَ قَالَ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ابْنِ الدَّحْدَاحِ وَنَحْنُ شُهُودٌ ثُمَّ أُتِيَ بِفَرَسٍ فَعُقِلَ حَتَّى رَكِبَهُ فَجَعَلَ يَتَوَقَّصُ بِهِ وَنَحْنُ نَسْعَى حَوْلَهُ";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے سیدنا ابن دحداح رضی اللہ عنہ کا جنازہ پڑھایا اور ہم اس میں موجود تھے،پھر ایک گھوڑا لا کر باندھ دیا گیا حتیٰ کہ آپ ﷺ اس پر سوار ہو گئے،پھر وہ آپ ﷺ کے ساتھ درمیانی رفتار سے تیز تیز چلنے لگا اور ہم بھی آپ ﷺ کے ساتھ اردگرد میں تیز تیز چلنے لگے۔";
abudawood.hukam = "صحیح مسلم (965)";
abudawood.description = ``;