var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ";
abudawood.urdu = "سیدنا سالم اپنے والد (سیدنا عبداللہ بن عمر رضی اللہ عنہما) سے روایت کرتے ہیں وہ کہتے ہیں کہ میں نے نبی کریم ﷺ،ابوبکر اور عمر رضی اللہ عنہما کو دیکھا کہ یہ لوگ جنازہ کے آگے آگے چلتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1668)
الراجح أنہ حدیث صحیح و أعل بما لا یقدح والزھري صرح بالسماع`;