var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ يُونُسَ عَنْ زِيَادِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ وَأَحْسَبُ أَنَّ أَهْلَ زِيَادٍ أَخْبَرُونِي أَنَّهُ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرَّاكِبُ يَسِيرُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي يَمْشِي خَلْفَهَا وَأَمَامَهَا وَعَنْ يَمِينِهَا وَعَنْ يَسَارِهَا قَرِيبًا مِنْهَا وَالسِّقْطُ يُصَلَّى عَلَيْهِ وَيُدْعَى لِوَالِدَيْهِ بِالْمَغْفِرَةِ وَالرَّحْمَةِ";
abudawood.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’سوار آدمی جنازہ کے پیچھے چلے اور پیدل لوگ اس کے پیچھے،آگے،دائیں اور بائیں اس کے قریب قریب چلیں،اور بچہ جو ناقص پیدا ہو اس کی بھی نماز جنازہ پڑھی جائے اور اس کے ماں باپ کے لیے مغفرت اور رحمت کی دعا کی جائے۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1667)
أخرجہ الترمذي (1031 وسندہ صحیح) ورواہ ابن ماجہ (1507 وسندہ صحیح)`;