var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُ سِوَى ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جنازہ جلدی لے جاؤ،اگر وہ نیک اور صالح ہے تو تم اسے بھلائی کی طرف آگے لے جا رہے ہو اور اگر وہ اس کے سوا ہے تو وہ ایک شر ہے جسے تم اپنی گردنوں سے اتار پھینک رہے ہو۔“";
abudawood.hukam = "صحیح بخاری (1315) صحیح مسلم (944)";
abudawood.description = ``;