var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح،وحَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ،عَنْ عُيَيْنَةَ... بِهَذَا الْحَدِيثِ،قَالَا: فِي جَنَازَةِ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ،وَقَالَ: فَحَمَلَ عَلَيْهِمْ بَغْلَتَهُ،وَأَهْوَى بِالسَّوْطِ.";
abudawood.urdu = "خالد بن حارث اور عیسیٰ بن یونس نے عیینہ بن عبدالرحمٰن سے یہ روایت نقل کی تو ان دونوں نے عبدالرحمٰن بن سمرہ رضی اللہ عنہ کے جنازے کا ذکر کیا۔اور کہا کہ (ابوبکرہ رضی اللہ عنہ) اپنا خچر دوڑا کر لائے اور اپنے کوڑے سے اشارہ کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (1913 وسندہ صحیح)`;