var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ حَدَّثَنِي نَفَرٌ مِنْ أَهْلِ الْبَصْرَةِ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُصَلِّ عَلَى مَاعِزِ بْنِ مَالِكٍ وَلَمْ يَنْهَ عَنْ الصَّلَاةِ عَلَيْهِ";
abudawood.urdu = "سیدنا ابوبرزہ اسلمی سے روایت ہے کہ رسول اللہ ﷺ نے سیدنا ماعز بن مالک رضی اللہ عنہ پر نماز جنازہ نہیں پڑھی لیکن دوسروں کو روکا نہیں تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>النفر البصریون کلھم مجھولون<br>وحدیث عبد الرزاق (13339) والبخاري (6820) یغني عنہ`;
abudawood.anwaar = [117,2];