var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْ مَاتَ إِبْرَاهِيمُ بْنُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ ثَمَانِيَةَ عَشَرَ شَهْرًا فَلَمْ يُصَلِّ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے وہ بیان کرتی ہیں کہ نبی کریم ﷺ کے فرزند ارجمند سیدنا ابراہیم رضی اللہ عنہ کی وفات ہو گئی جبکہ ان کی عمر اٹھارہ ماہ تھی،تو رسول اللہ ﷺ نے اس کا جنازہ نہیں پڑھا تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;