var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ صَالِحِ بْنِ عَجْلَانَ وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّادٍ عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ وَاللَّهِ مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سُهَيْلِ ابْنِ الْبَيْضَاءِ إِلَّا فِي الْمَسْجِدِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،وہ کہتی ہیں کہ قسم اللہ کی! رسول اللہ ﷺ نے بیضاء کے بیٹے سہیل کی نماز جنازہ مسجد ہی میں پڑھی تھی۔";
abudawood.hukam = "صحیح مسلم (973)";
abudawood.description = ``;