var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ وَعَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ عَنْ ابْنِ وَهْبٍ نَحْوَ هَذَا الْحَدِيثِ قَالَ قَامَ الْمُسْلِمُونَ فَضَرَبُوا بِأَكُفِّهِمْ التُّرَابَ وَلَمْ يَقْبِضُوا مِنْ التُّرَابِ شَيْئًا فَذَكَرَ نَحْوَهُ وَلَمْ يَذْكُرْ الْمَنَاكِبَ وَالْآبَاطَ قَالَ ابْنُ اللَّيْثِ إِلَى مَا فَوْقَ الْمِرْفَقَيْنِ";
abudawood.urdu = "سلیمان بن داود مہری اور عبدالملک بن شعیب نے ابن وہب کے واسطہ سے مذکورہ حدیث کے مثل بیان کیا،کہا کہ مسلمان اٹھے اور اپنے ہاتھ مٹی پر مارے لیکن مٹی سے کچھ نہ پکڑا۔مذکورہ حدیث کے قریب قریب ذکر کیا اور اس میں کندھوں اور بغلوں کا ذکر نہیں کیا۔ابن لیث نے کہا: کہنیوں سے اوپر تک (مسح کیا)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتي (320)`;