var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ يَعْنِي ابْنَ عُثْمَانَ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ وَاللَّهِ لَقَدْ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ابْنَيْ بَيْضَاءَ فِي الْمَسْجِدِ سُهَيْلٍ وَأَخِيهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا فرماتی ہیں کہ اللہ کی قسم! رسول اللہ ﷺ نے بیضاء کے دو بیٹوں سہیل اور اس کے بھائی کی نماز جنازہ مسجد میں ادا فرمائی تھی۔";
abudawood.hukam = "صحیح مسلم (973)";
abudawood.description = ``;