var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ أَبِي ذِئْبٍ،حَدَّثَنِي صَالِحٌ مَوْلَى التَّوْأَمَةِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ مَنْ صَلَّى عَلَى جَنَازَةٍ فِي الْمَسْجِدِ،فَلَا شَيْءَ عَلَيْهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کسی میت کا جنازہ مسجد میں ادا کیا تو اس پر کوئی گناہ نہیں۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1517)<br>صالح بن نبھان مولی التوأمۃ اختلط واختلف المحدثون في سماع ابن أبي ذئب منہ أقبل اختلاطہ أم بعد اختلاطہ؟ وقال البخاري: ’’و ابن أبي ذئب سماعہ منہ أخیرًا یروي عنہ مناکیر‘‘ (امعرفۃ السنن والآثار للبیہقي 3/ 181)<br>فالسند ضعیف من أجل الشک في تحدیثہ قبل اختلاطہ ومع ذلک ھو ضعیف ضعفہ الجمھور (انظر مقالات 3/ 206) والحدیث ضعیف باتفاق المحدثین`;
abudawood.anwaar = [118,1];