var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ صَلَّيْتُ وَرَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ عَلَيْهَا لِلصَّلَاةِ وَسَطَهَا";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،وہ کہتے ہیں کہ میں نے نبی کریم ﷺ کی اقتداء میں ایک عورت کا جنازہ پڑھا جو کہ ایام نفاس میں فوت ہوئی تھی۔تو آپ ﷺ اس کے درمیان کے مقابل کھڑے ہوئے تھے۔";
abudawood.hukam = "صحیح بخاری (1331) صحیح مسلم (964)";
abudawood.description = ``;