var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ قَالَ صَلَّيْتُ مَعَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ فَقَالَ إِنَّهَا مِنْ السُّنَّةِ";
abudawood.urdu = "سیدنا طلحہ بن عبداللہ بن عوف بیان کرتے ہیں کہ میں نے سیدنا ابن عباس رضی اللہ عنہما کے ساتھ ایک جنازہ پڑھا تو انہوں نے سورۃ فاتحہ کی قرآت کی اور کہا: یہ سنت ہے۔";
abudawood.hukam = "صحیح بخاری (1335)";
abudawood.description = `مشکوۃ المصابیح (1673)`;