var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى لِلنَّاسِ النَّجَاشِيَّ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ وَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے شاہ نجاشی کی وفات کے روز اس کے متعلق لوگوں کو خبر دی اور پھر انہیں لے کر عید گاہ کی طرف گئے ‘ ان کی صفیں بنائیں اور (نماز جنازہ میں) چار تکبیریں کہیں۔";
abudawood.hukam = "صحیح بخاری (1245) صحیح مسلم (951)";
abudawood.description = ``;