var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ سَعْدٍ يَعْنِي ابْنَ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’میت کی ہڈی توڑنا ایسے ہی ہے جیسے کہ زندہ کی توڑنا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1714)
أخرجہ ابن ماجہ (1616 وسندہ حسن) سعد بن سعید حسن الحدیث`;