var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’لحد ہمارے لیے ہے اور شق دوسروں کے لیے ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1045) نسائی (2011) ابن ماجہ (1554)<br>عبدالأعلی بن عامر الثعلبي ضعیف ضعفہ الجمہور من جھۃ حفظہ،انظر التحریر (3731) وقال الھیثمي : ’’والأکثر علٰی تضعیفہ ‘‘ (مجمع الزوائد 1/ 147)<br>ولحدیثہ شواہد ضعیفۃ`;
abudawood.anwaar = [118,1];