var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ عَامِرٍ قَالَ غَسَّلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِيٌّ وَالْفَضْلُ وَأُسَامَةُ بْنُ زَيْدٍ وَهُمْ أَدْخَلُوهُ قَبْرَهُ قَالَ حَدَّثَنَا مَرْحَبٌ أَوْ أَبُو مَرْحَبٍ أَنَّهُمْ أَدْخَلُوا مَعَهُمْ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ فَلَمَّا فَرَغَ عَلِيٌّ قَالَ إِنَّمَا يَلِي الرَّجُلَ أَهْلُهُ";
abudawood.urdu = "جناب عامر شعبی رحمہ اللہ سے مروی ہے کہ سیدنا علی،فضل اور اسامہ بن زید رضی اللہ عنہم نے رسول اللہ ﷺ کو غسل دیا اور انہوں نے ہی آپ ﷺ کو قبر میں اتارا۔شعبی نے کہا کہ مجھے مرحب یا ابن ابی مرحب (سوید بن قیس) نے بیان کیا کہ انہوں نے اپنے ساتھ سیدنا عبدالرحمٰن بن عوف رضی اللہ عنہ کو بھی شامل کیا تھا اور جب سیدنا علی رضی اللہ عنہ فارغ ہوئے تو کہا: تدفین وغیرہ کے عمل میں آدمی کے اپنے اہل کے افراد ہی حصہ لیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>إسماعیل بن أبي خالد عنعن`;
abudawood.anwaar = [118,1];