var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَخْبَرَنَا سُفْيَانُ عَنْ ابْنِ أَبِي خَالِدٍ عَنْ الشَّعْبِيِّ عَنْ أَبِي مَرْحَبٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ نَزَلَ فِي قَبْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَأَنِّي أَنْظُرُ إِلَيْهِمْ أَرْبَعَةً";
abudawood.urdu = "سیدنا ابومرحب سے روایت ہے کہ سیدنا عبدالرحمٰن بن عوف رضی اللہ عنہ نبی کریم ﷺ کی قبر میں اترے تھے۔(ابومرحب) کہتے ہیں: گویا میں ان چاروں کو دیکھ رہا ہوں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>انظر الحدیث السابق (3209)<br>ولبعض الحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [118,1];