var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ أَوْصَى الْحَارِثُ أَنْ يُصَلِّيَ عَلَيْهِ عَبْدُ اللَّهِ بْنُ يَزِيدَ فَصَلَّى عَلَيْهِ ثُمَّ أَدْخَلَهُ الْقَبْرَ مِنْ قِبَلِ رِجْلَيْ الْقَبْرِ وَقَالَ هَذَا مِنْ السُّنَّةِ";
abudawood.urdu = "جناب ابواسحٰق (سبیعی) سے روایت ہے کہ حارث اعور نے وصیت کی کہ سیدنا عبداللہ بن یزید (عبداللہ بن یزید حطمی رضی اللہ عنہ) ان کی نماز جنازہ پڑھائیں۔چنانچہ انہوں نے جنازہ پڑھایا ‘ پھر انہیں قبر کی پائینتی کی طرف سے قبر میں اتارا اور فرمایا یہ سنت ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;