var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ زَاذَانَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةِ رَجُلٍ مِنْ الْأَنْصَارِ فَانْتَهَيْنَا إِلَى الْقَبْرِ وَلَمْ يُلْحَدْ بَعْدُ فَجَلَسَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَقْبِلَ الْقِبْلَةِ وَجَلَسْنَا مَعَهُ";
abudawood.urdu = "سیدنا براء بن عازب رضی اللہ عنہ سے روایت ہے کہ ہم رسول اللہ ﷺ کے ساتھ ایک انصاری کے جنازے میں گئے ‘ ہم قبر کے پاس پہنچے تو ابھی تک لحد نہیں بنی تھی۔پس نبی کریم ﷺ قبلہ رخ ہو کر بیٹھ گئے اور ہم بھی آپ ﷺ کے ساتھ بیٹھ گئے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (131، 1713)
الاعمش صرح بالسماع عند الحاکم (1/ 37 ح 107) والطبرانی فی حدیث الطوال (25) وسندہما حسن`;