var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ ح و حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي الصِّدِّيقِ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا وَضَعَ الْمَيِّتَ فِي الْقَبْرِ قَالَ بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا لَفْظُ مُسْلِمٍ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے منقول ہے کہ نبی کریم ﷺ جب میت کو قبر میں اتارتے ‘ تو یوں فرمایا کرتے «بسم اللہ،وعلی سنۃ رسول اللہ ﷺ» ’’اللہ کے نام سے اور رسول اللہ (ﷺ) کے طریقے پر۔‘‘ اور یہ لفظ مسلم بن ابراہیم کے ہیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1707)
وللحدیث شاھد عند الحاکم (1/366 وسندہ صحیح)`;