var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي هَيَّاجٍ الْأَسَدِيِّ قَالَ بَعَثَنِي عَلِيٌّ قَالَ لِي أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا أَدَعَ قَبْرًا مُشْرِفًا إِلَّا سَوَّيْتُهُ وَلَا تِمْثَالًا إِلَّا طَمَسْتُهُ";
abudawood.urdu = "سیدنا ابوہیاج اسدی سے روایت ہے وہ کہتے ہیں کہ سیدنا علی رضی اللہ عنہ نے مجھے بھیجا اور فرمایا میں تمہیں اس کام پر بھیج رہا ہوں جس پر رسول اللہ ﷺ نے مجھے بھیجا تھا کہ کسی اونچی قبر کو نہ چھوڑوں مگر اسے برابر کر دوں اور نہ کسی مورتی کو مگر اسے مٹا ڈالوں۔";
abudawood.hukam = "صحیح مسلم (969)";
abudawood.description = ``;