var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَقْرَ فِي الْإِسْلَامِ قَالَ عَبْدُ الرَّزَّاقِ كَانُوا يَعْقِرُونَ عِنْدَ الْقَبْرِ بَقَرَةً أَوْ شَاةً";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اسلام میں عقر (جانوروں کو قبر پر ذبح کرنا) نہیں ہے۔‘‘ امام عبدالرزاق رحمہ اللہ نے بیان کیا کہ لوگوں کا معمول تھا کہ وہ قبر کے پاس گائے یا بکری وغیرہ ذبح کیا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;