var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ أَبِي الْخَيْرِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ: يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلَاتَهُ عَلَى الْمَيِّتِ ثُمَّ انْصَرَفَ.";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ ایک دن تشریف لے گئے اور اہل احد پر نماز پڑھی جیسے کہ میت پر پڑھتے ہیں ‘ پھر واپس تشریف لے آئے۔";
abudawood.hukam = "صحیح بخاری (6426) صحیح مسلم (2296)";
abudawood.description = ``;