var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،حَدَّثَنَا ابْنُ الْمُبَارَكِ،عَنْ حَيْوَةَ بْنِ شُرَيْحٍ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ بِهَذَا الْحَدِيثِ قَالَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى قَتْلَى أُحُدٍ بَعْدَ ثَمَانِي سِنِينَ كَالْمُوَدِّعِ لِلْأَحْيَاءِ وَالْأَمْوَاتِ.";
abudawood.urdu = "جناب یزید بن ابی حبیب نے یہ حدیث بیان کی اور کہا کہ بیشک نبی کریم ﷺ نے شہدائے احد پر آٹھ سال کے بعد نماز جنازہ پڑھی ‘ گویا کہ آپ ﷺ زندوں اور مردوں کو الوداع کہہ رہے تھے۔";
abudawood.hukam = "صحیح بخاری (4042)";
abudawood.description = ``;