var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا ابْنُ جُرَيْجٍ،أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَقْعُدَ عَلَى الْقَبْرِ،وَأَنْ يُقَصَّصَ وَيُبْنَى عَلَيْهِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ کہتے ہیں کہ میں نے نبی کریم ﷺ سے سنا،آپ ﷺ منع فرماتے تھے کہ قبر پر بیٹھا جائے یا اسے چونا گچ کیا جائے اور اس پر کوئی تعمیر کی جائے۔";
abudawood.hukam = "صحیح مسلم (970)";
abudawood.description = ``;