var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ قَاتَلَ اللَّهُ الْيَهُودَ،اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’اللہ تعالیٰ یہودیوں کو ہلاک کرے انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا۔‘‘";
abudawood.hukam = "صحیح بخاری (437) صحیح مسلم (530)";
abudawood.description = ``;