var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدٌ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ فَتُحْرِقَ ثِيَابَهُ حَتَّى تَخْلُصَ إِلَى جِلْدِهِ خَيْرٌ لَهُ مِنْ أَنْ يَجْلِسَ عَلَى قَبْرٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے کوئی دہکتے کوئلے پر بیٹھ جائے،وہ اس کے کپڑے جلا دے اور پھر اس کا اثر اس کے جسم تک پہنچ جائے،یہ اس کے لیے بہتر ہے اس سے کہ کسی قبر پر بیٹھے۔‘‘";
abudawood.hukam = "صحیح مسلم (971)";
abudawood.description = ``;