var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ يَزِيدَ بْنِ جَابِرٍ عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ وَاثِلَةَ بْنَ الْأَسْقَعِ يَقُولُ سَمِعْتُ أَبَا مَرْثَدٍ الْغَنَوِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْلِسُوا عَلَى الْقُبُورِ وَلَا تُصَلُّوا إِلَيْهَا";
abudawood.urdu = "سیدنا واثلہ بن اسقع رضی اللہ عنہ فرماتے ہیں میں نے سیدنا ابومرثد غنوی رضی اللہ عنہ کو سنا،وہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’قبروں پر مت بیٹھو اور نہ ان کی طرف رخ کر کے نماز پڑھو۔‘‘";
abudawood.hukam = "صحیح مسلم (972)";
abudawood.description = ``;