var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’بندے کو جب اس کی قبر میں رکھ دیا جاتا ہے اور اس کے ساتھی اس کے پاس سے جانے لگتے ہیں،تو بلاشبہ وہ ان کے جوتوں کی چاپ سنتا ہے۔“";
abudawood.hukam = "صحیح بخاری (1338) صحیح مسلم (2870)";
abudawood.description = ``;