var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي مَسْلَمَةَ عَنْ أَبِي نَضْرَةَ عَنْ جَابِرٍ قَالَ دُفِنَ مَعَ أَبِي رَجُلٌ فَكَانَ فِي نَفْسِي مِنْ ذَلِكَ حَاجَةٌ فَأَخْرَجْتُهُ بَعْدَ سِتَّةِ أَشْهُرٍ فَمَا أَنْكَرْتُ مِنْهُ شَيْئًا إِلَّا شُعَيْرَاتٍ كُنَّ فِي لِحْيَتِهِ مِمَّا يَلِي الْأَرْضَ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ میرے والد ایک دوسرے آدمی کے ساتھ دفن کیے گئے تو اس وجہ سے میرے جی میں تھا کہ ان کو وہاں سے نکال لوں۔چنانچہ میں نے انہیں چھ ماہ بعد وہاں سے نکالا،تو ان میں کوئی تبدیلی نہ آئی تھی سوائے ڈاڑھی کے چند بالوں کے جو زمین کے ساتھ لگے ہوئے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;