var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا مُعَرِّفُ بْنُ وَاصِلٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا فَإِنَّ فِي زِيَارَتِهَا تَذْكِرَةً";
abudawood.urdu = "سیدنا (سلیمان) ابن بریدہ اپنے والد (سیدنا بریدہ رضی اللہ عنہ) سے بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’میں نے تمہیں قبروں کی زیارت سے روکا تھا،چنانچہ اب ان کی زیارت کیا کرو۔بلاشبہ ان کی زیارت میں (موت کی) یاد دہانی ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (977)";
abudawood.description = ``;