var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ قَالَ سَمِعْتُ أَبَا صَالِحٍ يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَائِرَاتِ الْقُبُورِ وَالْمُتَّخِذِينَ عَلَيْهَا الْمَسَاجِدَ وَالسُّرُجَ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے ایسی عورتوں پر لعنت فرمائی ہے جو قبروں پر جاتی ہیں اور (ان لوگوں پر بھی) جو لوگ انہیں سجدہ گاہ بناتے ہیں یا وہاں چراغ جلاتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (320) نسائی (2045)<br>أبو صالح مولی أم ھانئ : ضعیف یرسل (تق : 634)`;
abudawood.anwaar = [118,2];