var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمَقْبَرَةِ فَقَالَ السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ ﷺ قبرستان کی طرف تشریف لے گئے تو یہ دعا پڑھی « السلام علیکم دار قوم مؤمنین،وإنا إن شاء اللہ بکم لاحقون» ’’سلامتی ہو تم پر اے ان گھروں کے مومن لوگو! اور ہم بھی انشاءاللہ تمہارے ساتھ ملنے والے ہیں۔‘‘";
abudawood.hukam = "صحیح مسلم (249)";
abudawood.description = ``;