var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ مَصْبُورَةٍ كَاذِبًا فَلْيَتَبَوَّأْ بِوَجْهِهِ مَقْعَدَهُ مِنْ النَّارِ";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جس نے (کسی حاکم وغیرہ کی مجلس میں محبوس ہو کر یا دیدہ دانستہ) جھوٹی قسم کھائی تو اسے چاہیئے کہ اپنے چہرے کا مقام آگ میں بنا لے۔“";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شواھد انظر الحدیث الآتي (3243)`;