var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ نِسْطَاسٍ مِنْ آلِ كَثِيرِ بْنِ الصَّلْتِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْلِفُ أَحَدٌ عِنْدَ مِنْبَرِي هَذَا عَلَى يَمِينٍ آثِمَةٍ وَلَوْ عَلَى سِوَاكٍ أَخْضَرَ إِلَّا تَبَوَّأَ مَقْعَدَهُ مِنْ النَّارِ أَوْ وَجَبَتْ لَهُ النَّارُ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس کسی نے میرے اس منبر کے پاس جھوٹی قسم کھائی،خواہ ایک (تازہ) مسواک ہی پر کیوں نہ ہو،اس نے اپنا ٹھکانا جہنم میں بنا لیا۔‘‘ یا فرمایا ’’اس کے لیے جہنم واجب ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3778)
أخرجہ ابن ماجہ (2325 وسندہ صحیح)`;