var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ فَقَالَ فِي حَلْفِهِ وَاللَّاتِ فَلْيَقُلْ لَا إِلَهَ إِلَّا اللَّهُ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ فَلْيَتَصَدَّقْ بِشَيْءٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے قسم کھائی اور اپنی قسم میں یوں کہا: قسم ہے لات کی! تو اسے چاہیئے کہ کہے «لا إلہ إلا اللہ» اور جس نے اپنے ساتھی سے کہا: آؤ جوا کھیلیں! تو اسے چاہیئے کہ کچھ صدقہ کرے۔‘‘";
abudawood.hukam = "صحیح مسلم (1647)";
abudawood.description = ``;