var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَوْفٌ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحْلِفُوا بِآبَائِكُمْ وَلَا بِأُمَّهَاتِكُمْ وَلَا بِالْأَنْدَادِ وَلَا تَحْلِفُوا إِلَّا بِاللَّهِ وَلَا تَحْلِفُوا بِاللَّهِ إِلَّا وَأَنْتُمْ صَادِقُونَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’اپنے باپوں یا ماؤں کے نام کی قسمیں نہ کھایا کرو اور نہ بتوں کے نام کی۔صرف اللہ کے نام کی قسم کھایا کرو،اور اللہ کی قسم بھی اسی صورت میں کھاؤ جب تم سچے ہو۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3418)
أخرجہ النسائي (3800 وسندہ صحیح)`;