var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،عَنْ عُمَرَ رَضِي اللَّهُ عَنْهُ،قَالَ: سَمِعَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَ مَعْنَاهُ،إِلَى: بِآبَائِكُمْ. زَادَ: قَالَ عُمَرُ: فَوَاللَّهِ مَا حَلَفْتُ بِهَذَا, ذَاكِرًا وَلَا آثِرًا.";
abudawood.urdu = "سیدنا عمر رضی اللہ عنہ سے مروی ہے کہتے ہیں کہ رسول اللہ ﷺ نے مجھ سے سنا (کہ میں اپنے باپ کے نام کی قسم کھا رہا تھا) مذکورہ بالا حدیث کے ہم معنی بیان کیا۔سیدنا عمر رضی اللہ عنہ نے مزید کہا: اللہ کی قسم! (بعد ازاں) میں نے ان کی قسم نہیں کھائی،نہ عمداً اور نہ حکایتاً (کسی کی طرف سے نقل کرتے ہوئے)۔";
abudawood.hukam = "صحیح مسلم (1646)";
abudawood.description = ``;