var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ سَمِعْتُ الْحَسَنَ بْنَ عُبَيْدِ اللَّهِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ قَالَ سَمِعَ ابْنُ عُمَرَ رَجُلًا يَحْلِفُ لَا وَالْكَعْبَةِ فَقَالَ لَهُ ابْنُ عُمَرَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ حَلَفَ بِغَيْرِ اللَّهِ فَقَدْ أَشْرَكَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے کسی کو سنا کہ وہ کعبہ کی قسم کھا رہا تھا تو انہوں نے اس سے کہا: بیشک میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ہے ’’جس نے غیر اللہ کی قسم کھائی اس نے شرک کیا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;