var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ الْمَدَنِيُّ عَنْ أَبِي سُهَيْلٍ نَافِعِ بْنِ مَالِكِ بْنِ أَبِي عَامِرٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ يَعْنِي فِي حَدِيثِ قِصَّةِ الْأَعْرَابِيِّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْلَحَ وَأَبِيهِ إِنْ صَدَقَ دَخَلَ الْجَنَّةَ وَأَبِيهِ إِنْ صَدَقَ";
abudawood.urdu = "جناب طلحہ بن عبیداللہ نے بدوی کے واقعہ والی حدیث میں بیان کیا کہ نبی کریم ﷺ نے فرمایا ’’کامیاب ہوا ‘ قسم اس کے باپ کی! اگر سچا (ثابت قدم) رہا۔جنت میں داخل ہوا ‘ قسم اس کے باپ کی! اگر یہ سچا (ثابت قدم) رہا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البخاري (903) ومسلم (847) مختصرًا، وانظر الحدیث السابق (392)`;