var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْوَلِيدُ بْنُ ثَعْلَبَةَ الطَّائِيُّ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ بِالْأَمَانَةِ فَلَيْسَ مِنَّا";
abudawood.urdu = "جناب (سیلمان ابن بریدہ) ابن بریدہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے امانت کی قسم کھائی ‘ وہ ہم میں سے نہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3420)`;