var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا حُسَيْنٌ يَعْنِي ابْنَ وَاقِدٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ فَقَالَ إِنِّي بَرِيءٌ مِنْ الْإِسْلَامِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا فَلَنْ يَرْجِعَ إِلَى الْإِسْلَامِ سَالِمًا";
abudawood.urdu = "سیدنا عبداللہ بن بریدہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے قسم کھائی کہ میں اسلام سے بری ہوں،تو اگر وہ جھوٹا ہوا تو وہ وہی ہوا جو اس نے کہا اور اگر سچا بھی ہوا تو اسلام کی طرف صحیح سالم نہیں لوٹے گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3421)
أخرجہ النسائي (3803 وسندہ حسن) وابن ماجہ (2100 وسندہ حسن)`;