var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى،حَدَّثَنَا يَحْيَى بْنُ الْعَلَاءِ،عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ،عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ،قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَضَعَ تَمْرَةً عَلَى كِسْرَةٍ،فَقَالَ: هَذِهِ إِدَامُ هَذِهِ.";
abudawood.urdu = "سیدنا یوسف بن عبداللہ بن سلام رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی کریم ﷺ کو دیکھا کہ آپ ﷺ نے ایک کھجور روٹی کے ٹکڑے پر رکھی اور فرمایا ’’یہ اس کا سالن ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف جدًا<br>یحیي بن العلاء : متروک،متھم بالکذب وقال الحافظ فی التقریب (7618) : ’’ رمي بالوضع‘‘`;
abudawood.anwaar = [119,1];