var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ،حَدَّثَنَا أَبِي،عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى،عَنْ يَزِيدَ الْأَعْوَرِ،عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ مِثْلَهُ.";
abudawood.urdu = "یزید اعور نے سیدنا یوسف بن عبداللہ بن سلام رضی اللہ عنہ سے اس کے مثل روایت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی فی الشمائل (183) والحدیث الآتي (3830)<br>یزید بن أبي أمیۃ الأعور : مجہول (تقریب التہذیب: 7690)`;
abudawood.anwaar = [119,1];