var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدْ اسْتَثْنَى";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما،نبی کریم ﷺ کی طرف نسبت کرتے ہوئے بیان کرتے ہیں کہ ’’جس نے قسم کھائی اور پھر «إن شاء اللہ» کہہ دیا تو اس نے استثناء کر لیا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3424)
أخرجہ النسائي (3860 وسندہ حسن) سفیان بن عیینۃ صرح بالسماع عند الحمیدي بتحقیقي (691 وسندہ صحیح)`;