var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَمُسَدَّدٌ وَهَذَا حَدِيثُهُ قَالَا حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ فَاسْتَثْنَى فَإِنْ شَاءَ رَجَعَ وَإِنْ شَاءَ تَرَكَ غَيْرَ حِنْثٍ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے قسم کھائی اور «إن شاء اللہ» کہا تو چاہے وہ اپنی قسم کو پورا کرے یا نہ کرے ‘ قسم نہیں ٹوٹے گی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (1531 وسندہ صحیح) والنسائي (3824 وسندہ صحیح) وابن ماجہ (2105 وسندہ صحیح)`;