var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ أَكْثَرُ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْلِفُ بِهَذِهِ الْيَمِينِ لَا وَمُقَلِّبِ الْقُلُوبِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ کی اکثر قسمیں اس طرح کی ہوتی تھیں «لا،‏‏‏‏ ومقلب القلوب» ’’نہیں ‘ قسم ہے اس ذات کی جو دلوں کا پھیرنے والا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6617)";
abudawood.description = ``;