var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ عَاصِمِ بْنِ شُمَيْخٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اجْتَهَدَ فِي الْيَمِينِ قَالَ وَالَّذِي نَفْسُ أَبِي الْقَاسِمِ بِيَدِهِ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ جب بہت تاکیدی قسم کھاتے تو یوں کہا کرتے تھے «والذی نفس أبی القاسم بیدہ» ’’قسم ہے اس ذات کی جس کے ہاتھ میں ابوالقاسم کی جان ہے!‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عکرمۃ بن عمار عنعن<br>و أما عاصم بن شمیخ فھو حسن الحدیث<br>وثقہ الإمام العجلي المعتدل و ابن حبان`;
abudawood.anwaar = [119,1];