var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ أَخْبَرَنِي زَيْدُ بْنُ حُبَابٍ أَخْبَرَنِي مُحَمَّدُ بْنُ هِلَالٍ حَدَّثَنِي أَبِي أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ كَانَتْ يَمِينُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفَ يَقُولُ لَا وَأَسْتَغْفِرُ اللَّهَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جب قسم کھاتے تو یوں کہا کرتے «لا،‏‏‏‏ وأستغفر اللہ» ’’نہیں! اور میں اللہ سے بخشش چاہتا ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2093)<br>ھلال بن أبي ھلال المدني مجہول الحال<br>انظر التحریر (7351) وثقہ ابن حبان وحدہ وقال الذھبي : ’’ لا یعرف‘‘`;
abudawood.anwaar = [119,1];