var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ أَبَا بَكْرٍ أَقْسَمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقْسِمْ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ سیدنا ابوبکر رضی اللہ عنہ نے نبی کریم ﷺ کو قسم دی تو نبی کریم ﷺ نے فرمایا ’’قسم مت دو۔‘‘";
abudawood.hukam = "صحیح بخاری (7046) صحیح مسلم (2269)";
abudawood.description = ``;