var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّيَمُّمِ فَأَمَرَنِي ضَرْبَةً وَاحِدَةً لِلْوَجْهِ وَالْكَفَّيْنِ";
abudawood.urdu = "جناب سعید بن عبدالرحمٰن بن ابزٰی اپنے والد سے بیان کرتے ہیں وہ سیدنا عمار بن یاسر رضی اللہ عنہما سے،وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے تیمم کے بارے میں پوچھا تو آپ نے مجھے حکم دیا کہ چہرے اور ہاتھوں کے لیے ایک ہی دفعہ ہاتھ ماروں۔";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شواھد منھا الحدیث السابق (326) وزاد ابن حبان (الاحسان: 1300): ’’وکان قتادۃ بہ یفتي‘‘`;