var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى،حَدَّثَنَا سَالِمُ بْنُ نُوحٍ وَعَبْدُ الْأَعْلَى عَنِ الْجُرَيْرِيِّ،عَنْ أَبِي عُثْمَانَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ... بِهَذَا الْحَدِيثِ نَحْوَهُ. زَادَ،عَنْ سَالِمٍ فِي حَدِيثِهِ قَالَ وَلَمْ يَبْلُغْنِي كَفَّارَةٌ.";
abudawood.urdu = "ابوعثمان نے سیدنا عبدالرحمٰن بن ابی بکر رضی اللہ عنہ سے یہ حدیث مذکورہ بالا حدیث کی مانند روایت کی اور ابن مثنی نے سالم کی اس حدیث میں مزید کہا: مجھے یہ بات نہیں پہنچی کہ (سیدنا ابوبکر رضی اللہ عنہ نے) کفارہ بھی دیا۔";
abudawood.hukam = "صحیح مسلم (2057)";
abudawood.description = ``;