var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ إِلَّا فِيمَا يُبْتَغَى بِهِ وَجْهُ اللَّهِ وَلَا يَمِينَ فِي قَطِيعَةِ رَحِمٍ";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے،وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کوئی نذر نہیں سوائے اس کے جس میں اللہ کی رضا مقصود ہو اور نہ قطع رحمی میں قسم ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیثین السابقین (2191، 2192)`;