var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ قَالَ سُئِلَ قَتَادَةُ عَنْ التَّيَمُّمِ فِي السَّفَرِ فَقَالَ حَدَّثَنِي مُحَدِّثٌ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ عَمَّارِ بْنِ يَاسِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِلَى الْمِرْفَقَيْنِ";
abudawood.urdu = "جناب ابان کہتے ہیں کہ قتادہ سے سفر میں تیمم کے بارے میں پوچھا گیا تو انہوں نے کہا کہ مجھ سے ایک بیان کرنے والے نے شعبی سے،انہوں نے عبدالرحمٰن بن ابزی سے،انہوں نے سیدنا عمار بن یاسر رضی اللہ عنہما سے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’کہنیوں تک۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>المحدث: لم أعرفہ<br>وللحدیث طرق أخری ضعیفۃ`;
abudawood.anwaar = [26,1];