var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مُحَمَّدِ بْنِ خَلَّادٍ أَبُو عُمَرَ قَالَ كَانَ عِنْدَنَا مَكُّوكٌ يُقَالُ لَهُ مَكُّوكُ خَالِدٍ وَكَانَ كَيْلَجَتَيْنِ بِكَيْلَجَةِ هَارُونَ قَالَ مُحَمَّدٌ صَاعُ خَالِدٍ صَاعُ هِشَامٍ يَعْنِي ابْنَ عَبْدِ الْمَلِكِ";
abudawood.urdu = "محمد بن محمد بن خلاد ابوعمر کا بیان ہے کہ ہمارے پاس ایک مد تھا جو خالد (قسری) کی طرف منسوب تھا جو ہارون کے کیلجہ (ایک پیمانہ) سے دوگنا تھا۔محمد بن محمد نے کہا: خالد کے صاع (مد) سے ہشام بن عبدالملک کا صاع مراد ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `خالد ھو ابن عبد اللہ القسري`;