var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِىُّ عَنْ مَالِكٍ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الْأَيْلِيِّ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے اﷲ کی اطاعت کی نذر مانی ہو اسے چاہیئے کہ (اسے پورا کرتے ہوئے) اﷲ کی اطاعت کرے ‘ اور جس نے اﷲ کی معصیت اور نافرمانی کی نذر مانی ہو وہ اس کی نافرمانی نہ کرے۔(اور نذر کو چھوڑ دے)۔‘‘";
abudawood.hukam = "صحیح بخاری (6696، 6700)";
abudawood.description = ``;