var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ أَبُو مَعْمَرٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ يُونُسَ عَنِ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا نَذْرَ فِي مَعْصِيَةٍ, وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ نے فرمایا ’’اﷲ کی نافرمانی میں کوئی نذر نہیں اور اس کا کفارہ قسم والا کفارہ ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `الزھري صرح بالسماع عند النسائي (3869 وسندہ صحیح)`;