var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ كَتَبَ إِلَيَّ يَحْيَى بْنُ سَعِيدٍ،أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ زَحْرٍ مَوْلًى لِبَنِي ضَمْرَةَ وَكَانَ أَيَّمَا رَجُلٍ أَنَّ أَبَا سَعِيدٍ الرُّعَيْنِيَّ أَخْبَرَهُ بِإِسْنَادِ يَحْيَى وَمَعْنَاهُ.";
abudawood.urdu = "ابن جریح کہتے ہیں کہ یحییٰ بن سعید نے مجھے لکھا کہ مجھے عبیداللہ بن زحر ‘ مولیٰ بنی ضمرہ نے لکھا اور کیا خوب آدمی تھا کہ ابوسعید رعینی نے اسے خبر دی اور مذکورہ اسناد یحییٰ سے روایت کیا اور اسی کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ترمذی (1544) نسائی (3846) ابن ماجہ (2134)<br>عبیداللّٰہ بن زحر ضعیف و قال الھیثمي : وضعفہ الجمھور (مجمع الزوائد 54/5) وقال الحافظ ابن حجر : اتفق الأکثر علی توثیقہ (نتائج الأفکار 303/2) وھو خطأ بل ضعفہ الجمھور کما قال الھیثمي وتابعہ بکر بن سوادۃ (أحمد 147/4) ولکن فی السند إلیہ : ابن لھیعۃ وھو ضعیف من جھۃ حفظہ`;
abudawood.anwaar = [120,1];