var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ أُخْتَ عُقْبَةَ بْنِ عَامِرٍ نَذَرَتْ أَنْ تَمْشِيَ إِلَى الْبَيْتِ فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَرْكَبَ وَتُهْدِيَ هَدْيًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ سیدنا عقبہ بن عامر رضی اللہ عنہ کی بہن نے نذر مانی کہ بیت اللہ کو پیدل ہی جائے گی۔تو نبی کریم ﷺ نے اسے حکم فرمایا کہ سوار ہو اور قربانی کرے۔";
abudawood.hukam = "حسن";
abudawood.description = `قتادۃ تابعہ مطر الوراق عند ابن طھمان في مشیختہ (29 وسندہ حسن)`;