var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي سَلَيْمَانُ الْأَحْوَلُ أَنَّ طَاوُسًا أَخْبَرَهُ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ وَهُوَ يَطُوفُ بِالْكَعْبَةِ بِإِنْسَانٍ يَقُودُهُ بِخِزَامَةٍ فِي أَنْفِهِ فَقَطَعَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ وَأَمَرَهُ أَنْ يَقُودَهُ بِيَدِهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ بیت اللہ کا طواف کر رہے تھے۔آپ ﷺ ایک آدمی کے پاس سے گزرے کہ دوسرا اسے نکیل ڈال کر لیے جا رہا تھا تو نبی کریم ﷺ نے اس کی نکیل کو اپنے ہاتھ سے توڑ ڈالا اور اسے حکم دیا کہ اس کا ہاتھ پکڑ کر چلے۔";
abudawood.hukam = "صحیح بخاری (1620)";
abudawood.description = ``;