var abudawood = {};
abudawood.arabic = "حَدَّثَنَا شُعَيْبُ بْنُ أَيُّوبَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ أَبِيهِ عَنْ عِكْرِمَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ أَنَّهُ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أُخْتِي نَذَرَتْ أَنْ تَمْشِيَ إِلَى الْبَيْتِ فَقَالَ إِنَّ اللَّهَ لَا يَصْنَعُ بِمَشْيِ أُخْتِكَ إِلَى الْبَيْتِ شَيْئًا";
abudawood.urdu = "جناب عکرمہ سے منقول ہے کہ سیدنا عقبہ بن عامر جہنی رضی اللہ عنہ نے نبی کریم ﷺ سے کہا: بیشک میری بہن نے نذر مانی ہے کہ بیت اللہ کی طرف پیدل چلے گی۔تو آپ ﷺ نے فرمایا ’’بلاشبہ اللہ تعالیٰ تیری بہن کے بیت اللہ کی طرف پیدل چلنے سے کچھ نہیں کرے گا۔‘‘ (اللہ کو کوئی فائدہ حاصل نہیں ہو گا)۔";
abudawood.hukam = "حسن";
abudawood.description = `رواہ ابن طھمان في مشیختہ (29 وسندہ حسن)`;