var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ لَمْ تَقْضِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا";
abudawood.urdu = "سیدنا سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ ﷺ سے دریافت کیا اور کہا کہ میری والدہ فوت ہو گئی ہے اور اس کے ذمے نذر تھی جو وہ پوری نہیں کر سکی ‘ تو رسول اللہ ﷺ نے فرمایا ’’تم اس کی طرف سے پوری کر دو۔‘‘";
abudawood.hukam = "صحیح بخاری (2761) صحیح مسلم (1638)";
abudawood.description = ``;