var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ،عَنْ أَبِيهِ،أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تِيبَ عَلَيْهِ: إِنِّي أَنْخَلِعُ مِنْ مَالِي. فَذَكَرَ نَحْوَهُ،إِلَى: خَيْرٌ لَكَ";
abudawood.urdu = "جناب عبداللہ بن کعب بن مالک نے اپنے والد سے روایت کیا کہ جب ان کی توبہ قبول ہو گئی تو انہوں نے رسول اللہ ﷺ سے عرض کیا کہ میں اپنے مال سے دست بردار ہوتا ہوں۔اور مذکورہ بالا حدیث کی مانند «خیر لک» تک بیان کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3317)`;