var abudawood = {};
abudawood.arabic = "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ،عَنْ أَبِيهِ أَنَّهُ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-أَوْ أَبُو لُبَابَةَ،أَوْ مَنْ شَاءَ اللَّهُ-: إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي الَّتِي أَصَبْتُ فِيهَا الذَّنْبَ،وَأَنْ أَنْخَلِعَ مِنْ مَالِي كُلِّهِ صَدَقَةً؟ قَالَ: يُجْزِئُ عَنْكَ الثُّلُثُ.";
abudawood.urdu = "سیدنا کعب بن مالک رضی اللہ عنہ کے صاحبزادے اپنے والد سے بیان کرتے ہیں کہ انہوں نے نبی کریم ﷺ کے کہا یا ابولبابہ رضی اللہ عنہ نے ‘ یا کسی اور نے کہ میری توبہ کا شکرانہ یہ ہے کہ میں اپنا آبائی گھر جس میں مجھ سے یہ گناہ ہوا ہے ‘ چھوڑ دوں اور صدقہ کر کے اپنے سب مال سے دست بردار ہو جاؤں۔آپ ﷺ نے فرمایا ’’تیسرا حصہ کافی ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3439)
انظر الحدیث السابق (3317)`;