var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ،أَخْبَرَنِي مَعْمَرٌ عَنِ الزُّهْرِيِّ قَالَ،أَخْبَرَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ،قَالَ: كَانَ أَبُو لُبَابَةَ... فَذَكَرَ مَعْنَاهُ،وَالْقِصَّةُ لِأَبِي لُبَابَةَ.\nقَالَ أَبو دَاود: رَوَاهُ يُونُسُ عَنِ ابْنِ شِهَابٍ،عَنْ بَعْضِ بَنِي السَّائِبِ ابْنِ أَبِي لُبَابَةَ وَرَوَاهُ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ،عَنْ حُسَيْنِ بْنِ السَّائِبِ بْنِ أَبِي لُبَابَةَ مِثْلَهُ";
abudawood.urdu = "سیدنا کعب بن مالک رضی اللہ عنہ کے صاحبزادے کا بیان ہے کہ مذکورہ واقعہ سیدنا ابولبابہ کا ہے اور اس کے ہم معنی بیان کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں: اسے یونس نے بواسطہ ابن شہاب زہری ‘ بنی سائب بن ابی لبابہ کے کسی فرد سے اور ایسے ہی زبیدی نے بواسطہ زہری ‘ حسین بن سائب بن ابی لبابہ سے اس کے مثل روایت کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل`;
abudawood.anwaar = [120,1];