var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ،حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ،عَنْ مُحَمَّدٍ مَوْلَى الْمُغِيرَةِ،قَالَ: حَدَّثَنِي كَعْبُ ابْنُ عَلْقَمَةَ،عَنْ أَبِي الْخَيْرِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِ.\nقَالَ أَبو دَاود: وَرَوَاهُ عَمْرُو بْنُ الْحَارِثِ،عَنْ كَعْبِ بْنِ عَلْقَمَةَ عَنِ ابْنِ شِمَاسَةَ،عَنْ عُقْبَةَ";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’نذر کا کفارا قسم والا ہے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں: اس روایت کو عمرو بن حارث نے بھی بواسطہ کعب بن علقمہ ‘ ابن شماسہ سے اور اس نے سیدنا عقبہ سے روایت کیا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = ``;