var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ أَنَّ سَعِيدَ ابْنَ الْحَكَمِ حَدَّثَهُمْ،أَخْبَرَنَا يَحْيَى يَعْنِي بْنَ أَيُّوبَ،حَدَّثَنِي كَعْبُ بْنُ عَلْقَمَةَ أَنَّهُ سَمِعَ ابْنَ شِمَاسَةَ،عَنْ أَبِي الْخَيْرِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ.";
abudawood.urdu = "کعب بن علقمہ نے ابن شماسہ سے سنا،اس نے ابوالخیر سے روایت کیا،اس نے سیدنا عقبہ بن عامر رضی اللہ عنہ سے اور انہوں نے نبی کریم ﷺ سے مذکورہ بالا حدیث کی مانند بیان کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ مسلم (1645)`;