var abudawood = {};
abudawood.arabic = "أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ فِي الْمَسْجِدِ الْحَرَامِ لَيْلَةً فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْفِ بِنَذْرِكَ";
abudawood.urdu = "سیدنا عمر رضی اللہ عنہ کا بیان ہے انہوں نے کہا: اے اللہ کے رسول! میں نے جاہلیت میں نذر مانی تھی کہ مسجد الحرام میں ایک رات کے لیے اعتکاف کروں گا۔تو نبی کریم ﷺ نے انہیں فرمایا ’’اپنی نذر پوری کرو۔‘‘";
abudawood.hukam = "صحیح بخاری (2032) صحیح مسلم (1656)";
abudawood.description = ``;