var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ،عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ،قَالَ: كُنَّا فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُسَمَّى السَّمَاسِرَةَ،فَمَرَّ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِنْهُ،فَقَالَ: يَا مَعْشَرَ التُّجَّارِ! إِنَّ الْبَيْعَ يَحْضُرُهُ اللَّغْوُ وَالْحَلْفُ, فَشُوبُوهُ بِالصَّدَقَةِ.";
abudawood.urdu = "سیدنا قیس بن ابی غرزہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کے دور میں ہم تاجروں کو «سماسرۃ» (دلال) کہا جاتا تھا،تو نبی کریم ﷺ ہمارے پاس سے گزرے اور ہمیں اس سے بہتر نام دیا اور فرمایا ’’اے تاجروں کی جماعت! خرید و فروخت اور لین دین میں بہت سی بے جا باتیں ہوتی ہیں اور قسمیں بھی کھائی جاتی ہیں،تو اس میں صدقہ ملا لیا کرو۔“";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2798)
رواہ الترمذي (1208 وسندہ حسن)`;