var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ عِيسَى الْبِسْطَامِيُّ وَحَامِدُ بْنُ يَحْيَى وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ قَالُوا،حَدَّثَنَا سُفْيَانُ،عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ وَعَبْدِ الْمَلِكِ بْنِ أَعْيَنَ وَعَاصِمٌ،عَنْ أَبِي وَائِلٍ،عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ... بِمَعْنَاهُ،قَالَ: يَحْضُرُهُ الْكَذِبُ وَالْحَلْفُ. و قَالَ عَبْدُ اللَّهِ الزُّهْرِيُّ اللَّغْوُ وَالْكَذِبُ.";
abudawood.urdu = "سیدنا قیس بن ابی غرزہ رضی اللہ عنہ نے مذکورہ بالا حدیث کے ہم معنی روایت کیا اور کہا: ’’لین دین اور تجارتی امور طے کرتے ہوئے جھوٹ اور قسم شامل ہو جاتی ہے۔‘‘ عبداللہ الزہری نے ’’لغو اور جھوٹ‘‘ کے الفاظ روایت کیے ہیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `سفیان بن عیینۃ صرح بالسماع عند الحمیدي بتحقیقي (438 وسندہ صحیح)`;