var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سِمَاكٌ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ أَبِيهِ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا وَمُؤْكِلَهُ وَشَاهِدَهُ وَكَاتِبَهُ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے سود کھانے،کھلانے،اس کے گواہ اور لکھنے والے (سب) پر لعنت فرمائی ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (1206 وسندہ حسن) ورواہ ابن ماجہ (2277 وسندہ حسن)`;