var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا سُفْيَانُ،عَنْ سِمَاكِ بْنِ حَرْبٍ،حَدَّثَنِي سُوَيْدُ بْنُ قَيْسٍ،قَالَ: جَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ بَزًّا مِنْ هَجَرَ،فَأَتَيْنَا بِهِ مَكَّةَ،فَجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي،فَسَاوَمَنَا بِسَرَاوِيلَ،فَبِعْنَاهُ،وَثَمَّ رَجُلٌ يَزِنُ بِالْأَجْرِ،فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: زِنْ وَأَرْجِحْ.";
abudawood.urdu = "سیدنا سوید بن قیس رضی اللہ عنہ کا بیان ہے کہ میں اور مخرفہ عبدی رضی اللہ عنہ بحرین کے علاقہ ہجر سے کپڑا لائے اور ہم اسے مکہ لے آئے،تو رسول اللہ ﷺ چلتے ہوئے ہمارے پاس تشریف لائے،آپ ﷺ نے ہم سے ایک پاجامے کا سودا کیا جو ہم نے آپ ﷺ کو بیچا اور وہاں ایک آدمی تھا جو مزدوری لے کر مال تولتا تھا،تو رسول اللہ ﷺ نے اس سے فرمایا ’’تولو اور جھکتا ہوا تولو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2924)
انظر الحدیث الآتي (3337)`;