var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ أَبِي رِزْمَةَ سَمِعْتُ أَبِي يَقُولُ قَالَ رَجُلٌ لِشُعْبَةَ: خَالَفَكَ سُفْيَانَ؟ قَالَ: دَمَغْتَنِي. وَبَلَغَنِي،عَنْ يَحْيَى بْنِ مَعِينٍ قَالَ كُلُّ مَنْ خَالَفَ سُفْيَانَ فَالْقَوْلُ قَوْلُ سُفْيَانَ.";
abudawood.urdu = "ابن ابی رزمہ کہتے ہیں کہ میں نے اپنے والد سے سنا کہ ایک شخص نے شعبہ سے کہا کہ سفیان نے آپ کی مخالفت کی ہے۔تو انہوں نے کہا: تو نے مجھے بہت پریشان کیا ہے۔حالانکہ مجھے یحییٰ بن معین کی یہ بات پہنچی ہے کہ جو بھی سفیان کی مخالفت کرے،تو بات سفیان کی راجح ہو گی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;