var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ أَنَّهُ سَمِعَ أَبَا عَبْدِ اللَّهِ الْقُرَشِيَّ يَقُولُ سَمِعْتُ أَبَا بُرْدَةَ بْنَ أَبِي مُوسَى الْأَشْعَرِيَّ يَقُولُ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ أَعْظَمَ الذُّنُوبِ عِنْدَ اللَّهِ أَنْ يَلْقَاهُ بِهَا عَبْدٌ بَعْدَ الْكَبَائِرِ الَّتِي نَهَى اللَّهُ عَنْهَا أَنْ يَمُوتَ رَجُلٌ وَعَلَيْهِ دَيْنٌ لَا يَدَعُ لَهُ قَضَاءً";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے وہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اللہ کے نزدیک اس کے منع کردہ کبائر کے بعد سب سے بڑا گناہ یہ ہے کہ بندے پر جب موت آئے تو وہ مقروض ہو اور اس نے ادائیگی کے لیے کچھ نہ چھوڑا ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو عبد اللّٰہ القرشي لم أجد من وثقہ وھو : ’’ مجہول ‘‘کما فی التحریر (8210)`;
abudawood.anwaar = [121,1];