var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’غنی آدمی کا قرضے کی ادائیگی کو ٹالے جانا ظلم ہے،اور جب تم میں سے کسی کو کسی غنی کے حوالے کیا جائے تو اسے چاہیئے کہ وہ اس بات کو مان لے۔“";
abudawood.hukam = "صحیح بخاری (2287) صحیح مسلم (1564)";
abudawood.description = ``;