var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ مِسْعَرٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ كَانَ لِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَيْنٌ فَقَضَانِي وَزَادَنِي";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم ﷺ پر میرا کچھ قرضہ تھا،آپ ﷺ نے مجھے وہ ادا فرمایا تو اس سے زیادہ دیا۔";
abudawood.hukam = "صحیح بخاری (443) صحیح مسلم (715 بعد ح1599)";
abudawood.description = `مشکوۃ المصابیح (2925)`;