var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا سُفْيَانُ،عَنْ خَالِدٍ،عَنْ أَبِي قِلَابَةَ،عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ،عَنْ عُبَادَةَ بْنِ الصَّامِتِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِهَذَا الْخَبَرِ،يَزِيدُ وَيَنْقُصُ،وَزَادَ: قَالَ: فَإِذَا اخْتَلَفَتْ هَذِهِ الْأَصْنَافُ،فَبِيعُوا كَيْفَ شِئْتُمْ, إِذَا كَانَ يَدًا بِيَدٍ.";
abudawood.urdu = "ابواشعث صنعانی نے یہ حدیث بواسطہ سیدنا عبادہ بن صامت رضی اللہ عنہ نبی کریم ﷺ سے کسی قدر کمی بیشی سے روایت کی ہے اور اضافہ یہ کیا: ’’جب یہ انواع مختلف ہوں تو جیسے چاہو بیچو جبکہ معاملہ ہاتھوں ہاتھ ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (1587)";
abudawood.description = ``;