var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُسْلِمِ بْنِ جُبَيْرٍ عَنْ أَبِي سُفْيَانَ عَنْ عَمْرِو بْنِ حَرِيشٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يُجَهِّزَ جَيْشًا فَنَفِدَتْ الْإِبِلُ فَأَمَرَهُ أَنْ يَأْخُذَ فِي قِلَاصِ الصَّدَقَةِ فَكَانَ يَأْخُذُ الْبَعِيرَ بِالْبَعِيرَيْنِ إِلَى إِبِلِ الصَّدَقَةِ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے انہیں حکم دیا کہ لشکر کی تیاری کریں مگر اونٹ ختم ہو گئے ‘ تو آپ ﷺ نے ان کو حکم دیا کہ صدقہ کی اونٹنیاں آنے تک ادھار لے لیں۔چنانچہ وہ صدقہ کے آنے تک دو دو اونٹوں کے بدلے ایک ایک اونٹ حاصل کر لیا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عمرو بن حریش مجھول الحال کما فی التقریب (5010)<br>وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [121,1];