var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ كَيْلًا وَعَنْ بَيْعِ الْعِنَبِ بِالزَّبِيبِ كَيْلًا وَعَنْ بَيْعِ الزَّرْعِ بِالْحِنْطَةِ كَيْلًا";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے درخت پر لگے کھجور کے پھل کو (خشک) کھجور کے بدلے بیچنے سے منع فرمایا ہے جبکہ خشک کی مقدار معلوم ہو۔اور اسی طرح انگوروں کو کشمش کے بدلے بیچنا جبکہ کشمش کی مقدار معلوم ہو ‘ اور کھیتی کی بیع خشک گندم کے بدلے جبکہ اس کی مقدار معلوم ہو۔(ممنوع ہے)۔";
abudawood.hukam = "صحیح بخاری (2171، 2205) صحیح مسلم (1542)";
abudawood.description = ``;