var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا بِالتَّمْرِ وَالرُّطَبِ";
abudawood.urdu = "جناب خارجہ بن زید بن ثابت اپنے والد (زید بن ثابت رضی اللہ عنہ) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے عرایا کی رخصت عنایت فرمائی ‘ یعنی انسان خشک کھجور کا تازہ سے تبادلہ کر لے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (4541 وسندہ صحیح) ورواہ البخاري (2173) ومسلم (1539)`;