var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ التَّمْرِ بِالتَّمْرِ وَرَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخَرْصِهَا يَأْكُلُهَا أَهْلُهَا رُطَبًا";
abudawood.urdu = "سیدنا سہل بن ابی حثمہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے تازہ کھجور کی خشک کھجور کے ساتھ بیع سے منع فرمایا ہے۔لیکن عرایا کی رخصت دی ہے کہ انسان تازہ کھجور کا اندازہ کر کے (خشک کے بدلے خرید لے) تاکہ وہ لوگ تازہ کھجور کھا سکیں۔";
abudawood.hukam = "صحیح بخاری (2191) صحیح مسلم (1540)";
abudawood.description = ``;