var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ الْأَنْصَارِيِّ أَنَّهُ قَالَ الْعَرِيَّةُ الرَّجُلُ يُعْرِي النَّخْلَةَ أَوْ الرَّجُلُ يَسْتَثْنِي مِنْ مَالِهِ النَّخْلَةَ أَوْ الِاثْنَتَيْنِ يَأْكُلُهَا فَيَبِيعُهَا بِتَمْرٍ";
abudawood.urdu = "جناب عبدربہ بن سعید انصاری نے بیان کیا کہ ’’عرایا‘‘ یہ ہے کہ انسان کسی کو کھجور کا کوئی درخت دیدے یا باغ فروخت کرے تو اس میں سے ایک دو درخت مستثنیٰ کر لے تاکہ تازہ پھل کھا سکے لیکن پھر اسے خشک کھجور کر بدلے بیچ دے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;