var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدَةَ عَنْ ابْنِ إِسْحَقَ قَالَ الْعَرَايَا أَنْ يَهَبَ الرَّجُلُ لِلرَّجُلِ النَّخَلَاتِ فَيَشُقُّ عَلَيْهِ أَنْ يَقُومَ عَلَيْهَا فَيَبِيعُهَا بِمِثْلِ خَرْصِهَا";
abudawood.urdu = "ابن اسحٰق بے بیان کیا کہ ’’عرایا‘‘ یہ ہے کہ کوئی شخص کسی کو کھجوروں کے درخت ہبہ کرے ‘ مگر بعد ازاں ان لوگوں کا آنا جانا اسے شاق گزرے تو ان کے پھل کا اندازہ کر کے خشک کھجور کے بدلے خرید لے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;