var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلَاحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِيَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے اس بات سے منع فرمایا ہے کہ پھلوں کو ان کی صلاحیت ظاہر ہونے سے پہلے فروخت کر دیا جائے۔آپ ﷺ نے فروخت کرنے والے اور خریدنے والے دونوں کو منع کیا ہے۔";
abudawood.hukam = "صحیح بخاری (2194) صحیح مسلم (1534)";
abudawood.description = ``;