var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى يَزْهُوَ وَعَنْ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے اس بات سے منع کیا ہے کہ کھجوروں کا زرد یا سرخ ہونے سے پہلے فروخت کر دیا جائے ‘ یا غلے کو جبکہ وہ بالیوں میں ہو حتیٰ کہ سفید ہو جائیں اور آفت زدگی سے محفوظ ہو جائیں۔آپ ﷺ نے ایسے معاملے سے فروخت کرنے والے اور خریدار دونوں کو منع فرمایا ہے۔";
abudawood.hukam = "صحیح مسلم (1535)";
abudawood.description = ``;