var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ مَوْلًى لِقُرَيْشٍ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْغَنَائِمِ حَتَّى تُقَسَّمَ وَعَنْ بَيْعِ النَّخْلِ حَتَّى تُحْرَزَ مِنْ كُلِّ عَارِضٍ وَأَنْ يُصَلِّيَ الرَّجُلُ بِغَيْرِ حِزَامٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے منع فرمایا ہے کہ غنیمتوں کو تقسیم سے پہلے ہی فروخت کر دیا جائے یا کھجوروں کو فروخت کیا جائے حتیٰ کہ تمام عوارض سے محفوظ ہو جائیں اور اس سے بھی منع کیا ہے کہ انسان کمر بند (پیٹی) کے بغیر نماز پڑھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مولی لقریش : مجہول کما قال المنذري (عون المعبود 260/3)`;
abudawood.anwaar = [121,1];