var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو الْوَلِيدِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْعِنَبِ حَتَّى يَسْوَدَّ وَعَنْ بَيْعِ الْحَبِّ حَتَّى يَشْتَدَّ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے انگوروں کو بیچنے سے منع فرمایا ہے حتیٰ کہ سیاہ ہو جائیں اور کھیتی کو بیچنے سے روکا ہے حتیٰ کہ دانے سخت ہو جائیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2862)
حمید عنعن لکنہ کان یدلس عن ثابت البناني عن أنس رضي اللہ عنہ وثابت البناني ثقۃ`;