var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ الطَّالَقَانِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ وَلَا يُبَاعُ إِلَّا بِالدِّينَارِ أَوْ بِالدِّرْهَمِ إِلَّا الْعَرَايَا";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے پھل کی صلاحیت ظاہر ہونے سے پہلے فروخت کرنے سے منع فرمایا ہے۔اور یہ کہ اسے درہم و دینار (نقد قیمت) ہی سے فروخت کیا جائے۔الا یہ کہ عرایا کی صورت ہو۔";
abudawood.hukam = "صحیح بخاری (2381) صحیح مسلم (1536 بعد ح1543)";
abudawood.description = ``;