var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ وَسَعِيدِ بْنِ مِينَاءَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُعَاوَمَةِ وَقَالَ أَحَدُهُمَا بَيْعُ السِّنِينَ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے ’’بیع معاومہ‘‘ (سالہا سال کے لیے بیع) سے منع فرمایا ہے جبکہ (ابولزبیر اور سعید بن میناء میں سے کسی) ایک نے ’’بیع السنین‘‘ کا لفظ بیان کیا۔";
abudawood.hukam = "صحیح مسلم (1554)";
abudawood.description = ``;