var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرٍ وَعُثْمَانُ ابْنَا أَبِي شَيْبَةَ قَالَا حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْغَرَرِ زَادَ عُثْمَانُ وَالْحَصَاةِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے دھوکے والی بیع سے منع فرمایا ہے۔عثمان نے مزید کہا: بیع الحصاۃ سے بھی (منع فرمایا)۔";
abudawood.hukam = "صحیح مسلم (1513)";
abudawood.description = ``;