var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَنْبَسَةُ بْنُ خَالِدٍ،حَدَّثَنَا يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ،أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِمَعْنَى حَدِيثِ سُفْيَانَ وَعَبْدِ الرَّزَّاقِ جَمِيعًا.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے منع فرمایا ہے۔آگے سفیان اور عبدالرزاق کی احادیث (3377،3378) کے ہم معنی بیان کیا۔";
abudawood.hukam = "صحیح بخاری (5820) صحیح مسلم (1512)";
abudawood.description = ``;