var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَهُ،وقَالَ: وَحَبَلُ الْحَبَلَةِ: أَنْ تُنْتَجَ النَّاقَةُ بَطْنَهَا ثُمَّ تَحْمِلُ الَّتِي نُتِجَتْ.";
abudawood.urdu = "جناب نافع نے بواسطہ سیدنا عبداللہ بن عمر رضی اللہ عنہ نبی کریم ﷺ سے اسی حدیث کی مانند روایت کیا اور کہا «حبل الحبلۃ» یہ ہے کہ یہ اونٹنی بچہ جنے گی ‘ پھر جب وہ پیدا ہونے والی اونٹنی حاملہ ہو گی (تو اس وقت ادائیگی ہو گی۔)";
abudawood.hukam = "صحیح بخاری (3843) صحیح مسلم (1514)";
abudawood.description = ``;