var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْمِصِّيصِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ الزِّبْرِقَانِ عَنْ أَبِي حَيَّانَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ رَفَعَهُ قَالَ إِنَّ اللَّهَ يَقُولُ أَنَا ثَالِثُ الشَّرِيكَيْنِ مَا لَمْ يَخُنْ أَحَدُهُمَا صَاحِبَهُ فَإِذَا خَانَهُ خَرَجْتُ مِنْ بَيْنِهِمَا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے مرفوعاً بیان کیا ’’اﷲ تعالیٰ فرماتا ہے میں دو شریکوں (ساجھے داروں) کا تیسرا ہوں جب تک ان میں کوئی ایک دوسرے کی خیانت نہ کرے۔جب کوئی خیانت کرتا ہے تو میں ان کے درمیان سے نکل جاتا ہوں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2933)`;