var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَ اشْتَرَكْتُ أَنَا وَعَمَّارٌ وَسَعْدٌ فِيمَا نُصِيبُ يَوْمَ بَدْرٍ قَالَ فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ وَلَمْ أَجِئْ أَنَا وَعَمَّارٌ بِشَيْءٍ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ بدر کی جنگ والے دن میں ‘ سیدنا عمار اور سعد رضی اللہ عنہما نے آپس میں طے کیا کہ جو بھی ہمیں ملے گا ہم تینوں اس میں شریک ہوں گے۔چنانچہ سیدنا سعد رضی اللہ عنہ تو دو قیدی لے آئے مگر میں اور سیدنا عمار رضی اللہ عنہ کچھ نہ لا سکے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3969،4701) ابن ماجہ (2288)<br>أبو عبیدۃ لم یدرک أباہ کما تقدم (995) وأبو إسحاق عنعن`;
abudawood.anwaar = [122,1];