var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ بَكْرِ بْنِ سَوَادَةَ،عَنْ أَبِي عَبْدِ اللَّهِ مَوْلَى إِسْمَاعِيلَ بْنِ عُبَيْدٍ،عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّ رَجُلَيْنِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ";
abudawood.urdu = "جناب عطاء بن یسار سے روایت ہے کہ بیشک رسول اللہ ﷺ کے صحابہ میں سے دو آدمی (سفر پر نکلے) اور مذکورہ بالا حدیث کے ہم معنی روایت کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (534)
والحدیث السابق (338) شاھد لہ`;