var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ أَنَّهُ سَأَلَ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الْأَرْضِ فَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ الْأَرْضِ فَقَالَ أَبِالذَّهَبِ وَالْوَرِقِ فَقَالَ أَمَّا بِالذَّهَبِ وَالْوَرِقِ فَلَا بَأْسَ بِهِ";
abudawood.urdu = "جناب حنظلہ بن قیس انصاری کہتے ہیں کہ انہوں نے سیدنا رافع بن خدیج رضی اللہ عنہ سے پوچھا کہ زمین کو کرایہ پر دینا کیسا ہے؟ تو انہوں نے کہا کہ رسول اللہ ﷺ نے زمین کرائے پر دینے سے منع فرمایا ہے۔میں نے پوچھا کہ کیا سونے اور چاندی کے بدلے بھی منع ہے؟ تو کہا کہ سونے اور چاندی کے بدلے میں کوئی حرج نہیں۔";
abudawood.hukam = "صحیح مسلم (1547)";
abudawood.description = ``;