var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بُزَيْعٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنِ عَطَاءٍ عَنْ سَعِيدٍ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نبی کریم ﷺ سے (ایک دوسری سند سے بھی) مذکورہ بالا حدیث کے ہم معنی روایت کرتی ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سعید بن أبي عروبۃ مدلس (طبقات المدلسین: 2/50 وھو من الثالثۃ) وعنعن<br>والحدیث السابق (الأصل: 32 وسندہ حسن) یغني عنہ`;
abudawood.anwaar = [14,2];