var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَطَاءٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَلَيْسَ لَهُ مِنْ الزَّرْعِ شَيْءٌ وَلَهُ نَفَقَتُهُ";
abudawood.urdu = "سیدنا رافع بن خدیج رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کسی کی زمین مالکوں کی اجازت کے بغیر کاشت کی ہو اس کے لیے اس کھیتی میں سے کچھ نہیں۔البتہ خرچہ لے سکتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1366) ابن ماجہ (2466)<br>أبو إسحاق مدلس وعنعن<br>وعطاء لم یسمع من رافع بن خدیج رضي اللّٰہ عنہ`;
abudawood.anwaar = [122,1];