var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو حَفْصٍ عُمَرُ بْنُ يَزِيدَ السَّيَّارِيُّ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ يُونُسَ بْنِ عُبَيدٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَعَنْ الثُّنْيَا إِلَّا أَنْ يُعْلَمَ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے روایت کیا کہ رسول اللہ ﷺ نے مزابنہ،محاقلہ اور استثناء کر لینے سے منع فرمایا ہے الا یہ کہ معلوم اور متعین ہو۔";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شاھد عند مسلم (1536)`;