var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا ابْنُ رَجَاءٍ يَعْنِي الْمَكِّيَّ قَالَ ابْنُ خُثَيْمٍ حَدَّثَنِي عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ لَمْ يَذَرْ الْمُخَابَرَةَ فَلْيَأْذَنْ بِحَرْبٍ مِنْ اللَّهِ وَرَسُولِهِ";
abudawood.urdu = "جناب ابو الزبیر،سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت کرتے ہیں،کہتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ہے ’’جو شخص مخابرہ (مزارعت) نہ چھوڑے تو اسے چاہیئے کہ اللہ اور اس کے رسول سے جنگ کے لیے تیار رہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الزبیر عنعن`;
abudawood.anwaar = [122,1];