var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ عَنْ جَعْفَرِ بْنِ بُرْقَانَ عَنْ ثَابِتِ بْنِ الْحَجَّاجِ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُخَابَرَةِ قُلْتُ وَمَا الْمُخَابَرَةُ قَالَ أَنْ تَأْخُذَ الْأَرْضَ بِنِصْفٍ أَوْ ثُلُثٍ أَوْ رُبْعٍ";
abudawood.urdu = "سیدنا زید بن ثابت رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ مخابرہ سے منع فرمایا ہے۔(ثابت بن حجاج نے پوچھا کہ) مخابرہ سے کیا مراد ہے؟ انہوں نے کہا: یہ کہ تو زمین کو آدھی،تہائی یا چوتھائی پر حاصل کر لے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;