var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے اہل خیبر سے معاملہ طے فرمایا تھا کہ جو پھل یا کھیتی آئے گی اس میں سے آدھا انہیں ملے گا۔";
abudawood.hukam = "صحیح بخاری (2329) صحیح مسلم (1551)";
abudawood.description = ``;