var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ اللَّيْثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ غَنَجٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرَ ثَمَرَتِهَا";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے خیبر کی کھجوریں اور وہاں کی زمینیں اہل خیبر کو اس شرط پر دے دی تھیں کہ وہ ان میں اپنے خرچ پر محنت کریں گے اور رسول اللہ ﷺ کو ان کا آدھا پھل ملے گا۔";
abudawood.hukam = "صحیح مسلم (1551)";
abudawood.description = ``;