var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ عَنْ مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جمعہ کے روز غسل کرنا ہر بالغ پر واجب ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (895) صحیح مسلم (846)";
abudawood.description = ``;