var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ ابْنُ سَهْلٍ الرَّمْلِيُّ،حَدَّثَنَا زَيْدُ بْنُ أَبِي الزَّرْقَاءِ،عَنْ جَعْفَرِ بْنِ بُرْقَانَ بِإِسْنَادِهِ وَمَعْنَاهُ،قَالَ: فَحَزَرَ،وَقَالَ عِنْدَ قَوْلِهِ: وَكُلَّ صَفْرَاءَ وَبَيْضَاءَ: يَعْنِي: الذَّهَبَ وَالْفِضَّةَ لَهُ.";
abudawood.urdu = "جعفر بن برقان نے اپنی مذکورہ سند سے اس حدیث کے ہم معنی بیان کیا اور «فحزر» کا لفظ استعمال کیا۔اور «وکل صفراء وبیضاء» کے بعد یعنی «الذہب والفضۃ لہ» بھی کہا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (2410)`;