var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ أَبِي خَلَفٍ،حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ،عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنَّهُ قَالَ: أَفَاءَ اللَّهُ عَلَى رَسُولِهِ خَيْبَرَ،فَأَقَرَّهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا كَانُوا،وَجَعَلَهَا بَيْنَهُ وَبَيْنَهُمْ،فَبَعَثَ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ،فَخَرَصَهَا عَلَيْهِمْ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ نے بیان کیا کہ جب اللہ عزوجل نے خیبر اپنے رسول کو بطور فے عنایت فرمایا تو رسول اللہ ﷺ نے یہودیوں کو اس کی زمینوں پر ویسے ہی رہنے دیا جیسے کہ وہ پہلے تھے اور ان کے اور اپنے درمیان متعین حصے طے کر لیے۔چنانچہ آپ نے سیدنا عبداللہ بن رواحہ رضی اللہ عنہ کو بھیجا جنہوں نے ان پر پھلوں کا اندازہ لگایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الزبیر مدلس وعنعن في ھذا اللفظ والحدیث الآتي (الأصل : 3415) یغني عنہ`;
abudawood.anwaar = [122,1];