var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَخِيهِ مَعْبَدِ بْنِ سِيرِينَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ.";
abudawood.urdu = "معبد بن سیرین نے سیدنا ابو سعید خدری رضی اللہ عنہ سے،معبد بن سیرین نے سیدنا ابو سعید خدری رضی اللہ عنہ سے،";
abudawood.hukam = "صحیح بخاری (5007) صحیح مسلم (2201)";
abudawood.description = ``;