var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،أَخْبَرَنَا أَبَانُ،عَنْ يَحْيَى،عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ يَعْنِي ابْنَ قَارِظٍ عَنِ السَّائِبِ بْنِ يَزِيدَ،عَنْ رَافِعِ بْنِ خَدِيجٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: كَسْبُ الْحَجَّامِ خَبِيثٌ،وَثَمَنُ الْكَلْبِ خَبِيثٌ،وَمَهْرُ الْبَغِيِّ خَبِيثٌ.";
abudawood.urdu = "سیدنا رافع بن خدیج رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’سینگی لگانے والے کی کمائی ناپسندیدہ ہے،کتے کی قیمت خبیث ہے اور بدکار عورت کی خرچی خبیث ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (1568)";
abudawood.description = ``;