var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ عَنِ ابْنِ مُحَيِّصَةَ،عَنْ أَبِيهِ أَنَّهُ اسْتَأْذَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِجَارَةِ الْحَجَّامِ؟ فَنَهَاهُ عَنْهَا،فَلَمْ يَزَلْ يَسْأَلُهُ وَيَسْتَأْذِنُهُ،حَتَّى أَمَرَهُ أَنْ: أَعْلِفْهُ نَاضِحَكَ وَرَقِيقَكَ.";
abudawood.urdu = "جناب ابن محیصہ (حرام بن سعد بن محیصہ) اپنے والد (یعنی دادا) سے روایت کرتے ہیں انہوں نے (محیصہ رضی اللہ عنہ نے) رسول اللہ ﷺ سے پچھنے لگانے کی اجرت کے متعلق دریافت کیا،تو آپ ﷺ نے انہیں منع فرما دیا۔وہ پھر بھی آپ ﷺ سے سوال کرتے اور اجازت چاہتے رہے حتیٰ کہ آپ ﷺ نے انہیں حکم دیا کہ اسے اپنی اونٹنی اور اپنے غلام کو کھلا دے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2778)
أخرجہ الترمذي (1277) وابن ماجہ (2166) وانظر مسند الحمیدي بتحقیقي (1293، 880)`;