var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا خَالِدٌ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،قَالَ: احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ،وَلَوْ عَلِمَهُ خَبِيثًا لَمْ يُعْطِهِ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے پچھنے لگوائے اور حجام کو اس کی اجرت دی۔اگر یہ کام یا اجرت خبیث (حرام) ہوتی تو اسے نہ دیتے۔";
abudawood.hukam = "صحیح بخاری (2279)";
abudawood.description = ``;