var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ حُمَيْدٍ الطَّوِيلِ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّهُ قَالَ: حَجَمَ أَبُو طَيْبَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَأَمَرَ لَهُ بِصَاعٍ مِنْ تَمْرٍ،وَأَمَرَ أَهْلَهُ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خَرَاجِهِ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ جناب ابوجیبہ (نافع) رضی اللہ عنہ نے رسول اللہ ﷺ کو پچھنے لگائے تو آپ ﷺ نے اسے ایک صاع کھجور دینے کا حکم دیا۔اور اس کے مالکوں سے سفارش فرمائی کہ اس پر لاگو خراج میں تخفیف کریں۔";
abudawood.hukam = "صحیح بخاری (2102) صحیح مسلم (1577)";
abudawood.description = ``;