var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،عَنْ عُبَيْدِ اللَّهِ يَعْنِي ابْنَ هُرَيْرٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ رَافِعٍ هُوَ ابْنُ خَدِيجٍ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْأَمَةِ،حَتَّى يُعْلَمَ مِنْ أَيْنَ هُوَ؟!.";
abudawood.urdu = "جناب رافع بن خدیج رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے لونڈی کی کمائی سے منع فرمایا ہے حتیٰ کہ جانا جائے کہ کہاں سے کمایا ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `وللحدیث شواھد انظر الحدیث السابق (3426)`;