var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ،عَنْ سُفْيَانَ عَنِ الزُّهْرِيِّ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي مَسْعُودٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ نَهَى عَنْ ثَمَنِ الْكَلْبِ،وَمَهْرِ الْبَغِيِّ،وَحُلْوَانِ الْكَاهِنِ.";
abudawood.urdu = "سیدنا ابومسعود رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے کتے کی قیمت،بدکار عورت کی کمائی اور کاہن کے نذرانے سے منع فرمایا ہے۔";
abudawood.hukam = "صحیح بخاری (5761) صحیح مسلم (1567)";
abudawood.description = ``;