var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى،حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ،حَدَّثَنَا ابْنُ إِسْحَاقَ عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ الْحُرَقِيِّ عَنِ ابْنِ مَاجِدَةَ السَّهْمِيِّ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَهُ.";
abudawood.urdu = "ابوماجدہ (ابن ماجدہ سہمی) سہمی نے بواسطہ سیدنا عمر بن خطاب رضی اللہ عنہ نبی کریم ﷺ سے اسی حدیث کی مانند روایت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>علي بن ماجدۃ : مجہول (تقریب التہذیب: 4786) وقال البخاري :’’ لم یصح إسنادہ ‘‘ (التاریخ الکبیر298/6)`;
abudawood.anwaar = [123,1];