var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ،حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،حَدَّثَنَا الْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ الْحُرَقِيُّ عَنِ ابْنِ مَاجِدَةَ السَّهْمِيِّ،عَنْ عُمَرَ ابْنِ الْخَطَّابِ رَضِي اللَّهُ عَنْهُ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... مِثْلَهُ.";
abudawood.urdu = "ابن ماجدہ سہمی نے بواسطہ سیدنا عمر بن خطاب رضی اللہ عنہ نبی کریم ﷺ سے اس حدیث کی مثل روایت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیثین السابقین (3430،3431)`;
abudawood.anwaar = [123,1];