var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،عَنْ عُمَرَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِصَّةِ الْعَبْدِ وَعَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِصَّةِ النَّخْلِ.\nقَالَ أَبو دَاود: وَاخْتَلَفَ الزُّهْرِيُّ وَنَافِعٌ فِي أَرْبَعَةِ أَحَادِيثَ هَذَا أَحَدُهَا.";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ نے رسول اللہ ﷺ سے غلام کا قصہ اور سیدنا ابن عمر رضی اللہ عنہما نے نبی کریم ﷺ سے کھجور کا مسئلہ بیان کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ زہری اور نافع نے چار احادیث میں اختلاف کیا ہے۔ان میں سے ایک یہ ہے۔";
abudawood.hukam = "صحیح بخاری (2379) صحیح مسلم (1543)";
abudawood.description = ``;