var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،حَدَّثَنِي سَلَمَةُ بْنُ كُهَيْلٍ،حَدَّثَنِي مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ،فَمَالُهُ لِلْبَائِعِ،إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے غلام فروخت کیا اور اس کے پاس مال ہو تو اس کا مال فروخت کرنے والے کا ہو گا سوائے اس کے کہ خریدار شرط کر لے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3433) فھو شاھد لہ`;