var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ،وَلَا تَلَقَّوُا السِّلَعَ حَتَّى يُهْبَطَ بِهَا الْأَسْوَاقَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کوئی شخص کسی دوسرے کے سودے پر سودا نہ کرے اور نہ سامان لانے والوں سے راستے میں ملو حتیٰ کہ اسے منڈی میں اتار لیا جائے۔‘‘";
abudawood.hukam = "صحیح بخاری (2139، 2165) صحیح مسلم (1412 بعد ح 1514)";
abudawood.description = ``;