var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا مُحَمَّدُ بْنُ ثَوْرٍ،عَنْ مَعْمَرٍ عَنِ ابْنِ طَاوُسٍ،عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ\nفَقُلْتُ: مَا يَبِيعُ حَاضِرٌ لِبَادٍ؟ قَالَ: لَا يَكُونُ لَهُ سِمْسَارًا.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے اس بات سے منع فرمایا ہے کہ کوئی شہری کسی دیہاتی کے لیے خرید و فروخت کا کام کرے۔(طاؤس کہتے ہیں) میں نے وضاحت چاہی کہ اس کا کیا مفہوم ہے؟ تو کہا کہ کوئی شہری کسی دیہاتی کے لیے دلال نہ بنے۔";
abudawood.hukam = "صحیح بخاری (2158) صحیح مسلم (1521)";
abudawood.description = ``;