var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبِعْ حَاضِرٌ لِبَادٍ وَذَرُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’کوئی شہری کسی دیہاتی کے لیے خرید و فروخت نہ کرے۔لوگوں کو چھوڑ دو،اللہ بعض کو بعض سے رزق دیتا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (1522)";
abudawood.description = ``;