var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ وَهِشَامٌ وَحَبِيبٌ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ إِنْ شَاءَ رَدَّهَا وَصَاعًا مِنْ طَعَامٍ لَا سَمْرَاءَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جس نے کوئی ایسی بکری خرید لی جس کا دودھ روکا گیا تھا،تو اسے تین دن تک اختیار ہے اگر وہ چاہے تو واپس کر دے اور ایک صاع طعام بھی ساتھ لوٹائے،لیکن سمراء (عمدہ گندم) نہ ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (1524)";
abudawood.description = ``;