var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا صَدَقَةُ بْنُ سَعِيدٍ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ التَّيْمِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ مُحَفَّلَةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا مِثْلَ أَوْ مِثْلَيْ لَبَنِهَا قَمْحًا";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کوئی ایسا جانور خریدا جس کا دودھ روکا گیا تھا،تو اسے تین دن تک اختیار ہے۔اگر اسے واپس کرے تو اس کے دودھ کے بقدر یا اس سے دوگنی گندم بھی واپس کرے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2240)<br>صدقۃ وجمیع ضعیفان کما`;
abudawood.anwaar = [123,1];