var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا مُعْتَمِرٌ،قَالَ: سَمِعْتُ مُحَمَّدَ بْنَ فَضَاءٍ يُحَدِّثُ،عَنْ أَبِيهِ،عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِيهِ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُكْسَرَ سِكَّةُ الْمُسْلِمِينَ الْجَائِزَةُ بَيْنَهُمْ, إِلَّا مِنْ بَأْسٍ.";
abudawood.urdu = "جناب علقمہ بن عبداللہ اپنے والد سے بیان کرتے ہیں کہ رسول اللہ ﷺ نے مسلمانوں میں رائج الوقت سکے کو توڑنے سے منع فرمایا ہے سوائے اس کے کہ کوئی خاص ضرورت ہو۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2263)<br>محمد بن فضاء : ضعیف وأبوہ مجہول (تق : 6223،5393)`;
abudawood.anwaar = [123,1];