var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ نَافِعٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ،مَا لَمْ يَفْتَرِقَا،إِلَّا بَيْعَ الْخِيَارِ.";
abudawood.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نےفرمایا خریدنے اوربیچنےوالوں میں دونوں کواختیار حاصل ہوتا ہے (کہ وہ اپنے سودے کومنسوخ کردیں)جب تک کہ جدانہ ہوجائیں۔سوائے اس کے کہ سودا ہی اختیار کاہو۔(یعنی جدا ہونےکےبعدکی جتنی زیادہ یا کم مدت وہ آپس میں طے کر لیں اختیار قائم رہے گا)";
abudawood.hukam = "صحیح بخاری (2111) صحیح مسلم (1531)";
abudawood.description = ``;