var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِمَعْنَاهُ،قَالَ: أَوْ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ: اخْتَرْ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے نبی کریم ﷺ سے اس حدیث کے ہم معنی روایت کیا۔فرمایا ’’یا کوئی دوسرے کو یوں کہہ دے کہ (ابھی) پسند کر لو۔‘‘";
abudawood.hukam = "صحیح بخاری (2109) صحیح مسلم (1531)";
abudawood.description = ``;