var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ عَنِ ابْنِ عَجْلَانَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا،إِلَّا أَنْ تَكُونَ صَفْقَةَ خِيَارٍ،وَلَا يَحِلُّ لَهُ أَنْ يُفَارِقَ صَاحِبَهُ خَشْيَةَ أَنْ يَسْتَقِيلَهُ.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’دو بیع کرنے والوں کا جدا ہونے سے پہلے تک اختیار باقی رہتا ہے الا یہ کہ سودے میں اختیار طے کر لیا گیا ہو،اور کسی کے لیے بھی حلال نہیں کہ سودا واپس کر لیے جانے کے اندیشے کی وجہ سے ارادتاً اپنے ساتھی کو چھوڑ کر چلا جائے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2804)
ابن عجلان تابعہ بکیر بن عبد اللہ الأشج عند الدارقطني (3/50) وذکر السماع المسلسل`;