var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْجَرْجَرَائِيُّ قَالَ مَرْوَانُ الْفَزَارِيُّ،أَخْبَرَنَا،عَنْ يَحْيَى بْنِ أَيُّوبَ،قَالَ: كَانَ أَبُو زُرْعَةَ إِذَا بَايَعَ رَجُلًا خَيَّرَهُ قَالَ: ثُمَّ يَقُولُ: خَيِّرْنِي،وَيَقُولُ: سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَفْتَرِقَنَّ اثْنَانِ إِلَّا عَنْ تَرَاضٍ.";
abudawood.urdu = "یحییٰ بن ایوب بیان کرتے ہیں کہ جناب ابوزرعہ رحمہ اللہ جب کسی سے کوئی خرید و فروخت کرتے تو اس کو اختیار دیتے،پھر اسے کہتے کہ مجھے اختیار کر لینے کی مہلت دو۔اور بیان کرتے کہ میں نے سیدنا ابوہریرہ رضی اللہ عنہ سے سنا ہے کہ رسول اللہ ﷺ نے فرمایا ہے ’’(بیع کرنے والے) دونوں افراد رضا مندی کے بغیر ہرگز جدا نہ ہوں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2805)
أخرجہ الترمذي (1248 وسندہ حسن)`;