var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ خَالِدِ بْنِ يَزِيدَ،عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ،عَنْ عُبَادَةَ بْنِ نُسَيٍّ،عَنْ أَوْسٍ الثَّقَفِيِّ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «مَنْ غَسَلَ رَأْسَهُ يَوْمَ الْجُمُعَةِ وَاغْتَسَلَ» ثُمَّ سَاقَ نَحْوَهُ";
abudawood.urdu = "سیدنا اوس ثقفی رضی اللہ عنہ،رسول اللہ ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس نے جمعہ کے روز اپنا سر دھویا اور غسل کیا۔‘‘ اور مثل سابق روایت بیان کی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انظر الحدیث السابق`;