var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،عَنْ يَحْيَى بْنِ زَكَرِيَّا،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ بَاعَ بَيْعَتَيْنِ فِي بَيْعَةٍ،فَلَهُ أَوْكَسُهُمَا أَوِ الرِّبَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے ایک سودے میں دو سودے کیے تو اس کے لیے ان میں سے یا تو کم قیمت ہے یا سود ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2868)
رواہ الترمذي (1231 وسندہ حسن) والنسائي (4636 وسندہ حسن) بلفظ ’’نھي عن بیعتین في بیعۃ‘‘`;