var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى،حَدَّثَنَا أَبُو بَدْرٍ،عَنْ زِيَادِ بْنِ خَيْثَمَةَ،عَنْ سَعْدٍ يَعْنِي الطَّائِيَّ،عَنْ عَطِيَّةَ بْنِ سَعْدٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ أَسْلَفَ فِي شَيْءٍ, فَلَا يَصْرِفْهُ إِلَى غَيْرِهِ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کسی چیز میں بیع سلف کی ہو تو اسے دوسری سے نہ بدلے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2283)<br>عطیۃ العوفي ضعیف مدلس`;
abudawood.anwaar = [124,1];