var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي عُثْمَانُ بْنُ الْحَكَمِ،عَنْ ابْنِ جُرَيْجٍ،عَنْ عَطَاءٍ،قَالَ: الْجَوَائِحُ كُلُّ ظَاهِرٍ مُفْسِدٍ مِنْ مَطَرٍ،أَوْ بَرَدٍ،أَوْ جَرَادٍ،أَوْ رِيحٍ،أَوْ حَرِيقٍ.";
abudawood.urdu = "جناب عطاء رحمہ اللہ سے منقول ہے کہ آفت سے مراد (وہ) تمام ظاہری اسباب ہیں،مثلاً بارش،ژالہ باری،ٹڈی دل،آندھی یا آگ لگنا وغیرہ (جو کھیت یا مال کو ضائع کر دیں)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;