var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ،أَخْبَرَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي عُثْمَانُ بْنُ الْحَكَمِ،عَنْ يَحْيَى بْنِ سَعِيدٍ،أَنَّهُ قَالَ: لَا جَائِحَةَ فِيمَا أُصِيبَ دُونَ ثُلُثِ رَأْسِ الْمَالِ.\nقَالَ يَحْيَى: وَذَلِكَ فِي سُنَّةِ الْمُسْلِمِينَ.";
abudawood.urdu = "جناب یحییٰ بن سعید رحمہ اللہ نے بیان کیا کہ اصل مال کی تہائی سے کم میں آفت آئے (اور نقصان ہو جائے) تو اس کی تلافی ضروری نہیں ہے اور مسلمانوں میں ایسے ہی رائج ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;