var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلَأُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’گھاس محفوظ رکھنے کی غرض سے زائد پانی نہ روکا جائے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البخاري (2353) ومسلم (1566)`;