var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ عَنِ الْأَعْمَشِ بِإِسْنَادِهِ وَمَعْنَاهُ،قَالَ: وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ،وَقَالَ فِي السِّلْعَةِ: بِاللَّهِ لَقَدْ أُعْطِيَ بِهَا كَذَا وَكَذَا،فَصَدَّقَهُ الْآخَرُ فَأَخَذَهَا.";
abudawood.urdu = "جناب اعمش نے اس روایت کو اپنی سند سے اسی حدیث کے ہم معنی بیان کیا،کہا: ’’اور اللہ ایسے لوگوں کو پاک نہیں کرے گا اور ان کے لیے درد ناک عذاب ہو گا۔‘‘ اور فروخت کے سامان کے بارے میں کہا کہ یوں کہے: ’’اللہ کی قسم! مجھے اس کا اتنا اتنا دیا گیا (مگر میں نے نہیں دیا لیکن تمہیں کم میں دے رہا ہوں) اور دوسرا اس کو (اس کی اس بات میں) سچا سمجھے اور اسے خرید لے۔‘‘";
abudawood.hukam = "صحیح بخاری (2672) صحیح مسلم (108)";
abudawood.description = ``;