var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ أَبِي الْمِنْهَالِ،عَنْ إِيَاسِ بْنِ عَبْدٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِ.";
abudawood.urdu = "سیدنا ایاس بن عبد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے زائد پانی کی فروخت سے منع فرمایا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (1271 وسندہ صحیح)`;