var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ ح،وحَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ وَعَلِيُّ بْنُ بَحْرٍ،قَالَا: حَدَّثَنَا عِيسَى وَقَالَ إِبْرَاهِيمُ،أَخْبَرَنَا عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَالسِّنَّوْرِ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے کتے اور بلے کی قیمت سے منع فرمایا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2346)
وأصلہ عند مسلم (1569) وھو شاھد لہ`;