var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا زَكَرِيَّا حَدَّثَنَا مُصْعَبُ بْنُ شَيْبَةَ عَنْ طَلْقِ بْنِ حَبِيبٍ الْعَنَزِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّهَا حَدَّثَتْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ مِنْ أَرْبَعٍ مِنْ الْجَنَابَةِ وَيَوْمَ الْجُمُعَةِ وَمِنْ الْحِجَامَةِ وَمِنْ غُسْلِ الْمَيِّتِ";
abudawood.urdu = "سیدنا عبداللہ بن زبیر رضی اللہ عنہما سے روایت ہے کہ سیدہ عائشہ رضی اللہ عنہا نے ان سے بیان کیا کہ نبی کریم ﷺ چار کاموں (کی وجہ) سے غسل کیا کرتے تھے،جنابت سے،جمعہ کے دن،سینگی لگوانے سے اور میت کو غسل دینے سے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (542)`;