var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ عَنْ قَيْسِ بْنِ حَبْتَرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وَإِنْ جَاءَ يَطْلُبُ ثَمَنَ الْكَلْبِ فَامْلَأْ كَفَّهُ تُرَابًا";
abudawood.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے کتے کی قیمت سے منع فرمایا ہے۔اور اگر وہ (بیچنے والا) کتے کی قیمت کا مطالبہ کرنے آئے تو اس کی ہتھیلی مٹی سے بھر دو۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `عبد الکریم ھو الجزري`;