var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي مَعْرُوفُ بْنُ سُوَيْدٍ الْجُذَامِيُّ أَنَّ عُلَيَّ بْنَ رَبَاحٍ اللَّخْمِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ ثَمَنُ الْكَلْبِ وَلَا حُلْوَانُ الْكَاهِنِ وَلَا مَهْرُ الْبَغِيِّ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کتے کی قیمت،کاہن کا نذرانہ اور زانیہ کی خرچی حلال نہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (4298 وسندہ حسن)`;