var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ عَبْدِ الْوَهَّابِ بْنِ بُخْتٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ حَرَّمَ الْخَمْرَ وَثَمَنَهَا وَحَرَّمَ الْمَيْتَةَ وَثَمَنَهَا وَحَرَّمَ الْخِنْزِيرَ وَثَمَنَهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’بیشک اللہ تعالیٰ نے شراب اور اس کی قیمت (یعنی خرید و فروخت) کو حرام کیا ہے،مردار اور اس کی قیمت کو حرام کیا ہے۔خنزیر اور اس کی قیمت کو حرام کیا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;