var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ وَوَكِيعٌ عَنْ طُعْمَةَ بْنِ عَمْرٍو الْجَعْفَرِيِّ عَنْ عُمَرَ بْنِ بَيَانٍ التَّغْلِبِيِّ عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَاعَ الْخَمْرَ فَلْيُشَقِّصْ الْخَنَازِيرَ";
abudawood.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شراب بیچتا ہے اسے چاہیئے کہ خنزیر کو (کھانا) حلال سمجھے۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عمر بن بیان :مجہول الحال،کما فی التحریر (4869) وثقہ ابن حبان وحدہ`;
abudawood.anwaar = [124,1];