var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ أَخْبَرَنَا مَرْوَانُ حَدَّثَنَا عَلِيُّ بْنُ حَوْشَبٍ قَالَ سَأَلْتُ مَكْحُولًا عَنْ هَذَا الْقَوْلِ غَسَّلَ وَاغْتَسَلَ فَقَالَ غَسَّلَ رَأْسَهُ وَغَسَلَ جَسَدَهُ";
abudawood.urdu = "جناب علی بن حوشب کہتے ہیں کہ میں نے مکحول (شامی تابعی) سے حدیث «غسل و اغتسل» کے بارے میں پوچھا تو انہوں نے کہا: اس سے مراد یہ ہے کہ جس نے اپنا سر دھویا اور پھر غسل کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;