var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا شُعْبَةُ،عَنْ سُلَيْمَانَ،عَنْ أَبِي الضُّحَى،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ،قَالَتْ: لَمَّا نَزَلَتِ الْآيَاتُ الْأَوَاخِرُ مِنْ سُورَةِ الْبَقَرَةِ،خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَهُنَّ عَلَيْنَا،وَقَالَ: حُرِّمَتِ التِّجَارَةُ فِي الْخَمْرِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ جب سورۃ البقرہ کی آخری آیات نازل ہوئیں،تو رسول اللہ ﷺ نکلے اور انہیں ہم پر پڑھا اور فرمایا ’’شراب کی تجارت حرام کر دی گئی ہے۔“";
abudawood.hukam = "صحیح بخاری (2226) صحیح مسلم (1580)";
abudawood.description = ``;