var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ قَالَ كُنَّا فِي زَمَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنْ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ يَعْنِي جُزَافًا";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ کے زمانے میں ہم غلہ خریدا کرتے تھے۔پس آپ ﷺ ہمارے پاس آدمی بھیجتے جو ہمیں حکم دیتا کہ ہم اسے فروخت کرنے سے پہلے خریدنے کی جگہ سے دوسری جگہ منتقل کر لیں۔یعنی اندازے سے (جو) خرید و فروخت کرتے تھے (اس سے منع کر دیا گیا)۔";
abudawood.hukam = "صحیح مسلم (1527)";
abudawood.description = `ورواہ البخاري (2123)`;