var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَ كَانُوا يَتَبَايَعُونَ الطَّعَامَ جُزَافًا بِأَعْلَى السُّوقِ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعُوهُ حَتَّى يَنْقُلُوهُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے بیان کیا کہ لوگ منڈی کی بالائی جانب اندازے سے غلہ خریدتے تھے،تو رسول اللہ ﷺ نے اس کو فروخت کرنے سے منع فرما دیا،یہاں تک کہ وہ اسے دوسری جگہ منتقل کر لیں۔";
abudawood.hukam = "صحیح بخاری (1526)";
abudawood.description = `مشکوۃ المصابیح (2843)
انظر الحدیث السابق (3493)`;