var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا عَمْرٌو عَنْ الْمُنْذِرِ بْنِ عُبَيْدٍ الْمَدِينِيِّ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَبِيعَ أَحَدٌ طَعَامًا اشْتَرَاهُ بِكَيْلٍ حَتَّى يَسْتَوْفِيَهُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے منع فرمایا ہے کہ جس نے متعین کیل (ناپ) میں غلہ خریدا ہو،تو اسے قبضے میں لیے بغیر آگے فروخت کر دے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4608)<br>منذر بن عبید و ثقہ ابن حبان وحدہ<br>والحدیث الآتي (الأصل : 3492) یغني عنہ`;
abudawood.anwaar = [124,1];