var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ رَأَيْتُ النَّاسَ يُضْرَبُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَرَوْا الطَّعَامَ جُزَافًا أَنْ يَبِيعُوهُ حَتَّى يُبْلِغَهُ إِلَى رَحْلِهِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ میں نے دیکھا کہ رسول اللہ ﷺ کے دور میں اگر کوئی غلے کا ڈھیر خریدتا اور پھر وہیں فروخت کر دیتا تو اس پر اسے سزا دی جاتی تھی،حتیٰ کہ اپنی منزل پر لے جائے۔";
abudawood.hukam = "صحیح بخاری (6852) صحیح مسلم (1527)";
abudawood.description = ``;