var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ أَنَّ رَجُلًا ذَكَرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ يُخْدَعُ فِي الْبَيْعِ،فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا بَايَعْتَ فَقُلْ: لَا خِلَابَةَ,\nفَكَانَ الرَّجُلُ إِذَا بَايَعَ يَقُولُ: لَا خِلَابَةَ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ ایک شخص نے رسول اللہ ﷺ سے کہا کہ لوگ خرید و فروخت میں مجھے دھوکا دے جاتے ہیں۔تو رسول اللہ ﷺ نے اس سے فرمایا ’’جب تم معاملہ کرو تو یوں کہہ دیا کرو کہ دھوکا فریب نہیں۔‘‘ چنانچہ وہ سودا کرتے ہوئے کہا: کرتا تھا «لا خلابۃ» ’’دھوکا فریب نہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (2117) صحیح مسلم (1533)";
abudawood.description = ``;