var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي بِشْرٍ،عَنْ يُوسُفَ بْنِ مَاهَكَ،عَنْ حَكِيمِ بْنِ حِزَامٍ،قَالَ: يَا رَسُولَ اللَّهِ! يَأْتِينِي الرَّجُلُ فَيُرِيدُ مِنِّي الْبَيْعَ،لَيْسَ عِنْدِي،أَفَأَبْتَاعُهُ لَهُ مِنَ السُّوقِ؟ فَقَالَ: لَا تَبِعْ مَا لَيْسَ عِنْدَكَ.";
abudawood.urdu = "سیدنا حکیم بن حزام رضی اللہ عنہ سے روایت ہے کہ وہ کہتے ہیں کہ میں نے کہا: اے اللہ کے رسول! ایک آدمی میرے پاس آتا ہے اور مجھ سے ایسی چیز خریدنی چاہتا ہے جو میرے پاس نہیں ہوتی ‘ تو کیا میں اس کے لیے بازار سے خرید لوں؟ آپ ﷺ نے فرمایا ’’جو تیرے پاس نہیں ہے وہ مت بیچ۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2867)
أخرجہ الترمذي (1232 وسندہ حسن) والنسائي (4617 وسندہ حسن) وابن ماجہ (2187 وسندہ حسن)`;