var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا إِسْمَاعِيلُ،عَنْ أَيُّوبَ،حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ،حَدَّثَنِي أَبِي،عَنْ أَبِيهِ حَتَّى ذَكَرَ عَبْدَ اللَّهِ بْنَ عَمْرٍو،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَحِلُّ سَلَفٌ وَبَيْعٌ،وَلَا شَرْطَانِ فِي بَيْعٍ،وَلَا رِبْحُ مَا لَمْ تَضْمَنْ،وَلَا بَيْعُ مَا لَيْسَ عِنْدَكَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو (عبداللہ بن عمرو بن العاص رضی اللہ عنہما) سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’ادھار اور بیع اور ایک بیع میں دو شرطیں حلال نہیں ہیں ‘ اور اس چیز کا نفع بھی حلال نہیں جو تیری اپنی ضمانت میں نہیں اور جو چیز تیرے پاس (یعنی قبضے میں) نہ ہو اسے مت فروخت کر۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2870)
أخرجہ الترمذي (1234 وسندہ صحیح) والنسائي (4615 وسندہ صحیح) وابن ماجہ (2188 وسندہ صحیح)`;