var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا أَبَانُ،عَنْ قَتَادَةَ عَنِ الْحَسَنِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: عُهْدَةُ الرَّقِيقِ ثَلَاثَةُ أَيَّامٍ.";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’غلام کی بیع اور اس کی سلامتی کی ضمانت تین دن تک ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ابن ماجہ (2245)<br>قال المنذري : ’’ ھذا منقطع فإن الحسن لم یصح لہ سماع من عقبۃ ‘‘ (انظر عون المعبود 304/3)<br>وللحدیث طریق آخر ضعیف عند ابن ماجہ (2244)`;
abudawood.anwaar = [124,1];