var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنِي عَبْدُ الصَّمَدِ،حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ بِإِسْنَادِهِ وَمَعْنَاهُ،زَادَ: إِنْ وَجَدَ دَاءً فِي الثَّلَاثِ لَيَالِي رُدَّ بِغَيْرِ بَيِّنَةٍ،وَإِنْ وَجَدَ دَاءً بَعْدَ الثَّلَاثِ كُلِّفَ الْبَيِّنَةَ،أَنَّهُ اشْتَرَاهُ وَبِهِ هَذَا الدَّاءُ.\nقَالَ أَبو دَاود: هَذَا التَّفْسِيرُ مِنْ كَلَامِ قَتَادَةَ.";
abudawood.urdu = "جناب قتادہ نے اپنی سند سے مذکورہ بالا حدیث کے ہم معنی بیان کیا اور مزید کہا اگر تین (دن) رات تک اس میں کسی عیب سے مطلع ہوا تو گواہ پیش کیے بغیر ہی اسے واپس کر سکے گا۔اور اگر تین دن کے بعد مطلع ہوا تو اسے گواہ پیش کرنا ہو گا کہ جب اسے خریدا تھا تو اس میں یہ عیب تھا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ توضیح جناب قتادہ رحمہ اللہ کا قول ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>انظر الحدیث السابق (3506) و إن کان ھذا من قول قتادۃ فسندہ صحیح`;
abudawood.anwaar = [124,1];