var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ،عَنْ مَخْلَدِ بْنِ خُفَافٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ رَضِي اللَّهُ عَنْهَا،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْخَرَاجُ بِالضَّمَانِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’آمدنی کا حقدار وہی ہے جو ضامن ہو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2879)
أخرجہ الترمذي (1285 وسندہ حسن) والنسائي (4495 وسندہ حسن) وابن ماجہ (2242 وسندہ حسن)`;