var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا ابْنُ أَبِي لَيْلَى عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ أَنَّ ابْنَ مَسْعُودٍ بَاعَ مِنَ الْأَشْعَثِ ابْنِ قَيْسٍ رَقِيقًا... فَذَكَرَ مَعْنَاهُ،وَالْكَلَامُ يَزِيدُ وَيَنْقُصُ.";
abudawood.urdu = "جناب قاسم بن عبدالرحمٰن نے اپنے والد سے روایت کیا کہ سیدنا عبداللہ بن مسعود رضی اللہ عنہ نے سیدنا اشعث بن قیس رضی اللہ عنہ کو غلام بیچے۔اور الفاظ میں کمی بیشی ہے۔مذکورہ بالا روایت کے ہم معنی بیان کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `رواہ الدارقطني (3/20 ح2836) وصححہ ابن الجارود (624) وللحدیث شواھد`;