var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنِ ابْنِ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الشُّفْعَةُ فِي كُلِّ شِرْكٍ،رَبْعَةٍ أَوْ حَائِطٍ،لَا يَصْلُحُ أَنْ يَبِيعَ،حَتَّى يُؤْذِنَ شَرِيكَهُ،فَإِنْ بَاعَ, فَهُوَ أَحَقُّ بِهِ،حَتَّى يُؤْذِنَهُ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’شفعہ ہر مشترک زمین یا باغ میں ہے ‘ اسے اپنے شریک کو خبر دیے بغیر فروخت کرنا درست نہیں۔اگر (بلا اطلاع) فروخت کر دیا ہو تو وہ شریک ہی زیادہ حقدار ہے حتیٰ کہ وہ دوسرے کے لیے اجازت دیدے۔‘‘";
abudawood.hukam = "صحیح مسلم (1608)";
abudawood.description = ``;