var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ إِنَّمَا جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشُّفْعَةَ فِي كُلِّ مَا لَمْ يُقْسَمْ فَإِذَا وَقَعَتْ الْحُدُودُ وَصُرِّفَتْ الطُّرُقُ فَلَا شُفْعَةَ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے ہر مشترک غیر تقسیم شدہ چیز میں شفعہ رکھا ہے ‘ لیکن جب حدود متعین ہو جائیں اور راستے الگ الگ ہو جائیں تو پھر کوئی شفعہ نہیں۔";
abudawood.hukam = "صحیح بخاری (6976)";
abudawood.description = ``;