var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ أَوْ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ أَوْ عَنْهُمَا جَمِيعًا عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قُسِّمَتْ الْأَرْضُ وَحُدَّتْ فَلَا شُفْعَةَ فِيهَا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب زمین تقسیم ہو جائے اور حدود متعین ہو جائیں ‘ تو اس میں کوئی شفعہ نہیں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `الحدیث السابق (3514) شاھد لہ`;