var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَارُ أَحَقُّ بِشُفْعَةِ جَارِهِ يُنْتَظَرُ بِهَا وَإِنْ كَانَ غَائِبًا إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’ہمسایہ ‘ ہمسائے پر شفعہ کا زیادہ حقدار ہے ‘ اگر وہ موجود نہ ہو تو اس کا انتظار کیا جائے ‘ بشرطیکہ ان کا راستہ ایک ہو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2967)`;