var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،عَنْ حَمَّادٍ يَعْنِي ابْنَ زَيْدٍ،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ عُبَيْدِ اللَّهِ بْنِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنِ الشَّعْبِيِّ-يَرْفَعُ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-،أَنَّهُ قَالَ: مَنْ تَرَكَ دَابَّةً بِمَهْلَكٍ،فَأَحْيَاهَا رَجُلٌ, فَهِيَ لِمَنْ أَحْيَاهَا.";
abudawood.urdu = "جناب شعبی رحمہ اللہ نبی کریم ﷺ سے مرفوعاً بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس نے کسی تباہ حال جانور کو چھوڑ دیا ہو اور کوئی دوسرا اسے زندہ کر لے (یعنی علاج معالجہ اور خدمت سے) تو یہ اس کا ہوا جس نے اسے زندہ کیا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل وانظر الحدیث السابق (3524)`;
abudawood.anwaar = [125,1];