var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ عَمَّتِهِ أَنَّهَا سَأَلَتْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فِي حِجْرِي يَتِيمٌ أَفَآكُلُ مِنْ مَالِهِ فَقَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَطْيَبِ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَوَلَدُهُ مِنْ كَسْبِهِ";
abudawood.urdu = "عمارہ بن عمیر کی پھوپھی نے ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے پوچھا کہ ایک یتیم میری کفالت میں ہے،کیا میں اس کے مال میں سے کھا سکتی ہوں؟ انہوں نے کہا: رسول اللہ ﷺ نے فرمایا ہے ’’انتہائی پاکیزہ مال جو انسان کھاتا ہے وہی ہے جو اس کی اپنی کمائی کا ہو،انسان کی اولاد اس کی اپنی کمائی ہی ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2770)
أخرجہ النسائي (4454) وللحدیث شواھد منھا الحدیث الآتي (3530)`;