var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا هُشَيْمٌ عَنْ مُوسَى بْنِ السَّائِبِ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدَ عَيْنَ مَالِهِ عِنْدَ رَجُلٍ فَهُوَ أَحَقُّ بِهِ وَيَتَّبِعُ الْبَيِّعُ مَنْ بَاعَهُ";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص اپنا مال بعینہ کسی کے پاس پائے تو وہی اس کا زیادہ حقدار ہے (لہٰذا وہ لے لے) اور (جس کے پاس یہ پایا گیا ہے) اسے چاہیئے کہ اپنے بیچنے والے کے درپے ہو (اس پر دعویٰ کرے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4685)<br>قتادۃ عنعن`;
abudawood.anwaar = [125,1];