var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَأَحْمَدُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ عَنْ شَرِيكٍ قَالَ ابْنُ الْعَلَاءِ وَقَيْسٌ عَنْ أَبِي حُصَيْنٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدِّ الْأَمَانَةَ إِلَى مَنْ ائْتَمَنَكَ وَلَا تَخُنْ مَنْ خَانَكَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو تجھے امین بنائے،تو اس کی امانت اسے ادا کر دے اور جو تیری خیانت کرے،تو اس کی خیانت نہ کر۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1264)<br>شریک القاضي عنعن وقیس بن الربیع ضعیف وقال العراقي: ضعفہ الجمھور (تخریج الإحیاء 81/4) وقال المناوي: ضعفہ الجمھور(فیض القدیر119/3ح2835)<br>وللحدیث شواھد کثیرۃ کلھا ضعیفۃ`;
abudawood.anwaar = [125,1];