var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ وَعَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ الرُّؤَاسِيُّ،قَالَا: حَدَّثَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ بْنِ أَبِي إِسْحَاقَ السَّبِيعِيُّ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،رَضِي اللَّهُ عَنْهَا،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْبَلُ الْهَدِيَّةَ وَيُثِيبُ عَلَيْهَا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ ہدیہ قبول فرماتے اور اس کا بدل بھی دیا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (2585)";
abudawood.description = ``;