var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ الْفَضْلِ حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَايْمُ اللَّهِ لَا أَقْبَلُ بَعْدَ يَوْمِي هَذَا مِنْ أَحَدٍ هَدِيَّةً إِلَّا أَنْ يَكُونَ مُهَاجِرًا قُرَشِيًّا أَوْ أَنْصَارِيًّا أَوْ دَوْسِيًّا أَوْ ثَقَفِيًّا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’اللہ کی قسم! میں آج کے بعد کسی کا ہدیہ قبول نہیں کروں گا سوائے اس کے کہ کوئی مہاجر قریشی ہو یا انصاری یا دوسی یا ثقفی۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3022)
وللحدیث طرق عند ابن حبان (1145 وسندہ حسن) ولہ شاھد عند الترمذي (3945 وسندہ حسن)`;