var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ وَهَمَّامٌ وَشُعْبَةُ قَالُوا حَدَّثَنَا قَتَادَةُ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ قَالَ هَمَّامٌ وَقَالَ قَتَادَةُ وَلَا نَعْلَمُ الْقَيْءَ إِلَّا حَرَامًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’ہدیہ دے کر واپس لے لینے والا ایسے ہے جیسے کوئی قے کرے اور پھر اسے کھا لے۔‘‘ ہمام رحمہ اللہ کہتے ہیں قتادہ رحمہ اللہ نے کہا کہ ہم تو قے کو حرام سمجھتے ہیں۔";
abudawood.hukam = "صحیح بخاری (2621) صحیح مسلم (1622)";
abudawood.description = ``;