var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ وَمَنْ اغْتَسَلَ فَهُوَ أَفْضَلُ";
abudawood.urdu = "سیدنا سمرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے وضو کیا اس نے سنت پر عمل کیا اور یہ بہت عمدہ سنت ہے۔اور جس نے غسل کیا تو یہ افضل ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (540)
وصححہ ابن خزیمۃ (1757) ورواہ شعبۃ عن قتادۃ بہ والحسن البصري صرح بالسماع عند الطوسي في مختصر الأحکام (3/10 ح 334-/467) وسندہ حسن`;