var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عُمَرَ بْنِ مَالِكٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ عَنْ الْقَاسِمِ عَنْ أَبِي أُمَامَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَفَعَ لِأَخِيهِ بِشَفَاعَةٍ فَأَهْدَى لَهُ هَدِيَّةً عَلَيْهَا فَقَبِلَهَا فَقَدْ أَتَى بَابًا عَظِيمًا مِنْ أَبْوَابِ الرِّبَا";
abudawood.urdu = "سیدنا ابوامامہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جس نے اپنے کسی بھائی کی سفارش کی اور پھر اسے اس پر کوئی ہدیہ دیا،تو اگر اس نے اسے قبول کر لیا تو،وہ سود کے دروازوں میں سے ایک بڑے دروازے میں داخل ہو گیا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن وھب عنعن<br>و للحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [125,1];