var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ حَاجِبِ بْنِ الْمُفَضَّلِ بْنِ الْمُهَلَّبِ عَنْ أَبِيهِ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْدِلُوا بَيْنَ أَوْلَادِكُمْ اعْدِلُوا بَيْنَ أَبْنَائِكُمْ";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اپنی اولاد میں عدل کرو،اپنی اولاد میں عدل کرو۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (3717 وسندہ صحیح)`;