var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ وَحَبِيبٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجُوزُ لِامْرَأَةٍ أَمْرٌ فِي مَالِهَا إِذَا مَلَكَ زَوْجُهَا عِصْمَتَهَا";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے،وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب کوئی شخص کسی عورت کی عصمت کا مالک بن جائے (یعنی عورت اس کے نکاح میں آ جائے) تو اس عورت کو جائز نہیں کہ اپنے ذاتی مال میں بھی تصرف کرے‘‘۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (3787 وسندہ حسن)`;