var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا حُسَيْنٌ عَنْ عَمْرِو بْنِ شُعَيْبٍ أَنَّ أَبَاهُ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجُوزُ لِامْرَأَةٍ عَطِيَّةٌ إِلَّا بِإِذْنِ زَوْجِهَا";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’کسی عورت کو اپنے شوہر کی اجازت کے بغیر عطیہ دینا جائز نہیں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ النسائي (2541 وسندہ حسن) وانظر الحدیث السابق (3546)`;