var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: الْعُمْرَى جَائِزَةٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’عمریٰ (عمر بھر کے لیے دیا گیا عطیہ) ہمیشہ ہمیش کے لیے (موہوب لہ کا) ہو جاتا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (2626) صحیح مسلم (1626)";
abudawood.description = ``;