var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا الْأَغَرُّ عَنْ خَلِيفَةَ بْنِ حُصَيْنٍ عَنْ جَدِّهِ قَيْسِ بْنِ عَاصِمٍ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرِيدُ الْإِسْلَامَ فَأَمَرَنِي أَنْ أَغْتَسِلَ بِمَاءٍ وَسِدْرٍ";
abudawood.urdu = "جناب حلیفہ بن حصین اپنے دادا سیدنا قیس بن عاصم رضی اللہ عنہ سے روایت کرتے ہیں کہمیں نبی کریم ﷺ کی خدمت میں آیا،میں اسلام قبول کرنا چاہتا تھا۔تو آپ ﷺ نے مجھے حکم دیا کہ میں غسل کروں اور پانی میں بیری کے پتے ملے ہوئے ہوں۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (543)
سنن النسائي (188) وسندہ حسن`;