var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ،أَخْبَرَنِي الْأَوْزَاعِيُّ عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ جَابِرٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ أُعْمِرَ عُمْرَى فَهِيَ لَهُ وَلِعَقِبِهِ،يَرِثُهَا مَنْ يَرِثُهُ مِنْ عَقِبِهِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جسے زندگی بھر کے لیے کوئی عطیہ دیا گیا تو یہ اس کا اور اس کے وارثوں کا ہوا۔اس (عطیہ) کے وارث وہی ہوں گے جو اس کی اولاد میں سے اس کے وارث ہوں گے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتي (3553)`;