var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ إِنَّمَا الْعُمْرَى الَّتِي أَجَازَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقُولَ هِيَ لَكَ وَلِعَقِبِكَ فَأَمَّا إِذَا قَالَ هِيَ لَكَ مَا عِشْتَ فَإِنَّهَا تَرْجِعُ إِلَى صَاحِبِهَا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے کہا: ’’عمریٰ جسے رسول اللہ ﷺ نے (ہمیشہ کے لیے) نافذ قرار دیا ہے وہی ہے کہ یوں کہے: ’’یہ تیرے لیے ہے اور تیری اولاد کے لیے ہے۔‘‘ اور جب یوں کہے: ’’تیرے جیتے جی یہ تیرے لیے ہے۔‘‘ تو یہ اس کے مالک کو لوٹ آئے گا۔";
abudawood.hukam = "صحیح مسلم (1625)";
abudawood.description = ``;