var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُرْقِبُوا وَلَا تُعْمِرُوا فَمَنْ أُرْقِبَ شَيْئًا أَوْ أُعْمِرَهُ فَهُوَ لِوَرَثَتِهِ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’رقبیٰ یا عمریٰ کے انداز میں ہدیہ مت کیا کرو۔جسے کوئی چیز بطور رقبیٰ یا عمریٰ دی گئی ہو تو یہ اس کے وارثوں کی ہو گئی۔‘‘ (یعنی جسے دی گئی ہو)۔";
abudawood.hukam = "صحیح مسلم (1625)";
abudawood.description = `مشکوۃ المصابیح (3013)`;