var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا دَاوُدُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعُمْرَى جَائِزَةٌ لِأَهْلِهَا وَالرُّقْبَى جَائِزَةٌ لِأَهْلِهَا";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’عمریٰ اور رقبیٰ کے ہدیے ان کے اہل کے ہو جاتے ہیں۔‘‘ (جنہیں دیے گئے ہوں واپس نہیں ہو سکتے)۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3014)
أبو الزبیر صرح بالسماع فی الروایۃ الطویلۃ وللحدیث شواھد`;