var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ عَنْ عُبَيْدِ اللَّهِ بْنِ مُوسَى عَنْ عُثْمَانَ بْنِ الْأَسْوَدِ عَنْ مُجَاهِدٍ قَالَ الْعُمْرَى أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ هُوَ لَكَ مَا عِشْتَ فَإِذَا قَالَ ذَلِكَ فَهُوَ لَهُ وَلِوَرَثَتِهِ وَالرُّقْبَى هُوَ أَنْ يَقُولَ الْإِنْسَانُ هُوَ لِلْآخِرِ مِنِّي وَمِنْكَ";
abudawood.urdu = "جناب مجاہد رحمہ اللہ فرماتے ہیں عمریٰ یہ ہے کہ ایک انسان دوسرے سے یوں کہے ’’جب تک تو زندہ ہے یہ تیرے لیے ہے۔‘‘ پس جب یوں کہہ دیا تو یہ اس کی ہوئی اور (بعد ازاں) اس کے وارثوں کی ہے۔اور رقبیٰ یہ ہے کہ انسان دوسرے سے کہے ’’یہ چیز ہم میں سے بعد میں مرنے والے کے لیے ہے۔‘‘ (اگر تو پہلے مر گیا تو میری ہو گی ‘ ورنہ تیری رہی)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;