var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى الْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَ ثُمَّ إِنَّ الْحَسَنَ نَسِيَ فَقَالَ هُوَ أَمِينُكَ لَا ضَمَانَ عَلَيْهِ";
abudawood.urdu = "سیدنا سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’ہاتھ کے ذمے ہے جو اس نے لیا حتیٰ کہ اسے ادا کر دے۔’’پھر حسن (حسن بصری رحمہ اللہ) بھول گئے اور کہا: عاریتاً لینے والا تمہارا امانت دار ہے اس پر کوئی ضمانت نہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1266) ابن ماجہ (2400)<br>قتادۃ عنعن`;
abudawood.anwaar = [126,1];