var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو الْأَحْوَصِ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ،عَنْ عَطَاءٍ،عَنْ نَاسٍ مِنْ آلِ صَفْوَانَ قَالَ اسْتَعَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "آل صفوان کے بعض لوگوں سے روایت ہے کہ نبی کریم ﷺ نے زرہیں عاریتاً لی تھیں۔اور مذکورہ بالا روایت کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیثین السابقین (3562،3563)<br>و ناس من آل صفوان : مجاھیل کلھم`;
abudawood.anwaar = [126,1];