var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ حَرَامِ بْنِ مُحَيِّصَةَ عَنْ أَبِيهِ أَنَّ نَاقَةً لِلْبَرَاءِ بْنِ عَازِبٍ دَخَلَتْ حَائِطَ رَجُلٍ فَأَفْسَدَتْهُ عَلَيْهِمْ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَهْلِ الْأَمْوَالِ حِفْظَهَا بِالنَّهَارِ وَعَلَى أَهْلِ الْمَوَاشِي حِفْظَهَا بِاللَّيْلِ";
abudawood.urdu = "جناب حرام بن محیصہ اپنے والد سے روایت کرتے ہیں کہ سیدنا براء بن عازب رضی اللہ عنہ کی اونٹنی ایک آدمی کے باغ میں داخل ہو گئی اور ان کی کھیتی خراب کر دی ‘ تو رسول اللہ ﷺ نے فیصلہ فرمایا ’’کھیتی والوں کے ذمے ہے کہ دن کو اس (کھیتی) کی حفاظت کریں اور جانوروں کے مالکوں پر لازم ہے کہ رات کو ان کی حفاظت کریں (باندھ کر رکھیں)۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الزھري مدلس (تقدم : 145) وعنعن<br>وانظر الحدیث الآتي (3570)`;
abudawood.anwaar = [126,1];