var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا فُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَمْرُو بْنُ أَبِي عَمْرٍو عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَلِيَ الْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے قاضی کا عہدہ لیا تو وہ چھری کے بغیر ہی ذبح کر دیا گیا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `الحدیث الآتي (3572) شاھد لہ`;