var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ،عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ،عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ الْأَخْنَسِيِّ عَنِ الْمَقْبُرِيِّ وَالْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جسے لوگوں کا قاضی بنا دیا گیا اسے چھری کے بغیر ہی ذبح کر دیا گیا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3733)
أخرجہ ابن ماجہ (2308 وسندہ حسن)`;