var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا مُلَازِمُ بْنُ عَمْرٍو حَدَّثَنِي مُوسَى بْنُ نَجْدَةَ عَنْ جَدِّهِ يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ وَهُوَ أَبُو كَثِيرٍ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ طَلَبَ قَضَاءَ الْمُسْلِمِينَ حَتَّى يَنَالَهُ ثُمَّ غَلَبَ عَدْلُهُ جَوْرَهُ فَلَهُ الْجَنَّةُ وَمَنْ غَلَبَ جَوْرُهُ عَدْلَهُ فَلَهُ النَّارُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم ﷺ نے فرمایا ’’جس نے مسلمانوں میں قضاء کا منصب طلب کیا حتیٰ کہ اسے حاصل کر لیا ‘ پھر اس کا عدل کرنا ظلم کرنے پر غالب رہا ‘ تو اس کے لیے جنت ہے ‘ اور جس کا ظلم اس کے عدل پر غالب رہا ‘ اس کے لیے جہنم ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>موسی بن نجدۃ : مجہول (تق : 7020)`;
abudawood.anwaar = [127,1];