var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ بْنِ أَبِي يَحْيَى الرَّمْلِيُّ حَدَّثَنَا زَيْدُ بْنُ أَبِي الزَّرْقَاءِ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمْ الْكَافِرُونَ إِلَى قَوْلِهِ الْفَاسِقُونَ هَؤُلَاءِ الْآيَاتِ الثَّلَاثِ نَزَلَتْ فِي الْيَهُودِ خَاصَّةً فِي قُرَيْظَةَ وَالنَّضِيرِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے بیان کیا کہ سورۃ المائدہ کی یہ تینوں آیات «ومن لم یحکم بما أنزل اللہ فأولئک ہم الکافرون *** إلی قولہ *** الفاسقون» یہودیوں کے قبائل بالخصوص قریظہ اور بنو نضیر کے متعلق نازل ہوئی تھیں۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;