var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ حَدَّثَنِي أَبُو بُرْدَةَ قَالَ قَالَ أَبُو مُوسَى قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ نَسْتَعْمِلَ أَوْ لَا نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جو کوئی اس منصب اور کام کا طلب گار ہو گا ہم اسے ہرگز نہیں دیں گے۔‘‘";
abudawood.hukam = "صحیح بخاری (6923) صحیح مسلم (1824)";
abudawood.description = ``;