var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ قَالَ سَمِعْتُ الْحَسَنَ يَعْنِي ابْنَ مُسْلِمٍ يَذْكُرُ عَنْ مُجَاهِدٍ قَالَ قَالَتْ عَائِشَةُ مَا كَانَ لِإِحْدَانَا إِلَّا ثَوْبٌ وَاحِدٌ تَحِيضُ فِيهِ فَإِنْ أَصَابَهُ شَيْءٌ مِنْ دَمٍ بَلَّتْهُ بِرِيقِهَا ثُمَّ قَصَعَتْهُ بِرِيقِهَا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ ہم ازواج رسول کے لیے محض ایک ایک ہی کپڑا ہوتا تھا،اسی میں ایام حیض گزارتے تھے۔اگر کہیں کوئی خون کا دھبہ لگ جاتا تو وہ اسے اپنے لعاب سے گیلا کرتی اور پھر اسے مل دیتی تھی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;