var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاشِي وَالْمُرْتَشِي";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے رشوت دینے والے اور لینے والے کو لعنت فرمائی ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3753)
أخرجہ الترمذي (1337 وسندہ حسن) وابن ماجہ (2313 وسندہ حسن) وللحدیث شواھد عند ابن حبان (1196)`;