var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،أَخْبَرَنَا عِيسَى،حَدَّثَنَا أُسَامَةُ،عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ،قَالَ: سَمِعْتُ أُمَّ سَلَمَةَ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ... بِهَذَا الْحَدِيثِ،قَالَ: يَخْتَصِمَانِ فِي مَوَارِيثَ وَأَشْيَاءَ قَدْ دَرَسَتْ،فَقَالَ: إِنِّي إِنَّمَا أَقْضِي بَيْنَكُمْ بِرَأْيِي فِيمَا لَمْ يُنْزَلْ عَلَيَّ فِيهِ..";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا نے نبی کریم ﷺ سے یہ حدیث بیان کی کہ ان دو آدمیوں کا وراثت میں جھگڑا تھا اور بھی چند دوسری چیزیں تھیں جن کے نشانات مٹ گئے تھے۔آپ ﷺ نے فرمایا ’’جس چیز میں مجھ پر کچھ نازل نہ ہوا ہو اس میں ‘ میں اپنی رائے سے فیصلہ کرتا ہوں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3770)
انظر الحدیث السابق (3584)`;