var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ،عَنْ يُونُسَ بْنِ يَزِيدَ عَنِ ابْنِ شِهَابٍ،أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِي اللَّهُ عَنْهُ،قَالَ-وَهُوَ عَلَى الْمِنْبَرِ-: يَا أَيُّهَا النَّاسُ! إِنَّ الرَّأْيَ إِنَّمَا كَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ مُصِيبًا, لِأَنَّ اللَّهَ كَانَ يُرِيهِ وَإِنَّمَا هُوَ مِنَّا الظَّنُّ وَالتَّكَلُّفُ.";
abudawood.urdu = "ابن شہاب زہری رحمہ اللہ نے روایت کیا کہ سیدنا عمر بن خطاب رضی اللہ عنہ نے برسر منبر فرمایا: اے لوگو! رسول اللہ ﷺ کی رائے بالکل برحق ہوا کرتی تھی کیونکہ انہیں اﷲ تعالیٰ سمجھاتا تھا اور ہماری رائے ظن و گمان اور تکلف محض ہوتی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قال المنذري: ’’ ھذا منقطع،الزہري لم یدرک عمر رضي اللّٰہ عنہ ‘‘ (عون المعبود 329/3)`;
abudawood.anwaar = [127,1];