var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ،أَخْبَرَنَا مُعَاذُ بْنُ مُعَاذٍ،قَالَ: أَخْبَرَنِي أَبُو عُثْمَانَ الشَّامِيُّ،وَلَا إِخَالُنِي رَأَيْتُ شَأْمِيًّا أَفْضَلَ مِنْهُ.-يَعْنِي: حُرَيْزَ بْنَ عُثْمَانَ-.";
abudawood.urdu = "احمد بن عبدہ الضبی کہتے ہیں کہ ہمیں معاذ بن معاذ نے بیان کیا۔کہا کہ مجھے ابوعثمان شامی (حریز بن عثمان) نے بیان کیا اور (معاذ بن معاذ نے کہا کہ) میں کسی شامی کو حریز بن عثمان سے افضل نہیں سمجھتا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;