var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ،عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ أَنَّ الْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَيِ الْحَكَمِ.";
abudawood.urdu = "سیدنا عبداللہ بن زبیر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے حکم دیا ہے کہ مدعی اور مدعا علیہ دونوں قاضی کے سامنے بیٹھیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مصعب بن ثابت ضعیف`;
abudawood.anwaar = [127,2];