var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ،قَالَ:،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ،عَنْ أَبِيهِ أَنَّهُ كَتَبَ إِلَى ابْنِهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: لَا يَقْضِي الْحَكَمُ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ.";
abudawood.urdu = "جناب عبدالرحمٰن بن ابی بکرہ اپنے والد سے روایت کرتے ہیں کہ انہوں نے اپنے صاحبزادے کی طرف لکھ بھیجا کہ رسول اللہ ﷺ نے فرمایا ’’کوئی حکم (فیصلہ کرنے والا) غصے کی حالت میں دونوں فریقوں میں فیصلہ نہ کرے۔‘‘";
abudawood.hukam = "صحیح بخاری (7158) صحیح مسلم (1717)";
abudawood.description = ``;