var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ،حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ،عَنْ أَبِيهِ،عَنْ يَزِيدَ النَّحْوِيِّ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،قَالَ: فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ[المائدة: 42]،فَنُسِخَتْ،قَالَ: فَاحْكُمْ بَيْنَهُمْ بِمَا أَنْزَلَ اللَّهُ[المائدة: 48].";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے بیان کیا کہ پہلے یہ آیت نازل ہوئی «فإن جاءوک فاحکم بینہم أو أعرض عنہم» ’’اگر یہ (یہود) آپ کے پاس آئیں تو آپ ان میں فیصلہ فرمائیں یا اعراض کر لیں۔‘‘ پھر اسے منسوخ کر دیا گیا اور فرمایا «فاحکم بینہم بما أنزل اللہ» ’’آپ ان میں فیصلہ فرمائیں اس چیز کے ساتھ جو اﷲ نے نازل کی۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;