var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ شُعْبَةَ،حَدَّثَنِي أَبُو عَوْنٍ عَنِ الْحَارِثِ بْنِ عَمْرٍو،عَنْ نَاسٍ مِنْ أَصْحَابِ مُعَاذٍ،عَنْ مُعَاذِ بْنِ جَبَلٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَهُ إِلَى الْيَمَنِ فَذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "بعض اصحاب معاذ نے سیدنا معاذ بن جبل رضی اللہ عنہ سے روایت کیا کہ رسول اللہ ﷺ نے انہیں جب یمن بھیجا۔اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1327)<br>الحارث بن عمرو مجہول (تق : 1039) وناس من أصحاب معاذ،مجاہیل کلھم،ولوکان فیھم ثقۃ لسماہ الحارث،وقال الترمذي:’’ ولیس إسنادہ عندي بمتصل ‘‘ وضعفہ البخاري والدارقطني وغیرھما وللحدیث شاہد موضوع عند ابن ماجہ (55) وابن عساکر (301/61)وشاہد آخر عندہ أیضًا(305/61) وسندہ موضوع`;
abudawood.anwaar = [128,1];