var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ،حَدَّثَنَا عُمَرُ بْنُ يُونُسَ،حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ الْعُمَرِيُّ،حَدَّثَنِي الْمُثَنَّى بْنُ يَزِيدٍ،عَنْ مَطَرٍ الْوَرَّاقِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ... بِمَعْنَاهُ،قَالَ: وَمَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ فَقَدْ بَاءَ بِغَضَبٍ مِنَ اللَّهِ عَزَّ وَجَلَّ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہ نے نبی کریم ﷺ سے مذکورہ بالا حدیث کے ہم معنی روایت کیا۔فرمایا ’’جس نے کسی ظلم کے جھگڑے میں معاونت کی تحقیق وہ اللہ عزوجل کی ناراضی کے ساتھ لوٹا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ ابن ماجہ (2320 وسندہ حسن) والحدیث السابق (3597) شاھد لہ`;