var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ ابْنُ خَلَفِ بْنِ طَارِقٍ الرَّازِيُّ،حَدَّثَنَا زَيْدُ بْنُ يَحْيَى بْنِ عُبَيْدٍ الْخُزَاعِيُّ،حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ،عَنْ سُلَيْمَانَ بْنِ مُوسَى... بِإِسْنَادِهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ،وَلَا زَانٍ وَلَا زَانِيَةٍ،وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ.";
abudawood.urdu = "سلیمان بن موسیٰ نے اپنی سند سے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ہے ’’کسی خائن مرد یا عورت ‘ زانی مرد یا عورت یا اپنے بھائی کے بارے میں بغض و عداوت رکھنے والے کی گواہی جائز نہیں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3782)
سندہ قوي وانظر الحدیث السابق (3600)`;