var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمَدَانِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ وَنَافِعُ بْنُ يَزِيدَ عَنِ ابْنِ الْهَادِ،عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ يَقُولُ: لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ ﷺ کو فرماتے سنا کہ ’’کسی دیہاتی کی شہری کے خلاف گواہی جائز نہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3783)
أخرجہ ابن ماجہ (2367 وسندہ صحیح)`;