var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَالْحَسَنُ بْنُ عَلِيٍّ أَنَّ زَيْدَ بْنَ الْحُبَابِ حَدَّثَهُمْ،حَدَّثَنَا سَيْفٌ الْمَكَّيُّ قَالَ عُثْمَانُ سَيْفُ ابْنُ سُلَيْمَانَ،عَنْ قَيْسِ بْنِ سَعْدٍ،عَنْ عَمْرِو بْنِ دِينَارٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ قَضَى بِيَمِينٍ وَشَاهِدٍ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے ایک گواہ کے ساتھ قسم لے کر فیصلہ فرمایا۔(مدعی سے قسم لی)۔";
abudawood.hukam = "صحیح مسلم (1712)";
abudawood.description = ``;