var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَسَلَمَةُ بْنُ شَبِيبٍ،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ،عَنْ عَمْرِو بْنِ دِينَارٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ سَلَمَةُ فِي حَدِيثِهِ قَالَ عَمْرٌو فِي الْحُقُوقِ.";
abudawood.urdu = "جناب عمرو بن دینار نے اپنی سند سے مذکورہ بالا حدیث کے ہم معنی بیان کیا۔سلمہ (سلمہ بن شبیب) کی روایت میں ہے،عمرو نے کہا کہ ’’(مالی) حقوق میں‘‘ (اس طرح سے فیصلہ کیا)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3609)`;