var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ،حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ بِمَعْنَى إِسْنَادِهِ, أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،فَبَعَثَ كُلُّ وَاحِدٍ مِنْهُمَا شَاهِدَيْنِ،فَقَسَمَهُ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا نِصْفَيْنِ.";
abudawood.urdu = "جناب قتادہ نے اپنی سند سے بیان کیا جو مذکورہ بالا حدیث کے قریب قریب ہے کہ نبی کریم ﷺ کے دور میں دو آدمیوں نے ایک اونٹ کا دعویٰ کیا اور ان دونوں نے دو دو گواہ بھی پیش کر دیے تو نبی کریم ﷺ نے اسے ان کے مابین نصف نصف کر دیا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3772)
انظر الحدیث السابق (3613)`;