var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ خِلَاسٍ،عَنْ أَبِي رَافِعٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَجُلَيْنِ اخْتَصَمَا فِي مَتَاعٍ إِلَى النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ،فَقَالَ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: اسْتَهِمَا عَلَى الْيَمِينِ مَا كَانَ أَحَبَّا ذَلِكَ أَوْ كَرِهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہدو آدمی کسی مال کا تنازع لے کر نبی کریم ﷺ کے پاس آئے۔ان میں سے کسی کے پاس گواہ نہیں تھا۔تو نبی کریم ﷺ نے فرمایا ’’قسم کھانے کے لیے قرعہ ڈال لو ‘ جس کا بھی نکل آئے ‘ تمہیں یہ پسند ہو یا نہ۔‘‘ (اس کا یہی حل ہے کہ جو قسم کھائے گا مال لے لے گا)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2329،2346)<br>قتادۃ وسعید بن أبي عروبۃ مدلسان وعنعنا`;
abudawood.anwaar = [128,2];