var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ بِإِسْنَادِ ابْنِ مِنْهَالٍ مِثْلَهُ قَالَ: فِي دَابَّةٍ-وَلَيْسَ لَهُمَا بَيِّنَةٌ-: فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ";
abudawood.urdu = "جناب سعید بن ابی عروبہ نے حجاج بن منہال کی سند سے اس حدیث کے مثل روایت کیا،کہا کہ دو آدمیوں نے ایک جانور کے سلسلہ میں جھگڑا کیا اور کسی کے پاس گواہ نہیں تھا تو رسول اللہ ﷺ نے انہیں حکم دیا کہ قسم کھانے کے لیے قرعہ ڈالیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2329)<br>قتادۃ وسعید بن أبي عروبۃ مدلسان وعنعنا (معاذ علی زئی)`;
abudawood.anwaar = [128,2];