var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،حَدَّثَنَا نَافِعُ بْنُ عُمَرَ عَنِ ابْنِ أَبِي مُلَيْكَةَ،قَالَ: كَتَبَ إِلَيَّ ابْنُ عَبَّاسٍ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ.";
abudawood.urdu = "ابن ابی ملیکہ سے روایت ہے کہ سیدنا ابن عباس رضی اللہ عنہما نے مجھے لکھ بھیجا کہ رسول اللہ ﷺ نے فیصلہ فرمایا تھا کہ (جب مدعی کے پاس گواہ نہ ہوں تو) مدعا علیہ قسم کھائے۔";
abudawood.hukam = "صحیح بخاری (2514، 1711)";
abudawood.description = ``;