var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادٌ،ح وحَدَّثَنَا مُسَدَّد،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،ح وحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ،عَنْ هِشَامٍ بِهَذَا الْمَعْنَى [ص:100] قَالَ: «حُتِّيهِ،ثُمَّ اقْرُصِيهِ بِالْمَاءِ،ثُمَّ انْضَحِيهِ»";
abudawood.urdu = "عیسیٰ بن یونس اور حماد بن سلمہ دونوں نے مذکورہ بالا حدیث کے ہم معنی بیان کیا اور کہا: ’’اسے اکھیڑو ‘ پانی ڈال کر چٹکیوں سے رگڑو پھر (مزید) پانی بہاؤ۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;