var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ أَبِي يَحْيَى عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَعْنِي لِرَجُلٍ حَلَّفَهُ احْلِفْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ مَا لَهُ عِنْدَكَ شَيْءٌ يَعْنِي لِلْمُدَّعِي قَالَ أَبُو دَاوُد أَبُو يَحْيَى اسْمُهُ زِيَادٌ كُوفِيٌّ ثِقَةٌ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے اس آدمی سے فرمایا جس کو آپ ﷺ نے قسم اٹھوائی کہ ’’تو اللہ کی قسم کھا جس کے سوا کوئی معبود نہیں ‘ کہ تیرے پاس اس مدعی کی کوئی شے نہیں۔‘‘ امام ابوداؤد رحمہ اللہ نے فرمایا کہ راوی ابویحییٰ کا نام زیاد ہے جو کوفی ہے اور ثقہ ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3774)
انظر الحدیث السابق (3275)`;