var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،حَدَّثَنَا رَجُلٌ مِنْ مُزَيْنَةَ وَنَحْنُ عِنْدَ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ-يَعْنِي: لِلْيَهُودِ-: أَنْشُدُكُمْ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى،مَا تَجِدُونَ فِي التَّوْرَاةِ عَلَى مَنْ زَنَى؟. وَسَاقَ الْحَدِيثَ فِي قِصَّةِ الرَّجْمِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے یہودیوں سے کہا: ’’میں تمہیں اس اللہ کی قسم دیتا ہوں جس نے موسیٰ پر تورات نازل فرمائی ‘ تم لوگ زانی کے بارے میں تورات میں کیا پاتے ہو؟‘‘ اور قصہ رجم کے بارے میں حدیث بیان کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>وانظر الحدیث السابق نحوہ (488)`;
abudawood.anwaar = [129,1];