var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ،حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنِ الزُّهْرِيِّ... بِهَذَا الْحَدِيثِ وَبِإِسْنَادِهِ،قَالَ: حَدَّثَنِي رَجُلٌ مِنْ مُزْيَنَةَ مِمَّنْ كَانَ يَتَّبِعُ الْعِلْمَ وَيَعِيهِ،يُحَدِّثُ سَعِيدَ بْنَ الْمُسَيِّبِ... وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ.";
abudawood.urdu = "جناب زہری نے اپنی سند سے یہ حدیث بیان کی،کہا کہ مجھے مزینہ قبیلے کے ایک آدمی نے بیان کیا جو صاحب علم اور حافظ تھا ‘ اس نے سعید بن مسیب سے روایت کیا اور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>وانظر الحدیث السابق نحوہ (488)`;
abudawood.anwaar = [129,1];