var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ وَبْرِ بْنِ أَبِي دُلَيْلَةَ،عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ،عَنْ عَمْرِو بْنِ الشَّرِيدِ،عَنْ أَبِيهِ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،قَالَ: لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ.\nقَالَ ابْنُ الْمُبَارَكِ: يُحِلُّ عِرْضُهُ: يُغَلَّظُ لَهُ،وَعُقُوبَتَهُ: يُحْبَسُ لَهُ.";
abudawood.urdu = "سیدنا عمرو بن شرید اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مالدار کا قرض کی ادائیگی میں ٹال مٹول سے کام لینا اس کی بے عزتی اور سزا کو حلال کر دیتا ہے۔‘‘ ابن مبارک نے کہا: اس کی بے عزتی کو حلال کر دیتا ہے۔یعنی اس کے ساتھ سختی سے پیش آیا جائے۔اور اس کو سزا دینا حلال ہے۔یعنی اسے قید کیا جا سکتا ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2919)
أخرجہ النسائي (4693 وسندہ صحیح) ورواہ ابن ماجہ (2427 وسندہ حسن)`;