var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ،حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ،أَخْبَرَنَا هِرْمَاسُ بْنُ حَبِيبٍ-رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ-،عَنْ أَبِيهِ،عَنْ جَدَّهِ،قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بِغَرِيمٍ لِي،فَقَالَ لِيَ: الْزَمْهُ،ثُمَّ قَالَ لِي: يَا أَخَا بَنِي تَمِيمٍ! مَا تُرِيدُ أَنْ تَفْعَلَ بِأَسِيرِكَ؟.";
abudawood.urdu = "ہرماس بن حبیب ایک دیہاتی آدمی تھا۔وہ اپنے والد سے وہ ان کے دادا سے روایت کرتا ہے کہ میں اپنے ایک مقروض کو نبی کریم ﷺ کے پاس لایا تو آپ ﷺ نے مجھے فرمایا ’’اس کے ساتھ چمٹا رہ۔‘‘ پھر آپ ﷺ نے مجھے فرمایا ’’اے بنوتمیم کے بھائی! تو اپنے قیدی کے ساتھ کیا کرنا چاہتا ہے؟‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2428)<br>ھرماس بن حبیب : مجہول (دیوان الضعفاء للذھبي : 323) وأبوہ مجہول (تق : 1114)`;
abudawood.anwaar = [129,1];