var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ الْقَطَّانَ عَنْ سُفْيَانَ حَدَّثَنِي ثَابِتٌ الْحَدَّادُ حَدَّثَنِي عَدِيُّ بْنُ دِينَارٍ قَالَ سَمِعْتُ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ تَقُولُ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يَكُونُ فِي الثَّوْبِ قَالَ حُكِّيهِ بِضِلْعٍ وَاغْسِلِيهِ بِمَاءٍ وَسِدْرٍ";
abudawood.urdu = "سیدہ ام قیس بنت محصن رضی اللہ عنہا بیان کرتی ہیں کہ میں نے نبی کریم ﷺ سے خون حیض کے متعلق دریافت کیا جو کہ کپڑے کہ لگ جاتا ہے،آپ ﷺ نے فرمایا ’’اسے کسی لکڑی سے اکھیڑو پھر بیری کے پتے ملے پانی سے دھو ڈالو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;