var abudawood = {};
abudawood.arabic = "حدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،أَخْبَرَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ،عَنْ بَهْزِ بْنِ حَكِيمٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ.";
abudawood.urdu = "جناب بہز بن حکیم اپنے والد سے وہ ان کے دادا (معاویہ بن حیدہ قشیری رضی اللہ عنہ) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے ایک آدمی کو تہمت (شبہ) میں قید کیا تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3785)
أخرجہ الترمذي (1417 وسندہ حسن) ورواہ النسائي (4879، 4880 وسندھما حسن) عبد الرزاق صرح بالسماع عند ابن الجارود (1003)`;