var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ،حَدَّثَنَا قَتَادَةُ،عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا تَدَارَأْتُمْ فِي طَرِيقٍ, فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جب تمہارا کسی راستے کے بارے میں کوئی تنازع ہو تو سات ہاتھ راستہ چھوڑ دو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `أصلہ عند مسلم (1613) والبخاري (2473) نحو المعنٰی`;