var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ يَحْيَى،عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ،عَنْ لُؤْلُؤَةَ،عَنْ أَبِي صِرْمَةَ قَالَ غَيْرَ قُتَيْبَةَ فِي هَذَا الْحَدِيثِ،عَنْ أَبِي صِرْمَةَ-صَاحِبِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ-،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ،وَمَنْ شَاقَّ شَاقَّ اللَّهُ عَلَيْهِ.";
abudawood.urdu = "صحابی رسول سیدنا ابوصرمہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جس نے (اپنے مسلمان بھائی کو) نقصان پہنچایا اللہ اس کا نقصان کرے۔اور جس نے کسی (مسلمان) کو مشقت (اور پریشانی) سے دوچار کیا اللہ اسے مشقت (اور پریشانی) میں ڈالے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1940) ابن ماجہ (2342)<br>لؤلؤۃ لم یوثقھا غیرالترمذي<br>وللحدیث شواھد کثیرۃ کلھا ضعیفۃ`;
abudawood.anwaar = [129,1];