var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ،حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ،حَدَّثَنِي أَبِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ قَضَى فِي السَّيْلِ الْمَهْزُورِ, أَنْ يُمْسَكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ،ثُمَّ يُرْسِلُ الْأَعْلَى عَلَى الْأَسْفَلِ.";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے وہ (شعیب) اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے وادی مہزور میں نالے کے پانی کے سلسلے میں فیصلہ فرمایا تھا کہ پانی روک لیا جائے حتیٰ کہ ٹخنے ٹخنے تک آ جائے پھر اوپر والا نیچے والے کی جانب چھوڑ دے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3005)
رواہ ابن ماجہ (2482 وسندہ حسن)`;