var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ عَطَاءٍ عَنْ عَائِشَةَ قَالَتْ قَدْ كَانَ يَكُونَ لِإِحْدَانَا الدِّرْعُ فِيهِ تَحِيضُ قَدْ تُصِيبُهَا الْجَنَابَةُ ثُمَّ تَرَى فِيهِ قَطْرَةً مِنْ دَمٍ فَتَقْصَعُهُ بَرِيقِهَا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان فرماتی ہیں کہ ہم ازواج رسول میں سے ہر ایک کے پاس ایک کرتا ہی ہوا کرتا تھا۔اسی میں ایام حیض گزرتے،اسی میں جنابت ہوتی،پھر اگر اس میں خون کا قطرہ دیکھتی تو اسے لعاب لگا کر ملتی (اور اس کا ازالہ کر دیتی)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن أبي نجیح مدلس (طبقات المدلسین: 77/ 3) وعنعن`;
abudawood.anwaar = [27,1];