var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ الدِّمَشْقِيُّ،حَدَّثَنَا الْوَلِيدُ قَالَ لَقِيتُ شَبِيبَ بْنَ شَيْبَةَ فَحَدَّثَنِي بِهِ،عَنْ عُثْمَانَ بْنِ أَبِي سَوْدَةَ،عَنْ أَبِي الدَّرْدَاءِ يَعْنِي عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ.";
abudawood.urdu = "عثمان بن ابی سودہ نے سیدنا ابوالدرداء رضی اللہ عنہ سے انہوں نے نبی کریم ﷺ سے مذکورہ بالا روایت کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شبیب بن شیبۃ : مجھول (تق : 2741)`;
abudawood.anwaar = [130,1];