var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زَائِدَةُ عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّم:َ مَا مِنْ رَجُلٍ يَسْلُكُ طَرِيقًا يَطْلُبُ فِيهِ عِلْمًا, إِلَّا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقَ الْجَنَّةِ،وَمَنْ أَبْطَأَ بِهِ عَمَلُهُ, لَمْ يُسْرِعْ بِهِ نَسَبُهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو کوئی علم حاصل کرنے کے لیے کسی راہ پر چلتا ہے تو اللہ تعالیٰ اس کی وجہ سے اس کے لیے جنت کا راستہ آسان فرما دیتا ہے۔اور جسے اس کے عمل نے پیچھے رکھا اس کا نسب اسے آگے نہیں بڑھا سکتا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ مسلم (2699) مطولًا`;