var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ يَحْيَى حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ الْمُقْرِئُ الْحَضْرَمِيُّ حَدَّثَنَا سُهَيْلُ بْنُ مِهْرَانَ أَخِي حَزْمٍ الْقُطَعِيُّ حَدَّثَنَا أَبُو عِمْرَانَ عَنْ جُنْدُبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ بِرَأْيِهِ فَأَصَابَ فَقَدْ أَخْطَأَ";
abudawood.urdu = "سیدنا جندب (جندب بن عبداللہ بجلی رضی اللہ عنہ) بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے اپنی رائے سے کتاب اللہ میں کچھ کہا ‘ خواہ درست ہی کہا: ہو ‘ تو بھی اس نے خطا کی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>ترمذی(2952)<br>سہیل بن مہران :ضعیف (تقریب التہذیب: 2672)`;
abudawood.anwaar = [130,1];