var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ،أَخْبَرَنَا شُعْبَةُ،عَنْ أَبِي عَقِيلٍ هَاشِمِ بْنِ بِلَالٍ،عَنْ سَابِقِ بْنِ نَاجِيَةَ،عَنْ أَبِي سَلَّامٍ،عَنْ رَجُلٍ خَدَمَ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،كَانَ إِذَا حَدَّثَ حَدِيثًا أَعَادَهُ ثَلَاثَ مَرَّاتٍ.";
abudawood.urdu = "جناب ابو سلام (ابو سلام ممطور الحبشی) سے منقول ہے اس نے نبی کریم ﷺ کے ایک خادم سے نقل کیا کہ نبی کریم ﷺ جب کوئی بات کرتے تو اپنی بات کو تین بار دہراتے۔(شرعی مسئلہ اپنے سامع کو خوب سمجھاتے۔)";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `سابق بن ناجیۃ صحح لہ الحاکم والذھبي ووثقہ ابن حبان فھو حسن الحدیث`;