var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،حَدَّثَنَا عِيسَى عَنِ الْأَوْزَاعِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ سَعْدٍ عَنِ الصُّنَابِحِيِّ،عَنْ مُعَاوِيَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْغُلُوطَاتِ.";
abudawood.urdu = "سیدنا معاویہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے مغالطوں سے منع فرمایا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن سعد الدمشقي ضعفہ أھل الشام ووثقہ ابن حبان وحدہ وقال :’’ یخطئ‘‘ و ضعفہ راجح`;
abudawood.anwaar = [130,1];