var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا عَلِيُّ بْنُ الْحَكَمِ،عَنْ عَطَاءٍ،عَنْ أَبِي هُرَيْرَةَ, قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: مَنْ سُئِلَ عَنْ عِلْمٍ فَكَتَمَهُ, أَلْجَمَهُ اللَّهُ بِلِجَامٍ مِنْ نَارٍ يَوْمَ الْقِيَامَةِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس سے علم کی بات پوچھی گئی اور اس نے اسے چھپا لیا (اور بتایا نہیں) تو اللہ تعالیٰ قیامت کے روز اسے آگ کی لگام دے گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (223)
أخرجہ الترمذي (2649 وسندہ حسن)`;