var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْمَعُونَ وَيُسْمَعُ مِنْكُمْ وَيُسْمَعُ مِمَّنْ سَمِعَ مِنْكُمْ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’تم (مجھ سے) سنتے ہو اور تم سے سنا جائے گا اور پھر جو تم سے سنے گا اس سے سنا جائے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش مدلس وعنعن`;
abudawood.anwaar = [130,1];