var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ،عَنْ أَبِيهِ،عَنْ سَهْلٍ يَعْنِي ابْنَ سَعْدٍ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ قَالَ: وَاللَّهِ لَأَنْ يَهْدِيَ اللَّهُ بِهُدَاكَ رَجُلًا وَاحِدًا،خَيْرٌ لَكَ مِنْ حُمْرِ النَّعَمِ.";
abudawood.urdu = "سیدنا سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ نبی کریم ﷺ نے فرمایا ’’قسم اللہ کی! اللہ عزوجل تیری رہنمائی سے کسی ایک شخص کو بھی راہ حق دکھا دے تو یہ تیرے لیے سرخ اونٹوں سے افضل ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (3701) صحیح مسلم (2406)";
abudawood.description = ``;