var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: حَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ وَلَا حَرَجَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’بنی اسرائیل (اہل کتاب) سے روایت کر سکتے ہیں اس میں کوئی حرج نہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الحمیدي بتحقیقي (1174 وسندہ حسن)`;