var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا مُعَاذٌ،حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ أَبِي حَسَّانَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ: كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ يُحَدِّثُنَا عَنْ بَنِي إِسْرَائِيلَ،حَتَّى يُصْبِحَ, مَا يَقُومُ إِلَّا إِلَى عُظْمِ صَلَاةٍ.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ (بعض اوقات) ہمیں بنی اسرائیل کی باتیں بیان کرتے رہتے حتیٰ کہ صبح ہو جاتی اور پھر نماز کے خیال ہی سے اٹھتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [131,1];