var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ،حَدَّثَنَا فُلَيْحٌ،عَنْ أَبِي طُوَالَةَ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ ابْنِ مَعْمَرٍ الْأَنْصَارِيِّ،عَنْ سَعِيدِ بْنِ يَسَارٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: مَنْ تَعَلَّمَ عِلْمًا مِمَّا يُبْتَغَى بِهِ وَجْهُ اللَّهِ عَزَّ وَجَلَّ, لَا يَتَعَلَّمُهُ إِلَّا لِيُصِيبَ بِهِ عَرَضًا مِنَ الدُّنْيَا لَمْ يَجِدْ عَرْفَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ.-يَعْنِي: رِيحَهَا-.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جس نے اللہ کی رضا مندی والا علم اس غرض سے حاصل کیا کہ دنیا حاصل کرے ‘ تو ایسا آدمی قیامت کے دن جنت کی خوشبو نہیں پا سکے گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (227)
أخرجہ ابن ماجہ (252 وسندہ حسن)`;