var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو مُسْهِرٍ حَدَّثَنِي عَبَّادُ بْنُ عَبَّادٍ الْخَوَّاصُ عَنْ يَحْيَى بْنِ أَبِي عَمْرٍو السَّيْبَانِيِّ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ السَّيْبَانِيِّ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَقُصُّ إِلَّا أَمِيرٌ أَوْ مَأْمُورٌ أَوْ مُخْتَالٌ";
abudawood.urdu = "سیدنا عوف بن مالک اشجعی رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا ‘ آپ ﷺ فرماتے تھے ’’وعظ وہی کہے گا جو امیر ہو یا اس کی طرف سے مقرر کیا گیا ہو یا کوئی اپنی بڑائی یا شیخی کا اظہار کرنے والا ہو گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (240)`;