var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَشْعَثُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّ فِي شُعُرِنَا أَوْ فِي لُحُفِنَا قَالَ عُبَيْدُ اللَّهِ شَكَّ أَبِي";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،وہ بیان کرتی ہیں کہ رسول اللہ ﷺ ہمارے کپڑوں یا لحافوں میں نماز نہ پڑھا کرتے تھے۔(یعنی بالعموم) عبیداللہ نے کہا «شعرنا أو فی لحفنا» کے الفاظ میں میرے والد کو شک ہوا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;