var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ عَنْ أَبِي عَلْقَمَةَ مَوْلَاهُمْ وَعَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ الْغَافِقِيِّ أَنَّهُمَا سَمِعَا ابْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ اللَّهُ الْخَمْرَ وَشَارِبَهَا وَسَاقِيَهَا وَبَائِعَهَا وَمُبْتَاعَهَا وَعَاصِرَهَا وَمُعْتَصِرَهَا وَحَامِلَهَا وَالْمَحْمُولَةَ إِلَيْهِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اللہ تعالیٰ نے شراب ‘ اس کے پینے والے ‘ پلانے والے ‘ بیچنے والے ‘ خریدنے والے ‘ انگور نچوڑنے والے ‘ نچڑوانے والے ‘ اس کے اٹھانے والے اور جس کی طرف اٹھائی جا رہی ہو ‘ ان سب پر لعنت کی ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (2777)
أخرجہ ابن ماجہ (3380 وسندہ حسن) أبو علقمۃ: صوابہ أبو طعمۃ کما عند ابن ماجہ وغیرہ`;