var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ السُّدِّيِّ عَنْ أَبِي هُبَيْرَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ أَبَا طَلْحَةَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَيْتَامٍ وَرِثُوا خَمْرًا قَالَ أَهْرِقْهَا قَالَ أَفَلَا أَجْعَلُهَا خَلًّا قَالَ لَا";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ سیدنا ابوطلحہ رضی اللہ عنہ نے رسول اللہ ﷺ سے دریافت کیا کہ یتیموں کو ورثے میں شراب ملی ہے۔آپ ﷺ نے فرمایا ’’اسے بہا دو (اور ضائع کر دو)۔‘‘ انہوں نے کہا: کیا میں اس سے سرکہ نہ بنا لوں؟ آپ ﷺ نے فرمایا ’’نہیں۔‘‘";
abudawood.hukam = "صحیح مسلم (1983)";
abudawood.description = `مشکوۃ المصابیح (3649)`;