var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا إِسْرَائِيلُ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ الشَّعْبِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ الْعِنَبِ خَمْرًا وَإِنَّ مِنْ التَّمْرِ خَمْرًا وَإِنَّ مِنْ الْعَسَلِ خَمْرًا وَإِنَّ مِنْ الْبُرِّ خَمْرًا وَإِنَّ مِنْ الشَّعِيرِ خَمْرًا";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’انگور سے شراب ہے ‘ کھجور سے شراب ہے ‘ شہد سے شراب ہے ‘ گندم سے شراب ہے اور جَو سے بھی شراب ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3647)
إبراہیم بن المھاجر بن جابر البجلي وثقہ الجمھور وھو حسن الحدیث`;