var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَالِكُ بْنُ عَبْدِ الْوَاحِدِ أَبُو غَسَّانَ حَدَّثَنَا مُعْتَمِرٌ قَالَ قَرَأْتُ عَلَى الْفُضَيْلِ بْنِ مَيْسَرَةَ عَنْ أَبِي حَرِيزٍ أَنَّ عَامِرًا حَدَّثَهُ أَنَّ النُّعْمَانَ بْنَ بَشِيرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْخَمْرَ مِنْ الْعَصِيرِ وَالزَّبِيبِ وَالتَّمْرِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالذُّرَةِ وَإِنِّي أَنْهَاكُمْ عَنْ كُلِّ مُسْكِرٍ";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ ﷺ سے سنا ‘ آپ ﷺ فرماتے تھے ’’بلاشبہ انگور کے شربت سے ‘ کشمش ‘ کھجور ‘ گندم ‘ جَو اور مکئی سے شراب بنتی ہے ‘ اور میں تمہیں ہر نشہ آور سے منع کرتا ہوں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (3676)`;