var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَمُحَمَّدُ بْنُ عِيسَى فِي آخَرِينَ قَالُوا حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ وَمَنْ مَاتَ وَهُوَ يَشْرَبُ الْخَمْرَ يُدْمِنُهَا لَمْ يَشْرَبْهَا فِي الْآخِرَةِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’ہر نشہ آور شے خمر (شراب) ہے اور ہر نشہ آور حرام ہے ‘ اور جو شخص اس حالت پر مر گیا کہ وہ شراب پیتا تھا تو وہ آخرت میں نہیں پیے گا۔‘‘";
abudawood.hukam = "صحیح مسلم (2003)";
abudawood.description = ``;