var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ جَعْفَرٍ عَنْ دَاوُدَ بْنِ بَكْرِ بْنِ أَبِي الْفُرَاتِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس چیز کی کثیر مقدار نشہ آور ہو اس کی قلیل مقدار بھی حرام ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3645)
أخرجہ الترمذي (1865 وسندہ حسن) ورواہ ابن ماجہ (3393 وسندہ حسن)`;