var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ الْوَلِيدِ بْنِ عَبْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْخَمْرِ وَالْمَيْسِرِ وَالْكُوبَةِ وَالْغُبَيْرَاءِ وَقَالَ كُلُّ مُسْكِرٍ حَرَامٌ قَالَ أَبُو دَاوُد قَالَ ابْنُ سَلَامٍ أَبُو عُبَيْدٍ الْغُبَيْرَاءُ السُّكْرُكَةُ تُعْمَلُ مِنْ الذُّرَةِ شَرَابٌ يَعْمَلُهُ الْحَبَشَةُ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے شراب ‘ جوئے ‘ سارنگی اور غبیراء سے منع فرمایا ہے،اور فرمایا ’’ہر نشہ آور چیز حرام ہے۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابن سلام ابو عبید نے کہا کہ ’’غبیراء‘‘ مکئی جوار وغیرہ سے بنائی جانے والی شراب ہے جو اہل حبشہ بناتے ہیں۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3652، 4504)
وللحدیث شواھد انظر الحدیث السابق (3696)`;