var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو شِهَابٍ عَبْدُ رَبِّهِ بْنُ نَافِعٍ عَنْ الْحَسَنِ بْنِ عَمْرٍو الْفُقَيْمِيِّ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ مُسْكِرٍ وَمُفَتِّرٍ";
abudawood.urdu = "سیدہ ام سلمہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے ہر نشہ آور اور سستی لانے (سن کر دینے) والی اشیا سے منع فرمایا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الحکم بن عتیبۃ عنعن`;
abudawood.anwaar = [131,1];