var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَمُوسَى بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا مَهْدِيٌّ يَعْنِي ابْنَ مَيْمُونٍ حَدَّثَنَا أَبُو عُثْمَانَ قَالَ مُوسَى وَهُوَ عَمْرُو بْنُ سَلْمٍ الْأَنْصَارِيِّ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ مُسْكِرٍ حَرَامٌ وَمَا أَسْكَرَ مِنْهُ الْفَرْقُ فَمِلْءُ الْكَفِّ مِنْهُ حَرَامٌ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ ﷺ سے سنا آپ ﷺ فرماتے تھے ’’ہر نشہ آور چیز حرام ہے جس چیز کا بڑا پیالہ نشہ آور ہو تو اس کا ایک چلو بھی حرام ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3646)
أخرجہ الترمذي (1866 وسندہ حسن)`;