var abudawood = {};
abudawood.arabic = "قَالَ أَبُو دَاوُد حَدَّثَنَا شَيْخٌ مِنْ أَهْلِ وَاسِطٍ قَالَ حَدَّثَنَا أَبُو مَنْصُورٍ الْحَارِثُ بْنُ مَنْصُورٍ قَالَ سَمِعْتُ سُفْيَانَ الثَّوْرِيَّ وَسُئِلَ عَنْ الدَّاذِيِّ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَشْرَبَنَّ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا قَالَ أَبُو دَاوُد و قَالَ سُفْيَانُ الثَّوْرِيُّ الدَّاذِيُّ شَرَابُ الْفَاسِقِينَ";
abudawood.urdu = "جناب ابومنصور حارث بن منصور کہتے ہیں کہ میں نے جناب سفیان ثوری رحمہ اللہ سے سنا جبکہ ان سے بادہ کے متعلق سوال کیا گیا تو انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’میری امت کے کچھ لوگ شراب پیئں گے اور اس کا نام کچھ اور رکھ لیں گے۔‘‘ امام ابوداؤد رحمہ اللہ نے فرمایا کہ سفیان ثوری رحمہ اللہ نے کہا کہ بادہ فاسق لوگوں کا مشروب ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قول سفیان الثوري سندہ ضعیف إلیہ لأن أبا داود لم یذکر سندہ`;
abudawood.anwaar = [131,1];