var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ الشَّيْبَانِيِّ سَمِعَهُ مِنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ يُحَدِّثُهُ عَنْ مَيْمُونَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى وَعَلَيْهِ مِرْطٌ وَعَلَى بَعْضِ أَزْوَاجِهِ مِنْهُ وَهِيَ حَائِضٌ وَهُوَ يُصَلِّ وَهُوَ عَلَيْهِ";
abudawood.urdu = "ام المؤمنین سیدہ میمونہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ نے نماز پڑھی،آپ ایک کمبل اوڑھے ہوئے تھے جس کا کچھ حصہ آپ پر اور کچھ ان کی اہلیہ پر تھا اور وہ حیض سے تھیں آپ ﷺ اس حالت میں نماز پڑھتے رہے کہ وہ آپ پر تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وأصلہ متفق علیہ انظر صحیح البخاري (333) وصحیح مسلم (513)`;