var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مَنْصُورُ بْنُ حَيَّانَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ وَابْنِ عَبَّاسٍ قَالَا نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ وَالنَّقِيرِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر اور عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے،ان دونوں نے کہا ہم گواہی دیتے ہیں کہ رسول اللہ ﷺ نے کدو کے برتن (تونبہ) ‘ سبز رنگ کا برتن جس میں روغن مل لیا جاتا تھا ‘ روغن زفت لگے برتن اور چوبی برتن سے منع فرمایا ہے۔";
abudawood.hukam = "صحیح مسلم (1997)";
abudawood.description = ``;