var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا أَبَانُ،حَدَّثَنَا قَتَادَةُ،عَنْ عِكْرِمَةَ وَسَعِيدِ بْنِ الْمُسَيِّبِ عَنِ ابْنِ عَبَّاسٍ... فِي قِصَّةِ وَفْدِ عَبْدِ الْقَيْسِ،قَالُوا: فِيمَ نَشْرَبُ يَا نَبِيَّ اللَّهِ؟ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: عَلَيْكُمْ بِأَسْقِيَةِ الْأَدَمِ الَّتِي يُلَاثُ عَلَى أَفْوَاهِهَا.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے وفد عبدالقیس کے قصے میں مروی ہے کہ انہوں نے پوچھا: اے اﷲ کے نبی! ہم کن برتنوں میں پیا کریں۔تو نبی کریم ﷺ نے فرمایا ’’چمڑے کے مشکیزے استعمال کرو جن کے مونہوں پر تاگا لپیٹ کر انہیں بند کیا جاتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی فی الکبری (6833)<br>قتادۃ مدلس وعنعن`;
abudawood.anwaar = [131,1];