var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا إِسْمَعِيلُ بْنُ سُمَيْعٍ حَدَّثَنَا مَالِكُ بْنُ عُمَيْرٍ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْجِعَةِ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ہمیں کدو کے برتن (تونبے) روغن لگے ہوئے سبز برتن ‘ لکڑی کے برتن اور جَو کی شراب سے منع فرمایا ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ النسائي (5173، مالک بن عمیر اختلف في صحبتہ وروی لہ الضیاء المقدسي فی الأحادیث المختارۃ فھو حسن الحدیث، ورواہ عن صعصعۃ بن صوحان فالسند متصل)`;