var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي مَنْصُورٌ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ لَمَّا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْأَوْعِيَةِ قَالَ قَالَتْ الْأَنْصَارُ إِنَّهُ لَا بُدَّ لَنَا قَالَ فَلَا إِذَنْ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ جب رسول اللہ ﷺ نے برتنوں سے منع فرمایا تو انصار نے کہا: ہمیں ان برتنوں کے استعمال سے کوئی چارہ نہیں ہے۔تو آپ ﷺ نے فرمایا ’’تو پھر کوئی حرج نہیں۔“ (استعمال کر سکتے ہو)۔";
abudawood.hukam = "صحیح بخاری (5592)";
abudawood.description = ``;