var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا أَبُو الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ فِي سِقَاءٍ،فَإِذَا لَمْ يَجِدُوا سِقَاءً نُبِذَ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ کے لیے مشکیزے میں نبیذ بنایا جاتا تھا۔جب مشکیزہ نہ ہوتا تو پتھر کے بڑے پیالے میں بنا لیا کرتے تھے۔";
abudawood.hukam = "صحیح مسلم (1998)";
abudawood.description = ``;