var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يُنْتَبَذَ الزَّبِيبُ وَالتَّمْرُ جَمِيعًا وَنَهَى أَنْ يُنْتَبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے کشمش اور کھجور ملا کر نبیذ بنانے سے منع فرمایا ہے اور ایسے ہی تازہ (پختہ) کھجور اور نیم پختہ (گدری ہوئی) کھجور کو ملا کر نبیذ بنانے سے روکا ہے۔";
abudawood.hukam = "صحیح بخاری (5601) صحیح مسلم (1986)";
abudawood.description = ``;