var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَحَفْصُ بْنُ عُمَرَ النَّمَرِيُّ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ رَجُلٍ قَالَ حَفْصٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَهَى عَنْ الْبَلَحِ وَالتَّمْرِ وَالزَّبِيبِ وَالتَّمْرِ";
abudawood.urdu = "ابن ابی لیلیٰ ایک صحابی سے روایت کرتے ہیں کہ نبی کریم ﷺ نے کچی کھجور اور پختہ کھجور اور اسی طرح کشمش اور کھجور کو ملانے سے منع فرمایا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (5549 وسندہ صحیح) الحکم بن عتیبۃ صرح بالسماع عند أحمد (4/314) وروایۃ شعبۃ عن المدلسین محمولۃ بالسماع`;