var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ثَابِتِ بْنِ عُمَارَةَ حَدَّثَتْنِي رَيْطَةُ عَنْ كَبْشَةَ بِنْتِ أَبِي مَرْيَمَ قَالَتْ سَأَلْتُ أُمَّ سَلَمَةَ مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُ قَالَتْ كَانَ يَنْهَانَا أَنْ نَعْجُمَ النَّوَى طَبْخًا أَوْ نَخْلِطَ الزَّبِيبَ وَالتَّمْرَ";
abudawood.urdu = "کبثہ بنت ابی مریم کہتی ہیں کہ میں نے ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا سے پوچھا کہ نبی کریم ﷺ کس چیز سے منع کیا کرتے تھے؟ انہوں نے کہا: آپ ﷺ ہمیں منع کرتے تھے کہ کھجور کو اس قدر پکائیں کہ اس کی گٹھلی ہی ختم ہو جائے یا کشمش اور کھجور کو ملانے سے منع کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ریطۃ: لا تعرف،وکبشۃ بنت أبي مریم،لا یعرف حالھا (تقریب التہذیب: 8592،8670)`;
abudawood.anwaar = [132,1];