var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوَدَ عَنْ مِسْعَرٍ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ عَنْ امْرَأَةٍ مِنْ بَنِي أَسَدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنْبَذُ لَهُ زَبِيبٌ فَيُلْقِي فِيهِ تَمْرًا وَتَمْرٌ فَيُلْقِي فِيهِ الزَّبِيبَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ کے لیے کشمش کی نبیذ بنائی جاتی اور پھر اس میں کھجور ڈال دی جاتی تھی یا کھجور کی نبیذ بنائی جاتی اور پھر اس میں کشمش ڈال دی جاتی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>امرأۃ من بني أسد : مجہولۃ کما قال المنذري (انظر عون المعبود 384/3)`;
abudawood.anwaar = [132,1];