var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ مِسْعَرِ بْنِ كِدَامٍ،عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنِ النَّزَّالِ بْنِ سَبُرَةَ أَنَّ عَلِيًّا دَعَا بِمَاءٍ فَشَرِبَهُ وَهُوَ قَائِمٌ ثُمَّ قَالَ إِنَّ رِجَالًا يَكْرَهُ أَحَدُهُمْ أَنْ يَفْعَلَ هَذَا وَقَدْ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ يَفْعَلُ مِثْلَ مَا رَأَيْتُمُونِي أَفْعَلُهُ.";
abudawood.urdu = "جناب نزال بن سبرہ سے روایت ہے کہ سیدنا علی رضی اللہ عنہ نے پانی منگوایا اور کھڑے ہو کر پیا ‘ پھر کہا: تحقیق کچھ لوگ اس کو مکرو سمجھنے لگے ہیں حالانکہ میں نے رسول اللہ ﷺ کو دیکھا ہے کہ اس طرح کر لیا کرتے تھے جیسے تم نے مجھے کرتے دیکھا ہے۔(یعنی کھڑے ہو کر پی لیا کرتے تھے)۔";
abudawood.hukam = "صحیح بخاری (5615)";
abudawood.description = ``;