var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا قَتَادَةُ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ عَنِ الشُّرْبِ مِنْ فِي السِّقَاءِ وَعَنْ رُكُوبِ الْجَلَّالَةِ وَالْمُجَثَّمَةِ.\nقَالَ أَبو دَاود: الْجَلَّالَةُ الَّتِي تَأْكُلُ الْعَذْرَةَ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے منع فرمایا ہے کہ مشکیزے کے منہ سے منہ لگا کر پیا جائے اور گندگی کھانے والے جانور پر سواری کی جائے اور ایسا جانور کھایا جائے جس کو باندھ کر نشانہ مارا گیا ہو۔امام ابوداؤد رحمہ اللہ فرماتے ہیں: «جلالۃ» اس جانو کو کہتے ہیں جو پاخانہ کھاتا ہو۔(یعنی جس کی یہ عادت ہو)۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4126)
وللحدیث شواھد عند البخاري (5628) وأبي داود (2557) والترمذي (1795) وغیرھم`;