var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَفْرُكُ الْمَنِيَّ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُصَلِّي فِيهِ قَالَ أَبُو دَاوُد وَافَقَهُ مُغِيرَةُ وَأَبُو مَعْشَرٍ وَوَاصِلٌ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے کہا کہ میں رسول اللہ ﷺ کے کپڑے سے منی کو کھرچ ڈالا کرتی تھی اور پھر آپ ﷺ اسی میں نماز پڑھ لیا کرتے تھے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ مغیرہ،ابومعشر اور واصل نے حماد بن ابی سلیمان کی موافقت کی ہے۔";
abudawood.hukam = "صحیح مسلم (ح 288 من حدیث إبراھیم النخعي بہ)";
abudawood.description = ``;