var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ أَنَّهُ سَمِعَ عُبَيْدَ اللَّهِ ابْنَ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ اخْتِنَاثِ الْأَسْقِيَةِ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے اس بات سے منع فرمایا ہے کہ مشکیزوں کا منہ الٹ کر ان سے پیا جائے۔";
abudawood.hukam = "صحیح بخاری (5625) صحیح مسلم (2023)";
abudawood.description = ``;