var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ رَجُلٌ مِنْ الْأَنْصَارِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا بِإِدَاوَةٍ يَوْمَ أُحُدٍ فَقَالَ اخْنِثْ فَمَ الْإِدَاوَةِ ثُمَّ شَرِبَ مِنْ فِيهَا";
abudawood.urdu = "عیسیٰ بن عبداللہ انصاری اپنے والد سے روایت کرتے ہیں کہ احد کے دن نبی کریم ﷺ نے مشکیزہ منگوایا پھر فرمایا ’’اس کا منہ الٹاؤ۔‘‘ پھر آپ ﷺ نے اس کے منہ سے (منہ لگا کر پانی) پیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1891)<br>عبد اللّٰہ العمري ضعیف عابد (تق : 3489) إلا في نافع فھو حسن الحدیث عنہ<br>انظر تحفۃ الأقویاء (188)`;
abudawood.anwaar = [132,1];