var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ وَعَنْ يَسَارِهِ أَبُو بَكْرٍ فَشَرِبَ ثُمَّ أَعْطَى الْأَعْرَابِيَّ وَقَالَ الْأَيْمَنَ فَالْأَيْمَنَ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ کو دودھ پیش کیا گیا جس میں پانی ملایا گیا تھا۔اور آپ ﷺ کی دائیں جانب ایک دیہاتی تھا اور بائیں جانب ابوبکر رضی اللہ عنہ تھے۔آپ ﷺ نے دودھ پیا،پھر اس دیہاتی کو دے دیا اور فرمایا ’’داہنے والا،پھر داہنے والا۔‘‘";
abudawood.hukam = "صحیح بخاری (5619) صحیح مسلم (2029)";
abudawood.description = ``;