var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ أَبِي عِصَامٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا شَرِبَ تَنَفَّسَ ثَلَاثًا وَقَالَ هُوَ أَهْنَأُ وَأَمْرَأُ وَأَبْرَأُ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ جب پیتے تو تین سانس لیتے اور فرماتے ’’یہ (انداز) پیاس خوب بجھاتا ہے،ہضم کو قوت دیتا ہے اور تندرستی کا باعث ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (5631) صحیح مسلم (2028)";
abudawood.description = ``;