var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَنَفَّسَ فِي الْإِنَاءِ أَوْ يُنْفَخَ فِيهِ";
abudawood.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے برتن میں سانس لینے یا اس میں پھونک مارنے سے منع فرمایا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4277)
أخرجہ الترمذي (1818 وسندہ صحیح) ولہ شواھد کثیرۃ`;