var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَفُضَيْلُ بْنُ عَبْدُ الْوَهَّابِ السُّكَّرِيُّ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ كَثِيرِ بْنِ شِنْظِيرٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَفَعَهُ قَالَ وَاكْفِتُوا صِبْيَانَكُمْ عِنْدَ الْعِشَاءِ وَقَالَ مُسَدَّدٌ عِنْدَ الْمَسَاءِ فَإِنَّ لِلْجِنِّ انْتِشَارًا وَخَطْفَةً";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے مرفوعاً بیان کیا کہ ’’عشاء کے وقت،اور جناب مسدد نے روایت کیا کہ شام کے وقت اپنے بچوں کو (گھروں میں) روک کر رکھا کرو۔اس وقت جِن (زمین میں) پھیل جاتے ہیں اور (بچوں کو) اچک لیتے ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (3316) صحیح مسلم (2012)";
abudawood.description = ``;