var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُسْتَعْذَبُ لَهُ الْمَاءُ مِنْ بُيُوتِ السُّقْيَا قَالَ قُتَيْبَةُ هِيَ عَيْنٌ بَيْنَهَا وَبَيْنَ الْمَدِينَةِ يَوْمَانِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ کے لیے میٹھا پانی ’’سقیا‘‘ کے گھروں سے لایا جاتا تھا۔قتیبہ نے کہا: ’’سقیا‘‘ ایک چشمے کا نام تھا جو مدینے سے دو دن کی مسافت پر تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4284)`;