var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ،حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ زَادَ فَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ وَإِنْ كَانَ صَائِمًا فَلْيَدْعُ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا اور مذکورہ بالا حدیث کے ہم معنی ذکر دیا اور مزید کہا: ’’اگر روزہ نہ رکھا ہو تو کھانے میں شریک ہو جائے اور اگر روزے سے ہو تو (صاحب طعام کے لیے) دعا کرے۔‘‘";
abudawood.hukam = "صحیح مسلم (1429)";
abudawood.description = ``;