var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: إِذَا دَعَا أَحَدُكُمْ أَخَاهُ فَلْيُجِبْ عُرْسًا كَانَ أَوْ نَحْوَهُ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’جب تمہیں تمہارا بھائی دعوت دے تو قبول کرنی چاہیئے،شادی (کا ولیمہ) ہو یا اس کی مانند کوئی اور۔‘‘";
abudawood.hukam = "صحیح مسلم (1429)";
abudawood.description = `وانظر الحدیث السابق (3736)`;