var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ دُعِيَ فَلْيُجِبْ فَإِنْ شَاءَ طَعِمَ وَإِنْ شَاءَ تَرَكَ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جسے دعوت دی گئی ہو اسے چاہیئے کہ قبول کر لے،پھر اگر چاہے تو کھانا کھا لے اور اگر چاہے تو نہ کھائے۔‘‘";
abudawood.hukam = "صحیح مسلم (1430)";
abudawood.description = ``;