var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا دُرُسْتُ بْنُ زِيَادٍ،عَنْ أَبَانَ بْنِ طَارِقٍ،عَنْ نَافِعٍ،قَالَ: قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ،قَالَ: رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: مَنْ دُعِيَ فَلَمْ يُجِبْ،فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ،وَمَنْ دَخَلَ عَلَى غَيْرِ دَعْوَةٍ دَخَلَ سَارِقًا،وَخَرَجَ مُغِيرًا.\nقَالَ أَبو دَاود: أَبَانُ بْنُ طَارِقٍ مَجْهُولٌ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جسے دعوت دی گئی اور اس نے اسے قبول نہ کیا تو اس نے اللہ اور اس کے رسول کی نافرمانی کی،اور جو شخص بن بلائے کسی دعوت میں جا پہنچا،تو وہ ان میں چور بن کر داخل ہوا اور لٹیرا بن کر نکلا۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: (راوی) ابان بن طارق مجہول ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>درست ضعیف و أبان بن طارق : مجہول الحال (تق : 1825،139)`;
abudawood.anwaar = [132,1];