var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَانَ يَقُولُ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الْأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ وَمَنْ لَمْ يَأْتِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہا کرتے تھے کہ سب سے برا ولیمہ وہ ہے جس میں اغنیاء اور امیروں کو بلایا جائے اور مساکین اور فقیروں کو چھوڑ دیا جائے اور جو دعوت میں نہیں آیا اس نے اللہ اور اس کے رسول کی نافرمانی کی۔";
abudawood.hukam = "صحیح بخاری (5177) صحیح مسلم (1432)";
abudawood.description = ``;