var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ قَالَ ذُكِرَ تَزْوِيجُ زَيْنَبَ بِنْتِ جَحْشٍ عِنْدَ أَنَسِ بْنِ مَالِكٍ فَقَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى أَحَدٍ مِنْ نِسَائِهِ مَا أَوْلَمَ عَلَيْهَا أَوْلَمَ بِشَاةٍ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کی مجلس میں ام المؤمنین سیدہ زینب بنت جحش رضی اللہ عنہا کے نکاح کا ذکر آ گیا تو انہوں نے کہا: میں نے نہیں دیکھا کہ رسول اللہ ﷺ نے اپنی کسی بیوی کے ولیمہ میں اس قدر اہتمام کیا ہو جتنا ان کے موقع پر ولیمہ میں کیا تھا۔آپ ﷺ نے ایک بکری سے ولیمہ کیا۔";
abudawood.hukam = "صحیح بخاری (5171) صحیح مسلم (1428)";
abudawood.description = ``;