var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى حَدَّثَنَا سُفْيَانُ حَدَّثَنَا وَائِلُ بْنُ دَاوُدَ عَنْ ابْنِهِ بَكْرِ بْنِ وَائِلٍ عَنْ الزَّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى صَفِيَّةَ بِسَوِيقٍ وَتَمْرٍ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے ام المؤمنین سیدہ صفیہ رضی اللہ عنہا کے نکاح میں ستو اور کھجور سے ولیمہ کیا تھا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3220)
وللحدیث شواھد عند البخاري (371) ومسلم (1365 بعد ح 1427)`;