var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ... بِهَذِهِ الْقِصَّةِ،قَالَ: فَدُعِيَ الْيَوْمَ الثَّالِثَ فَلَمْ يُجِبْ،وَحَصَبَ الرَّسُولَ.";
abudawood.urdu = "جناب قتادہ رحمہ اللہ نے سیدنا سعید بن مسیب سے یہ قصہ بیان کیا۔کہا کہ تیسرے دن بلایا گیا تو دعوت قبول نہ کی اور پیغام لانے والے کو کنکر دے مارا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>قتادۃ عنعن وسمعہ من رجل مجہول<br>انظر الحدیث السابق (3745)`;
abudawood.anwaar = [133,1];