var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُحَمَّدُ بْنُ مَحْبُوبٍ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ فَمَا سِوَى ذَلِكَ فَهُوَ صَدَقَةٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’میزبانی تین دن ہے جو اس کے علاوہ ہو،وہ صدقہ ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `عاصم ھو ابن بھدلۃ`;