var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَخَلَفُ بْنُ هِشَامٍ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ عَامِرٍ عَنْ أَبِي كَرِيمَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةُ الضَّيْفِ حَقٌّ عَلَى كُلِّ مُسْلِمٍ فَمَنْ أَصْبَحَ بِفِنَائِهِ فَهُوَ عَلَيْهِ دَيْنٌ إِنْ شَاءَ اقْتَضَى وَإِنْ شَاءَ تَرَكَ";
abudawood.urdu = "سیدنا ابوکریمہ (مقدام بن معدیکرب) رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’ایک رات کی ضیافت ہر مسلمان پر حق لازم (واجب) ہے۔جو شخص کسی کے صحن میں اترے تو ضیافت اس پر قرض ہے،مہمان چاہے تو وصول کر لے اور اگر چاہے تو چھوڑ دے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ ابن ماجہ (3677 وسندہ صحیح)`;