var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ حَدَّثَنِي أَبُو الْجُودِيِّ عَنْ سَعِيدِ بْنِ أَبِي الْمُهَاجِرِ عَنْ الْمِقْدَامِ أَبِي كَرِيمَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَجُلٍ أَضَافَ قَوْمًا فَأَصْبَحَ الضَّيْفُ مَحْرُومًا فَإِنَّ نَصْرَهُ حَقٌّ عَلَى كُلِّ مُسْلِمٍ حَتَّى يَأْخُذَ بِقِرَى لَيْلَةٍ مِنْ زَرْعِهِ وَمَالِهِ";
abudawood.urdu = "سیدنا مقدام (مقدام بن معد یکرب) ابوکریمہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص کسی قوم کا مہمان ہو پھر وہ ضیافت سے محروم رہے تو اس کی نصرت کرنا ہر مسلمان پر واجب ہے حتیٰ کہ وہ ان سے اپنی ایک رات کی ضیافت حاصل کر لے۔اس کی کھیتی سے اور مال سے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4247)
أبو الجودي و سعید بن أبي المھاجر صدوقان لاینز حدیثھما عن درجۃ الحسن`;