var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدِ السَّلَامِ بْنِ حَرْبٍ عَنْ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ أَبِي الْعَلَاءِ الْأَوْدِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اجْتَمَعَ الدَّاعِيَانِ فَأَجِبْ أَقْرَبَهُمَا بَابًا فَإِنَّ أَقْرَبَهُمَا بَابًا أَقْرَبَهُمَا جِوَارًا وَإِنْ سَبَقَ أَحَدُهُمَا فَأَجِبْ الَّذِي سَبَقَ";
abudawood.urdu = "ایک صحابی سے مروی ہے نبی کریم ﷺ نے فرمایا ’’جب دو شخص دعوت دینے والے اکٹھے ہو جائیں تو اس کی دعوت قبول کر جس کا دروازہ ان میں سے زیادہ قریب ہو کیونکہ جس کا دروازہ زیادہ قریب ہو اسی کی ہمسائیگی زیادہ قریب ہوتی ہے۔اور اگر ان میں سے ایک پہلے آیا ہے تو پہلے آنے والے کی قبول کر۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو خالد الدالاني عنعن<br>والحدیث ضعفہ الحافظ فی التلخیص (196/3ح 1561)`;
abudawood.anwaar = [133,1];