var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا مُعَلَّى يَعْنِي ابْنَ مَنْصُورٍ عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُؤَخَّرُ الصَّلَاةُ لِطَعَامٍ وَلَا لِغَيْرِهِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’کھانے یا کسی اور وجہ سے نماز کو مؤخر نہ کیا جائے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن میمون الزعفراني ضعیف،کما فی التحریر (6346) ضعفہ الجمہور`;
abudawood.anwaar = [133,1];