var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْخَلَاءِ فَقُدِّمَ إِلَيْهِ طَعَامٌ فَقَالُوا أَلَا نَأْتِيكَ بِوَضُوءٍ فَقَالَ إِنَّمَا أُمِرْتُ بِالْوُضُوءِ إِذَا قُمْتُ إِلَى الصَّلَاةِ";
abudawood.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ بیت الخلاء سے نکلے تو آپ ﷺ کو کھانا پیش کیا گیا۔صحابہ نے کہا: کیا آپ ﷺ کے لیے وضو کا پانی نہ لے آئیں؟ آپ ﷺ نے فرمایا ’’مجھے وضو کا حکم اسی وقت ہے جب میں نماز کے لیے کھڑا ہوں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4209)
أخرجہ الترمذي (1848 وسندہ صحیح) والنسائي (132 وسندہ صحیح)`;