var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي مَرْيَمَ حَدَّثَنَا عَمِّي يَعْنِي سَعَيدَ بْنَ الْحَكَمِ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ أَخْبَرَنِي خَالِدُ بْنُ يَزِيدَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَ أَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ شِعْبٍ مِنْ الْجَبَلِ وَقَدْ قَضَى حَاجَتَهُ وَبَيْنَ أَيْدِينَا تَمْرٌ عَلَى تُرْسٍ أَوْ حَجَفَةٍ فَدَعَوْنَاهُ فَأَكَلَ مَعَنَا وَمَا مَسَّ مَاءً";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ ایک پہاڑی کی گھاٹی کی طرف سے تشریف لائے۔آپ ﷺ قضائے حاجت سے آئے تھے اور ہمارے سامنے ڈھال پر کھجوریں رکھی تھیں۔ہم نے آپ ﷺ کو دعوت دی تو آپ ﷺ نے ہمارے ساتھ مل کر تناول فرمائیں اور پانی کو ہاتھ بھی نہیں لگایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الزبیر عنعن`;
abudawood.anwaar = [133,1];