var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ عَنِ الْأَعْمَشِ،عَنْ أبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ, قَال:َ مَا عَابَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ طَعَامًا قَطُّ إِنِ اشْتَهَاهُ أَكَلَهُ وَإِنْ كَرِهَهُ تَرَكَهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے،وہ فرماتے ہیں کہ رسول اللہ ﷺ نے کبھی کسی کھانے میں عیب نہیں نکالا۔آپ ﷺ کی طبیعت چاہتی تو تناول فرما لیتے اگر ناپسند کرتے تو چھوڑ دیتے۔";
abudawood.hukam = "صحیح بخاری (5409) صحیح مسلم (2064)";
abudawood.description = ``;