var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ يَعْنِي ابْنَ أَبِي عَبْدِ اللَّهِ الدَّسْتُوَائِيَّ عَنْ بُدَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ امْرَأَةٍ مِنْهُمْ يُقَالُ لَهَا أُمُّ كُلْثُومٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَذْكُرْ اسْمَ اللَّهِ تَعَالَى فَإِنْ نَسِيَ أَنْ يَذْكُرَ اسْمَ اللَّهِ تَعَالَى فِي أَوَّلِهِ فَلْيَقُلْ بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے جب کوئی کھانا کھانے لگے تو چاہیئے کہ اللہ تعالیٰ کا نام ذکر کرے ‘ اگر شروع میں بھول جائے تو چاہیئے کہ یوں کہے «بسم اللہ أولہ وآخرہ» ’’اللہ کے نام سے اس (کھانے) کے شروع میں اور آخر میں بھی۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4202)
أخرجہ الترمذي (1858 وسندہ صحیح)`;