var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنِ ابْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ أَبِي حَرْبِ بْنِ أَبِي الْأَسْوَدِ،عَنْ أَبِيهِ،عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: «يُغْسَلُ مِنْ بَوْلِ الْجَارِيَةِ،وَيُنْضَحُ مِنْ بَوْلِ الْغُلَامِ مَا لَمْ يَطْعَمْ»";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے منقول ہے کہ لڑکی کا پیشاب دھویا جائے اور لڑکے کے پیشاب پر چھینٹے مارے جائیں جب تک کہ کھانا نہ کھاتا ہو۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (610)،ابن ماجہ (525)<br>قتادۃ عنعن (تقدم: 29) وقول قتادۃ: ’’ھذا ما لم یطعما الطعام فإذا طعما غسلا جمیعًا‘‘ صحیح عنہ`;
abudawood.anwaar = [27,1];