var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا وَكِيعٌ عَنْ مُصْعَبِ بْنِ سُلَيْمٍ قَالَ سَمِعْتُ أَنَسًا يَقُولُ بَعَثَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَجَعْتُ إِلَيْهِ فَوَجَدْتُهُ يَأْكُلُ تَمْرًا وَهُوَ مُقْعٍ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے تھے کہ نبی کریم ﷺ نے مجھے (کسی کام سے) بھیجا۔پھر میں آپ ﷺ کے پاس واپس حاضر ہوا تو میں نے دیکھا کہ آپ ﷺ کھجوریں کھا رہے تھے اور اقعاء کی حالت میں بیٹھے ہوئے تھے۔";
abudawood.hukam = "صحیح مسلم (2044)";
abudawood.description = `مشکوۃ المصابیح (4212)`;