var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ ثَابِتٍ الْبُنَانِيِّ،عَنْ شُعَيْبِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنْ أَبِيهِ،قَالَ: «مَا رُئِيَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مُتَّكِئًا قَطُّ،وَلَا يَطَأُ عَقِبَهُ رَجُلَانِ";
abudawood.urdu = "جناب شعیب بن عبداللہ بن عمرو اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ کو کبھی نہیں دیکھا گیا کہ آپ ﷺ نے تکیہ لگا کر کھانا کھایا ہو یا دو آدمیوں نے بھی آپ ﷺ کی ایڑیاں روندی ہوں۔(ایسے نہیں ہوا کہ آپ ﷺ تکبرانہ انداز سے آگے آگے چلیں اور لوگ آپ ﷺ کے پیچھے ہوں)۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;