var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلَا يَأْكُلْ مِنْ أَعْلَى الصَّحْفَةِ وَلَكِنْ لِيَأْكُلْ مِنْ أَسْفَلِهَا فَإِنَّ الْبَرَكَةَ تَنْزِلُ مِنْ أَعْلَاهَا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جب کوئی کھانا کھانے لگے تو پیالے کے اوپر (درمیان) سے نہ کھائے بلکہ نیچے (ایک جانب) سے کھائے۔بلاشبہ برکت اس کے اوپر کی طرف سے اترتی ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4211)
أخرجہ ابن ماجہ (3277 وسندہ حسن)`;