var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ جَدِّهِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جب تم میں سے کوئی کھائے تو اپنے دائیں ہاتھ سے کھائے اور جب پیے تو اپنے دائیں ہاتھ سے پیے ‘ بلاشبہ شیطان اپنے بائیں ہاتھ سے کھاتا اور اپنے بائیں سے پیتا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2020)";
abudawood.description = ``;