var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ لُوَيْنٌ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ أَبِي وَجْزَةَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادْنُ بُنَيَّ فَسَمِّ اللَّهَ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ";
abudawood.urdu = "سیدنا عمر بن ابی سلمہ رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’میرے قریب ہو جاؤ ‘ اﷲ کا نام لو ‘ («بسم اللہ» پڑھو) دائیں ہاتھ سے کھاؤ اور اپنے سامنے سے کھاؤ۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أبو وجزۃ صرح بالسماع عند عبد اللہ بن أحمد بن حنبل في زوائد المسند (4/27)`;