var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقْطَعُوا اللَّحْمَ بِالسِّكِّينِ فَإِنَّهُ مِنْ صَنِيعِ الْأَعَاجِمِ وَانْهَسُوهُ فَإِنَّهُ أَهْنَأُ وَأَمْرَأُ قَالَ أَبُو دَاوُد وَلَيْسَ هُوَ بِالْقَوِيِّ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’گوشت چھری سے کاٹ کر مت کھاؤ ‘ کیونکہ یہ عجمیوں کا طریقہ ہے ‘ بلکہ دانتوں سے کاٹ کر اور نوچ کر کھاؤ ‘ اس طرح یہ زیادہ لذت دیتا ہے اور خوب ہضم ہوتا ہے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں یہ روایت قوی نہیں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو معشر نجیح : ضعیف (تقریب التہذیب: 7100)`;
abudawood.anwaar = [134,1];