var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا أَبُو دَاوُدَ،عَنْ زُهَيْرٍ،عَنْ أَبِي إِسْحَاقَ،عَنْ سَعْدِ بْنِ عِيَاضٍ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ, قَالَ: كَانَ أَحَبُّ الْعُرَاقِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ عُرَاقَ الشَّاةِ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کو بکری کی ایسی ہڈی بہت پسند تھی جس پر سے گوشت اتار لیا گیا ہو اور تھوڑا باقی ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی فی الشمائل (168)<br>أبوإسحاق مدلس وعنعن<br>وحدیث البخاري (3340) ومسلم (194) یغني عنہ`;
abudawood.anwaar = [134,1];