var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا أَبُو دَاوُدَ بِهَذَا الْإِسْنَادِ, قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ الذِّرَاعُ, قَالَ: وَسُمَّ فِي الذِّرَاعِ, وَكَانَ يَرَى أَنَّ الْيَهُودَ هُمْ سَمُّوهُ.";
abudawood.urdu = "جناب ابوداؤد (ابوداؤد الطیالسی) رحمہ اللہ نے اسی سند سے روایت کیا کہ نبی کریم ﷺ کو دستی کا گوشت بہت پسند تھا۔بیان کیا کہ آپ ﷺ کو دستی کے گوشت ہی میں زہر دینے کی کوشش کی گئی تھی اور یہ کار ستانی یہودیوں نے کی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی فی الشمائل (167)<br>انظر الحدیث السابق (3780)`;
abudawood.anwaar = [134,1];