var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ السَّمْتِيُّ حَدَّثَنَا الْمُبَارَكُ بْنُ سَعِيدٍ عَنْ عُمَرَ بْنِ سَعِيدٍ عَنْ رَجُلٍ مَنْ أَهْلِ الْبَصْرَةِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ أَحَبَّ الطَّعَامِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثَّرِيدُ مِنْ الْخُبْزِ وَالثَّرِيدُ مِنْ الْحَيْسِ قَالَ أَبُو دَاوُد وَهُوَ ضَعِيفٌ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے بیان کیا کہ روٹی کا ثرید اور حیس کا ثرید رسول اللہ ﷺ کو سب کھانوں سے زیادہ پسند تھا۔امام ابوداؤد رحمہ اللہ نے بیان کیا کہ یہ ضعیف ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من أھل البصرۃ مجہول (عون المعبود 412/3 عن المنذري) وسقط ذکرہ فی المستدرک (116/4) فصححاہ!`;
abudawood.anwaar = [134,1];