var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ حَدَّثَنِي قَبِيصَةُ بْنُ هُلْبٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَأَلَهُ رَجُلٌ فَقَالَ إِنَّ مِنْ الطَّعَامِ طَعَامًا أَتَحَرَّجُ مِنْهُ فَقَالَ لَا يَتَخَلَّجَنَّ فِي صَدْرِكَ شَيْءٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّةَ";
abudawood.urdu = "جناب قبیصہ بن ہلب طلائی اپنے والد سے روایت کرتے ہیں،وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا جبکہ ایک آدمی نے آپ ﷺ سے سوال کیا تھا کہ کچھ کھانے ایسے ہیں جن کے کھانے میں میں حرج سمجھتا ہوں۔آپ ﷺ نے فرمایا ’’کوئی (حلال) چیز تیرے سینے میں شک و شبہ نہ ڈالے ‘ اس سے تو نصرانیوں (راہبوں) کے مشابہ ہو جائے گا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4087)
أخرجہ الترمذي (1565 وسندہ حسن)`;