var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ جَهْمٍ حَدَّثَنَا عُمْرُو بْنُ أَبِي قَيْسٍ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَلَّالَةِ فِي الْإِبِلِ أَنْ يُرْكَبَ عَلَيْهَا أَوْ يُشْرَبَ مِنْ أَلْبَانِهَا";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے نجاست خور اونٹ پر سواری کرنے اور اس کا دودھ پینے سے منع فرمایا ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4126)
انظر الحدیثین السابقین (2557، 2558)`;