var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ وَأَذِنَ لَنَا فِي لُحُومِ الْخَيْلِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے ہمیں خیبر والے دن گدھوں کے گوشت سے منع فرمایا اور گھوڑوں کے گوشت کی اجازت دی تھی۔";
abudawood.hukam = "صحیح بخاری (4219) صحیح مسلم (1941)";
abudawood.description = ``;