var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ ذَبَحْنَا يَوْمَ خَيْبَرَ الْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ فَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِغَالِ وَالْحَمِيرِ وَلَمْ يَنْهَنَا عَنْ الْخَيْلِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ہم نے خیبر کے روز گھوڑے ‘ خچر اور گدھے ذبح کیے تو رسول اللہ ﷺ نے ہمیں خچروں اور گدھوں سے منع فرما دیا لیکن گھوڑوں سے منع نہیں فرمایا۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ مسلم (1941)`;