var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أُمِّهِ أَنَّهَا أَبْصَرَتْ أُمَّ سَلَمَةَ تَصُبُّ الْمَاءَ عَلَى بَوْلِ الْغُلَامِ مَا لَمْ يَطْعَمْ فَإِذَا طَعِمَ غَسَلَتْهُ وَكَانَتْ تَغْسِلُ بَوْلَ الْجَارِيَةِ";
abudawood.urdu = "۔جناب حسن بصری اپنی والدہ سے راوی ہیں وہ بیان کرتی ہیں کہ انہوں نے سیدہ ام سلمہ رضی اللہ عنہا کو دیکھا کہ وہ لڑکے کے پیشاب پر چھینٹے مارتیں جب تک کہ وہ کھانا نہ کھاتا،جب کھانا کھانے لگتا تو اس کو دھوتی تھیں اور لڑکی کے پیشاب کو دھوتی تھیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الحسن البصري مدلس وعنعن (تقدم: 17)`;
abudawood.anwaar = [27,1];