var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كُنْتُ غُلَامًا حَزَوَّرًا فَصِدْتُ أَرْنَبًا فَشَوَيْتُهَا فَبَعَثَ مَعِي أَبُو طَلْحَةَ بِعَجُزِهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ بِهَا فَقَبِلَهَا";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ میں ایک نوخیز مضبوط لڑکا تھا۔میں نے ایک خرگوش شکار کیا ‘ پھر میں نے اسے بھون لیا۔تو سیدنا ابوطلحہ رضی اللہ عنہ نے مجھے اس کا پچھلا دھڑ دے کر نبی کریم ﷺ کی خدمت میں بھیجا۔میں اسے آپ کے پاس لے آیا تو آپ نے اسے قبول فرما لیا۔";
abudawood.hukam = "صحیح بخاری (2572) صحیح مسلم (1953)";
abudawood.description = ``;