var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ أَنَّ الْحَكَمَ بْنَ نَافِعٍ حَدَّثَهُمْ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ ضَمْضَمِ بْنِ زُرْعَةَ عَنْ شُرَيْحِ بْنِ عُبَيْدٍ عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِبْلٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لَحْمِ الضَّبِّ";
abudawood.urdu = "سیدنا عبدالرحمٰن بن شبل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے سانڈے کا گوشت کھانے سے منع فرمایا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>اسماعیل بن عیاش مدلس وعنعن (معاذعلی زئی)`;
abudawood.anwaar = [135,1];