var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ الرَّحْمَنِ ابْنِ مَهْدِيٍّ حَدَّثَنِي بُرَيْهُ بْنُ عُمَرَ بْنِ سَفِينَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ أَكَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمَ حُبَارَى";
abudawood.urdu = "بریہ بن عمر بن سفینہ اپنے والد سے وہ (ان کے باپ عمر بن سفینہ) ان کے دادا سے روایت کرتے ہیں،وہ کہتے ہیں کہ میں نے نبی کریم ﷺ کے ساتھ ’’حبارٰی‘‘ گوشت کھایا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1828)<br>بریہ : إبراہیم بن عمر : ضعیف (التحریر : 221) ضعفہ الجمہور`;
abudawood.anwaar = [135,1];