var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا غَالِبُ بْنُ حَجْرَةَ حَدَّثَنِي مِلْقَامُ بْنُ التَّلِبِّ عَنْ أَبِيهِ قَالَ صَحِبْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ أَسْمَعْ لِحَشَرَةِ الْأَرْضِ تَحْرِيمًا";
abudawood.urdu = "جناب ملقام بن تلب اپنے والد سے بیان کرتے ہیں کہ انہوں نے کہا: میں رسول اللہ ﷺ کی صحبت میں رہا ہوں مگر میں نے آپ ﷺ سے حشرات الارض (زمین کے اندر رہنے والے جانوروں) کی حرمت کے بارے میں کچھ نہیں سنا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ملقام : مستور (تق: 6878) أي مجہول الحال`;
abudawood.anwaar = [135,1];