var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَقَ حَدَّثَنَا أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَمَسَّحَ بِعَظْمٍ أَوْ بَعْرٍ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ ہمیں رسول اللہ ﷺ نے ہڈی یا مینگنی سے استنجاء کرنے سے منع فرمایا تھا۔";
abudawood.hukam = "صحیح مسلم (263)";
abudawood.description = ``;