var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمَّارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الضَّبُعِ فَقَالَ هُوَ صَيْدٌ وَيُجْعَلُ فِيهِ كَبْشٌ إِذَا صَادَهُ الْمُحْرِمُ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ ﷺ سے لگڑ بگڑ کے متعلق دریافت کیا تو آپ ﷺ نے فرمایا ’’وہ شکار ہے اگر اسے محرم شکار کرے تو اس کو ایک مینڈھا فدیہ دینا ہو گا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2704)`;