var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السَّبُعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے ہر کچلی والے درندے اور ہر پنجے دار پرندے کے کھانے سے منع فرمایا ہے۔";
abudawood.hukam = "صحیح مسلم (1934)";
abudawood.description = ``;