var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ ابْنِ أَبِي عَدِيٍّ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے خیبر کے روز ہر کچلی والا درندہ اور پنجے دار پرندہ کھانا منع فرمایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3234) نسائی (4353)<br>سعید بن أبي عروبۃ مدلس و عنعن`;
abudawood.anwaar = [135,1];