var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ عُمَرَ بْنِ زَيْدٍ الصَّنْعَانِيِّ أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْهِرِّ قَالَ ابْنُ عَبْدِ الْمَلِكِ عَنْ أَكْلِ الْهِرِّ وَأَكْلِ ثَمَنِهَا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے بلی کی قیمت سے منع فرمایا ہے۔ابن عبدالملک کی روایت میں ہے کہ آپ ﷺ نے بلی کے کھانے اور اس کی قیمت کے کھانے سے منع فرمایا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (3480)`;