var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ،حَدَّثَنَا أَبُو نُعَيْمٍ،عَنْ مِسْعَرٍ،عَنْ عُبَيْدٍ عَنِ ابْنِ مَعْقِلٍ،عَنْ رَجُلَيْنِ مِنْ مُزَيْنَةَ-أَحَدُهُمَا عَنِ الْآخَرِ-, أَحَدُهُمَا: عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ عُوَيْمٍ،وَالْآخَرُ غَالِبُ بْنُ الْأَبْجَرِ. قَالَ مِسْعَرٌ: أَرَى غَالِبًا الَّذِي أَتَى النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ.";
abudawood.urdu = "ابن معقل قبیلہ مزینہ کے دو آدمیوں سے روایت کرتے ہیں ان میں سے ایک دوسرے سے روایت کرتا ہے۔ایک عبداللہ بن عمرو بن عویم ہے اور دوسرا غالب بن ابجر۔مسعر نے کہا: میرا خیال ہے کہ یہ غالب ہی تھا جو نبی کریم ﷺ کے پاس آیا تھا۔اور یہ روایت بیان کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظرالحدیث السابق (3809)`;
abudawood.anwaar = [135,2];