var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ حَدَّثَنَا وُهَيْبٌ عَنْ ابْنِ طَاوُسٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَعَنْ الْجَلَّالَةِ عَنْ رُكُوبِهَا وَأَكْلِ لَحْمِهَا";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے خیبر کے روز پالتو گدھوں کے گوشت ‘ گندگی (نجاست) کھانے والے جانوروں کی سواری اور ان کا گوشت کھانے سے منع فرمایا تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (4452 وسندہ حسن)`;