var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى وَسَأَلْتُهُ عَنْ الْجَرَادِ فَقَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّ أَوْ سَبْعَ غَزَوَاتٍ فَكُنَّا نَأْكُلُهُ مَعَهُ";
abudawood.urdu = "ابویعفور کہتے ہیں کہ میں نے سیدنا عبداللہ بن ابی اوفی رضی اللہ عنہ سے سنا۔جب کہ میں نے ان سے ٹڈی کے متعلق سوال کیا تو انہوں نے کہا: میں نے رسول اللہ ﷺ کے ساتھ چھ یا سات غزوات میں شرکت کی ہے۔ہم اسے کھایا کرتے تھے اور رسول اللہ ﷺ ہمارے ساتھ ہوتے تھے۔";
abudawood.hukam = "صحیح بخاری (5495) صحیح مسلم (1952)";
abudawood.description = ``;