var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُبْنَةٍ فِي تَبُوكَ فَدَعَا بِسِكِّينٍ فَسَمَّى وَقَطَعَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ تبوک میں نبی کریم ﷺ کو «جبنۃ» یعنی پنیر پیش کیا گیا تو آپ ﷺ نے چھری منگوائی اور پھر بسم اللہ پڑھ کر اسے کاٹا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4227)`;