var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الشَّيْبَانِيِّ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ حُذَيْفَةَ أَظُنُّهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَفَلَ تُجَاهَ الْقِبْلَةِ جَاءَ يَوْمَ الْقِيَامَةِ تَفْلُهُ بَيْنَ عَيْنَيْهِ وَمَنْ أَكَلَ مِنْ هَذِهِ الْبَقْلَةِ الْخَبِيثَةِ فَلَا يَقْرَبَنَّ مَسْجِدَنَا ثَلَاثًا";
abudawood.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے منقول ہے،راوی کا خیال ہے کہ وہ رسول اللہ ﷺ سے روایت کرتے ہیں،فرمایا ’’جس نے قبلے کی طرف تھوکا تو قیامت کے دن وہ شخص اس حال میں آئے گا کہ اس کا تھوک اس کی آنکھوں کے درمیان لگا ہو گا ‘ اور جس نے یہ ناپسندیدہ سبزی کھائی ہو وہ ہرگز ہماری مسجد کے قریب نہ آئے‘‘ آپ ﷺ نے یہ بات تین بار فرمائی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>جریر بن عبدالحمید شک في رفع الحدیث<br>فالسند معلل<br>وللحدیث طریق موقوف عند ابن أبي شیبۃ (2/ 365) وسندہ صحیح`;
abudawood.anwaar = [136,1];