var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبَنَّ الْمَسَاجِدَ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جس نے یہ سبزی کھائی ہو (لہسن اور پیاز) تو وہ ہرگز مسجدوں کے قریب نہ جائے۔‘‘";
abudawood.hukam = "صحیح بخاری (853) صحیح مسلم (561)";
abudawood.description = ``;