var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْجَرَّاحُ أَبُو وَكِيعٍ عَنْ أَبِي إِسْحَقَ عَنْ شَرِيكٍ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَ نُهِيَ عَنْ أَكْلِ الثُّومِ إِلَّا مَطْبُوخًا قَالَ أَبُو دَاوُد شَرِيكُ بْنُ حَنْبَلٍ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ نے بیان کیا کہ لہسن کھانے سے منع کیا گیا ہے سوائے اس کے کہ پکا ہوا ہو۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ سند میں مذکور راوی ’’شریک‘‘ سے مراد شریک بن حنبل ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1808)<br>أبو إسحاق عنعن واختلط أیضًا (انظر التقریب : 5065)<br>والحدیث ضعفہ الترمذي`;
abudawood.anwaar = [136,1];