var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا ح و حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ عَنْ أَبِي زِيَادٍ خِيَارِ بْنِ سَلَمَةَ أَنَّهُ سَأَلَ عَائِشَةَ عَنْ الْبَصَلِ فَقَالَتْ إِنَّ آخِرَ طَعَامٍ أَكَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامٌ فِيهِ بَصَلٌ";
abudawood.urdu = "ابوزیاد خیار بن سلمہ نے ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے پیاز کے متعلق پوچھا تو انہوں نے کہا: آخری کھانا جو رسول اللہ ﷺ نے تناول فرمایا اس میں پیاز شامل تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خیار بن سلمۃ : مجہول (التحریر : 1771) لم یوثقہ غیر ابن حبان`;
abudawood.anwaar = [136,1];