var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى عَنْ يَزِيدَ الْأَعْوَرِ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ كِسْرَةً مِنْ خُبْزِ شَعِيرٍ فَوَضَعَ عَلَيْهَا تَمْرَةً وَقَالَ هَذِهِ إِدَامُ هَذِهِ";
abudawood.urdu = "سیدنا یوسف بن عبداللہ بن سلام رضی اللہ عنہ کہتے ہیں کہ میں نے نبی کریم ﷺ کو دیکھا کہ آپ نے جَو کی روٹی کا ٹکڑا لیا اور اس پر کھجور رکھی اور فرمایا ’’یہ اس کا سالن ہے۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (3260)`;
abudawood.anwaar = [137,1];