var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْوَلِيدُ بْنُ عُتْبَةَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ نے فرمایا ہے ’’جس گھر میں کھجور نہ ہو وہ گھر والے بھوکے ہیں۔‘‘";
abudawood.hukam = "صحیح مسلم (2046)";
abudawood.description = ``;