var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا هَمَّامٌ،عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ كَانَ يُؤْتَى بِالتَّمْرِ فِيهِ دُودٌ... فَذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "اسحاق بن عبداللہ بن ابی طلحہ سے مروی ہے کہ (بعض اوقات) نبی کریم ﷺ کو ایسی کھجور بھی پیش کر دی جاتی تھی جس میں کیڑا لگا ہوتا تھا۔اور پھر مذکورہ بالا روایت کے ہم معنی بیان کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (3832)`;