var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِي إِسْحَقَ عَنْ جَبَلَةَ بْنِ سُحَيْمٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْإِقْرَانِ إِلَّا أَنْ تَسْتَأْذِنَ أَصْحَابَكَ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے دو دو یا تین تین کھجوریں اکٹھی اٹھا کر کھانے سے منع فرمایا ہے الا یہ کہ تم اپنے ساتھیوں سے اجازت لے لو۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البخاري (5446) ومسلم (2045)`;