var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ نُصَيْرٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْبِطِّيخَ بِالرُّطَبِ فَيَقُولُ نَكْسِرُ حَرَّ هَذَا بِبَرْدِ هَذَا وَبَرْدَ هَذَا بِحَرِّ هَذَا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ تربوز اور تازہ کھجور ملا کر کھایا کرتے تھے اور فرماتے ’’ہم اس (کھجور) کی گرمی کا اس (تربوز) کی ٹھنڈک سے اور اس کی ٹھنڈک کا اس کی گرمی سے توڑ کرتے ہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4225)`;