var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ حَدَّثَنَا الْوَلِيدُ بْنُ مَزْيَدَ قَالَ سَمِعْتُ ابْنَ جَابِرٍ قَالَ حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ عَنْ ابْنَيْ بُسْرٍ السُّلَمِيَّيْنِ قَالَا دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدَّمْنَا زُبْدًا وَتَمْرًا وَكَانَ يُحِبُّ الزُّبْدَ وَالتَّمْرَ";
abudawood.urdu = "سلیم بن عامر نے بسر کے دو بیٹوں سے روایت کیا جو قبیلہ بنو سلیم سے تھے (اور ان کا نام عبداللہ اور عطیہ نقل ہوئے ہیں) انہوں نے بیان کیا کہ رسول اللہ ﷺ ہمارے ہاں تشریف لائے تو ہم نے آپ ﷺ کی خدمت میں مکھن اور کھجور پیش کی اور آپ ﷺ مکھن اور کھجور پسند فرمایا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4232)
أخرجہ ابن ماجہ (3334 وسندہ صحیح) ابنا بسر سلمیین ھما عبد اللہ بن بسر وعطیۃ بن بسر رضي اللہ عنھما`;