var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى وَإِسْمَعِيلُ عَنْ بُرْدِ بْنِ سِنَانٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُصِيبُ مِنْ آنِيَةِ الْمُشْرِكِينَ وَأَسْقِيَتِهِمْ فَنَسْتَمْتِعُ بِهَا فَلَا يَعِيبُ ذَلِكَ عَلَيْهِمْ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ ہم رسول اللہ ﷺ کی معیت میں جہاد پر جاتے تھے تو ہم مشرکوں سے برتن اور مشکیزے لے کر استعمال کر لیتے تھے اور آپ ﷺ اسے عیب نہ سمجھتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;