var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَأُخْبِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلْقُوا مَا حَوْلَهَا وَكُلُوا";
abudawood.urdu = "ام المؤمنین سیدہ میمونہ رضی اللہ عنہا سے روایت ہے کہ گھی میں چوہا گر گیا،نبی کریم ﷺ کو بتایا گیا تو آپ ﷺ نے فرمایا ’’(چوہا اور) اس کے ساتھ ساتھ جو ہے وہ گرا دو اور باقی کھا لو۔‘‘";
abudawood.hukam = "صحیح بخاری (5538)";
abudawood.description = ``;