var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ بُوذَوَيْهِ،عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ،عَنْ مَيْمُونَةَ عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ الزُّهْرِيِّ عَنِ ابْنِ الْمُسَيِّبِ.";
abudawood.urdu = "احمد بن صالح نے بیان کیا کہ ہمیں عبدالرزاق نے خبر دی،انہوں نے کہا،ہمیں عبدالرحمٰن بن بوزویہ نے معمر سے خبر دی،انہوں نے زہری سے،انہوں نے عبیداللہ بن عبداللہ سے،انہوں نے سیدنا ابن عباس رضی اللہ عنہما سے،انہوں نے ام المؤمنین سیدہ میمونہ رضی اللہ عنہا سے،انہوں نے نبی کریم ﷺ سے۔اسی (حدیث) کے مثل روایت کی جو زہری نے ابن مسیب سے روایت کی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4265)<br>وانظر الحدیث السابق (3842)`;
abudawood.anwaar = [137,1];