var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَامْقُلُوهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً وَفِي الْآخَرِ شِفَاءً وَإِنَّهُ يَتَّقِي بِجَنَاحِهِ الَّذِي فِيهِ الدَّاءُ فَلْيَغْمِسْهُ كُلُّهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تمہارے کسی کے برتن میں مکھی گر جائے تو اسے اسی میں ڈبو لو،بلاشبہ اس کے ایک پر میں بیماری اور دوسرے میں شفا ہوتی ہے،اور یہ اپنے بیماری والے پر سے اپنا بچاؤ کرتی ہے،لہٰذا اسے ساری کو ڈبو لینا چاہیئے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4143)
أخرجہ ابن خزیمۃ (105) ابن عجلان صرح بالسماع عند الطحاوي في مشکل الآثار (4/283 وسندہ حسن) ولہ شواھد عند البخاري (3320)`;