var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَحَدُكُمْ فَلَا يَمْسَحَنَّ يَدَهُ بِالْمِنْدِيلِ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی کھانا کھائے تو اس وقت تک اپنا ہاتھ رومال سے نہ پونچھے جب تک کہ اسے چاٹ نہ لے یا چٹوا نہ لے۔‘‘";
abudawood.hukam = "صحیح بخاری (5456) صحیح مسلم (2031)";
abudawood.description = ``;