var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ بِثَلَاثِ أَصَابِعَ وَلَا يَمْسَحُ يَدَهُ حَتَّى يَلْعَقَهَا";
abudawood.urdu = "سیدنا کعب بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ کھانا تین انگلیوں سے کھایا کرتے تھے اور اپنا ہاتھ اس وقت تک نہیں پونچھتے تھے جب تک کہ اس کو چاٹ نہیں لیتے تھے۔";
abudawood.hukam = "صحیح مسلم (2032)";
abudawood.description = ``;