var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا أَبُو الْمُغِيرَةِ،ح وحَدَّثَنَا عَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ،أَخْبَرَنِي أَبِي ح،وحَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا عُمَرُ يَعْنِي ابْنَ عَبْدِ الْوَاحِدِ،عَنِ الْأَوْزَاعِيِّ الْمَعْنَى قَالَ: أُنْبِئْتُ أَنَّ سَعِيدَ بْنَ أَبِي سَعِيدٍ الْمَقْبُرِيَّ حَدَّثَ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَطِئَ أَحَدُكُمْ بِنَعْلِهِ الْأَذَى،فَإِنَّ التُّرَابَ لَهُ طَهُورٌ»";
abudawood.urdu = "جناب سعید بن ابی سعید مقبری نے اپنے والد سے بیان کیا،انہوں نے ابوہریرہ رضی اللہ عنہ سے روایت کیا کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی اپنے جوتے سے نجاست کو روندے تو مٹی اسے پاک کرنے والی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند منقطع وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [27,1];