var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي هَاشِمٍ الْوَاسِطِيِّ عَنْ إِسْمَعِيلَ بْنِ رَبَاحٍ عَنْ أَبِيهِ أَوْ غَيْرِهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ اللہ کے رسول ﷺ جب کھانے سے فارغ ہوتے تو یہ پڑھا کرتے تھے «الحمد للہ الذی أطعمنا وسقانا وجعلنا مسلمین» ’’سب تعریفیں اس اللہ ہی کے لیے ہیں جس نے ہمیں کھلایا،پلایا اور مسلمان بنایا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>إسماعیل بن رباح وغیرہ مجہولان (تقریب التہذیب: 444)<br>وللحدیث طرق ضعیفۃ`;
abudawood.anwaar = [137,1];