var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي عَقِيلٍ الْقُرَشِيِّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَ وَسَقَى وَسَوَّغَهُ وَجَعَلَ لَهُ مَخْرَجًا";
abudawood.urdu = "سیدنا ابوایوب انصاری رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ جب کچھ کھاتے پیتے تو یوں کہا کرتے تھے « الحمد للہ الذی أطعم وسقی،وسوغہ،وجعل لہ مخرجا» ’’حمد اس اللہ کی جس نے کھلایا،پلایا،اسے خوش گوار بنایا اور اس کے باہر نکلنے کا نظام بھی بنا دیا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4207)`;