var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرِةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ كَانَ فِي شَيْءٍ مِمَّا تَدَاوَيْتُمْ بِهِ خَيْرٌ فَالْحِجَامَةُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’تمہاری دواؤں میں جن سے تم علاج کرتے ہو اگر کوئی بہتر دوا ہے تو (ان میں سے ایک) سینگی لگوانا ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ ابن ماجہ (3476 وسندہ حسن)`;