var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ وَكَثِيرُ بْنُ عُبَيْدٍ قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ ثَوْبَانَ عَنْ أَبِيهِ عَنْ أَبِي كَبْشَةَ الْأَنْمَارِيِّ قَالَ كَثِيرٌ إِنَّهُ حَدَّثَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَحْتَجِمُ عَلَى هَامَتِهِ وَبَيْنَ كَتِفَيْهِ وَهُوَ يَقُولُ مَنْ أَهْرَاقَ مِنْ هَذِهِ الدِّمَاءِ فَلَا يَضُرُّهُ أَنْ لَا يَتَدَاوَى بِشَيْءٍ لِشَيْءٍ";
abudawood.urdu = "سیدنا ابوکبشہ انماری رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ اپنے سر کے بالائی حصے اور دونوں کندھوں کے درمیان سینگی لگوایا کرتے تھے اور فرماتے تھے ’’جس کسی نے ان مقامات سے خون کے کچھ حصے بہا دئیے تو وہ کسی بیماری کے لیے کوئی اور دوا نہ بھی لے تو اسے کوئی ضرر نہیں پہنچے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3484)<br>الولید بن مسلم لم یصرح بالسماع المسلسل`;
abudawood.anwaar = [137,1];