var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنِي مُحَمَّدُ بْنُ كَثِيرٍ يَعْنِي الصَّنْعَانِيَّ،عَنِ الْأَوْزَاعِيِّ،عَنِ ابْنِ عَجْلَانَ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ: «إِذَا وَطِئَ الْأَذَى بِخُفَّيْهِ،فَطَهُورُهُمَا التُّرَابُ»";
abudawood.urdu = "سیدنا سعید بن ابی سعید اپنے والد سے،انہوں نے ابوہریرہ رضی اللہ عنہ سے انہوں نے نبی کریم ﷺ سے مذکورہ بالا حدیث کے ہم معنی روایت کیا۔اس روایت میں ہے ’’جب کوئی اپنے موزوں سے نجاست کو روندے تو مٹی پاک کرنے والی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن کثیر الصنعاني: ضعیف لکثرۃ خطائہ،ضعفہ الجمھور واختلط أیضًا،انظر تحریر تقریب التہذیب (6251) ونھایۃ الإغتباط (105) ومع ذلک صححہ ابن خزیمۃ (292) وابن حبان (248)!`;
abudawood.anwaar = [27,2];