var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ ثَلَاثًا فِي الْأَخْدَعَيْنِ وَالْكَاهِلِ قَالَ مُعَمَّرٌ احْتَجَمْتُ فَذَهَبَ عَقْلِي حَتَّى كُنْتُ أُلَقَّنُ فَاتِحَةَ الْكِتَابِ فِي صَلَاتِي وَكَانَ احْتَجَمَ عَلَى هَامَتِهِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے تین مرتبہ سینگی لگوائی گردن کی دونوں جانب کی رگوں پر اور کندھوں کے درمیان (کمر کے اوپر شروع میں)۔معمر کہتے ہیں: میں نے سینگی لگوا لی تو میرا حافظہ جاتا رہا حتی کہ مجھے نماز میں فاتحہ پڑھنے میں بھی لقمہ دیا جاتا تھا۔انہوں نے اپنی کھوپڑی پر (غلط جگہ پر) سینگی لگوائی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2051) ابن ماجہ (3483)<br>قتادۃ عنعن`;
abudawood.anwaar = [138,1];