var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ أَخْبَرَنِي أَبُو بَكْرَةَ بَكَّارُ بْنُ عَبْدِ الْعَزِيزِ أَخْبَرَتْنِي عَمَّتِي كَبْشَةُ بِنْتُ أَبِي بَكْرَةَ وَقَالَ غَيْرُ مُوسَى كَيِّسَةُ بِنْتُ أَبِي بَكْرَةَ أَنَّ أَبَاهَا كَانَ يَنْهَى أَهْلَهُ عَنْ الْحِجَامَةِ يَوْمَ الثُّلَاثَاءِ وَيَزْعُمُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ يَوْمَ الثُّلَاثَاءِ يَوْمُ الدَّمِ وَفِيهِ سَاعَةٌ لَا يَرْقَأُ";
abudawood.urdu = "سیدہ کیسہ بنت ابی بکرہ رضی اللہ عنہا سے روایت ہے کہ ان کے والد سیدنا ابوبکرہ رضی اللہ عنہ منگل کے روز سینگی لگوانے سے منع کیا کرتے تھے۔ان کا خیال تھا کہ رسول اللہ ﷺ نے فرمایا ہے ’’منگل کا دن خون کا دن ہے ‘ اس میں ایک گھڑی ایسی آتی ہے کہ اس میں خون نہیں رکتا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>کیسۃ عمۃ بکار : لا یعرف حالھا (تق : 8675) والحدیث ضعفہ البیہقي (340/9)`;
abudawood.anwaar = [138,1];