var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى وِرْكِهِ مِنْ وَثْءٍ كَانَ بِهِ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے درد کی وجہ سے اپنی سرین پر سینگی لگوائی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (2851) ابن ماجہ (3082)<br>أبو الزبیر عنعن<br>والحدیث السابق (الأصل : 1836) یغني عنہ<br>وانظر الحدیث السابق (1837)`;
abudawood.anwaar = [138,1];