var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا عَقِيلُ بْنُ مَعْقِلٍ قَالَ سَمِعْتُ وَهْبَ بْنَ مُنَبِّهٍ يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النُّشْرَةِ فَقَالَ هُوَ مِنْ عَمَلِ الشَّيْطَانِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ سے نشرہ کے متعلق دریافت کیا گیا تو آپ ﷺ نے فرمایا ’’یہ شیطانی عمل ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4553)`;