var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عَائِذٍ،حَدَّثَنِي يَحْيَى يَعْنِي ابْنَ حَمْزَةَ،عَنِ الْأَوْزَاعِيِّ،عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ،أَخْبَرَنِي أَيْضًا سَعِيدُ بْنُ أَبِي سَعِيدٍ،عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ،عَنْ عَائِشَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ";
abudawood.urdu = "جناب سعید بن ابی سعید،قعقاع بن حکیم سے وہ سیدہ عائشہ رضی اللہ عنہا سے انہوں نے رسول اللہ ﷺ سے مذکور بالا حدیث کے معنی روایت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>القعقاع بن حکیم: لم یسمع من عائشۃ رضي اللّٰہ عنہا (تحفۃ التحصیل في ذکر رواۃ المراسیل ص 267)<br>وحدیث أبي داود (650) یغني عنہ`;
abudawood.anwaar = [28,1];