var abudawood = {};
abudawood.arabic = "قَالَ لَنَا حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ مُجَاهِدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّوَاءِ الْخَبِيثِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے خبیث دواؤں کے استعمال سے منع فرمایا ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4539)
أخرجہ ابن ماجہ (3459 وسندہ حسن)`;