var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثيِرٍ أَخْبَرَنَا سُفْيَانُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ خَالِدٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ أَنَّ طَبِيبًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضِفْدَعٍ يَجْعَلُهَا فِي دَوَاءٍ فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا";
abudawood.urdu = "سیدنا عبدالرحمٰن بن عثمان رضی اللہ عنہ سے مروی ہے کہ ایک معالج نے نبی کریم ﷺ سے مینڈک کے متعلق دریافت کیا کہ کیا اسے دوا میں ڈال لیا کرے تو نبی کریم ﷺ نے اس (طبیب) کو مینڈک کے قتل کرنے سے منع کر دیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4545)
أخرجہ النسائي (4360 وسندہ صحیح) سعید ھو ابن خالد بن عبد اللہ بن قارظ`;