var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَسَا سُمًّا فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے زہر پیا (تو آخرت میں) اس کا زہر اس کے ہاتھ میں ہو گا جسے وہ جہنم کی آگ میں ہمیشہ ابدالآباد تک پیتا رہے گا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البخاري (5778) ومسلم (109)`;