var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ ذَكَرَ طَارِقُ بْنُ سُوَيْدٍ أَوْ سُوَيْدُ بْنُ طَارِقٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ ثُمَّ سَأَلَهُ فَنَهَاهُ فَقَالَ لَهُ يَا نَبِيَّ اللَّهِ إِنَّهَا دَوَاءٌ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَلَكِنَّهَا دَاءٌ";
abudawood.urdu = "سیدنا طارق بن سوید یا سوید بن طارق رضی اللہ عنہ نے نبی کریم ﷺ سے شراب کے متعلق دریافت کیا تو آپ ﷺ نے منع فرمایا ‘ اس نے پھر سوال کیا تو آپ ﷺ نے منع فرمایا ‘ تو اس نے کہا: اے اللہ کے نبی! یہ دوا ہے۔نبی کریم ﷺ نے فرمایا ’’نہیں یہ بیماری ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (1984)";
abudawood.description = ``;