var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ ثَعْلَبَةَ بْنِ مُسْلِمٍ عَنْ أَبِي عِمْرَانَ الْأَنْصَارِيِّ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ أَنْزَلَ الدَّاءَ وَالدَّوَاءَ وَجَعَلَ لِكُلِّ دَاءٍ دَوَاءً فَتَدَاوَوْا وَلَا تَدَاوَوْا بِحَرَامٍ";
abudawood.urdu = "سیدنا ابو الدرداء رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’بلاشبہ اللہ تعالیٰ نے بیماری اتاری ہے تو دوا بھی نازل فرمائی ہے اور ہر بیماری کے لیے دوا ہے ‘ لہٰذا دوا استعمال کیا کرو لیکن حرام سے علاج نہ کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ثعلبۃ بن مسلم روی عنہ جماعۃ ولم یوثقہ غیر ابن حبان وقال الحافظ : مستور (تق : 846) وباقی السند حسن<br>والحدیث صححہ ابن الملقن (تحفۃ المحتاج : 2847) ولبعض الحدیث شاھد صحیح (تقدم،الأصل : 3855)`;
abudawood.anwaar = [138,1];