var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَصَبَّحَ سَبْعَ تَمَرَاتٍ عَجْوَةٍ لَمْ يَضُرَّهُ ذَلِكَ الْيَوْمَ سَمٌّ وَلَا سِحْرٌ";
abudawood.urdu = "جناب عامر بن سعد ابی وقاص اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جو شخص صبح کو عجوہ کھجور کے سات دانے کھا لے اسے اس دن کوئی زہر یا جادو نقصان نہیں دے گا۔‘‘";
abudawood.hukam = "صحیح بخاری (5769) صحیح مسلم (2047)";
abudawood.description = ``;