var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ بْنِ السَّكَنِ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَقْتُلُوا أَوْلَادَكُمْ سِرًّا فَإِنَّ الْغَيْلَ يُدْرِكُ الْفَارِسَ فَيُدَعْثِرُهُ عَنْ فَرَسِهِ";
abudawood.urdu = "سیدہ اسماء بنت یزید بن سکن رضی اللہ عنہا بیان کرتی ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرما رہے تھے ’’اپنی اولادوں کو مخفی طریقے سے قتل مت کرو۔بلاشبہ دودھ پینے کے ایام میں عورت سے مباشرت کا اثر یہ ہوتا ہے کہ بچہ (بڑا ہو کر جب گھڑ سواری کرتا ہے تو) گھوڑے سے گر جاتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (2012)<br>مہاجر بن أبي مسلم الأنصاري روی عنہ جماعۃ ووثقہ ابن حبان وحدہ فھو مستور وإلیہ أشار الحافظ ابن حجر فی التقریب (6925) وأخطأ صاحبا التحریر فقالا : ’’ صدوق حسن الحدیث ‘‘ !`;
abudawood.anwaar = [138,2];