var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ عِمْرَانَ بْنَ حُصَيْنٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’دم جھاڑ صرف نظر بد میں ہے یا زہریلے ڈنک میں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4557)`;