var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مُعَاوِيَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَ كُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ فَقَالَ اعْرِضُوا عَلَيَّ رُقَاكُمْ لَا بَأْسَ بِالرُّقَى مَا لَمْ تَكُنْ شِرْكًا";
abudawood.urdu = "سیدنا عوف بن مالک رضی اللہ عنہ کا بیان ہے کہ ہم جاہلیت میں دم جھاڑ کیا کرتے تھے تو ہم نے کہا: اے اللہ کے! آپ کا اس بارے میں کیا خیال ہے؟ آپ ﷺ نے فرمایا ’’اپنے دم مجھے بتاؤ،دم کرنے میں کوئی حرج نہیں بشرطیکہ شرک نہ ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (2200)";
abudawood.description = ``;