var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَهْدِيٍّ الْمِصِّيصِيُّ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ أَبِي بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ عَنْ الشِّفَاءِ بِنْتِ عَبْدِ اللَّهِ قَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عِنْدَ حَفْصَةَ فَقَالَ لِي أَلَا تُعَلِّمِينَ هَذِهِ رُقْيَةَ النَّمْلَةِ كَمَا عَلَّمْتِيهَا الْكِتَابَةَ";
abudawood.urdu = "سیدہ شفاء بنت عبداللہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ میرے ہاں تشریف لائے جبکہ میں ام المؤمنین سیدہ حفصہ رضی اللہ عنہا کے پاس تھی تو آپ ﷺ نے مجھ سے فرمایا ’’تم اس نملہ (بچوں کی پسلیوں پر نکلنے والی پھنسیوں) کا دم کیوں نہیں سکھا دیتی ہو جیسے کہ اسے لکھنا سکھایا ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4561)
أخرجہ أحمد (6/372) والنسائي فی الکبریٰ (7543) وللحدیث طرق عند النسائي فی الکبریٰ (7542) والحاکم (4/414)`;