var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا شَرِيكٌ ح و حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْعَبَّاسِ بْنِ ذَرِيحٍ عَنْ الشَّعْبِيِّ قَالَ الْعَبَّاسُ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ أَوْ دَمٍ يَرْقَأُ لَمْ يَذْكُرْ الْعَبَّاسُ الْعَيْنَ وَهَذَا لَفْظُ سُلَيْمَانَ بْنِ دَاوُدَ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’دم ان چیزوں ہی سے ہوتا ہے بد نظری ‘ زہریلے جانور کے ڈنک اور بہتے خون سے۔‘‘ عباس (عباس عنبری) نے بد نظری کا ذکر نہیں کیا۔اور اس حدیث کے الفاظ سلیمان بن داود کے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>شریک عنعن<br>وللحدیث شاہد ضعیف عند ابن أبي شیبۃ (393/7)`;
abudawood.anwaar = [139,1];