var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَبِي نَضْرَةَ قَالَ بَزَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَوْبِهِ وَحَكَّ بَعْضَهُ بِبَعْضٍ";
abudawood.urdu = "جناب ابونضرہ رحمہ اللہ (تابعی) بیان کرتے ہیں کہ رسول اللہ ﷺ نے اپنے کپڑے میں تھوکا اور پھر اسے اس میں مسل دیا۔(یہ روایت مرسل ہے)۔";
abudawood.hukam = "صحیح";
abudawood.description = `الحدیث مرسل ولہ طریق آخر متصل عند أحمد (3/43 وسندہ صحیح)`;