var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُسَدَّدٌ الْمَعْنَى قَالَا حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اقْتَبَسَ عِلْمًا مِنْ النُّجُومِ اقْتَبَسَ شُعْبَةً مِنْ السِّحْرِ زَادَ مَا زَادَ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’جس نے نجوم کا کوئی علم سیکھا اس نے جادو کا ایک حصہ سیکھا ‘ چنانچہ جو اس میں اپنا حصہ بڑھانا چاہتا ہے بڑھا لے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4598)
أخرجہ ابن ماجہ (3726 وسندہ حسن)`;