var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى حَدَّثَنَا عَوُفٌ حَدَّثَنَا حَيَّانُ قَالَ غَيْر مُسَدَّدٍ حَيَانُ بْنُ الْعَلَاءِ حَدَّثَنَا قَطَنُ بْنُ قَبِيصَةَ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعِيَافَةُ وَالطِّيَرَةُ وَالطَّرْقُ مِنْ الْجِبْتِ الطَّرْقُ الزَّجْرُ وَالْعِيَافَةُ الْخَطُّ";
abudawood.urdu = "جناب قطن بن قبیصہ اپنے والد سے روایت کرتے ہیں انہوں نے کہا کہ میں نے رسول اللہ ﷺ کو سنا،آپ ﷺ فرما رہے تھے ’’عیافہ طیرہ اور طرق جادو اور کہانت میں سے ہیں۔‘‘ طرق سے مراد پرندے اڑانا اور عیافہ سے مراد لکیریں کھینچنا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حیان بن العلاء : مجہول (التحریر : 1598) وثقہ ابن حبان وحدہ`;
abudawood.anwaar = [139,1];