var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَيْسَى بْنِ عَاصِمٍ عَنْ زِرِ بْنِ حُبَيْشٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الطِّيَرَةُ شِرْكٌ الطِّيَرَةُ شِرْكٌ ثَلَاثًا وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’بدشگونی شرک ہے،بد شگونی شرک ہے۔‘‘ تین بار رسول اللہ ﷺ فرمایا۔اور ہم میں سے ہر ایک کو کوئی نہ کوئی وہم ہو ہی جاتا ہے ‘ مگر اللہ عزوجل اسے توکل کی برکت سے زائل کر دیتا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4584)
أخرجہ الترمذي (1614 وسندہ صحیح) سفیان تابعہ شعبۃ عند أبي داود الطیالسي (356)`;