var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى وَلَا هَامَةَ وَلَا نَوْءَ وَلَا صَفَرَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کوئی بیماری متعدی نہیں ہوتی ‘ نہ کسی مردے سے کوئی الو نکلتا ہے،نہ کسی ستارے کی کوئی تاثیر ہے اور نہ صفر کا مہینہ منحوس ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2220 بعد ح 2221)";
abudawood.description = ``;