var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ بْنِ الْبَرْقِيِّ أَنَّ سَعِيدَ بْنَ الْحَكَمِ حَدَّثَهُمْ قَالَ: أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ،حَدَّثَنِي ابْنُ عَجْلَانَ،حَدَّثَنِي الْقَعْقَاعُ بْنُ حَكِيمٍ وَعُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ وَزَيدُ بْنُ أَسْلَمَ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ قَالَ: لَا غُولَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’کوئی جن بھوت نہیں (کہ جنگلوں میں مختلف شکلوں سے لوگوں کو راہ سے بھٹکائے)۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;