var abudawood = {};
abudawood.arabic = "قَالَ أَبو دَاود: قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِيْنٍ وَأَنَا شَاهِدٌ أَخْبَرَكُمْ أَشْهَبُ،قَالَ: سُئِلَ مَالِكٌ عَنْ قَوْلِهِ: لَا صَفَرَ؟ قَالَ: إِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يُحِلُّونَ صَفَرَ, يُحِلُّونَهُ عَامًا،وَيُحَرِّمُونَهُ عَامًا،فَقَالَ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: لَا صَفَرَ.";
abudawood.urdu = "امام ابوداؤد کہتے ہیں کہ میری موجودگی میں حارث بن مسکین کے سامنے حدیث پڑھی گئی ‘ اشہب نے تمہیں بتلایا کہ امام مالک رحمہ اللہ سے «لا صفر» کا مفہوم پوچھا گیا تو انہوں نے کہا: دور جاہلیت میں لوگ ماہ صفر کو ایک سال حلال قرار دے لیتے تھے اور ایک سال حرام تو نبی کریم ﷺ نے فرمایا ’’صفر میں تبدیلی صحیح نہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;