var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ الصَّالِحُ وَالْفَأْلُ الصَّالِحُ الْكَلِمَةُ الْحَسَنَةُ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’کوئی مرض متعدی نہیں ہوتا اور نہ کوئی بدفالی ہے ‘ البتہ نیک شگونی مجھے بھلی لگتی ہے۔نیک شگونی (کی ایک صورت یہ ہے کہ) آدمی کوئی اچھا کلمہ سن لے۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;