var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ عَنْ سُهَيلٍ عَنْ رَجُلٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ كَلِمَةً فَأَعْجَبَتْهُ فَقَالَ أَخَذْنَا فَأْلَكَ مِنْ فِيكَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے کوئی کلمہ سنا جو آپ ﷺ کو پسند آیا تو آپ ﷺ نے فرمایا ’’ہم نے تمہاری فال تمہارے منہ (کے الفاظ) سے لی ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `ولہ شاھد حسن عند أبي شیخ الأصبھاني في أخلاق النبي ﷺ (ص251)`;