var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ قَالَ يَقُولُ النَّاسُ الصَّفَرُ وَجَعٌ يَأْخُذُ فِي الْبَطْنِ قُلْتُ فَمَا الْهَامَةُ قَالَ يَقُولُ النَّاسُ الْهَامَةُ الَّتِي تَصْرُخُ هَامَةُ النَّاسِ وَلَيْسَتْ بِهَامَةِ الْإِنْسَانِ إِنَّمَا هِيَ دَابَّةٌ";
abudawood.urdu = "جناب عطاء رحمہ اللہ نے بیان کیا کہ لوگ کہتے ہیں ’’صفر سے مراد پیٹ کا درد ہے۔‘‘ جریج نے پوچھ کہ ’’ہامہ‘‘ کیا ہے؟ تو کہا کہ لوگ سمجھتے ہیں یہ پرندہ انسانی روح ہوتا ہے جو چیختا چلاتا رہتا ہے۔حالانکہ،انسانی روح نہیں ہوتا بلکہ کوئی زمینی جانور ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;