var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ،حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ الْمَدَنِيُّ،عَنْ أَبِي سُهَيْلٍ نَافِعِ بْنِ مَالِكِ بْنِ أَبِي عَامِرٍ بِإِسْنَادِهِ بِهَذَا الْحَدِيثِ قَالَ: «أَفْلَحَ وَأَبِيهِ إِنْ صَدَقَ دَخَلَ الْجَنَّةَ،وَأَبِيهِ إِنْ صَدَقَ»";
abudawood.urdu = "جناب ابو سہل نافع بن مالک بن ابی عامر کی سند سے یہی حدیث مروی ہے،اس میں ہے کہ آپ نے فرمایا ’’کامیاب ہوا،قسم اس کے باپ کی،اگر سچا ہوا۔اور جنت میں داخل ہوا،قسم اس کے باپ کی اگر سچا ہوا۔،،";
abudawood.hukam = "صحیح بخاری (1891 مختصرًا) صحیح مسلم (11)";
abudawood.description = ``;