var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنِي يَحْيَى أَنَّ الْحَضْرَمِيَّ بْنَ لَاحِقٍ حَدَّثَهُ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ سَعْدِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لَا هَامَةَ وَلَا عَدْوَى وَلَا طِيَرَةَ وَإِنْ تَكُنْ الطِّيَرَةُ فِي شَيْءٍ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالدَّارِ";
abudawood.urdu = "سیدنا سعد بن مالک رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ فرمایا کرتے تھے‘‘ کسی مردے سے کوئی الو نہیں نکلتا ‘ نہ کوئی مرض متعدی ہوتا ہے اور نہ بدشگونی ہے ‘ اگر ہو بھی تو گھوڑے ‘ عورت اور گھر میں ہو سکتی ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4586)`;