var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ وَعَبَّاسُ الْعَنْبَرِيُّ،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ بَحِيرٍ قَالَ،أَخْبَرَنِي مَنْ سَمِعَ فَرْوَةَ بْنَ مُسَيْكٍ،قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ!! أَرْضٌ عِنْدَنَا-يُقَالُ لَهَا: أَرْضُ أَبْيَنَ-هِيَ أَرْضُ رِيفِنَا،وَمِيرَتِنَا, وَإِنَّهَا وَبِئَةٌ-أَوْ قَالَ: وَبَاؤُهَا شَدِيدٌ-،فَقَالَ النَّبِيُّ: دَعْهَا عَنْكَ, فَإِنَّ مِنَ الْقَرَفِ التَّلَفَ.";
abudawood.urdu = "جناب فروہ بن مسیک رضی اللہ عنہ نے بیان کیا کہ میں نے کہا: اے اللہ کے رسول! ہمارے ہاں ایک زمین ہے جسے «أبین» کہا جاتا ہے۔اس میں ہمارے کھیت ہیں اور یہ ہمارے غلہ اگانے کی جگہ ہے ‘ مگر وبا والی ہے ‘ یا کہا کہ بڑی سخت وبا والی جگہ ہے۔تو نبی کریم ﷺ نے فرمایا ’’اسے چھوڑ دو۔وبا والی جگہ میں رہنے سے آدمی ہلاک ہو جاتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یحیی بن عبد اللّٰہ بن بحیر : مستور (تق : 7579) وشیخہ مجہول لم یسم`;
abudawood.anwaar = [140,1];