var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ،حَدَّثَنَا مُفَضَّلُ بْنُ فَضَالَةَ،عَنْ حَبِيبِ بْنِ الشَّهِيدِ،عَنْ مُحَمَّدِ ابْنِ الْمُنْكَدِرِ،عَنْ جَابِرٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ مَجْذُومٍ فَوَضَعَهَا مَعَهُ فِي الْقَصْعَةِ،وَقَالَ: كُلْ, ثِقَةً بِاللَّهِ،وَتَوَكُّلًا عَلَيْهِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ایک جذامی کا ہاتھ پکڑا اور اپنے ساتھ کھانے کے پیالے میں ڈال دیا اور فرمایا ’’اللہ پر اعتماد اور توکل کرتے ہوئے کھاؤ۔‘‘ (ہم بھی تمہارے ساتھ کھاتے ہیں)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1817) ابن ماجہ (3542)<br>مفضل بن فضالۃ : ضعیف (تق : 6857)`;
abudawood.anwaar = [140,1];