var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا أَبُو بَدْرٍ،حَدَّثَنِي أَبُو عُتْبَةَ إِسْمَاعِيلُ بْنُ عَيَّاشٍ،حَدَّثَنِي سُلَيْمَانُ بْنُ سُلَيْمٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتَبَتِهِ دِرْهَمٌ";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے،وہ اپنے دادا سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’مکاتب پر جب تک اس کی کتابت (طے شدہ رقم) کا ایک درہم بھی باقی ہو وہ غلام ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3399)`;