var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ نَبْهَانَ مُكَاتَبِ أُمِّ سَلَمَةَ قَالَ سَمِعْتُ أُمَّ سَلَمَةَ تَقُولُ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَ لِإِحْدَاكُنَّ مُكَاتَبٌ فَكَانَ عِنْدَهُ مَا يُؤَدِّي فَلْتَحْتَجِبْ مِنْهُ";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ ﷺ نے ہم سے فرمایا ’’تم میں جب کسی کا غلام مکاتب ہو جائے اور اس کے پاس اس قدر مال ہو جو وہ ادا کر سکتا ہو تو تمہیں چاہیئے کہ اس سے پردہ کرو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3400)
أخرجہ الترمذي (1261 وسندہ حسن) وابن ماجہ (2520 وسندہ حسن) نبھان مولٰی أم سلمۃ حسن الحدیث علی الراجح`;