var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ سَعِيدِ بْنِ جُمْهَانَ عَنْ سَفِينَةَ قَالَ كُنْتُ مَمْلُوكًا لِأُمِّ سَلَمَةَ فَقَالَتْ أُعْتِقُكَ وَأَشْتَرِطُ عَلَيْكَ أَنْ تَخْدُمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتَ فَقُلْتُ وَإِنْ لَمْ تَشْتَرِطِي عَلَيَّ مَا فَارَقْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتُ فَأَعْتَقَتْنِي وَاشْتَرَطَتْ عَلَيَّ";
abudawood.urdu = "سیدنا سفینہ رضی اللہ عنہ بیان کرتے ہیں کہ میں سیدہ ام سلمہ رضی اللہ عنہا کا غلام تھا۔چنانچہ انہوں نے کہا: میں تمہیں اس شرط پر آزاد کرتی ہیں کہ تم زندگی بھر رسول اللہ ﷺ کی خدمت کرتے رہو گے۔میں نے کہا: آپ اگر مجھ سے یہ شرط نہ بھی کریں تو میں جیتے جی رسول اللہ ﷺ سے جدا نہ ہوں گا۔چنانچہ انہوں نے مجھے آزاد کر دیا اور مجھ سے یہ شرط کر لی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3398)
أخرجہ ابن ماجہ (2526 وسندہ حسن)`;