var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنِي هَمَّامٌ،عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَجُلًا أَعْتَقَ شِقْصًا لَهُ مِنْ غُلَامٍ،فَأَجَازَ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ عِتْقَهُ،وَغَرَّمَهُ بَقِيَّةَ ثَمَنِهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہایک شخص نے ایک غلام کا اپنا حصہ آزاد کر دیا ‘ (جبکہ غلام دو افراد میں مشترک تھا) تو نبی کریم ﷺ نے اس کی آزادی کو درست قرار دیتے ہوئے اس آزاد کرنے والے پر بقیہ کی قیمت کا تاوان بھی ڈال دیا (تاکہ وہ کامل طور پر آزاد ہو جائے)۔";
abudawood.hukam = "صحیح بخاری (2527) صحیح مسلم (1503)";
abudawood.description = `وانظر الحدیث الآتي (3938)`;