var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح،وحَدَّثَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سُوَيْدٍ،حَدَّثَنَا رَوْحٌ،قَالَا: حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ بِإِسْنَادِهِ عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ أَعْتَقَ مَمْلُوكًا بَيْنَهُ وَبَيْنَ آخَرَ, فَعَلَيْهِ خَلَاصُهُ. وَهَذَا لَفْظُ ابْنِ سُوَيْدٍ";
abudawood.urdu = "جناب قتادہ اپنی سند سے نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس نے ایسے غلام کو آزاد کر دیا ہو جو کہ اس کے اور دوسرے کے مابین مشترک ہو ‘ تو اس (آزاد کرنے والے) پر لازم ہے کہ اس کو خلاصی دلائے۔‘‘ اور یہ ابن سوید کے لفظ ہیں۔";
abudawood.hukam = "صحیح مسلم (1502)";
abudawood.description = `وانظر الحدیث السابق (3934)`;