var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا أَبَانُ يَعْنِي الْعَطَّارَ،حَدَّثَنَا قَتَادَةُ عَنِ النَّضْرِ بْنِ أَنَسٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: مَنْ أَعْتَقَ شَقِيصًا فِي مَمْلُوكِهِ, فَعَلَيْهِ أَنْ يُعْتِقَهُ كُلَّهُ, إِنْ كَانَ لَهُ مَالٌ،وَإِلَّا،اسْتُسْعِيَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جس نے اپنے مملوک کا کوئی حصہ آزاد کر دیا ہو تو اس پر لازم ہے کہ اسے پورے کو آزاد کرے ‘ اگر اس کے پاس مال ہو۔ورنہ غلام سے محنت کرائی جائے جو اس پر زیادہ سخت اور شاق نہ ہو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `وانظر الحدیث السابق (3934)`;