var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ, أُقِيمَ عَلَيْهِ قِيمَةُ الْعَدْلِ،فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ،وَأُعْتِقَ عَلَيْهِ الْعَبْدُ،وَإِلَّا, فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کسی (مشترک) مملوک میں سے اپنا حصہ آزاد کر دیا ہو تو اس (آزاد کرنے والے) پر غلام کی عادلانہ قیمت لگائی جائے اور وہ اپنے شریکوں کے حصے انہیں ادا کر دے اور اس کی طرف سے غلام کو آزاد کیا جائے۔ورنہ اس سے جو آزاد ہو گیا ‘ سو ہو گیا۔‘‘";
abudawood.hukam = "صحیح بخاری (2522) صحیح مسلم (1501)";
abudawood.description = ``;