var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلٌ،حَدَّثَنَا إِسْمَاعِيلُ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ... بِمَعْنَاهُ. قَالَ وَكَانَ نَافِعٌ رُبَّمَا قَالَ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ وَرُبَّمَا لَمْ يَقُلْهُ";
abudawood.urdu = "جناب نافع نے بواسطہ سیدنا ابن عمر رضی اللہ عنہما نبی کریم ﷺ سے مذکورہ بالا حدیث کے ہم معنی روایت کیا۔ایوب کہتے ہیں کہ جناب نافع کبھی تو «فقد عتق منہ ما عتق» کے لفظ ذکر کرتے اور کبھی نہ کرتے۔";
abudawood.hukam = "صحیح مسلم (1501)";
abudawood.description = ``;