var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ،حَدَّثَنَا حَمَّادٌ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ... بِهَذَا الْحَدِيثِ. قَالَ أَيُّوبُ فَلَا أَدْرِي هُوَ فِي الْحَدِيثِ عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ أَوْ شَيْءٌ قَالَهُ نَافِعٌ وَإِلَّا عَتَقَ مِنْهُ مَا عَتَقَ";
abudawood.urdu = "ایوب نے نافع سے ‘ انہوں نے ابن عمر رضی اللہ عنہما سے انہوں نے نبی کریم ﷺ سے یہ حدیث روایت کی۔ایوب نے کہا: مجھے نہیں معلوم کہ حدیث میں یہ جملہ «وإلا عتق منہ ما عتق» نبی کریم ﷺ کا فرمایا ہوا ہے یا نافع کی طرف سے ہے۔";
abudawood.hukam = "صحیح بخاری (2524) صحیح مسلم (1501)";
abudawood.description = ``;