var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،أَخْبَرَنَا عِيسَى بْنُ يُونُسَ،حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: مَنْ أَعْتَقَ شِرْكًا مِنْ مَمْلُوكٍ لَهُ, فَعَلَيْهِ عِتْقُهُ كُلِّهِ, إِنْ كَانَ لَهُ مَا يَبْلُغُ ثَمَنَهُ،وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ عَتَقَ نَصِيبَهُ.";
abudawood.urdu = "نافع سیدنا ابن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جس نے اپنے مملوک کا حصہ آزاد کر دیا ہو تو اس پر لازم ہے کہ اسے پورے کو آزاد کرے اگر اس کے پاس اس کی قیمت کے بقدر مال ہو ‘ اگر اس کے پاس مال نہ ہو تو اس کا وہی حصہ آزاد ہوا (جو کیا گیا)۔‘‘";
abudawood.hukam = "صحیح بخاری (2523) صحیح مسلم (1501 بعد ح1667)";
abudawood.description = ``;