var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ بِمَعْنَى إِبْرَاهِيمَ بْنِ مُوسَى";
abudawood.urdu = "جناب نافع نے سیدنا ابن عمر رضی اللہ عنہما سے انہوں نے نبی کریم ﷺ سے ابراہیم بن موسیٰ کی (مذکورہ بالا) روایت کے ہم معنی روایت کیا۔";
abudawood.hukam = "صحیح بخاری (2525) صحیح مسلم (1501)";
abudawood.description = `مشکوۃ المصابیح (3397)`;