var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ،حَدَّثَنَا جُوَيْرِيَةُ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ... بِمَعْنَى مَالِكٍ،وَلَمْ يَذْكُرْ: وَإِلَّا, فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ, انْتَهَى حَدِيثُهُ إِلَى: وَأُعْتِقَ عَلَيْهِ الْعَبْدُ عَلَى مَعْنَاهُ.";
abudawood.urdu = "جناب نافع نے سیدنا ابن عمر رضی اللہ عنہما سے انہوں نے نبی کریم ﷺ سے مذکورہ روایت مالک (3940) کے ہم معنی بیان کیا۔مگر اس میں «وإلا فقد عتق منہ ما عتق» کا ذکر نہیں۔اس کی حدیث «وأعتق علیہ العبد» پر مکمل ہوئی ہے جو اسی کے ہم معنی ہے۔";
abudawood.hukam = "صحیح بخاری (2503)";
abudawood.description = ``;