var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ, عَتَقَ مِنْهُ مَا بَقِيَ فِي مَالِهِ, إِذَا كَانَ لَهُ مَا يَبْلُغُ ثَمَنَ الْعَبْدِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جس نے کسی مشترک غلام میں سے اپنا حصہ آزاد کر دیا تو اس کا باقی حصہ بھی اس کے مال سے آزاد کیا جائے گا۔جبکہ اس کے پاس غلام کی قیمت کے بقدر مال موجود ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (1501 بعد ح 1667)";
abudawood.description = ``;