var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ خَالِدٍ،عَنْ أَبِي بِشْرٍ الْعَنْبَرِيِّ عَنِ ابْنِ التَّلِبِّ،عَنْ أَبِيهِ أَنَّ رَجُلًا أَعْتَقَ نَصِيبًا لَهُ مِنْ مَمْلُوكٍ،فَلَمْ يُضَمِّنْهُ النَّبِيُّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ.\nقَالَ أَحْمَدُ: إِنَّمَا هُوَ بِالتَّاءِ يَعْنِي التَّلِبَّ،وَكَانَ شُعْبَةُ أَلْثَغُ لَمْ يُبَيِّنِ التَّاءَ مِنَ الثَّاءِ";
abudawood.urdu = "ابن التلب (ابن التلب ملقام) اپنے والد سے روایت کرتے ہیں کہ ایک شخص نے (مشترک) مملوک میں سے اپنا حصہ آزاد کر دیا تو نبی کریم ﷺ نے اسے باقی کا ضامن اور ذمہ دار نہیں بنایا تھا۔امام احمد رحمہ اللہ فرماتے ہیں کہ راوی (ابن التلب) ’’تا‘‘ کے ساتھ ہے۔اور شعبہ رحمہ اللہ قدرے توتلے تھے ’’تا‘‘ (وہ نقطے والے) کو ’’ثا‘‘ (تین نقطے والے) سے نمایاں نہ کر سکتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ملقام مستور`;
abudawood.anwaar = [140,1];