var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ،حَدَّثَنَا عَبْدُ الْوَهَّابِ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِي اللَّه عَنْهم،قَالَ: مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ, فَهُوَ حُرٌّ";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ نے فرمایا جو اپنے کسی قریبی محرم رشتہ دار کا مالک بن جائے تو وہ آزاد ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ ولد بعد شہادۃ عمر رضي اللّٰہ عنہ بنیف وثلاثین سنۃ (وھو مدلس تقدم : 29)`;
abudawood.anwaar = [140,1];