var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ،حَدَّثَنَا عَبْدُ الْوَهَّابِ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ, قَالَ: مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ";
abudawood.urdu = "جناب حسن (حسن بصری) نے کہا کہ جو کوئی اپنے کسی قریبی محرم رشتہ دار کا مالک بن جائے تو وہ آزاد ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سعید بن أبي عروبۃ وقتادۃ عنعنا<br>و للحدیث شاھد ضعیف في مصنف ابن أبي شیبۃ (33/6 ح20079)`;
abudawood.anwaar = [141,1];