var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بِعْنَا أُمَّهَاتِ الْأَوْلَادِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ فَلَمَّا كَانَ عُمَرُ نَهَانَا فَانْتَهَيْنَا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ہم نے رسول اللہ ﷺ اور سیدنا ابوبکر رضی اللہ عنہ کے دور میں ام ولد لونڈیوں کو فروخت کیا تھا ‘ پھر جب سیدنا عمر رضی اللہ عنہ کا دور آیا تو انہوں نے ہمیں منع کر دیا ‘ تو ہم رک گئے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3395)
قیس ھو ابن سعد`;