var abudawood = {};
abudawood.arabic = "حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ،أَخْبَرَنَا الْأَوْزَاعِيُّ،حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ،حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ... بِهَذَا, زَادَ وَقَالَ-يَعْنِي: النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ-: أَنْتَ أَحَقُّ بِثَمَنِهِ،وَاللَّهُ أَغْنَى عَنْهُ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما نے یہ حدیث بیان کی اور مزید کہا،یعنی نبی کریم ﷺ نے فرمایا ’’تو اس کی قیمت کا زیادہ حقدار (اور محتاج) ہے ‘ جبکہ اللہ عزوجل اس کو آزاد کیے جانے سے بے پروا ہے۔‘‘ (اسے کوئی احتیاج نہیں)۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;