var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ،حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ هُوَ الطَّحَّانُ،عَنْ خَالِدٍ،عَنْ أَبِي قِلَابَةَ،عَنْ أَبِي زَيْدٍ أَنَّ رَجُلًا مِنَ الْأَنْصَارِ... بِمَعْنَاهُ،وَقَالَ-يَعْنِي النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ-: لَوْ شَهِدْتُهُ قَبْلَ أَنْ يُدْفَنَ, لَمْ يُدْفَنْ فِي مَقَابِرِ الْمُسْلِمِينَ.";
abudawood.urdu = "جناب ابوزید سے روایت ہے کہ ایک انصاری نے (اپنی موت کے وقت اپنے غلام آزاد کر دیے) مذکووہ بالا حدیث کے ہم معنی روایت کیا اور کہا کہ نبی کریم ﷺ نے فرمایا ’’اگر میں اس کے دفن کیے جانے سے پہلے حاضر ہوتا تو وہ مسلمانوں کے قبرستان میں دفن نہ کیا جاتا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3390)
أبو زید ھو عمرو بن أخطب رضي اللہ عنہ`;