var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ يَحْيَى بْنِ عَتِيقٍ وَأَيُّوبَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،أَنَّ رَجُلًا أَعْتَقَ سِتَّةَ أَعْبُدٍ عِنْدَ مَوْتِهِ،وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ،فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ،فَأَقْرَعَ بَيْنَهُمْ،فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما سے مروی ہے کہ ایک شخص نے اپنی موت کے وقت چھ غلام آزاد کر دیے جب کہ اس کا ان کے سوا کوئی اور مال نہ تھا ‘ تو نبی کریم ﷺ کو جب یہ خبر پہنچی تو آپ ﷺ نے ان غلاموں میں قرعہ اندازی کر کے دو کو آزاد کر دیا اور چار کو غلام رکھا۔";
abudawood.hukam = "إسنادہ صحیح، صحیح مسلم (1668)";
abudawood.description = ``;