var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ وَاللَّيْثُ بْنُ سَعْدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلَّا أَنْ يَشْتَرِطَهُ السَّيِّدُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے غلام آزاد کیا ہو اور اس کے پاس مال بھی ہو تو غلام کا مال غلام ہی کا رہے گا الا یہ کہ مالک نے اس کی شرط کر لی ہو۔‘‘ (کہ مال اسے نہیں دیا جائے گا)۔";
abudawood.hukam = "إسنادہ صحیح، صحیح بخاری (2379)";
abudawood.description = `مشکوۃ المصابیح (3396، 3405)
وأخرجہ ابن ماجہ (2529 وسندہ صحیح)`;