var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،أَخْبَرَنَا جَرِيرٌ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّم:َ وَلَدُ الزِّنَا شَرُّ الثَّلَاثَةِ.\nوقَالَ أَبُو هُرَيْرَةَ: لَأَنْ أُمَتِّعَ بِسَوْطٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ: أَحَبُّ إِلَيَّ مِنْ أَنْ أَعْتِقَ وَلَدَ زِنْيَةٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’زنا زادہ تینوں میں سے سب سے برا ہے۔‘‘ اور سیدنا ابوہریرہ رضی اللہ عنہ نے کہا: میں ایک کوڑا اللہ کی راہ میں دے دوں وہ اس سے بہتر ہے کہ کسی زنا زادے کو آزاد کروں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;