var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاقَ،عَنْ أَبِي حَبِيبَةَ الطَّائِيِّ،عَنْ أَبِي الدَّرْدَاءِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ: مَثَلُ الَّذِي يَعْتِقُ عِنْدَ الْمَوْتِ, كَمَثَلِ الَّذِي يُهْدِي إِذَا شَبِعَ.";
abudawood.urdu = "سیدنا ابوالدرداء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص موت کے وقت آزاد کرتا ہے اس کی مثال اس شخص کی سی ہے جو پیٹ بھر جانے کے بعد ہدیہ دے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `ورواہ الشعبۃ عن أبي إسحاق انظر سنن النسائي (3644 وسندہ حسن، وأبو إسحاق السبیعي صرح بالسماع عندہ أیضًا)`;