var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ ح و حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ سے (سورۃ البقرہ کی آیت 125 یوں) قرآت فرمائی «واتخذوا من مقام إبراہیم مصلی» (’’خا‘‘ کے نیچے زیر کے ساتھ بصیغہ امر پڑھا) ’’اور مقام ابراہیم کو جائے نماز بنا لو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (2964 وسندہ صحیح)`;