var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَجُلًا قَامَ مِنْ اللَّيْلِ فَقَرَأَ فَرَفَعَ صَوْتَهُ بِالْقُرْآنِ فَلَمَّا أَصْبَحَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْحَمُ اللَّهُ فُلَانًا كَائِنْ مِنْ آيَةٍ أَذْكَرَنِيهَا اللَّيْلَةَ كُنْتُ قَدْ أُسْقِطْتُهَا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ صدیقہ رضی اللہ عنہا کا بیان ہے کہ ایک شخص نے رات کو قیام کیا اور قرآت قرآن میں اپنی آواز بلند کی۔صبح ہوئی تو رسول اللہ ﷺ نے فرمایا ’’اللہ فلاں پر رحم فرمائے! اس نے آج رات مجھے کتنی ہی آیات یاد دلا دیں جن سے مجھے ذہول ہو رہا تھا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (1331)`;