var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبَخَلِ وَالْهَرَمِ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے (ایک دعا میں) فرمایا «اللہم إنی أعوذ بک من البخل والہرم» ’’اے اللہ! میں بخیلی اور عاجز کر دینے والے بڑھاپے سے تیری پناہ چاہتا ہوں۔‘‘";
abudawood.hukam = "صحیح بخاری (2823) صحیح مسلم (2706)";
abudawood.description = `وانظر الحدیث السابق (1540) مطولًا`;