var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ عَنْ أَبِي عَلِيِّ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَرَأَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْعَيْنُ بِالْعَيْنِ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے یوں قرآت کی «والعین بالعین» (پیش کے ساتھ) یعنی سورۃ المائدہ کی آیت 45 میں «وکتبنا علیہم فیہا أن النفس بالنفس والعین بالعین» پڑھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2929)<br>الزہري عنعن`;
abudawood.anwaar = [141,1];