var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ عَنْ أَبِي عَلِيِّ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنُ بِالْعَيْنِ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے قرآت فرمائی «وکتبنا علیہم فیہا أن النفس بالنفس والعین بالعین» (یعنی ان کو مخفف اور العین کو مرفوع پڑھا)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (3976)`;
abudawood.anwaar = [141,1];