var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا فُضَيْلُ بْنُ مَرْزُوقٍ عَنْ عَطِيَّةَ بْنِ سَعْدٍ الْعَوْفِيِّ قَالَ قَرَأْتُ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ فَقَالَ مِنْ ضُعْفٍ قَرَأْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا قَرَأْتَهَا عَلَيَّ فَأَخَذَ عَلَيَّ كَمَا أَخَذْتُ عَلَيْكَ";
abudawood.urdu = "عطیہ بن سعد عوفی کہتے ہیں کہ میں نے سیدنا عبداللہ بن عمر رضی اللہ عنہما پر قرآت کی اور یوں پڑھا «اللہ الذی خلقکم من ضعف» (ضاد پر فتحہ کے ساتھ) تو انہوں نے فرمایا «من ضعف» پڑھو۔(یعنی ضاد پر ضمہ ہے) میں نے رسول اللہ ﷺ پر یہ آیت اسی طرح پڑھی تھی جیسے کہ تو نے مجھ پر پڑھی ہے تو آپ ﷺ نے میری گرفت فرمائی جیسے کہ میں نے تمہاری گرفت کی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2936)<br>عطیۃ العوفی ضعیف<br>وللحدیث شواھد والقرآن المجید یؤیدہ`;
abudawood.anwaar = [141,1];