var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَسْلَمَ الْمِنْقَرِيِّ عَنْ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى قَالَ قَالَ أُبَيُّ بْنُ كَعْبٍ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْتَفْرَحُوا قَالَ أَبُو دَاوُد بِالتَّاءِ";
abudawood.urdu = "عبدالرحمٰن بن ابزی کی روایت ہے کہ سیدنا ابی بن کعب رضی اللہ عنہ نے کہا «بفضل اللہ وبرحمتہ فبذلک فلتفرحوا» یعنی ضیغہ خطاب کے ساتھ۔جبکہ ہماری معروف قرآت ضیغہ غائب کے ساتھ «فلتفرحوا» ہے۔’’کہہ دیجئیے کہ اللہ کا فضل اور اس کی مہربانی ہے۔چنانچہ اسی پر تمہیں / انہیں خوش ہونا چاہیئے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث الآتي (3981)`;