var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ الْأَجْلَحِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْتَفْرَحُوا هُوَ خَيْرٌ مِمَّا تَجْمَعُونَ";
abudawood.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے قرآت فرمائی «بفضل اللہ وبرحمتہ فبذلک فلیفرحوا ہو خیر مما تجمعون» یعنی «فلیفرحوا» اور «تجمعون» دونوں ضیغہ خطاب کے ساتھ پڑھے۔جبکہ حفص کی قرآت میں غیب کے صیغے میں «فلیفرحوا» اور «تجمعون» ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;