var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ أَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ";
abudawood.urdu = "سیدہ اسماء بنت یزید رضی اللہ عنہا بیان کرتی ہیں کہ انہوں نے نبی کریم ﷺ کو قرآت کرتے ہوئے سنا «إنہ عمل غیر صالح» یعنی «عمل» فعل ماضی اور «غیر» مفعول بہ یعنی منصوب۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (2932 وسندہ حسن)`;