var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عَبْدِ اللَّهِ الْعَنْبَرِيُّ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو الْجَارِيَةِ الْعَبْدِيُّ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ حُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ أُبَيِّ بْنِ كَعْبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَرَأَهَا قَدْ بَلَغْتَ مِنْ لَدُنِّي وَثَقَّلَهَا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے سیدنا ابی بن کعب رضی اللہ عنہ سے،انہوں نے نبی کریم ﷺ سے روایت کیا کہ آپ نے «قد بلغت من لدنی» کی قرآت میں «لدنی» کو ثقیل کر کے پڑھا (شد کے ساتھ)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2933)<br>قال الترمذي:’’ غریب لانعرفہ إلا من ھذا الوجہ،وأبو الجاریۃ العبدي البصري:مجہول،لا یعرف لہ اسم‘‘`;
abudawood.anwaar = [142,1];