var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَسْعُودٍ الْمِصِّيصِيُّ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ عَنْ مِصْدَعٍ أَبِي يَحْيَى قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَقْرَأَنِي أُبَيُّ بْنُ كَعْبٍ كَمَا أَقْرَأَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عَيْنٍ حَمِئَةٍ مُخَفَّفَةً";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے تھے کہ سیدنا ابی بن کعب رضی اللہ عنہ نے مجھے اسی طرح پڑھایا جیسے کہ رسول اللہ ﷺ نے انہیں پڑھایا تھا یعنی «فی عین حمئۃ» (’’حا‘‘ پر فتحہ،’’میم‘‘ پر کسرہ اور اس کے بعد ہمزہ)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2934)<br>محمد بن دینار اختلط في آخر عمرہ<br>والقرآن یؤید ھذا الحدیث`;
abudawood.anwaar = [142,1];