var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ وَإِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَبُو مَعْمَرٍ الْهُذَلِيُّ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عِكْرِمَةَ قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِسْمَعِيلُ عَنْ أَبِي هُرَيْرَةَ رِوَايَةً فَذَكَرَ حَدِيثَ الْوَحْيِ قَالَ فَذَلِكَ قَوْلُهُ تَعَالَى حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے نبی کریم ﷺ سے وحی والی حدیث بیان کی اور کہا کہ اسی سلسلے میں اللہ کا یہ فرمان ہے «حتی إذا فزع عن قلوبہم» ’’حتیٰ کہ جب ان فرشتوں کے دلوں سے گھبراہٹ دور کی جاتی ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (4800، 4701)";
abudawood.description = ``;