var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَارُونُ بْنُ مُوسَى النَّحْوِيُّ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا فَرُوحٌ وَرَيْحَانٌ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے رسول اللہ ﷺ کو پڑھتے ہوئے سنا «فروح وریحان» (سورۃ الواقعۃ 89) (یعنی لفظ روح میں ’’را‘‘ کے ضمہ کے ساتھ۔)";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (2938 وسندہ حسن)`;