var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبُو أَحْمَدَ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَ أَقْرَأَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَنَا الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مجھے پڑھایا ہے «إنی أنا الرزاق ذو القوۃ المتین» ’’بلاشبہ میں ہی رزق دینے والا،قوت والا اور زور آور ہوں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (5307)
وللحدیث طریق آخر عند ابن حبان (1762 وسندہ صحیح)`;