var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَؤُهَا فَهَلْ مِنْ مُدَّكِرٍ يَعْنِي مُثَقَّلًا قَالَ أَبُو دَاوُد مَضْمُومَةُ الْمِيمِ مَفْتُوحَةُ الدَّالِ مَكْسُورَةُ الْكَافِ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ پڑھا کرتے تھے «فہل من مدکر» (یعنی شد کے ساتھ۔) ’’بھلا کوئی ہے جو نصیحت پکڑے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں: یہ لفظ ’’میم‘‘ کے ضمہ،’’دال‘‘ کے فتحہ اور ’’کاف‘‘ کے کسرہ کے ساتھ ہے۔";
abudawood.hukam = "صحیح بخاری (4869) صحیح مسلم (823)";
abudawood.description = ``;