var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَبْدِ الرَّحْمَنِ الذِّمَارِيُّ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ أَ يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ کہتے ہیں کہ میں نے نبی کریم ﷺ کو دیکھا آپ ﷺ پڑھ رہے تھے «یحسب أن مالہ أخلدہ» (سورۃ الھمزۃ 3) (یعنی شروع میں ہمزہ استفہام کے ساتھ)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `صححہ ابن حبان (1773) والحاکم (2/256) وتعقبہ الذھبي والصواب أنہ حسن`;