var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَمَّنْ أَقْرَأَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَوْمَئِذٍ لَا يُعَذَّبُ عَذَابَهُ أَحَدٌ وَلَا يُوثَقُ وَثَاقَهُ أَحَدٌ قَالَ أَبُو دَاوُد بَعْضُهُمْ أَدْخَلَ بَيْنَ خَالِدٍ وأَبِي قِلَابَةَ رَجُلًا";
abudawood.urdu = "جناب ابوقلابہ اس شخص سے روایت کرتے ہیں جس کو رسول اللہ ﷺ نے پڑھایا تھا «فیومئذ لا یعذب عذابہ أحد،ولا یوثق وثاقہ أحد» (سورۃ الفجر 25،26) یعنی «یعذب» اور «یوثق» مجہول صیغوں کے ساتھ۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ بعض راویوں نے خالد اور ابوقلابہ کے درمیان ایک راوی کا اضافہ کیا ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ أحمد (5/71)`;