var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ مُحَمَّدَ بْنَ أَبِي عُبَيْدَةَ حَدَّثَهُمْ قَالَ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ سَعْدٍ الطَّائِيِّ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ حَدَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا ذَكَرَ فِيهِ جِبْرِيلَ وَمِيكَالَ فَقَالَ جِبْرَائِلُ وَمِيكَائِلُ قَالَ أَبُو دَاوُد قَالَ خَلَفٌ مُنْذُ أَرْبَعِينَ سَنَةً لَمْ أَرْفَعِ الْقَلَمَ عَنْ كِتَابَةِ الْحُرُوفِ مَا أَعْيَانِي شَيْءٌ مَا أَعْيَانِي جِبْرَائِلُ وَمِيكَائِلُ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے ایک حدیث بیان فرمائی۔اس میں جبرائیل اور میکال کا ذکر تھا تو آپ ﷺ نے (ان کے تلفظ میں) ’’«جبرائل» اور «میکائل» فرمایا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عطیۃ ضعیف`;
abudawood.anwaar = [142,1];