var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي حَازِمٍ عَنْ مُسْلِمِ بْنِ قُرْطٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا ذَهَبَ أَحَدُكُمْ إِلَى الْغَائِطِ فَلْيَذْهَبْ مَعَهُ بِثَلَاثَةِ أَحْجَارٍ يَسْتَطِيبُ بِهِنَّ فَإِنَّهَا تُجْزِئُ عَنْهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے وہ کہتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی پاخانہ کے لیے جانے لگے تو اپنے ساتھ تین ڈھیلے لے جایا کرے،ان سے استنجاء کر لیا کرے،بیشک یہ اس کے لیے کفایت کریں گے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (349)
وصححہ الدارقطنی (1/54،55) وسندہ حسن`;