var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ سَعْدِ بْنِ طَارِقٍ عَنْ كَثِيرِ بْنِ مُدْرِكٍ عَنْ الْأَسْوَدِ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ قَالَ كَانَتْ قَدْرُ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّيْفِ ثَلَاثَةَ أَقْدَامٍ إِلَى خَمْسَةِ أَقْدَامٍ وَفِي الشِّتَاءِ خَمْسَةَ أَقْدَامٍ إِلَى سَبْعَةِ أَقْدَامٍ";
abudawood.urdu = "جناب اسود سے روایت ہے ان کا بیان ہے کہ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ رسول اللہ ﷺ کی نماز اندازاً گرمیوں میں تین قدم سے پانچ قدم (سایہ) تک اور سردیوں میں پانچ سے سات قدم تک ہوتی تھی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (586)`;