var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ الْمِنْقَرِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ ابْنِ مَسْعُودٍ أَنَّهُ قَرَأَ هَيْتَ لَكَ فَقَالَ شَقِيقٌ إِنَّا نَقْرَؤُهَا هِئْتُ لَكَ يَعْنِي فَقَالَ ابْنُ مَسْعُودٍ أَقْرَؤُهَا كَمَا عُلِّمْتُ أَحَبُّ إِلَيَّ";
abudawood.urdu = "جناب شقیق سے روایت ہے کہ سیدنا ابن مسعود رضی اللہ عنہ نے پڑھا «ہیت لک» (’’ھا‘‘ پر زبر کے ساتھ) شقیق کے کہا ہم اسے «ہیت لک» پڑھتے ہیں (یعنی ’’ھا‘‘ کے نیچے زیر کے ساتھ) تو ابن مسعود رضی اللہ عنہ نے کہا: جیسے پڑھایا گیا اسی طرح پڑھنا مجھے زیادہ محبوب ہے۔";
abudawood.hukam = "صحیح بخاری (4692)";
abudawood.description = ``;