var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ قِيلَ لِعَبْدِ اللَّهِ إِنَّ أُنَاسًا يَقْرَءُونَ هَذِهِ الْآيَةَ وَقَالَتْ هِيتَ لَكَ فَقَالَ إِنِّي أَقْرَأُ كَمَا عُلِّمْتُ أَحَبُّ إِلَيَّ وَقَالَتْ هَيْتَ لَكَ";
abudawood.urdu = "جناب شقیق سے روایت ہے کہ سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے کہا گیا کہ لوگ یہ آیت کریمہ «وقالت ہیت لک» پڑھتے ہیں (یعنی ’’ھا‘‘ کے زیر کے ساتھ) تو انہوں نے کہا: بلاشبہ مجھے اسی طرح پڑھنا زیادہ محبوب ہے جیسے کہ مجھے سکھایا گیا ہے «وقالت ہیت لک» (یعنی ’’ھا‘‘ پر زبر کے ساتھ)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4004)`;