var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أَبِي عُذْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ دُخُولِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوهَا فِي الْمَيَازِرِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے حمامات (اجتماعی اور عوامی غسل خانوں) میں جانے سے منع فرمایا۔مگر بعد میں مردوں کو اجازت دے دی کہ چادر باندھ کر جا سکتے ہیں (دوسروں کے سامنے عریاں نہ ہوں)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4474)
أخرجہ الترمذي (2802 وسندہ حسن) وابن ماجہ (3749 وسندہ حسن) وقال الترمذي: ’’وإسنادہ لیس بذک القائم‘‘ ، و أبو عذرۃ: حسن الحدیث، و السند قائم و الحمد للّٰہ`;