var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّهَا سَتُفْتَحُ لَكُمْ أَرْضُ الْعَجَمِ وَسَتَجِدُونَ فِيهَا بُيُوتًا يُقَالُ لَهَا الْحَمَّامَاتُ فَلَا يَدْخُلَنَّهَا الرِّجَالُ إِلَّا بِالْأُزُرِ وَامْنَعُوهَا النِّسَاءَ إِلَّا مَرِيضَةً أَوْ نُفَسَاءَ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’عنقریب تمہارے لیے عجم کے علاقے فتح ہوں گے اور تم وہاں ایسے گھروندے پاؤ گے جنہیں ’’حمامات‘‘ کہا جاتا ہو گا۔تو مرد ان میں ہرگز نہ جائیں الا یہ کہ چادریں باندھ کر (باپردہ ہو کر جائیں) اور عورتوں کو ان سے منع کرنا سوائے اس کے کہ کوئی بیمار ہو یا نفاس میں ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3748)<br>الإفریقي ضعیف`;
abudawood.anwaar = [143,1];