var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ،حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ،حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ،عَنْ عَطَاءٍ،عَنْ صَفْوَانَ بْنِ يَعْلَى،عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِهَذَا الْحَدِيثِ. قَالَ أَبُو دَاوُد: الْأَوَّلُ أَتَمُّ.";
abudawood.urdu = "صفوان بن یعلیٰ اپنے والد سے وہ نبی کریم ﷺ سے یہی حدیث روایت کرتے ہیں۔امام ابوداؤد رحمہ اللہ نے کہا: پہلی روایت زیادہ کامل ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ النسائي (407) ورواہ أسباط بن محمد عن عبد الملک بن السلیمان، انظر النکت الظراف (9/115)`;