var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي النَّضْرِ عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ جَرْهَدٍ عَنْ أَبِيهِ قَالَ كَانَ جَرْهَدٌ هَذَا مِنْ أَصْحَابِ الصُّفَّةِ قَالَ جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَنَا وَفَخِذِي مُنْكَشِفَةٌ فَقَالَ أَمَا عَلِمْتَ أَنَّ الْفَخِذَ عَوْرَةٌ";
abudawood.urdu = "جناب زرعہ اپنے والد عبدالرحمٰن بن جرہد سے روایت کرتے ہیں اور یہ جرہد رضی اللہ عنہ اصحاب صفہ میں سے تھے۔انہوں نے بیان کیا کہ رسول اللہ ﷺ ہمارے ہاں بیٹھے ہوئے تھے اور میری ران ننگی ہو رہی تھی ‘ تو آپ ﷺ نے فرمایا ’’کیا تمہیں معلوم نہیں کہ ران قابل ستر ہوتی ہے۔‘‘ (یعنی اسے چھپانا چاہیئے)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3112)
زرعۃ بن عبد الرحمن بن جرھد: ذکرہ ابن حبان فی الثقات وحسنہ الترمذي وصحح لہ الحاکم والذھبي وللحدیث شواھد کثیرۃ عند الترمذي (2797) وغیرہ`;