var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أُخْبِرْتُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكْشِفْ فَخِذَكَ وَلَا تَنْظُرْ إِلَى فَخِذِ حَيٍّ وَلَا مَيِّتٍ قَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ فِيهِ نَكَارَةٌ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ہے ’’اپنی ران کو ننگا مت کر اور کسی دوسرے کی ران کو مت دیکھ،زندہ ہو یا مردہ۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں اس حدیث میں ضعف ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف جدًا<br>انظر الحدیث السابق (3140)`;
abudawood.anwaar = [143,1];