var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأُمَوِيُّ عَنْ عُثْمَانَ بْنِ حَكِيمٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَ حَمَلْتُ حَجَرًا ثَقِيلًا فَبَيْنَا أَمْشِي فَسَقَطَ عَنِّي ثَوْبِي فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ عَلَيْكَ ثَوْبَكَ وَلَا تَمْشُوا عُرَاةً";
abudawood.urdu = "سیدنا مسور بن مخرمہ رضی اللہ عنہ کہتے ہیں کہ میں (ایک بار) ایک بھاری پتھر اٹھائے چلا جا رہا تھا کہ میرا کپڑا گر گیا ‘ تو رسول اللہ ﷺ نے مجھ سے فرمایا ’’اپنے اور کپڑا لے لو اور برہنہ ہو کر مت چلو۔‘‘";
abudawood.hukam = "صحیح مسلم (341)";
abudawood.description = ``;