var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا ابْنُ عُلَيَّةَ عَنْ الْجُرَيْرِيِّ ح و حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ رَجُلٍ مِنْ الطُّفَاوَةِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفْضِيَنَّ رَجُلٌ إِلَى رَجُلٍ وَلَا امْرَأَةٌ إِلَى امْرَأَةٍ إِلَّا وَلَدًا أَوْ وَالِدًا قَالَ وَذَكَرَ الثَّالِثَةَ فَنَسِيتُهَا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’کوئی مرد دوسرے مرد کے ساتھ یا کوئی عورت دوسری عورت کے ساتھ ہرگز نہ لیٹے ‘ مگر بیٹا یا باپ ہو تو جائز ہے۔‘‘ راوی نے کہا کہ تیسری بات بھی ذکر کی تھی جو میں بھول گیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>انظر الحدیث السابق (2174)`;
abudawood.anwaar = [143,1];