var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ الْحَنَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ كَانَ أَحَبُّ الثِّيَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَمِيصَ";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ کو تمام کپڑوں میں سے قمیص زیادہ پسند تھی۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4328)
أخرجہ الترمذي (1762)`;