var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا أَبُو تُمَيْلَةَ قَالَ حَدَّثَنِي عَبْدُ الْمُؤْمِنِ بْنُ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ قَالَتْ لَمْ يَكُنْ ثَوْبٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قَمِيصٍ";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ کو قمیص سے بڑھ کر اور کوئی کپڑا زیادہ پسند نہیں تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;