var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ عَنْ أَبِيهِ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْ كَانَتْ يَدُ كُمِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الرُّسْغِ";
abudawood.urdu = "سیدہ اسماء بنت یزید بیان کرتی ہیں کہ رسول اللہ ﷺ کی قمیص کی آستین (آپ کے) پہنچے (گٹے) تک ہوا کرتی تھی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (1765 وسندہ حسن)`;