var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ ح و حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عِيسَى عَنْ شَرِيكٍ عَنْ عُثْمَانَ بْنِ أَبِي زُرْعَةَ عَنْ الْمُهَاجِرِ الشَّامِيِّ عَنْ ابْنِ عُمَرَ قَالَ فِي حَدِيثِ شَرِيكٍ يَرْفَعُهُ قَالَ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَلْبَسَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ثَوْبًا مِثْلَهُ زَادَ عَنْ أَبِي عَوَانَةَ ثُمَّ تُلَهَّبُ فِيهِ النَّارُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مرفوعاً روایت ہے کہ (آپ ﷺ نے) فرمایا ’’جس نے شہرت والا لباس پہنا اللہ عزوجل قیامت کے دن اسے اسی جیسا لباس پہنائے گا۔‘‘ ابوعوانہ سے مزیدروایت ہوا ہے: ’’پھر اس کے لیے اس میں آگ بھڑکے گی۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4346)
أخرجہ ابن ماجہ (3607) وللحدیث شواھد`;