var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ ثَابِتٍ حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ عَنْ أَبِي مُنِيبٍ الْجُرَشِيِّ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَشَبَّهَ بِقَوْمٍ فَهُوَ مِنْهُمْ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کسی قوم سے مشابہت اختیار کی تو وہ انہی میں سے ہوا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4347)
أخرجہ أحمد (2/50) مطولًا، عبد الرحمن بن ثابت حسن الحدیث وتابعہ الأوزاعي في مشکل الآثار (1/88)`;