var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الرَّمْلِيُّ وَحُسَيْنُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ أَبِيهِ عَنْ مُصْعَبِ بْنِ شَيْبَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ مِرْطٌ مُرَحَّلٌ مِنْ شَعَرٍ أَسْوَدَ و قَالَ حُسَيْنٌ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ باہر تشریف لائے جبکہ آپ ﷺ بالوں کی بنی ہوئی کجاووں جیسے نقش والی سیاہ رنگ کی چادر اوڑھے ہوئے تھے۔اور حسین نے سند یوں بیان کی «حدثنا یحیی بن زکریا» یعنی ابن ابی زائدہ کی بجائے اصل نام و نسب ذکر کیا";
abudawood.hukam = "ضعیف";
abudawood.description = `[4032ب] إسنادہ ضعیف<br>عقیل بن مدرک لم یوثقہ غیر ابن حبان وقال الحافظ : مقبول (تق : 4663) أي مجہول الحال`;
abudawood.anwaar = [143,1];