var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا عُمَارَةُ بْنُ زَاذَانَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ مَلِكَ ذِي يَزَنَ أَهْدَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُلَّةً أَخَذَهَا بِثَلَاثَةٍ وَثَلَاثِينَ بَعِيرًا أَوْ ثَلَاثٍ وَثَلَاثِينَ نَاقَةً فَقَبِلَهَا";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ شاہ ذی یزن (بنو حمیر) نے رسول اللہ ﷺ کی خدمت میں ایک حلہ (کپڑوں کا جوڑا) ہدیہ بھیجا جو اس نے تینتیس اونٹوں یا اونٹنیوں کے بدلے میں خریدا تھا۔پس آپ ﷺ نے اسے قبول فرما لیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قال أحمد في عمارۃ بن زاذان :’’ یروي عن ثابت عن أنس أحادیث مناکیر ‘‘ (الجرح والتعدیل 6/ 366 وسندہ صحیح)`;
abudawood.anwaar = [143,1];