var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى حُلَّةً بِبِضْعَةٍ وَعِشْرِينَ قَلُوصًا فَأَهْدَاهَا إِلَى ذِي يَزَنَ";
abudawood.urdu = "اسحاق بن عبداللہ بن حارث نے روایت کیا کہ رسول اللہ ﷺ نے بیس سے کچھ اوپر اونٹنیاں دے کر ایک جوڑا خریدا اور پھر ذی یزن کی طرف ہدیہ بھیج دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل وعلي بن زید ضعیف`;
abudawood.anwaar = [144,1];