var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنِ ابْنِ شِهَابٍ،عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ أَخْبَرَهُ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ بَيْضَاءُ مُرْتَفِعَةٌ حَيَّةٌ» وَيَذْهَبُ الذَّاهِبُ إِلَى الْعَوَالِي وَالشَّمْسُ مُرْتَفِعَةٌ";
abudawood.urdu = "ابن شہاب،سیدنا انس بن مالک رضی اللہ عنہ سے راوی ہیں،وہ کہتے ہیں کہ رسول اللہ ﷺ عصر کی نماز پڑھا کرتے جبکہ سورج سفید،اونچا اور زندہ ہوتا تھا۔اور جانے والا بالائے مدینہ (کی آبادی) کی طرف جاتا اور سورج اونچا ہوتا تھا۔";
abudawood.hukam = "صحیح مسلم (621)";
abudawood.description = ``;