var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ وَعَمْرُو بْنُ الْحَارِثِ عَنِ ابْنِ شِهَابٍ،عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِيهِ... بِهَذِهِ الْقِصَّةِ،قَالَ: حُلَّةُ إِسْتَبْرَقٍ،وَقَالَ فِيهِ: ثُمَّ أَرْسَلَ إِلَيْهِ بِجُبَّةِ دِيبَاجٍ،وَقَالَ: تَبِيعُهَا وَتُصِيبُ بِهَا حَاجَتَكَ.";
abudawood.urdu = "جناب سالم اپنے والد،سیدنا عبداللہ بن عمر رضی اللہ عنہما سے یہ قصہ بیان کرتے ہیں انہوں نے («حلۃ سیراء» کی بجائے) «حلۃ إستبرق» کہا۔(استبرق موٹے ریشم کو کہتے ہیں) اس روایت میں ہے کہ رسول اللہ ﷺ نے ان کو دیباج (بارک ریشم) کا ایک حلہ بھجوایا اور فرمایا ’’اسے فروخت کر کے اپنی ضرورت پوری کر لو۔“";
abudawood.hukam = "صحیح بخاری (2054) صحیح مسلم (2068)";
abudawood.description = ``;