var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَ كَتَبَ عُمَرُ إِلَى عُتْبَةَ بْنِ فَرْقَدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحَرِيرِ إِلَّا مَا كَانَ هَكَذَا وَهَكَذَا أُصْبُعَيْنِ وَثَلَاثَةً وَأَرْبَعَةً";
abudawood.urdu = "ابوعثمان النہدی سے روایت ہے کہ سیدنا عمر بن خطاب رضی اللہ عنہ نے عتبہ بن فرقد کو لکھا کہ نبی کریم ﷺ نے ریشم سے منع فرمایا ہے الا یہ کہ اس اس قدر ہو یعنی دو،تین،چار انگلی کے برابر۔";
abudawood.hukam = "صحیح بخاری (5829) صحیح مسلم (2069)";
abudawood.description = ``;