var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ يَعْنِي الْمَرْوَزِيَّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ،عَنْ أَبِيهِ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِهَذَا.\nقَالَ: عَنِ الْقِرَاءَةِ فِي الرُّكُوعِ وَالسُّجُودِ.";
abudawood.urdu = "سیدنا علی بن ابی طالب رضی اللہ عنہ نے نبی کریم ﷺ سے یہ حدیث بیان کی اور کہا کہ آپ ﷺ نے رکوع اور سجدے میں قرآت قرآن سے منع فرمایا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4044)`;