var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بِهَذَا زَادَ وَلَا أَقُولُ نَهَاكُمْ";
abudawood.urdu = "ابراہیم بن عبداللہ نے یہ روایت بیان کی(سیدنا علی رضی اللہ عنہ نے کہا: رسول اللہ ﷺ نے مجھے منع فرمایا ہے) اس میں یہ مزید بیان کیا: میں یہ نہیں کہتا کہ تم لوگوں کو منع کیا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ ابن عبد البر فی التمھید (16/144 وسندہ حسن) وانظر الحدیث السابق (4044)`;