var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ هُبَيْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَالْمِيثَرَةِ الْحَمْرَاءِ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے مجھے منع فرمایا کو سونے کی انگوٹھی پہنوں یا قسی (ریشمی) لباس اختیار کروں یا زین پوش سرخ رنگ کا ہو۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4356)
روایۃ شعبۃ عن أبي إسحاق محمولۃ علی السماع`;