var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ فِي آخَرِينَ،قَالُوا:،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ... نَحْوَهُ. وَالْأَوَّلُ أَشْبَعُ.";
abudawood.urdu = "عثمان بن ابی شیبہ اور ان کے دوسرے ساتھی بیان کرتے ہیں کہ سفیان نے بواسطہ زہری ‘ عروہ سے ‘ انہوں نے ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مذکورہ بالا حدیث کی مانند روایت کیا۔اور مذکورہ بالا روایت زیادہ جامع ہے۔";
abudawood.hukam = "صحیح بخاری (752) صحیح مسلم (556)";
abudawood.description = `انظر الحدیث السابق (914)`;