var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا خُصَيْفٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الثَّوْبِ الْمُصْمَتِ مِنْ الْحَرِيرِ فَأَمَّا الْعَلَمُ مِنْ الْحَرِيرِ وَسَدَى الثَّوْبِ فَلَا بَأْسَ بِهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے صرف اسی کپڑے سے منع فرمایا ہے جو خالص ریشمی ہو۔لیکن اگر ریشمی دھاگے سے کڑھائی ہوئی ہو یا اس کا تانا ریشمی ہو تو اس کا کوئی حرج نہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خصیف ضعیف وروی أحمد (313/1 وأطراف المسند 95/3) بإسناد صحیح عن ابن عباس قال :’’ إنما نہی رسول اللّٰہ ﷺ عن (الثوب) المصمت حریرًا ‘‘`;
abudawood.anwaar = [144,1];