var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَلِلزُّبَيْرِ بْنِ الْعَوَّامِ فِي قُمُصِ الْحَرِيرِ فِي السَّفَرِ مِنْ حِكَّةٍ كَانَتْ بِهِمَا";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے سیدنا عبدالرحمٰن بن عوف اور زبیر بن عوام رضی اللہ عنہ کو ریشم کے قمیصیں پہننے کی اجازت دی تھی جبکہ وہ سفر میں تھے اور انہیں خارش ہو گئی تھی۔";
abudawood.hukam = "صحیح بخاری (2919) صحیح مسلم (2076)";
abudawood.description = ``;