var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ وَكَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيَّانِ قَالَا حَدَّثَنَا بَقِيَّةُ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ حَدَّثَهُ أَنَّهُ رَأَى عَلَى أُمِّ كُلْثُومٍ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُرْدًا سِيَرَاءَ قَالَ وَالسِّيَرَاءُ الْمُضَلَّعُ بِالْقَزِّ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ انہوں نے سیدہ ام کلثوم رضی اللہ عنہا دختر رسول اللہ ﷺ کو دیکھا کہ انہوں نے سیراء کی ایک چادر اوڑھی ہوئی تھی۔یعنی دھاری دار ریشمی چادر جس میں چار خانے سے بنے ہوئے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البخاري (5842) مختصرًا`;