var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ يَعْنِي الزُّبَيْرِيَّ حَدَّثَنَا مِسْعَرٌ عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرٍ قَالَ كُنَّا نَنْزِعُهُ عَنْ الْغِلْمَانِ وَنَتْرُكُهُ عَلَى الْجَوَارِي قَالَ مِسْعَرٌ فَسَأَلْتُ عَمْرَو بْنَ دِينَارٍ عَنْهُ فَلَمْ يَعْرِفْهُ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ ہم لڑکوں پر سے (ریشم) اتار لیا کرتے تھے اور بچیوں پر رہنے دیتے تھے۔مسعر کہتے ہیں کہ میں نے اس روایت کے بارے میں عمرو بن دینار سے دریافت کیا تو انہوں نے لاعلمی کا اظہار کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;