var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ الْأَزْدِيُّ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ قَالَ قُلْنَا لِأَنَسٍ يَعْنِي ابْنَ مَالِكٍ أَيُّ اللِّبَاسِ كَانَ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ أَعْجَبَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحِبَرَةُ";
abudawood.urdu = "جناب قتادہ کہتے ہیں کہ ہم نے سیدنا انس بن مالک رضی اللہ عنہ سے پوچھا کہ رسول اللہ ﷺ کو کون سا لباس سب سے زیادہ پسند تھا؟ تو انہوں کہ کہا کہ نقش دار (یا دھاری دار)۔";
abudawood.hukam = "صحیح بخاری (5812) صحیح مسلم (2079)";
abudawood.description = ``;