var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ إِيَادٍ حَدَّثَنَا إِيَادٌ عَنْ أَبِي رِمْثَةَ قَالَ انْطَلَقْتُ مَعَ أَبِي نَحْوَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ عَلَيْهِ بُرْدَيْنِ أَخْضَرَيْنِ";
abudawood.urdu = "سیدنا ابورمثہ (رفاعہ بن یثربی رضی اللہ عنہ) بیان کرتے ہیں کہ میں اپنے والد کے ساتھ نبی کریم ﷺ کے ہاں گیا تو میں نے آپ ﷺ پر سبز رنگ کی دھاری دار دو چادریں دیکھیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4359)
أخرجہ النسائي (1573 وسندہ صحیح) ورواہ الترمذي (2812 وسندہ صحیح)`;