var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُزَابَةَ حَدَّثَنَا إِسْحَقُ يَعْنِي ابْنَ مَنْصُورٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي يَحْيَى عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ مَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ عَلَيْهِ ثَوْبَانِ أَحْمَرَانِ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ ایک آدمی نبی کریم ﷺ کے پاس سے گزرا جس پر سرخ رنگ کے دو کپڑے تھے ‘ اس نے آپ ﷺ کو سلام کیا مگر آپ ﷺ نے اس کے سلام کا جواب نہیں دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2807)<br>قال أحمد في أبي یحیی القتات :’’ روی عنہ إسرائیل أحادیث کثیرۃ مناکیر جدًا ‘‘ (الجرح والتعدیل 433/3 وسندہ صحیح) وقال الحافظ : لین الحدیث (تق : 4069) وقال الھیثمي : وضعفہ الجمھور (مجمع الزوائد 10 / 74،و انظر 200/7)`;
abudawood.anwaar = [145,1];