var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنْ ابْنِ شِهَابٍ قَالَ عُرْوَةُ وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ";
abudawood.urdu = "جناب عروہ نے کہا مجھ سے سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ عصر کی نماز پڑھتے تو دھوپ ان کے حجرے میں ہوتی اور دیوار پر نہ چڑھی ہوتی تھی۔";
abudawood.hukam = "صحیح بخاری (522) صحیح مسلم (611)";
abudawood.description = ``;