var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ شَعْرٌ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ وَرَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ لَمْ أَرَ شَيْئًا قَطُّ أَحْسَنَ مِنْهُ";
abudawood.urdu = "سیدنا براء بن عازب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کے بال آپ ﷺ کے کانوں کی لوؤں تک آتے تھے۔اور میں نے آپ ﷺ کو دیکھا کہ آپ ﷺ سرخ رنگ کا جوڑا پہنے ہوئے تھے۔اس سے زیادہ خوبصورت منظر میں نے کبھی نہیں دیکھا۔";
abudawood.hukam = "صحیح بخاری (3551) صحیح مسلم (2337)";
abudawood.description = ``;