var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِلَالِ بْنِ عَامِرٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى يَخْطُبُ عَلَى بَغْلَةٍ وَعَلَيْهِ بُرْدٌ أَحْمَرُ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَمَامَهُ يُعَبِّرُ عَنْهُ";
abudawood.urdu = "جناب ہلال بن عامر اپنے والد سے روایت کرتے ہیں،انہوں نے کہا کہ میں نے رسول اللہ ﷺ کو منیٰ میں دیکھا ‘ جب کہ آپ ﷺ اپنے خچر پر سے خطبہ دے رہے تھے اور آپ ﷺ نے سرخ رنگ کی دھاری دار چادر لی ہوئی تھی۔سیدنا علی رضی اللہ عنہ آپ ﷺ کے آگے تھے جو آپ ﷺ کی بات لوگوں تک پہنچا رہے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4363)
انظر الحدیث السابق (1956)`;