var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ صَنَعْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُرْدَةً سَوْدَاءَ فَلَبِسَهَا فَلَمَّا عَرَقَ فِيهَا وَجَدَ رِيحَ الصُّوفِ فَقَذَفَهَا قَالَ وَأَحْسِبُهُ قَالَ وَكَانَ تُعْجِبُهُ الرِّيحُ الطَّيِّبَةُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے نبی کریم ﷺ کے لیے ایک چادر کو سیاہ رنگ سے رنگ دیا ‘ آپ ﷺ نے اسے پہنا ‘ مگر جب اس میں پسینہ آیا تو آپ ﷺ نے اس میں اون کی بساند محسوس کی تو اتار پھینکا۔راوی نے کہا کہ آپ ﷺ کو عمدہ خوشبو ہی پسند آتی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [145,1];