var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُحَمَّدٍ الْقُرَشِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ عُبَيْدَةَ أَبِي خِدَاشٍ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ جَابِرٍ يَعْنِي ابْنَ سُلَيْمٍ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْتَبٍ بِشَمْلَةٍ وَقَدْ وَقَعَ هُدْبُهَا عَلَى قَدَمَيْهِ";
abudawood.urdu = "سیدنا جابر بن سلیم رضی اللہ عنہ سے مروی ہے کہتے ہیں کہ میں نبی کریم ﷺ کی خدمت میں حاضر ہوا جبکہ آپ ﷺ گھٹنوں کو اٹھائے کپڑا لپیٹے بیٹھے تھے اور شملے (چادر) کی کناری آپ ﷺ کے قدموں پر پڑ رہی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبیدۃ أبو خداش :مجہول (تق : 4414)`;
abudawood.anwaar = [145,1];