var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ وَمُوسَى بْنُ إِسْمَعِيلَ قَالُوا حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَامَ الْفَتْحِ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ فتح مکہ کے سال نبی کریم ﷺ مکے میں داخل ہوئے تو آپ ﷺ پر سیاہ رنگ کی پگڑی تھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ مسلم (1358) من طریق آخر`;