var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُسَاوِرٍ الْوَرَّاقِ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَهَا بَيْنَ كَتِفَيْهِ";
abudawood.urdu = "جناب جعفر بن عمرو بن حریث اپنے والد سے روایت کرتے ہیں،انہوں نے کہا کہ میں نے نبی کریم ﷺ کو منبر پر دیکھا،آپ ﷺ پر سیاہ پگڑی تھی،اس کے کنارے کو آپ ﷺ نے اپنے کندھوں کے درمیان لٹکایا ہوا تھا۔";
abudawood.hukam = "صحیح مسلم (1359)";
abudawood.description = ``;