var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ حَدَّثَنَا أَبُو الْحَسَنِ الْعَسْقَلَانِيُّ عَنْ أَبِي جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ رُكَانَةَ عَنْ أَبِيهِ أَنَّ رُكَانَةَ صَارَعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَرَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُكَانَةُ وَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَرْقُ مَا بَيْنَنَا وَبَيْنَ الْمُشْرِكِينَ الْعَمَائِمُ عَلَى الْقَلَانِسِ";
abudawood.urdu = "ابوجعفر بن محمد بن علی بن رکانہ اپنے والد سے روایت کرتے ہیں کہ رکانہ نے نبی کریم ﷺ سے کشتی کی تھی تو نبی کریم ﷺ نے اس کو پچھاڑ دیا تھا۔رکانہ نے کہا: میں نے نبی کریم ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’ہمارے اور مشرکین کے درمیان ٹوپیوں پر پگڑیاں باندھنے کا فرق ہے۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1784)<br>أبو الحسن و أبو جعفر مجہولان (تق 8048،8016)<br>والحدیث ضعفہ الترمذي`;
abudawood.anwaar = [145,1];