var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ الْغَطَفَانِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ خَرَّبُوذَ حَدَّثَنِي شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ يَقُولُ عَمَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَدَلَهَا بَيْنَ يَدَيَّ وَمِنْ خَلْفِي";
abudawood.urdu = "سیدنا عبدالرحمٰن بن عوف رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مجھے پگڑی باندھی اور اس کے کناروں کو میرے آگے کی طرف اور پیچھے کی جانب لٹکا دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شیخ من أھل المدینۃ:مجہول کما قال المنذري (عون المعبود 96/4)`;
abudawood.anwaar = [145,1];