var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَنْبَرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْيَمَامِيُّ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَلِيِّ بْنِ شَيْبَانَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَلِيِّ بْنِ شَيْبَانَ قَالَ قَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ فَكَانَ يُؤَخِّرُ الْعَصْرَ مَا دَامَتْ الشَّمْسُ بَيْضَاءَ نَقِيَّةً";
abudawood.urdu = "جناب یزید بن عبدالرحمٰن بن علی بن شیبان اپنے باپ سے وہ اس کے دادا علی بن شیبان رضی اللہ عنہ سے راوی ہیں،وہ کہتے ہیں کہ ہم مدینہ میں رسول اللہ ﷺ کی خدمت میں آئے تو (دیکھا کہ) آپ عصر کو مؤخر کرتے تھے جب تک کہ سورج سفید اور صاف ہوتا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن یزید الیمامي وشیخہ یزید بن عبد الرحمٰن: مجہولان (تقریب: 6404،7747)`;
abudawood.anwaar = [28,1];