var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لِبْسَتَيْنِ أَنْ يَحْتَبِيَ الرَّجُلُ مُفْضِيًا بِفَرْجِهِ إِلَى السَّمَاءِ وَيَلْبَسُ ثَوْبَهُ وَأَحَدُ جَانِبَيْهِ خَارِجٌ وَيُلْقِي ثَوْبَهُ عَلَى عَاتِقِهِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے دو انداز سے کپڑا لپیٹنے سے منع فرمایا ہے۔ایک یہ کہ آدمی کپڑا اس طرح لپیٹے کہ اس کی شرمگاہ آسمان کی جانب کھلی رہے۔دوسرا یوں کہ کپڑا لپیٹے اور اس کا ایک کنارا باہر نکال کر اپنے کندھے پر ڈال لے۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ مسلم (1511، 1554)`;