var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّمَّاءِ وَعَنْ الِاحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے منقول ہے،انہوں نے بیان کیا کہ رسول اللہ ﷺ نے صماء کے طور پر کپڑا لپیٹنے سے منع کیا ہے۔(یعنی انسان پوری طرح سے اس میں لپٹ جائے اور ہاتھ پاؤں کچھ بھی باہر نہ ہو) اور ایک کپڑے کو اپنی کمر اور گھٹنوں پر لپیٹنے سے بھی منع کیا ہے۔";
abudawood.hukam = "صحیح مسلم (2099)";
abudawood.description = ``;