var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ عَنِ الْأَعْمَشِ،عَنْ سُلَيْمَانَ بْنِ مُسْهِرٍ،عَنْ خَرَشَةَ بْنِ الْحُرِّ،عَنْ أَبِي ذَرٍّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِهَذَا. وَالْأَوَّلُ أَتَمُّ, قَالَ: الْمَنَّانُ: الَّذِي لَا يُعْطِي شَيْئًا إِلَّا مَنَّهُ.";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ نے نبی کریم ﷺ سے یہ روایت بیان کی اور مذکورہ بالا روایت زیادہ کامل ہے۔کہا کہ «المنان» سے مراد ایسا آدمی ہے جو جب بھی کوئی چیز دے تو احسان جتلائے۔";
abudawood.hukam = "صحیح مسلم (106)";
abudawood.description = ``;