var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِسْبَالُ فِي الْإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مَنْ جَرَّ مِنْهَا شَيْئًا خُيَلَاءَ لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ";
abudawood.urdu = "جناب سالم بن عبداللہ بن عمر رضی اللہ عنہ اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’’’اسبال‘‘ یعنی (حد سے زیادہ) کپڑا لٹکانا تہبند،قمیص اور پگڑی سبھی میں (ممنوع) ہے۔جس نے تکبر سے ان میں سے کچھ بھی لٹکایا تو قیامت کے روز اللہ تعالیٰ اس کی طرف نظر نہیں کرے گا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ النسائي (5336 وسندہ حسن)`;