var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ أَبِي الصَّبَّاحِ عَنْ يَزِيدَ بْنِ أَبِي سُمَيَّةَ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْإِزَارِ فَهُوَ فِي الْقَمِيصِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما کہا کرتے تھے کہ رسول اللہ ﷺ نے جو کچھ تہبند کے بارے میں فرمایا ہے قمیص کے بارے میں بھی اس کا یہی حکم ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;