var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ لَعَنَ الْمُتَشَبِّهَاتِ مِنْ النِّسَاءِ بِالرِّجَالِ وَالْمُتَشَبِّهِينَ مِنْ الرِّجَالِ بِالنِّسَاءِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے لعنت فرمائی ہے ان عورتوں پر جو مردوں کی مشابہت اختیار کریں اور ان مردوں پر جو عورتوں کی مشابہت اختیار کریں۔";
abudawood.hukam = "صحیح بخاری (5885)";
abudawood.description = ``;