var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو عَامِرٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَ يَلْبَسُ لِبْسَةَ الْمَرْأَةِ وَالْمَرْأَةَ تَلْبَسُ لِبْسَةَ الرَّجُلِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا رسول اللہ ﷺ نے لعنت فرمائی ہے ایسے مرد پر جو عورت جیسا لباس پہنے اور ایسی عورت پر جو مردوں جیسا لباس پہنے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4469)`;