var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ لُوَيْنٌ وَبَعْضُهُ قِرَاءَةً عَلَيْهِ عَنْ سُفْيَانَ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ قَالَ قِيلَ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا إِنَّ امْرَأَةً تَلْبَسُ النَّعْلَ فَقَالَتْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَةَ مِنْ النِّسَاءِ";
abudawood.urdu = "جناب ابن ابی ملیکہ سے روایت ہے کہ ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے کہا گیا کہ (جو) عورت (مردوں کے لیے مخصوص) جوتا پہنتی ہے،(اس کے متعلق آپ کی کیا رائے ہے؟) تو انہوں نے کہا: رسول اللہ ﷺ نے مردوں کی طرح بننے والی عورتوں پر لعنت فرمائی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن جریج عنعن<br>والحدیثان السابقان (الأصل : 4097،4098) یغنیان عنہ`;
abudawood.anwaar = [145,2];