var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَمْرِو بْنِ خُزَيْمَةَ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الِاسْتِطَابَةِ فَقَالَ بِثَلَاثَةِ أَحْجَارٍ لَيْسَ فِيهَا رَجِيعٌ قَالَ أَبُو دَاوُد كَذَا رَوَاهُ أَبُو أُسَامَةَ وَابْنُ نُمَيْرٍ عَنْ هِشَامٍ يَعْنِي ابْنَ عُرْوَةَ";
abudawood.urdu = "سیدنا خزیمہ بن ثابت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ سے استنجاء کے بارے میں پوچھا گیا تو آپ ﷺ نے فرمایا ’’تین ڈھیلوں سے (استنجاء کرے) ان میں گوبر نہ ہو۔“ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابواسامہ اور ابن نمیر نے بھی ہشام بن عروہ سے ایسے ہی روایت کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف،ابن ماجہ (315)<br>عمرو بن خزیمۃ مجہول الحال،لم یوثقہ غیر ابن حبان<br>وحدیث مسلم (262) یغني عنہ`;
abudawood.anwaar = [15,1];