var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا ابْنُ ثَوْرٍ عَنْ مَعْمَرٍ عَنْ ابْنِ خُثَيْمٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ لَمَّا نَزَلَتْ يُدْنِينَ عَلَيْهِنَّ مِنْ جَلَابِيبِهِنَّ خَرَجَ نِسَاءُ الْأَنْصَارِ كَأَنَّ عَلَى رُءُوسِهِنَّ الْغِرْبَانَ مِنْ الْأَكْسِيَةِ";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ جب عورتوں کے متعلق یہ حکم نازل ہوا «یدنین علیہن من جلابیبہن» ’’وہ اپنے اوپر اپنی چادریں لٹکا لیا کریں۔‘‘ تو انصاری عورتیں جب باہر نکلتیں تو ایسے لگتا کہ ان کے سروں پر کوئے بیٹھے ہوں۔ان سیاہ چادروں کی وجہ سے جو وہ اپنے سروں پر لینے لگی تھیں۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;