var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ مَوْهَبٍ قَالَا حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ أُمَّ سَلَمَةَ اسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحِجَامَةِ فَأَمَرَ أَبَا طَيْبَةَ أَنْ يَحْجُمَهَا قَالَ حَسِبْتُ أَنَّهُ قَالَ كَانَ أَخَاهَا مِنْ الرَّضَاعَةِ أَوْ غُلَامًا لَمْ يَحْتَلِمْ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا نے نبی کریم ﷺ سے سینگی لگوانے کی اجازت چاہی۔تو آپ ﷺ نے ابوطیبہ کو فرمایا کہ اسے سینگی لگائے۔راوی نے کہا: میرا خیال ہے کہ سیدنا جابر رضی اللہ عنہ نے بتایا کہ وہ ان کا رضاعی بھائی تھا یا نابالغ لڑکا تھا۔";
abudawood.hukam = "صحیح مسلم (2206)";
abudawood.description = ``;