var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ... بِهَذَا الْحَدِيثِ،زَادَ: وَأَخْرَجَهُ،فَكَانَ بِالْبَيْدَاءِ يَدْخُلُ كُلَّ جُمْعَةٍ يَسْتَطْعِمُ.";
abudawood.urdu = "ابن شہاب (ابن شہاب زہری) عروہ سے،انہوں نے سیدہ عائشہ رضی اللہ عنہا سے یہ حدیث روایت کی۔اس میں مزید یہ ہے کہ اور اسے (مدینہ طیبہ سے) نکال دیا۔چنانچہ وہ مقام بیداء میں رہتا تھا اور ہر جمعہ آتا اور کھانے پینے کی چیزیں مانگ کے لے جایا کرتا تھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4107)`;