var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا عُمَرُ عَنِ الْأَوْزَاعِيِّ... فِي هَذِهِ الْقِصَّةِ. فَقِيلَ: يَا رَسُولَ اللَّهِ! إِنَّهُ إِذَنْ يَمُوتُ مِنَ الْجُوعِ! فَأَذِنَ لَهُ أَنْ يَدْخُلَ فِي كُلِّ جُمْعَةٍ مَرَّتَيْنِ،فَيَسْأَلُ ثُمَّ يَرْجِعُ.";
abudawood.urdu = "جناب اوزاعی نے اس قصے میں بیان کیا کہ کہا گیا: اے اللہ کے رسول! (اگر اسے گھروں سے روک دیا گیا تو) یہ بھوک سے مر جائے گا۔تو آپ ﷺ نے اسے اجازت دی کہ ہر ہفتے دو بار آ جایا کرے،لوگوں سے سوال کرے اور لوٹ جایا کرے۔اگر کسی آدمی کی باقاعہ کفالت کا اہتمام نہ ہو تو اسےمانگ کر گزارہ کرنے کی اجازت ہے مگر فحاشی پھیلانے کی نہیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4107)`;