var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمَيْمُونِ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا زَوَّجَ أَحَدُكُمْ عَبْدَهُ أَمَتَهُ فَلَا يَنْظُرْ إِلَى عَوْرَتِهَا";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے وہ اپنے دادا سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’تم میں سے جب کوئی اپنے غلام کی اپنی باندی سے شادی کر دے تو اب اس باندی کے ستر کی طرف نہ دیکھے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث الآتي (4114)`;