var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ وَهْبٍ مَوْلَى أَبِي أَحْمَدَ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ تَخْتَمِرُ فَقَالَ لَيَّةً لَا لَيَّتَيْنِ قَالَ أَبُو دَاوُد مَعْنَى قَوْلِهِ لَيَّةً لَا لَيَّتَيْنِ يَقُولُ لَا تَعْتَمُّ مِثْلَ الرَّجُلِ لَا تُكَرِّرُهُ طَاقًا أَوْ طَاقَيْنِ";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا کا بیان ہے کہ نبی کریم ﷺ اس کے ہاں آئے اور وہ سر پر اوڑھنی لپیٹ رہی تھیں۔تو آپ ﷺ نے فرمایا ’’ایک بل دو،دو نہیں۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں: اس کا مفہوم یہ ہے کہ اوڑھنی کو اس طرح مت لپیٹے کہ مردوں کی پگڑی محسوس ہو۔کپڑے کو دو بل مت دے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حبیب عنعن وشیخہ وہب مولی أبي أحمد : مجہول (تقریب التہذیب: 7486)`;
abudawood.anwaar = [146,1];