var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ،عَنْ أَبِيهِ،عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ أَنَّهَا أَخْبَرَتْهُ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ ذَكَرَ الْإِزَارَ: فَالْمَرْأَةُ يَا رَسُولَ اللَّهِ؟ قَالَ: تُرْخِي شِبْرًا،قَالَتْ أُمُّ سَلَمَةَ: إِذًا يَنْكَشِفُ عَنْهَا! قَالَ: فَذِرَاعًا،لَا تَزِيدُ عَلَيْهِ.";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ نے جب تہبند کا ذکر کیا تو سیدہ ام سلمہ رضی اللہ عنہا نے عورت کے متعلق پوچھا کہ وہ اسے کس قدر لمبا کرے؟ آپ ﷺ نے فرمایا ’’ایک بالشت لٹکا لے۔‘‘ سیدہ ام سلمہ رضی اللہ عنہا نے کہا: اس سے تو اس کے پاؤں ننگے ہوں گے۔آپ ﷺ نے فرمایا ’’ایک ہاتھ لٹکا لے اور اس سے زیادہ نہ کرے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4334)
رواہ النسائي (5340 وسندہ صحیح)`;