var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،أَخْبَرَنَا عِيسَى،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ،عَنْ أُمِّ سَلَمَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ.\nقَالَ أَبُو دَاوُد: رَوَاهُ ابْنُ إِسْحَاقَ وَأَيُّوبُ بْنُ مُوسَى،عَنْ نَافِعٍ،عَنْ صَفِيَّةَ.";
abudawood.urdu = "نافع نے سلیمان بن یسار سے ‘ انہوں نے سیدہ ام سلمہ رضی اللہ عنہا سے انہوں نے نبی کریم ﷺ سے یہی حدیث بیان کی ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ یہ روایت ابن اسحاق اور ایوب بن موسیٰ نے بواسطہ نافع سیدہ صفیہ رضی اللہ عنہا سے بیان کی ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انظر الحدیث السابق (4117)`;