var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ أَخْبَرَنِي زَيْدٌ الْعَمِّيُّ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ ابْنِ عُمَرَ قَالَ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُمَّهَاتِ الْمُؤْمِنِينَ فِي الذَّيْلِ شِبْرًا ثُمَّ اسْتَزَدْنَهُ فَزَادَهُنَّ شِبْرًا فَكُنَّ يُرْسِلْنَ إِلَيْنَا فَنَذْرَعُ لَهُنَّ ذِرَاعًا";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے امہات المؤمنین کو اجازت دی کہ اپنی چادروں کے پلو ایک بالشت لمبے رکھا کریں۔پھر انہوں نے مزید لمبے کرنے کی اجازت چاہی تو آپ ﷺ نے ایک اور بالشت بڑھانے کا فرمایا۔چنانچہ وہ ہمیں اس کا کہتیں تو ہم ان کے لیے ان چادروں کے پلو ایک ایک ہاتھ لمبے رکھتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3581)<br>زید العمي : ضعیف (تق : 2131) وقال الھیثمي : وضعفہ الجمھور (مجمع الزوائد 10 / 110)<br>والحدیث السابق (الأصل : 4117) یغني عنہ`;
abudawood.anwaar = [146,1];