var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ حَدَّثَنِي ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ مِنْ الْعَصْرِ رَكْعَةً قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَ وَمَنْ أَدْرَكَ مِنْ الْفَجْرِ رَكْعَةً قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے سورج غروب ہونے سے پہلے عصر کی ایک رکعت پا لی،اس نے نماز پا لی،اور جس نے سورج طلوع ہونے سے پہلے فجر کی ایک رکعت پا لی اس نے نماز پا لی۔‘‘";
abudawood.hukam = "صحیح مسلم (608)";
abudawood.description = ``;