var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَزِيدُ،حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ... بِهَذَا الْحَدِيثِ،لَمْ يَذْكُرْ مَيْمُونَةَ،قَالَ: فَقَالَ: أَلَا انْتَفَعْتُمْ بِإِهَابِهَا... ثُمَّ ذَكَرَ مَعْنَاهُ،لَمْ يَذْكُرِ الدِّبَاغَ.";
abudawood.urdu = "معمر نے بواسطہ زہری بیان کیا ‘ (لیکن) زہری کی اس حدیث کی سند میں سیدہ میمونہ رضی اللہ عنہا کا ذکر نہیں ہے۔اس میں ہے کہ رسول اللہ ﷺ نے فرمایا ’’تم نے اس کے چمڑے سے فائدہ کیوں نہیں اٹھایا؟‘‘ اور اس میں رنگنے کا ذکر نہیں کیا۔";
abudawood.hukam = "صحیح بخاری (1492) صحیح مسلم (363)";
abudawood.description = ``;