var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ قَالَ مَعْمَرٌ وَكَانَ الزُّهْرِيُّ يُنْكِرُ الدِّبَاغَ وَيَقُولُ يُسْتَمْتَعُ بِهِ عَلَى كُلِّ حَالٍ قَالَ أَبُو دَاوُد لَمْ يَذْكُرْ الْأَوْزَاعِيُّ وَيُونُسُ وَعُقَيْلٌ فِي حَدِيثِ الزُّهْرِيِّ الدِّبَاغَ وَذَكَرَهُ الزُّبَيْدِيُّ وَسَعِيدُ بْنُ عَبْدِ الْعَزِيزِ وَحَفْصُ بْنُ الْوَلِيدِ ذَكَرُوا الدِّبَاغَ";
abudawood.urdu = "معمر کہتے ہیں کہ جناب (ابن شہاب زہری) زہری رحمہ اللہ (حلال جانور کے چمڑے کو) رنگنے کا انکار کرتے تھے۔ان کا کہنا تھا کہ ہر حال میں فائدہ اٹھانا جائز ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ زہری کی اس روایت میں اوزاعی ‘ یونس اور عقیل نے رنگنے کا ذکر نہیں کیا۔جبکہ زبیدی نے اس کا ذکر کیا ہے۔ایسے ہی سعید بن عبدالعزیز اور حفص بن ولید نے بھی رنگنے کا ذکر کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مسند أحمد (1/ 365)<br>عبدالرزاق لم یصرح بالسماع<br>والحدیث المرفوع صحیح`;
abudawood.anwaar = [146,1];