var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا دُبِغَ الْإِهَابُ فَقَدْ طَهُرَ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے،وہ کہتے کہمیں نے رسول اللہ ﷺ سے سنا ‘ آپ ﷺ فرماتے تھے ’’چمڑے کو جب رنگ لیا جائے تو وہ پاک ہو جاتا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (366)";
abudawood.description = ``;