var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ أُمِّهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ رسول اللہ ﷺ نے حکم دیا کہ مردار کے چمڑے سے فائدہ اٹھایا جائے۔(یعنی) جب اسے رنگ لیا جائے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (509)
أخرجہ ابن ماجہ (3612 وسندہ حسن) والنسائي (4257 وسندہ حسن) أم محمد بن عبد الرحمٰن بن ثوبان: وثقھا ابن حبان و ابن عبد البر و یعقوب بن سفیان الفارسي (المعرفۃ والتاریخ1/ 349، 350، 425) فالسند حسن`;