var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُوسَى بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ أَتَى عَلَى بَيْتٍ فَإِذَا قِرْبَةٌ مُعَلَّقَةٌ فَسَأَلَ الْمَاءَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ فَقَالَ دِبَاغُهَا طُهُورُهَا";
abudawood.urdu = "سیدنا سلمہ بن محبق رضی اللہ عنہ سے روایت ہے کہ غزوہ تبوک کے موقع پر رسول اللہ ﷺ ایک گھر میں آئے تو ایک مشکیزہ لٹکے دیکھا۔تو آپ ﷺ نے پانی طلب فرمایا: تو انہوں نے کہا: اے اللہ کے رسول! یہ مشکیزہ مردار (جانور کے چمڑے کا) ہے۔آپ ﷺ نے فرمایا ’’اس کو رنگ دیا جانا اس کی پاکیزگی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4248)<br>الحسن البصري مدلس وعنعن<br>والحدیث السابق (الأصل : 4123) یغني عنہ`;
abudawood.anwaar = [146,1];