var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ قَالَ قُرِئَ عَلَيْنَا كِتَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْضِ جُهَيْنَةَ وَأَنَا غُلَامٌ شَابٌّ أَنْ لَا تَسْتَمْتِعُوا مِنْ الْمَيْتَةِ بِإِهَابٍ وَلَا عَصَبٍ";
abudawood.urdu = "جناب عبداللہ بن عکیم سے روایت ہے انہوں نے کہا قبیلہ جہینہ کے علاقے میں ہمیں رسول اللہ ﷺ کا ایک خط پڑھ کر سنایا گیا جبکہ میں نوعمر جوان لڑکا تھا ’’یہ کہ مردار کے چمڑے یا اس کے پٹھوں سے فائدہ مت اٹھاؤ۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (508)
أخرجہ ابن ماجہ (3613 وسندہ حسن) والنسائي (4254 وسندہ حسن) من حدیث شعبۃ عن الحکم بہ والحکم صرح بالسماع عند أحمد (4/311 وسندہ حسن)`;