var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ أَبِي الْمُعْتَمِرِ عَنْ ابْنِ سِيرِينَ عَنْ مُعَاوِيَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَرْكَبُوا الْخَزَّ وَلَا النِّمَارَ قَالَ وَكَانَ مُعَاوِيَةُ لَا يُتَّهَمُ فِي الْحَدِيثِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَنَا أَبُو سَعِيدٍ قَالَ لَنَا أَبُو دَاوُدَ أَبُو الْمُعْتَمِرِ اسْمُهُ يَزِيدُ بْنُ طَهْمَانَ كَانَ يَنْزِلُ الْحِيَرَةَ";
abudawood.urdu = "سیدنا معاویہ رضی اللہ عنہ سے روایت ہے،کہا کہ رسول اللہ ﷺ نے فرمایا ’’خز (ریشم) کے کپڑے اور چیتے کی کھال کو اپنی گدی مت بناؤ۔‘‘ (انہیں بطور زین یا زین پوش استعمال نہ کرو۔) ابن سیرین نے کہا: سیدنا معاویہ رضی اللہ عنہ رسول اللہ ﷺ سے روایت حدیث میں متہم نہیں تھے۔(ان کی سیاسی آراء سے کسی کو اختلاف ہو تو الگ بات ہے ورنہ فرامین رسول ﷺ کے نقل میں نہایت قابل اعتماد تھے)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4357)
أخرجہ ابن ماجہ (3656 وسندہ حسن)`;