var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانُ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جِلْدُ نَمِرٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جس جماعت میں چیتے کی کھال ہو اس کے ساتھ (رحمت کے) فرشتے نہیں چلتے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [146,1];