var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ أَنَّ يَحْيَى بْنَ سَعِيدٍ وَإِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَاهُمْ الْمَعْنَى عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ جُلُودِ السِّبَاعِ";
abudawood.urdu = "جناب ابوملیح بن اسامہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے درندوں کی کھالیں استعمال کرنے سے منع فرمایا ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (506)
ولہ شاھد حسن عند البیھقي (1/21)`;