var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَقَالَ أَكْثِرُوا مِنْ النِّعَالِ فَإِنَّ الرَّجُلَ لَا يَزَالُ رَاكِبًا مَا انْتَعَلَ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے انہوں نے کہا ہم ایک سفر میں نبی کریم ﷺ کے ساتھ تھے۔آپ ﷺ نے فرمایا ’’جوتے خوب پہنا کرو،بلاشبہ آدمی جب تک جوتا پہنے ہو تو (گویا) وہ سوار ہوتا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2096)";
abudawood.description = `ورواہ مسلم (3096) نحو المعنیٰ`;