var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى أَخْبَرَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے منع فرمایا کہ آدمی کھڑے ہو کر جوتا پہنے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>أبو الزبیر عنعن<br>وللحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [146,1];