var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْشِي أَحَدُكُمْ فِي النَّعْلِ الْوَاحِدَةِ لِيَنْتَعِلْهُمَا جَمِيعًا أَوْ لِيَخْلَعْهُمَا جَمِيعًا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’کوئی شخص ایک جوتے میں مت چلے،چاہیئے کہ دونوں پہنے یا دونوں اتار دے۔‘‘";
abudawood.hukam = "صحیح بخاری (5855) صحیح مسلم (2097)";
abudawood.description = ``;