var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا انْقَطَعَ شِسْعُ أَحَدِكُمْ فَلَا يَمْشِ فِي نَعْلٍ وَاحِدَةٍ حَتَّى يُصْلِحَ شِسْعَهُ وَلَا يَمْشِ فِي خُفٍّ وَاحِدٍ وَلَا يَأْكُلْ بِشِمَالِهِ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کسی کے جوتے کا تسمہ ٹوٹ جائے تو جب تک اسے درست نہ کر لے ایک جوتے میں نہ چلے،نہ ایک موزے میں چلے اور نہ بائیں ہاتھ سے کھائے۔“";
abudawood.hukam = "صحیح مسلم (2099)";
abudawood.description = ``;