var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى حَدَّثَنَا عبْدُ اللَّهِ بْنُ هَارُونَ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ أَبِي نَهِيكٍ عَنْ ابْنِ عَبَّاسٍ قَالَ مِنْ السُّنَّةِ إِذَا جَلَسَ الرَّجُلُ أَنْ يَخْلَعَ نَعْلَيْهِ فَيَضَعَهُمَا بِجَنْبِهِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے انہوں نے کہا کہ سنت یہ ہے کہ آدمی جب بیٹھے تو اپنے جوتے اتار لے اور اپنے پہلو میں رکھ لے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن ہارون حجازي :مجہول (تق : 3674)`;
abudawood.anwaar = [147,1];