var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ وَلْتَكُنْ الْيَمِينُ أَوَّلَهُمَا يَنْتَعِلُ وَآخِرَهُمَا يَنْزِعُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی جوتا پہنے تو دائیں (طرف) سے ابتداء کرے اور جب اتارے تو بائیں سے شروع کرے،دایاں پاؤں پہننے میں پہلے اور اتارنے میں آخری ہونا چاہیئے۔“";
abudawood.hukam = "صحیح بخاری (5856) صحیح مسلم (2097)";
abudawood.description = ``;