var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَبِسْتُمْ وَإِذَا تَوَضَّأْتُمْ فَابْدَءُوا بِأَيَامِنِكُمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم لباس پہنو یا وضو کرو تو اپنی دائیں جانب سے شروع کیا کرو۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (402)<br>الأعمش مدلس وعنعن في ھذا اللفظورواہ الترمذي (1766) من حدیث شعبۃ عن الأعمش بہ بلفظ ’’ کان إذا لبس ثوبًا بدأبمیا منہ‘‘ وسندہ صحیح`;
abudawood.anwaar = [147,1];