var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الْهَمْدَانِيُّ الرَّمْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ أَبِي هَانِيءٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفُرُشَ فَقَالَ فِرَاشٌ لِلرَّجُلِ وَفِرَاشٌ لِلْمَرْأَةِ وَفِرَاشٌ لِلضَّيْفِ وَالرَّابِعُ لِلشَّيْطَانِ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے بستروں کا ذکر کیا،تو فرمایا ’’ایک بستر آدمی کا،دوسرا بیوی کا اور تیسرا مہمان کا ہے اور چوتھا شیطان کے لیے ہے۔“";
abudawood.hukam = "صحیح مسلم (2084)";
abudawood.description = ``;