var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ إِسْحَقَ بْنِ سَعِيدِ بْنِ عَمْرٍو الْقُرَشِيِّ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ أَنَّهُ رَأَى رُفْقَةً مِنْ أَهْلِ الْيَمَنِ رِحَالُهُمْ الْأَدَمُ فَقَالَ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى أَشْبَهِ رُفْقَةٍ كَانُوا بِأَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيَنْظُرْ إِلَى هَؤُلَاءِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے یمن سے آئے ہوئے کچھ رفقائے سفر کو دیکھا جن کی سواریوں کے پالان چمڑے کے تھے،تو انہوں نے کہا: جو شخص چاہتا ہے کہ ایسے لوگوں کو دیکھے جو رسول اللہ ﷺ کے رفقائے سفر کے بہت زیادہ مشابہ ہوں تو وہ انہیں دیکھ لے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;