var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَّخَذْتُمْ أَنْمَاطًا قُلْتُ وَأَنَّى لَنَا الْأَنْمَاطُ قَالَ أَمَا إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے،وہ کہتے ہیں کہ رسول اللہ ﷺ نے مجھ سے پوچھا ’’کیا تمہارے انماط (حاشیہ دار بستر یا ان کی چادریں) ہیں؟‘‘ میں نے عرض کیا: ہمارے لیے انماط کہاں؟ آپ ﷺ نے فرمایا ’’عنقریب تم انماط (خوبصورت نفیس حاشیہ دار بستر یا چادریں) حاصل کرو گے۔‘‘";
abudawood.hukam = "صحیح بخاری (5161) صحیح مسلم (2083)";
abudawood.description = ``;