var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَأَحْمَدُ بْنُ مَنِيعٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ وِسَادَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ مَنِيعٍ الَّتِي يَنَامُ عَلَيْهَا بِاللَّيْلِ ثُمَّ اتَّفَقَا مِنْ أَدَمٍ حَشْوُهَا لِيفٌ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ کا ایک تکیہ تھا۔ابن منیع نے کہا: تکیہ چمڑے کا تھا جس پر آپ ﷺ رات کو سوتے تھے،پھر روایت کے اگلے الفاظ بیان کرنے میں دونوں راوی متفق ہیں۔اس میں کھجور کی چھال بھری ہوئی تھی۔";
abudawood.hukam = "صحیح مسلم (2082)";
abudawood.description = ``;