var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا الْوَلِيدُ،قَالَ: قَالَ أَبُو عَمْرٍو يَعْنِي الْأَوْزَاعِيَّ: وَذَلِكَ أَنْ تَرَى مَا عَلَى الْأَرْضِ مِنَ الشَّمْسِ صَفْرَاءَ";
abudawood.urdu = "ابوعمرو یعنی اوزاعی نے بیان کیا کہ نماز عصر فوت ہونے سے مراد اتنی تاخیر ہے کہ زمین پر پڑی چیزیں دھوپ کے باعث زرد نظر آنے لگیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الولید بن مسلم عنعن وھو مدلس (طبقات المدلسین: 127/ 4)`;
abudawood.anwaar = [28,1];