var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى حَدَّثَنَا عِمْرَانُ بْنُ حِطَّانَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتْرُكُ فِي بَيْتِهِ شَيْئًا فِيهِ تَصْلِيبٌ إِلَّا قَضَبَهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ گھر میں کوئی بھی چیز دیکھتے جس پر صلیب کا نشان ہوتا تو اسے کاٹ ڈالتے تھے۔";
abudawood.hukam = "صحیح بخاری (5952)";
abudawood.description = ``;