var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ صُورَةٌ وَلَا كَلْبٌ وَلَا جُنُبٌ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’جس گھر میں تصویر یا کتا یا جنبی ہو ‘ اس میں فرشتے داخل نہیں ہوتے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ ابن ماجہ (3650 وسندہ حسن) والنسائي (262 وسندہ حسن) وانظر الحدیث السابق (227)`;