var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ سُهَيْلٍ... بِإِسْنَادِهِ مِثْلِهِ،قَالَ: فَقُلْتُ: يَا أُمَّهْ! إِنَّ هَذَا حَدَّثَنِي،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ. وَقَالَ فِيهِ: سَعِيدُ بْنُ يَسَارٍ-مَوْلَى بَنِي النَّجَّارِ-.";
abudawood.urdu = "جریر نے سہیل سے اپنی سند سے اسی مذکورہ حدیث کی مثل روایت کیا۔اس میں ہے کہ زید بن خالد نے کہا: میری اماں جان! (ابوطلحہ انصاری) نے مجھے نبی کریم ﷺ سے یہ حدیث بیان کی ہے۔اس روایت کی سند میں سعید بن یسار کے متعلق ہے کہ یہ بنو نجار کے غلام تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4153)`;