var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ هِشَامِ بْنِ حَسَّانَ عَنِ الْحَسَنِ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّرَجُّلِ إِلَّا غِبًّا.";
abudawood.urdu = "سیدنا عبداللہ مغفل رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے کنگھی کرنے سے منع فرمایا ہے سوائے اس کے ایک دن چھوڑ کر ہو۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (756 ا) نسائی (5058)<br>ھشام بن حسان مدلس وعنعن<br>وحدیث النسائي (8/ 132 ح 5061 وسندہ صحیح) یغني عنہ`;
abudawood.anwaar = [147,1];