var abudawood = {};
abudawood.arabic = "حَدَّثَنَا دَاوُدُ بْنُ شَبِيبٍ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كُنَّا نُصَلِّي الْمَغْرِبَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ نَرْمِي فَيَرَى أَحَدُنَا مَوْضِعَ نَبْلِهِ";
abudawood.urdu = "جناب ثابت بنانی نے،سیدنا انس بن مالک رضی اللہ عنہ سے روایت کیا وہ بیان کرتے ہیں کہ ہم مغرب کی نماز نبی کریم ﷺ کے ساتھ پڑھتے تھے پھر تیر پھینکتے تو ہم میں سے ایک اس کے گرنے کی جگہ کو دیکھ رہا ہوتا تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;