var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،حَدَّثَنَا أَبُو أَحْمَدَ،عَنْ شَيْبَانَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ،عَنْ مُوسَى بْنِ أَنَسٍ،عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: كَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُكَّةٌ يَتَطَيَّبُ مِنْهَا.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ کے پاس ایک خاص مرکب خوشبو تھی آپ ﷺ اس سے خوشبو لگایا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4444)
أخرجہ الترمذي فی الشمائل بتحقیقي (215 وسندہ حسن)`;