var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ عَلِيِّ بْنِ الْمُبَارَكِ قَالَ حَدَّثَتْنِي كَرِيمَةُ بِنْتُ هَمَّامٍ،أَنَّ امْرَأَةً أَتَتْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،فَسَأَلَتْهَا عَنْ خِضَابِ الْحِنَّاءِ،فَقَالَتْ: لَا بَأْسَ بِهِ،وَلَكِنْ أَكْرَهُهُ, كَانَ حَبِيبِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ رِيحَهُ. قَالَ أَبُو دَاوُد: تَعْنِي: خِضَابَ شَعْرِ الرَّأْسِ.";
abudawood.urdu = "کریمہ بنت ہمام بیان کرتی ہیں کہ ایک عورت نے سیدہ عائشہ رضی اللہ عنہا سے مہندی کے متعلق پوچھا تو انہوں نے جواب دیا: اس میں کوئی حرج نہیں لیکن میں اسے ناپسند کرتی ہوں ‘ کیونکہ میرے حبیب ﷺ کو اس کو بو ناپسند تھی۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ اس عورت کا مقصد سر کے بالوں کو مہندی لگانا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (5093)<br>کریمۃ : لم أجد من و ثقہا وقال الحافظ : مقبولۃ (تق : 8673) أي مجہولۃ الحال`;
abudawood.anwaar = [147,1];