var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَتْنِي غِبْطَةُ بِنْتُ عَمْرٍو الْمُجَاشِعِيَّةُ قَالَتْ حَدَّثَتْنِي عَمَّتِي أُمُّ الْحَسَنِ،عَنْ جَدَّتِهَا،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،أَنَّ هِنْدَ بِنْتَ عُتْبَةَ قَالَتْ: يَا نَبِيَّ اللَّهِ! بَايِعْنِي،قَالَ: لَا أُبَايِعُكِ حَتَّى تُغَيِّرِي كَفَّيْكِ،كَأَنَّهُمَا كَفَّا سَبُعٍ!.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ ہند بنت عتبہ نے کہا: اے اللہ کے نبی! مجھ سے بیعت لے لیجئیے! آپ ﷺ نے فرمایا ’’میں اس وقت تک تمہاری بیعت نہیں لوں گا جب تک کہ تم اپنی ہتھیلیوں کو رنگ نہ لو ‘ یہ تو گویا درندے کی ہتھیلیاں ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قال الحافظ ابن حجر في غبطۃ و أم الحسن وجدتھا : ’’ وفي إسنادہ مجہولات ثلاث‘‘ (التلخیص الحبیر 236/2)`;
abudawood.anwaar = [148,1];