var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ،قَالَا: حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ،قَالَ: حَدَّثَنِي نَافِعٌ،عَنْ عَبْدِ اللَّهِ،قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ،وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے لعنت فرمائی ہے اس عورت پر جو کسی کے بالوں میں بال جوڑے اور اس عورت پر جو یہ کام کروائے ‘ اور اس عورت پر جو جسم گودے اور اس پر جو اپنا جسم گدوائے۔";
abudawood.hukam = "صحیح بخاری (5947) صحیح مسلم (2124)";
abudawood.description = ``;