var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ صَفْوَانَ بْنِ عِيسَى عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْمَغْرِبَ سَاعَةَ تَغْرُبُ الشَّمْسُ إِذَا غَابَ حَاجِبُهَا";
abudawood.urdu = "سیدنا سلمہ بن اکوع رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ سورج غروب ہوتے ہی نماز پڑھ لیا کرتے تھے یعنی جب اس کی ٹکیہ غائب ہو جاتی تھی۔";
abudawood.hukam = "صحیح بخاری (561) صحیح مسلم (636)";
abudawood.description = ``;