var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ،قَالَ:،حَدَّثَنَا شَرِيَكٌ،عَنْ سَالِمٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،قَالَ: لَا بَأْسَ بِالْقَرَامِلِ. قَالَ أَبُو دَاوُد: كَأَنَّهُ يَذْهَبُ إِلَى أَنَّ الْمَنْهِيَّ عَنْهُ شُعُورُ النِّسَاءِ. قَالَ أَبُو دَاوُد: كَانَ أَحْمَدُ يَقُولُ: الْقَرَامِلُ لَيْسَ بِهِ بَأْسٌ.";
abudawood.urdu = "جناب سعید بن جبیر رحمہ اللہ نے کہا کہ دھاگوں سے بنی چوٹی (موباف) میں کوئی حرج نہیں۔امام ابوداؤد رحمہ اللہ نے کہا کہ گویا سعید رحمہ اللہ کی رائے یہ تھی کہ بالخصوص عورتوں کے بال (اور بال لگا کر) جوڑنا ہی منع ہے۔امام ابوداؤد رحمہ اللہ نے کہا: اور ایسے ہی امام احمد رحمہ اللہ کہتے تھے کہ دھاگوں کی چوٹی کا کوئی حرج نہیں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شریک عنعن`;
abudawood.anwaar = [148,1];