var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْمَعْنَى أَنَّ أَبَا عَبْدِ الرَّحْمَنِ الْمُقْرِئَ حَدَّثَهُمْ،عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ عُرِضَ عَلَيْهِ طِيبٌ فَلَا يَرُدَّهُ, فَإِنَّهُ طَيِّبُ الرِّيحِ،خَفِيفُ الْمَحْمَلِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جسے خوشبو پیش کی جائے تو وہ اسے واپس نہ کرے۔بلاشبہ اس کی مہک عمدہ ہوتی ہے اور اس میں کوئی بوجھ بھی نہیں ہوتا۔‘‘";
abudawood.hukam = "صحیح مسلم (2253)";
abudawood.description = ``;