var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،أَخْبَرَنَا ثَابِتُ بْنُ عُمَارَةَ،حَدَّثَنِي غُنَيْمُ بْنُ قَيْسٍ،عَنْ أَبِي مُوسَى،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا اسْتَعْطَرَتِ الْمَرْأَةُ،فَمَرَّتْ عَلَى الْقَوْمِ لِيَجِدُوا رِيحَهَا, فَهِيَ كَذَا وَكَذَا.-قَالَ قَوْلًا شَدِيدًا.";
abudawood.urdu = "سیدنا ابوموسیٰ روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جب کوئی عورت خوشبو لگا کر کسی قوم پر سے گزرتی ہے تاکہ وہ اس کی خوشبو پا لیں تو وہ ایسی اور ایسی ہے۔‘‘ آپ ﷺ نے بڑی سخت بات فرمائی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1065)
أخرجہ الترمذي (2786 وسندہ حسن) ورواہ النسائي (5129 وسندہ حسن)`;