var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ وَسَعِيدُ بْنُ مَنْصُورٍ،قَالَا: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَلْقَمَةَ،قَالَ: حَدَّثَنِي يَزِيدُ بْنُ خُصَيْفَةَ،عَنْ بُسْرِ بْنِ سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا, فَلَا تَشْهَدَنَّ مَعَنَا الْعِشَاءَ. قَالَ ابْنُ نُفَيْلٍ: عِشَاءَ الْآخِرَةِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے روایت کیا کہ رسول اللہ ﷺ نے فرمایا ’’جس عورت نے خوشبو کی دھونی لی ہو ‘ وہ ہمارے ساتھ عشاء کی نماز میں شریک نہ ہو۔‘‘ ابن نفیل نے «عشاء الآخرۃ» کے لفظ روایت کیے۔";
abudawood.hukam = "صحیح مسلم (444)";
abudawood.description = ``;