var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ الْأَسَدِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ابْنِ الزُّبَيْرِ الْأَسَدِيُّ،حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ عَنِ الرَّبِيعِ بْنِ أَنَسٍ،عَنْ جَدَّيْهِ قَالَا سَمِعْنَا أَبَا مُوسَى،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَقْبَلُ اللَّهُ تَعَالَى صَلَاةَ رَجُلٍ فِي جَسَدِهِ شَيْءٌ مِنْ خَلُوقٍ. قَالَ أَبُو دَاوُد: جَدَّاهُ زَيْدٌ وَزِيَادٌ.";
abudawood.urdu = "سیدنا ابوموسیٰ رضی اللہ عنہ بیان کرتے تھے کہ رسول اللہ ﷺ نے فرمایا ’’اﷲ تعالیٰ اس آدمی کی نماز قبول نہیں فرماتا جس کے جسم پر معمولی سی خلوق بھی لگی ہو۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں سند میں وارد ربیع بن انس کے نانا دادا سے مراد زید اور زیاد ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>زید وزیاد جدا الربیع بن أنس : مجہولان (تق : 2166،2110)`;
abudawood.anwaar = [148,1];