var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ أَنَّ حَمَّادَ بْنَ زَيْدٍ وَإِسْمَاعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَاهُمْ،عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ،عَنْ أَنَسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّزَعْفُرِ لِلرِّجَالِ. وَقَالَ عَنْ إِسْمَاعِيلَ أَنْ يَتَزَعْفَرَ الرَّجُلُ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے،انہوں نے کہا کہ رسول اللہ ﷺ نے منع فرمایا ہے کہ مرد زعفران لگائیں۔اور اسماعیل (اسماعیل بن ابراہیم) سے یہ لفظ مروی ہے <حدیث> «أن یتزعفر الرجل» </حدیث>۔";
abudawood.hukam = "صحیح مسلم (2101)";
abudawood.description = ``;