var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ،حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ،عَنْ جَعْفَرِ بْنِ بُرْقَانَ،عَنْ ثَابِتِ بْنِ الْحَجَّاجِ،عَنْ عَبْدِ اللَّهِ الْهَمْدَانِيِّ عَنِ الْوَلِيدِ بْنِ عُقْبَةَ،قَالَ: لَمَّا فَتَحَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ, جَعَلَ أَهْلُ مَكَّةَ يَأْتُونَهُ بِصِبْيَانِهِمْ،فَيَدْعُو لَهُمْ بِالْبَرَكَةِ وَيَمْسَحُ رُءُوسَهُمْ،قَالَ: فَجِيءَ بِي إِلَيْهِ،وَأَنَا مُخَلَّقٌ،فَلَمْ يَمَسَّنِي مِنْ أَجْلِ الْخَلُوقِ.";
abudawood.urdu = "سیدنا ولید بن عقبہ (ابن ابی معیط) نے کہا کہ جب اﷲ کے نبی نے مکہ فتح کیا تو اہل مکہ اپنے بچوں کو آپ ﷺ کے پاس لانے لگے۔آپ ﷺ ان کے لیے برکت کی دعا فرماتے اور ان کے سروں پر ہاتھ پھیرتے۔مجھے بھی آپ ﷺ کے پاس لایا گیا ‘ مگر مجھ پر خلوق (مرکب زعفران) لگی تھی۔تو آپ ﷺ نے اس وجہ سے میرے سر پر ہاتھ نہ پھیرا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبداﷲ الہمداني :مجہول وخبرہ منکر،قالہ ابن عبدالبر (تق: 3727)`;
abudawood.anwaar = [149,1];