var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،حَدَّثَنَا سَلْمٌ الْعَلَوِيُّ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ رَجُلًا دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ أَثَرُ صُفْرَةٍ،وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَلَّمَا يُوَاجِهُ رَجُلًا فِي وَجْهِهِ بِشَيْءٍ يَكْرَهُهُ،فَلَمَّا خَرَجَ, قَالَ: لَوْ أَمَرْتُمْ هَذَا أَنْ يَغْسِلَ هَذَا عَنْهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک آدمی رسول اللہ ﷺ کے پاس آیا جبکہ اس پر زرد رنگ کا نشان تھا۔اور بہت کم ایسے ہوتا کہ رسول اللہ ﷺ کسی کو کوئی ناپسندیدہ چیز دیکھیں اور براہ راست اسے کچھ کہیں۔جب وہ چلا گیا تو آپ ﷺ نے فرمایا ’’اگر تم اسے کہہ دو کہ اپنے پر سے اسے دھو ڈالے (تو بہت بہتر ہو)۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث الآتی (4789)<br>سلم بن قیس العلوي البصري : ضعیف (تق: 2473)`;
abudawood.anwaar = [149,1];