var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ: كَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شَحْمَةِ أُذُنَيْهِ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ کے بال آپ کے کانوں کی لوؤں تک آتے تھے۔امام ابوداؤد رحمہ اللہ نے کہا: اس میں شعبہ کو وہم ہوا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (5064 وسندہ صحیح) والترمذي فی الشمائل بتحقیقي (29 وسندہ صحیح)`;