var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ نُفَيْلٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوْقَ الْوَفْرَةِ وَدُونَ الْجُمَّةِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ کے بال «وفرۃ» سے زائدہ اور «جمۃ» سے کم ہوتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (1755 وسندہ حسن)`;