var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ،حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ مُحَمَّدٍ يَعْنِي ابْنَ إِسْحَاقَ،قَالَ: حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: كُنْتُ إِذَا أَرَدْتُ أَنْ أَفْرُقَ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, صَدَعْتُ الْفَرْقَ مِنْ يَافُوخِهِ،وَأُرْسِلُ نَاصِيَتَهُ بَيْنَ عَيْنَيْهِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں جب رسول اللہ ﷺ کے بالوں میں مانگ نکالنے لگتی تو آپ ﷺ کے سر کے بیچوں بیچ سے نکالتی اور آپ ﷺ کی پیشانی کے بالوں کو آپ کی آنکھوں کے سامنے لٹکاتی (یعنی پھر انہیں آدھو آدھ کر دیتی)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4447)`;