var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ بَشِيرِ بْنِ ثَابِتٍ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ أَنَا أَعْلَمُ النَّاسِ بِوَقْتِ هَذِهِ الصَّلَاةِ صَلَاةِ الْعِشَاءِ الْآخِرَةِ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهَا لِسُقُوطِ الْقَمَرِ لِثَالِثَةٍ";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ سے روایت ہے،انہوں نے کہا کہ میں سب لوگوں سے بڑھ کر اس نماز یعنی عشاء کے وقت سے باخبر ہوں۔رسول اللہ ﷺ اسے تیسری رات کا چاند ڈوبنے کے وقت پڑھا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (613)`;