var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي نَجِيحٍ،عَنْ مُجَاهِدٍ،قَالَ: قَالَتْ أُمُّ هَانِئٍ: قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ, وَلَهُ أَرْبَعُ غَدَائِرَ.-تَعْنِي: عَقَائِصَ-.";
abudawood.urdu = "سیدہ ام ہانی رضی اللہ عنہا نے بیان کیا کہ نبی کریم ﷺ مکہ تشریف لائے تو ان کے بالوں کی چار لٹیں تھیں جو گوندھی ہوئی تھیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1781) ابن ماجہ (3631)<br>ابن أبي نجیح عنعن<br>وقال البخاري :’’ ولا أعرف لمجاہد سماعًا من أم ھانيء‘‘ (سنن الترمذي : 1781)`;
abudawood.anwaar = [149,1];