var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ قَالَ أَحْمَدُ كَانَ رَجُلًا صَالِحًا قَالَ،أَخْبَرَنَا عُمَرُ بْنُ نَافِعٍ،عَنْ أَبِيهِ عَنِ ابْنِ عُمَرَ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْقَزَعِ.-وَالْقَزَعُ: أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَيُتْرَكَ بَعْضُ شَعْرِهِ-.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے ’’قزع‘‘ سے منع فرمایا ہے۔اور قزع سے مراد یہ ہے کہ بچے کے سر سے کچھ بال مونڈ دیے جائیں اور کچھ چھوڑ دیے جائیں۔";
abudawood.hukam = "صحیح بخاری (5920) صحیح مسلم (2120)";
abudawood.description = ``;