var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،حَدَّثَنَا أَيُّوبُ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْقَزَعِ.-وَهُوَ: أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَتُتْرَكَ لَهُ ذُؤَابَةٌ-.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے ’’قزع‘‘ سے منع فرمایا ہے اور وہ یہ ہے کہ بچے کا سارا سر مونڈ دیا جائے اور کوئی ایک لٹ باقی رکھی جائے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;