var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،حَدَّثَنَا مَعْمَرٌ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ شَعْرِهِ،وَتُرِكَ بَعْضُهُ،فَنَهَاهُمْ عَنْ ذَلِكَ،وَقَالَ: احْلِقُوهُ كُلَّهُ،أَوِ اتْرُكُوهُ كُلَّهُ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے منقول ہے کہ نبی کریم ﷺ نے ایک بچے کو دیکھا کہ اس کے کچھ بال مونڈ دیے گئے تھے اور کچھ چھوڑے ہوئے تھے تو آپ ﷺ نے انہیں اس سے منع فرمایا اور کہا: ’’اس کے سارے بال مونڈ دو یا سارے رکھو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رواہ مسلم (2120) مختصرًا ولم یذکر اللفظ`;