var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،عَنْ مَيْمُونِ بْنِ عَبْدِ اللَّهِ،عَنْ ثَابِتٍ الْبُنَانِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَتْ لِي ذُؤَابَةٌ فَقَالَتْ لِي أُمِّي لَا أَجُزُّهَا: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُدُّهَا وَيَأْخُذُ بِهَا.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ میری لمبی لمبی زلفیں تھیں۔میری والدہ نے مجھ سے کہا: انہیں مت کاٹو،رسول اللہ ﷺ انہیں (پیار سے) کھینچتے تھے اور پکڑ لیا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>میمون بن عبد اللّٰہ عن ثابت : مجہول (تق: 7048) أو لعلہ میمون بن أبان مستور (أیضًا : 7042)`;
abudawood.anwaar = [149,1];