var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ،يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْفِطْرَةُ خَمْسٌ-أَوْ خَمْسٌ مِنَ الْفِطْرَةِ-: الْخِتَانُ،وَالِاسْتِحْدَادُ،وَنَتْفُ الْإِبِطِ،وَتَقْلِيمُ الْأَظْفَارِ،وَقَصُّ الشَّارِبِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ ’’فطری امور پانچ ہیں‘‘ یا فرمایا کہ ’’پانچ باتیں فطرت سے ہیں: ختنہ کرانا ‘ زیر ناف کی صفائی ‘ بغلوں کے بال اکھیڑنا ‘ ناخن تراشنا اور مونچھیں کتروانا۔‘‘";
abudawood.hukam = "صحیح بخاری (5889) صحیح مسلم (257)";
abudawood.description = ``;