var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِإِحْفَاءِ الشَّوَارِبِ،وَإِعْفَاءِ اللِّحَى.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ بلاشبہ رسول اللہ ﷺ نے مونچھیں مونڈوانے اور ڈاڑھیاں بڑھانے کا حکم دیا ہے۔";
abudawood.hukam = "صحیح بخاری (5892، 5893) صحیح مسلم (259)";
abudawood.description = ``;