var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ نُفَيْلٍ،حَدَّثَنَا زُهَيْرٌ قَرَأْتُ عَلَى عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ وَقَرَأَهُ عَبْدُ الْمَلِكِ عَلَى أَبِي الزُّبَيْرِ وَرَوَاهُ أَبُو الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: كُنَّا نُعْفِي السِّبَالَ إِلَّا فِي حَجٍّ أَوْ عُمْرَةٍ. قَالَ أَبُو دَاوُد: الِاسْتِحْدَادُ: حَلْقُ الْعَانَةِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ ہم لوگ حج اور عمرے کے علاوہ ڈاڑھیوں کو چھوڑا رکھتے تھے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ «الاستحداد» کا مفہوم زیر ناف بالوں کی صفائی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الزبیر عنعن`;
abudawood.anwaar = [149,1];