var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ وَسُلَيْمَانَ بْنِ يَسَارٍ،عَنْ أَبِي هُرَيْرَةَ،يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِنَّ الْيَهُودَ وَالنَّصَارَى،لَا يَصْبُغُونَ, فَخَالِفُوهُمْ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’یہودی اور عیسائی اپنے بالوں کو نہیں رنگتے پس تم ان کی مخالفت کیا کرو (یعنی رنگا کرو)۔‘‘";
abudawood.hukam = "صحیح بخاری (5899) صحیح مسلم (2103)";
abudawood.description = ``;