var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ،قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ،حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: أُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ،وَرَأْسُهُ وَلِحْيَتُهُ كَالثَّغَامَةِ بَيَاضًا،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: غَيِّرُوا هَذَا بِشَيْءٍ،وَاجْتَنِبُوا السَّوَادَ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ فتح مکہ کے روز (سیدنا ابوبکر رضی اللہ عنہ کے والد) ابوقحافہ کو لایا گیا تو ان کے سر اور ڈاڑھی کے بال ثغامہ بوٹی کی مانند سفید تھے تو رسول اللہ ﷺ نے فرمایا ’’انہیں کسی رنگ سے بدل دو اور سیاہی سے بچو۔‘‘";
abudawood.hukam = "صحیح مسلم (2102)";
abudawood.description = ``;