var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،حَدَّثَنَا مَعْمَرٌ،عَنْ سَعِيدٍ الْجُرَيْرِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ،عَنْ أَبِي الْأَسْوَدِ الدِّيْلِيِّ،عَنْ أَبِي ذَرٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ هَذَا الشَّيْبُ: الْحِنَّاءُ وَالْكَتَم.";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’تحقیق سب سے بہتر چیز جس سے یہ سفید بال رنگے جاتے ہیں مہندی اور کتم ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4451)
سماع معمر من الجریري قبل اختلاطہ`;