var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،حَدَّثَنَا ابْنُ إِدْرِيسَ،قَالَ: سَمِعْتُ ابْنَ أَبْجَرَ،عَنْ إِيَادِ بْنِ لَقِيطٍ،عَنْ أَبِي رِمْثَةَ... فِي هَذَا الْخَبَرِ. قَالَ: فَقَالَ لَهُ أَبِي: أَرِنِي هَذَا الَّذِي بِظَهْرِكَ, فَإِنِّي رَجُلٌ طَبِيبٌ؟ قَالَ: اللَّهُ الطَّبِيبُ،بَلْ أَنْتَ رَجُلٌ رَفِيقٌ, طَبِيبُهَا الَّذِي خَلَقَهَا.";
abudawood.urdu = "ایاد بن لقیط نے سیدنا ابورمثہ رضی اللہ عنہ سے یہ حدیث بیان کی،انہوں نے کہا کہ میرے والد نے آپ ﷺ سے عرض کیا: یہ جو آپ کی کمر پر ہے مجھے دکھائیں ‘ میں طبیب (معالج) ہوں۔آپ ﷺ نے فرمایا ’’طبیب تو اللہ ہے ‘ تم رفیق (تسلی دینے والے اور نرمی کرنے والے) ہو۔طبیب وہ ہے جس نے اسے پیدا کیا ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4065)`;