var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا حَمَّادٌ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ, أَنَّهُ سُئِلَ عَنْ خِضَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟،فَذَكَرَ أَنَّهُ لَمْ يَخْضِبْ،وَلَكِنْ قَدْ خَضَبَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے نبی کریم ﷺ کے خضاب کے بارے میں سوال کیا گیا تو انہوں نے بتایا کہ آپ ﷺ نے اپنے بال نہیں رنگے۔لیکن ابوبکر اور سیدنا عمر رضی اللہ عنہما نے رنگے ہیں۔";
abudawood.hukam = "صحیح بخاری (5895) صحیح مسلم (2341)";
abudawood.description = ``;