var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ أَبُو سُفْيَانَ،حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ،حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ،وَيُصَفِّرُ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِ, وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ سبتی (رنگی ہوئی کھال سے بنے ہوئے) جوتے استعمال کیا کرتے تھے اور اپنی ڈاڑھی کو ورس اور زعفران بھی لگاتے تھے۔چنانچہ سیدنا ابن عمر رضی اللہ عنہما کا بھی یہی عمل تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (5246 وسندہ حسن)`;