var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو تَوْبَةَ،حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَكُونُ قَوْمٌ يَخْضِبُونَ فِي آخِرِ الزَّمَانِ بِالسَّوَادِ, كَحَوَاصِلِ الْحَمَامِ،لَا يَرِيحُونَ رَائِحَةَ الْجَنَّةِ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’آخر زمانے میں ایسے لوگ ہوں گے جو سیاہ رنگ سے اپنے بال رنگیں گے جیسے کبوتروں کے سینے ہوتے ہیں ‘ یہ لوگ جنت کی خوشبو نہیں پائیں گے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4452)
أخرجہ النسائي (5078 وسندہ صحیح) وقال البغوي: ’’عبد الکریم ھو الجزري‘‘ (شرح السنۃ 12/92 ح 3180)`;