var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ الرُّوَاسِيُّ،حَدَّثَنَا عِيسَى،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: أَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكْتُبَ إِلَى بَعْضِ الْأَعَاجِمِ،فَقِيلَ لَهُ: إِنَّهُمْ لَا يَقْرَءُونَ كِتَابًا إِلَّا بِخَاتَمٍ! فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ, وَنَقَشَ فِيهِ: مُحَمَّدٌ رَسُولُ اللَّهِ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے ارادہ کیا کہ عجمی بادشاہوں کو خط لکھیں۔تو آپ ﷺ کو بتایا گیا کہ وہ لوگ مہر کے بغیر خط نہیں پڑھتے۔تو آپ ﷺ نے چاندی کی انگوٹھی بنوائی جس میں یہ کلمات کندہ تھے <عربی> «محمد رسول اللہ» </عربی>۔";
abudawood.hukam = "صحیح بخاری (5872)";
abudawood.description = ``;