var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَحْمَدُ بْنُ صَالِحٍ،قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنِ ابْنِ شِهَابٍ،قَالَ: حَدَّثَنِي أَنَسٌ،قَالَ: كَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ وَرِقٍ, فَصُّهُ حَبَشِيٌّ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم ﷺ کی انگوٹھی چاندی کی تھی اور اس کا نگینہ حبشی تھا۔";
abudawood.hukam = "صحیح بخاری (5868) صحیح مسلم (2094)";
abudawood.description = ``;