var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: كَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ, كُلُّهُ،فَصُّهُ مِنْهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ کی انگوٹھی ساری کی ساری چاندی کی تھی ‘ اس کا نگینہ بھی اسی ہی سے تھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ البخاري (5870) من حدیث حمید عن أنس بہ وصرح بالسماع`;