var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَيُّوبَ بْنِ مُوسَى،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ... فِي هَذَا الْخَبَرِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَنَقَشَ فِيهِ: مُحَمَّدٌ رَسُولُ اللَّهِ،وَقَالَ: لَا يَنْقُشُ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا..., ثُمَّ سَاقَ الْحَدِيثَ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے اس خبر میں بیان کیا کہ نبی کریم ﷺ نے اپنی انگوٹھی میں «محمد رسول اللہ» کے کلمات کندہ کروائے اور فرمایا ’’کوئی شخص میری اس انگوٹھی کے نقش کی طرح اپنی انگوٹھی کا نقش نہ بنوائے۔‘‘ پھر حدیث بیان کی۔";
abudawood.hukam = "صحیح مسلم (2091)";
abudawood.description = ``;