var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ،عَنْ شَرِيكِ بْنِ أَبِي نَمِرَةَ،عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ،عَنْ أَبِيهِ،عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شَرِيكٌ: و أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَتَّمُ فِي يَمِينِهِ.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ نے (مرفوعاً) اور ابوسلمہ بن عبدالرحمٰن نے (مرسلاً) بیان کیا کہ نبی کریم ﷺ انگوٹھی دائیں ہاتھ میں پہنا کرتے تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4392)
أخرجہ النسائي (5206 وسندہ حسن)`;