var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،حَدَّثَنِي أَبِي،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَتَّمُ فِي يَسَارِهِ،وَكَانَ فَصُّهُ فِي بَاطِنِ كَفِّهِ. قَالَ أَبُو دَاوُد: قَالَ ابْنُ إِسْحَاقَ وَأُسَامَةُ يَعْنِي ابْنَ زَيْدٍ،عَنْ نَافِعٍ بِإِسْنَادِهِ فِي يَمِينِهِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ بائیں ہاتھ میں انگوٹھی پہنا کرتے تھے اور اس کا نگینہ اندر ہتھیلی کی جانب ہوا کرتا تھا۔امام ابوداؤد رحمہ اللہ نے کہا کہ ابن اسحاق اور اسامہ بن زید نے نافع سے مذکورہ سند سے یہ روایت کیا: ’’دائیں ہاتھ میں پہنا کرتے تھے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف / شاذ<br>ابن أبي رواد،خالفہ أسامۃ بن زید (مسلم : 2091) وابن إسحاق في متن الحدیث وھو المحفوظ`;
abudawood.anwaar = [150,1];