var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ مَا يُعْرَفْنَ مِنْ الْغَلَسِ";
abudawood.urdu = "۔ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،وہ بیان کرتی ہیں کہ رسول اللہ ﷺ فجر کی نماز پڑھتے (اور اس کے بعد) عورتیں اپنی چادروں میں لپٹی لوٹتیں تو اندھیرے کے باعث پہچانی نہ جاتی تھیں۔";
abudawood.hukam = "صحیح بخاری (867) صحیح مسلم (645)";
abudawood.description = ``;