var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ الْمَعْنَى،قَالَا: حَدَّثَنَا أَبُو الْأَشْهَبِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ أَنَّ جَدَّهُ عَرْفَجَةَ بْنَ أَسْعَدَ قُطِعَ أَنْفُهُ يَوْمَ الْكُلَابِ،فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ،فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَاتَّخَذَ أَنْفًا مِنْ ذَهَبٍ.";
abudawood.urdu = "عبدالرحمٰن بن طرفہ نے بیان کیا کہ معرکہ کلاب میں میرے دادا عرفجہ بن اسعد کی ناک کٹ گئی تھی۔تو انہوں نے چاندی کی بنوائی مگر اس میں بو پڑ گئی ‘ تو نبی کریم ﷺ نے انہیں حکم دیا تو انہوں نے سونے کی ناک بنوا لی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4400)`;