var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَأَبُو عَاصِمٍ،قَالَا: حَدَّثَنَا أَبُو الْأَشْهَبِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ،عَنْ عَرْفَجَةَ بْنِ أَسْعَدَ... بِمَعْنَاهُ: قَالَ يَزِيدُ: قُلْتُ: لِأَبِي الْأَشْهَبِ: أَدْرَكَ عَبْدُ الرَّحْمَنِ ابْنُ طَرَفَةَ جَدَّهُ عَرْفَجَةَ،قَالَ: نَعَمْ.";
abudawood.urdu = "یزید بن ہارون اور ابوعاصم دونوں نے کہا ہمیں ابوالاشہب نے بواسطہ عبدالرحمٰن بن طرفہ سے انہوں نے عرفجہ بن اسعد سے مذکورہ بالا کے ہم معنی روایت کیا۔یزید نے کہا کہ میں نے ابوالاشہب سے پوچھا کیا عبدالرحمٰن بن طرفہ نے اپنے دادا عرفجہ کو پاتا تھا؟ انہوں نے کہا: ہاں۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (4232)`;