var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ مَنْصُورٍ،عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنِ امْرَأَتِهِ،عَنْ أُخْتٍ لِحُذَيْفَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَا مَعْشَرَ النِّسَاءِ! أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ بِهِ؟ أَمَا إِنَّهُ لَيْسَ مِنْكُنَّ امْرَأَةٌ تَحَلَّى ذَهَبًا تُظْهِرُهُ, إِلَّا عُذِّبَتْ بِهِ.";
abudawood.urdu = "سیدنا حذیفہ رضی اللہ عنہ کی ہمشیرہ (فاطمہ یا خولہ) سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اے عورتو! کیا تمہیں زیور بنانے کے لیے چاندی کافی نہیں ہے۔خبردار! جس عورت نے سونے کا زیور پہنا اور اسے ظاہر کیا تو اسے اسی سے عذاب دیا جائے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (5140،5141)<br>امرأۃ ربعي مقبولۃ (تقریب التہذیب: 8795) أي :مجہولۃ الحال،اسم أخت حذیفۃ بن الیمان : فاطمۃ / رضي اللّٰہ عنھما`;
abudawood.anwaar = [150,1];