var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،حَدَّثَنَا إِسْمَاعِيلُ،حَدَّثَنَا خَالِدٌ،عَنْ مَيْمُونٍ الْقَنَّادِ،عَنْ أَبِي قِلَابَةَ،عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ رُكُوبِ النِّمَارِ،وَعَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا. قَالَ أَبُو دَاوُد: أَبُو قِلَابَةَ لَمْ يَلْقَ مُعَاوِيَةَ.";
abudawood.urdu = "سیدنا معاویہ بن ابوسفیان رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے چیتوں کے چمڑے کی گدی یا زین پوش پر بیٹھنے سے منع فرمایا ہے اور سونا پہننے سے بھی منع کیا ہے الا یہ کہ معمولی ہو۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابوقلابہ کی سیدنا معاویہ رضی اللہ عنہ سے ملاقات نہیں ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4395)
ولہ شاھد عند النسائي (5162 وسندہ صحیح)`;