var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ بْنِ النُّعْمَانِ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْبِحُوا بِالصُّبْحِ فَإِنَّهُ أَعْظَمُ لِأُجُورِكُمْ أَوْ أَعْظَمُ لِلْأَجْرِ";
abudawood.urdu = "جناب محمود بن لبید،سیدنا رافع بن خدیج رضی اللہ عنہ سے راوی ہیں،وہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’صبح طلوع ہونے پر (ہی) صبح کی نماز پڑھا کرو۔بلاشبہ یہ تمہارے لیے بہت زیادہ ثواب کا باعث ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (614)
محمد بن عجلان صرح بالسماع عند ابن ماجہ (672) وغیرہ، وتابعہ محمد بن إسحاق عند الترمذي (154) صححہ ابن حبان (263)`;