var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ،عَنْ بَدْرِ بْنِ عُثْمَانَ،عَنْ عَامِرٍ،عَنْ رَجُلٍ،عَنْ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَكُونُ فِي هَذِهِ الْأُمَّةِ أَرْبَعُ فِتَنٍ, فِي آخِرِهَا الْفَنَاءُ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’اس امت میں چار فتنے ہوں گے اور ان کے بعد دنیا فنا ہو جائے گی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>فیہ’’ رجل ‘‘ مجہول (عون المعبود 152/4)`;
abudawood.anwaar = [151,1];