var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،عَنْ شَيْبَانَ عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ, أَفْلَحَ مَنْ كَفَّ يَدَهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے روایت کیا کہ نبی کریم ﷺ نے فرمایا ’’ہلاکت ہے عربوں کے لیے،اس شر سے جو قریب آیا چاہتا ہے،کامیاب ہے وہ جس نے اپنا ہاتھ روکے رکھا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش مدلس وعنعن<br>وللحدیث شواھد معنویۃ عندالحاکم (4/ 439) وغیرہ،غیر قولہ : ’’أفلح من کف یدہ ‘‘`;
abudawood.anwaar = [151,1];