var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ،حَدَّثَنِي ابْنُ وَهْبٍ،حَدَّثَنِي اللَّيْثُ،عَنْ يَحْيَى بْنِ سَعِيدٍ،قَالَ: قَالَ خَالِدُ بْنُ أَبِي عِمْرَانَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ،عَنْ أَبِي هُرَيْرَةَ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: سَتَكُونُ فِتْنَةٌ صَمَّاءُ بَكْمَاءُ عَمْيَاءُ, مَنْ أَشْرَفَ لَهَا اسْتَشْرَفَتْ لَهُ،وَإِشْرَافُ اللِّسَانِ فِيهَا كَوُقُوعِ السَّيْفِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’عنقریب فتنہ ہو گا بہرا ‘ گونگا اور اندھا۔جس نے اس میں جھانکا ‘ فتنہ اس کی طرف مائل ہو گا۔اور اس میں زبان چلانا ایسے ہو گا جیسے کہ تلوار چلانا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد الرحمٰن بن البیلماني : ضعیف (تق: 3819)`;
abudawood.anwaar = [151,1];