var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يُوشِكُ أَنْ يَكُونَ خَيْرُ مَالِ الْمُسْلِمِ غَنَمًا يَتَّبِعُ بِهَا شَغَفَ الْجِبَالِ،وَمَوَاقِعَ الْقَطْرِ, يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’عنقریب ایسے ہو گا کہ مسلمان کا بہترین مال اس کی بکریاں ہوں گی جن کا پیچھا کرتے ہوئے وہ پہاڑوں کی چوٹیوں اور بارش کی جگہوں میں پھرتا رہے گا ‘ اپنے دین کی حفاظت میں فتنوں سے بھاگنا چاہتا ہو گا۔‘‘";
abudawood.hukam = "صحیح بخاری (19)";
abudawood.description = ``;