var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،حَدَّثَنَا مَعْمَرٌ،عَنْ أَيُّوبَ عَنِ الْحَسَنِ... بِإِسْنَادِهِ وَمَعْنَاهُ،مُخْتَصَرًا.[قال ابو داؤد: لمحمد يعني ابن المتوكل أخ ضعيف يقال له: حسین]";
abudawood.urdu = "ایوب نے حسن سے اپنی سند سے بالاختصار مذکورہ بالا روایت کے ہم معنی بیان کیا۔امام ابوداؤد رحمہ اللہ نے کہا: محمد بن متوکل کا ایک اور بھائی تھا حسین ‘ لیکن وہ ضعیف ہے۔";
abudawood.hukam = "صحیح مسلم (2888)";
abudawood.description = ``;