var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ،حَدَّثَنَا سُفْيَانُ عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا[النساء: 93], قَالَ: مَا نَسَخَهَا شَيْءٌ.";
abudawood.urdu = "سعید بن جبیر،سیدنا ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ سورۃ نساء کی آیت «ومن یقتل مؤمنا متعمدا» ’’اور جو کوئی کسی مومن کو جان بوجھ کر قتل کرے۔‘‘ کو کسی آیت نے منسوخ نہیں کیا ہے۔";
abudawood.hukam = "صحیح بخاری (4763، 4810) صحیح مسلم (122)";
abudawood.description = ``;