var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا أَبُو شِهَابٍ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،عَنْ أَبِي مِجْلَزٍ فِي قَوْلِهِ: وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ[النساء: 93]،قَالَ: هِيَ جَزَاؤُهُ, فَإِنْ شَاءَ اللَّهُ أَنْ يَتَجَاوَزَ عَنْهُ فَعَلَ.";
abudawood.urdu = "جناب ابومجلز سے مروی ہے کہ «ومن یقتل مؤمنا متعمدا فجزاؤہ جہنم» ’’قاتل عمد کی سزا یہی ہے کہ ہمیشہ جہنم میں رہے۔‘‘ اور اگر اللہ اسے معاف کرنا چاہے تو کر سکتا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سلیمان التیمي مدلس وعنعن`;
abudawood.anwaar = [152,1];