var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ،حَدَّثَنَا الْمَسْعُودِيُّ،عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ،عَنْ أَبِيهِ،عَنْ أَبِي مُوسَى،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أُمَّتِي هَذِهِ أُمَّةٌ مَرْحُومَةٌ،لَيْسَ عَلَيْهَا عَذَابٌ فِي الْآخِرَةِ،عَذَابُهَا فِي الدُّنْيَا, الْفِتَنُ وَالزَّلَازِلُ وَالْقَتْلُ.";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’میری اس امت پر اللہ کی رحمت ہے،آخرت میں اس پر عذاب نہیں،اس کا عذاب دنیا میں فتنوں،زلزلوں اور قتل کی صورت میں ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (5374)
أخرجہ أحمد (4/410) وصححہ الحاکم (4/444)`;