var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ،حَدَّثَنَا فِطْرٌ عَنِ الْقَاسِمِ بْنِ أَبِي بَزَّةَ،عَنْ أَبِي الطُّفَيْلِ،عَنْ عَلِيٍ رَضِيَ اللَّهُ عَنْهُ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَوْ لَمْ يَبْقَ مِنَ الدَّهْرِ إِلَّا يَوْمٌ, لَبَعَثَ اللَّهُ رَجُلًا مِنْ أَهْلِ بَيْتِي،يَمْلَؤُهَا عَدْلًا كَمَا مُلِئَتْ جَوْرًا.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’اگر اس زمانے سے ایک دن بھی باقی ہوا تو اللہ تعالیٰ میرے اہل بیت سے ایک آدمی کو اٹھائے گا جو اسے عدل سے بھر دے گا جیسے کہ ظلم سے بھری ہو گی۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;