var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ،حَدَّثَنَا أَبُو الْمَلِيحِ الْحَسَنُ بْنُ عُمَرَ،عَنْ زِيَادِ بْنِ بَيَانٍ،عَنْ عَلِيِّ بْنِ نُفَيْلٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أُمِّ سَلَمَةَ،قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: الْمَهْدِيُّ مِنْ عِتْرَتِي مِنْ وَلَدِ فَاطِمَةَ. قَالَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ: وَسَمِعْتُ أَبَا الْمَلِيحِ يُثْنِي عَلَى عَلِيِّ بْنِ نُفَيْلٍ،وَيَذْكُرُ مِنْهُ صَلَاحًا.";
abudawood.urdu = "سیدہ ام سلمہ رضی اللہ عنہا کا بیان ہے کہ میں نے رسول اللہ ﷺ کو فرماتے سنا ہے ’’مہدی میری عترت یعنی فاطمہ کی اولاد سے ہو گا۔‘‘ جناب عبداللہ بن جعفر نے کہا کہ میں نے ابوملیح سے سنا وہ علی بن نفیل (جو سعید بن مسیب کے شاگرد ہیں) کی مدح کرتے تھے کہ وہ بھلے آدمی تھے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (5453)
أخرجہ ابن ماجہ (4086 وسندہ حسن)`;