var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَهْلُ بْنُ تَمَّامِ بْنِ بَزِيعٍ،حَدَّثَنَا عِمْرَانُ الْقَطَّانُ،عَنْ قَتَادَةَ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْمَهْدِيُّ مِنِّي, أَجْلَى الْجَبْهَةِ،أَقْنَى الْأَنْفِ،يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ جَوْرًا وَظُلْمًا, يَمْلِكُ سَبْعَ سِنِينَ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’مہدی مجھ سے (میری نسل سے) ہو گا اس کی پیشانی فراخ اور ناک بلند ہو گی،زمین کو عدل و انصاف سے بھر دے گا جیسے کہ ظلم و زیادتی سے بھری ہو گی اور سات سال تک حکومت کرے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>قتادۃ عنعن<br>وللحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [152,1];