var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا عَبْدُ الصَّمَدِ،عَنْ هَمَّامٍ،عَنْ قَتَادَةَ... بِهَذَا الْحَدِيثِ،وَقَالَ: تِسْعَ سِنِينَ. قَالَ أَبُو دَاوُد: وقَالَ غَيْرُ مُعَاذٍ: عَنْ هِشَامٍ تِسْعَ سِنِينَ.";
abudawood.urdu = "قتادہ نے یہ حدیث روایت کی اور ’’نو سال‘‘ مدت بتائی۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ معاذ کے علاوہ دیگر راوی ہشام سے نو سال روایت کرتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [152,1];