var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى،حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ،حَدَّثَنَا أَبُو الْعَوَّامِ،حَدَّثَنَا قَتَادَةُ،عَنْ أَبِي الْخَلِيلِ،عَنْ عَبْدِ اللَّهِ ابْنِ الْحَارِثِ،عَنْ أُمِّ سَلَمَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِهَذَا الْحَدِيثِ،وَحَدِيثُ مُعَاذٍ أَتَمُّ.";
abudawood.urdu = "عبداللہ بن حارث نے ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا سے یہ حدیث روایت کی ہے اور معاذ کی حدیث (4286) کامل ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [152,1];