var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنِ الْوَلِيدِ بْنِ سُفْيَانَ الْغَسَّانِيِّ،عَنْ يَزِيدَ بْنِ قُتَيْبٍ السَّكُونِيِّ،عَنْ أَبِي بَحْرِيَّةَ،عَنْ مُعَاذِ بْنِ جَبَلٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْمَلْحَمَةُ الْكُبْرَى،وَفَتْحُ الْقُسْطَنْطِينِيَّةِ،وَخُرُوجُ الدَّجَّالِ, فِي سَبْعَةِ أَشْهُرٍ.";
abudawood.urdu = "سیدنا معاذ بن جبل رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جنگ عظیم،فتح قسطنطینیہ اور دجال کی آمد سات مہینوں میں ہو گی۔“ <اردو> </اردو>";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2238) ابن ماجہ (4092)<br>أبو بکر بن أبي مریم : ضعیف وکان قد سرق بیتہ فاختلط (تقریب التہذیب: 7974) وشیخہ ولید بن سفیان الغساني: مجہول (تق : 7425) و یزید بن قطیب مقبول (تقریب التہذیب: 7764) أي مجہول الحال`;
abudawood.anwaar = [153,1];