var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ الْحِمْصِيُّ،حَدَّثَنَا بَقِيَّةُ،عَنْ بَحِيرٍ،عَنْ خَالِدٍ عَنِ ابْنِ أَبِي بِلَالٍ،عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: بَيْنَ الْمَلْحَمَةِ وَفَتْحِ الْمَدِينَةِ سِتُّ سِنِينَ،وَيَخْرُجُ الْمَسِيحُ الدَّجَّالُ فِي السَّابِعَةِ.";
abudawood.urdu = "سیدنا عبداللہ بن بسر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جنگ عظیم اور شہر (قسطنطینیہ) کی فتح چھ سال کے عرصے میں ہو گی اور میسح دجال کا نکلنا ساتویں میں ہو گا۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ یہ روایت عیسیٰ کی (مذکورہ بالا) روایت سے صحیح تر ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (4093)<br>عبداﷲبن أبي بلال لم یوثقہ غیر ابن حبان فھو : مجہول کما فی التحریر (3240)`;
abudawood.anwaar = [153,1];