var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ،حَدَّثَنَا ابْنُ جَابِرٍ،حَدَّثَنِي زَيْدُ بْنُ أَرْطَاةَ،قَالَ: سَمِعْتُ جُبَيْرَ بْنَ نُفَيْرٍ يُحَدِّثُ،عَنْ أَبِي الدَّرْدَاءِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ فُسْطَاطَ الْمُسْلِمِينَ يَوْمَ الْمَلْحَمَةِ بِالْغُوطَةِ, إِلَى جَانِبِ مَدِينَةٍ يُقَالُ لَهَا: دِمَشْقُ, مِنْ خَيْرِ مَدَائِنِ الشَّامِ.";
abudawood.urdu = "سیدنا ابودرداء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جنگ کے موقع پر مسلمانوں کا خیمہ (مرکز) دمشق نامی شہر کی جانب میں واقع مقام غوطہ ہو گا اور دمشق شام کے بہترین شہروں میں سے ہو گا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (6278، 6281)`;