var abudawood = {};
abudawood.arabic = "قَالَ أَبُو دَاوُد: حُدِّثْتُ عَنِ ابْنِ وَهْبٍ،قَالَ:،حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يُوشِكُ الْمُسْلِمُونَ أَنْ يُحَاصَرُوا إِلَى الْمَدِينَةِ،حَتَّى يَكُونَ أَبْعَدَ مَسَالِحِهِمْ سَلَاحِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’عنقریب مسلمان مدینے میں گھیر لیے جائیں گے حتیٰ کہ ان کی بعید ترین چھاؤنی اس وقت مقام سلاح ہو گی۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ الطبراني فی الصغیر (2/113 ح873) والأوسط (6/286 ح6432) وسندھما صحیح وصححہ الحاکم (4/511 ح8560 وسندہ حسن)`;