var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدٍ الرَّمْلِيُّ،حَدَّثَنَا ضَمْرَةُ عَنِ السَّيْبَانِيِّ،عَنْ أَبِي سُكَيْنَةَ رَجُلٌ مِنَ الْمُحَرَّرِينَ،عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, أَنَّهُ قَالَ: دَعُوا الْحَبَشَةَ مَا وَدَعُوكُمْ،وَاتْرُكُوا التُّرْكَ مَا تَرَكُوكُمْ.";
abudawood.urdu = "نبی کریم ﷺ کے ایک صحابی سے روایت ہے وہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’حبشیوں سے تعرض نہ کرو جب تک کہ وہ تمہارے درپے نہ ہوں اور ترکوں کو بھی چھوڑے رہو جب تک کہ وہ تمہیں چھوڑے رہیں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (5430)
أخرجہ النسائي (3178 وسندہ حسن)`;