var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَعْقُوبُ يَعْنِي الْإِسْكَنْدَرَانِيَّ عَنْ سُهَيْلٍ يَعْنِي ابْنَ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يُقَاتِلَ الْمُسْلِمُونَ التُّرْكَ قَوْمًا وُجُوهُهُمْ كَالْمَجَانِّ الْمُطْرَقَةِ يَلْبَسُونَ الشَّعْرَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’قیامت اس وقت تک نہیں آئے گی جب تک کہ مسلمانوں کی ترکوں سے جنگ نہ ہو جائے۔یہ ایسے لوگ ہوں گے کہ ان کے چہرے ڈھالوں کی مانند ہوں گے ‘ جن پر چمڑا وغیرہ لگایا گیا ہو۔اور ان کا لباس بالوں کا ہو گا۔‘‘";
abudawood.hukam = "صحیح مسلم (2912)";
abudawood.description = ``;