var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ أَحْمَدَ الْبَغْدَادِيُّ،حَدَّثَنَا أَبُو عَامِرٍ،عَنْ زُهَيْرِ بْنِ مُحَمَّدٍ،عَنْ مُوسَى بْنِ جُبَيْرٍ،عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حَنِيفٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: اتْرُكُوا الْحَبَشَةَ مَا تَرَكُوكُمْ, فَإِنَّهُ لَا يَسْتَخْرِجُ كَنْزَ الْكَعْبَةِ إِلَّا ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’(کفار) حبشہ جب تک تم سے تعرض نہ کریں تم بھی انہیں چھوڑے رہو۔بلاشبہ کعبے کا خزانہ نکالنے والا ایک حبشی ہی ہو گا جس کی پنڈلیاں چھوٹی چھوٹی ہوں گی۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (5429)`;