var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ،حَدَّثَنِي عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ،حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ حَفْصِ بْنِ عَاصِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ،فَمَنْ حَضَرَهُ, فَلَا يَأْخُذْ مِنْهُ شَيْئًا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’عنقریب دریائے فرات سونے کا ایک خزانہ ظاہر کرے گا ‘ تو جو وہاں حاضر ہو اس میں سے کچھ نہ لے۔‘‘";
abudawood.hukam = "صحیح بخاری (7119) صحیح مسلم (2894)";
abudawood.description = ``;