var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ،حَدَّثَنِي عُقْبَةُ يَعْنِي ابْنَ خَالِدٍ،حَدَّثَنِي عُبَيْدُ اللَّهِ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... مِثْلَهُ, إِلَّا أَنَّهُ قَالَ: يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نےنبی کریم ﷺ سے اسی کی مثل روایت کیا۔مگر اس روایت میں ہے ’’سونے کا ایک پہاڑ ظاہر کرے گا۔‘‘";
abudawood.hukam = "صحیح بخاری (7119) صحیح مسلم (2894)";
abudawood.description = ``;