var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،أَنَّهُ قَالَ: مَا بُعِثَ نَبِيٌّ إِلَّا قَدْ أَنْذَرَ أُمَّتَهُ الدَّجَّالَ الْأَعْوَرَ الْكَذَّابَ،أَلَا وَإِنَّهُ أَعْوَرُ،وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ،وَإِنَّ بَيْنَ عَيْنَيْهِ مَكْتُوبًا: كَافِرٌ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ جو بھی کوئی نبی مبعوث ہوا ہے اس نے اپنی امت کو کانے ‘ جھوٹے دجال سے ڈرایا ہے۔خبردار! وہ کانا ہو گا اور تمہارا رب کانا نہیں ہے ‘ بیشک دجال کی آنکھوں کے درمیان لکھا ہو گا کافر۔‘‘";
abudawood.hukam = "صحیح بخاری (7131) صحیح مسلم (2933)";
abudawood.description = ``;