var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدٍ،حَدَّثَنَا ضَمْرَةُ عَنِ السَّيْبَانِيِّ،عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ،عَنْ أَبِي أُمَامَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَهُ،وَذَكَرَ الصَّلَوَاتِ،مِثْلَ مَعْنَاهُ.";
abudawood.urdu = "سیدنا ابوامامہ رضی اللہ عنہ نے نبی کریم ﷺ سے مذکورہ بالا کی مانند بیان کیا سیدنا ابوامامہ رضی اللہ عنہ نے نبی کریم ﷺ سے مذکورہ بالا کی مانند بیان کیا";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;