var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنِ الْعَلَاءِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ ثَلَاثُونَ دَجَّالُونَ كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اس وقت تک قیامت نہیں آئے گی جب تک کہ تیس (انتہائی جھوٹے) دجال نہ آ جائیں،ہر ایک کا دعویٰ ہو گا کہ وہ اللہ کا رسول ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;