var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ ثَلَاثُونَ كَذَّابًا دَجَّالًا كُلُّهُمْ يَكْذِبُ عَلَى اللَّهِ وَعَلَى رَسُولِهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اس وقت تک قیامت نہیں آئے گی جب تک کہ تیس انتہائی جھوٹے فریبی (دجال) نہ آ جائیں۔ان میں سے ہر ایک اللہ اور اس کے رسول پر جھوٹ بولتا ہو گا۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;