var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ،عَنْ جَرِيرٍ،عَنْ مُغِيرَةَ،عَنْ إِبْرَاهِيمَ،قَالَ: قَالَ عُبَيْدَةُ السَّلْمَانِيُّ بِهَذَا الْخَبَرِ, قَالَ: فَذَكَرَ نَحْوَهُ, فَقُلْتُ: لَهُ أَتَرَى هَذَا مِنْهُمْ يَعْنِي الْمُخْتَارَ فَقَالَ عُبَيْدَةُ أَمَا إِنَّهُ مِنَ الرُّءُوسِ.";
abudawood.urdu = "عبیدہ سلمانی نے یہ روایت بیان کی اور مذکورہ بالا حدیث کی مانند روایت کیا۔ابراہیم بن یزید نخعی کہتے ہیں کہ میں نے عبیدہ سے کہا: کیا بھلا آپ مختار (مختار بن ابی عبید ثقفی) کو انہی میں سے سمجھتے ہیں؟ انہوں نے کہا: یہ تو ان سب کے سرداروں میں سے ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مغیرۃ بن مقسم عنعن`;
abudawood.anwaar = [154,1];