var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَّدَدٌ،حَدَّثَنَا أَبُو الْأَحْوَصِ،حَدَّثَنَا أَبُو إِسْحَاقَ أَظُنُّهُ عَنِ ابْنِ جَرِيرٍ،عَنْ جَرِيرٍ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَا مِنْ رَجُلٍ يَكُونُ فِي قَوْمٍ يُعْمَلُ فِيهِمْ بِالْمَعَاصِي يَقْدِرُونَ عَلَى أَنْ يُغَيِّرُوا عَلَيْهِ فَلَا يُغَيِّرُوا, إِلَّا أَصَابَهُمُ اللَّهُ بِعَذَابٍ مِنْ قَبْلِ أَنْ يَمُوتُوا.";
abudawood.urdu = "سیدنا جریر بن عبداللہ بجلی رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی کریم ﷺ کو فرماتے سنا ’’جو کوئی ایسی قوم میں ہو کہ ان میں اللہ کی نافرمانیاں کی جا رہی ہوں اور وہ لوگ ان کی اصلاح اور ان کے بدلنے پر قادر ہوں،اس کے باوجود وہ ان کی اصلاح نہ کریں اور انہیں نہ بدلیں تو اللہ تعالیٰ ان سب کو ان کے مرنے سے پہلے عذاب دے گا۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (4009)<br>عبید اللّٰہ بن جریر مجہول الحال (وإلیہ أشار فی التقریب : 4280) ولم یوثقہ غیر ابن حبان وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [154,1];