var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا أَبُو هَاشِمٍ يَعْنِي الزَّعْفَرَانِيَّ حَدَّثَنِي صَالِحُ بْنُ عُبَيْدٍ عَنْ قَبِيصَةَ بْنِ وَقَّاصٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكُونُ عَلَيْكُمْ أُمَرَاءُ مِنْ بَعْدِي يُؤَخِّرُونَ الصَّلَاةَ فَهِيَ لَكُمْ وَهِيَ عَلَيْهِمْ فَصَلُّوا مَعَهُمْ مَا صَلَّوْا الْقِبْلَةَ";
abudawood.urdu = "سیدنا قبیصہ بن وقاص رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’میرے بعد تم پر ایسے حکام آئیں گے جو نمازوں میں تاخیر کریں گے۔تو ایسی نمازیں تمہارے لیے باعث اجر ہوں گی جب کہ ان کے لیے وبال ہوں گی۔پس تم ان کے ساتھ مل کر پڑھ لیا کرنا جب تک کہ وہ قبلہ رخ ہو کر نمازیں پڑھتے رہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>صالح بن عبید: مجھول الحال،وثقہ ابن حبان وحدہ<br>وحدیث البخاري (694) یغني عنہ`;
abudawood.anwaar = [28,2];