var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيُّ،حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ،أَخْبَرَنَا إِسْرَائِيلُ،حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ،عَنْ عَطِيَّةَ الْعَوْفِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَفْضَلُ الْجِهَادِ كَلِمَةُ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ, أَوْ أَمِيرٍ جَائِرٍ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’سب سے افضل جہاد یہ ہے کہ انسان جابر حاکم یا ظالم امیر کے سامنے حق و انصاف کا کلمہ کہہ گزرے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3705)
وللحدیث شواھد عند ابن ماجہ (4012 وسندہ حسن)`;