var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا أَبُو شِهَابٍ،عَنْ مُغِيرَةَ ابْنِ زِيَادٍ،عَنْ عَدِيِّ بْنِ عَدِيٍّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَهُ،قَالَ: مَنْ شَهِدَهَا فَكَرِهَهَا،كَانَ كَمَنْ غَابَ عَنْهَا.";
abudawood.urdu = "سیدنا عدی بن عدی رحمہ اللہ نے نبی کریم ﷺ سے مذکورہ بالا حدیث کی مانند روایت کیا۔کہا: ’’جو اس میں حاضر تھا مگر اس نے اسے مکروہ اور ناپسند جانا تو وہ ایسے ہوا جیسے کہ اس سے غائب اور دور رہا ہو۔“";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (4345) والآتي (4347)`;