var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ،حَدَّثَنَا أَبُو الْمُغِيرَةِ،حَدَّثَنِي صَفْوَانُ،عَنْ شُرَيْحِ بْنِ عُبَيْدٍ،عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنِّي لَأَرْجُو أَنْ لَا تَعْجِزَ أُمَّتِي عِنْدَ رَبِّهَا, أَنْ يُؤَخِّرَهُمْ نِصْفَ يَوْمٍ. قِيلَ لِسَعْدٍ: وَكَمْ نِصْفُ ذَلِكَ الْيَوْمِ؟ قَالَ: خَمْسُ مِائَةِ سَنَةٍ.";
abudawood.urdu = "سیدنا سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’مجھے امید ہے کہ میری امت اپنے رب کے ہاں اس بات سے عاجز نہ ہو گی کہ وہ اسے آدھے دن تک مؤخر فرما دے۔‘‘ سیدنا سعد رضی اللہ عنہ سے پوچھا گیا کہ آدھے دن کی مدت کس قدر ہے؟ انہوں نے کہا: پانچ سو سال۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند منقطع<br>شریح بن عبید لم یدرک سعدًا انظر تھذیب الکمال للمزي (3/ 380 تحقیق بشار عواد معروف)<br>ولہ شاھد ضعیف منقطع عند أحمد (170/1ح 1464)<br>وحدیث أبي داود (4349 سندہ صحیح) یغني عنہ`;
abudawood.anwaar = [154,1];