var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا الْمَسْعُودِيُّ،عَنْ الْقَاسِمِ... بِهَذِهِ الْقِصَّةِ،قَالَ: فَلَمْ يَنْزِلْ حَتَّى ضُرِبَ عُنُقُهُ, وَمَا اسْتَتَابَهُ.";
abudawood.urdu = "جانب قاسم (قاسم بن عبدالرحمٰن ہذلی) نے یہ قصہ بیان کیا،اس میں ہے کہ سیدنا معاذ رضی اللہ عنہ اپنی سواری سے اس وقت تک نہ اترے جب تک کہ اس کی گردن نہ مار دی گئی اور اس شخص سے توبہ نہ کروائی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند منقطع<br>القاسم بن عبد الرحمٰن بن عبد اللّٰہ بن مسعود لم یذکر عمن سمعہ`;
abudawood.anwaar = [154,1];