var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي إِسْحَاقَ عَنِ الشَّعْبِيِّ،عَنْ جَرِيرٍ،قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِذَا أَبَقَ الْعَبْدُ إِلَى الشِّرْكِ فَقَدْ حَلَّ دَمُهُ.";
abudawood.urdu = "سیدنا جریر (جریر بن عبداللہ بجلی رضی اللہ عنہ) سے روایت ہے،وہ کہتے ہیں کہ میں نے نبی کریم ﷺ سے سنا ‘ آپ ﷺ فرماتے تھے ’’جب کوئی غلام شرک کی طرف بھاگ جائے تو اس کا خون حلال ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (40574061)<br>أبو إسحاق عنعن<br>و حدیث مسلم (70) یغني عنہ`;
abudawood.anwaar = [154,2];