var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ الْجَرَّاحِ،عَنْ جَرِيرٍ،عَنْ مُغِيرَةَ عَنِ الشَّعْبِيِّ،عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ،أَنَّ يَهُودِيَّةً كَانَتْ تَشْتُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَقَعُ فِيهِ, فَخَنَقَهَا رَجُلٌ حَتَّى مَاتَتْ،فَأَبْطَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَمَهَا.";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ ایک یہودی عورت نبی کریم ﷺ کو گالیاں دیا کرتی تھی اور آپ ﷺ کے بارے میں نازیبا الفاظ بولتی تھی۔تو ایک آدمی نے اس کا گلا گھونٹ دیا حتیٰ کہ وہ مر گئی۔تو رسول اللہ ﷺ نے اس کا خون ضائع قرار دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مغیرۃ عنعن و جریر ھو ابن عبدالحمید الضبي`;
abudawood.anwaar = [155,1];