var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ،عَنْ أَيُّوبَ بِإِسْنَادِهِ بِهَذَا الْحَدِيثِ،قَالَ فِيهِ: فَأَمَرَ بِمَسَامِيرَ،فَأُحْمِيَتْ،فَكَحَلَهُمْ،وَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ،وَمَا حَسَمَهُمْ.";
abudawood.urdu = "جناب ایوب رحمہ اللہ نے اپنی سند سے یہ حدیث بیان کی اس میں ہے کہ آپ ﷺ نے سلاخوں کا حکم دیا ‘ انہیں گرم کیا گیا اور پھر ان کے آنکھوں میں پھیر دیا اور ان کے ہاتھ پاؤں کاٹ ڈالے اور انہیں داغ نہ دیا (کہ خون ہی بند ہو جائے اور انہیں یکدم قتل نہ کیا گیا)۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4364)`;