var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا ثَابِتٌ وَقَتَادَةُ وَحُمَيْدٌ،عَنْ أَنَسِ بْنِ مَالِكٍ... ذَكَرَ هَذَا الْحَدِيثَ،قَالَ أَنَسٌ: فَلَقَدْ رَأَيْتُ أَحَدَهُمْ يَكْدِمُ الْأَرْضَ بِفِيهِ عَطَشًا, حَتَّى مَاتُوا.";
abudawood.urdu = "جناب ثابت ‘ قتادہ اور حمید نے سیدنا انس رضی اللہ عنہ سے یہ حدیث روایت کی،کہا الٹی طرف سے ان کے ہاتھ اور پاؤں کاٹے۔(حدیث کے) شروع میں کہا: وہ اونٹوں کو ہانک لے گئے اور اسلام سے مرتد ہو گئے۔سیدنا انس رضی اللہ عنہ فرماتے ہیں: میں نے ان میں سے ایک کو دیکھا کہ وہ پیاس کے مارے اپنے منہ سے زمین کو کاٹ رہا تھا حتیٰ کہ وہ (اسی حالت میں) مر گئے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (72 وسندہ حسن) والنسائي (4039 وسندہ صحیح)`;