var abudawood = {};
abudawood.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ وَمُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ قَالَا،أَخْبَرَنَا ابْنُ أَبِي فُدَيْكٍ،عَنْ عَبْدِ الْمَلِكِ بْنِ زَيْدٍ نَسَبَهُ جَعْفَرٌ إِلَى سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ،عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَقِيلُوا ذَوِي الْهَيْئَاتِ عَثَرَاتِهِمْ, إِلَّا الْحُدُودَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’عزت دار لوگوں کی لغزشیں معاف کر دیا کرو سوائے اس کے کہ شرعی حدود ہوں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3569)`;