var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ ابْنَ جُرَيْجٍ يُحَدِّثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَافُّوا الْحُدُودَ فِيمَا بَيْنَكُمْ فَمَا بَلَغَنِي مِنْ حَدٍّ فَقَدْ وَجَبَ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’حدود کے معاملات کو آپس ہی میں ایک دوسرے کو معاف کر دیا کرو لیکن جو مقدمہ حد مجھ تک پہنچ گیا تو پھر اس کی تنفیذ واجب ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4890)<br>ابن جریج عنعن<br>والحدیث الآتي (الأصل : 4394) یغني عنہ`;
abudawood.anwaar = [155,1];