var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ يَزِيدَ بْنِ نُعَيْمٍ،عَنْ أَبِيهِ, أَنَّ مَاعِزًا،أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَأَقَرَّ عِنْدَهُ أَرْبَعَ مَرَّاتٍ،فَأَمَرَ بِرَجْمِهِ،وَقَالَ لِهَزَّالٍ: لَوْ سَتَرْتَهُ بِثَوْبِكَ كَانَ خَيْرًا لَكَ.";
abudawood.urdu = "یزید بن نعیم اپنے والد (نعیم بن ہزال اسلمی رضی اللہ عنہ) سے روایت کرتے ہیں کہ ماعز بن مالک نبی کریم ﷺ کے پاس آیا اور آپ کے سامنے چار بار اعتراف و اقرار کیا (کہ اس نے زنا کیا ہے) تو آپ ﷺ نے اس کو رجم کرنے کا حکم دیا اور ہزال اسلمی سے فرمایا ’’اگر تو اس پر اپنے کپڑے سے پردہ ڈال دیتا تو تیرے لیے بہتر ہوتا۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3567)
روایۃ یحیی بن سعید القطان عن سفیان الثوري محمولۃ علی السماع`;