var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ الْمُنْكَدِرِ, أَنْ هَزَّالًا أَمَرَ مَاعِزًا أَنْ يَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُخْبِرَهُ.";
abudawood.urdu = "جناب ابن منکدر رحمہ اللہ سے روایت ہے کہ ہزال رضی اللہ عنہ نے ماعز سے کہا کہ وہ نبی کریم ﷺ کے پاس جائے اور معاملے کی خبر دے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3567)
انظر الحدیث السابق (4377)`;