var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،قَالَ: سَمِعْتُهُ مِنْهُ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْطَعُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ چوتھائی دینار یا اس سے زیادہ کی چوری میں چور کا ہاتھ کاٹا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (6789) صحیح مسلم (1684)";
abudawood.description = ``;