var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَوَهْبُ بْنُ بَيَانٍ،قَالَا: حَدَّثَنَا ح،وحَدَّثَنَا ابْنُ السَّرْحِ قَالَ،أَخْبَرَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،عَنْ عُرْوَةً وَعَمْرَةَ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: تُقْطَعُ يَدُ السَّارِقِ فِي رُبُعِ دِينَارٍ فَصَاعِدًا. قَالَ أَحْمَدُ بْنُ صَالِحٍ الْقَطْعُ: فِي رُبْعِ دِينَارٍ فَصَاعِدًا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’چور کا ہاتھ چوتھائی دینار یا اس سے زیادہ میں کاٹا جائے۔‘‘ احمد بن صالح کے الفاظ میں ہے: ’’ہاتھ کا کاٹنا چوتھائی دینار اور اس سے زیادہ میں ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6790) صحیح مسلم (1684)";
abudawood.description = ``;