var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا ابْنُ جُرَيْجٍ،أَخْبَرَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ أَنَّ نَافِعًا مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُمْ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ يَدَ رَجُلٍ سَرَقَ تُرْسًا مِنْ صُفَّةِ النِّسَاءِ, ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم ﷺ نے ایک ڈھال کی چوری میں ایک آدمی کا ہاتھ کاٹا ‘ جو اس نے عورتوں والے صفہ (عورتوں کے لیے مخصوص سایہ دار مقام جہاں وہ نماز وغیرہ پڑھا کرتی تھیں) سے چرائی تھی۔اس ڈھال کی قیمت تین درہم تھی۔";
abudawood.hukam = "صحیح مسلم (1686)";
abudawood.description = ``;