var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلَانِيُّ وَهَذَا لَفْظُهُ وَهُوَ أَتَمُّ،قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ أَيُّوبَ بْنِ مُوسَى،عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ رَجُلٍ فِي مِجَنٍّ قِيمَتُهُ دِينَارٌ،أَوْ عَشَرَةُ دَرَاهِمَ.\nقَالَ أَبُو دَاوُد: رَوَاهُ مُحَمَّدُ بْنُ سَلَمَةَ وَسَعْدَانُ بْنُ يَحْيَى عَنِ ابْنِ إِسْحَاقَ بِإِسْنَادِهِ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے ایک ڈھال کے بدلے ایک آدمی کا ہاتھ کاٹا جس کی قیمت ایک دینار یا دس درہم تھی۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ اس رویت کو محمد بن سلمہ اور سعدان بن یحییٰ نے ابن اسحاق سے اس کی سند سے روایت کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن`;
abudawood.anwaar = [155,1];