var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ،حَدَّثَنَا ابْنُ جُرَيْجٍ،قَالَ: قَالَ أَبُو الزُّبَيْرِ قَالَ جَابِرُ بْنُ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَيْسَ عَلَى الْمُنْتَهِبِ قَطْعٌ،وَمَنِ انْتَهَبَ نُهْبَةً مَشْهُورَةً فَلَيْسَ مِنَّا.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’لٹیرے کا ہاتھ نہیں کٹتا اور جو علانیہ مال لوٹے وہ ہم میں سے نہیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3596)
ابن جریج صرح بالسماع عند الدارمي (2/175 ح2315) وتابعہ المغیرۃ بن مسلم، وأبو الزبیر تابعہ عمرو بن دینار`;