var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ حَمَّادٍ،عَنْ إِبْرَاهِيمَ عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ: عَنِ النَّائِمِ حَتَّى يَسْتَيْقِظَ،وَعَنِ الْمُبْتَلَى حَتَّى يَبْرَأَ،وَعَنِ الصَّبِيِّ حَتَّى يَكْبُرَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’تین آدمیوں سے قلم اٹھا لیا گیا ہے سویا ہوا حتیٰ کہ جاگ جائے،دیوانہ حتیٰ کہ عقلمند ہو جائے اور بچے سے حتیٰ کہ بڑا (بالغ) ہو جائے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3462) ابن ماجہ (2041)<br>حماد بن أبي سلیمان و إبراھیم النخعي مدلسان و عنعنا (حماد بن أبي سلیمان : الفتح المبین ص 38،إبراہیم النخعي : تقدم : 2235)<br>وانظر حدیث (ح 4399،4400)`;
abudawood.anwaar = [155,1];