var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا عَبْثَرٌ،عَنْ حُصَيْنٍ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ،قَالَ: فَتَوَضَّأَ حِينَ ارْتَفَعَتِ الشَّمْسُ فَصَلَّى بِهِمْ";
abudawood.urdu = "جناب عبداللہ بن ابی قتادہ اپنے والد سیدنا ابوقتادہ رضی اللہ عنہ سے وہ نبی کریم ﷺ سے اسی کے ہم معنی روایت کرتے ہیں،کہا کہ آپ ﷺ نے وضو فرمایا جب کہ سورج اونچا آ گیا پھر انہیں نماز پڑھائی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;