var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى،حَدَّثَنَا وَكِيعٌ عَنِ الْأَعْمَشِ نَحْوَهُ،وَقَالَ أَيْضًا. حَتَّى يَعْقِلَ،وَقَالَ: وَعَنِ الْمَجْنُونِ حَتَّى يَفِيقَ،قَالَ: فَجَعَلَ عُمَرُ يُكَبِّرُ.";
abudawood.urdu = "وکیع نے اعمش سے مذکورہ بالاحدیث کی مانند روایت کیا اور کہا (بچے سے قلم اٹھا لیا گیا ہے) حتیٰ کہ عقلمند ہو جائے اور مجنون سے بھی حتیٰ کہ افاقہ پا جائے۔بیان کیا کہ پھر سیدنا عمر رضی اللہ عنہ تکبیر کہنے لگے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش مدلس وعنعن والموقوف عند ابن الجعد (مسند علي بن الجعد : 741) عن علي رضي اللّٰہ عنہ قال لعمر رضي اللّٰہ عنہ : ’’ أما بلغک أن القلم قد و ضع عن ثلاثۃ : عن المجنون حتی یفیق و عن الصبي حتی یعقل و عن النائم حتی یستیقظ ‘‘ وسندہ صحیح`;
abudawood.anwaar = [155,2];