var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ،حَدَّثَنِي عَطِيَّةُ الْقُرَظِيُّ،قَالَ: كُنْتُ مِنْ سَبْيِ بَنِي قُرَيْظَةَ،فَكَانُوا يَنْظُرُونَ, فَمَنْ أَنْبَتَ الشَّعْرَ قُتِلَ،وَمَنْ لَمْ يُنْبِتْ لَمْ يُقْتَلْ،فَكُنْتُ فِيمَنْ لَمْ يُنْبِتْ.";
abudawood.urdu = "سیدنا عطیہ قرظی رضی اللہ عنہ کہتے ہیں کہ میں بنو قریظہ کے قیدیوں میں سے تھا ‘ چنانچہ مسلمانوں نے دیکھنا شروع کیا ‘ یعنی جس جس کے (زیر ناف) بال اگ آئے تھے اسے قتل کر دیا گیا اور جس کے نہیں اگے تھے اسے قتل نہ کیا گیا ‘ چنانچہ میں ان میں سے تھا جن کے بال نہیں اگے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3974)`;