var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ قَالَ،أَخْبَرَنِي نَافِعٌ عَنِ ابْنِ عُمَرَ, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَضَهُ يَوْمَ أُحُدٍ-وَهُوَ ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً-فَلَمْ يُجِزْهُ،وَعَرَضَهُ يَوْمَ الْخَنْدَقِ-وَهُوَ ابْنُ خَمْسَ عَشْرَةَ سَنَةً-فَأَجَازَهُ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت کہ نبی کریم ﷺ نے احد والے دن ان کا جائزہ لیا جبکہ ان کی عمر چودہ سال تھی تو آپ ﷺ نے ان کو جنگ میں شریک ہونے کی اجازت نہیں دی تھی۔اور پھر خندق والے دن ان کا جائزہ لیا اور وہ پندرہ سال کے تھے تو آپ ﷺ نے ان کو اجازت دے دی۔";
abudawood.hukam = "صحیح بخاری (4097) صحیح مسلم (1868)";
abudawood.description = `وانظر الحدیث السابق (2957)`;