var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا ابْنُ إِدْرِيسَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،قَالَ: قَالَ نَافِعٌ: حَدَّثْتُ بِهَذَا الْحَدِيثِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ،فَقَالَ: إِنَّ هَذَا الْحَدُّ بَيْنَ الصَّغِيرِ وَالْكَبِيرِ.";
abudawood.urdu = "نافع کہتے ہیں کہ میں نے یہ حدیث سیدنا عمر بن عبدالعزیز رحمہ اللہ کو بیان کی تو انہوں نے کہا: بلاشبہ بچے اور بڑے میں یہی عمر حد فاصل ہے۔";
abudawood.hukam = "صحیح مسلم (1868)";
abudawood.description = ``;