var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَهُوَ الطَّيَالِسِيُّ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِي النَّوْمِ تَفْرِيطٌ إِنَّمَا التَّفْرِيطُ فِي الْيَقَظَةِ أَنْ تُؤَخِّرَ صَلَاةً حَتَّى يَدْخُلَ وَقْتُ أُخْرَى";
abudawood.urdu = "جناب عبداللہ بن رباح سیدنا ابوقتادہ رضی اللہ عنہ سے راوی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’نیند میں قصور نہیں۔قصور جاگنے کی حالت میں ہوتا ہے۔(وہ اس طرح) کہ تم کسی نماز کو اس حد تک مؤخر کر دو کہ دوسری نماز کا وقت آ جائے۔‘‘";
abudawood.hukam = "صحیح مسلم (681)";
abudawood.description = ``;