var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ،حَدَّثَنَا الْحَجَّاجُ،عَنْ مَكْحُولٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَيْرِيزٍ،قَالَ: سَأَلْنَا فَضَالَةَ بْنَ عُبَيْدٍ،عَنْ تَعْلِيقِ الْيَدِ فِي الْعُنُقِ لِلسَّارِقِ،أَمِنَ السُّنَّةِ هُوَ؟ قَالَ: أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ،فَقُطِعَتْ يَدُهُ،ثُمَّ أَمَرَ بِهَا فَعُلِّقَتْ فِي عُنُقِهِ.";
abudawood.urdu = "عبدالرحمٰن بن محیریز سے روایت ہے کہ ہم نے سیدنا فضالہ بن عبید رضی اللہ عنہ سے پوچھا کہ کیا چور کا ہاتھ اس کی گردن میں لٹکا دینا سنت ہے؟ تو انہوں نے کہا کہ رسول اللہ ﷺ کے پاس ایک چور کو لایا گیا تو اس کا ہاتھ کاٹ دیا گیا۔پھر آپ ﷺ نے اس کے ہاتھ کے متعلق حکم دیا تو اس کی گردن میں ٹکا دیا گیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1447) نسائی (4985) ابن ماجہ (2587)<br>حجاج بن أرطاۃ مدلس و عنعن وقال النسائي : ’’ الحجاج بن أرطاۃ ضعیف ولا یحتج بہ‘‘`;
abudawood.anwaar = [156,1];