var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَاعِيلَ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا سَرَقَ الْمَمْلُوكُ فَبِعْهُ وَلَوْ بِنَشٍّ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب مملوک غلام چوری کرے تو اسے بیچ ڈالو ‘ خواہ آدھے اوقیہ (بیس درہم) سے بیچو۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3606)
أخرجہ النسائي (4983 وسندہ حسن) وابن ماجہ (2589 وسندہ حسن) عمر بن أبي سلمۃ حسن الحدیث`;