var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ،حَدَّثَنَا مُوسَى يَعْنِي ابْنَ مَسْعُودٍ،عَنْ شِبْلٍ عَنِ ابْنِ أَبِي نَجِيحٍ،عَنْ مُجِاهِدٍ،قَالَ: السَّبِيلُ: الْحَدُّ.\nقَالَ سُفْيَانُ فَآذُوهُمَا[النساء: 16]: الْبِكْرَانِ،فَأَمْسِكُوهُنَّ فِي الْبُيُوتِ[النساء: 15]: الثَّيِّبَاتُ .";
abudawood.urdu = "ابن ابی نجیح نے جناب مجاہد سے روایت کیا کہ سبیل‘‘ (راستے) سے مراد حد کا نازل کرنا ہے۔سفیان نے کہا: ’’ان دونوں کو سزا دو‘‘ سے مراد غیر شادی شدہ مرد و عورت ہیں۔اور ’’ان کو گھر میں روکے رکھو‘‘ سے مراد شادی شدہ عورتیں ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن أبي نجیح عنعن`;
abudawood.anwaar = [156,1];