var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا لَا كَفَّارَةَ لَهَا إِلَّا ذَلِكَ";
abudawood.urdu = "۔سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جو شخص نماز کو بھول جائے تو وہ اسے اسی وقت ادا کرے جب یاد آ جائے۔اس کے علاوہ اس کا کوئی کفارہ نہیں ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (597) صحیح مسلم (684)";
abudawood.description = ``;