var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ،عَنْ شُعْبَةَ،عَنْ سِمَاكٍ،قَالَ: سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ... بِهَذَا الْحَدِيثِ-وَالْأَوَّلُ أَتَمُّ-،قَالَ: فَرَدَّهُ مَرَّتَيْنِ.\nقَالَ سِمَاكٌ: [روايه]: فَحَدَّثْتُ بِهِ سَعِيدَ بْنَ جُبَيْرٍ،فَقَالَ: إِنَّهُ رَدَّهُ أَرْبَعَ مَرَّاتٍ.";
abudawood.urdu = "شعبہ نے سماک سے روایت کیا،کہا کہ میں نے سیدنا جابر بن سمرہ رضی اللہ عنہ سے یہ حدیث سنی ‘ جبکہ پہلے والی حدیث زیادہ کامل ہے۔کہا کہ رسول اللہ ﷺ نے اس کو دوبارہ واپس کیا۔سماک کہتے ہیں کہ میں نے سعید بن جبیر کو یہ روایت بیان کی تو انہوں نے کہا کہ آپ ﷺ نے اس کو چار بار لوٹایا تھا۔";
abudawood.hukam = "صحیح مسلم (1692)";
abudawood.description = ``;