var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا أَبُو عَاصِمٍ،حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ،أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنِ ابْنِ عَمِّ أَبِي هُرَيْرَةَ،عَنْ أَبِي هُرَيْرَةَ بِنَحْوِهِ زَادَ وَاخْتَلَفُوا عَلَيَّ فَقَالَ بَعْضُهُمْ رُبِطَ إِلَى شَجَرَةٍ وَقَالَ بَعْضُهُمْ وُقِفَ.";
abudawood.urdu = "ابو زبیر نے سیدنا ابوہریرہ رضی اللہ عنہ کے چچا زاد سے روایت کیا اس نے سیدنا ابوہریرہ رضی اللہ عنہ سے مذکورہ بالا حدیث کی مانند بیان کیا اور مزید کہا کہ راویوں نے اختلاف کیا ہے۔بعض نے کہا کہ اسے درخت سے باندھا گیا اور بعض نے کہا کہ اسے کھڑا کیا گیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (4428)`;