var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي مَسِيرٍ لَهُ فَنَامُوا عَنْ صَلَاةِ الْفَجْرِ فَاسْتَيْقَظُوا بِحَرِّ الشَّمْسِ فَارْتَفَعُوا قَلِيلًا حَتَّى اسْتَقَلَّتْ الشَّمْسُ ثُمَّ أَمَرَ مُؤَذِّنًا فَأَذَّنَ فَصَلَّى رَكْعَتَيْنِ قَبْلَ الْفَجْرِ ثُمَّ أَقَامَ ثُمَّ صَلَّى الْفَجْرَ";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ اپنے ایک سفر میں تھے کہ لوگ صبح کی نماز کے وقت سوئے رہے اور سورج کی گرمی سے جاگے۔پھر کچھ چلے حتیٰ کہ سورج بلند ہو گیا۔پھر آپ ﷺ نے مؤذن کو حکم دیا تو اس نے اذان کہی اور فرضوں سے پہلے دو رکعتیں پڑھیں۔پھر اقامت ہوئی اور نماز فجر پڑھائی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الحسن البصري (تقدم: 17) وھشام بن حسان (طبقات المدلسین: 110/ 3) مدلسان وعنعنا`;
abudawood.anwaar = [29,1];