var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ،حَدَّثَنَا إِسْمَاعِيلُ،عَنِ الْجُرَيْرِيِّ،عَنْ أَبِي نَضْرَةَ،قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،نَحْوَهُ وَلَيْسَ بِتَمَامِهِ،قَالَ: ذَهَبُوا يَسُبُّونَهُ فَنَهَاهُمْ،قَالَ: ذَهَبُوا يَسْتَغْفِرُونَ لَهُ فَنَهَاهُمْ،قَالَ: «هُوَ رَجُلٌ أَصَابَ ذَنْبًا حَسِيبُهُ اللَّهُ";
abudawood.urdu = "جریری نے ابونضرہ سے روایت کرتے ہوئے کہا کہ ایک شخص نبی کریم ﷺ کے پاس آیا۔اور مذکورہ بالا حدیث کی مانند روایت کیا،لیکن اس کی روایت مکمل نہیں ہے۔راوی نے کہا کہ لوگ اسے گالیاں دینے لگے،تو آپ ﷺ نے ان کو منع کیا۔(پھر) وہ اس کے لیے استغفار کرنے لگے،تو آپ ﷺ نے ان کو منع کر دیا اور کہا ’’یہ ایسا آدمی ہے جس نے گناہ کا ارتکاب کیا ہے اور اللہ ہی اس کا حساب لینے والا ہے۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل<br>أبو نضرۃ المنذر بن مالک من التابعین`;
abudawood.anwaar = [156,1];