var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرِ بْنِ أَبِي شَيْبَةَ،حَدَّثَنَا يَحْيَى بْنُ يَعْلَى بْنِ الْحَارِثِ،حَدَّثَنَا أَبِي،عَنْ غَيْلَانَ،عَنْ عَلْقَمَةَ ابْنِ مَرْثَدٍ عَنِ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَنْكَهَ مَاعِزًا.";
abudawood.urdu = "جناب سلیمان بن بریدہ اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے ماعز بن مالک کا منہ سونگھا تھا (کہ کہیں شراب نہ پی رکھی ہو)۔";
abudawood.hukam = "صحیح مسلم (1695)";
abudawood.description = ``;