var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ ح،وحَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ الْأَنْطَاكِيُّ،حَدَّثَنَا الْوَلِيدُ جَمِيعًا،قَالَا: حَدَّثَنَا مُحَمَّدٌ وَقَالَ هِشَامٌ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الشُّعَيْثِيُّ،عَنْ مَسْلَمَةَ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ،عَنْ خَالِدِ بْنِ اللَّجْلَاجِ،عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِبَعْضِ هَذَا الْحَدِيثِ.";
abudawood.urdu = "خالد بن لجلاج نے اپنے والد سے انہوں نے نبی کریم ﷺ سے اس حدیث کا کچھ حصہ روایت کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (4435)`;