var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى الْبَزَّازُ،أَخْبَرَنَا أَبُو عَاصِمٍ عَنِ ابْنِ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ, أَنَّ رَجُلًا زَنَى بِامْرَأَةٍ،فَلَمْ يَعْلَمْ بِإِحْصَانِهِ،فَجُلِدَ،ثُمَّ عَلِمَ بِإِحْصَانِهِ, فَرُجِمَ .";
abudawood.urdu = "جناب ابوزبیر نے سیدنا جابر رضی اللہ عنہ سے روایت کیا کہ ایک آدمی نے ایک عورت سے بدکاری کی اور معلوم نہ ہوا کہ وہ شادی شدہ ہے تو اس کو کوڑے مارے گئے۔پھر معلوم ہوا کہ وہ شادی شدہ ہے تو اس کو رجم کیا گیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (4438)`;
abudawood.anwaar = [157,1];