var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ،عَنْ زَكَرِيَّا أَبِي عِمْرَانَ،قَالَ: سَمِعْتُ شَيْخًا يُحَدِّثُ عَنِ ابْنِ أَبِي بَكْرَةَ،عَنْ أَبِيهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ امْرَأَةً-فَحُفِرَ لَهَا-إِلَى الثَّنْدُوَةِ.\nقَالَ أَبُو دَاوُد: أَفْهَمَنِي رَجُلٌ،عَنْ عُثْمَانَ.\nقَالَ أَبُو دَاوُد: قَالَ الْغَسَّانِيُّ جُهَيْنَةُ وَغَامِدٌ وَبَارِقٌ وَاحِدٌ.";
abudawood.urdu = "ابن ابی بکرہ اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے ایک عورت کو رجم کیا تو اس کے لیے سینے تک گڑھا کھودا گیا۔امام ابوداؤد رحمہ اللہ کہتے ہیں: مجھے یہ حدیث ایک آدمی نے سمجھائی۔(وہ عثمان سے کماحقہ نہیں سمجھ سکے تھے)۔امام ابوداؤد رحمہ اللہ نے (مزید) کہا کہ،غسانی نے کہا کہ جہینہ،غامد اور بارق تینوں ایک ہی قبیلے (کے نام) ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>فیہ شیخ مجھول<br>والحدیث السابق (الأصل : 4442) یغني عنہ`;
abudawood.anwaar = [157,1];