var abudawood = {};
abudawood.arabic = "قَالَ أَبُو دَاوُد: حُدِّثْتُ،عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ،قَالَ: حَدَّثَنَا زَكَرِيَّا بْنُ سُلَيْمٍ... بِإِسْنَادِهِ نَحْوَهُ... زَادَ: ثُمَّ رَمَاهَا بِحَصَاةٍ مِثْلَ الْحِمِّصَةِ،ثُمَّ قَالَ: ارْمُوا،وَاتَّقُوا الْوَجْهَ،فَلَمَّا طَفِئَتْ أَخْرَجَهَا،فَصَلَّى عَلَيْهَا،وَقَالَ فِي التَّوْبَةِ نَحْوَ حَدِيثِ بُرَيْدَةَ.";
abudawood.urdu = "زکریا بن سلیم نے اپنی سند سے مذکورہ بالا حدیث کی مانند روایت کیا اور مزید کہا پھر (نبی کریم ﷺ نے) اسے ایک کنکری ماری جیسے کہ چنا ہو اور فرمایا ’’مارو لیکن چہرہ بچاؤ۔‘‘ جب وہ ٹھنڈی ہو گئی تو اس کو گڑھے سے نکالا اور اس پر نماز (جنازہ) پڑھی اور اس کی توبہ میں اس طرح بیان کیا جیسے کہ سیدنا بریدہ رضی اللہ عنہ کی حدیث (4442) میں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شیخ أبي داود مجھول`;
abudawood.anwaar = [157,1];