var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ،عَنْ هُشَيْمٍ،عَنْ مُغِيرَةَ،عَنْ إِبْرَاهِيمَ،وَالشَّعْبِيِّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَهُ،لَمْ يَذْكُرْ: فَدَعَا بِالشُّهُودِ فَشَهِدُوا.";
abudawood.urdu = "ابراہیم اور شعبی نے نبی کریم ﷺ سے اس کی مانند روایت کیا۔مگر اس میں گواہوں کو طلب کرنے اور ان کے گواہی دینے کا بیان نہیں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل،ومغیرۃ : مدلس وھشیم مدلس (طبقات المدلسین : 3/111) وعنعنا`;
abudawood.anwaar = [157,1];