var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَسَنٍ الْمِصِّيصِيُّ،حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،قَالَ:،حَدَّثَنَا ابْنُ جُرَيْجٍ أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: رَجَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنَ الْيَهُودِ وَامْرَأَةً زَنَيَا.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے یہودیوں کے ایک مرد اور عورت کو،جنہوں نے زنا کیا تھا،رجم کروایا تھا۔";
abudawood.hukam = "صحیح مسلم (1701)";
abudawood.description = ``;