var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ قُسَيْطٍ الرَّقِّيُّ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو،عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ يَزِيدَ ابْنِ الْبَرَاءِ،عَنْ أَبِيهِ قَالَ: لَقِيتُ عَمِّي وَمَعَهُ رَايَةٌ،فَقُلْتُ لَهُ: أَيْنَ تُرِيدُ؟ قَالَ: بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَجُلٍ نَكَحَ امْرَأَةَ أَبِيهِ, فَأَمَرَنِي أَنْ أَضْرِبَ عُنُقَهُ،وَآخُذَ مَالَهُ.";
abudawood.urdu = "جناب یزید بن براء اپنے والد سے روایت کرتے ہیں،انہوں نے کہا میں اپنے چچا سے ملا جب کہ ان کے پاس جھنڈا تھا۔میں نے ان سے پوچھا: کہاں کا ارادہ ہے؟ انہوں نے کہا: رسول اللہ ﷺ نے مجھے ایک آدمی کی طرف بھیجا ہے جس نے اپنے باپ کی بیوی کے ساتھ نکاح کیا ہے ‘ آپ ﷺ نے مجھے حکم دیا ہے کہ میں اس کی گردن مار دوں اور اس کا مال لے لوں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3172)
أخرجہ النسائي (3334 وسندہ صحیح)`;