var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،عَنْ شُعْبَةَ،عَنْ أَبِي بِشْرٍ،عَنْ خَالِدِ بْنِ عُرْفُطَةَ،عَنْ حَبِيبِ بْنِ سَالِمٍ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فِي الرَّجُلِ يَأْتِي جَارِيَةَ امْرَأَتِهِ؟ قَالَ: إِنْ كَانَتْ أَحَلَّتْهَا لَهُ جُلِدَ مِائَةً،وَإِنْ لَمْ تَكُنْ أَحَلَّتْهَا لَهُ رَجَمْتُهُ.";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ نے نبی کریم ﷺ سے بیان کیا کہ جو شخص اپنی بیوی کی لونڈی کی ساتھ ملوث ہو جائے تو اگر بیوی نے اسے اس کے لیے حلال کر دیا ہو تو اس (شوہر) کو سو کوڑے مارے جائیں اور اگر حلال نہ کرے تو میں اسے رجم کروں گا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ النسائي (3362) وانظر الحدیث السابق (4458)`;