var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ،حَدَّثَنَا الْوَلِيدُ،عَنْ حَرِيزٍ يَعْنِي ابْنَ عُثْمَانَ،عَنْ يَزِيدَ بْنِ صَالِحٍ،عَنْ ذِي مِخْبَرٍ ابْنِ أَخِي النَّجَاشِيِّ،فِي هَذَا الْخَبَرِ،قَالَ: فَأَذَّنَ وَهُوَ غَيْرُ عَجِلٍ";
abudawood.urdu = "جناب یزید بن صلیح نے سیدنا ذی مخبر یعنی نجاشی کے بھتیجے سے اس خبر میں بیان کیا کہا تو اس نے اذان کہی اور وہ جلدی میں نہ تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق: 445`;
abudawood.anwaar = [29,1];