var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ ابْنُ حُسَيْنٍ الدِّرْهَمِيُّ،حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ عَنِ الْحَسَنِ،عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... نَحْوَهُ،إِلَّا أَنَّهُ قَالَ: وَإِنْ كَانَتْ طَاوَعَتْهُ, فَهِيَ وَمِثْلُهَا مِنْ مَالِهِ لَسَيِّدَتِهَا.";
abudawood.urdu = "سیدنا سلمہ بن محبق رضی اللہ عنہ نے نبی کریم ﷺ سے مذکورہ بالا حدیث کی مانند روایت کیا۔مگر یوں کہا کہ اگر لونڈی راضی تھی تو یہ اس شوہر کی ہوئی اور اس کی قیمت کے برابر مال اس کی مالکہ کو دینا ہو گا۔";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ النسائي (3366 وسندہ صحیح)`;