var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ رَاهَوَيْهِ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا ابْنُ جُرَيْجٍ،أَخْبَرَنِي ابْنُ خُثَيْمٍ،قَالَ: سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ وَمُجَاهِدًا يُحَدِّثَانِ عَنِ ابْنِ عَبَّاسٍ،فِي الْبِكْرِ يُؤْخَذُ عَلَى اللُّوطِيَّةِ, قَالَ: يُرْجَمُ.\nقَالَ أَبو دَاود: حَدِيثُ عَاصِمٍ يُضَعِّفُ حَدِيثَ عَمْرِو بْنِ أَبِي عَمْرٍو .";
abudawood.urdu = "جناب سعید بن جبیر اور مجاہد،سیدنا ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ کنوارا اگر قوم لوط کا سا کام کرتا پایا جائے ‘ تو اسے سنگسار کیا جائے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ عاصم (عاصم بن ابی النجود) کی حدیث (جو آگے آ رہی ہے۔4465) عمرو بن ابی عمرو کی حدیث (4464) کو ضعیف کرتی ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `حدیث عاصم یأتي (4465)`;