var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ عُبَيْدِ اللَّهِ،حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَلْيَحُدَّهَا،وَلَا يُعَيِّرْهَا-ثَلَاثَ مِرَارٍ-فَإِنْ عَادَتْ فِي الرَّابِعَةِ, فَلْيَجْلِدْهَا،وَلْيَبِعْهَا بِضَفِيرٍ أَوْ بِحَبْلٍ مِنْ شَعْرٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جب تم میں سے کسی کی لونڈی زنا کرے تو چاہیئے کہ اسے حد لگائے اور عار نہ دلائے اور تین بار تک ایسا کرے ‘ اگر چوتھی بار بھی کرے تو اسے حد لگائے اور ایک رسی کے بدلے بیچ ڈالے۔‘‘ یا فرمایا ’’بالوں کی رسی کے عوض بیچ دے۔‘‘";
abudawood.hukam = "صحیح مسلم (1703)";
abudawood.description = ``;