var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي فَزَارَةَ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أُمِرْتُ بِتَشْيِيدِ الْمَسَاجِدِ قَالَ ابْنُ عَبَّاسٍ لَتُزَخْرِفُنَّهَا كَمَا زَخْرَفَتْ الْيَهُودُ وَالنَّصَارَى";
abudawood.urdu = "۔سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مجھے یہ حکم نہیں دیا گیا کہ مساجد کو بہت زیادہ پختہ تعمیر کروں۔‘‘ سیدنا ابن عباس رضی اللہ عنہما نے کہا تم انہیں ضرور مزین کرو گے جیسے کہ یہود و نصاریٰ نے (اپنے عبادت خانے) مزین کیے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن (تقدم: 130)<br>وقول ابن عباس علقہ البخاري في صحیحہ (2/ 539 قبل ح 446)`;
abudawood.anwaar = [29,1];