var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا أَبَانُ،عَنْ عَاصِمٍ،عَنْ أَبِي صَالِحٍ ذَكْوَانَ،عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا شَرِبُوا الْخَمْرَ فَاجْلِدُوهُمْ،ثُمَّ إِنْ شَرِبُوا فَاجْلِدُوهُمْ،ثُمَّ إِنْ شَرِبُوا فَاجْلِدُوهُمْ،ثُمَّ إِنْ شَرِبُوا فَاقْتُلُوهُمْ.";
abudawood.urdu = "سیدنا معاویہ بن ابوسفیان رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’(شرابی) جب شراب پئیں تو انہیں درے لگاؤ،پھر اگر پئیں تو درے لگاؤ،پھر اگر پئیں تو درے لگاؤ پھر اگر پئیں تو قتل کر دو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3619)`;