var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ حُمَيْدِ بْنِ يَزِيدَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ... بِهَذَا الْمَعْنَى. قَالَ: وَأَحْسِبُهُ قَالَ فِي الْخَامِسَةِ: إِنْ شَرِبَهَا فَاقْتُلُوهُ.\nقَالَ أَبُو دَاوُد: وَكَذَا فِي حَدِيثِ أَبِي غُطَيْفٍ فِي الْخَامِسَةِ.";
abudawood.urdu = "جناب نافع نے سیدنا ابن عمر رضی اللہ عنہما سے روایت کیا کہ رسول اللہ ﷺ نے فرمایا،اور مذکورہ بالا کے ہم معنی روایت کیا۔انہوں نے کہا: میرا خیال ہے کہ پانچویں بار آپ ﷺ نے فرمایا ’’اگر پیے تو اسے قتل کر دو۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابوغطیف کی روایت میں بھی پانچویں بار کا ذکر ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حمید بن یزید مجھول الحال (تق : 1565)`;
abudawood.anwaar = [158,1];