var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ،حَدَّثَنَا شَرِيكٌ،عَنْ أَبِي حُصَيْنٍ،عَنْ عُمَيْرِ بْنِ سَعِيدٍ،عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ،قَالَ: لَا أَدِي أَوْ مَا كُنْتُ لِأَدِيَ مَنْ أَقَمْتُ عَلَيْهِ حَدًّا إِلَّا شَارِبَ الْخَمْرِ, فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَسُنَّ فِيهِ شَيْئًا, إِنَّمَا هُوَ شَيْءٌ قُلْنَاهُ نَحْنُ.";
abudawood.urdu = "امیرالمؤمنین سیدنا علی رضی اللہ عنہ کہتے ہیں کہ میں کسی پر حد قائم کروں (اور وہ مر جائے) تو کسی کی دیت نہ دوں سوائے شراب نوش کے۔بلاشبہ رسول اللہ ﷺ نے اس میں کوئی حد متعین نہیں فرمائی تھی۔یہ حد ہم نے (مشورے سے) طے کی ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البخاري (6778) ومسلم (1707) من طریق آخر عن أبي حصین بہ`;