var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ وَقَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَتَبَاهَى النَّاسُ فِي الْمَسَاجِدِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’قیامت اس وقت تک نہیں آئے گی جب تک کہ لوگ مساجد میں باہم فخر نہیں کرنے لگیں گے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (719)`;