var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،حَدَّثَنَا صَدَقَةُ يَعْنِي ابْنَ خَالِدٍ،حَدَّثَنَا الشُّعَيْثِيُّ،عَنْ زُفَرَ بْنِ وَثِيمَةَ،عَنْ حَكِيمِ بْنِ حِزَامٍ, أَنَّهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُسْتَقَادَ فِي الْمَسْجِدِ،وَأَنْ تُنْشَدَ فِيهِ الْأَشْعَارُ،وَأَنْ تُقَامَ فِيهِ الْحُدُودُ.";
abudawood.urdu = "سیدنا حکیم بن حزام رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے مسجد میں قصاص لینے،اشعار پڑھنے اور حدیں لگانے سے منع فرمایا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>في سماع زفر بن وثیمۃ من حکیم بن حزام نظر`;
abudawood.anwaar = [158,1];