var abudawood = {};
abudawood.arabic = "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ عَزَّ وَجَلَّ";
abudawood.urdu = "سیدنا ابوبردہ (ہانی بن دینار انصاری رضی اللہ عنہ) سے روایت ہے کہ رسول اللہ ﷺ فرمایا کرتے تھے ’’اللہ کی متعینہ حدود کے علاوہ کسی جرم میں دس کوڑوں سے زیادہ نہ مارے جائیں۔‘‘";
abudawood.hukam = "صحیح بخاری (6848) صحیح مسلم (1708)";
abudawood.description = ``;