var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ بُكَيْرَ بْنَ الْأَشَجِّ حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا بُرْدَةَ الْأَنْصَارِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ مَعْنَاهُ";
abudawood.urdu = "سیدنا ابوبردہ انصاری رضی اللہ عنہ سے روایت ہے،انہوں نے کہا کہ میں نے رسول اللہ ﷺ کو فرماتے سنا،اور مذکورہ بالا روایت کے ہم معنی بیان کیا۔";
abudawood.hukam = "صحیح بخاری (6850) صحیح مسلم (1708)";
abudawood.description = ``;