var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيُّ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُفِعَ إِلَيْهِ شَيْءٌ فِيهِ قِصَاصٌ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں،میں نے دیکھا ہے کہ رسول اللہ ﷺ کے پاس جب بھی کوئی ایسا مقدمہ لایا جاتا جس میں قصاص ہوتا تو آپ ﷺ معاف کرنے کا فرماتے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (4787 وسندہ صحیح) وابن ماجہ (2692 وسندہ صحیح)`;