var abudawood = {};
abudawood.arabic = "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى حَدَّثَنَا أَبُو هَمَّامٍ الدَّلَّالُ مُحَمَّدُ بْنُ مُحَبَّبٍ حَدَّثَنَا سَعِيدُ بْنُ السَّائِبِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عِيَاضٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يَجْعَلَ مَسْجِدَ الطَّائِفِ حَيْثُ كَانَ طَوَاغِيتُهُمْ";
abudawood.urdu = "جناب محمد بن عبداللہ بن عیاض،سیدنا عثمان بن ابی العاص رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی کریم ﷺ نے انہیں حکم دیا تھا کہ طائف کی مسجد اس جگہ بنائی جائے جہاں ان کے بت ہوتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (743)<br>محمد بن عبداﷲ بن عیاض: مجہول الحال،لم یوثقہ غیر ابن حبان وقال الذھبي: لا یعرف (میزان الإعتدال 3/ 602 ت 7767)`;
abudawood.anwaar = [29,1];