var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ قَالَ سَمِعْتُ أَبَا شُرَيْحٍ الْكَعْبِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا إِنَّكُمْ يَا مَعْشَرَ خُزَاعَةَ قَتَلْتُمْ هَذَا الْقَتِيلَ مِنْ هُذَيْلٍ وَإِنِّي عَاقِلُهُ فَمَنْ قُتِلَ لَهُ بَعْدَ مَقَالَتِي هَذِهِ قَتِيلٌ فَأَهْلُهُ بَيْنَ خِيَرَتَيْنِ أَنْ يَأْخُذُوا الْعَقْلَ أَوْ يَقْتُلُوا";
abudawood.urdu = "جناب ابوشریح کعبی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اے بنو خزاعہ! تم نے ہذیل کا یہ آدمی قتل کیا ہے ‘ میں اس کی دیت ادا کرتا ہوں،میری اس بات کے بعد جس کسی کا کوئی آدمی قتل کیا گیا تو اس کے وارثوں کو دو باتوں میں سے ایک کا اختیار ہو گا کہ یا تو دیت لے لیں یا (قصاص میں) قتل کریں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (3457)
أخرجہ الترمذي (1406 وسندہ صحیح)`;