var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا مَطَرٌ الْوَرَّاقُ وَأَحْسَبُهُ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أُعْفِيَ مَنْ قَتَلَ بَعْدَ أَخْذِهِ الدِّيَةَ";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے دیت لینے کے بعد قتل کیا میں اسے نہیں چھوڑوں گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شک الراوي فی السند فالسند معلل<br>والحسن عن جابر کتاب کما فی المراسیل لابن أبي حاتم (ص37) والروایۃ عن کتاب صحیحۃ ما لم یثبت الجرح فیہ`;
abudawood.anwaar = [158,1];