var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنِ ابْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ بِإِسْنَادِ شُعْبَةَ مِثْلَهُ زَادَ: ثُمَّ إِنَّ الْحَسَنَ نَسِيَ هَذَا الْحَدِيثَ،فَكَانَ يَقُولُ: لَا يُقْتَلُ حُرٌّ بِعَبْدٍ";
abudawood.urdu = "جناب قتادہ نے بسند شعبہ مذکورہ بالا روایت کی مثل روایت کیا۔مزید کہا کہ پھر حسن یہ حدیث بھول گئے اور کہا کرتے تھے کہ کسی آزاد کو کسی غلام کے بدلے میں قتل نہیں کیا جائے گا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [159,1];