var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا هُشَيْمٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ نَحْوَ حَدِيثِ عَلِيٍّ زَادَ فِيهِ وَيُجِيرُ عَلَيْهِمْ أَقْصَاهُمْ وَيَرُدُّ مُشِدُّهُمْ عَلَى مُضْعِفِهِمْ وَمُتَسَرِّيهِمْ عَلَى قَاعِدِهِمْ";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے،وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا اور مذکورہ بالا روایت علی کی مانند ذکر دیا۔اس میں اضافہ ہے ’’ان کا (مسلمانوں کا) بعید ترین فرد بھی امان دے سکتا ہے۔اور ان کا تنومند اور قوی رفتار اپنے ضعیف اور سست رفتار کو بھی ساتھ ملائے (مال غنیمت میں اس کو شریک کرے) اور چھوٹے دستے میں جانے والا بڑے لشکر میں رہ جانے والوں کو بھی شریک سمجھے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3496)
أخرجہ ابن ماجہ (2685 وسندہ حسن) وانظر الحدیث السابق (2751)`;