var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ سَعْدَ بْنَ عُبَادَةَ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَأَيْتَ لَوْ وَجَدْتُ مَعَ امْرَأَتِي رَجُلًا أُمْهِلُهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ قَالَ نَعَمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ سیدنا سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ ﷺ سے کہا: فرمائیے کہ اگر میں اپنی بیوی کے ساتھ کسی غیر آدمی کو پاؤں تو کیا اسے چھوڑ دوں حتیٰ کہ چار گواہ لاؤں؟ آپ ﷺ نے فرمایا ’’ہاں۔“";
abudawood.hukam = "صحیح مسلم (1498)";
abudawood.description = ``;