var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي غَالِبٍ،حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ،عَنْ سُلَيْمَانَ بْنِ كَثِيرٍ،حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ،عَنْ طَاوُوسٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... فَذَكَرَ مَعْنَى حَدِيثِ سُفْيَانَ.";
abudawood.urdu = "جناب طاؤس نے سیدنا ابن عباس رضی اللہ عنہما سے روایت کیا،کہا کہ رسول اللہ ﷺ نے فرمایا اور مذکورہ بالا روایت سفیان کی مانند بیان کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (4793 وسندہ صحیح)`;