var abudawood = {};
abudawood.arabic = "قَالَ أَبُو دَاوُد: قَرَأْتُ عَلَى سَعِيدِ ابْنِ يَعْقُوبَ الطَّالْقَانِيِّ،قَالَ: حَدَّثَنَا أَبُو تُمَيْلَةَ،حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ قَالَ ذَكَرَ عَطَاءٌ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... فَذَكَرَ مِثْلَ حَدِيثِ مُوسَى،وَقَالَ: وَعَلَى أَهْلِ الطَّعَامِ شَيْئًا... لَا أَحْفَظُهُ.";
abudawood.urdu = "جناب عطاء (عطاء بن ابی رباح) نے سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت کیا کہ رسول اللہ ﷺ نے (دیت کی شرح) مقرر کی اور مذکورہ بالا حدیث موسیٰ بن اسماعیل کی مانند روایت کی۔اور کہا کہ غلے والوں پر بھی کچھ مقرر کی تھی جو مجھے یاد نہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن`;
abudawood.anwaar = [160,1];