var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الْحَجَّاجُ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ خِشْفِ بْنِ مَالِكٍ الطَّائِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دِيَةِ الْخَطَإِ عِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً وَعِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ بَنِي مَخَاضٍ ذُكُرٍ وَهُوَ قَوْلُ عَبْدِ اللَّهِ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’قتل خطا کی دیت بیس اونٹنیاں تین سالہ،بیس اونٹنیاں چار سالہ،بیس اونٹنیاں ایک سالہ،بیس اونٹنیاں دو سالہ اور بیس اونٹ مذکر ایک سالہ۔‘‘ اور سیدنا عبداللہ رضی اللہ عنہ کا قول بھی یہی ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1386) نسائی (4806) ابن ماجہ (2631)<br>حجاج بن أرطاۃ ضعیف مدلس وعنعن`;
abudawood.anwaar = [160,1];