var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبِنَاءِ الْمَسَاجِدِ فِي الدُّورِ وَأَنْ تُنَظَّفَ وَتُطَيَّبَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے فرماتی ہیں کہ رسول اللہ ﷺ نے حکم دیا کہ محلوں میں مسجدیں بنائی جائیں اور انہیں پاکیزہ،صاف ستھرا اور معطر رکھا جائے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (717)
أخرجہ ابن ماجہ (758) وسندہ صحیح`;