var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ قَالَ قَضَى عُمَرُ فِي شِبْهِ الْعَمْدِ ثَلَاثِينَ حِقَّةً وَثَلَاثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً مَا بَيْنَ ثَنِيَّةٍ إِلَى بَازِلِ عَامِهَا";
abudawood.urdu = "مجاہد روایت کرتے ہیں کہ سیدنا عمر رضی اللہ عنہ نے شبہ عمد میں فیصلہ کیا تھا کہ تیس اونٹنیاں تین سالہ،تیس اونٹنیاں چار سالہ اور چالیس اونٹنیاں جو حاملہ ہوں اور ان کی عمر میں دو دانتا یعنی چھٹے سے لے کر نویں سال میں شروع ہونے والی کے درمیان ہوں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن أبي نجیح عنعن و مجاہد لم یسمع من عمر رضي اللّٰہ عنہ<br>فالسند منقطع`;
abudawood.anwaar = [160,1];