var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ فِي شِبْهِ الْعَمْدِ أَثْلَاثٌ ثَلَاثٌ وَثَلَاثُونَ حِقَّةً وَثَلَاثٌ وَثَلَاثُونَ جَذَعَةً وَأَرْبَعٌ وَثَلَاثُونَ ثَنِيَّةً إِلَى بَازِلِ عَامِهَا وَكُلُّهَا خَلِفَةٌ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے مروی ہے انہوں نے فرمایا کہ شبہ عمد کی دیت میں اونٹ تین قسموں کے ہوں: تینتیس اونٹنیاں تین سالہ،تینتیس اونٹنیاں چار سالہ اور چونتیس اونٹنیاں چھ سے نو سالہ کے درمیان ہوں اور (یہ آخری) سب حاملہ ہوں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن`;
abudawood.anwaar = [160,1];