var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ قَالَ قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فِي الْخَطَإِ أَرْبَاعًا خَمْسٌ وَعِشْرُونَ حِقَّةً وَخَمْسٌ وَعِشْرُونَ جَذَعَةً وَخَمْسٌ وَعِشْرُونَ بَنَاتِ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ بَنَاتِ مَخَاضٍ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ شبہ عمد کی دیت میں اونٹوں کی تفصیل یہ ہے کہ پچیس اونٹنیاں تین سالہ،پچیس اونٹنیاں چار سالہ،پچیس اونٹنیاں دو سالہ اور پچیس اونٹنیاں ایک سالہ ہوں";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیثین السابقین (4551،4552)`;
abudawood.anwaar = [161,1];