var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ عَبْدِ رَبِّهِ عَنْ أَبِي عِيَاضٍ عَنْ عُثْمَانَ بْنِ عَفَّانَ وَزَيْدِ بْنِ ثَابِتٍ فِي الْمُغَلَّظَةِ أَرْبَعُونَ جَذَعَةً خَلِفَةً وَثَلَاثُونَ حِقَّةً وَثَلَاثُونَ بَنَاتِ لَبُونٍ وَفِي الْخَطَإِ ثَلَاثُونَ حِقَّةً وَثَلَاثُونَ بَنَاتِ لَبُونٍ وَعِشْرُونَ بَنُو لَبُونٍ ذُكُورٌ وَعِشْرُونَ بَنَاتِ مَخَاضٍ";
abudawood.urdu = "سیدنا عثمان بن عفان اور زید بن ثابت رضی اللہ عنہما سے مروی ہے کہ مغلظ دیت کی تفصیل یہ ہے کہ چالیس اونٹنیاں چار سالہ اور حاملہ،تیس اونٹنیاں تین سالہ اور تیس اونٹنیاں دو سالہ ہوں اور قتل خطا میں تیس اونٹنیاں تین سالہ،تیس اونٹنیاں دو سالہ،بیس اونٹ مذکر دو سالہ اور بیس اونٹنیاں ایک سالہ۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
abudawood.anwaar = [161,1];