var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ زَيْدِ بْنِ ثَابِتٍ فِي الدِّيَةِ الْمُغَلَّظَةِ... فَذَكَرَ مِثْلَهُ سَوَاءً.";
abudawood.urdu = "جناب سعید بن مسیب نے سیدنا زید بن ثابت رضی اللہ عنہ سے دیت مغلظہ میں مذکورہ بالا کی طرح بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سعید بن أبي عروبۃ وقتادۃ مدلسان وعنعنا`;
abudawood.anwaar = [161,1];