var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا عَبْدَةُ يَعْنِي ابْنَ سُلَيْمَانَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ غَالِبٍ التَّمَّارِ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ مَسْرُوقِ بْنِ أَوْسٍ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَصَابِعُ سَوَاءٌ عَشْرٌ عَشْرٌ مِنْ الْإِبِلِ";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’انگلیاں سب برابر ہیں۔(ہر ایک کی دیت) دس دس اونٹ ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ ابن ماجہ (2654 وسندہ صحیح) سعید بن أبي عروبۃ صرح بالسماع عند البیھقي (8/92)`;