var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح و حَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ كُلُّهُمْ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ وَهَذِهِ سَوَاءٌ يَعْنِي الْإِبْهَامَ وَالْخِنْصَرَ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے،وہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’یہ اور یہ برابر ہیں۔‘‘ یعنی انگوٹھا اور چھنگلیا۔";
abudawood.hukam = "صحیح بخاری (6895)";
abudawood.description = ``;