var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ سُلَيْمَانَ بْنِ سَمُرَةَ عَنْ أَبِيهِ سَمُرَةَ أَنَّهُ كَتَبَ إِلَى ابْنِهِ أَمَّا بَعْدُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا بِالْمَسَاجِدِ أَنْ نَصْنَعَهَا فِي دِيَارِنَا وَنُصْلِحَ صَنْعَتَهَا وَنُطَهِّرَهَا";
abudawood.urdu = "جناب سلیمان بن سمرہ اپنے والد سیدنا سمرہ رضی اللہ عنہ (سمرہ بن جندب) سے روایت کرتے ہیں کہ سیدنا سمرہ رضی اللہ عنہ نے اپنے بیٹوں کی طرف لکھا تھا کہ رسول اللہ ﷺ ہمیں تعمیر مساجد کا حکم دیا کرتے تھے کہ محلے میں ان کی تعمیر کریں اور ان کی عمارت عمدہ بنائیں اور انہیں پاکیزہ رکھیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خبیب بن سلیمان: مجھول (تقریب: 1700)<br>وجعفر بن سعد: ضعیف،ضعفہ الجمھور`;
abudawood.anwaar = [29,2];