var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ أَخْبَرَنَا أَبُو حَمْزَةَ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَسْنَانُ سَوَاءٌ وَالْأَصَابِعُ سَوَاءٌ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’دانت سب برابر ہیں اور انگلیاں (سب) برابر ہیں۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ ابن ماجہ (2651 وسندہ صحیح) ورواہ الترمذي (1391 وسندہ صحیح)`;