var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانَ حَدَّثَنَا أَبُو تُمَيْلَةَ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَ الْيَدَيْنِ وَالرِّجْلَيْنِ سَوَاءً";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما فرماتے ہیں کہ رسول اللہ ﷺ نے دونوں ہاتھ اور دونوں پاؤں کی انگلیاں،سب برابر قرار دی ہیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3494)
انظر الحدیث السابق (4560)`;