var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي خُطْبَتِهِ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ فِي الْأَصَابِعِ عَشْرٌ عَشْرٌ";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے وہ اپنے دادا سے روایت کرتے ہیں کہ بی کریم ﷺ نے اپنے خطبے میں ارشاد فرمایا جب کہ آپ ﷺ اپنی کمر کعبہ سے لگائے ہوئے تھے ’’انگلیوں میں دس دس اونٹ ہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (4855 وسندہ حسن)`;