var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ أَبُو خَيْثَمَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْأَسْنَانِ خَمْسٌ خَمْسٌ";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے وہ اپنے دادا سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’دانتوں میں پانچ پانچ اونٹ ہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ النسائي (4845 وسندہ حسن) وانظر الحدیث السابق (4552)`;