var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ السُّلَمِيُّ حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ مُحَمَّدٍ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ حَدَّثَنِي الْعَلَاءُ بْنُ الْحَارِثِ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَيْنِ الْقَائِمَةِ السَّادَّةِ لِمَكَانِهَا بِثُلُثِ الدِّيَةِ";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے،وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے آنکھ کی چوٹ میں فیصلہ فرمایا کہ آنکھ اگر اپنی جگہ قائم رہے (اور بینائی جاتی رہے) تو اس میں تہائی دیت ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3502)
أخرجہ النسائي (4844 وسندہ حسن)`;