var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ مَنْصُورٍ... بِإِسْنَادِهِ وَمَعْنَاهُ. وَزَادَ: فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَةَ الْمَقْتُولَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ،وَغُرَّةً لِمَا فِي بَطْنِهَا. قَالَ أَبُو دَاوُد: وَكَذَلِكَ رَوَاهُ الْحَكَمُ،عَنْ مُجَاهِدٍ عَنِ الْمُغِيرَةِ.";
abudawood.urdu = "منصور نے اپنی سند سے مذکورہ بالا کے ہم معنی روایت کیا۔اور مزید کہا کہ نبی کریم ﷺ نے مقتولہ عورت کی دیت قاتلہ کے وارثوں کے ذمے ڈالی اور اس کے پیٹ کے بچے کے بدلے میں ایک غلام لازم کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ حکم نے بواسطہ مجاہد،سیدنا مغیرہ رضی اللہ عنہ سے اسی طرح روایت کیا ہے۔";
abudawood.hukam = "صحیح مسلم (1682)";
abudawood.description = ``;