var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ،عَنْ هِشَامٍ،عَنْ أَبِيهِ عَنِ الْمُغِيرَةِ،عَنْ عُمَرَ بِمَعْنَاهُ.\nقَالَ أَبُو دَاوُد: رَوَاهُ حَمَّادُ بْنُ زَيْدٍ وَحَمَّادُ بْنُ سَلَمَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ أَنَّ عُمَرَ قَالَ";
abudawood.urdu = "سیدنا مغیرہ رضی اللہ عنہ نے سیدنا عمر رضی اللہ عنہ سے مذکورہ بالا حدیث کے ہم معنی روایت کیا۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ اس روایت کو حماد بن زید اور حماد بن سلمہ نے ہشام بن عروہ سے اس نے اپنے والد سے روایت کیا کہ بیشک عمر رضی اللہ عنہ نے کہا۔";
abudawood.hukam = "صحیح بخاری (6905)";
abudawood.description = ``;