var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ،حَدَّثَنَا سُفْيَانُ،عَنْ عَمْرٍو،عَنْ طَاوُسٍ،قَالَ: قَامَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ عَلَى الْمِنْبَرِ... فَذَكَرَ مَعْنَاهُ،لَمْ يَذْكُرْ: وَأَنْ تُقْتَلَ،زَادَ: بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ. قَالَ: فَقَالَ عُمَرُ: اللَّهُ أَكْبَرُ،لَوْ لَمْ أَسْمَعْ بِهَذَا لَقَضَيْنَا بِغَيْرِ هَذَا";
abudawood.urdu = "جناب طاؤس کہتے ہیں کہ سیدنا عمر رضی اللہ عنہ منبر پر کھڑے ہوئے اور مذکورہ بالا حدیث کے ہم معنی بیان کیا مگر اس میں ’’اس عورت (قاتلہ) کے قتل کیے جانے کا ذکر نہیں کیا۔“ البتہ (جنین کے بدلے میں) ایک غلام یا لونڈی دیے جانے کا بیان کیا۔طاؤس نے کہا: اس پر سیدنا عمر رضی اللہ عنہ نے کہا: «اللہ اکبر»،اگر میں یہ نہ سنتا تو اس کے علاوہ کوئی اور فیصلہ کر بیٹھتا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>طاووس لم یسمع من عمر رضي اللّٰہ عنہ (قال أبو زرعۃ : طاوس عن عمر : مرسل / المراسیل ص 100)`;
abudawood.anwaar = [161,1];