var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ عَنِ ابْنِ شِهَابٍ عَنِ ابْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ.. فِي هَذِهِ الْقِصَّةِ،قَالَ: ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ،فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَنَّ مِيرَاثَهَا لِبَنِيهَا, وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا.";
abudawood.urdu = "جناب ابن مسیب نے سیدنا ابوہریرہ رضی اللہ عنہ سے اس قصے میں روایت کیا کہ پھر وہ عورت جس کو آپ نے غلام یا لونڈی دلوائی فوت ہو گئی تو رسول اللہ ﷺ نے فیصلہ کر دیا کہ اس کی وراثت اس کے بیٹے کو ملے اور (قاتلہ کی طرف سے) دیت اس کے عصبہ (عاقلہ) پر ڈالی۔";
abudawood.hukam = "صحیح بخاری (6740) صحیح مسلم (1681)";
abudawood.description = ``;