var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَهْلُ بْنُ تَمَّامِ بْنِ بَزِيعٍ حَدَّثَنَا عُمَرُ بْنُ سُلَيْمٍ الْبَاهِلِيُّ عَنْ أَبِي الْوَلِيدِ سَأَلْتُ ابْنَ عُمَرَ عَنْ الْحَصَى الَّذِي فِي الْمَسْجِدِ فَقَالَ مُطِرْنَا ذَاتَ لَيْلَةٍ فَأَصْبَحَتْ الْأَرْضُ مُبْتَلَّةً فَجَعَلَ الرَّجُلُ يَأْتِي بِالْحَصَى فِي ثَوْبِهِ فَيَبْسُطُهُ تَحْتَهُ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ قَالَ مَا أَحْسَنَ هَذَا";
abudawood.urdu = "جناب ابوالولید کہتے ہیں کہ میں نے سیدنا ابن عمر رضی اللہ عنہما سے مسجد میں کنکریوں کے متعلق پوچھا (کہ بچھائی جائیں یا نہیں) تو انہوں نے کہا کہ ہمیں ایک رات بارش ہو گئی اور زمین گیلی ہو گئی تو ہر آدمی اپنے کپڑے میں کنکریاں لے آتا اور اپنے نیچے بچھا لیتا۔جب رسول اللہ ﷺ نماز سے فارغ ہوئے تو فرمایا ’’کس قدر اچھا کام ہے یہ۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الولید: مجہول (تقریب: 8439)`;
abudawood.anwaar = [30,1];