var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ الْعَوَقِيُّ حَدَّثَنَا شَرِيكٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ وَجَابِرٍ عَنْ الشَّعْبِيِّ قَالَ الْغُرَّةُ خَمْسُ مِائَةِ دِرْهَمٍ قَالَ أَبُو دَاوُد قَالَ رَبِيعَةُ الْغُرَّةُ خَمْسُونَ دِينَارًا";
abudawood.urdu = "جناب شعبی سے مروی ہے کہ لونڈی غلام کی قیمت پانچ سو درہم ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں ربیعہ نے کہا کہ لونڈی غلام کی قیمت پچاس دینار ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شریک ومغیرۃ عنعنا و جابر الجعفي ضعیف مدلس وقال الحافظ ابن حجر : ضعفہ الجمھور (طبقات المدلسین 5/133) وقال العراقي : ضعفہ الجمھور (تخریج احیاء علوم الدین 285/4)`;
abudawood.anwaar = [161,1];