var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ و حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا حَجَّاجٌ الصَّوَّافُ جَمِيعًا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دِيَةِ الْمُكَاتَبِ يُقْتَلُ يُودَى مَا أَدَّى مِنْ مُكَاتَبَتِهِ دِيَةَ الْحُرِّ وَمَا بَقِيَ دِيَةَ الْمَمْلُوكِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے مکاتب،جو قتل کر دیا جائے،کی دیت کے سلسلے میں فیصلہ فرمایا کہ وہ جس قدر حصہ اپنی کتابت کا ادا کر چکا ہو اس نسبت سے آزاد آدمی کی دیت دی جائے اور جس قدر باقی ہو اس میں غلام کی دیت دی جائے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4814)<br>یحیی بن أبي کثیر مدلس وعنعن`;
abudawood.anwaar = [161,1];