var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الرَّمْلِيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دِيَةُ الْمُعَاهِدِ نِصْفُ دِيَةِ الْحُرِّ قَالَ أَبُو دَاوُد رَوَاهُ أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ وَعَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ عَنْ عَمْرِو بْنِ شُعَيْبٍ مِثْلَهُ";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد سے وہ اپنے داد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’عہد والے (ذمی) کی دیت آزاد سے آدھی ہے۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ اس روایت کو اسامہ بن زید لیثی اور عبدالرحمٰن بن حارث نے عمرو بن شعیب سے اسی کی مثل روایت کیا ہے۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3496)
وأخرجہ الترمذي (1413 وسندہ حسن) والنسائي (4810، 4811 وسندھما حسن) وابن ماجہ (2644 وسندہ حسن)`;