var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ،أَخْبَرَنَا هُشَيْمٌ،حَدَّثَنَا حَجَّاجٌ وَعَبْدُ الْمَلِكِ،عَنْ عَطَاءٍ،عَنْ يَعْلَى بْنِ أُمَيَّةَ... بِهَذَا،زَادَ ثُمَّ قَالَ-يَعْنِي: النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْعَاضِّ-: إِنْ شِئْتَ أَنْ تُمَكِّنَهُ مِنْ يَدِكَ فَيَعَضُّهَا،ثُمَّ تَنْزِعُهَا مِنْ فِيهِ. وَأَبْطَلَ دِيَةَ أَسْنَانِهِ.";
abudawood.urdu = "سیدنا یعلیٰ بن امیہ نے یہ روایت بیان کی اور مزید کہا کہ پھر نبی کریم ﷺ نے دانت سے کاٹنے والے سے کہا ’’اگر چاہو تو اپنا ہاتھ اس کے منہ میں دے دو،وہ بھی اسی طرح کاٹے جیسے کہ تم نے کاٹا تھا اور تم بھی اپنا ہاتھ کھینچ لینا۔‘‘ الغرض آپ ﷺ نے اس کے دانتوں کی دیت ضائع قرار دی۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4584)`;