var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصٌ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ حَدَّثَنِي بَعْضُ الْوَفْدِ الَّذِينَ قُدِمُوا عَلَى أَبِي قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا طَبِيبٍ تَطَبَّبَ عَلَى قَوْمٍ لَا يُعْرَفُ لَهُ تَطَبُّبٌ قَبْلَ ذَلِكَ فَأَعْنَتَ فَهُوَ ضَامِنٌ قَالَ عَبْدُ الْعَزِيزِ أَمَا إِنَّهُ لَيْسَ بِالنَّعْتِ إِنَّمَا هُوَ قَطْعُ الْعُرُوقِ وَالْبَطُّ وَالْكَيُّ";
abudawood.urdu = "جناب عبدالعزیز بن عمر بن عبدالعزیز سے روایت ہے کہ ایک وفد کے لوگ جو میرے والد کے پاس آئے تھے ان میں سے ایک نے کہا کہ رسول ﷺ نے فرمایا ’’جو معالج کسی قوم میں طبیب بنا پھرتا ہو،جب کہ اس سے پہلے وہ علم طب میں معروف نہ ہو اور کسی کا نقصان کر دے تو وہ ذمہ دار ہے۔‘‘ عبدالعزیز نے کہا: یہ ضمانت دوا بتانے میں نہیں بلکہ یہ رگ کاٹنے،چیرا دینے یا داغ دینے کی صورت میں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>بعض الوفد مجھول`;
abudawood.anwaar = [162,1];