var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ غُلَامًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ فَأَتَى أَهْلُهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا أُنَاسٌ فُقَرَاءُ فَلَمْ يَجْعَلْ عَلَيْهِ شَيْئًا";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ فقیر لوگوں کا ایک غلام تھا،اس نے امیر لوگوں کے ایک غلام کا کان کاٹ دیا یہ (امیر) لوگ نبی کریم ﷺ کے پاس مقدمہ لے آئے تو دوسروں نے جواب دیا کہ اے اللہ کے رسول! ہم لوگ فقیر ہیں،تو آپ ﷺ نے ان پر کوئی چیز نہ ڈالی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (4755)<br>قتادۃ عنعن`;
abudawood.anwaar = [162,1];