var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرِّجْلُ جُبَارٌ قَالَ أَبُو دَاوُد الدَّابَّةُ تَضْرِبُ بِرِجْلِهَا وَهُوَ رَاكِبٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ رسول اللہ ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’(جانور کا) لات مار دینا ضائع ہے۔اور معدنی کان (کا نقصان) ضائع ہے۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ جانور کا مالک اس پر سوار ہو اور وہ لات مار دے (تو ضائع ہے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سفیان بن حسین ضعیف عن الزھري وصحیح الحدیث عن غیرہ`;
abudawood.anwaar = [162,1];