var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ ح و حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ حَدَّثَنَا زَيْدُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبْدُ الْمَلِكِ الصَّنْعَانِيُّ كِلَاهُمَا عَنْ مَعْمَرٍ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّارُ جُبَارٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’آگ (سے ہونے والا نقصان) ضائع ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2952)
أخرجہ ابن ماجہ (2676 وسندہ صحیح)`;