var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ رَجُلٍ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الْأَعْمَالِ الْحُبُّ فِي اللَّهِ وَالْبُغْضُ فِي اللَّهِ";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’اعمال میں سے افضل عمل اللہ کے لیے محبت کرنا اور اسی کے لیے بغض رکھنا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یزید بن أبي زیاد ضعیف والرجل : مجہول`;
abudawood.anwaar = [162,1];