var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ يَرْفَعُهُ قَالَ لَوْلَا أَنْ أَشُقَّ عَلَى الْمُؤْمِنِينَ لَأَمَرْتُهُمْ بِتَأْخِيرِ الْعِشَاءِ وَبِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ رسول اللہ ﷺ کی طرف نسبت کرتے ہوئے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’اگر اہل ایمان کے لیے مشقت نہ ہوتی تو میں انہیں نماز عشاء کو تاخیر سے پڑھنے اور ہر نماز کے وقت مسواک کرنے کا حکم دیتا۔‘‘";
abudawood.hukam = "صحیح بخاری (887، 7240) صحیح مسلم (252)";
abudawood.description = ``;