var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ أَبُو بَكْرٍ يَعْنِي الصَّاغَانِيَّ حَدَّثَنَا أَبُو بَدْرٍ شُجَاعُ بْنُ الْوَلِيدِ حَدَّثَنَا شَرِيكٌ حَدَّثَنَا أَبُو حُصَيْنٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو بَدْرٍ أُرَاهُ قَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْحَصَاةَ لَتُنَاشِدُ الَّذِي يُخْرِجُهَا مِنْ الْمَسْجِدِ";
abudawood.urdu = "جناب ابوصالح،سیدنا ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ ابوبدر (سند کے ایک راوی) نے کہا،میرا خیال ہے کہ انہوں نے نبی کریم ﷺ سے مرفوع بیان کیا ہے کہ آپ ﷺ نے فرمایا ’’جو آدمی کنکریوں کو مسجد سے نکالتا ہے تو وہ اسے اللہ کا واسطہ دیتی ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>قال الدار قطني: ’’رفعہ وھم من أبي بدر ‘‘ (الترغیب والترہیب 1 / 205) وأبو بدر شک في رفعہ والصواب موقوف`;
abudawood.anwaar = [30,1];