var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَطَاءٌ الْخُرَاسَانِيُّ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ قَدِمْتُ عَلَى أَهْلِي وَقَدْ تَشَقَّقَتْ يَدَايَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ وَقَالَ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ";
abudawood.urdu = "سیدنا عمار بن یاسر رضی اللہ عنہما بیان کرتے ہیں کہ میں اپنے گھر والوں کے پاس پہنچا اور حالت یہ تھی کہ میرے ہاتھ پھٹ گئے تھے۔تو انہوں نے مجھے (میرے ہاتھوں پر) زعفران لگا دیا۔صبح کے وقت میں نبی کریم ﷺ کی خدمت میں حاضر ہوا اور میں نے سلام عرض کیا تو آپ نے مجھے جواب نہ دیا اور فرمایا ’’جاؤ اسے دھو ڈالو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیثان السابقان (225،4176)`;
abudawood.anwaar = [162,1];