var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ جُرَيْجٍ،قَالَ: حَدَّثَنِي سُلَيْمَانُ يَعْنِي ابْنَ عَتِيقٍ،عَنْ طَلْقِ بْنِ حَبِيبٍ عَنِ الْأَحْنَفِ بْنِ قَيْسٍ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: أَلَا هَلَكَ الْمُتَنَطِّعُونَ،ثَلَاثَ مَرَّاتٍ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’خبردار! غلو کرنے والے،حد سے بڑھنے والے ہلاک ہوئے۔‘‘ آپ ﷺ نے یہ بات تین بار فرمائی۔";
abudawood.hukam = "صحیح مسلم (2670)";
abudawood.description = ``;