var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ عَامِرِ بْنِ سَعْدٍ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَعْظَمَ الْمُسْلِمِينَ فِي الْمُسْلِمِينَ جُرْمًا: مَنْ سَأَلَ عَنْ أَمْرٍ لَمْ يُحَرَّمْ،فَحُرِّمَ عَلَى النَّاسِ مِنْ أَجْلِ مَسْأَلَتِهِ";
abudawood.urdu = "جناب عامر بن سعد اپنے والد (سیدنا سعد بن ابی وقاص رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مسلمانوں میں جرم کے اعتبار سے سب سے بڑا (مجرم) وہ مسلمان ہے جس نے کسی ایسی بات کے بارے میں سوال کیا جو پہلے حرام نہ تھی،مگر اس کے سوال کرنے کے باعث حرام کر دی گئی۔‘‘";
abudawood.hukam = "صحیح بخاری (7289) صحیح مسلم (2358)";
abudawood.description = ``;