var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا إِسْمَاعِيلُ،حَدَّثَنَا خَالِدٌ الْحَذَّاءُ،قَالَ: قُلْتُ لِلْحَسَنِ: مَا أَنْتُمْ عَلَيْهِ بِفَاتِنِينَ. إِلَّا مَنْ هُوَ صَالِ الْجَحِيمِ[الصافات: 162-163]؟ قَالَ: إِلَّا مَنْ أَوْجَبَ اللَّهُ تَعَالَى عَلَيْهِ أَنَّهُ يَصْلَى الْجَحِيمَ.";
abudawood.urdu = "خالد الحذاء کہتے ہیں کہ میں نے سیدنا حسن بصری رحمہ اللہ سے آیت کریمہ «ما أنتم علیہ بفاتنین * إلا من ہو صال الجحیم» (کی تفسیر) کے متعلق دریافت کیا تو انہوں نے فرمایا کہ یہ اللہ تعالیٰ نے اسی کے لیے لازم کیا ہے جو جہنم میں جلنے والا ہوا۔(یہ مذکورہ بالا روایت 4614 کی مانند ہے۔)";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;