var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هِلَالُ بْنُ بِشْرٍ،قَالَ:،حَدَّثَنَا حَمَّادٌ،قَالَ:،أَخْبَرَنِي حُمَيْدٌ: كَانَ الْحَسَنُ, يَقُولُ: لَأَنْ يُسْقَطَ مِنْ السَّمَاءِ إِلَى الْأَرْضِ أَحَبُّ إِلَيْهِ مِنْ أَنْ يَقُولَ: الْأَمْرُ بِيَدِي!";
abudawood.urdu = "جناب حمید سے منقول ہے کہ سیدنا حسن بصری رحمہ اللہ کہا کرتے تھے کہ آسمان سے زمین پر گر پڑنا مجھے اس سے زیادہ پسند ہے کہ میں یوں کہوں کہ معاملہ میرے ہاتھ میں ہے۔(مقصد یہ ہے کہ تقدیر کا انکار مجھے ہرگز ہرگز گوارا نہیں)";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حمید الطویل عنعن`;
abudawood.anwaar = [162,2];