var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ كَثِيرٍ،قَالَ:،أَخْبَرَنَا سُفْيَانُ،عَنْ حُمَيْدٍ الطَّوِيلِ،عَنْ الْحَسَنِ: كَذَلِكَ نَسْلُكُهُ فِي قُلُوبِ الْمُجْرِمِينَ[الحجر: 12], قَالَ: الشِّرْكُ.";
abudawood.urdu = "جناب حمید الطویل نے سیدنا حسن بصری رحمہ اللہ سے روایت کیا کہ انہوں نے اس آیت کریمہ «کذلک نسلکہ فی قلوب المجرمین» ’’ایسے ہی ہم یہ بات مجرموں کے دلوں میں ڈال دیتے ہیں۔‘‘ کی تفسیر میں کہا: اس سے مراد ’’شرک‘‘ ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سفیان الثوري و حمید الطویل عنعنا`;
abudawood.anwaar = [163,1];