var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،قَالَ:،أَخْبَرَنَا سُفْيَانُ،عَنْ رَجُلٍ قَدْ سَمَّاهُ غَيْرِ ابْنِ كَثِيرٍ،عَنْ سُفْيَانَ،عَنْ عُبَيْدٍ الصِّيدِ،عَنْ الْحَسَنِ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ: وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ[سبأ: 54], قَالَ: بَيْنَهُمْ وَبَيْنَ الْإِيمَانِ.";
abudawood.urdu = "عبید الصید،سیدنا حسن بصری رحمہ اللہ سے روایت کرتے ہیں کہ انہوں نے آیت کریمہ «وحیل بینہم وبین ما یشتہون» کی تفسیر میں کہا کہ ان کے اور ان کے ایمان لانے کی خواہش میں رکاوٹ کر دی جائے گی";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سفیان الثوري عنعن`;
abudawood.anwaar = [163,1];