var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا سُلَيْمٌ،عَنْ ابْنِ عَوْنٍ،قَالَ: كُنْتُ أَسِيرُ بِالشَّامِ،فَنَادَانِي رَجُلٌ مِنْ خَلْفِي،فَالْتَفَتُّ, فَإِذَا رَجَاءُ بْنُ حَيْوَةَ،فَقَالَ: يَا أَبَا عَوْنٍ مَا هَذَا الَّذِي يَذْكُرُونَ عَنْ الْحَسَنِ؟! قَالَ: قُلْتُ: إِنَّهُمْ يَكْذِبُونَ عَلَى الْحَسَنِ كَثِيرًا.";
abudawood.urdu = "جناب ابن عون کہتے ہیں کہ میں ملک شام میں تھا کہ پیچھے سے کسی نے مجھ کو آواز دی۔میں متوجہ ہوا تو دیکھا کہ جناب رجاء بن حیوہ تھے۔انہوں نے کہا: ابو عون! یہ کیا باتیں ہیں جو لوگ حسن بصری کے متعلق کہہ رہے ہیں؟ میں نے کہا: یہ لوگ حسن پر بہت جھوٹ بول رہے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سلیم صوابہ سلیمان وھو أبو خالد سلیمان بن حیان الأحمر مدلس (جزء القرا ء ۃ بتحقیقي : 267) وعنعن`;
abudawood.anwaar = [163,1];