var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ،قَالَ:،حَدَّثَنَا حَمَّادٌ،قَالَ: سَمِعْتُ أَيُّوبَ،يَقُولُ: كَذَبَ عَلَى الْحَسَنِ ضَرْبَانِ مِنْ النَّاسِ: قَوْمٌ الْقَدَرُ رَأْيُهُمْ،وَهُمْ يُرِيدُونَ أَنْ يُنَفِّقُوا بِذَلِكَ رَأْيَهُمْ،وَقَوْمٌ لَهُ فِي قُلُوبِهِمْ شَنَآنٌ وَبُغْضٌ, يَقُولُونَ: أَلَيْسَ مِنْ قَوْلِهِ كَذَا؟! أَلَيْسَ مِنْ قَوْلِهِ كَذَا؟!";
abudawood.urdu = "ایوب نے بیان کیا کہ سیدنا حسن بصری رحمہ اللہ پر جھوٹ بولنے والے دو طرح کے لوگ ہیں۔ایک وہ جو تقدیر کے منکر ہیں۔ان کی خواہش ہے کہ اس طرح سے اپنی بات اور رائے کو شہرت دے لیں اور عام کر دیں۔اور دوسرے وہ ہیں جن کے دلوں میں بغض اور عداوت ہے (اور اس طرح باتیں کرتے ہیں) کیا یہ اس کا قول نہیں،کیا اس نے اس طرح نہیں کہا ہے؟ وغیرہ۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;