var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ،قَالَا: حَدَّثَنَا مُؤَمَّلُ بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ ابْنِ عَوْنٍ،قَالَ: لَوْ عَلِمْنَا أَنَّ كَلِمَةَ الْحَسَنِ تَبْلُغُ مَا بَلَغَتْ, لَكَتَبْنَا بِرُجُوعِهِ كِتَابًا،وَأَشْهَدْنَا عَلَيْهِ شُهُودًا،وَلَكِنَّا قُلْنَا: كَلِمَةٌ خَرَجَتْ لَا تُحْمَلُ.";
abudawood.urdu = "ابن عون نے کہا اگر ہمیں یہ علم ہوتا کہ حسن بصری کی کہی ہوئی بات اس حد تک پہنچ جائے گی جہاں تک کہ پہنچی تو ہم ان کے رجوع کے متعلق ایک کتاب لکھتے اور اس پر گواہیاں قائم کرتے۔لیکن ہم سمجھے کہ ایک بات تھی جو ہو گئی سو ہو گئی،مشہور نہ ہو گی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مؤمل بن إسماعیل حسن الحدیث وثقہ الجمھور`;