var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَنْبَسَةُ،حَدَّثَنَا يُونُسُ عَنِ ابْنِ شِهَابٍ،قَالَ: قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ إِنَّ ابْنَ عُمَرَ،قَالَ: كُنَّا نَقُولُ-وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيٌّ أَفْضَلُ أُمَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَهُ أَبُو بَكْرٍ،ثُمَّ عُمَرُ،ثُمَّ عُثْمَانُ, رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ ہم کہا کرتے تھے جبکہ رسول اللہ ﷺ حیات تھے: نبی کریم ﷺ کی امت میں آپ ﷺ کے بعد سب سے افضل ابوبکر ہیں،پھر عمر اور پھر عثمان رضی اللہ عنہم۔اللہ ان سب سے راضی ہو۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (6025)
أخرجہ ابن أبي عاصم فی السنۃ (1140 وسندہ صحیح) نحو المعنٰی`;