var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ،حَدَّثَنَا إِسْمَاعِيلُ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،قَالَ: قَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِي اللَّهُ عَنْهُ بِمَعْنَاهُ وَهُوَ أَصَحُّ.";
abudawood.urdu = "جناب نافع نے کہا کہ سیدنا عمر رضی اللہ عنہ نے فرمایااور مذکورہ بالا حدیث کے ہم معنی بیان کیا۔اور یہ (زیادت یعنی سیدنا عمر رضی اللہ عنہ کا قول ہونا) زیادہ صحیح ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نافع لم یدرک عمر رضي اللّٰہ عنہ،انظر اتحاف المھرۃ لابن حجر (12/ 386)`;
abudawood.anwaar = [30,1];