var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ،حَدَّثَنَا مُحَمَّدٌ يَعْنِي الْفِرْيَابِيَّ،قَالَ: سَمِعْتُ سُفْيَانَ،يَقُولُ: مَنْ زَعَمَ أَنَّ عَلِيًّا عَلَيْهِ السَّلَام كَانَ أَحَقَّ بِالْوِلَايَةِ مِنْهُمَا, فَقَدْ خَطَّأَ أَبَا بَكْرٍ،وَعُمَرَ،وَالْمُهَاجِرِينَ،وَالْأَنْصَارَ! وَمَا أُرَاهُ يَرْتَفِعُ لَهُ مَعَ هَذَا عَمَلٌ إِلَى السَّمَاءِ.";
abudawood.urdu = "جناب سفیان ثوری کہا کرتے تھے جس شخص کا یہ گمان ہو کہ سیدنا علی رضی اللہ عنہ،سیدنا ابوبکر رضی اللہ عنہ اور سیدنا عمر رضی اللہ عنہ کی نسبت خلافت کے زیادہ حقدار تھے تو اس نے سیدنا ابوبکر،سیدنا عمر،مہاجرین اور انصار رضی اللہ عنہم کو غلطی پر سمجھا۔اور میں نہیں سمجھتا کہ اس عقیدہ کے ہوتے ہوئے اس کا کوئی عمل آسمان کی طرف اٹھتا ہو۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;