var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا قَبِيصَةُ،حَدَّثَنَا عَبَّادٌ السَّمَّاكُ،قَالَ: سَمِعْتُ سُفْيَانَ الثَّوْرِيَّ،يَقُولُ: الْخُلَفَاءُ خَمْسَةٌ: أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَعَلِيٌّ وَعُمَرُ بْنُ عَبْدِ الْعَزِيزِ رَضِيَ اللَّهُ عَنْهُمْ.";
abudawood.urdu = "جناب سفیان ثوری کہا کرتے تھے کہ خلفاء پانچ ہیں یعنی ابوبکر رضی اللہ عنہ،عمر رضی اللہ عنہ،عثمان رضی اللہ عنہ،علی رضی اللہ عنہ اور عمر بن عبدالعزیز رحمہ اللہ۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عباد السماک :مجہول (تق: 3156)`;
abudawood.anwaar = [163,1];