var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ،عَنِ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... بِهَذِهِ الْقِصَّةِ،قَالَ: فَأَبَى أَنْ يُخْبِرَهُ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے نبی کریم ﷺ سے یہ مذکورہ بالا قصہ بیان کیا،کہا کہ آپ ﷺ نے (غلطی کی وضاحت کرنے سے) انکار فرما دیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4632)`;