var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ،حَدَّثَنَا الْوَلِيدُ،حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ،عَنْ مَكْحُولٍ،قَالَ: لَتَمْخُرَنَّ الرُّومُ الشَّامَ أَرْبَعِينَ صَبَاحًا،لَا يَمْتَنِعُ مِنْهَا إِلَّا دِمَشْقَ وَعَمَّانَ.";
abudawood.urdu = "جناب مکحول رحمہ اللہ سے روایت ہے انہوں نے کہا ضرور ایسا ہو گا کہ رومی لوگ چالیس دن تک شامیوں کے گھروں میں گھسے رہیں گے۔اس (فتنے) سے سوائے دمشق اور عمان کے کوئی شہر نہ بچے گا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الولید بن مسلم لم یصرح بالسماع المسلسل`;
abudawood.anwaar = [163,2];