var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ عَامِرٍ الْمُرِّيُّ،حَدَّثَنَا الْوَلِيدُ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْعَلَاءِ أَنَّهُ سَمِعَ أَبَا الْأَعْيَسِ عَبْدَ الرَّحْمَنِ بْنَ سَلْمَانَ يَقُولُ: سَيَأْتِي مَلِكٌ مِنْ مُلُوكِ الْعَجَمِ, يَظْهَرُ عَلَى الْمَدَائِنِ كُلِّهَا, إِلَّا دِمَشْقَ.";
abudawood.urdu = "جناب ابو اعیس عبدالرحمٰن بن سلمان رحمہ اللہ بیان کرتے تھے کہ ایک عجمی بادشاہ سارے شہروں پر غالب آ جائے گا اور صرف دمشق محفوظ رہے گا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبدالعزیز : لم أجد لہ ترجمۃ،ولعلہ عبد اللّٰہ بن العلاء کما یظہر من تہذیب الکمال وغیرہ فالسند صحیح`;
abudawood.anwaar = [164,1];