var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ،حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ،عَنْ عَمْرِو بْنِ الْحَارِثِ،عَنْ بُكَيْرٍ،عَنْ نَافِعٍ،أَنَّ عُمَرَ بْنَ الْخَطَّابِ كَانَ يَنْهَى أَنْ يُدْخَلَ مِنْ بَابِ النِّسَاء";
abudawood.urdu = "جناب نافع سے روایت ہے وہ بیان کرتے ہیں کہ سیدنا عمر بن خطاب رضی اللہ عنہ عورتوں والے دروازے سے داخل ہونے سے منع کیا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق: 463`;
abudawood.anwaar = [30,1];