var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،حَدَّثَنَا بُرْدٌ أَبُو الْعَلَاءِ،عَنْ مَكْحُولٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَوْضِعُ فُسْطَاطِ الْمُسْلِمِينَ فِي الْمَلَاحِمِ أَرْضٌ يُقَالُ لَهَا: الْغُوطَةُ";
abudawood.urdu = "جناب مکحول رحمہ اللہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جنگوں (اور فتنوں) کے دنوں میں مسلمان ایک ایسی جگہ پر خیمہ زن ہوں گے جسے غوطہ کہتے ہوں گے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شاھد صحیح انظر الحدیث السابق (4298)`;