var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا ابْنُ إِدْرِيسَ،عَنْ الْأَعْمَشِ،قَالَ: سَمِعْتُ الْحَجَّاجَ, يَقُولُ عَلَى الْمِنْبَرِ: هَذِهِ الْحَمْرَاءُ هَبْرٌ هَبْرٌ،أَمَا وَاللَّهِ لَوْ قَدْ قَرَعْتُ عَصًا بِعَصًا،لَأَذَرَنَّهُمْ كَالْأَمْسِ الذَّاهِبِ.-يَعْنِي: الْمَوَالِيَ";
abudawood.urdu = "میں نے حجاج سے سنا وہ منبر پر کھڑا کہہ رہا تھا: یہ عجمی کاٹ ڈالے جانے کے لائق ہیں۔اللہ کی قسم! میں نے اگر لاٹھی کو لاٹھی پر مارا تو ان لوگوں کو ماضی کی مانند کر چھوڑوں گا (نیست و نابود کر دوں گا)۔اس کا اشارہ غیر عرب لوگوں کی طرف تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;