var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ،حَدَّثَنَا هُشَيْمٌ عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ،عَنْ سَعِيدِ بْنِ جُمْهَانَ،عَنْ سَفِينَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خِلَافَةُ النُّبُوَّةِ ثَلَاثُونَ سَنَةً،ثُمَّ يُؤْتِي اللَّهُ الْمُلْكَ مَنْ يَشَاءُ-أَوْ مُلْكَهُ مَنْ يَشَاءُ-.";
abudawood.urdu = "سیدنا سفینہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’نبوت کی خلافت تیس سال تک رہے گی۔پھر اللہ تعالیٰ اپنا ملک جسے چاہے گا دیدے گا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (4646)`;