var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَدْخُلُ النَّارَ أَحَدٌ مِمَّنْ بَايَعَ تَحْتَ الشَّجَرَةِ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ نے بیان کیا کہ بلاشبہ رسول اللہ ﷺ نے فرمایا ’’جنہوں نے درخت کے نیچے بیعت کی ہے ان میں سے کوئی بھی آگ میں داخل نہیں ہو گا۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (3860 وسندہ صحیح)`;