var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ح،وحَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا حَمَّادُ ابْنُ سَلَمَةَ،عَنْ عَاصِمٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: قَالَ مُوسَى فَلَعَلَّ اللَّهَ: وَقَالَ ابْنُ سِنَانٍ اطَّلَعَ اللَّهُ عَلَى أَهْلِ بَدْرٍ،فَقَالَ: اعْمَلُوا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’شاید کہ اللہ تعالیٰ نے اہل بدر پر نظر فرمائی ہے اور کہا ہے کہ جو چاہے عمل کرو میں نے تمہیں بخش دیا ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;