var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا يَزِيدُ،أَخْبَرَنَا هِشَامٌ،عَنْ مُحَمَّدٍ،قَالَ: قَالَ: حُذَيْفَةُ،مَا أَحَدٌ مِنَ النَّاسِ تُدْرِكُهُ الْفِتْنَةُ, إِلَّا أَنَا أَخَافُهَا عَلَيْهِ, إِلَّا مُحَمَّدُ بْنُ مَسْلَمَةَ, فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: لَا تَضُرُّكَ الْفِتْنَةُ";
abudawood.urdu = "جناب محمد بن سیرین رحمہ اللہ نے روایت کیا کہ سیدنا حذیفہ رضی اللہ عنہ نے کہا کہ لوگوں میں کوئی ایسا نہیں کہ اسے کوئی فتنہ درپیش ہو (اور وہ اس سے محفوظ رہے) مجھے اندیشہ رہتا ہے کہ وہ اس میں مبتلا ہو جائے گا،سوائے محمد بن مسلمہ رضی اللہ عنہ کے،کیونکہ میں نے رسول اللہ ﷺ سے سنا آپ ﷺ (انہیں) فرما رہے تھے: ’’تجھے فتنہ نقصان نہیں دے گا۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ھشام بن حسان مدلس وعنعن`;
abudawood.anwaar = [164,1];