var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي سَعِيدٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: تَمْرُقُ مَارِقَةٌ عِنْدَ فُرْقَةٍ مِنَ الْمُسْلِمِينَ،يَقْتُلُهَا أَوْلَى الطَّائِفَتَيْنِ بِالْحَقِّ";
abudawood.urdu = "سیدنا ابوسعید رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’مسلمانوں میں افتراق کے وقت ایک فتنہ انگیز جماعت نکلے گی جسے مسلمانوں کا وہ گروہ قتل کرے گا جو حق کے زیادہ قریب ہو گا۔“";
abudawood.hukam = "صحیح مسلم (1065)";
abudawood.description = ``;