var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ،حَدَّثَنَا عَمْرٌو يَعْنِي ابْنَ يَحْيَى،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تُخَيِّرُوا بَيْنَ الْأَنْبِيَاءِ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’انبیاء کو ایک دوسرے پر فضیلت و ترجیح مت دیا کرو۔“";
abudawood.hukam = "صحیح بخاری (2412) صحیح مسلم (2374)";
abudawood.description = ``;