var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَبِي الْعَالِيَةِ عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, قَالَ: مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ: إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’کسی بندے کو لائق نہیں کہ وہ یوں کہے کہ میں (محمد ﷺ) سیدنا یونس بن متی علیہ السلام سے بہتر ہوں۔";
abudawood.hukam = "صحیح بخاری (3413) صحیح مسلم (2377)";
abudawood.description = ``;