var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا مَالِكٌ،عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ،عَنْ أَبِي قَتَادَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا جَاءَ أَحَدُكُمُ الْمَسْجِدَ, فَلْيُصَلِّ سَجْدَتَيْنِ مِنْ قَبْلِ أَنْ يَجْلِسَ.";
abudawood.urdu = "سیدنا ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی مسجد میں آئے تو بیٹھنے سے پہلے دو رکعتیں پڑھے۔‘‘";
abudawood.hukam = "صحیح بخاری (444) صحیح مسلم (714)";
abudawood.description = ``;