var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ،قَالَ: حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ،عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَا يَنْبَغِي لِنَبِيٍّ أَنْ يَقُولَ: إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى";
abudawood.urdu = "سیدنا عبداللہ بن جعفر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ فرمایا کرتے تھے ’’کسی نبی کو لائق نہیں کہ یوں کہے کہ میں سیدنا یونس بن متی علیہ السلام سے بہتر ہوں۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن إسحاق مدلس وعنعن`;
abudawood.anwaar = [164,1];