var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنْ مُخْتَارِ بْنِ فُلْفُلٍ يَذْكُرُ،عَنْ أَنَسٍ،قَالَ: قَالَ رَجُلٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَا خَيْرَ الْبَرِيَّةِ! فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: ذَاكَ إِبْرَاهِيمُ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے رسول اللہ ﷺ سے یوں خطاب کیا «یا خیر البریۃ» ’’اے مخلوق میں سب سے افضل شخصیت!‘‘ تو رسول اللہ ﷺ نے فرمایا ’’یہ سیدنا ابراہیم علیہ السلام تھے۔“";
abudawood.hukam = "صحیح مسلم (2369)";
abudawood.description = ``;