var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ،حَدَّثَنَا الْوَلِيدُ عَنِ الْأَوْزَاعِيِّ،عَنْ أَبِي عَمَّارٍ،عَنْ عَبْدِ اللَّهِ بْنِ فَرُّوخَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَا سَيِّدُ وَلَدِ آدَمَ،وَأَوَّلُ مَنْ تَنْشَقُّ عَنْهُ الْأَرْضُ،وَأَوَّلُ شَافِعٍ،وَأَوَّلُ مُشَفَّعٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’میں اولاد آدم کا سردار ہوں اور پہلا شخص ہوں گا جس سے زمین پھٹے گی،میں سب سے پہلے سفارش کروں گا اور میری سفارش ہی سب سے پہلے قبول ہو گی۔";
abudawood.hukam = "صحیح مسلم (2278)";
abudawood.description = ``;