var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ وَمَخْلَدُ بْنُ خَالِدٍ الشَّعِيرِيُّ الْمَعْنَى،قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ ابْنِ أَبِي ذِئْبٍ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا أَدْرِي, أَتُبَّعٌ لَعِينٌ هُوَ أَمْ لَا! وَمَا أَدْرِي, أَعُزَيْرٌ نَبِيٌّ هُوَ أَمْ لَا!.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’تبع کے متعلق مجھے نہیں معلوم وہ لعین تھا یا نہیں۔اور عزیر کے متعلق خبر نہیں کہ وہ نبی تھا یا نہیں۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;