var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ قَالَ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: أَنَا أَوْلَى النَّاسِ بِابْنِ مَرْيَمَ،الْأَنْبِيَاءُ أَوْلَادُ عَلَّاتٍ, وَلَيْسَ بَيْنِي وَبَيْنَهُ نَبِيٌّ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو سنا،آپ ﷺ فرماتے تھے ’’میں ابن مریم علیہ السلام کے سب سے زیادہ قریب ہوں اور انبیاء گویا ایک باپ کی اولاد ہیں (جن کی مائیں الگ الگ ہوں) میرے اور ابن مریم علیہ السلام کے درمیان اور کوئی نبی نہیں۔“";
abudawood.hukam = "صحیح بخاری (3442) صحیح مسلم (2365)";
abudawood.description = ``;