var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْإِيمَانُ بِضْعٌ وَسَبْعُونَ, أَفْضَلُهَا قَوْلُ: لَا إِلَهَ إِلَّا اللَّهُ،وَأَدْنَاهَا إِمَاطَةُ الْعَظْمِ عَنِ الطَّرِيقِ،وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيمَانِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’ایمان کی ستر اور کچھ شاخیں ہیں۔سب سے افضل «لا إلہ إلا اللہ» کہنا ہے اور سب سے نیچے یہ ہے کہ کوئی راستے میں پڑی ہڈی دور کر دے۔اور حیاء بھی ایمان کی ایک شاخ ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (35)";
abudawood.description = `ورواہ البخاري (9) من طریق آخر`;