var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ،حَدَّثَنَا أَبُو عُمَيْسٍ عُتْبَةُ بْنُ عَبْدِ اللَّهِ،عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ رَجُلٍ مِنْ بَنِي زُرَيْقٍ،عَنْ أَبِي قَتَادَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،بِنَحْوِهِ... زَادَ: ثُمَّ لِيَقْعُدْ بَعْدُ إِنْ شَاءَ،أَوْ لِيَذْهَبْ لِحَاجَتِهِ.";
abudawood.urdu = "جناب عامر بن عبداللہ بن زبیر بنی زریق کے ایک آدمی سے وہ سیدنا ابوقتادہ رضی اللہ عنہ سے وہ نبی کریم ﷺ سے اسی کی مانند روایت کرتے ہیں۔اس میں یہ اضافہ ہے ’’پھر اس کے بعد بیٹھا رہے یا چاہے تو اپنے کام کے لیے چلا جائے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رجل من بني زریق وعمرو بن سلیم، انظر الحدیث السابق`;