var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ،حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ،عَنْ يَحْيَى بْنِ الْحَارِثِ عَنِ الْقَاسِمِ،عَنْ أَبِي أُمَامَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, أَنَّهُ قَالَ: مَنْ أَحَبَّ لِلَّهِ،وَأَبْغَضَ لِلَّهِ،وَأَعْطَى لِلَّهِ, وَمَنَعَ لِلَّهِ،فَقَدِ اسْتَكْمَلَ الْإِيمَانَ";
abudawood.urdu = "سیدنا ابوامامہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے اﷲ کی خاطر محبت کی،اﷲ کی خاطر غصہ کیا،اﷲ کے لیے دیا،اور اﷲ کی رضا مندی کے پیش نظر نہ دیا تو اس نے ایمان کو کامل کر لیا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (30)`;