var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا ابْنُ ثَوْرٍ،عَنْ مَعْمَرٍ،قَالَ: وَقَالَ الزُّهْرِيُّ: قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا[الحجرات: 14], قَالَ: نَرَى أَنَّ الْإِسْلَامَ الْكَلِمَةُ،وَالْإِيمَانَ الْعَمَلُ";
abudawood.urdu = "جناب ابن شہاب زہری رحمہ اللہ نے آیت کریمہ «قل لم تؤمنوا ولکن قولوا أسلمنا» ’’کہہ دیجئیے! (اے بدویو!) تم ایمان نہیں لائے بلکہ یوں کہو کہ ہم نے اسلام قبول کیا ہے۔‘‘ کی تفسیر میں بیان کیا کہ ہم سمجھتے ہیں اسلام سے مراد زبانی اقرار ہے اور ایمان سے مراد عمل ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;