var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا شُعْبَةُ،قَالَ: وَاقِدُ بْنُ عَبْدِ اللَّهِ أَخْبَرَنِي،عَنْ أَبِيهِ أَنَّهُ سَمِعَ ابْنَ عُمَرَ،يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ, قَالَ: لَا تَرْجِعُوا بَعْدِي كُفَّارًا, يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے تھے کہ نبی کریم ﷺ نے فرمایا ’’کہیں میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی گردنیں مارنے لگو۔‘‘";
abudawood.hukam = "صحیح بخاری (6868) صحیح مسلم (66)";
abudawood.description = ``;