var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ فُضَيْلِ بْنِ غَزْوَانَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّمَا رَجُلٍ مُسْلِمٍ أَكْفَرَ رَجُلًا مُسْلِمًا, فَإِنْ كَانَ كَافِرًا, وَإِلَّا كَانَ هُوَ الْكَافِرُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس کسی مسلمان نے کسی مسلمان کو کافر کہا،تو اگر وہ (فی الواقع) کافر ہوا تو «فبہا» ورنہ کہنے والا ہی کافر ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رواہ مسلم (60)`;