var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو صَالِحٍ الْأَنْطَاكِيُّ،أَخْبَرَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ،وَلَا يَسْرِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ،وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ, وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’بدکار زانی جس وقت زنا کر رہا ہو ‘ ایماندار نہیں ہوتا۔چور جس وقت چوری کر رہا ہو،ایمان والا نہیں ہوتا،اور شرابی جب شراب پی رہا ہو،مومن نہیں ہوتا،اس کے بعد توبہ اس کے سامنے ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6810) صحیح مسلم (57)";
abudawood.description = ``;