var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْمَلَائِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلَّاهُ الَّذِي صَلَّى فِيهِ, مَا لَمْ يُحْدِثْ،أَوْ يَقُمِ: اللَّهُمَّ اغْفِرْ لَهُ،اللَّهُمَّ ارْحَمْهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’فرشتے تم میں سے ایک کے لیے دعا و استغفار کرتے رہتے ہیں جب تک کہ وہ اس جگہ پر بیٹھا رہے جہاں اس نے نماز پڑھی ہو جب تک کہ بے وضو نہ ہو یا وہاں سے اٹھ نہ جائے۔‘‘ (ان کی دعا ہوتی ہے) <عربی> «اللہم اغفر لہ اللہم ارحمہ» </عربی> ’’اے اللہ! اس کی بخشش فرما۔اے اللہ! اس پر رحم فرما۔‘‘";
abudawood.hukam = "صحیح بخاری (445)";
abudawood.description = ``;