var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ‌إِسْحَاقُ بْنُ سُوَيْدٍ الرَّمْلِيُّ،نَا ‌ابْنُ أَبِي مَرْيَمَ،أَنَا ‌نَافِعٌ يَعْنِي ابْنَ يَزِيدَ حَدَّثَنِي ‌ابْنُ الْهَادِ أَنَّ ‌سَعِيدَ بْنَ أَبِي سَعِيدٍ الْمَقْبُرِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ ‌أَبَا هُرَيْرَةَ يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ((إِذَا زَنَى الرَّجُلُ خَرَجَ مِنْهُ الْإِيمَانُ كَانَ عَلَيْهِ كَالظُّلَّةِ،فَإِذَا انْقَلَعَ رَجَعَ إِلَيْهِ الْإِيمَانُ))";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’آدمی جب زنا کرتا ہے تو ایمان اس سے نکل جاتا ہے اور اس کے اوپر چھتری کی مانند ہو جاتا ہے۔پس جب وہ اپنی بدکاری سے نکل آتا ہے تو ایمان اس کی طرف واپس آ جاتا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (60)`;