var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ،قَالَ: حَدَّثَنِي بِمِنًى،عَنْ أَبِيهِ عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: الْقَدَرِيَّةُ مَجُوسُ هَذِهِ الْأُمَّةِ, إِنْ مَرِضُوا فَلَا تَعُودُوهُمْ،وَإِنْ مَاتُوا فَلَا تَشْهَدُوهُمْ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’قدریہ (تقدیر کا انکار کرنے والے) اس امت کے مجوسی ہیں۔اگر بیمار ہو جائیں تو ان کی عیادت کو مت جاؤ اور اگر مر جائیں تو جنازے میں شریک نہ ہو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (107)
ولہ شاہد صحیح عند الطبراني فی الأوسط (5/ 114ح 4217)`;