var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ لَا يَزَالُ أَحَدُكُمْ فِي صَلَاةٍ مَا كَانَتِ الصَّلَاةُ تَحْبِسُهُ،لَا يَمْنَعُهُ أَنْ يَنْقَلِبَ إِلَى أَهْلِهِ إِلَّا الصَّلَاةُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تک بندے کو نماز (مسجد میں) روکے رکھے وہ (گویا) نماز میں ہوتا ہے (بشرطیکہ) اسے اپنے اہل میں لوٹنے سے روکنے والی صرف نماز ہی ہو۔‘‘";
abudawood.hukam = "صحیح بخاری (659) صحیح مسلم (649 بعد ح 661)";
abudawood.description = ``;