var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى،حَدَّثَنَا بَقِيَّةُ،قَالَ: حَدَّثَنِي عُمَرُ بْنُ جُعْثُمٍ الْقُرَشِيُّ،قَالَ: حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ،عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ مُسْلِمِ بْنِ يَسَارٍ،عَنْ نُعَيْمِ بْنِ رَبِيعَةَ قَالَ كُنْتُ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ بِهَذَا الْحَدِيثِ وَحَدِيثُ مَالِكٍ أَتَمُّ";
abudawood.urdu = "جناب نعیم بن ربیعہ کہتے ہیں کہ میں سیدنا عمر بن خطاب رضی اللہ عنہ کے پاس تھا،اور حدیث روایت کی۔اور (مذکورہ بالا) حدیث مالک زیادہ مکمل ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (3075)<br>مسلم بن یسار سمعہ من نعیم بن ربیعۃ (وھو رجل مجہول،وثقہ ابن حبان وحدہ) عن عمر رضي اللّٰہ عنہ`;
abudawood.anwaar = [165,1];