var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا الْمُعْتَمِرُ،عَنْ أَبِيهِ،عَنْ رَقَبَةَ بْنِ مَصْقَلَةَ،عَنْ أَبِي إِسْحَاقَ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،عَنْ أُبَيِّ بْنِ كَعْبٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْغُلَامُ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا،وَلَوْ عَاشَ لَأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا";
abudawood.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’وہ لڑکا جسے خضر نے قتل کیا تھا وہ کافر پیدا کیا گیا تھا۔اگر زندہ رہتا تو اپنے ماں باپ کو سرکشی اور کفر پر مجبور کر دیتا۔“";
abudawood.hukam = "صحیح مسلم (2661)";
abudawood.description = ``;