var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا الْفِرْيَابِيُّ،عَنْ إِسْرَائِيلَ،حَدَّثَنَا أَبُو إِسْحَاقَ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: حَدَّثَنَا أُبَيُّ بْنُ كَعْبٍ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ-فِي قَوْلِهِ: وَأَمَّا الْغُلَامُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ[الكهف: 80]-: وَكَانَ طُبِعَ يَوْمَ طُبِعَ كَافِرًا";
abudawood.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ ﷺ کو فرماتے سنا: آپ اللہ تعالیٰ کے فرمان «وأما الغلام فکان أبواہ مؤمنین» ’’اور اس لڑکے کے ماں باپ مومن تھے۔‘‘ کی تفسیر میں فرما رہے تھے ’’وہ لڑکا جس دن پیدا کیا گیا،کافر پیدا کیا گیا تھا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4705)`;