var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَمْرٍو،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،قَالَ: قَالَ ابْنُ عَبَّاسٍ،حَدَّثَنِي أُبَيُّ بْنُ كَعْبٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَبْصَرَ الْخَضِرُ غُلَامًا يَلْعَبُ مَعَ الصِّبْيَانِ،فَتَنَاوَلَ رَأْسَهُ فَقَلَعَهُ! فَقَالَ مُوسَى: أَقَتَلْتَ نَفْسًا زَكِيَّةً...[الكهف: 74] الْآيَةَ.";
abudawood.urdu = "سیدنا ابی بن کعب رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’سیدنا خضر علیہ السلام نے لڑکے کو دیکھا جو دوسرے بچوں کے ساتھ کھیل رہا تھا۔تو انہوں نے اس کا سر پکڑ کر مروڑ دیا۔تو موسیٰ علیہ السلام بولے ’’آپ نے ایک پاک جان کو قتل کر ڈالا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (122) صحیح مسلم (2380)";
abudawood.description = ``;