var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِيُّ أَبُو عَبْدِ الرَّحْمَنِ،قَالَ: حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ،حَدَّثَنِي عَطَاءُ بْنُ دِينَارٍ،عَنْ حَكِيمِ بْنِ شَرِيكٍ الْهُذَلِيِّ،عَنْ يَحْيَى بْنِ مَيْمُونٍ الْحَضْرَمِيِّ،عَنْ رَبِيعَةَ الْجُرَشِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا تُجَالِسُوا أَهْلَ الْقَدَرِ وَلَا تُفَاتِحُوهُمْ";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ نے فرمایا ’’منکرین تقدیر کے ساتھ مت بیٹھا کرو اور نہ ان سے بات چیت (یا مناظرے) کی ابتداء کیا کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حکیم بن شریک الھذلي : مجہول وثقہ ابن حبان وحدہ`;
abudawood.anwaar = [165,1];