var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي بِشْرٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ أَوْلَادِ الْمُشْرِكِينَ؟ فَقَالَ: اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ.";
abudawood.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ سے مشرکین کی اولاد کے متعلق پوچھا گیا (جو بچپن میں فوت ہو جاتے ہیں) تو آپ ﷺ نے فرمایا ’’اللہ کو خوب علم ہے کہ وہ (بڑے ہو کر) کیا عمل کرنے والے تھے۔“";
abudawood.hukam = "صحیح بخاری (1383) صحیح مسلم (2660)";
abudawood.description = ``;