var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ،قَالَ: سَمِعْتُ حَمَّادَ بْنَ سَلَمَةَ يُفَسِّرُ حَدِيثَ: كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ،قَالَ: هَذَا عِنْدَنَا حَيْثُ أَخَذَ اللَّهُ عَلَيْهِمْ الْعَهْدَ فِي أَصْلَابِ آبَائِهِمْ،حَيْثُ قَالَ: أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى[الأعراف: 172].";
abudawood.urdu = "جناب حماد بن سلمہ نے حدیث ’’ہر بچہ فطرت پر پیدا ہوتا ہے۔‘‘ کی تشریح میں کہا کہ اس کا مفہوم ہمارے نزدیک یہ ہے کہ یہ اس وقت کی بات ہے جب اللہ عزوجل نے روحوں سے عہد لیا جبکہ وہ اپنے باپوں کی پشتوں میں تھے،اس وقت کہا تھا «ألست بربکم» ’’کیا میں تمہارا رب نہیں ہوں؟‘‘ تو سب نے کہا: کیوں نہیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;