var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ،حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ،قَالَ: حَدَّثَنِي أَبِي،عَنْ عَامِرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْوَائِدَةُ وَالْمَوْءُودَةُ فِي النَّارِ قَالَ يَحْيَى بْنُ زَكَرِيَّا قَالَ أَبِي فَحَدَّثَنِي أَبُو إِسْحَاقَ أَنَّ عَامِرًا حَدَّثَهُ بِذَلِكَ،عَنْ عَلْقَمَةَ عَنِ ابْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
abudawood.urdu = "جناب عامر شعبی رحمہ اللہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’بچے کو زندہ دفن کرنے والی اور زندہ دفن ہونے والی (دونوں) آگ میں ہیں۔‘‘ یحییٰ بن زکریا نے کہا: میرے والد نے کہا کہ مجھے ابواسحاق نے بیان کیا کہ عامر نے اس کو یہ حدیث بواسطہ علقمہ،سیدنا ابن مسعود رضی اللہ عنہ سے انہوں نے نبی کریم ﷺ سے بیان کی تھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (112)
أخرجہ الطبراني فی الکبیر (10/114 ح10059 وسندہ صحیح) من حدیث عبد اللہ بن مسعود رضي اللہ عنہ بہ`;