var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ! أَيْنَ أَبِي؟ قَالَ: أَبُوكَ فِي النَّارِ،فَلَمَّا قَفَّى،قَالَ:\nإِنَّ أَبِي وَأَبَاكَ فِي النَّارِ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ نے بیان کیا کہ ایک شخص نے رسول اللہ ﷺ سے کہا: اے اللہ کے رسول! میرا باپ کہاں ہے؟ آپ ﷺ نے فرمایا ’’تیرا باپ آگ میں ہے۔‘‘ جب اس نے گردن پھیری تو آپ ﷺ نے فرمایا ’’میرا باپ اور تیرا باپ جہنم میں ہیں۔“";
abudawood.hukam = "صحیح مسلم (203)";
abudawood.description = ``;