var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ،حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ،حَدَّثَنَا عُثْمَانُ بْنُ أَبِي الْعَاتِكَةِ الْأَزْدِيُّ،عَنْ عُمَيْرِ بْنِ هَانِئٍ الْعَنْسِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ أَتَى الْمَسْجِدَ لِشَيْءٍ فَهُوَ حَظُّهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص جس نیت سے مسجد میں آیا ہو،اس کا وہی نصیبہ ہے۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عثمان بن أبی العاتکۃ الأزدي: ضعیف،وقال الھیثمي: وضعفہ الجمھور (مجمع الزوائد 10/ 210) وبعضھم مشاہ في غیر علي بن یزید الألھاني وقولھم مرجوح`;
abudawood.anwaar = [30,2];