var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ،حَدَّثَنَا سُفْيَانُ،عَنْ هِشَامٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَزَالُ النَّاسُ يَتَسَاءَلُونَ،حَتَّى يُقَالَ: هَذَا خَلَقَ اللَّهُ الْخَلْقَ،فَمَنْ خَلَقَ اللَّهَ؟! فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا, فَلْيَقُلْ: آمَنْتُ بِاللَّهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’لوگ سوالات کرتے رہیں گے حتیٰ کہ کہا جائے گا: یہ مخلوق اللہ نے پیدا کی ہے تو اللہ کو کس نے پیدا کیا؟ سو جو کوئی اس قسم کی بات کرے (یا وہم پائے) تو اسے چاہیئے کہ یوں کہے ’’میں اللہ پر ایمان لایا۔“";
abudawood.hukam = "صحیح بخاری (3276) صحیح مسلم (134)";
abudawood.description = `مشکوۃ المصابیح (75)`;