var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ،أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ سَعْدٍ, وَمُحَمَّدُ بْنُ سَعِيدٍ،قَالَا: أَخْبَرَنَا عَمْرُو بْنُ أَبِي قَيْسٍ،عَنْ سِمَاكٍ بِإِسْنَادِهِ وَمَعْنَاهُ.";
abudawood.urdu = "جناب عمرو بن ابوقیس نے بواسطہ سماک اپنی سند سے مذکورہ بالا حدیث کے ہم معنی روایت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (3320) ابن ماجہ (193)<br>سماک بن حرب اختلط کما تقدم بالإشارۃ (2238) ولا نعرف تحدیثہ بہ قبل اختلاطہ و عبد اللّٰہ بن عمیرۃ لا یعرف لہ سماع من الأحنف کما قال البخاري رحمہ اﷲ (التاریخ الکبیر 159/5)`;
abudawood.anwaar = [165,1];