var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصٍ،قَالَ: حَدَّثَنِي أَبِي،حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ،عَنْ سِمَاكٍ بِإِسْنَادِهِ وَمَعْنَى هَذَا الْحَدِيثِ الطَّوِيلِ.";
abudawood.urdu = "جناب ابراہیم بن طہمان نے بواسطہ سماک اس کی سند سے مذکورہ بالا طویل حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (3320) ابن ماجہ (193)<br>سماک بن حرب اختلط کما تقدم بالإشارۃ (2238) ولا نعرف تحدیثہ بہ قبل اختلاطہ و عبد اللّٰہ بن عمیرۃ لا یعرف لہ سماع من الأحنف کما قال البخاري رحمہ اﷲ (التاریخ الکبیر 159/5)`;
abudawood.anwaar = [165,1];