var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ،قَالَ: حَدَّثَنِي أَبِي،قَالَ: حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: أُذِنَ لِي أَنْ أُحَدِّثَ عَنْ مَلَكٍ مِنْ مَلَائِكَةِ اللَّهِ-مِنْ حَمَلَةِ الْعَرْشِ-, إِنَّ مَا بَيْنَ شَحْمَةِ أُذُنِهِ إِلَى عَاتِقِهِ مَسِيرَةُ سَبْعِ مِائَةِ عَامٍ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مجھے کہا گیا ہے کہ میں تمہیں حاملین عرش میں سے ایک فرشتہ کے متعلق بتاؤں۔بلاشبہ اس کے کانوں کی لو سے اس کے کندھے تک کا فاصلہ سات سو سال کے سفر کے برابر ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (5728)
أخرجہ ابن طھمان (21 وسندہ صحیح/معاذ)`;