var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا إِسْرَائِيلُ،حَدَّثَنَا عُثْمَانُ بْنُ الْمُغِيرَةِ،عَنْ سَالِمٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْرِضُ نَفْسَهُ عَلَى النَّاسِ فِي الْمَوْقِفِ! فَقَالَ: أَلَا رَجُلٌ يَحْمِلُنِي إِلَى قَوْمِهِ؟ فَإِنَّ قُرَيْشًا قَدْ مَنَعُونِي أَنْ أُبَلِّغَ كَلَامَ رَبِّي.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ (ابتدائی بعثت کے دنوں میں) رسول اللہ ﷺ میدان عرفات میں اپنے آپ کو لوگوں کے سامنے پیش کرتے تھے اور کہتے تھے: ’’سنو! کوئی مجھے اپنی قوم کی طرف لے جائے ‘ بلاشبہ قریش نے مجھے اپنے رب کا کلام پہنچانے سے روک دیا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (2925 وسندہ صحیح)`;