var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،قَالَ: أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنِ ابْنِ شِهَابٍ،قَالَ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ،وَسَعِيدُ بْنُ الْمُسَيَّبِ،وَعَلْقَمَةُ بْنُ وَقَّاصٍ،وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ،عَنْ حَدِيثِ عَائِشَةَ-وَكُلٌّ حَدَّثَنِي طَائِفَةً مِنَ الْحَدِيثِ-،قَالَتْ: وَلَشَأْنِي فِي نَفْسِي كَانَ أَحْقَرَ مِنْ أَنْ يَتَكَلَّمَ اللَّهُ فِيَّ بِأَمْرٍ يُتْلَى!";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ میں اپنے آپ کو اس بات سے بہت ہیچ سمجھتی تھی کہ اللہ عزوجل میری برات کے سلسلے میں کوئی ایسا کلام فرمائے گا جس کی تلاوت کی جائے گی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رواہ البخاري (7500) ومسلم (2770) مطولًا`;