var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُمَرَ،أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى،أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ،عَنْ مُجَالِدٍ،عَنْ عَامِرٍ يَعْنِي الشَّعْبِيَّ،عَنْ عَامِرِ بْنِ شَهْرٍ،قَالَ: كُنْتُ عِنْدَ النَّجَاشِيِّ،فَقَرَأَ ابْنٌ لَهُ آيَةً مِنَ الْإِنْجِيلِ،فَضَحِكْتُ،فَقَالَ: أَتَضْحَكُ مِنْ كَلَامِ اللَّهِ؟!.";
abudawood.urdu = "جناب عامر بن شہر رضی اللہ عنہ نے روایت کیا انہوں نے کہا کہ میں نجاشی کے دربار میں تھا کہ اس کے بیٹے نے انجیل کی ایک آیت پڑھی ‘ میں ہنس پڑا۔تو اس نے کہا: کیا تم اللہ تعالیٰ کے کلام سے ہنستے ہو؟";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مجالد ضعیف`;
abudawood.anwaar = [165,1];