var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ،حَدَّثَنَا بَسْطَامُ بْنُ حُرَيْثٍ،عَنْ أَشْعَثَ الْحُدَّانِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’میری سفارش میری امت کے ان لوگوں کے لیے ہو گی جو کبیرہ گناہوں کے مرتکب ہوئے ہوں گے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (5598)
وللحدیث طرق عند الترمذي (2435) وغیرہ`;