var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ وَشُعْبَةُ وَأَبَانُ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ التَّفْلُ فِي الْمَسْجِدِ خَطِيئَةٌ،وَكَفَّارَتُهُ أَنْ تُوَارِيَهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’مسجد میں تھوکنا غلطی ہے اور اس کا کفارہ یہ ہے کہ اسے چھپا دے۔‘‘";
abudawood.hukam = "إسنادہ صحیح، صحیح بخاری (415) صحیح مسلم (552)";
abudawood.description = ``;