var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ الْحَسَنِ بْنِ ذَكْوَانَ،حَدَّثَنَا أَبُو رَجَاءٍ،قَالَ: حَدَّثَنِي عِمْرَانُ بْنُ حُصَيْنٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَخْرُجُ قَوْمٌ مِنَ النَّارِ بِشَفَاعَةِ مُحَمَّدٍ, فَيَدْخُلُونَ الْجَنَّةَ, وَيُسَمَّوْنَ الْجَهَنَّمِيِّينَ.";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’ایک گروہ جہنم میں سے محمد ﷺ کی شفاعت سے نکلے گا اور وہ جنت میں داخل ہوں گے اور ان کا نام «جہنمیین» ہو گا۔‘‘";
abudawood.hukam = "صحیح بخاری (6566)";
abudawood.description = ``;