var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا مُعْتَمِرٌ،قَالَ: سَمِعْتُ أَبِي،قَالَ: حَدَّثَنَا أَسْلَمُ،عَنْ بِشْرِ بْنِ شَغَافٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: الصُّورُ قَرْنٌ يُنْفَخُ فِيهِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’صور ایک سینگ ہے جس میں پھونک ماری جائے گی۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (5528)
أخرجہ الترمذي (3244 وسندہ صحیح)`;