var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: كُلَّ ابْنِ آدَمَ تَأْكُلُ الْأَرْضُ إِلَّا عَجْبَ الذَّنَبِ, مِنْهُ خُلِقَ،وَفِيهِ يُرَكَّبُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’ابن آدم کے سارے جسم کو مٹی کھا جائے گی مگر دم کی جڑ کا آخری حصہ بچ رہے گا۔اسی سے پیدائش کی ابتدا ہوتی ہے اور اسی سے دوبارہ جسم مرکب ہوں گے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `ورواہ مسلم (2955) والبخاري (4814) من طریق آخر`;