var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ،قَالَا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَمَامَكُمْ حَوْضًا مَا بَيْنَ نَاحِيَتَيْهِ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُح.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’بلاشبہ تمہارے آگے (محشر میں) ایک حوض ہے۔اس کے کنارے اس قدر لمبے ہیں جیسے جرباء اور اذرح کے مابین فاصلہ ہے۔(یہ علاقہ شام کے دو مقام ہیں ان کے درمیان پرانے زمانے میں تین راتوں کے سفر کا فاصلہ تھا۔)";
abudawood.hukam = "صحیح مسلم (2299)";
abudawood.description = `وأصلہ عند البخاري (6577)`;