var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ الْبُزَاقُ فِي الْمَسْجِدِ خَطِيئَةٌ،وَكَفَّارَتُهَا دَفْنُهَا.\nحَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النُّخَاعَةُ فِي الْمَسْجِدِ فَذَكَرَ مِثْلَهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مسجد میں تھوکنا خطا ہے اور اس کا کفارہ اسے دفن کر دینا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (552)";
abudawood.description = ``;