var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،حَدَّثَنَا الْأَعْمَشُ،حَدَّثَنَا الْمِنْهَالُ،عَنْ أَبِي عُمَرَ زَاذَانَ،قَالَ: سَمِعْتُ الْبَرَاءَ, عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, قَالَ: فَذَكَرَ نَحْوَهُ.";
abudawood.urdu = "ابوعمر زاذان نے کہا کہ میں نے سیدنا براء بن عازب رضی اللہ عنہ سے سنا۔انہوں نے نبی کریم ﷺ سے اس کی مانند روایت کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (3212، 4753)`;