var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زُهَيْرٌ وَأَبُو بَكْرِ بْنُ عَيَّاشٍ وَمَنْدَلٌ،عَنْ مُطَرِّفٍ،عَنْ أَبِي جَهْمٍ،عَنْ خَالِدِ بْنِ وَهْبَانَ،عَنْ أَبِي ذَرٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ فَارَقَ الْجَمَاعَةَ شِبْرًا فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ.";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے جماعت سے بالشت بھر بھی علیحدگی اختیار کی ‘ اس نے اسلام کی رسی کو اپنے گلے سے اتار پھینکا۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (185)
خالد بن وھبان حسن الحدیث ورواہ ابن أبي عاصم فی السنۃ (1053 وسندہ صحیح) ولفظہ: ’’من فارق الجماعۃ والإسلام فقد خلع ربقۃ الإسلام من عنقہ‘‘`;