var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: النُّخَاعَةُ فِي الْمَسْجِدِ.... فَذَكَرَ مِثْلَهُ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کھنکار (بلغم) مسجد میں (ڈالنا گناہ ہے)۔‘‘ اور مذکورہ بالا حدیث کی مانند بیان کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `ورواہ شعبۃ عن قتادۃ بہ انظر مسند أحمد (3/277 ح 1394) والحدیث السابق (475) شاھد لہ`;