var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ شُعْبَةَ،عَنْ زِيَادِ بْنِ عِلَاقَةَ،عَنْ عَرْفَجَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: سَتَكُونُ فِي أُمَّتِي هَنَاتٌ،وَهَنَاتٌ،وَهَنَاتٌ, فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ الْمُسْلِمِينَ وَهُمْ جَمِيعٌ, فَاضْرِبُوهُ بِالسَّيْفِ, كَائِنًا مَنْ كَانَ.";
abudawood.urdu = "سیدنا عرفجہ رضی اللہ عنہ سے روایت ہے،وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ’’میری امت میں فتنے ہوں گے ‘ فتنے اور فتنے۔چنانچہ جس نے چاہا کہ مسلمانوں کے معاملے میں تفرقہ ڈال دے جبکہ وہ متحد و متفق ہوں تو ایسے کو تلوار سے قتل کر دینا ‘ خواہ کوئی بھی ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (1852)";
abudawood.description = ``;