var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ...نَحْوَهُ،قَالَ:\nسِيمَاهُمُ التَّحْلِيقُ وَالتَّسْبِيدُ،فَإِذَا رَأَيْتُمُوهُمْ فَأَنِيمُوهُمْ.\nقَالَ أَبُو دَاوُد: التَّسْبِيدُ اسْتِئْصَالُ الشَّعْرِ.";
abudawood.urdu = "جناب قتادہ نے سیدنا انس رضی اللہ عنہ سے،انہوں نے نبی کریم ﷺ سے مذکورہ بالا حدیث کی مانند روایت کیا ہے اس روایت میں ہے کہ ’’ان (خوراج) کی علامت سر منڈانا اور بال دور کرنا ہے۔جب تم انہیں پاؤ تو انہیں سلا (قتل کر) دینا۔‘‘ امام ابوداؤد رحمہ اللہ نے فرمایا حدیث میں وارد لفظ «التسبید» کے معنی ہیں «استئصال الشعر» ’’بالوں کو جڑوں سے اکھیڑنا یا جڑوں سے مونڈنا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (175)<br>قتادۃ مدلس وعنعن`;
abudawood.anwaar = [166,1];