var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا أَبُو مَوْدُودٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حَدْرَدٍ الْأَسْلَمِيِّ سَمِعْتُ أَبَا هُرَيْرَةَ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ دَخَلَ هَذَا الْمَسْجِدَ فَبَزَقَ فِيهِ،أَوْ تَنَخَّمَ،فَلْيَحْفِرْ،فَلْيَدْفِنْهُ،فَإِنْ لَمْ يَفْعَلْ،فَلْيَبْزُقْ فِي ثَوْبِهِ،ثُمَّ لِيَخْرُجْ بِهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص اس مسجد میں داخل ہو اور اس میں تھوک دے یا بلغم گرائے تو چاہیئے کہ جگہ کھود کر اسے دفن کر دے۔اگر ایسے نہ کرے تو اپنے کپڑے میں تھوکے اور اسے باہر لے جائے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;