var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،قَالَ: حَدَّثَنِي عَبْدُ اللَّهِ بْنُ حَسَنٍ،قَالَ: حَدَّثَنِي عَمِّي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ طَلْحَةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ أُرِيدَ مَالُهُ بِغَيْرِ حَقٍّ فَقَاتَلَ فَقُتِلَ, فَهُوَ شَهِيدٌ.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما کا بیان ہے کہ نبی کریم ﷺ نے فرمایا ’’جس کسی کا مال ناحق طور پر چھیننے کی کوشش کی گئی اور پھر اس نے قتال کیا اور اس میں وہ قتل ہو گیا ‘ تو وہ شہید ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (4093 وسندہ صحیح) والترمذي (1419، 1420 وسندھما صحیح)`;