var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا قَابُوسُ بْنُ أَبِي ظَبْيَانَ أَنَّ أَبَاهُ حَدَّثَهُ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبَّاسٍ،أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِنَّ الْهَدْيَ الصَّالِحَ،وَالسَّمْتَ الصَّالِحَ،وَالِاقْتِصَادَ, جُزْءٌ مِنْ خَمْسَةٍ وَعِشْرِينَ جُزْءًا مِنَ النُّبُوَّةِ.";
abudawood.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’نیک چلن ‘ عمدہ کردار اور میانہ روی نبوت کا پچیسواں حصہ ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (5059، 5060)
ولہ شاھد عند الترمذي (2010 وسندہ حسن)`;