var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنِ الْحَارِثِ بْنِ سُوَيْدٍ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا تَعُدُّونَ الصُّرَعَةَ فِيكُمْ؟،قَالُوا: الَّذِي لَا يَصْرَعُهُ الرِّجَالُ،قَالَ: لَا, وَلَكِنَّهُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’تم لوگ زبردست پہلوان (بہت زیادہ پچھاڑنے والا) کسے کہتے ہو؟‘‘ صحابہ نے کہا: جسے لوگ پچھاڑ نہ سکیں۔آپ ﷺ نے فرمایا ’’نہیں پہلوان وہ ہے جو غصے کی حالت میں اپنے آپ کو قابو میں رکھے۔‘‘";
abudawood.hukam = "صحیح مسلم (2608)";
abudawood.description = ``;