var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ،عَنْ أَبِي حَرْبِ بْنِ أَبِي الْأَسْوَدِ،عَنْ أَبِي ذَرٍّ،قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَنَا: إِذَا غَضِبَ أَحَدُكُمْ وَهُوَ قَائِمٌ فَلْيَجْلِسْ،فَإِنْ ذَهَبَ عَنْهُ الْغَضَبُ وَإِلَّا فَلْيَضْطَجِعْ.";
abudawood.urdu = "سیدنا ابوذر غفاری رضی اللہ عنہ سے روایت ہے،کہا تحقیق رسول اللہ ﷺ نے ہم سے فرمایا ’’جب تم میں سے کسی کو غصہ آئے اور وہ کھڑا ہوا ہو ‘ تو بیٹھ جائے ‘ اسی طرح اگر اس کا غصہ فرد ہو جائے (تو بہتر) ورنہ لیٹ جائے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (5114)
وھو في مسند أحمد (5/152 ح21348) واتحاف المھرۃ لابن حجر بحوالہ مسند أحمد (17527) وجامع المسانید لابن کثیر (11486) وتھذیب الکمال للمزي (21170) وسندہ صحیح`;