var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ،عَنْ خَالِدٍ،عَنْ دَاوُدَ،عَنْ بَكْرٍ, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَبَا ذَرٍّ... بِهَذَا الْحَدِيثِ. قَالَ أَبُو دَاوُد: وَهَذَا أَصَحُّ الْحَدِيثَيْنِ.";
abudawood.urdu = "جناب بکر (بکر بن عبداللہ) سے روایت ہے کہ نبی کریم ﷺ نے سیدنا ابوذر رضی اللہ عنہ کو (کسی کام سے) بھیجا اور یہ حدیث بیان کی۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ یہ حدیث (باوجود یہ کہ مرسل ہے) صحیح تر ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4782)`;