var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ الزُّبَيْرِ-فِي قَوْلِهِ: خُذِ الْعَفْوَ[الأعراف: 199]-،قَالَ: أُمِرَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْخُذَ الْعَفْوَ مِنْ أَخْلَاقِ النَّاسِ.";
abudawood.urdu = "سیدنا عبداللہ بن زبیر رضی اللہ عنہ سے روایت ہے کہ اﷲ کے فرمان «خذ العفو» ’’معاف کرنا اپنائیے‘‘ کی تفسیر میں انہوں نے بیان کیا کہ اﷲ کے نبی ﷺ کو حکم دیا گیا تھا کہ لوگوں کی عادات و معاملات میں ان کے ساتھ معافی کا رویہ اختیار کریں۔";
abudawood.hukam = "صحیح بخاری (4644)";
abudawood.description = ``;