var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا عَبْدُ الْحَمِيدِ يَعْنِي الْحِمَّانِيَّ،حَدَّثَنَا الْأَعْمَشُ،عَنْ مُسْلِمٍ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَلَغَهُ عَنِ الرَّجُلِ الشَّيْءُ،لَمْ يَقُلْ: مَا بَالُ فُلَانٍ يَقُولُ؟! وَلَكِنْ يَقُولُ:\nمَا بَالُ أَقْوَامٍ يَقُولُونَ كَذَا وَكَذَا؟!.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ کو جب کسی کے متعلق کوئی (نامناسب) خبر ملتی تو یوں نہ کہتے: فلاں کو کیا ہوا ہے کہ یوں کہتا ہے یا کرتا ہے؟ بلکہ یوں فرماتے ’’لوگوں کو کیا ہوا ہے کہ ایسے ایسے کہتے ہیں یا کرتے ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (6101) صحیح مسلم (2356)";
abudawood.description = ``;