var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ, قَالَ: أَخْبَرَنِي أَبُو أَحْمَدَ،حَدَّثَنَا سُفْيَانُ عَنِ الْحَجَّاجِ بْنِ فُرَافِصَةَ،عَنْ رَجُلٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا بِشْرُ بْنُ رَافِعٍ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،رَفَعَاهُ جَمِيعًا،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْمُؤْمِنُ غِرٌّ كَرِيمٌ،وَالْفَاجِرُ خِبٌّ لَئِيمٌ.";
abudawood.urdu = "نصر بن علی اور محمد بن متوکل عسقلانی دونوں سیدنا ابوہریرہ رضی اللہ عنہ سے مرفوعاً روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مومن بھولا بھالا اور سخی ہوتا ہے اور فاجر آدمی فریبی اور بخیل ہوتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1964)<br>رجل مجہول ویحیی بن أبي کثیر مدلس وعنعن وبشر بن رافع ضعیف`;
abudawood.anwaar = [166,1];