var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ،حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ،حَدَّثَنَا شَرِيكٌ عَنِ الْأَعْمَشِ،عَنْ مُجَاهِدٍ،عَنْ عَائِشَةَ... فِي هَذِهِ الْقِصَّةِ،قَالَتْ: فَقَالَ-تَعْنِي: النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-: يَا عَائِشَةُ! إِنَّ مِنْ شِرَارِ النَّاسِ, الَّذِينَ يُكْرَمُونَ اتِّقَاءَ أَلْسِنَتِهِمْ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے اس قصے میں بیان کیا کہ نبی کریم ﷺ نے فرمایا ’’اے عائشہ! بدترین ہیں وہ لوگ جن کی زبان کے شر سے بچنے کے لیے عزت کی جائے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شریک والأعمش مدلسان وعنعنا`;
abudawood.anwaar = [166,2];