var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا أَبُو قَطَنٍ،أَخْبَرَنَا مُبَارَكٌ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ: مَا رَأَيْتُ رَجُلًا الْتَقَمَ أُذُنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُنَحِّي رَأْسَهُ،حَتَّى يَكُونَ الرَّجُلُ هُوَ الَّذِي يُنَحِّي رَأَسَهُ وَمَا رَأَيْتُ رَجُلًا أَخَذَ بِيَدِهِ فَتَرَكَ يَدَهُ،حَتَّى يَكُونَ الرَّجُلُ هُوَ الَّذِي يَدَعُ يَدَهُ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نہیں دیکھا کہ کسی نے نبی کریم ﷺ کے کان میں سرگوشی کرنا چاہی ہو تو آپ نے اس سے اپنا سر دور کر لیا ہو ‘ حتیٰ کہ وہ آدمی خود ہی آپ ﷺ سے اپنا سر دور کرتا تھا۔اور میں نے نہیں دیکھا کہ کسی نے آپ کا ہاتھ پکڑا ہو ‘ تو آپ نے اس کا ہاتھ جھٹک دیا ہو ‘ حتیٰ کہ وہ از خود آپ کا ہاتھ چھوڑتا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مبارک بن فضالۃ مدلس وعنعن<br>ولبعض الحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [167,1];