var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عُمَرَ, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى رَجُلٍ مِنَ الْأَنْصَارِ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: دَعْهُ, فَإِنَّ الْحَيَاءَ مِنَ الْإِيمَانِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ ایک انصاری کے پاس سے گزرے جب کہ وہ اپنے بھائی کو حیاء کے بارے میں وعظ کر رہا تھا ‘ تو رسول اللہ ﷺ نے فرمایا ’’اسے چھوڑ دو۔بلاشبہ حیاء ایمان سے ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (24) صحیح مسلم (36)";
abudawood.description = ``;