var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ رِبْعِيِّ بْنِ حِرَاشٍ،عَنْ أَبِي مَسْعُودٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إِذَا لَمْ تَسْتَحِ, فَافْعَلْ مَا شِئْتَ.";
abudawood.urdu = "سیدنا ابومسعود رضی اللہ عنہ سے روایت ہے،انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’گزشتہ انبیاء کی تعلیمات میں سے جو بات لوگوں کے پاس محفوظ رہی ہے وہ یہی ہے کہ جب حیاء نہ رہے تو جو جی چاہے کر۔‘‘ امام ابوداؤد رحمہ اللہ سے پوچھا گیا: کیا قعنبی کے پاس شعبہ کے واسطے سے اس حدیث کے سوا کوئی اور حدیث بھی ہے؟ انہوں نے فرمایا نہیں۔";
abudawood.hukam = "صحیح بخاری (3484)";
abudawood.description = ``;