var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا يَعْقُوبُ يَعْنِي الْإِسْكَنْدَرَانِيَّ،عَنْ عَمْرٍو عَنِ الْمُطَّلِبِ،عَنْ عَائِشَةَ رَحِمَهَا اللَّهُ،قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّ الْمُؤْمِنَ لَيُدْرِكُ بِحُسْنِ خُلُقِهِ دَرَجَةَ الصَّائِمِ الْقَائِمِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’بلاشبہ مومن اپنے حسن اخلاق (عمدہ عادات) کی بنا پر روزہ دار ‘ شب زندہ دار کا درجہ حاصل کر لیتا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (5082)
ولہ شاھد عند البخاري فی الأدب المفرد (284 وسندہ حسن)`;