var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرٍ وَعُثْمَانُ ابْنُ أَبِي شَيْبَةَ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ مَعْبَدِ بْنِ خَالِدٍ،عَنْ حَارِثَةَ ابْنِ وَهْبٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَدْخُلُ الْجَنَّةَ الْجَوَّاظُ وَلَا الْجَعْظَرِيُّ.\nقَالَ: وَالْجَوَّاظُ: الْغَلِيظُ الْفَظُّ.";
abudawood.urdu = "سیدنا حارثہ بن وہب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا \u0004’’ترش رو بدمزاج جنت میں داخل نہیں ہو گا اور نہ تکبر سے چلنے والا۔‘‘ اور «جواظ» کا مفہوم ہے سخت مزاج،بدخلق۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (5080)
وللحدیث شواھد عند البخاري (4918، 6071، 6657) ومسلم (2853) وغیرھما`;