var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا حُمَيْدٌ،عَنْ أَنَسٍ.. بِهَذِهِ الْقِصَّةِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِنَّ حَقًّا عَلَى اللَّهِ عَزَّ وَجَلَّ أَنْ لَا يَرْتَفِعَ شَيْءٌ مِنَ الدُّنْيَا, إِلَّا وَضَعَهُ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے یہ قصہ مروی ہے اس میں ہیں کہ نبی کریم ﷺ نے فرمایا ’’بلاشبہ اللہ پر حق ہے کہ دنیا میں جو چیز بھی سر اونچا اٹھاتی ہے تو وہ اسے نیچا دکھا دیتا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6501)";
abudawood.description = ``;