var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ يُونُسَ وَحُمَيْدٍ عَنِ الْحَسَنِ،عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ اللَّهَ رَفِيقٌ،يُحِبُّ الرِّفْقَ وَيُعْطِي عَلَيْهِ مَا لَا يُعْطِي عَلَى الْعُنْفِ.";
abudawood.urdu = "سیدنا عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اللہ عزوجل رفق اور نرمی سے موصوف ہے ‘ اسے نرمی اور نرم خوئی پسند ہے۔وہ اس پر وہ کچھ عنایت فرماتا ہے جو ترشی اور کرختگی پر نہیں دیتا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شاھد عند مسلم (2593)`;