var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو مُعَاوِيَةَ, وَوَكِيعٌ عَنِ الْأَعْمَشِ،عَنْ تَمِيمِ بْنِ سَلَمَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ،عَنْ جَرِيرٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ يُحْرَمُ الرِّفْقَ يُحْرَمُ الْخَيْرَ كُلَّهُ.";
abudawood.urdu = "سیدنا جریر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص نرم خوئی سے محروم ہوا وہ سب بھلائیوں سے محروم ہوا۔‘‘";
abudawood.hukam = "صحیح مسلم (2592)";
abudawood.description = ``;