var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ،حَدَّثَنَا عَفَّانُ،حَدَّثَنَا عَبْدُ الْوَاحِدِ،حَدَّثَنَا سُلَيْمَانُ الْأَعْمَشُ،عَنْ مَالِكِ بْنِ الْحَارِثِ قَالَ الْأَعْمَشُ وَقَدْ سَمِعْتُهُمْ يَذْكُرُونَ،عَنْ مُصْعَبِ بْنِ سَعْدٍ،عَنْ أَبِيهِ-قَالَ الْأَعْمَشُ: وَلَا أَعْلَمُهُ إِلَّا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-قَالَ: التُّؤَدَةُ فِي كُلِّ شَيْءٍ, إِلَّا فِي عَمَلِ الْآخِرَةِ.";
abudawood.urdu = "جناب مصعب اپنے والد (سیدنا سعد بن ابی وقاص رضی اللہ عنہ) سے روایت کرتے ہیں۔اعمش کہتے ہیں اور مجھے ایسے ہی معلوم ہے کہ انہوں نے نبی کریم ﷺ سے روایت کیا ‘ آپ ﷺ نے فرمایا ’’کسی کام میں جلد بازی نہیں (کرنی) چاہیئے سوائے اس کے کہ آخرت کا کام ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش عنعن ولم أجد تصریح سماعہ والمدلس إذا عنعن لا یحتج بہ عند الشافعي (الرسالۃ ص380 فقرۃ 1035،ص 379 فقرۃ : 1033) وغیرہ وھو الصواب`;
abudawood.anwaar = [167,1];