var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا الرَّبِيعُ بْنُ مُسْلِمٍ،عَنْ مُحَمَّدِ بْنِ زِيَادٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا يَشْكُرُ اللَّهَ مَنْ لَا يَشْكُرُ النَّاسَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جو شخص لوگوں کا شکریہ ادا نہیں کرتا ‘ وہ اللہ کا بھی شکر گزار نہیں ہوتا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الترمذي (1954 وسندہ صحیح)`;