var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،أَنَّ الْمُهَاجِرِينَ قَالُوا: يَا رَسُولَ اللَّهِ! ذَهَبَتِ الْأَنْصَارُ بِالْأَجْرِ كُلِّهِ! قَالَ: لَا, مَا دَعَوْتُمُ اللَّهَ لَهُمْ وَأَثْنَيْتُمْ عَلَيْهِمْ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ مہاجرین کہنے لگے: اے اللہ کے رسول! سارا اجر تو انصار لے گئے۔آپ ﷺ نے فرمایا ’’نہیں ‘ جب تک تم اللہ تعالیٰ سے ان کے لیے دعائیں کرتے رہو گے اور ان سے احسان مندی کا اظہار کرو گے (اس طرح ان کو اجر ملنے کے ساتھ ساتھ تمہیں بھی ملے گا)۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;