var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ،حَدَّثَنَا جَرِيرٌ عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ أُبْلِيَ بَلَاءً فَذَكَرَهُ, فَقَدْ شَكَرَهُ, وَإِنْ كَتَمَهُ, فَقَدْ كَفَرَهُ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جس نے کسی پر کوئی احسان کیا پھر اس دوسرے نے اس کا ذکر کیا تو یہ اس کا شکریہ ادا کرنا ہے اور اگر اس (دوسرے) نے اسے چھپایا تو یہ اس کی ناشکری اور ناقدری کی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش عنعن`;
abudawood.anwaar = [167,1];