var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... فِي هَذِهِ الْقِصَّةِ. قَالَ: ...وَإِرْشَادُ السَّبِيلِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے نبی کریم ﷺ سے اس قصے (حدیث) میں بیان کیا آپ ﷺ نے فرمایا ’’راہ گیر کی رہنمائی کرنا (بھی راستے کے حق میں شامل ہے)۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4641، 4661)`;