var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى النَّيْسَابُورِيُّ،أَخْبَرَنَا ابْنُ الْمُبَارَكِ،أَخْبَرَنَا جَرِيرُ سبْنُ حَازِمٍ،عَنْ إِسْحَاقَ بْنِ سُوَيْدٍ عَنِ ابْنِ حُجَيْرٍ الْعَدَوِيِّ،قَالَ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ الْقِصَّةِ. قَالَ: ...وَتُغِيثُوا الْمَلْهُوفَ،وَتَهْدُوا الضَّالَّ.";
abudawood.urdu = "سیدنا عمر بن خطاب رضی اللہ عنہ نے اس قصے (حدیث) میں بیان کیا کہ نبی کریم ﷺ نے فرمایا ’’پریشان حال کی مدد کرو اور راستہ بھول جانے والے کی رہنمائی کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن حجیر العدوي مستور (تق : 8461) و روی لہ الضیاء المقدسي فی المختارۃ<br>وللحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [167,1];