var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا سَعِيدٌ الْجُرَيْرِيُّ،عَنْ أَبِي الْعَلَاءِ،عَنْ مُطَرِّفٍ،عَنْ أَبِيهِ قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي،فَبَزَقَ تَحْتَ قَدَمِهِ الْيُسْرَى.";
abudawood.urdu = "جناب مطرف اپنے والد (سیدنا عبداللہ بن شخیر رضی اللہ عنہ) سے روایت کرتے ہیں،وہ کہتے ہیں کہ میں رسول اللہ ﷺ کی خدمت میں حاضر ہوا جبکہ آپ ﷺ نماز پڑھ رہے تھے تو آپ ﷺ نے اپنے بائیں قدم کے نیچے تھوکا۔";
abudawood.hukam = "صحیح مسلم (554)";
abudawood.description = ``;