var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ الْأَنْصَارِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: خَيْرُ الْمَجَالِسِ أَوْسَعُهَا.\nقَالَ أَبُو دَاوُد: هُوَ عَبْدُ الرَّحْمَنِ بْنُ عَمْرِو بْنِ أَبِي عَمْرَةَ الْأَنْصَارِيُّ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا آپ ﷺ فرماتے تھے ’’بہترین مجلس وہ ہے جو وسیع اور کھلی ہو۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ راوی حدیث عبدالرحمٰن بن ابو عمرہ کا صحیح نسب یوں ہے ’’عبدالرحمٰن بن عمرو بن ابو عمرہ الانصاری۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4723)`;