var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ وَمَخْلَدُ بْنُ خَالِدٍ،قَالَا: حَدَّثَنَا سُفْيَانُ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،قَالَ: حَدَّثَنِي مَنْ سَمِعَ أَبَا هُرَيْرَةَ،يَقُولُ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا كَانَ أَحَدُكُمْ فِي الشَّمْسِ-وَقَالَ مَخْلَدٌ فِي الْفَيْءِ-،فَقَلَصَ عَنْهُ الظِّلُّ, وَصَارَ بَعْضُهُ فِي الشَّمْسِ وَبَعْضُهُ فِي الظِّلِّ, فَلْيَقُمْ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ سیدنا ابوالقاسم ﷺ نے فرمایا ’’جب کوئی شخص دھوپ میں بیٹھا ہو،مخلد کے الفاظ ہیں اگر کوئی سائے میں بیٹھا ہو اور پھر اس سے سایہ ٹل جائے اور وہ کچھ دھوپ میں آ جائے اور کچھ سائے میں تو وہاں سے اٹھ جائے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4725)
وللحدیث شاھد عند ابن ماجہ (3722 وسندہ حسن)`;