var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ إِسْمَاعِيلَ،قَالَ: حَدَّثَنِي قَيْسٌ،عَنْ أَبِيهِ, أَنَّهُ جَاءَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ،فَقَامَ فِي الشَّمْسِ،فَأَمَرَ بِهِ فَحُوِّلَ إِلَى الظِّلِّ.";
abudawood.urdu = "جناب قیس (قیس بن ابوحازم) اپنے والد سے روایت کرتے ہیں کہ وہ آئے جبکہ رسول اللہ ﷺ خطبہ ارشاد فرما رہے تھے۔تو یہ دھوپ میں کھڑے ہو گئے تو آپ ﷺ نے انہیں حکم دیا تو سائے میں چلے گئے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;