var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ الْأَعْمَشِ،قَالَ: حَدَّثَنِي الْمُسَيِّبُ بْنُ رَافِعٍ،عَنْ تَمِيمِ بْنِ طَرَفَةَ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ: دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ،وَهُمْ حِلَقٌ،فَقَالَ: مَالِي أَرَاكُمْ عِزِينَ.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ مسجد میں تشریف لائے جب کہ صحابہ ٹولیاں بنائے بیٹھے تھے۔تو آپ ﷺ نے فرمایا ’’کیا بات ہے تم ٹولیوں میں جدا جدا بیٹھے ہو؟‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4724)
انظر الحدیث السابق (661) ورواہ مسلم (430)`;