var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرَكَانِيُّ وَهَنَّادٌ أَنَّ شَرِيكًا أَخْبَرَهُمْ،عَنْ سِمَاكٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ: كُنَّا إِذَا أَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, جَلَسَ أَحَدُنَا حَيْثُ يَنْتَهِي.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ ہم جب نبی کریم ﷺ کی مجلس میں آتے تھے تو جہاں مجلس پہنچی ہوتی وہیں (آخر میں) بیٹھ جایا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف ؎<br>ترمذی (2725)<br>شریک مدلس وعنعن<br>ولم أجد من تابعہ<br>وللحدیث شاھد ضعیف فی المعجم الکبیر للطبراني (7197) وحدیث البخاري (66) ومسلم (2176) یغني عنہ`;
abudawood.anwaar = [167,1];