var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا أَبَانُ،حَدَّثَنَا قَتَادَةُ،قَالَ: حَدَّثَنِي أَبُو مِجْلَزٍ،عَنْ حُذَيْفَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَعَنَ مَنْ جَلَسَ وَسْطَ الْحَلْقَةِ.";
abudawood.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے لعنت کی ہے ایسے آدمی پر جو حلقے کے درمیان میں بیٹھتا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2753)<br>أبو مجلز لم یدرک حذیفۃ رضي اللّٰہ عنہ (انظر جامع التحصیل ص 296)`;
abudawood.anwaar = [167,1];