var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُمْ،عَنْ شُعْبَةَ،عَنْ عَقِيلِ بْنِ طَلْحَةَ،قَالَ: سَمِعْتُ أَبَا الْخَصِيبِ عَنِ ابْنِ عُمَرَ،قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَامَ لَهُ رَجُلٌ مِنْ مَجْلِسِهِ،فَذَهَبَ لِيَجْلِسَ فِيهِ،فَنَهَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nقَالَ أَبُو دَاوُد: أَبُو الْخَصِيبِ اسْمُهُ زِيَادُ بْنُ عَبْدِ الرَّحْمَنِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ ایک شخص نبی کریم ﷺ کے پاس آیا تو ایک آدمی اس کے لیے اپنی جگہ سے اٹھ کھڑا ہوا ‘ وہ (آنے والا) وہاں بیٹھنے لگا تو نبی کریم ﷺ نے اس کو منع فرما دیا۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابو خصیب کا نام زیاد بن عبدالرحمٰن ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو الخصیب وثقہ ابن حبان وحدہ وحدیث مسلم (29/ 2177) والبخاري (6269) یغني عنہ`;
abudawood.anwaar = [168,1];