var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْعَطَّارُ،حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ،عَنْ شُبَيْلِ بْنِ عَزْرَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَثَلُ الْجَلِيسِ الصَّالِحِ..., فَذَكَرَ نَحْوَهُ.";
abudawood.urdu = "شبیل بن عزرہ نے سیدنا انس بن مالک رضی اللہ عنہ سے روایت کیا کہ نبی کریم ﷺ نے فرمایا ’’صالح ساتھی کی مثال‘‘ اور مذکورہ بالا حدیث کی مانند بیان کیا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;