var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ،أَخْبَرَنَا ابْنُ الْمُبَارَكِ،عَنْ حَيْوَةَ بْنِ شُرَيْحٍ،عَنْ سَالِمِ بْنِ غَيْلَانَ عَنِ الْوَلِيدِ بْنِ قَيْسٍ،عَنْ أَبِي سَعِيدٍ أَوْ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تُصَاحِبْ إِلَّا مُؤْمِنًا،وَلَا يَأْكُلْ طَعَامَكَ إِلَّا تَقِيٌّ.";
abudawood.urdu = "سیدنا ابوسعید رضی اللہ عنہ روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’صرف مومن آدمی کی صحبت اختیار کر اور تیرا کھانا بھی کوئی متقی ہی کھائے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (5018)
أخرجہ الترمذي (2395 وسندہ صحیح)`;