var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا ابْنُ بَشَّارٍ،حَدَّثَنَا أَبُو عَامِرٍ وَأَبُو دَاوُدَ،قَالَا: حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ،قَالَ: حَدَّثَنِي مُوسَى بْنُ وَرْدَانَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الرَّجُلُ عَلَى دِينِ خَلِيلِهِ،فَلْيَنْظُرْ أَحَدُكُمْ مَنْ يُخَالِلُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’انسان اپنے محبوب ساتھی کے دین پر ہوتا ہے۔تو تمہیں چاہیئے کہ غور کرو کس سے دوستی کر رہے ہو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (5019)
أخرجہ الترمذي (2378 وسندہ حسن)`;