var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ،حَدَّثَنَا أَبِي،حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ بُرْقَانَ،عَنْ يَزِيدَ يَعْنِي ابْنَ الْأَصَمِّ،عَنْ أَبِي هُرَيْرَةَ, يَرْفَعُهُ،قَالَ: الْأَرْوَاحُ جُنُودٌ, مُجَنَّدَةٌ فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ،وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ مرفوعاً (نبی کریم ﷺ سے) بیان کرتے ہیں کہ ’’روحیں (ازل میں) مجتمع لشکر تھیں ‘ جن کا (وہاں) آپس میں تعارف ہو گیا (دنیا میں) ان کے اندر الفت ہو جاتی ہے اور جن کی (وہاں) آپس میں ناواقفی رہی ہو وہ (اس دنیا میں بھی) ایک دوسرے سے جدا جدا رہتی ہیں۔‘‘";
abudawood.hukam = "صحیح مسلم (2638)";
abudawood.description = ``;