var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو أُسَامَةَ،حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللَّهِ،عَنْ جَدِّهِ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ أَحَدًا مِنْ أَصْحَابِهِ فِي بَعْضِ أَمْرِهِ،قَالَ: بَشِّرُوا وَلَا تُنَفِّرُوا،وَيَسِّرُوا وَلَا تُعَسِّرُوا.";
abudawood.urdu = "سیدنا ابوموسیٰ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ اپنے صحابہ کو جب اپنے کسی کام کے لیے بھیجا کرتے تھے تو انہیں فرماتے ’’خوشخبری دینے والے بننا ‘ نفرت نہ دلانا ‘ آسانی کرنا اور تنگی اور مشقت نہ ڈالنا۔‘‘";
abudawood.hukam = "صحیح مسلم (1732)";
abudawood.description = ``;