var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ،قَالَ: حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ يَعْقُوبَ ابْنِ عُتْبَةَ،عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ،عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ, عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ يَتَحَدَّثُ, يُكْثِرُ أَنْ يَرْفَعَ طَرْفَهُ إِلَى السَّمَاءِ.";
abudawood.urdu = "جناب یوسف رحمہ اللہ اپنے والد عبداللہ بن سلام رضی اللہ عنہ سے روایت کرتے ہیں کہ انہوں نے کہا: رسول اللہ ﷺ جب بیٹھے باتیں کر رہے ہوتے تو آپ ﷺ کی نظر اکثر آسمان کی طرف ہوتی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن (تقدم : 47) إلا في روایۃ سفیان بن وکیع (ضعیف ضعفہ الجمہور) عن یونس بن بکیر عنہ`;
abudawood.anwaar = [168,1];