var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ،عَنْ مِسْعَرٍ،قَالَ: سَمِعْتُ شَيْخًا فِي الْمَسْجِدِ يَقُولُ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ: كَانَ فِي كَلَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرْتِيلٌ أَوْ تَرْسِيلٌ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما کا بیان ہے کہ رسول اللہ ﷺ کی گفتگو میں انتہائی ٹھہراؤ ہوتا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الشیخ الراوي عن جابر رضي اللّٰہ عنہ : مجہول (عون المعبود 4 /409)`;
abudawood.anwaar = [168,1];