var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ أُسَامَةَ عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ رَحِمَهَا اللَّهُ،قَالَتْ: كَانَ كَلَامُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَامًا فَصْلًا, يَفْهَمُهُ كُلُّ مَنْ سَمِعَهُ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ کی گفتگو اس قدر واضح ہوا کرتی تھی کہ ہر سننے والا اسے سمجھ لیتا تھا۔";
abudawood.hukam = "حسن";
abudawood.description = `تقدم طرفہ الصحیح (3654)`;