var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا الْفَرَجُ بْنُ فَضَالَةَ،عَنْ أَبِي سَعِيدٍ،قَالَ: رَأَيْتُ وَاثِلَةَ بْنَ الْأَسْقَعِ فِي مَسْجِدِ دِمَشْقَ بَصَقَ عَلَى الْبُورِيِّ،ثُمَّ مَسَحَهُ بِرِجْلِهِ،فَقِيلَ لَهُ: لِمَ فَعَلْتَ هَذَا؟ قَالَ: لِأَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُه";
abudawood.urdu = "جناب ابوسعید کہتے ہیں کہ میں نے سیدنا واثلہ بن اسقع رضی اللہ عنہ کو دمشق کی مسجد میں دیکھا کہ انہوں نے چٹائی پر تھوکا اور پھر اسے پاؤں سے مسل دیا،تو انہیں کہا گیا کہ آپ نے ایسے کیوں کیا؟ انہوں نے کہا: میں نے رسول اللہ ﷺ کو ایسے ہی کرتے ہوئے دیکھا تھا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الفرج بن فضالۃ: ضعیف،وشیخہ أبو سعید الحمیري الشامي: مجہول (تقریب: 5383،8118)`;
abudawood.anwaar = [31,1];