var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَمُوسَى بْنُ إِسْمَاعِيلَ،قَالَا: حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زَيِادٍ،حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: كُلُّ خُطْبَةٍ لَيْسَ فِيهَا تَشَهُّدٌ, فَهِيَ كَالْيَدِ الْجَذْمَاءِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’ہر وہ خطبہ جس میں تشہد (اللہ کی توحید اور محمد رسول اللہ ﷺ کی رسالت کا ذکر) نہ ہو ایسے ہے جیسے جذام زدہ (ناقص اور عیب دار) ہاتھ۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;