var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الصَّوَّافُ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حُمْرَانَ،أَخْبَرَنَا عَوْفُ بْنُ أَبِي جَمِيلَةَ،عَنْ زِيَادِ بْنِ مِخْرَاقٍ،عَنْ أَبِي كِنَانَةَ،عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ مِنْ إِجْلَالِ اللَّهِ إِكْرَامَ ذِي الشَّيْبَةِ الْمُسْلِمِ،وَحَامِلِ الْقُرْآنِ غَيْرِ الْغَالِي فِيهِ وَالْجَافِي عَنْهُ،وَإِكْرَامَ ذِي السُّلْطَانِ الْمُقْسِطِ.";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’بلاشبہ بوڑھے مسلمان اور صاحب قرآن کی عزت کرنا جو اس میں غلو اور تقصیر سے بچتا ہو اور (اسی طرح) حاکم عادل کی عزت کرنا ‘ اللہ عزوجل کی عزت کرنے کا حصہ ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو کنانۃ مجہول (تق : 8327)`;
abudawood.anwaar = [168,2];