var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ وَأَحْمَدُ بْنُ عَبْدَةَ الْمَعْنَى،قَالَا: حَدَّثَنَا حَمَّادٌ،حَدَّثَنَا عَامِرٌ الْأَحْوَلُ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،قَالَ ابْنُ عَبْدَةَ: عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يُجْلَسْ بَيْنَ رَجُلَيْنِ إِلَّا بِإِذْنِهِمَا.";
abudawood.urdu = "جناب عمرو بن شعیب،اپنے والد سے وہ اپنے دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’دو آدمیوں کے درمیان گھس کر مت بیٹھا جائے سوائے اس کے کہ وہ اجازت دے دیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4704)
أخرجہ الترمذي (2752 وسندہ حسن)`;