var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ،أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَحِلُّ لِرَجُلٍ أَنْ يُفَرِّقَ بَيْنَ اثْنَيْنِ إِلَّا بِإِذْنِهِمَا.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کسی کیلئے حلال نہیں کہ دو آدمیوں کو جدا جدا کر دے (جو مل کر بیٹھے ہوئے ہوں تو ان میں گھس بیٹھے) الا یہ کہ ان دونوں کی اجازت ہو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4703)
أخرجہ الترمذي (2752 وسندہ حسن)`;