var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنِي إِسْحَاقُ بْنُ مُحَمَّدٍ الْأَنْصَارِيُّ،عَنْ رُبَيْحِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ جَدِّهِ أَبِي سَعِيدٍ الْخُدْرِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا جَلَسَ, احْتَبَى بِيَدِهِ.\nقَالَ أَبُو دَاوُد: عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ شَيْخٌ مُنْكَرُ الْحَدِيثِ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب بیٹھتے تو اپنے گھٹنوں کو سینے سے ملا کر اپنے ہاتھ ان کے گرد لپیٹ لیا کرتے تھے۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ سند میں مذکور عبداللہ بن ابراہیم شیخ منکر الحدیث ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف جدًا<br>ترمذی فی الشمائل (128)<br>إسحاق بن محمد الأنصاري مجہول (تق : 383) وتفرد عنہ عبد اللّٰہ بن إبراہیم الغفاري وھو متروک متہم بوضع الحدیث(انظر التقریب : 3199)`;
abudawood.anwaar = [169,1];