var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ،عَنْ عَمْرِو بْنِ الشَّرِيدِ،عَنْ أَبِيهِ الشَّرِيدِ بْنِ سُوَيْدٍ قَالَ: مَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا جَالِسٌ هَكَذَا،وَقَدْ وَضَعْتُ يَدِيَ الْيُسْرَى خَلْفَ ظَهْرِي،وَاتَّكَأْتُ عَلَى أَلْيَةِ يَدِي،فَقَالَ: أَتَقْعُدُ قِعْدَةَ الْمَغْضُوبِ عَلَيْهِمْ؟!.";
abudawood.urdu = "سیدنا شرید بن سوید رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ میرے پاس سے گزرے جب کہ میں اپنا بایاں ہاتھ کمر کے پیچھے کر کے انگوٹھے کی جگہ پر دباؤ ڈال کر بیٹھا ہوا تھا تو آپ ﷺ نے فرمایا ’’کیا تم ان لوگوں کی طرح بیٹھتے ہو جن پر اللہ کا غضب ہوا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن جریج عنعن ولم أجد تصریح سماعہ فی السند الموصول !`;
abudawood.anwaar = [169,1];