var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ عَوْفٍ،قَالَ: حَدَّثَنِي أَبُو الْمِنْهَالِ،عَنْ أَبِي بَرْزَةَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنِ النَّوْمِ قَبْلَهَا،وَالْحَدِيثِ بَعْدَهَا.";
abudawood.urdu = "سیدنا ابوبرزہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ منع فرمایا کرتے تھے کہ عشاء کی نماز سے پہلے سویا جائے یا اس کے بعد باتوں میں مشغول رہا جائے۔";
abudawood.hukam = "صحیح بخاری (599)";
abudawood.description = ``;