var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ،حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الْفَجْرَ, تَرَبَّعَ فِي مَجْلِسِهِ،حَتَّى تَطْلُعَ الشَّمْسُ حَسْنَاءَ.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ جب فجر کی نماز پڑھا لیتے تو اپنی جگہ پر آلتی پالتی مار کر بیٹھے رہتے , حتیٰ کہ سورج خوب چڑھ آتا۔";
abudawood.hukam = "صحیح مسلم (670)";
abudawood.description = `مشکوۃ المصابیح (4715)`;