var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ ح،وحَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنِ الْأَعْمَشِ،عَنْ شَقِيقٍ يَعْنِي ابْنَ سَلَمَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَنْتَجِي اثْنَانِ دُونَ الثَّالِثِ, فَإِنَّ ذَلِكَ يُحْزِنُهُ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’دو آدمی اپنے تیسرے ساتھی کو چھوڑ کر سرگوشی نہ کریں ‘ اس سے وہ رنجیدہ ہو گا۔‘‘";
abudawood.hukam = "صحیح مسلم (8184)";
abudawood.description = ``;