var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي صَالِحٍ،عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... مِثْلَهُ.\nقَالَ أَبُو صَالِحٍ: فَقُلْتُ لِابْنِ عُمَرَ: فَأَرْبَعَةٌ؟ قَالَ: لَا يَضُرُّكَ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ رسول اللہ ﷺ نے فرمایا اور مذکورہ بالا کی مانند بیان کیا۔ابوصالح کہتے ہیں کہ میں نے سیدنا ابن عمر رضی اللہ عنہما سے پوچھا ‘ اگر چار افراد ہوں تو؟ کہا کہ اس میں کوئی حرج نہیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `الأعمش صرح بالسماع عند البخاري فی الأدب المفرد (1169)`;