var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،قَالَ: كُنْتُ عِنْدَ أَبِي جَالِسًا،وَعِنْدَهُ غُلَامٌ،فَقَامَ ثُمَّ رَجَعَ،فَحَدَّثَ أَبِي،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا قَامَ الرَّجُلُ مِنْ مَجْلِسٍ ثُمَّ رَجَعَ إِلَيْهِ, فَهُوَ أَحَقُّ بِهِ.";
abudawood.urdu = "جناب سہیل بن ابی صالح کہتے ہیں کہ میں اپنے والد کے پاس بیٹھا ہوا تھا ‘ ان کے پاس ایک غلام بھی تھا۔تو وہ اٹھ کر گیا اور پھر واپس آ گیا تو میرے والد نے سیدنا ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی کہ نبی کریم ﷺ نے فرمایا ’’جو شخص اپنی جگہ سے اٹھ کر جائے اور پھر واپس لوٹ آئے تو وہی اس جگہ کا زیادہ حقدار ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2179)";
abudawood.description = ``;