var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ،حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا مِنْ قَوْمٍ يَقُومُونَ مِنْ مَجْلِسٍ،لَا يَذْكُرُونَ اللَّهَ فِيهِ, إِلَّا قَامُوا عَنْ مِثْلِ جِيفَةِ حِمَارٍ،وَكَانَ لَهُمْ حَسْرَةً.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو لوگ کسی مجلس سے اٹھیں اور انہوں نے اس میں اﷲ کا ذکر نہ کیا ہو ‘ تو وہ ایسے ہیں گویا کسی مردار گدھے پر سے اٹھے ہوں اور (آخرت میں) یہ مجلس ان کے لیے حسرت کا باعث ہو گی (تمنا کریں گے کاش کہ ہم نے اس میں اﷲ کا ذکر کر لیا ہوتا)۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (2273)`;