var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ عَنِ ابْنِ عَجْلَانَ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, أَنَّهُ قَالَ: مَنْ قَعَدَ مَقْعَدًا لَمْ يَذْكُرِ اللَّهَ فِيهِ, كَانَتْ عَلَيْهِ مِنَ اللَّهِ تِرَةٌ،وَمَنِ اضْطَجَعَ مَضْجَعًا لَا يَذْكُرُ اللَّهَ فِيهِ, كَانَتْ عَلَيْهِ مِنَ اللَّهِ تِرَةٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص کسی جگہ یا مجلس میں بیٹھا ہو اور اس میں اس نے اﷲ کا ذکر نہ کیا ہو ‘ تو یہ اس کے لیے اﷲ کی طرف سے بہت نقصان کا باعث ہو گی۔اور جو کوئی کسی جگہ لیٹا ہو اور اس میں اس نے اﷲ کا ذکر نہ کیا ہو ‘ تو یہ اس کے لیے اﷲ کی طرف سے بہت نقصان کا باعث ہو گی۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2272)
رواہ الحمیدي بتحقیقي (1158 وسندہ حسن) ابن عجلان تابعہ عبد الرحمن بن إسحاق المدني عند الحاکم (1/492)`;