var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،قَالَ: قَالَ عَمْرٌو و،حَدَّثَنِي بِنَحْوِ ذَلِكَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرٍو عَنِ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ... مِثْلَهُ.";
abudawood.urdu = "عبدالرحمٰن بن ابو عمرو نے بواسطہ مقبری سیدنا ابوہریرہ رضی اللہ عنہ سے،انہوں نے نبی کریم ﷺ سے مذکورہ بالاحدیث کی مانند بیان کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4857)`;