var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا لَيْثٌ،عَنْ عُقَيْلٍ عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, أَنَّهُ قَالَ: لَا يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ وَاحِدٍ مَرَّتَيْنِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’مومن ایک بل سے دوبار نہیں ڈسا جاتا۔‘‘";
abudawood.hukam = "صحیح بخاری (6133) صحیح مسلم (2998)";
abudawood.description = ``;