var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُسَيْنُ بْنُ مُعَاذِ بْنِ خُلَيْفٍ،حَدَّثَنَا عَبْدُ الْأَعْلَى،حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ،عَنْ أَبِي الطُّفَيْلِ،قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قُلْتُ: كَيْفَ رَأَيْتَهُ؟ قَالَ: كَانَ أَبْيَضَ مَلِيحًا،إِذَا مَشَى كَأَنَّمَا يَهْوِي فِي صَبُوبٍ.";
abudawood.urdu = "سیدنا ابوطفیل (عامر بن واثلہ رضی اللہ عنہ) کہتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا تھا۔سعید جریری نے ان سے پوچھا کہ آپ نے ان کو کیونکر دیکھا؟ انہوں نے کہا: آپ سفید رنگ اور انتہائی خوبصورت تھے اور جب چلتے تھے تو لگتا تھا کہ اوپر سے نیچے کو اتر رہے ہیں۔";
abudawood.hukam = "صحیح مسلم (2340)";
abudawood.description = ``;