var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ ح،وحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَضَعَ-وَقَالَ: قُتَيْبَةُ يَرْفَعَ-الرَّجُلُ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى،-زَادَ قُتَيْبَةُ وَهُوَ مُسْتَلْقٍ عَلَى ظَهْرِهِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے منع فرمایا ہے کہ آدمی اپنی ٹانگ پر ٹانگ رکھے۔قتیبہ کی روایت میں اضافہ ہے کہ جب وہ چٹ لیٹا ہوا ہو۔";
abudawood.hukam = "صحیح مسلم (2099)";
abudawood.description = ``;