var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا مَالِكٌ ح،وحَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ عَبَّادِ بْنِ تَمِيمٍ،عَنْ عَمِّهِ, أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَلْقِيًا-قَالَ الْقَعْنَبِيُّ فِي الْمَسْجِدِ-،وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى.";
abudawood.urdu = "جناب عباد بن تمیم اپنے چچا (عبداللہ بن زید بن عاصم انصاری رضی اللہ عنہ) سے روایت کرتے ہیں کہ انہوں نے رسول اللہ ﷺ کو دیکھا جب کہ آپ ﷺ چت لیٹے ہوئے تھے۔قعنبی نے کہا: مسجد میں لیٹے ہوئے تھے اور آپ اپنی ایک ٹانگ دوسری پر رکھے ہوئے تھے۔";
abudawood.hukam = "صحیح بخاری (475) صحیح مسلم (2100)";
abudawood.description = ``;