var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَطَاءٍ،عَنْ عَبْدِ الْمَلِكِ بْنِ جَابِرِ بْنِ عَتِيكٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا حَدَّثَ الرَّجُلُ بِالْحَدِيثِ ثُمَّ الْتَفَتَ, فَهِيَ أَمَانَةٌ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب کوئی تم سے بات کرتے ہوئے ادھر ادھر سے چوکنا ہو رہا ہو (کہ کہیں کوئی سنتا تو نہیں) تو یہ بات امانت ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (5061)
أخرجہ الترمذي (1959 وسندہ حسن)`;