var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ قَالَ قَرَأْتُ عَلَى عَبْدِ اللَّهِ بْنِ نَافِعٍ قَالَ،أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ عَنِ ابْنِ أَخِي جَابِرِ بْنِ عَبْدِ اللَّهِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْمَجَالِسُ بِالْأَمَانَةِ إِلَّا ثَلَاثَةَ مَجَالِسَ: سَفْكُ دَمٍ حَرَامٍ،أَوْ فَرْجٌ حَرَامٌ،أَوِ اقْتِطَاعُ مَالٍ بِغَيْرِ حَقٍّ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’مجالس امانت کے ساتھ ہیں۔سوائے تین مجلسوں کے جن میں ناحق خون بہانے ‘ یا ناحق فحش کاری ‘ یا ناحق مال مارنے کی بات ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن أخي جابر : مجہول،لم أجد لہ ترجمۃ`;
abudawood.anwaar = [169,1];