var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مِنْ شَرِّ النَّاسِ ذُو الْوَجْهَيْنِ،الَّذِي يَأْتِي هَؤُلَاءِ بِوَجْهٍ وَهَؤُلَاءِ بِوَجْهٍ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’بدترین ہے وہ آدمی جو دو رخا ہو کہ ان کے پاس جائے تو ایک منہ ہو ‘ دوسروں کے پاس جائے تو دوسرا منہ۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ الحمیدي بتحقیقي (1139 وسندہ صحیح، سفیان بن عیینۃ صرح بالسماع عندہ) ورواہ مسلم (2526)`;