var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا شَرِيكٌ عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ،عَنْ نُعَيْمِ بْنِ حَنْظَلَةَ،عَنْ عَمَّارٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ كَانَ لَهُ وَجْهَانِ فِي الدُّنْيَا, كَانَ لَهُ يَوْمَ الْقِيَامَةِ لِسَانَانِ مِنْ نَارٍ.";
abudawood.urdu = "سیدنا عمار بن یاسر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس کے دنیا میں دو منہ ہوئے (جو آدمی دو رخا ہوا) قیامت کے روز اس کی دو زبانیں ہوں گی جو آگ کی ہوں گے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4846)
شریک القاضي صرح بالسماع عند ابن أبی الدنیا في کتاب الصمت (274)`;