var abudawood = {};
abudawood.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ،حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ،قَالَ: حَدَّثَنَا زُهَيْرٌ عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ مِنْ أَكْبَرِ الْكَبَائِرِ اسْتِطَالَةَ الْمَرْءِ فِي عِرْضِ رَجُلٍ مُسْلِمٍ بِغَيْرِ حَقٍّ،وَمِنَ الْكَبَائِرِ السَّبَّتَانِ بِالسَّبَّةِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’بیشک کبیرہ گناہوں میں ایک بڑا کبیرہ گناہ یہ ہے کہ انسان اپنے مسلمان بھائی کی ناحق ہتک اور توہین کر دے۔کبیرہ گناہوں میں یہ بھی ہے کہ کوئی ایک کے بدلے دو گالیاں دے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عمرو بن أبي سلمۃ : شامي وقال الحافظ ابن حجر في ترجمۃ زھیر بن محمد التمیمي : ’’ روایۃ أھل الشام عنہ غیر مستقیمۃ ‘‘ إلخ (تقریب التہذیب: 2049)`;
abudawood.anwaar = [169,1];