var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،حَدَّثَنَا رَجُلٌ مِنْ مُزَيْنَةَ وَنَحْنُ عِنْدَ سَعِيدِ بْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: الْيَهُودُ أَتَوُا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،وَهُوَ جَالِسٌ فِي الْمَسْجِدِ فِي أَصْحَابِهِ،فَقَالُوا: يَا أَبَا الْقَاسِمِ! فِي رَجُلٍ وَامْرَأَةٍ زَنَيَا مِنْهُمْ.";
abudawood.urdu = "قبیلہ مزینہ کے ایک آدمی نے،جب کہ ہم سعید بن مسیب کے پاس بیٹھے ہوئے تھے۔ہمیں سیدنا ابوہریرہ رضی اللہ عنہ سے روایت بیان کی کہ (کچھ) یہودی نبی کریم ﷺ کی خدمت میں آئے جب کہ آپ ﷺ مسجد میں اپنے اصحاب کے ساتھ تشریف فرما تھے،انہوں نے آ کر کہا: اے ابوالقاسم! اور ان کے ایک مرد اور ایک عورت نے زنا کیا تھا،اس کے بارے میں دریافت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>رجل من مزینۃ: لم أعرفہ<br>وانظر الحدیث الآتي (3624،4450)`;
abudawood.anwaar = [31,1];