var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى،حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ،عَنْ هِشَامِ بْنِ سَعْدٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ, مَالُهُ،وَعِرْضُهُ،وَدَمُهُ،حَسْبُ امْرِئٍ مِنَ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’ایک مسلمان کے لیے دوسرے مسلمان کا مال،عزت اور خون حرام ہے۔بندے کے لیے یہی برائی کافی ہے کہ وہ اپنے مسلمان بھائی کو حقیر جانے۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (1927 وسندہ حسن) ولہ شاھد عند مسلم (2564)`;