var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ،حَدَّثَنَا ابْنُ ثَوْرٍ،عَنْ مَعْمَرٍ،عَنْ قَتَادَةَ،قَالَ: أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكُونَ مِثْلَ أَبِي ضَيْغَمٍ-أَوْ ضَمْضَمٍ-, شَكَّ ابْنُ عُبَيْدٍ كَانَ إِذَا أَصْبَحَ قَالَ: اللَّهُمَّ إِنِّي قَدْ تَصَدَّقْتُ بِعِرْضِي عَلَى عِبَادِكَ!";
abudawood.urdu = "جناب قتادہ رحمہ اللہ مروی ہے،انہوں نے کہا کیا تم سے ممکن نہیں کہ ابوضیغم یا ابو ضمضم کی طرح ہو جاؤ۔نام میں محمد بن عبید کو شبہ ہوا ہے۔جب صبح ہوتی تو وہ کہا کرتا تھا: اے اللہ! میں نے اپنی عزت تیرے بندوں کے لیے صدقہ کر دی ہے۔(جنہوں نے میری کوئی بے عزتی کی ہو میں نے انہیں معاف کر دیا ہے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ مدلس ولم یصرح بالسماع`;
abudawood.anwaar = [170,1];