var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدٍ الرَّمْلِيُّ وَابْنُ عَوْفٍ وَهَذَا لَفْظُهُ،قَالَا: حَدَّثَنَا الْفِرْيَابِيُّ،عَنْ سُفْيَانَ،عَنْ ثَوْرٍ،عَنْ رَاشِدِ بْنِ سَعْدٍ،عَنْ مُعَاوِيَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّكَ إِنِ اتَّبَعْتَ عَوْرَاتِ النَّاسِ أَفْسَدْتَهُمْ،أَوْ كِدْتَ أَنْ تُفْسِدَهُمْ.\nفَقَالَ أَبُو الدَّرْدَاءِ: كَلِمَةٌ سَمِعَهَا مُعَاوِيَةُ مِنْ رَسُولِ اللَّهِ نَفَعَهُ اللَّهُ تَعَالَى بِهَا.";
abudawood.urdu = "سیدنا معاویہ رضی اللہ عنہ سے روایت ہے،وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’اگر تو لوگوں کے عیوب کے پیچھے پڑ گیا تو تو انہیں بگاڑ دے گا‘‘ یا ’’قریب ہے کہ تو انہیں بگاڑ دے۔’’تو سیدنا ابودرداء رضی اللہ عنہ کہتے ہیں: یہ بات جو سیدنا معاویہ رضی اللہ عنہ نے رسول اللہ ﷺ سے سنی اللہ نے انہیں اس سے بہت فائدہ دیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (3709)
ولہ شاھد عند البخاري فی الأدب المفرد (248 وسندہ حسن)`;