var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ عَنِ الْأَعْمَشِ،عَنْ مُجَاهِدٍ،عَنْ عُبَيْدِ بْنِ عُمَيْرٍ،عَنْ أَبِي ذَرٍّ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ جُعِلَتْ لِيَ الْأَرْضُ طَهُورًا وَمَسْجِدًا.";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’زمین میرے لیے پاک کرنے والی بنائی گئی ہے اور جائے سجدہ بھی۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شواھد عند البخاري (335،438) ومسلم (521) وغيرهما`;