var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو مُعَاوِيَةَ, عَنِ الْأَعْمَشِ،عَنْ زَيْدِ بْنِ وَهْبٍ،قَالَ: أُتِيَ ابْنُ مَسْعُودٍ،فَقِيلَ: هَذَا فُلَانٌ تَقْطُرُ لِحْيَتُهُ خَمْرًا! فَقَالَ عَبْدُ اللَّهِ: إِنَّا قَدْ نُهِينَا عَنِ التَّجَسُّسِ،وَلَكِنْ إِنْ يَظْهَرْ لَنَا شَيْءٌ نَأْخُذْ بِهِ.";
abudawood.urdu = "جناب زید بن وہب بیان کرتے ہیں کہ سیدنا عبداللہ بن مسعود رضی اللہ عنہ کے پاس ایک آدمی لایا گیا اور بتایا گیا کہ یہ فلاں آدمی ہے اور اس کی ڈاڑھی سے شراب کے قطرے ٹپک رہے ہیں۔تو عبداللہ نے کہا: ہمیں ٹوہ لگانے سے منع کیا گیا ہے،ہاں اگر کوئی بات واضح ظاہر ہو تو ہم اس کا مواخذہ کریں گے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش عنعن`;
abudawood.anwaar = [170,1];