var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ إِبْرَاهِيمَ بْنِ نَشِيطٍ،عَنْ كَعْبِ بْنِ عَلْقَمَةَ،عَنْ أَبِي الْهَيْثَمِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ رَأَى عَوْرَةً فَسَتَرَهَا, كَانَ كَمَنْ أَحْيَا مَوْءُودَةً.";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’جس نے کسی کی کوئی برائی دیکھی اور پھر اس پر پردہ ڈال دیا تو اس نے گویا قبر میں گاڑی گئی لڑکی کو زندہ کر دیا۔“";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4984)
أبو الھیثم: وثقہ ابن حبان وصحح لہ الحاکم والذہبي`;