var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنِ الْعَلَاءِ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْمُسْتَبَّانِ, مَا قَالَا, فَعَلَى الْبَادِي مِنْهُمَا،مَا لَمْ يَعْتَدِ الْمَظْلُومُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’آپس میں گالی گلوچ کرنے والے جو بھی کہیں،اس کا گناہ ابتداء کرنے والے ہی پر ہے جب تک کہ مظلوم زیادتی نہ کرے۔“";
abudawood.hukam = "صحیح مسلم (2587)";
abudawood.description = ``;