var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصٍ،قَالَ: حَدَّثَنِي أَبِي،حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنِ الْحَجَّاجِ،عَنْ قَتَادَةَ،عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ،عَنْ عِيَاضِ بْنِ حِمَارٍ, أَنَّهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللَّهَ أَوْحَى إِلَيَّ أَنْ: تَوَاضَعُوا, حَتَّى لَا يَبْغِيَ أَحَدٌ عَلَى أَحَدٍ،وَلَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ.";
abudawood.urdu = "سیدنا عیاض بن حمار رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’بلاشبہ اللہ عزوجل نے مجھے وحی فرمائی ہے کہ تواضع اور انکسار اختیار کرو حتیٰ کہ کوئی کسی پر ظلم و زیادتی نہ کرے اور نہ کوئی کسی پر فخر کرے۔“";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ مسلم (2865)`;