var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ،حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ عَجْلَانَ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ،عَنْ أَبِي هُرَيْرَةَ, أَنَّ رَجُلًا كَانَ يَسُبُّ أَبَا بَكْرٍ... وَسَاقَ نَحْوَهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی سیدنا ابوبکر رضی اللہ عنہ کو برا بھلا کہا کرتا تھا۔اور مذکورہ بالا حدیث کی مانند روایت کیا۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ صفوان بن عیسیٰ نے ابن عجلان سے ایسے ہی روایت کیا ہے جیسے سفیان نے روایت کیا ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (5102)
محمد بن عجلان صرح بالسماع عند أحمد (2/436)`;