var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا مَاتَ صَاحِبُكُمْ فَدَعُوهُ،وَلَا تَقَعُوا فِيهِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تمہارا کوئی فوت ہو جائے تو اسے چھوڑ دو اور اس کی عیب چینی مت کرو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;