var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،أَخْبَرَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،عَنْ عِمْرَانَ بْنِ أَنَسٍ الْمَكِّيِّ،عَنْ عَطَاءٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اذْكُرُوا مَحَاسِنَ مَوْتَاكُمْ،وَكُفُّوا عَنْ مَسَاوِيهِمْ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’اپنے مرنے والوں کی خوبیاں بیان کیا کرو اور ان کی برائیوں سے باز رہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1019)<br>وقال البخاري:’’ عمران بن أنس المکي : منکر الحدیث ‘‘(سنن الترمذي : 1019)`;
abudawood.anwaar = [171,1];