var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا ابْنُ عُلَيَّةَ،عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِيهِ،عَنْ أَبِي بَكْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا مِنْ ذَنْبٍ أَجْدَرُ أَنْ يُعَجِّلَ اللَّهُ تَعَالَى لِصَاحِبِهِ الْعُقُوبَةَ فِي الدُّنْيَا مَعَ مَا يَدَّخِرُ لَهُ فِي الْآخِرَةِ مِثْلُ الْبَغْيِ وَقَطِيعَةِ الرَّحِمِ.";
abudawood.urdu = "سیدنا ابوبکرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کوئی گناہ اس لائق نہیں کہ اللہ تعالیٰ اس کی سزا دنیا میں بھی جلدی دے دے اور اس کے ساتھ ساتھ آخرت میں بھی اس کی سزا جمع رکھے جیسے کہ ظلم و زیادتی اور قطع رحمی ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4932)
أخرجہ الترمذي (2511 وسندہ صحیح) وابن ماجہ (4211 وسندہ صحیح)`;