var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ صَالِحٍ الْبَغْدَادِيُّ،حَدَّثَنَا أَبُو عَامِرٍ يَعْنِي عَبْدَ الْمَلِكِ بْنَ عَمْرٍو،حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ،عَنْ إِبْرَاهِيمَ بْنِ أَبِي أَسِيدٍ،عَنْ جَدِّهِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِيَّاكُمْ وَالْحَسَدَ, فَإِنَّ الْحَسَدَ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ-أَوْ قَالَ: الْعُشْبَ-.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’حسد (دوسروں پر جلنے اور کڑھنے) سے اپنے آپ کو بچاؤ۔بلاشبہ حسد نیکیوں کو ایسے کھا جاتا ہے جیسے آگ ایندھن کو یا فرمایا ’’جیسے آگ) گھاس پھوس کو کھا جاتی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>جد إبراہیم بن أبي أسید لا یعرف (تق: 8503)<br>وللحدیث شاہد ضعیف في سنن ابن ماجہ : 4210`;
abudawood.anwaar = [171,1];