var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ،حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدُبٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا تَلَاعَنُوا بِلَعْنَةِ اللَّهِ،وَلَا بِغَضَبِ،اللَّهِ وَلَا بِالنَّارِ.";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’اللہ کی لعنت سے لعنت مت کیا کرو اور اللہ کے غضب اور دوزخ کی بد دعا مت دیا کرو۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1976)<br>قتادۃ عنعن<br>ولحدیثہ شاہد مرسل عند عبد الرزاق (المصنف : 19531)`;
abudawood.anwaar = [171,1];