var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ،حَدَّثَنَا أَبِي،حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ،عَنْ أَبِي حَازِمٍ وَزَيْدِ بْنِ أَسْلَمَ أَنَّ أُمَّ الدَّرْدَاءِ،قَالَتْ: سَمِعْتُ أَبَا الدَّرْدَاءِ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: لَا يَكُونُ اللَّعَّانُونَ شُفَعَاءَ وَلَا شُهَدَاءَ.";
abudawood.urdu = "سیدنا ابودرداء رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ’’جو بہت زیادہ لعنت کرنے والے ہوئے وہ (کسی کے) سفارشی یا گواہ نہیں بن سکیں گے۔‘‘";
abudawood.hukam = "صحیح مسلم (2598)";
abudawood.description = ``;