var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا سُفْيَانُ،عَنْ حَبِيبٍ،عَنْ عَطَاءٍ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: سُرِقَ لَهَا شَيْءٌ،فَجَعَلَتْ تَدْعُو عَلَيْهِ! فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تُسَبِّخِي عَنْهُ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ ان کی کوئی چیز چوری ہو گئی تو وہ (چور کو) بد دعا دینے لگیں۔تو رسول اللہ ﷺ نے ان سے فرمایا ’’اس کی سزا کو اس سے ہلکا مت کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>وانظر الحدیث السابق(1497)`;
abudawood.anwaar = [171,1];