var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يَحْيَى بْنُ أَزْهَرَ وَابْنُ لَهِيعَةَ عَنِ الْحَجَّاجِ بْنِ شَدَّادٍ،عَنْ أَبِي صَالِحٍ الْغِفَارِيِّ،عَنْ عَلِيٍّ بِمَعْنَى سُلَيْمَانَ بْنِ دَاوُدَ قَالَ: فَلَمَّا خَرَجَ مَكَانَ فَلَمَّا بَرَزَ.";
abudawood.urdu = "ابوصالح غفاری سیدنا علی رضی اللہ عنہ کے واسطہ سے روایت کرتے ہیں۔سلیمان بن داود کی حدیث کے ہم معنی مروی ہے (جو اوپر ذکر ہوئی ہے) مگر اس میں «فلما برز» کی بجائے «فلما خرج» کے لفظ بیان کیے ہیں۔(معنی دونوں کے ایک ہیں)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق: 490`;
abudawood.anwaar = [31,1];