var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَبَاغَضُوا،وَلَا تَحَاسَدُوا،وَلَا تَدَابَرُوا،وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا،وَلَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’غصہ مت کیا کرو۔ایک دوسرے سے حسد مت کیا کرو۔ایک دوسرے کو پیٹھ مت دیا کرو (کہ میل جول چھوڑ دو) بلکہ اللہ کے بندے بھائی بھائی بن کر رہو۔کسی مسلمان کے لیے حلال نہیں کہ اپنے بھائی سے تین رات سے زیادہ میل جول چھوڑے رہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6075) صحیح مسلم (2559)";
abudawood.description = ``;