var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا سُفْيَانُ الثَّوْرِيُّ،عَنْ مَنْصُورٍ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثٍ،فَمَنْ هَجَرَ فَوْقَ ثَلَاثٍ فَمَاتَ دَخَلَ النَّارَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کسی مسلمان کے لیے حلال نہیں کہ اپنے بھائی سے تین دن سے زیادہ میل جول چھوڑے رہے۔جس نے تین دن سے زیادہ مقاطعہ کیا اور مر گیا تو وہ آگ میں جائے گا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (5035)
أخرجہ أحمد (2/392) والنسائي فی الکبریٰ (9161)`;