var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ حَيْوَةَ،عَنْ أَبِي عُثْمَانَ الْوَلِيدِ بْنِ أَبِي الْوَلِيدِ،عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ،عَنْ أَبِي خِرَاشٍ السُّلَمِيِّ, أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ هَجَرَ أَخَاهُ سَنَةً, فَهُوَ كَسَفْكِ دَمِهِ.";
abudawood.urdu = "سیدنا ابو خراش سلمی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا آپ ﷺ فرما رہے تھے ’’جس نے ایک سال تک اپنے بھائی سے روابط توڑے رکھے تو وہ ایسے ہے جیسے اس کا خون بہایا ہو۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (5036)
أخرجہ أحمد (4/220) وصححہ الحاکم (4/163) ووافقہ الذہبي`;