var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ أَبِي الزِّنَادِ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِيَّاكُمْ وَالظَّنَّ, فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ،وَلَا تَحَسَّسُوا وَلَا تَجَسَّسُوا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اپنے آپ کو گمان سے بچاؤ،بلاشبہ گمان سب سے جھوٹی بات ہے،اور نہ ٹوہ لگاؤ اور نہ جاسوسی کرو۔‘‘";
abudawood.hukam = "صحیح بخاری (6066) صحیح مسلم (2563)";
abudawood.description = ``;