var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ سُلَيْمَانَ يَعْنِي ابْنَ بِلَالٍ،عَنْ كَثِيرِ بْنِ زَيْدٍ عَنِ الْوَلِيدِ ابْنِ رَبَاحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْمُؤْمِنُ مِرْآةُ الْمُؤْمِنِ،وَالْمُؤْمِنُ أَخُو الْمُؤْمِنِ, يَكُفُّ عَلَيْهِ ضَيْعَتَهُ،وَيَحُوطُهُ مِنْ وَرَائِهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’مومن مومن کا آئینہ ہے،اور مومن مومن کا بھائی ہے،اس کے مال کا (نقصان ہوتا ہو تو) بچاؤ کرتا ہے اور اس کی غیر موجودگی میں اس کی (عزت کی) حفاظت کرتا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ البخاري فی الأدب المفرد (239)`;