var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ ح،وحَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عَبْدُ الْوَاحِدِ،عَنْ عَمْرِو بْنِ يَحْيَى،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: وَقَالَ مُوسَى فِي حَدِيثِهِ: فِيمَا يَحْسَبُ عَمْرٌو،إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْأَرْضُ كُلُّهَا مَسْجِدٌ إِلَّا الْحَمَّامَ وَالْمَقْبَرَةَ.";
abudawood.urdu = "سیدنا ابوسعید (ابوسعید خدری) رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا،اور موسیٰ (موسیٰ بن اسمٰعیل) نے اپنی روایت میں کہا،عمرو (عمرو بن یحییٰ) کا خیال ہے کہ نبی کریم ﷺ نے فرمایا ’’زمین ساری کی ساری مسجد ہے سوائے حمام اور مقبرہ کے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (737)`;