var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الْرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ قَالَ: لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ،لَعِبَتِ الْحَبَشَةُ لَقُدُومِهِ فَرَحًا بِذَلِكَ, لَعِبُوا بِحِرَابِهِمْ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جب مدینہ تشریف لائے تو حبشی لوگوں نے آپ ﷺ کی آمد کی خوشی میں اپنے نیزوں کے ساتھ (جنگی فن کا) مظاہرہ کیا تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (5962)`;