var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا مُطْعِمُ بْنُ الْمِقْدَامِ،قَالَ: حَدَّثَنَا نَافِعٌ،قَالَ: كُنْتُ رِدْفَ ابْنِ عُمَرَ إِذْ مَرَّ بِرَاعٍ يَزْمُرُ... فَذَكَرَ نَحْوَهُ. قَالَ أَبُو دَاوُد: أُدْخِلَ بَيْنَ مُطْعِمٍ وَنَافِعٍ سُلَيْمَانُ بْنُ مُوسَى.";
abudawood.urdu = "(مذکورہ بالا روایت کے سلسلے میں) جناب نافع رحمہ اللہ کہتے ہیں کہ میں سیدنا ابن عمر رضی اللہ عنہما کے ساتھ سواری پر ان کے پیچھے بیٹھا ہوا تھا کہ ان کا گزر ایک چرواہے کے پاس سے ہوا جو بانسری بجا رہا تھا۔اور مذکورہ بالا حدیث کی مانند ذکر کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں مطعم (مطعم بن مقدام) اور نافع کے درمیان سلیمان بن موسیٰ کا واسطہ بڑھا دیا گیا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;