var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ،قَالَ:،حَدَّثَنَا أَبُو الْمَلِيحِ،عَنْ مَيْمُونٍ،عَنْ نَافِعٍ قَالَ كُنَّا مَعَ ابْنِ عُمَرَ فَسَمِعَ صَوْتَ زَامِرٍ فَذَكَرَ نَحْوَهُ.\nقَالَ أَبُو دَاوُد: وَهَذَا أَنْكَرُهَا.";
abudawood.urdu = "جناب میمون بن مہران ‘ نافع سے روایت کرتے ہیں کہہم سیدنا ابن عمر رضی اللہ عنہما کے ساتھ تھے کہ انہوں نے ایک بانسری والے کی آواز سنی۔اور مذکورہ بالا حدیث کی مانند ذکر کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ یہ روایت سب سے زیادہ منکر (ضعیف) ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `میمون ھو ابن مھران وأبو الملیح ھو الحسن بن عمر الرقّي`;