var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا سَلَّامُ بْنُ مِسْكِينٍ،عَنْ شَيْخٍ شَهِدَ أَبَا وَائِلٍ فِي وَلِيمَةٍ،فَجَعَلُوا يَلْعَبُونَ،يَتَلَعَّبُونَ،يُغَنُّونَ،فَحَلَّ أَبُو وَائِلٍ حَبْوَتَهُ،وَقَالَ: سَمِعْتْ عَبْدَ اللَّهِ يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: الْغِنَاءُ يُنْبِتُ النِّفَاقَ فِي الْقَلْبِ.";
abudawood.urdu = "سلام بن مسکین ایک شیخ سے روایت کرتے ہیں جو جناب ابووائل رحمہ اللہ کے ساتھ ایک ولیمے میں حاضر تھا۔پس وہ لوگ آپس میں کھیلنے کھلانے اور گانے لگے تو جناب ابووائل رحمہ اللہ نے اپنی کمر سے اپنا کپڑا کھولا اور کہا: میں نے سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے سنا ہے وہ فرماتے تھے میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرما رہے تھے ’’گانا دل میں نفاق پیدا کرتا ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شیخ سلام بن مسکین : مجہول،لم أجد من وثقہ<br>والحدیث ضعفہ البیہقي في شعب الإیمان (5099)`;
abudawood.anwaar = [172,1];