var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ،عَنْ يَحْيَى،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ الْمُخَنَّثِينَ مِنَ الرِّجَالِ،وَالْمُتَرَجِّلَاتِ مِنَ النِّسَاءِ،وَقَالَ: أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ،وَأَخْرِجُوا فُلَانًا وَفُلَانًا.-يَعْنِي: الْمُخَنَّثِينَ-.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ نے ہیجڑے بننے والے مردوں اور مردانہ انداز اختیار کرنے والوں عورتوں پر لعنت فرمائی ہے۔اور فرمایا ’’انہیں اپنے گھروں سے نکال باہر کرو،اور فلاں فلاں ہیجڑے کو باہر نکال دو۔‘‘";
abudawood.hukam = "صحیح بخاری (6834)";
abudawood.description = ``;