var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ قَالَتْ: كُنْتُ أَلْعَبُ بِالْبَنَاتِ،فَرُبَّمَا دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدِي الْجَوَارِي،فَإِذَا دَخَلَ, خَرَجْنَ،وَإِذَا خَرَجَ, دَخَلْنَ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں گڑیوں کے ساتھ کھیلا کرتی تھی۔تو بسا اوقات رسول اللہ ﷺ تشریف لے آتے اور میرے ہاں (محلے کی) بچیاں ہوتیں۔جب آپ ﷺ تشریف لاتے تو وہ چلی جاتیں اور جب آپ ﷺ چلے جاتے تو وہ آ جایا کرتی تھیں۔";
abudawood.hukam = "صحیح بخاری (6130) صحیح مسلم (2440)";
abudawood.description = ``;