var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ،حَدَّثَنَا أَبُو أُسَامَةَ مِثْلَهُ،قَالَ: عَلَى خَيْرِ طَائِرٍ،فَسَلَّمَتْنِي إِلَيْهِنَّ،فَغَسَلْنَ رَأْسِي،وَأَصْلَحْنَنِي،فَلَمْ يَرُعْنِي إِلَّا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،ضُحًى،فَأَسْلَمْنَنِي إِلَيْهِ.جناب ابواسامہ نے مذکورہ";
abudawood.urdu = "جناب ابواسامہ نے مذکورہ بالاحدیث کے مثل روایت کیا اور کہا کہ اﷲ کرے تیری قسمت اچھی ہو۔اور مجھے ان عورتوں کے حوالے کر دیا۔انہوں نے میرا سر دھویا اور مجھے بنایا سنوارا۔اور میں اس وقت ڈر سی گئی جب دن چڑھے رسول اللہ ﷺ میرے سامنے ہوئے تو انہوں نے مجھے آپ کے حوالے کر دیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4933)`;