var abudawood = {};
abudawood.arabic = "اﷲ کرے تیری قسمت اچھی ہو۔اور مجھے ان عورتوں کے حوالے کر دیا۔انہوں نے میرا سر دھویا اور مجھے بنایا سنوارا۔اور میں اس وقت ڈر سی گئی جب دن چڑھے رسول اللہ ﷺ میرے سامنے ہوئے تو انہوں نے مجھے آپ کے حوالے کر دیا۔";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ جب ہم مدینے آئے تو میرے پاس کچھ عورتیں آئیں جبکہ میں ایک جھولے پر کھیل رہی تھی۔اور میرے بال کانوں سے نیچے اتر رہے تھے۔تو وہ مجھے لے گئیں اور مجھے تیار کیا ‘ بنایا سنوارا۔پھر وہ مجھے رسول اللہ ﷺ کی خدمت میں لے آئیں۔میری (رسول اللہ ﷺ کے گھر) رخصتی ہوئی تو میری عمر نو سال تھی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انظر الحدیث السابق (4933)`;