var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ مُوسَى بْنِ مَيْسَرَةَ،عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ،عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ لَعِبَ بِالنَّرْدِ, فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ.";
abudawood.urdu = "سیدنا ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص چوسر کھیلا اس نے اﷲ اور اس کے رسول کی نافرمانی کی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3762)<br>سعید بن أبي ہند ثقۃ،<br>أرسل عن أبي موسی (تق : 2490) وحدیث مسلم (2260) یغني عنہ`;
abudawood.anwaar = [172,1];