var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ،عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ،عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ لَعِبَ بِالنَّرْدَشِيرِ, فَكَأَنَّمَا غَمَسَ يَدَهُ فِي لَحْمِ خِنْزِيرٍ وَدَمِهِ.";
abudawood.urdu = "جناب سلیمان بن بریدہ اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جو شخص نرد شیر (چوسر) کھیلا گویا اس نے اپنا ہاتھ سور کے گوشت اور خون سے آلودہ کیا۔‘‘";
abudawood.hukam = "صحیح مسلم (2060)";
abudawood.description = ``;