var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى يَعْنِي ابْنَ الطَّبَّاعِ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنْ عَبْدِ الْمَلِكِ بْنِ الرَّبِيعِ بْنِ سَبْرَةَ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مُرُوا الصَّبِيَّ بِالصَّلَاةِ إِذَا بَلَغَ سَبْعَ سِنِينَ،وَإِذَا بَلَغَ عَشْرَ سِنِينَ فَاضْرِبُوهُ عَلَيْهَا.";
abudawood.urdu = "عبدالملک بن ربیع بن سبرہ عن ابیہ عن جدہ (سیدنا سبرہ بن معبد جہنی رضی اللہ عنہ) کہتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’بچہ جب سات سال کا ہو جائے تو اسے نماز کا حکم دو اور جب دس سال کا ہو جائے (اور نہ پڑھے) تو اسے مارو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (573)`;