var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَتْبَعُ حَمَامَةً،فَقَالَ: شَيْطَانٌ يَتْبَعُ شَيْطَانَةً.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ایک آدمی کو دیکھا وہ کبوتری کے پیچھے لگا ہوا تھا۔آپ ﷺ نے فرمایا ’’شیطان ‘ شیطاننی کے پیچھے لگا ہوا ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4506)
أخرجہ ابن ماجہ (3765 وسندہ حسن)`;