var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ السَّرْحِ،قَالَا: حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي نَجِيحٍ عَنِ ابْنِ عَامِرٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو, يَرْوِيهِ قَالَ ابْنُ السَّرْحِ: عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: مَنْ لَمْ يَرْحَمْ صَغِيرَنَا وَيَعْرِفْ حَقَّ كَبِيرِنَا فَلَيْسَ مِنَّا.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’جو ہمارے چھوٹوں پر شفقت نہ کرے اور ہمارے بڑوں کا حق نہ پہچانے وہ ہم میں سے نہیں۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ الحمیدي بتحقیقي (586 وسندہ حسن) وللحدیث شواھد کثیرۃ`;