var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ قَالَ،أَخْبَرَنَا ح،وحَدَّثَنَا مُسَدَّدٌ،قَالَ:،حَدَّثَنَا هُشَيْمٌ،عَنْ دَاوُدَ بْنِ عَمْرٍو،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي زَكَرِيَّا،عَنْ أَبِي الدَّرْدَاءِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّكُمْ تُدْعَوْنَ يَوْمَ الْقِيَامَةِ بِأَسْمَائِكُمْ،وَأَسْمَاءِ آبَائِكُمْ, فَأَحْسِنُوا أَسْمَاءَكُمْ.\nقَالَ أَبُو دَاوُد: ابْنُ أَبِى زَكَرِيَّا لَمْ يُدْرِكْ أَبَا الدَّرْدَاءِ.";
abudawood.urdu = "سیدنا ابودرداء رضی اللہ عنہ سے روایت ہے کہرسول اللہ ﷺ نے فرمایا ’’تم قیامت کے دن اپنے اور اپنے آباء کے ناموں سے پکارے جاؤ گے۔چنانچہ اپنے نام اچھے اچھے رکھا کرو۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ ابن ابو زکریا نے سیدنا ابودرداء رضی اللہ عنہ کو نہیں پایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبداﷲ بن أبي زکریا : لم یدرک أبا الدرداء،کما قال أبو داود رحمہ اللّٰہ`;
abudawood.anwaar = [172,1];