var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ زِيَادٍ سَبَلَانَ،حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَحَبُّ الْأَسْمَاءِ إِلَى اللَّهِ تَعَالَى: عَبْدُ اللَّهِ،وَعَبْدُ الرَّحْمَنِ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’سب ناموں میں سے عبداللہ اور عبدالرحمٰن اللہ عزوجل کو بہت ہی پیارے ہیں۔“";
abudawood.hukam = "صحیح مسلم (2132)";
abudawood.description = ``;