var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ يَعْنِي الْيَشْكُرِيَّ،حَدَّثَنَا إِسْمَاعِيلُ،عَنْ سَوَّارٍ أَبِي حَمْزَةَ قَالَ أَبو دَاود وَهُوَ سَوَّارُ بْنُ دَاوُدَ أَبُو حَمْزَةَ الْمُزَنِيُّ الصَّيْرَفِيُّ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ مُرُوا أَوْلَادَكُمْ بِالصَّلَاةِ وَهُمْ أَبْنَاءُ سَبْعِ سِنِينَ،وَاضْرِبُوهُمْ عَلَيْهَا وَهُمْ أَبْنَاءُ عَشْرٍ،وَفَرِّقُوا بَيْنَهُمْ فِي الْمَضَاجِعِ.";
abudawood.urdu = "جناب عمرو بن شعیب اپنے والد (شعیب) سے اور وہ (شعیب) اپنے دادا (عبداللہ بن عمرو بن العاص رضی اللہ عنہما) سے بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’اپنے بچوں کو جب وہ سات سال کے ہو جائیں تو نماز کا حکم دو اور جب دس سال کے ہو جائیں (اور نہ پڑھیں) تو انہیں اس پر مارو اور ان کے بسر جدا جدا کر دو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (572)
وأخرجہ أحمد (2/180،182) وسندہ حسن والحدیث السابق شاھد لہ`;