var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ،حَدَّثَنَا أَبُو عَقِيلٍ،حَدَّثَنَا مُجَالِدُ بْنُ سَعِيدٍ عَنِ الشَّعْبِيِّ،عَنْ مَسْرُوقٍ،قَالَ: لَقِيتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ،فَقَالَ: مَنْ أَنْتَ؟ قُلْتُ: مَسْرُوقُ بْنُ الْأَجْدَعِ! فَقَالَ عُمَرُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: الْأَجْدُعُ شَيْطَانٌ.";
abudawood.urdu = "جناب مسروق سے روایت ہے،وہ کہتے ہیں کہ میں سیدنا عمر بن خطاب رضی اللہ عنہ سے ملا،تو انہوں نے پوچھا تم کون ہو؟ میں نے بتایا کہ مسروق بن اجدع۔تو عمر نے کہا کہ میں نے رسول اللہ ﷺ سے سنا ہے،آپ ﷺ فرماتے تھے ’’اجدع،شیطان ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3731)<br>مجالد ضعیف`;
abudawood.anwaar = [173,1];