var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا الْمُعْتَمِرُ،قَالَ: سَمِعْتُ الرُّكَيْنَ يُحَدِّثُ،عَنْ أَبِيهِ،عَنْ سَمُرَةَ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُسَمِّيَ رَقِيقَنَا أَرْبَعَةَ أَسْمَاءٍ: أَفْلَحَ،وَيَسَارًا،وَنَافِعًا،وَرَبَاحًا.";
abudawood.urdu = "سیدنا سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے منع فرمایا کہ ہم اپنے غلاموں کے نام یہ رکھیں۔افلح،یسار،نافع اور رباح (نفع والا)۔";
abudawood.hukam = "صحیح مسلم (2136)";
abudawood.description = ``;