var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ, قَالَ: أَخْبَرَنَا ح،وحَدَّثَنَا مُسَدَّدٌ وَمُحَمَّدُ بْنُ مَحْبُوبٍ قَالُوا،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي عُثْمَانَ, وَسَمَّاهُ ابْنُ مَحْبُوبٍ الْجَعْدَ،عَنْ أَنَسِ بْنِ مَالِكٍ, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: يَا بُنَيَّ!.\nقَالَ أَبُو دَاوُد: سَمِعْتُ يَحْيَى ابْنَ مَعِينٍ يُثْنِي عَلَى مُحَمَّدِ بْنِ مَحْبُوبٍ وَيَقُولُ كَثِيرُ الْحَدِيثِ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے ان کو پکارا،تو فرمایا ’’اے میرے بیٹے!‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں: میں نے یحییٰ بن معین سے سنا،وہ محمد بن محبوب کی مدح کرتے تھے اور بتاتے تھے کہ یہ بہت زیادہ صاحب حدیث تھے۔";
abudawood.hukam = "صحیح مسلم (2151)";
abudawood.description = ``;