var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ الْحَضْرَمِيُّ إِمَامُ مَسْجِدِ حِمْصَ،حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ،عَنْ ضُبَارَةَ بْنِ مَالِكٍ الْحَضْرَمِيِّ،عَنْ أَبِيهِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ،عَنْ أَبِيهِ،عَنْ سُفْيَانَ بْنِ أَسِيدٍ الْحَضْرَمِيِّ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: كَبُرَتْ خِيَانَةً أَنْ تُحَدِّثَ أَخَاكَ حَدِيثًا, هُوَ لَكَ بِهِ مُصَدِّقٌ،وَأَنْتَ لَهُ بِهِ كَاذِبٌ.";
abudawood.urdu = "سیدنا سفیان بن اسید حضرمی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’بہت بڑی خیانت ہے کہ تو اپنے بھائی سے کوئی بات کرے،وہ تمہیں سچا سمجھ رہا ہو،جبکہ تم اس سے جھوٹ بول رہے ہو۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ضبارۃ وأبوہ : مجہولان (تقدم : 430،و أبوہ مالک بن أبي سلیک مجہول کما فی التقریب :6441)`;
abudawood.anwaar = [173,1];