var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ،أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ،أَخْبَرَنِي اللَّيْثُ بْنُ سَعْدٍ،عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا يَقُولَنَّ أَحَدُكُمُ: الْكَرْمَ, فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ،وَلَكِنْ قُولُوا: حَدَائِقَ الْأَعْنَابِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے کوئی شخص (انگور کے لیے) لفظ ’’کرم‘‘ استعمال نہ کرے۔بیشک ’’کرم‘‘ (سخاوت کا منطوق) مسلمان آدمی ہے۔بلکہ یوں کہا کرو «حدائق الأعناب» ’’انگوروں کے باغات۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `ورواہ مسلم (2247)`;