var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ،أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ،أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا يُونُسَ حَدَّثَهُ،عَنْ أَبِي هُرَيْرَةَ... فِي هَذَا الْخَبَرِ-وَلَمْ يَذْكُرِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-،قَالَ: وَلْيَقُلْ: سَيِّدِي وَمَوْلَايَ.";
abudawood.urdu = "ابویونس (سلیمان بن جبیر) نے سیدنا ابوہریرہ رضی اللہ عنہ سے بیان کیا اور اس روایت میں نبی کریم ﷺ کا ذکر نہیں کیا۔(موقوف روایت بیان کی اور «سیدی وسیدتی» کی بجائے کہا) اور چاہیئے کہ «سیدی» اور «مولای» ’’اے میرے سردار!‘‘ کہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;