var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ،حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ،قَالَ: حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَقُولُوا لِلْمُنَافِقِ: سَيِّدٌ, فَإِنَّهُ إِنْ يَكُ سَيِّدًا, فَقَدْ أَسْخَطْتُمْ رَبَّكُمْ عَزَّ وَجَلَّ.";
abudawood.urdu = "جناب عبداللہ بن بریدہ اپنے والد سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’کسی منافق کو ’’سید‘‘ (سردار،آقا) کہہ کر مت پکارو۔اس لیے کہ اگر وہ سردار ہوا تو تم نے اپنے رب عزوجل کو ناراض کر دیا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>قتادۃ عنعن<br>ولحدیثہ شاہد ضعیف عند الحاکم (المستدرک 311/4)`;
abudawood.anwaar = [173,1];