var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ قَالَ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ،عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ،عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَقُولَنَّ أَحَدُكُمْ: خَبُثَتْ نَفْسِي،وَلْيَقُلْ: لَقِسَتْ نَفْسِي.";
abudawood.urdu = "سیدنا ابوامامہ اپنے والد (سہل بن حنیف رضی اللہ عنہ) سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے کوئی شخص ہرگز یوں نہ کہے ’’میرا نفس خبیث ہو گیا ہے۔‘‘ اگر کہنا بھی ہو تو یوں کہے ’’میری طبیعت پریشان ہے۔طبیعت خراب ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6180) صحیح مسلم (2251)";
abudawood.description = ``;