var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا يَقُولَنَّ أَحَدُكُمْ: جَاشَتْ نَفْسِي،وَلَكِنْ لِيَقُلْ: لَقِسَتْ نَفْسِي.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’تم میں سے کوئی شخص ہرگز یوں نہ کہے میرا جی جوش مارتا ہے۔بلکہ یوں کہے: میرا جی پریشان ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رواہ البخاري (6179) ومسلم (2250) `;