var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ،عَنْ حُذَيْفَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُولُوا مَا شَاءَ اللَّهُ وَشَاءَ فُلَانٌ وَلَكِنْ قُولُوا مَا شَاءَ اللَّهُ ثُمَّ شَاءَ فُلَانٌ.";
abudawood.urdu = "سیدنا حذیفہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’یوں مت کہو: جو اﷲ چاہے اور فلاں چاہے ‘ بلکہ یوں کہو: جو اﷲ چاہے پھر فلاں چاہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4778)`;