var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي لَبِيدٍ،عَنْ أَبِي سَلَمَةَ،قَالَ: سَمِعْتُ ابْنَ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا تَغْلِبَنَّكُمُ الْأَعْرَابُ عَلَى اسْمِ صَلَاتِكُمْ،أَلَا وَإِنَّهَا الْعِشَاءُ،وَلَكِنَّهُمْ يَعْتِمُونَ بِالْإِبِلِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما بیان کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’ہرگز ایسا نہ ہو کہ یہ بدوی لوگ تمہاری نماز کے نام پر غالب آ جائیں۔خبردار! بلاشبہ اس کا نام ’’عشاء‘‘ ہے۔لیکن چونکہ وہ لوگ اونٹنیوں کا دودھ دوہنے میں اندھیرا کر دیتے ہیں (تو اسی مناسبت سے اسے عتمہ ‘ یعنی اندھیرے والی نماز کہہ دیتے ہیں)۔‘‘";
abudawood.hukam = "صحیح مسلم (644)";
abudawood.description = ``;