var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،حَدَّثَنَا مِسْعَرُ بْنُ كِدَامٍ،عَنْ عَمْرِو بْنِ مُرَّةَ،عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ،قَالَ: قَالَ رَجُلٌ-: قَالَ مِسْعَرٌ أُرَاهُ مِنْ خُزَاعَةَ-: لَيْتَنِي صَلَّيْتُ فَاسْتَرَحْتُ! فَكَأَنَّهُمْ عَابُوا عَلَيْهِ ذَلِكَ! فَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: يَا بِلَالُ! أَقِمِ الصَّلَاةَ, أَرِحْنَا بِهَا.";
abudawood.urdu = "جناب سالم بن ابو جعد سے روایت ہے کہ ایک آدمی نے کہا: مسعر کا خیال ہے کہ وہ قبیلہ خزاعہ سے تھا۔کاش میں نماز پڑھ لیتا تو سکون پاتا۔تو دوسرے لوگوں نے گویا اس کے اس انداز پر عیب لگایا۔تو اس نے کہا کہ میں نے رسول اللہ ﷺ سے سنا ہے ‘ آپ ﷺ فرماتے تھے ’’بلال! نماز کی اقامت کہو،ہمیں اس سے راحت پہنچاؤ۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1253)
صالح بن أبي الجعد برئ من التدلیس`;