var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ،حَدَّثَنَا أَبِي،حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْسِبُ أَحَدًا إِلَّا إِلَى الدِّينِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہ بیان کرتی ہیں کہ میں نے رسول اللہ ﷺ کو سنا ‘ آپ ﷺ ہر ایک شے میں دین ہی کی نسبت کا خیال فرماتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>زید بن أسلم لم یسمع من عائشۃ رضي اللّٰہ عنھا`;
abudawood.anwaar = [173,1];