var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ،أَخْبَرَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،قَالَ: كَانَ فَزَعٌ بِالْمَدِينَةِ،فَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا لِأَبِي طَلْحَةَ،فَقَالَ: مَا رَأَيْنَا شَيْئًا-أَوْ-مَا رَأَيْنَا مِنْ فَزَعٍ, وَإِنْ وَجَدْنَاهُ لَبَحْرًا!.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ کا بیان ہے کہ مدینے میں کوئی افواہ پھیل گئی (شاید کوئی دشمن حملہ آور ہونے والا ہے) تو نبی کریم ﷺ سیدنا ابوطلحہ رضی اللہ عنہ کے گھوڑے پر سوار ہوئے (اور ادھر ادھر دیکھ بھال کر آئے) اور فرمایا ’’ہم نے کچھ نہیں دیکھا ہے۔‘‘ یا فرمایا ’’ہم نے خوف کی کوئی بات نہیں دیکھی۔اور یہ گھوڑا تو گویا سمندر ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (2627) صحیح مسلم (2307)";
abudawood.description = ``;