var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ،حَدَّثَنَا يَحْيَى،عَنْ بَهْزِ بْنِ حَكِيمٍ،قَالَ: حَدَّثَنِي أَبِي،عَنْ أَبِيهِ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: وَيْلٌ لِلَّذِي يُحَدِّثُ فَيَكْذِبُ, لِيُضْحِكَ بِهِ الْقَوْمَ،وَيْلٌ لَهُ،وَيْلٌ لَهُ!!.";
abudawood.urdu = "جناب بہز بن حکیم رحمہ اللہ کہتے ہیں کہ مجھے میرے والد (حکیم) نے اپنے والد (سیدنا معاویہ بن حیدہ قشیری رضی اللہ عنہ) سے روایت کیا۔کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا , آپ ﷺ فرماتے تھے ’’ہلاکت ہے اس کے لیے جو اس غرض سے جھوٹ بولے کہ اس سے لوگ ہنسیں۔ہلاکت ہے اس کے لیے! ہلاکت ہے اس کے لیے!‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4834)
أخرجہ الترمذي (2315 وسندہ حسن)`;