var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا أَبُو عَامِرٍ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ،عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى،عَنْ أَبِي النُّعْمَانِ،عَنْ أَبِي وَقَّاصٍ،عَنْ زَيْدِ بْنِ أَرْقَمَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا وَعَدَ الرَّجُلُ أَخَاهُ،وَمِنْ نِيَّتِهِ أَنْ يَفِيَ لَهُ،فَلَمْ يَفِ وَلَمْ يَجِئْ لِلْمِيعَادِ, فَلَا إِثْمَ عَلَيْهِ.";
abudawood.urdu = "سیدنا زید بن ارقم رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’بندہ جب اپنے بھائی سے کوئی وعدہ کر لے اور اس کی نیت یہ ہو کہ وہ اپنا وعدہ وفا کرے گا مگر نہ کر سکے اور وعدے پر نہ پہنچ سکا ہو تو اس پر کوئی گناہ نہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف/ ت<br>ترمذی (2633)<br>وقال الترمذي :’’ لیس إسنادہ بالقوي …… وأبو نعمان مجہول و أبو وقاص مجہول ‘‘`;
abudawood.anwaar = [173,1];