var abudawood = {};
abudawood.arabic = "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ،أَخْبَرَنَا خَالِدٌ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ, أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: يَا رَسُولَ اللَّهِ! احْمِلْنِي! قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّا حَامِلُوكَ عَلَى وَلَدِ نَاقَةٍ،قَالَ: وَمَا أَصْنَعُ بِوَلَدِ النَّاقَةِ؟! فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: وَهَلْ تَلِدُ الْإِبِلَ إِلَّا النُّوقُ؟!.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ ایک آدمی نبی کریم ﷺ کے پاس آیا اور کہنے لگا: اے اﷲ کے رسول! مجھے کوئی سواری عنایت فرمائیں۔تو نبی کریم ﷺ نے فرمایا ’’ہم تجھے اونٹنی کا بچہ دے دیتے ہیں۔‘‘ وہ بولا: میں اونٹنی کے بچے کا کیا کروں گا؟ تو نبی کریم ﷺ نے فرمایا ’’اونٹ کو بھی تو اونٹنی ہی جہنم دیتی ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4886)
حمید عنعن لکنہ کان یدلس عن ثابت البناني عن أنس رضي اللہ عنہ وثابت البناني ثقۃ`;