var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ الْبَاهِلِيُّ وَكَانَ يَنْزِلُ الْعَوَقَةَ،حَدَّثَنَا نَافِعُ بْنُ عُمَرَ،عَنْ بِشْرِ بْنِ عَاصِمٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ قَالَ أَبُو دَاوُد: هُوَ ابْنُ عَمْرٍو،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللَّهَ عَزَّ وَجَلَّ يُبْغِضُ الْبَلِيغَ مِنَ الرِّجَالِ،الَّذِي يَتَخَلَّلُ بِلِسَانِهِ تَخَلُّلَ الْبَاقِرَةِ بِلِسَانِهَا.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’تحقیق اللہ عزوجل ایسے آدمی سے غصے ہوتا ہے جو (ناحق) زبان آور ہو (بہت باتیں بنائے) اپنی زبان کو ایسے چلائے جیسے گائے چلاتی ہے (اور لپیٹ لپیٹ کر گھاس کھاتی ہے)۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4800)
أخرجہ الترمذي (2853 وسندہ حسن)`;