var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ عَبْدِ اللَّهِ بْنِ الْمُسَيَّبِ عَنِ الضَّحَّاكِ بْنِ شُرَحْبِيلَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ تَعَلَّمَ صَرْفَ الْكَلَامِ لِيَسْبِيَ بِهِ قُلُوبَ الرِّجَالِ أَوِ النَّاسِ, لَمْ يَقْبَلِ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلَا عَدْلًا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے گفتگو کا ہیر پھیر (باتیں بنانے کا ڈھنگ) اس لیے سیکھا کہ وہ اس کے ذریعے سے لوگوں کے دل موہ لے،تو اللہ عزوجل قیامت کے روز اس کا کوئی نفل اور فرض قبول نہیں کرے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>في سماع الضحاک بن شرحبیل من الصحابۃ نظر کما أشار المنذري رحمہ اﷲ (انظر عون المعبود 459/4)`;
abudawood.anwaar = [174,1];