var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ, أَنَّهُ قَالَ: قَدِمَ رَجُلَانِ مِنَ الْمَشْرِقِ فَخَطَبَا،فَعَجِبَ النَّاسُ-يَعْنِي: لِبَيَانِهِمَا-،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ مِنَ الْبَيَانِ لَسِحْرًا-أَوْ إِنَّ بَعْضَ الْبَيَانِ لَسِحْرٌ.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ مشرق کی جانب سے دو آدمی آئے اور انہوں نے خطاب کیا تو لوگوں کو ان کے اسلوب خطاب و بیان پر بڑا تعجب ہوا تو رسول اللہ ﷺ نے فرمایا ’’بلاشبہ بعض بیان جادو ہوتے ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (5767)";
abudawood.description = `مشکوۃ المصابیح (4887)
و للحدیث شاھد حسن عند الطبراني فی الکبیر (1/ 240 ح 662)`;