var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ أَبِي خَلَفٍ وَأَحْمَدُ بْنُ عَبْدَةَ الْمَعْنَى،قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ, عَنِ الزُّهْرِيِّ،عَنْ سَعِيدٍ،قَالَ: مَرَّ عُمَرُ بِحَسَّانَ-وَهُوَ يُنْشِدُ فِي الْمَسْجِدِ-فَلَحَظَ إِلَيْهِ،فَقَالَ: قَدْ كُنْتُ أُنْشِدُ وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ.";
abudawood.urdu = "جناب سعید بن مسیب رحمہ اللہ نے بیان کیا کہ سیدنا عمر بن خطاب رضی اللہ عنہ،سیدنا حسان رضی اللہ عنہ کے پاس سے گزرے،جبکہ وہ مسجد (مسجد نبوی) میں شعر پڑھ رہے تھے،تو سیدنا عمر رضی اللہ عنہ نے انہیں تیز نظروں سے دیکھا تو انہوں نے جواب دیا۔بلاشبہ میں اس (مسجد) میں شعر پڑھا کرتا تھا اور اس میں وہ عظیم ہستی موجود ہوتی تھی جو آپ سے کہیں زیادہ افضل تھی۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث الآتي (5014)`;