var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ.. بِمَعْنَاهُ،زَادَ: فَخَشِيَ أَنْ يَرْمِيَهُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَأَجَازَهُ.";
abudawood.urdu = "جناب سعید بن مسیب رحمہ اللہ نے سیدنا ابوہریرہ رضی اللہ عنہ سے مذکورہ بالا حدیث کے ہم معنی روایت کیا،اس میں مزید ہے کہ پھر سیدنا عمر رضی اللہ عنہ کو خیال ہوا کہ یہ تو رسول اللہ ﷺ کی اجازت پیش کر دیں گے۔چنانچہ انہوں نے ان کو اجازت دے دی (کہ وہ مسجد میں شعر پڑھ سکتے ہیں)۔";
abudawood.hukam = "صحیح بخاری (3212) صحیح مسلم (2485)";
abudawood.description = ``;