var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،عَنْ عُبَادَةَ بْنِ الصَّامِتِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ.";
abudawood.urdu = "سیدنا عبادہ بن صامت رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ نے فرمایا ’’مومن کا خواب نبوت کا چھیالیسواں حصہ ہے۔“";
abudawood.hukam = "صحیح بخاری (6987) صحیح مسلم (2264)";
abudawood.description = ``;