var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الْهَمْدَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ قَالَا،أَخْبَرَنَا اللَّيْثُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا فَلْيَبْصُقْ عَنْ يَسَارِهِ،وَلْيَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ-ثَلَاثًا-وَيَتَحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی ایسا خواب دیکھے جو اسے برا لگے تو اسے چاہیئے کہ اپنی بائیں جانب تھوک دے۔اور تین بار،شیطان کے شر سے اللہ کی پناہ طلب کرے،اور اپنی کروٹ بدل لے۔‘‘";
abudawood.hukam = "صحیح مسلم (2262)";
abudawood.description = ``;