var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ،أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ،أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ-أَوْ لَكَأَنَّمَا رَآنِي فِي الْيَقَظَةِ-،وَلَا يَتَمَثَّلُ الشَّيْطَانُ بِي.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’جس نے مجھے خواب میں دیکھا وہ عنقریب مجھے جاگتے میں بھی دیکھے گا،یا فرمایا کہ اس نے گویا مجھے جاگتے میں دیکھا۔اور شیطان میری صورت اختیار نہیں کر سکتا۔“";
abudawood.hukam = "صحیح بخاری (6993) صحیح مسلم (2266)";
abudawood.description = ``;