var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زُهَيْرٌ،عَنْ سُهَيْلٍ عَنِ ابْنِ أَبِى سَعِيدٍ الْخُدْرِيِّ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيُمْسِكْ عَلَى فِيهِ, فَإِنَّ الشَّيْطَانَ يَدْخُلُ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کسی کو جمائی آئے تو چاہیئے کہ وہ اپنا منہ بند رکھے ‘ بلاشبہ (اس میں) شیطان داخل ہو جاتا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2995)";
abudawood.description = ``;