var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ عَجْلَانَ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَطَسَ وَضَعَ يَدَهُ-أَوْ ثَوْبَهُ-عَلَى فِيهِ،وَخَفَضَ-أَوْ غَضَّ-بِهَا صَوْتَهُ-شَكَّ يَحْيَى-.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کو جب چھینک آتی تو آپ ﷺ اپنے منہ پر اپنا ہاتھ یا کوئی کپڑا رکھ لیتے اور اپنی آواز کو کم رکھتے۔یحییٰ کو شک ہے کہ روایت میں لفظ «خفض» تھا یا «غض» (معنی ایک ہی ہیں)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4738)
أخرجہ الترمذي (2745 وسندہ حسن) محمد بن عجلان صرح بالسماع عند أحمد (2/439)`;