var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ وَخُشَيْشُ بْنُ أَصْرَمَ،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنِ ابْنِ الْمُسَيِّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ تَجِبُ لِلْمُسْلِمِ عَلَى أَخِيهِ: رَدُّ السَّلَامِ،وَتَشْمِيتُ الْعَاطِسِ،وَإِجَابَةُ الدَّعْوَةِ،وَعِيَادَةُ الْمَرِيضِ،وَاتِّبَاعُ الْجَنَازَةِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’ایک مسلمان پر دوسرے مسلمان بھائی کے لیے پانچ باتیں واجب ہیں۔سلام کا جواب دینا ‘ چھینک آنے پر دعا دینا ‘ دعوت قبول کرنا ‘ بیمار پرسی کرنا اور جنازے میں شریک ہونا۔‘‘";
abudawood.hukam = "صحیح مسلم (2162)";
abudawood.description = ``;