var abudawood = {};
abudawood.arabic = "حَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ،حَدَّثَنَا إِسْحَاقُ يَعْنِي ابْنَ يُوسُفَ،عَنْ أَبِي بِشْرٍ وَرْقَاءَ،عَنْ مَنْصُورٍ،عَنْ هِلَالِ بْنِ يَسَافٍ،عَنْ خَالِدِ بْنِ عَرْفَجَةَ،عَنْ سَالِمِ بْنِ عُبَيْدٍ الْأَشْجَعِيِّ بِهَذَا الْحَدِيثِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
abudawood.urdu = "خالد بن عرفطہ نے سیدنا سالم بن عبید اشجعی رضی اللہ عنہ سے اور انہوں نے نبی کریم ﷺ سے یہ (مذکورہ بالا) روایت بیان کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>خالد مجہول الحال،لم أجد من وثقہ وقال فی التقریب (1655) : ’’مقبول‘‘ أي مجہول الحال`;
abudawood.anwaar = [174,1];