var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ،حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ،عَنْ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ يَحْيَى بْنِ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،عَنْ أُمِّهِ حُمَيْدَةَ أَوْ عُبَيْدَةَ بِنْتِ عُبَيْدِ بْنِ رِفَاعَةَ الزُّرَقِيِّ،عَنْ أَبِيهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: تُشَمِّتُ الْعَاطِسَ ثَلَاثًا،فَإِنْ شِئْتَ أَنْ تُشَمِّتَهُ فَشَمِّتْهُ،وَإِنْ شِئْتَ فَكُفَّ.";
abudawood.urdu = "حمیدہ یا عبیدہ بنت عبید بن رفاعہ زرقی اپنے والد سے بیان کرتی ہیں کہ انہوں نے نبی کریم ﷺ سے روایت کیا،آپ ﷺ نے فرمایا ’’چھینک مارنے والے کو تین بار جواب دو۔پھر اگر جواب دینا چاہو،تو دو اور اگر چاہو تو،چھوڑ دو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2744)<br>عبیدۃ لا یعرف حالھا (تقریب التہذیب: 8638) وأبو خالد الدالاني یزید بن عبد الرحمٰن مدلس`;
abudawood.anwaar = [174,2];