var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ،عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ،عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ،عَنْ أَبِيهِ أَنَّ رَجُلًا عَطَسَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ لَهُ: يَرْحَمُكَ اللَّهُ،ثُمَّ عَطَسَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الرَّجُلُ مَزْكُومٌ.";
abudawood.urdu = "جناب ایاس بن سلمہ بن اکوع سے روایت ہے وہ اپنے والد سے نقل کرتے ہیں کہ ایک شخص نے نبی کریم ﷺ کی مجلس میں چھینک ماری،تو آپ ﷺ نے اسے دعا دی اور فرمایا «یرحمک اللہ» ’’اﷲ تجھ پر رحم فرمائے۔‘‘ اس نے پھر چھینک ماری تو آپ ﷺ نے فرمایا ’’اسے زکام ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2993)";
abudawood.description = ``;