var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا سُفْيَانُ،عَنْ حَكِيمِ بْنِ الدَّيْلَمِ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِيهِ قَالَ: كَانَتِ الْيَهُودُ تَعَاطَسُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, رَجَاءَ أَنْ يَقُولَ لَهَا: يَرْحَمُكُمُ اللَّهُ! فَكَانَ يَقُولُ: يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ.";
abudawood.urdu = "سیدنا ابوبردہ اپنے والد سے روایت کرتے ہیں کہ یہودی لوگ نبی کریم ﷺ کی مجلس میں عمداً چھینکیں مارا کرتے تھے اور توقع کرتے تھے کہ آپ ﷺ انہیں دعا دیتے ہوئے «یرحمکم اللہ» ’’اﷲ تم پر رحم فرمائے‘‘ کہیں گے۔مگر آپ ﷺ انہیں یوں جواب دیتے «یہدیکم اللہ ویصلح بالکم» ’’اﷲ تمہیں ہدایت دے اور تمہارے احوال کی اصلاح فرمائے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4740)
أخرجہ الترمذي (2739 وسندہ صحیح) سفیان الثوري صرح بالسماع عند الحاکم (4/268)`;