var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا سَالِمٌ يَعْنِي ابْنَ نُوحٍ،عَنْ عُمَرَ بْنِ جَابِرٍ الْحَنَفِيِّ،عَنْ وَعْلَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ وَثَّابٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَلِيٍّ يَعْنِي ابْنَ شَيْبَانَ،عَنْ أَبِيهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ بَاتَ عَلَى ظَهْرِ بَيْتٍ لَيْسَ لَهُ حِجَارٌ, فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ.";
abudawood.urdu = "جناب عبدالرحمٰن اپنے والد علی بن شیبان رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص کسی ایسی چھت پر سوئے جس کے گرد کوئی منڈیر (پردہ وغیرہ) نہ ہو تو اس سے ذمہ اٹھ گیا۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4720)
ولہ شاھد عند أحمد (5/79، 271 وسندہ حسن، زھیر بن عبد اللہ حسن الحدیث)`;