var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،عَنْ كُرَيْبٍ عَنِ ابْنِ عَبَّاسٍ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ مِنَ اللَّيْلِ فَقَضَى حَاجَتَهُ،فَغَسَلَ وَجْهَهُ،وَيَدَيْهِ ثُمَّ نَامَ.\nقَالَ أَبُو دَاوُد: يَعْنِي: بَالَ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ رات کو اٹھے قضائے حاجت کے لیے گئے۔پھر اپنا چہرہ اور ہاتھ دھوئے پھر سو گئے۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ «قضی حاجتہ» سے مراد ہے پیشاب کیا۔";
abudawood.hukam = "صحیح بخاری (6316) صحیح مسلم (763)";
abudawood.description = ``;