var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادٌ،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ أَبِي قِلَابَةَ،عَنْ بَعْضِ آلِ أُمِّ سَلَمَةَ, كَانَ فِرَاشُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوًا مِمَّا يُوضَعُ الْإِنْسَانُ فِي قَبْرِهِ،وَكَانَ الْمَسْجِدُ عِنْدَ رَأْسِهِ.";
abudawood.urdu = "جناب ابوقلابہ نے سیدہ ام سلمہ رضی اللہ عنہا کے خاندان میں سے کسی فرد سے روایت کیا کہ نبی کریم ﷺ کا بستر ایسے بچھایا جاتا تھا جیسے انسان قبر میں رکھا جاتا ہے اور مسجد آپ ﷺ کے سر کی طرف ہوتی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>بعض آل أم سلمۃ : مجہول (انظر عون المعبود 471/4)`;
abudawood.anwaar = [175,1];