var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ فِطْرِ بْنِ خَلِيفَةَ،قَالَ: سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ،قَالَ: سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ،قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا أَوَيْتَ إِلَى فِرَاشِكَ وَأَنْتَ طَاهِرٌ،فَتَوَسَّدْ يَمِينَكَ...،ثُمَّ ذَكَرَ نَحْوَهُ.";
abudawood.urdu = "سیدنا براء بن عازب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مجھ فرمایا ’’جب تم اپنے بستر پر آنے لگو اور باوضو ہو تو اپنی داہنی جانب پر لیٹو۔‘‘ پھر مذکورہ بالا حدیث کی مانند ذکر کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (5046)`;