var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا أَبُو إِسْحَاقَ،عَنْ فَرْوَةَ بْنِ نَوْفَلٍ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ لِنَوْفَلٍ: اقْرَأْ: قُلْ يَا أَيُّهَا الْكَافِرُونَ[أول سورة الكافرون]،ثُمَّ نَمْ عَلَى خَاتِمَتِهَا, فَإِنَّهَا بَرَاءَةٌ مِنَ الشِّرْكِ.";
abudawood.urdu = "سیدنا فروہ بن نوفل اپنے والد سے روایت کرتے ہیں کہ نبی کریم ﷺ نے نوفل رضی اللہ عنہ سے فرمایا تھا ’’«قل یا أیہا الکافرون» پڑھو اور اسی پر اپنی بات چیت ختم کر کے سو جاؤ۔بیشک اس میں شرک سے براءت کا اظہار ہے۔“";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2161)
ولہ شاھد عند ابن أبي شیبۃ (10/250 ح29297 وسندہ حسن) والتاریخ الکبیر للبخاري (5/357) عبد الرحمن بن نوفل وثقہ العجلي وابن حبان ومروان بن معاویۃ الفزاري صرح بالسماع`;