var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ،حَدَّثَنَا بَقِيَّةُ،عَنْ بَحِيرٍ،عَنْ خَالِدِ بْنِ مَعْدَانَ عَنِ ابْنِ أَبِي بِلَالٍ،عَنْ عِرْبَاضِ بْنِ سَارِيَةَ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ الْمُسَبِّحَاتِ قَبْلَ أَنْ يَرْقُدَ وَقَالَ إِنَّ فِيهِنَّ آيَةً أَفْضَلُ مِنْ أَلْفِ آيَةٍ.";
abudawood.urdu = "سیدنا عرباض بن ساریہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ سونے سے پہلے «المسبحات» کی تلاوت فرمایا کرتے تھے اور آپ ﷺ نے فرمایا ’’ان میں ایک آیت ہے جو ہزار آیت سے افضل ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (2151)
أخرجہ الترمذي (2921) روایۃ بقیۃ عن بھیر صحیح سواء صرح بالسماع أم لا، وابن أبي بلال حسن الحدیث`;