var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَعَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ،قَالَا: حَدَّثَنَا حَمَّادٌ،عَنْ سِمَاكِ بْنِ عَطِيَّةَ ح،وحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ جَمِيعًا،عَنْ أَيُّوبَ،عَنْ أَبِي قِلَابَةَ،عَنْ أَنَسٍ،قَال:َ أُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَ. زَادَ حَمَّادٌ فِي حَدِيثِهِ إِلَّا الْإِقَامَةَ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ سیدنا بلال رضی اللہ عنہ کو حکم دیا گیا کہ اذان کے کلمات دو دو بار اور اقامت کے ایک ایک بار کہے۔حماد نے اپنی حدیث میں اضافہ کیا کہ مگر اقامت۔(یعنی «قد قامت الصلاۃ» دو بار کہے)۔";
abudawood.hukam = "صحیح بخاری (605) صحیح مسلم (378)";
abudawood.description = ``;