var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ الْأَنْطَاكِيُّ،حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ،قَالَ: حَدَّثَنِي أَبُو مَوْدُودٍ،عَنْ مُحَمَّدِ بْنِ كَعْبٍ،عَنْ أَبَانَ بْنِ عُثْمَانَ،عَنْ عُثْمَانَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ لَمْ يَذْكُرْ قِصَّةَ الْفَالِجِ.";
abudawood.urdu = "محمد بن کعب نے ابان بن عثمان سے،انہوں نے سیدنا عثمان رضی اللہ عنہ سے انہوں نے نبی کریم ﷺ سے مذکورہ بالا حدیث کی مانند روایت کیا مگر فالج والا قصہ ذکر نہیں کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `انظر الحدیث السابق (5088)`;