var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،حَدَّثَنَا إِسْمَاعِيلُ،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ أَبِي قِلَابَةَ،عَنْ أَنَسٍ مِثْلَ حَدِيثِ وُهَيْبٍ قَالَ إِسْمَاعِيلُ فَحَدَّثْتُ بِهِ أَيُّوبَ فَقَالَ إِلَّا الْإِقَامَةَ.";
abudawood.urdu = "جناب خالد حذا نے ابوقلابہ سے،انہوں نے سیدنا انس رضی اللہ عنہ سے (مذکورہ بالا) روایت وہیب کی مثل بیان کی۔اسماعیل (راوی) نے کہا کہ میں نے یہ حدیث ایوب کو بیان کی تو کہا‘‘ مگر اقامت‘‘ (یعنی « <حدیث> قد قامت الصلاۃ» </حدیث> )۔";
abudawood.hukam = "صحیح بخاری (607) صحیح مسلم (378)";
abudawood.description = ``;