var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ،حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ،حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ،عَنْ سُهَيْلٍ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَالَ حِينَ يُصْبِحُ: سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ-مِائَةَ مَرَّةٍ-وَإِذَا أَمْسَى كَذَلِكَ, لَمْ يُوَافِ أَحَدٌ مِنَ الْخَلَائِقِ بِمِثْلِ مَا وَافَى.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص صبح کے وقت سو بار «سبحان اللہ العظیم وبحمدہ» کہہ لے اور اسی طرح شام کو بھی ‘ تو مخلوقات میں کوئی ایسا نہ ہو گا جس نے اس قدر ثواب پایا ہو گا۔‘‘";
abudawood.hukam = "صحیح مسلم (2692)";
abudawood.description = ``;