var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ زَيْدَ بْنَ حُبَابٍ أَخْبَرَهُمْ،عَنْ أَبِي هِلَالٍ،عَنْ قَتَادَةَ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَأَى الْهِلَالَ صَرَفَ وَجْهَهُ عَنْهُ.\nقَالَ أَبُو دَاوُد: لَيْسَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْبَابِ حَدِيثٌ مُسْنَدٌ صَحِيحٌ.";
abudawood.urdu = "سیدنا قتادہ رحمہ اللہ سے روایت ہے کہ رسول اللہ ﷺ جب چاند دیکھتے تو اپنا چہرہ اس سے پھیر لیتے (اس کے بعد دعا پڑھتے)۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ اس مسئلے میں کوئی مرفوع صحیح حدیث ثابت نہیں ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل`;
abudawood.anwaar = [176,1];