var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ وَسَلَمَةُ يَعْنِي ابْنَ شَبِيبٍ،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،قَالَ: حَدَّثَنِي ثَابِتُ بْنُ قَيْسٍ أَنَّ أَبَا هُرَيْرَةَ،قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: الرِّيحُ مِنْ رَوْحِ اللَّهِ قَالَ سَلَمَةُ: ...فَرَوْحُ اللَّهِ تَأْتِي بِالرَّحْمَةِ،وَتَأْتِي بِالْعَذَابِ،فَإِذَا رَأَيْتُمُوهَا, فَلَا تَسُبُّوهَا وَسَلُوا اللَّهَ خَيْرَهَا،وَاسْتَعِيذُوا بِاللَّهِ مِنْ شَرِّهَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا،آپ ﷺ فرماتے تھے ’’ہوا اﷲ کی رحمت میں سے ہے۔‘‘ سلمہ (سلمہ بن شبیب) نے کہا: ’’اﷲ کی یہ روح کبھی رحمت لاتی ہے اور کبھی عذاب بھی لے آتی ہے۔جب تم اسے دیکھو تو اسے برا مت کہو۔بلکہ اﷲ سے اس کی خیر کا سوال کرو اور اس کے شر سے اﷲ کی پناہ مانگو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1516)
أخرجہ ابن ماجہ (3727 وسندہ صحیح)`;