var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ،حَدَّثَنَا سُفْيَانُ عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا, أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَأَى نَاشِئًا فِي أُفُقِ السَّمَاءِ, تَرَكَ الْعَمَلَ،وَإِنْ كَانَ فِي صَلَاةٍ،ثُمَّ يَقُولُ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّهَا،فَإِنْ مُطِرَ, قَالَ: اللَّهُمَّ صَيِّبًا هَنِيئًا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ جب آسمان کے کنارے پر کوئی بادل کا ٹکڑا دیکھتے تو کام کاج چھوڑ دیتے اگرچہ نماز ہی میں ہوتے اور پھر یہ دعا کرتے: «اللہم إنی أعوذ بک من شرہا» ’’اے اﷲ! میں اس کے شر سے تیری پناہ چاہتا ہوں۔‘‘ اور اگر بارش ہونے لگتی تو کہتے: <حدیث> «اللہم صیبا ہنیئا» </حدیث> ’’اے اﷲ! اسے خوب برسنے والی نفع آور اور مبارک بنا۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1520)
أخرجہ النسائي (1524 وسندہ صحیح) وابن ماجہ (3889 وسندہ صحیح)`;