var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ مِسْعَرٍ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ قَالَ قُلْتُ لِعَائِشَةَ بِأَيِّ شَيْءٍ كَانَ يَبْدَأُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ بَيْتَهُ قَالَتْ بِالسِّوَاكِ";
abudawood.urdu = "مقدام اپنے والد شریح سے روایت کرتے ہیں،انہوں نے کہا کہ میں نے سیدہ عائشہ رضی اللہ عنہا سے پوچھا کہ رسول اللہ ﷺ جب گھر میں تشریف لایا کرتے تو آپ ﷺ کا پہلا کام کیا ہوتا تھا؟ فرمایا: ’’مسواک۔‘‘";
abudawood.hukam = "صحیح مسلم (253)";
abudawood.description = ``;