var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ صَالِحِ بْنِ كَيْسَانَ،عَنْ عُبَيْدِ اللَّهِ بنِْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ،عَنْ زَيْدِ بْنِ خَالِدٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَسُبُّوا الدِّيكَ, فَإِنَّهُ يُوقِظُ لِلصَّلَاةِ.";
abudawood.urdu = "سیدنا زید بن خالد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’مرغ کو گالی مت دیا کرو،اس لیے کہ یہ نماز کے لیے جگاتا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4136)`;