var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ،عَنْ عَبْدَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا سَمِعْتُمْ نُبَاحَ الْكِلَابِ،وَنَهِيقَ الْحُمُرِ بِاللَّيْلِ،فَتَعَوَّذُوا بِاللَّهِ, فَإِنَّهُنَّ يَرَيْنَ مَا لَا تَرَوْنَ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم رات کو کتوں کا بھونکنا اور گدھوں کی آوازیں سنو،تو اللہ کی پناہ طلب کرو،بلاشبہ یہ وہ کچھ دیکھتے ہیں جو تم نہیں دیکھتے ہو۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4302)
ابن إسحاق صرح بالسماع عند أبي یعلی (4/ 211 ح 2327)`;