var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ سُفْيَانَ،قَالَ: حَدَّثَنِي عَاصِمُ بْنُ عُبَيْدِ اللَّهِ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ،عَنْ أَبِيهِ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذَّنَ فِي أُذُنِ الْحَسَنِ بْنِ عَلِيٍّ،حِينَ وَلَدَتْهُ فَاطِمَةُ بِالصَّلَاةِ.";
abudawood.urdu = "جناب عبیداللہ بن ابورافع نے اپنے والد سے روایت کیا،وہ کہتے ہیں کہ جب سیدہ فاطمہ رضی اللہ عنہا نے سیدنا حسن بن علی رضی اللہ عنہما کو جنم دیا تو میں نے دیکھا کہ رسول اللہ ﷺ نے ان کے کان میں نماز والی اذان کہی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (1514)<br>عاصم بن عبیداللّٰہ : ضعیف<br>وللحدیث شاہدان عند البیہقي في شعب الإیمان (8619 عن الحسین بن علي) و (8620 عن ابن عباس) فی الأول یحیی بن العلاء وھو کذاب<br>وفی الثاني محمد بن یونس الکدیمي : کذاب وشیخہ وشیخ شیخہ ضعیفان<br>وأما الأذان في أذن المولود فصحیح بالإتفاق`;
abudawood.anwaar = [177,1];