var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ ح،وحَدَّثَنَا يُوسُفُ بْنُ مُوسَى،حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِالصِّبْيَانِ فَيَدْعُو لَهُمْ بِالْبَرَكَةِ. زَادَ يُوسُفُ وَيُحَنِّكُهُمْ. وَلَمْ يَذْكُرْ بِالْبَرَكَةِ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ کے پاس چھوٹے بچوں کو لایا جاتا تھا تو آپ ﷺ ان کے لیے برکت کی دعا فرمایا کرتے تھے۔یوسف بن موسیٰ نے مزید کہا کہ،آپ ﷺ انہیں گھٹی بھی دیا کرتے تھے،اور برکت کا ذکر نہیں کیا۔";
abudawood.hukam = "إسنادہ صحیح، صحیح بخاری (6355) صحیح مسلم (286)";
abudawood.description = ``;