var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ،حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ عَنِ ابْنِ جُرَيْجٍ،عَنْ أَبِيهِ،عَنْ أُمِّ حُمَيْدٍ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،قَالَتْ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: هَلْ رُئِيَ-أَوْ كَلِمَةً غَيْرَهَا-فِيكُمُ الْمُغَرِّبُونَ؟،قُلْتُ: وَمَا الْمُغَرِّبُونَ؟ قَالَ: الَّذِينَ يَشْتَرِكُ فِيهِمُ الْجِنُّ.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے مجھ سے فرمایا ’’کیا تم میں کوئی «مغرب» بھی پائے گئے ہیں؟‘‘ میں نے عرض کیا «مغرب» سے کیا مراد ہے؟ آپ ﷺ نے فرمایا ’’وہ بچے جن میں جن شریک ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن جریج عنعن وأبوہ : لین وأم حمید لا یعرف حالھا (تق: 4087،8726)`;
abudawood.anwaar = [177,1];