var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ الْجُشَمِيُّ،قَالَا: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،حَدَّثَنَا سَعِيدٌ قَالَ نَصْرٌ ابْنُ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ أَبِي نَهِيكٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنِ اسْتَعَاذَ بِاللَّهِ, فَأَعِيذُوهُ،وَمَنْ سَأَلَكُمْ بِوَجْهِ اللَّهِ, فَأَعْطُوهُ. قَالَ عُبَيْدُ اللَّهِ: مَنْ سَأَلَكُمْ بِاللَّهِ....";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو تم سے اللہ کے نام پر پناہ طلب کرے اس پناہ دو۔اور جو تم سے اللہ کے چہرے کے واسطے سے سوال کرے اس کو دو۔‘‘ عبیداللہ کے الفاظ ہیں: «من سألکم باللہ»۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن`;
abudawood.anwaar = [177,1];