var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ،حَدَّثَنَا أَبُو عَامِرٍ يَعْنِى الْعَقَدِيَّ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو،حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي جَعْفَرٍ مُؤَذِّنِ مَسْجِدِ الْعُرْيَانِ،قَالَ: سَمِعْتُ أَبَا الْمُثَنَّى مُؤَذِّنَ مَسْجِدِ الْأَكْبَرِ يَقُولُ سَمِعْتُ ابْنَ عُمَرَ وَسَاقَ الْحَدِيثَ.";
abudawood.urdu = "جناب شیبہ،ابو جعفر مسجد عریان کے مؤذن سے اور وہ ابو مثنیٰ مسجد اکبر کے مؤذن سے روایت کرتے ہوئے کہتے ہیں کہ میں نے سیدنا ابن عمر رضی اللہ عنہما سے سنا اور حدیث بیان کی۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق`;