var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،عَنْ أَبِيهِ قَالَ: مَنْ نَصَرَ قَوْمَهُ عَلَى غَيْرِ الْحَقِّ, فَهُوَ كَالْبَعِيرِ الَّذِي رُدِّيَ, فَهُوَ يُنْزَعُ بِذَنَبِهِ.";
abudawood.urdu = "جناب عبدالرحمٰن اپنے والد سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت کرتے ہیں کہ جس نے حق کے بغیر اپنی قوم کی مدد کی تو وہ ایسے اونٹ کی مانند ہے جو کنویں میں گر گیا ہو اور پھر اسے دم سے پکڑ کر باہر نکالا جاتا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;