var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ بَشَّارٍ،حَدَّثَنَا أَبُو عَامِرٍ،حَدَّثَنَا سُفْيَانُ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِيهِ قَالَ: انْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي قُبَّةٍ مِنْ أَدَمٍ... فَذَكَرَ نَحْوَهُ.";
abudawood.urdu = "جناب عبدالرحمٰن اپنے والد سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت کرتے ہیں انہوں نے کہا کہ میں نبی کریم ﷺ کی خدمت میں حاضر ہوا جب کہ آپ ﷺ چمڑے کے ایک خیمے میں ٹھہرے ہوئے تھے اور مذکورہ بالا حدیث کی مانند روایت کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (4904، 5930)
انظر الحدیث السابق (520)`;