var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ،حَدَّثَنَا الْفِرْيَابِيُّ،حَدَّثَنَا سَلَمَةُ بْنُ بِشْرٍ الدِّمَشْقِيُّ،عَنْ بِنْتِ وَاثِلَةَ بْنِ الْأَسْقَعِ, أَنَّهَا سَمِعَتْ أَبَاهَا يَقُولُ: قُلْتُ: يَا رَسُولَ اللَّهِ! مَا الْعَصَبِيَّةُ؟ قَالَ: أَنْ تُعِينَ قَوْمَكَ عَلَى الظُّلْمِ.";
abudawood.urdu = "جناب واثلہ بن اسقع رضی اللہ عنہ بیان کرتے ہیں کہ میں نے عرض کیا: اے اللہ کے رسول! عصبیت کیا ہے؟ آپ ﷺ نے فرمایا ’’یہ کہ تو اپنی قوم کے لوگوں کی مدد کرے،حالانکہ وہ ظلم پر ہوں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف جدًا<br>سلمۃ بن بشیر الدمشقي مقبول (تق: 2485) أي مجہول الحال،لم یوثقہ غیر ابن حبان<br>وبینہ وبین واثلۃ : عباد ابن کثیر : وھو متروک (تق: 3139)<br>ومن طریقہ أخرجہ ابن ماجہ (3949)`;
abudawood.anwaar = [177,1];