var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ،حَدَّثَنَا أَيُّوبُ بْنُ سُوَيْدٍ،عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيِّبِ يُحَدِّثُ،عَنْ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ الْمُدْلِجِيِّ،قَالَ: خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَقَالَ: خَيْرُكُمُ الْمُدَافِعُ عَنْ عَشِيرَتِهِ, مَا لَمْ يَأْثَمْ.قَالَ أَبُو دَاوُد: أَيُّوبُ بْنُ سُوَيْدٍ ضَعِيفٌ.";
abudawood.urdu = "سیدنا سراقہ بن مالک بن جعشم مدلجی رضی اللہ عنہ سے روایت ہے،وہ کہتے ہیں کہ رسول اللہ ﷺ نے ہمیں خطبہ دیا اور فرمایا ’’تم میں بہتر وہ شخص ہے جو اپنے قبیلے کا دفاع کرے بشرطیکہ گناہ کی بات نہ ہو۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں کی ایوب بن سوید ضعیف ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف جدًا<br>أیوب بن سوید ضعیف علی الراجح انظر التحریر (615) وقال الھیثمي : ولکن ضعفہ الجمھور (مجمع الزوائد 5/ 130)<br>وسعید لم یسمع من سراقۃ رضي اللّٰہ عنہ (انظر عون المعبود 494/4)`;
abudawood.anwaar = [177,1];