var abudawood = {};
abudawood.arabic = "َدَّثَنَا ابْنُ السَّرْحِ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الْمَكِّيِّ يَعْنِي ابْنَ أَبِي لَبِيبَةَ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سُلَيْمَانَ،عَنْ جُبَيْرِ بْنِ مُطْعِمٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَيْسَ مِنَّا مَنْ دَعَا إِلَى عَصَبِيَّةٍ،وَلَيْسَ مِنَّا مَنْ قَاتَلَ عَلَى عَصَبِيَّةٍ،وَلَيْسَ مِنَّا مَنْ مَاتَ عَلَى عَصَبِيَّةٍ.";
abudawood.urdu = "سیدنا جبیر بن مطعم رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے عصبیت کی دعوت دی،وہ ہم میں سے نہیں۔جس نے عصبیت پر لڑائی کی،وہ ہم میں سے نہیں اور جو عصبیت پر مرا،وہ ہم میں سے نہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>محمد بن عبد الرحمٰن بن أبي لبیبۃ المکي ضعیف`;
abudawood.anwaar = [177,2];