var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ عَوْفٍ،عَنْ زِيَادِ بْنِ مِخْرَاقٍ،عَنْ أَبِي كِنَانَةَ،عَنْ أَبِي مُوسَى،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ.";
abudawood.urdu = "سیدنا ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’قوم کی بہن کا بیٹا (بھانجا) قوم کا فرد ہوتا ہے۔“";
abudawood.hukam = "صحیح";
abudawood.description = `ولہ شواھد عند البخاري (3828) ومسلم (1059) وغیرھما`;