var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى،عَنْ ثَوْرٍ،قَالَ: حَدَّثَنِي حَبِيبُ بْنُ عُبَيْدٍ عَنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ،وَقَدْ كَانَ أَدْرَكَهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا أَحَبَّ الرَّجُلُ أَخَاهُ, فَلْيُخْبِرْهُ أَنَّهُ يُحِبُّهُ.";
abudawood.urdu = "جناب حبیب بن عبید،سیدنا مقدام بن معدیکرب رضی اللہ عنہ سے روایت کرتے ہیں کہ اور جناب حبیب کو سیدنا مقدام سے ملاقات حاصل تھی۔وہ نبی کریم ﷺ سے روایت کرتے ہیں،آپ ﷺ نے فرمایا ’’جب آدمی کو اپنے کسی بھائی سے محبت ہو،تو چاہیئے کہ اسے بتا دے کہ وہ اس سے محبت کرتا ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (5016)
أخرجہ الترمذي (2392 وسندہ حسن)`;