var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا ابْنُ الْمُثَنَّى،حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ،حَدَّثَنَا شَيْبَانُ،عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْمُسْتَشَارُ مُؤْتَمَنٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’مشورہ دینے والا امین ہوتا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `ولہ شاھد عند أبي إسحاق الحربي في اکرام الضیف (99 وسندہ حسن)`;