var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ مِنَ الْأَنْصَارِ،قَالَ: سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُحَمَّدٍ،قَالَ: كَانَ جَدِّي عَبْدُ اللَّهِ بْنُ زَيْدٍ يُحَدِّثُ بِهَذَا الْخَبَرِ،قَالَ: فَأَقَامَ جَدِّي.";
abudawood.urdu = "جناب محمد بن عمرو انصار مدینہ کے مشائخ میں سے ہیں کہتے ہیں کہ میں نے عبداللہ بن محمد کو سنا کہتے تھے کہ میرے دادا عبداللہ بن زید رضی اللہ عنہ یہ حدیث بیان کیا کرتے تھے۔(عبداللہ بن محمد نے) کہا: چنانچہ میرے دادا نے اقامت (تکبیر) کہی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (512)`;
abudawood.anwaar = [32,1];