var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ،حَدَّثَنَا بَقِيَّةُ،عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ،عَنْ خَالِدِ بْنِ مُحَمَّدٍ الثَّقَفِيِّ،عَنْ بِلَالِ بْنِ أَبِي الدَّرْدَاءِ،عَنْ أَبِي الدَّرْدَاءِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: حُبُّكَ الشَّيْءَ يُعْمِي وَيُصِمُّ.";
abudawood.urdu = "سیدنا ابودرداء رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’کسی شے کی محبت تمہیں اندھا اور بہرا بنا دیتی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو بکر بن أبي مریم : ضعیف<br>وروی البیھقي في شعب الإیمان (412) عن أبی الدرداء رضي اللّٰہ عنہ قال : ’’ حبک الشئ یعمي ویصم ‘‘ وسندہ صحیح والحمد للّٰہ`;
abudawood.anwaar = [178,1];