var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ،عَنْ بُرَيْدِ بْنِ أَبِي بُرْدَةَ،عَنْ أَبِيهِ،عَنْ أَبِي مُوسَى،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اشْفَعُوا إِلَيَّ لِتُؤْجَرُوا،وَلْيَقْضِ اللَّهُ عَلَى لِسَانِ نَبِيِّهِ مَا شَاءَ.";
abudawood.urdu = "سیدنا ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’میرے پاس (اپنے ساتھیوں کی) سفارشیں کیا کرو تاکہ ثواب پاؤ اور فیصلہ تو وہی ہو گا جو اﷲ چاہے گا اور اپنے نبی کی زبان سے کرائے گا۔‘‘";
abudawood.hukam = "صحیح بخاری (6027) صحیح مسلم (2627)";
abudawood.description = ``;