var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ ابْنِ سِيرِينَ قَالَ أَحْمَدُ قَالَ مَرَّةً يَعْنِي هُشَيْمًا عَنْ بَعْضِ وَلَدِ الْعَلَاءِ أَنَّ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ كَانَ عَامِلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْبَحْرَيْنِ فَكَانَ إِذَا كَتَبَ إِلَيْهِ بَدَأَ بِنَفْسِهِ";
abudawood.urdu = "سیدنا علاء حضرمی رضی اللہ عنہ کے متعلق آتا ہے کہ وہ نبی کریم ﷺ کی طرف سے بحرین میں گورنر تھے۔چنانچہ وہ جب نبی کریم ﷺ کی طرف خط لکھتے تو اپنے نام سے شروع کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>بعض ولد العلاء مجہول<br>انظر الحدیث الآتي (5135)`;
abudawood.anwaar = [178,1];