var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ حَدَّثَنَا الْمُعَلَّى بْنُ مَنْصُورٍ أَخْبَرَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ الْعَلَاءِ عَنْ الْعَلَاءِ يَعْنِي ابْنَ الْحَضْرَمِيِّ أَنَّهُ كَتَبَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَدَأَ بِاسْمِهِ";
abudawood.urdu = "جناب ابن سیرین نے سیدنا علاء کے بیٹے سے روایت کیا،انہوں نے (اپنے والد) سیدنا علاء بن حضرمی کے متعلق بتایا کہ انہوں نے نبی کریم ﷺ کو خط لکھا،تو اپنے نام سے ابتداء کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن العلاء : مجہول (التحریر : 8484)`;
abudawood.anwaar = [178,1];