var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ قَالَ حَدَّثَنِي سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْزِي وَلَدٌ وَالِدَهُ إِلَّا أَنْ يَجِدَهُ مَمْلُوكًا فَيَشْتَرِيَهُ فَيُعْتِقَهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’کوئی بیٹا اپنے باپ کے احسان کا بدلہ نہیں دے سکتا۔سوائے اس کے کہ اسے (باپ کو) غلام پائے،تو اسے خریدے اور آزاد کر دے۔‘‘";
abudawood.hukam = "صحیح مسلم (1510)";
abudawood.description = ``;