var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَبَرُّ قَالَ أُمَّكَ ثُمَّ أُمَّكَ ثُمَّ أُمَّكَ ثُمَّ أَبَاكَ ثُمَّ الْأَقْرَبَ فَالْأَقْرَبَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَسْأَلُ رَجُلٌ مَوْلَاهُ مِنْ فَضْلٍ هُوَ عِنْدَهُ فَيَمْنَعُهُ إِيَّاهُ إِلَّا دُعِيَ لَهُ يَوْمَ الْقِيَامَةِ فَضْلُهُ الَّذِي مَنَعَهُ شُجَاعًا أَقْرَعَ قَالَ أَبُو دَاوُد الْأَقْرَعُ الَّذِي ذَهَبَ شَعْرُ رَأْسِهِ مِنْ السُّمِّ";
abudawood.urdu = "جناب بہز بن حکیم اپنے والد سے،وہ دادا سے روایت کرتے ہیں،وہ کہتے ہیں کہ وہ نبی کریم ﷺ کے پاس آئے اور کہا: اے اﷲ کے رسول! میں کس کے ساتھ حسن سلوک کروں؟ آپ ﷺ نے فرمایا ’’اپنی ماں،باپ،بہن،بھائی اور آزاد کرنے والے کے ساتھ۔ان کا حق واجب ہے اور ان کے ساتھ رشتہ جوڑنا لازم ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4929)
أخرجہ الترمذي (1897 وسندہ حسن)`;