var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ خَالِدِ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ بِلَالِ بْنِ أَبِي الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حُبُّكَ الشَّيْءَ يُعْمِي وَيُصِمُّ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو (عبداللہ بن عمرو بن العاص) رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’یہ بات بہت بڑا کبیرہ گناہ ہے کہ کوئی اپنے ماں باپ کو لعنت کرے۔‘‘ کہا گیا: اے اﷲ کے رسول! کیسے ہو سکتا ہے کہ کوئی اپنے ماں باپ کو لعنت کرے؟ آپ ﷺ نے فرمایا ’’کوئی شخص جب دوسرے کے باپ کو لعنت کرے گا،تو وہ اس کے باپ کو لعنت کرے گا۔اگر دوسرے کی ماں کو لعنت کرے گا،تو وہ اس کی ماں کو لعنت کرے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>کلیب بن منفعۃ وثقہ ابن حبان وحدہ فھو مجہول الحال کما فی التحریر (5662)`;
abudawood.anwaar = [178,1];