var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ الْمَعْنَى قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ ابْنِ حُدَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أُنْثَى فَلَمْ يَئِدْهَا وَلَمْ يُهِنْهَا وَلَمْ يُؤْثِرْ وَلَدَهُ عَلَيْهَا قَالَ يَعْنِي الذُّكُورَ أَدْخَلَهُ اللَّهُ الْجَنَّةَ وَلَمْ يَذْكُرْ عُثْمَانُ يَعْنِي الذُّكُورَ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس کے پاس کوئی لڑکی ہو اور وہ اسے زندہ دفن نہ کر دے (جیسے کہ کفار کرتے تھے) اور نہ اس کی اہانت کرے اور نہ لڑکے کو اس پر فضیلت دے،تو اﷲ تعالیٰ اس آدمی کو جنت میں داخل فرمائے گا۔‘‘ اور راوی حدیث عثمان نے لفظ «الذکور» ذکر نہیں کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو معاویۃ عنعن<br>وابن حدیر ’ ’غیر مشہور‘‘ کما قال المنذري (عون المعبود502/4)`;
abudawood.anwaar = [178,2];