var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا النَّهَّاسُ بْنُ قَهْمٍ قَالَ حَدَّثَنِي شَدَّادٌ أَبُو عَمَّارٍ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَامْرَأَةٌ سَفْعَاءُ الْخَدَّيْنِ كَهَاتَيْنِ يَوْمَ الْقِيَامَةِ وَأَوْمَأَ يَزِيدُ بِالْوُسْطَى وَالسَّبَّابَةِ امْرَأَةٌ آمَتْ مِنْ زَوْجِهَا ذَاتُ مَنْصِبٍ وَجَمَالٍ حَبَسَتْ نَفْسَهَا عَلَى يَتَامَاهَا حَتَّى بَانُوا أَوْ مَاتُوا";
abudawood.urdu = "سیدنا عوف بن مالک اشجعی رضی اللہ عنہ سے مروی ہے کہ نے اپنی درمیان والی اور شہادت والی انگلی ملاتے ہوئے اشارہ کر کے دکھایا۔(یعنی) وہ معزز اور حسین و جمیل عورت جو بیوہ ہو گئی اور (عزت و خوبصورتی کے باوجود) اس نے (نکاح نہ کیا بلکہ) اپنے یتیم بچوں کی خاطر (نکاح کرنے سے) رکی رہی حتیٰ کہ وہ بڑے ہو گئے یا وفات پا گئے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>النھاس بن قھم : ضعیف`;
abudawood.anwaar = [179,1];