var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ،حَدَّثَنَا شُعْبَةُ،عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ،عَنْ أَبِي يَحْيَى،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَال:َ الْمُؤَذِّنُ يُغْفَرُ لَهُ مَدَى صَوْتِهِ،وَيَشْهَدُ لَهُ كُلُّ رَطْبٍ وَيَابِسٍ،وَشَاهِدُ الصَّلَاةِ يُكْتَبُ لَهُ خَمْسٌ وَعِشْرُونَ صَلَاةً،وَيُكَفَّرُ عَنْهُ مَا بَيْنَهُمَا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ راوی ہیں کہ نبی کریم ﷺ نے فرمایا ’’مؤذن کو جہاں تک اس کی آواز جاتی ہے بخش دیا جاتا ہے۔اور ہر خشک و تر چیز اس کی گواہی دیتی ہے اور جو جماعت میں حاضر ہوتا ہے اس کے لیے پچیس نمازوں کا ثواب لکھ دیا جاتا ہے اور دوسری نماز تک کے) مابین گناہ معاف کر دیئے جاتے ہیں۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (667)`;