var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ أَبِي حَازِمٍ قَالَ حَدَّثَنِي أَبِي عَنْ سَهْلٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنَا وَكَافِلُ الْيَتِيمِ كَهَاتَيْنِ فِي الْجَنَّةِ وَقَرَنَ بَيْنَ أُصْبُعَيْهِ الْوُسْطَى وَالَّتِي تَلِي الْإِبْهَامَ";
abudawood.urdu = "سیدنا سہل (سہل بن سعد انصاری) رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’میں اور یتیم کی کفالت کرنے والا جنت میں ایسے ہوں گے۔‘‘ اور آپ ﷺ نے اپنی درمیان والی اور شہادت والی انگلی کو ملا کر اشارہ فرمایا۔";
abudawood.hukam = "صحیح بخاری (6005)";
abudawood.description = ``;