var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى قُلْتُ لَيُوَرِّثَنَّهُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جبرائیل امین مجھے ہمسائے کے متعلق وصیت کرتے رہے حتیٰ کہ مجھے خیال ہوا کہ وہ اسے وارث ہی بنا دیں گے۔";
abudawood.hukam = "صحیح بخاری (6014) صحیح مسلم (2624)";
abudawood.description = ``;