var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ وَسَعِيدُ بْنُ مَنْصُورٍ أَنَّ الْحَارِثَ بْنَ عُبَيْدٍ حَدَّثَهُمْ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ طَلْحَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي جَارَيْنِ بِأَيِّهِمَا أَبْدَأُ قَالَ بِأَدْنَاهُمَا بَابًا قَالَ أَبُو دَاوُد قَالَ شُعْبَةُ فِي هَذَا الْحَدِيثِ طَلْحَةُ رَجُلٌ مِنْ قُرَيْشٍ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ کی آخری بات یہی تھی ’’نماز! نماز! اور اپنے غلاموں کے بارے میں اللہ سے ڈرتے رہنا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (3357)
روایۃ محمد بن فضیل عن مغیرہ بن مقسم محمولۃ علی السماع (مسند علي بن الجعد: 663) و أم موسیٰ وثقھا العجلي فالسند حسن`;