var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عُثْمَانَ بْنِ زُفَرَ عَنْ بَعْضِ بَنِي رَافِعِ بْنِ مَكِيثٍ عَنْ رَافِعِ بْنِ مَكِيثٍ وَكَانَ مِمَّنْ شَهِدَ الْحُدَيْبِيَةَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حُسْنُ الْمَلَكَةِ يُمْنٌ وَسُوءُ الْخُلُقِ شُؤْمٌ";
abudawood.urdu = "سیدنا رافع بن مکیث رضی اللہ عنہ سے روایت ہے اور یہ غزوہ حدیبیہ میں نبی کریم ﷺ کے ساتھ شریک تھے۔انہوں نے بیان کیا کہ نبی کریم ﷺ نے فرمایا ’’(اپنے ماتحت اور زیر ملکیت کے ساتھ) عمدہ برتاؤ کرنا برکت ہے اور بدخلقی نحوست ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عثمان بن زفر الدمشقي مجہول (تقریب التہذیب: 4469) لم یوثقہ غیر ابن حبان`;
abudawood.anwaar = [179,1];