var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُصَفَّى حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا عُثْمَانُ بْنُ زُفَرَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ خَالِدِ بْنِ رَافِعِ بْنِ مَكِيثٍ عَنْ عَمِّهِ الْحَارِثِ بْنِ رَافِعٍ بْنِ مَكِيثٍ وَكَانَ رَافِعٌ مِنْ جُهَيْنَةَ قَدْ شَهِدَ الْحُدَيْبِيَةَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حُسْنُ الْمَلَكَةِ يُمْنٌ وَسُوءُ الْخُلُقِ شُؤْمٌ";
abudawood.urdu = "جناب حارث بن رافع بن مکیث سے روایت ہے اور سیدنا رافع رضی اللہ عنہ قبیلہ جہینہ سے تھے اور غزوہ حدیبیہ میں رسول اللہ ﷺ کے ساتھ تھے۔رسول اللہ ﷺ سے روایت کیا،آپ نے فرمایا ’’(زیر ملکیت اور ماتحت کے ساتھ) عمدہ برتاؤ کرنا باعث برکت ہے اور بدخلقی نحوست ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (5162)`;
abudawood.anwaar = [179,1];