var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ نَافِعٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ, أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ الْعَبْدَ إِذَا نَصَحَ لِسَيِّدِهِ وَأَحْسَنَ عِبَادَةَ, اللَّهِ فَلَهُ أَجْرُهُ مَرَّتَيْنِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’تحقیق جو غلام اپنے آقا کو خیر خواہی کی بات کہے اور اللہ عزوجل کی عبادت بھی اچھے طریقے سے کرے،تو اس کو دوگنا ثواب ہے";
abudawood.hukam = "صحیح بخاری (2546) صحیح مسلم (1664)";
abudawood.description = ``;