var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،حَدَّثَنَا الْأَعْمَشُ،عَنْ رَجُلٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ الْإِمَامُ ضَامِنٌ،وَالْمُؤَذِّنُ مُؤْتَمَنٌ،اللَّهُمَّ أَرْشِدِ الْأَئِمَّةَ،وَاغْفِرْ لِلْمُؤَذِّنِينَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’امام ضامن اور ذمہ دار ہے اور مؤذن امین اور قابل اعتماد ہے۔اے اللہ! اماموں کو (صحیح علم و عمل) کی توفیق دے اور مؤذنوں کو بخش دے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (663)
وللحدیث شاھد عند أحمد (6/65 وسندہ حسن)`;