var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،عَنْ عَمَّارِ بْنِ رُزَيْقٍ،عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى،عَنْ عِكْرِمَةَ،عَنْ يَحْيَى بْنِ يَعْمَرَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ خَبَّبَ زَوْجَةَ امْرِئٍ أَوْ مَمْلُوكَهُ, فَلَيْسَ مِنَّا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو کوئی کسی کی بیوی کو اس کے شوہر کے خلاف یا غلام (خادم) کو اس کے مالک کے خلاف بھڑکائے،وہ ہم میں سے نہیں۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (3262)
انظر الحدیث السابق (2175)`;