var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ سُهَيْلٍ،عَنْ أَبِيهِ،قَالَ: حَدَّثَنَا أَبُو هُرَيْرَةَ, أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنِ اطَّلَعَ فِي دَارِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ, فَفَقَئُوا عَيْنَهُ, فَقَدْ هَدَرَتْ عَيْنُهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ انہوں نے رسول اللہ ﷺ کو سنا،آپ ﷺ فرماتے تھے ’’جس نے کسی کے گھر میں ان کی اجازت کے بغیر جھانکا اور انہوں نے اس کی آنکھ پھوڑ دی تو یہ ضائع ہے (اس میں کوئی قصاص نہیں)";
abudawood.hukam = "صحیح مسلم (2158)";
abudawood.description = ``;