var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ،عَنْ سُفْيَانَ عَنِ الْأَعْمَشِ،عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ،عَنْ رَجُلٍ،عَنْ سَعْدٍ نَحْوَهُ عَنِ النَّبِيِّ.";
abudawood.urdu = "سیدنا ہزیل رضی اللہ عنہ سے روایت ہے کہ ایک شخص،اور بقول عثمان بن ابی شیبہ،سیدنا سعد رضی اللہ عنہ آئے اور نبی کریم ﷺ کے دروازے پر کھڑے ہو کر اجازت طلب کرنے لگے۔عثمان بن ابی شیبہ نے وضاحت کی کہ وہ دروازے کے عین سامنے کھڑے ہو گئے۔تو نبی کریم ﷺ نے ان سے فرمایا ’’اس طرف ہٹ کر کھڑے ہو یا اس طرف۔اجازت لینے کا حکم نظر ہی کی وجہ سے ہے (کہ انسان اندر نہ جھانکے)";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأعمش مدلس وعنعن<br>وفی الروایۃ الثالثۃ : الرجل ھو ھزیل بن شرحبیل والحدیث السابق (الأصل : 5173) یغني عنہ`;
abudawood.anwaar = [179,1];