var abudawood = {};
abudawood.arabic = "َدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا شُعْبَةُ،عَنْ مَنْصُورٍ،عَنْ رِبْعِيٍّ،عَنْ رَجُلٍ مَنْ بَنِي عَامِرٍ أَنَّهُ اسْتَأْذَنَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ فَسَمِعْتُهُ فَقُلْتُ: السَّلَامُ عَلَيْكُمْ أَأَدْخُلُ.";
abudawood.urdu = "عبیداللہ بن معاذ نے اپنے والد سے بیان کیا،انہوں نے شعبہ سے،انہوں نے منصور سے،انہوں نے ربعی سے،اور وہ بنو عامر کے ایک آدمی سے روایت کرتے ہیں کہ اس نے نبی کریم ﷺ سے اجازت طلب کی اور مذکورہ بالا حدیث کے ہم معنی روایت کیا۔کہا کہ میں نے آپ کی بات سن لی تو میں نے کہا: ’’السلام علیکم‘‘ کیا میں اندر آ سکتا ہوں";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (5177)`;