var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا ابْنُ نُمَيْرٍ عَنِ الْأَعْمَشِ قَالَ نُبِّئْتُ،عَنْ أَبِي صَالِحٍ قَالَ وَلَا أُرَانِي إِلَّا قَدْ سَمِعْتُهُ مِنْهُ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ.";
abudawood.urdu = "جناب ابوصالح کہتے ہیں کہ میں نہیں سمجھتا مگر یہ کہ میں نے اسے سیدنا ابوہریرہ رضی اللہ عنہ ہی سے سنا ہے۔انہوں نے کہا رسول اللہ ﷺ نے فرمایا۔اور مذکورہ بالا حدیث کی مانند روایت کیا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (663)
انظر الحدیث السابق (517)`;