var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ وَعَنْ غَيْرِ وَاحِدٍ مَنْ عُلَمَائِهِمْ فِي هَذَا, فَقَالَ عُمَرُ لِأَبِي مُوسَى: أَمَا إِنِّي لَمْ أَتَّهِمْكَ, وَلَكِنْ خَشِيتُ أَنْ يَتَقَوَّلَ النَّاسُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ!.";
abudawood.urdu = "جناب ربیعہ بن ابوعبدالرحمٰن اور کئی ایک محدثین سے مروی ہے کہ سیدنا عمر رضی اللہ عنہ نے سیدنا ابوموسیٰ رضی اللہ عنہ سے کہا: میں آپ پر کوئی تہمت نہیں لگا رہا،لیکن مجھے اندیشہ ہے کہ کہیں لوگ رسول اللہ ﷺ کی طرف ویسے ہی احادیث کی نسبت نہ کرنے لگیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `وھو فی الموطأ (2/964) مطولًا`;