var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرٌ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ أَنَّهُ ذَهَبَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دَيْنِ أَبِيهِ فَدَقَقْتُ الْبَابَ فَقَالَ مَنْ هَذَا قُلْتُ أَنَا قَالَ أَنَا أَنَا كَأَنَّهُ كَرِهَهُ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے،وہ کہتے ہیں کہ میں اپنے والد کے قرضے کے سلسلے میں نبی کریم ﷺ کے ہاں حاضر ہوا تو میں نے دروازے پر دستک دی۔آپ ﷺ نے پوچھا ’’کون ہے؟‘‘ میں نے جواب میں کہا: میں ہوں۔آپ ﷺ نے فرمایا ’’میں ہوں،میں ہوں۔‘‘ گویا آپ ﷺ نے اس انداز کو ناپسند فرمایا۔";
abudawood.hukam = "صحیح بخاری (6250) صحیح مسلم (2155)";
abudawood.description = ``;