var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حَبِيبٍ وَهِشَامٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَسُولُ الرَّجُلِ إِلَى الرَّجُلِ إِذْنُهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’کسی کو بلانے کے لیے آدمی کا بھیجا جانا،اس (آنے والے) کے لیے اجازت (کے معنی میں) ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ البخاري فی الأدب المفرد (1076)`;