var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُسَيْنُ بْنُ مُعَاذٍ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ فَجَاءَ مَعَ الرَّسُولِ فَإِنَّ ذَلِكَ لَهُ إِذْنٌ قَالَ أَبُو عَلِىٍّ الْلُّؤْلُؤِيُّ سَمِعْتُ أَبَا دَاوُدَ يَقُولُ قَتَادَةُ لَمْ يَسْمَعْ مِنْ أَبِي رَافِعٍ شَيْئًا";
abudawood.urdu = "سیدنا ابو ہریرۃؓ سے روایت ہے‘رسول اللہ ﷺ نے فرمایا:’’جب کسی کو کھانے پر بلایا جائے اور وہ بلانے والے کے ساتھ چلا آئے تو یہی اجازت ہے۔‘‘\nامام ابو داؤد رحمہ اللہ نے فرمایا:کہا جاتا ہے کہ قتادہ نے ابو رافع سے کچھ نہیں سنا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن`;
abudawood.anwaar = [179,1];