var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ لَا تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَفَلَا أَدُلُّكُمْ عَلَى أَمْرٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ گے جب تک کہ ایمان نہ لے آؤ۔اور تم اس وقت تک مومن نہیں ہو سکتے جب تک کہ آپس میں محبت نہ کرنے لگو۔کیا میں تمہیں ایسی بات نہ بتا دوں کہ اس پر عمل کرنے سے آپس میں محبت کرنے لگو؟ آپس میں سلام بہت کیا کرو۔‘‘";
abudawood.hukam = "صحیح مسلم (54)";
abudawood.description = ``;