var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْإِسْلَامِ خَيْرٌ قَالَ تُطْعِمُ الطَّعَامَ وَتَقْرَأُ السَّلَامَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ ایک آدمی نے رسول اللہ ﷺ سے سوال کیا: کون سا اسلام (اسلام کی کون سی خصلت) بہتر ہے؟ آپ ﷺ نے فرمایا ’’تمہارا کھانا کھلانا اور سلام کہنا اسے،جسے تم پہچانتے ہو یا نہ پہچانتے ہو۔‘‘";
abudawood.hukam = "صحیح بخاری (28) صحیح مسلم (39)";
abudawood.description = ``;