var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ الذُّهْلِيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ أَبِي خَالِدٍ وَهْبٍ عَنْ أَبِي سُفْيَانَ الْحِمْصِيِّ عَنْ أَبِي أُمَامَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوْلَى النَّاسِ بِاللَّهِ مَنْ بَدَأَهُمْ بِالسَّلَامِ";
abudawood.urdu = "سیدنا ابوامامہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’لوگوں میں اﷲ کے ہاں سب سے زیادہ قریب وہ شخص ہے جو انہیں سلام کہنے میں ابتداء کرے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (4646)`;