var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ حَدَّثَنَا عَنْبَسَةُ بْنُ سَعِيدٍ الْكُوفِيُّ الْحَاسِبُ حَدَّثَنِي كَثِيرٌ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَاكُ فَيُعْطِينِي السِّوَاكَ لِأَغْسِلَهُ فَأَبْدَأُ بِهِ فَأَسْتَاكُ ثُمَّ أَغْسِلُهُ وَأَدْفَعُهُ إِلَيْهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی کریم ﷺ مسواک کر رہے ہوتے تھے اور مجھے عنایت فرماتے کہ میں اسے دھو دوں،مگر میں پہلے اسے اپنے منہ میں پھیرتی پھر اسے دھو کر آپ ﷺ کو واپس دے دیتی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (384)
کثیر بن عبید وثقہ ابن حبان وصحح لہ الحاکم (4/ 10) والذھبی وروی عنہ جماعۃ`;