var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا حَسَنُ بْنُ صَالِحٍ عَنْ أَبِيهِ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ عُمَرَ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي مَشْرُبَةٍ لَهُ فَقَالَ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ السَّلَامُ عَلَيْكُمْ أَيَدْخُلُ عُمَرُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے روایت کیا کہ سیدنا عمر رضی اللہ عنہ نبی کریم ﷺ کے پاس آئے جبکہ آپ ﷺ اپنے حجرے میں تھے۔انہوں نے کہا: «السلام علیک یا رسول اللہ السلام علیکم» کیا عمر اندر آ سکتا ہے؟";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;