var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ عَنْ ثَابِتٍ قَالَ قَالَ أَنَسٌ أَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى غِلْمَانٍ يَلْعَبُونَ فَسَلَّمَ عَلَيْهِمْ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ بچوں کے پاس سے گزرے جبکہ وہ کھیل رہے تھے تو آپ ﷺ نے ان کو سلام کہا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `رواہ البخاري (6247) ومسلم (2168)`;