var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي حُسَيْنٍ سَمِعَهُ مِنْ شَهْرِ بْنِ حَوْشَبٍ يَقُولُ أَخْبَرَتْهُ أَسْمَاءُ ابْنَةُ يَزِيدَ مَرَّ عَلَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ فَسَلَّمَ عَلَيْنَا";
abudawood.urdu = "سیدہ اسماء بنت یزید رضی اللہ عنہا بیان کرتی ہیں کہ نبی کریم ﷺ ہم عورتوں کی جماعت پر گزرے تو آپ ﷺ نے ہمیں سلام کہا۔";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (4647، 4663)
أخرجہ ابن ماجہ (3701 وسندہ حسن) ورواہ الترمذي (2697 وسندہ حسن)`;