var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا بِشْرٌ يَعْنِيَانِ ابْنَ الْمُفَضَّلِ عَنْ ابْنِ عَجْلَانَ عَنْ الْمَقْبُرِيِّ قَالَ مُسَدَّدٌ سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا انْتَهَى أَحَدُكُمْ إِلَى الْمَجْلِسِ فَلْيُسَلِّمْ فَإِذَا أَرَادَ أَنْ يَقُومَ فَلْيُسَلِّمْ فَلَيْسَتْ الْأُولَى بِأَحَقَّ مِنْ الْآخِرَةِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی کسی مجلس میں پہنچے تو چاہیئے کہ سلام کہے اور جب وہاں سے اٹھنا چاہے تو بھی سلام کہے۔پہلی دفعہ سلام کہنا دوسری دفعہ کے مقابلے میں کوئی زیادہ اہم نہیں ہے۔“";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4660)
أخرجہ الترمذي (2706 وسندہ حسن) محمد بن عجلان صرح بالسماع عند البخاري فی الأدب المفرد (1008)`;