var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ أَبِي غِفَارٍ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ أَبِي جُرَيٍّ الْهُجَيْمِيِّ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ عَلَيْكَ السَّلَامُ يَا رَسُولَ اللَّهِ قَالَ لَا تَقُلْ عَلَيْكَ السَّلَامُ فَإِنَّ عَلَيْكَ السَّلَامُ تَحِيَّةُ الْمَوْتَى";
abudawood.urdu = "سیدنا ابوجری ھجیمی رضی اللہ عنہ بیان کرتے ہیں کہ میں رسول اللہ ﷺ کی خدمت میں حاضر ہوا،تو میں نے کہا: «علیک السلام یا رسول اللہ» آپ ﷺ نے فرمایا یہ لفظ «علیک السلام» مت بولو،یہ مردوں کا سلام ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (4084)`;