var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ زَيْدٍ الْعَمِّيِّ،عَنْ أَبِي إِيَاسٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ لَا يُرَدُّ الدُّعَاءُ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اذان اور اقامت کے مابین دعا رد نہیں کی جاتی۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (671)
ولہ شواھد عند أحمد (3/225) وسندہ صحیح`;