var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بَلْجٍ عَنْ زَيْدٍ أَبِي الْحَكَمِ الْعَنَزِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا الْتَقَى الْمُسْلِمَانِ فَتَصَافَحَا وَحَمِدَا اللَّهَ عَزَّ وَجَلَّ وَاسْتَغْفَرَاهُ غُفِرَ لَهُمَا";
abudawood.urdu = "سیدنا براء بن عازب رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جب دو مسلمانوں کی ملاقات ہوتی ہے اور وہ مصافحہ کرتے ہیں،اللہ کی حمد بیان کرتے اور اس سے بخشش مانگتے ہیں،تو اللہ عزوجل ان دونوں کی مغفرت فرما دیتا ہے۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>زید بن أبی الشعثاء : مجہول (التحریر : 2141) ووثقہ ابن حبان وحدہ`;
abudawood.anwaar = [180,1];