var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ وَابْنُ نُمَيْرٍ عَنْ الْأَجْلَحِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمَيْنِ يَلْتَقِيَانِ فَيَتَصَافَحَانِ إِلَّا غُفِرَ لَهُمَا قَبْلَ أَنْ يَفْتَرِقَا";
abudawood.urdu = "سیدنا براء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو کوئی دو مسلمان ملاقات کرتے اور پھر مصافحہ کرتے ہیں،تو جدا ہونے سے پہلے ہی ان دونوں کی مغفرت فرما دی جاتی ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (2727) ابن ماجہ (3703)<br>أبو إسحاق مدلس وعنعن<br>وللحدیث شواھد ضعیفۃ<br>و روی الإمام أحمد (3/ 142) : قال نبي اللّٰہ ﷺ: ((ما من مسلمین التقیا فأخذ أحدھما بید صاحبہ إلا کان حقًا علی اللّٰہ أن یحضر دعاءھما و لا یفرّق بین أیدیھما حتی یغفر لھما)) وسندہ حسن وھو یغني عنہ`;
abudawood.anwaar = [180,1];