var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ لَمَّا جَاءَ أَهْلُ الْيَمَنِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ جَاءَكُمْ أَهْلُ الْيَمَنِ وَهُمْ أَوَّلُ مَنْ جَاءَ بِالْمُصَافَحَةِ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ جب اہل یمن آئے،تو رسول اللہ ﷺ نے فرمایا ’’تحقیق اہل یمن تمہارے پاس آ گئے ہیں۔اور یہ پہلے لوگ ہیں جنہوں نے مصافحے کا عمل شروع کیا۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `حمید عنعن لکنہ کان یدلس عن ثابت البناني عن أنس رضي اللہ عنہ وثابت البناني ثقۃ`;