var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ،عَنْ مَالِكٍ عَنِ ابْنِ شِهَابٍ،عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا سَمِعْتُمُ النِّدَاءَ،فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم اذان سنو تو اسی طرح کہو جیسے کہ مؤذن کہتا ہے۔“";
abudawood.hukam = "صحیح بخاری (611) صحیح مسلم (383)";
abudawood.description = ``;