var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ أَجْلَحَ عَنْ الشَّعْبِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَلَقَّى جَعْفَرَ بْنَ أَبِي طَالِبٍ فَالْتَزَمَهُ وَقَبَّلَ مَا بَيْنَ عَيْنَيْهِ";
abudawood.urdu = "جناب شعبی رحمہ اللہ سے مروی ہے کہ نبی کریم ﷺ،سیدنا جعفر بن ابی طالب رضی اللہ عنہ سے ملے (جبکہ وہ سفر سے واپس آئے تھے) تو آپ ﷺ نے ان سے معانقہ کیا اور ان کی آنکھوں کے درمیان بوسہ بھی دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>السند مرسل کما قال البیہقي (101/7)<br>وللحدیث طرق ضعیفۃ`;
abudawood.anwaar = [180,1];