var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَالِمٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ دَخَلْتُ مَعَ أَبِي بَكْرٍ أَوَّلَ مَا قَدِمَ الْمَدِينَةَ فَإِذَا عَائِشَةُ ابْنَتُهُ مُضْطَجِعَةٌ قَدْ أَصَابَتْهَا حُمَّى فَأَتَاهَا أَبُو بَكْرٍ فَقَالَ لَهَا كَيْفَ أَنْتِ يَا بُنَيَّةُ وَقَبَّلَ خَدَّهَا";
abudawood.urdu = "سیدنا براء رضی اللہ عنہ بیان کرتے ہیں کہ میں سیدنا ابوبکر رضی اللہ عنہ کے ساتھ آیا جبکہ یہ لوگ نئے نئے مدینہ آئے تھے،اور ان کی صاحبزادی سیدہ عائشہ رضی اللہ عنہا بخار کی وجہ سے لیٹی ہوئی تھی،تو ابوبکر رضی اللہ عنہ ان کے قریب ہوئے اور پوچھا: بٹیا تمہارا کیا حال ہے؟ اور ان کے رخسار پر بوسہ بھی دیا۔";
abudawood.hukam = "صحیح بخاری (3918)";
abudawood.description = `مشکوۃ المصابیح (4690)`;