var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُ وَذَكَرَ قِصَّةً قَالَ فَدَنَوْنَا يَعْنِي مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبَّلْنَا يَدَهُ";
abudawood.urdu = "جناب عبدالرحمٰن بن ابو لیلیٰ نے بیان کیا کہ سیدنا عبداللہ بن عمر رضی اللہ عنہما نے قصہ بیان کیا کہ ہم نبی کریم ﷺ کے قریب ہوئے اور ہم نے آپ ﷺ کے ہاتھ کو بوسہ دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3704) و تقدم (2647)`;
abudawood.anwaar = [180,2];