var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا هِشَامٌ عَنْ حَمَّادٍ يَعْنِيَانِ ابْنَ أَبِي سُلَيْمَانَ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ أَبِي ذَرٍّ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا ذَرٍّ فَقُلْتُ لَبَّيْكَ وَسَعْدَيْكَ يَا رَسُولَ اللَّهِ وَأَنَا فِدَاؤُكَ";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ سے روایت ہے وہ کہتے ہیں کہ نبی کریم ﷺ نے فرمایا: اے ابوذر!‘‘ میں نے کہا: میں حاضر ہوں اور بڑا باسعادت ہوں۔اے اللہ کے رسول! میں آپ پر فدا اور قربان۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>حماد بن أبي سلیمان عنعن<br>وحدیث البخاري (6268) و مسلم (94 بعد 921) یغني عنہ`;
abudawood.anwaar = [181,1];