var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ مِسْعَرٍ عَنْ أَبِي الْعَنْبَسِ عَنْ أَبِي الْعَدَبَّسِ عَنْ أَبِي مَرْزُوقٍ عَنْ أَبِي غَالِبٍ عَنْ أَبِي أُمَامَةَ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَوَكِّئًا عَلَى عَصًا فَقُمْنَا إِلَيْهِ فَقَالَ لَا تَقُومُوا كَمَا تَقُومُ الْأَعَاجِمُ يُعَظِّمُ بَعْضُهَا بَعْضًا";
abudawood.urdu = "سیدنا ابوامامہ باہلی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ ہمارے ہاں تشریف لائے۔آپ ﷺ اپنے عصا کے سہارے سے چل رہے تھے۔ہم آپ ﷺ کی طرف کھڑے ہوئے تو آپ ﷺ نے فرمایا ’’عجمیوں (غیر مسلموں) کی طرح مت اٹھا کرو،جس میں کہ وہ ایک دوسرے کو تعظیم دیتے ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3836)<br>أبو مرزوق لین (تق: 8353) و أبو العدبس : مجہول (تق: 8248)`;
abudawood.anwaar = [181,1];