var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ أَبِي سَلَمَةَ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا حَدَّثَتْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا إِنَّ جِبْرِيلَ يَقْرَأُ عَلَيْكِ السَّلَامَ فَقَالَتْ وَعَلَيْهِ السَّلَامُ وَرَحْمَةُ اللَّهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم ﷺ نے ان سے فرمایا ’’تحقیق جبرائیل علیہ السلام تجھے سلام کہہ رہے ہیں۔‘‘ تو انہوں نے کہا: «وعلیہ السلام ورحمۃ اللہ»";
abudawood.hukam = "صحیح بخاری (6253) صحیح مسلم (2447)";
abudawood.description = ``;