var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عِيسَى بْنُ إِبْرَاهِيمَ الْبِرَكِيُّ وَسَمِعْتُهُ مِنْ أَبِي الْوَلِيدِ الطَّيَالِسِيُّ وَأَنَا لِحَدِيثِ عِيسَى أَضْبَطُ قَالَ حَدَّثَنَا عَبْدُ الْقَاهِرِ بْنُ السَّرِيِّ يَعْنِي السُّلَمِيَّ حَدَّثَنَا ابْنُ كِنَانَةَ بْنِ عَبَّاسِ بْنِ مِرْدَاسٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ ضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ أَبُو بَكْرٍ أَوْ عُمَرُ أَضْحَكَ اللَّهُ سِنَّكَ وَسَاقَ الْحَدِيثَ";
abudawood.urdu = "جناب (عبداللہ) ابن کنانہ بن عباس بن مرداس اپنے والد سے وہ دادا سے روایت کرتے ہیں کہ رسول اللہ ﷺ ہنس دیے تو سیدنا ابوبکر یا عمر رضی اللہ عنہما نے کہا: اللہ آپ کو (ہمیشہ) ہنستا مسکراتا رکھے۔اور حدیث بیان کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3013)<br>عبداﷲ بن کنانۃ وأبوہ :مجہولان (تق: 3556،5667)`;
abudawood.anwaar = [181,1];