var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا حَفْصٌ عَنْ الْأَعْمَشِ عَنْ أَبِي السَّفَرِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ مَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أُطَيِّنُ حَائِطًا لِي أَنَا وَأُمِّي فَقَالَ مَا هَذَا يَا عَبْدَ اللَّهِ فَقُلْتُ يَا رَسُولَ اللَّهِ شَيْءٌ أُصْلِحُهُ فَقَالَ الْأَمْرُ أَسْرَعُ مِنْ ذَلِكَ";
abudawood.urdu = "حضرت عبد اللہ بن عمر ؓ کا بیان ہے کہ میں اور میری والدہ اپنے احاطے کی دیوار لیپ رہے تھے کہ رسول اللہ ﷺ میرے پاس سے گزرے۔آپ نے پوچھا:’’عبد اللہ کیا ہو رہا ہو؟‘‘میں نے عرض کیا:اللہ کے رسول!اس کی کچھ مرمت کر رہا ہوں۔آپ نے فرمایا:’’معاملہ تو اس سے بہت جلد ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (5449)
الأعمش صرح بالسماع عند البخاري فی الأدب المفرد (456)`;