var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ وَمُحَمَّدُ بْنُ سَلَمَةَ،قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ حُيَيٍّ،عَنْ أَبِي عَبْدِ الرَّحْمَنِ يَعْنِي الْحُبُلِيَّ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ! إِنَّ الْمُؤَذِّنِينَ يَفْضُلُونَنَا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ قُلْ كَمَا يَقُولُونَ،فَإِذَا انْتَهَيْتَ فَسَلْ تُعْطَهْ.";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہا سے روایت ہے کہ ایک شخص نے کہا: اے اللہ کے رسول! مؤذن ہم سے فضیلت لے جائیں گے،تو رسول اللہ ﷺ نے فرمایا ’’تم بھی ویسے ہی کہا کرو جیسے کہ وہ کہتے ہیں۔جب تم اس سے فارغ ہو تو سوال کرو اور دعا مانگو،دیے جاؤ گے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (673)
وابن وھب صرح بالسماع عند الطبرانی فی کتاب الدعاء (444)`;