var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ وَسَلَمَةُ يَعْنِي ابْنَ شَبِيبٍ،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ،عَنْ رَجُلٍ مِنْ ثَقِيفٍ،عَنْ عُرْوَةَ ابْنِ الزُّبَيْرِ يَرْفَعُ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ";
abudawood.urdu = "جناب عثمان بن ابو سلیمان نے ثقیف کے ایک آدمی سے،اس نے سیدنا عروہ بن زبیر سے انہوں نے نبی کریم ﷺ سے مرفوع روایت کیا اور مذکورہ بالا حدیث کی مانند بیان کی۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (5239)`;