var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ رِوَايَةً وَقَالَ مَرَّةً يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تَنَامُونَ";
abudawood.urdu = "جناب سالم رحمہ اللہ اپنے والد (سیدنا عبداللہ بن عمر رضی اللہ عنہما) سے روایت کرتے ہیں اور ایک بار نبی کریم ﷺ سے مرفوع بھی ذکر کیا کہ ’’سوتے وقت اپنے گھروں میں آگ نہ رہنے دیا کرو۔‘‘";
abudawood.hukam = "صحیح بخاری (6293) صحیح مسلم (2015)";
abudawood.description = ``;