var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا سَالَمْنَاهُنَّ مُنْذُ حَارَبْنَاهُنَّ وَمَنْ تَرَكَ شَيْئًا مِنْهُنَّ خِيفَةً فَلَيْسَ مِنَّا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جب سے ہماری ان (سانپوں) سے لڑائی شروع ہوئی ہے ہم نے ان سے صلح نہیں کی اور جس نے ڈر کے مارے ان میں سے کسی کو چھوڑ دیا وہ ہم میں سے نہیں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (4139)
محمد بن عجلان صرح بالسماع عند أحمد (2/432)`;