var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ السُّكَّرِيُّ عَنْ إِسْحَقَ بْنِ يُوسُفَ عَنْ شَرِيكٍ عَنْ أَبِي إِسْحَقَ عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوا الْحَيَّاتِ كُلَّهُنَّ فَمَنْ خَافَ ثَأْرَهُنَّ فَلَيْسَ مِنِّي";
abudawood.urdu = "سیدنا ابن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’سب قسم کے سانپوں کو مار ڈالا کرو۔جو ان کے بدلے سے ڈرے،وہ مجھ سے نہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (3195)<br>شریک مدلس وعنعن<br>والحدیث الآتي (الأصل : 5252) والسابق (الأصل : 5248) یغني عنہ`;
abudawood.anwaar = [182,1];