var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا مُوسَى بْنُ مُسْلِمٍ قَالَ سَمِعْتُ عِكْرِمَةَ يَرْفَعُ الْحَدِيثَ فِيمَا أَرَى إِلَى ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْحَيَّاتِ مَخَافَةَ طَلَبِهِنَّ فَلَيْسَ مِنَّا مَا سَالَمْنَاهُنَّ مُنْذُ حَارَبْنَاهُنَّ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے سانپوں کو ان کے بدلے کے ڈر سے چھوڑ دیا،وہ ہم سے نہیں۔جب سے ہماری ان سے لڑائی شروع ہوئی ہے ہم نے ان سے صلح نہیں کی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>موسی بن مسلم الطحان شک في وصل الحدیث<br>فالحدیث معلول`;
abudawood.anwaar = [182,1];