var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ مُوسَى الطَّحَّانِ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَابِطٍ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا نُرِيدُ أَنْ نَكْنُسَ زَمْزَمَ وَإِنَّ فِيهَا مِنْ هَذِهِ الْجِنَّانِ يَعْنِي الْحَيَّاتِ الصِّغَارَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِهِنَّ";
abudawood.urdu = "سیدنا عباس بن عبدالمطلب رضی اللہ عنہ نے رسول اللہ ﷺ سے کہا کہ ہم زمزم کے کنویں کو صاف کرنا چاہتے ہیں لیکن اس میں چھوٹے چھوٹے سانپ ہیں۔تو نبی کریم ﷺ نے ان کو مار ڈالنے کا حکم دیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مروان بن معاویۃ عنعن وفي سماع عبد الرحمٰن بن سابط من عباس نظر`;
abudawood.anwaar = [182,1];