var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ السَّرْحِ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ قَالَا،أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ: أَخْبَرَنِي أَسُامَةُ،عَنْ نَافِعٍ.. فِي هَذَا الْحَدِيثِ. قَالَ نَافِعٌ: ثُمَّ رَأَيْتُهَا-بَعْدُ-فِي بَيْتِهِ.";
abudawood.urdu = "جناب اسامہ،سیدنا نافع سے مذکورہ حدیث سے سلسلے میں روایت کرتے ہیں نافع نے کہا کہ یہ روایت سننے کے بعد میں نے گھر میں سانپ دیکھا (مارنے کی بجائے بقیع کی جانب بھگا دیا)۔";
abudawood.hukam = "صحیح مسلم (2233)";
abudawood.description = ``;