var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ،أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ،أَخْبَرَنِي مَالِكٌ،عَنْ صَيْفِيٍّ مَوْلَى ابْنِ أَفْلَحَ, قَالَ: أَخْبَرَنِي أَبُو السَّائِبِ-مَوْلَى هِشَامِ بْنِ زُهْرَةَ-, أَنَّهُ دَخَلَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ... فَذَكَرَ نَحْوَهُ،وَأَتَمَّ مِنْهُ. قَالَ: فَآذِنُوهُ ثَلَاثَةَ أَيَّامٍ, فَإِنْ بَدَا لَكُمْ بَعْدَ ذَلِكَ فَاقْتُلُوهُ, فَإِنَّمَا هُوَ شَيْطَانٌ.";
abudawood.urdu = "جناب ابوسائب مولیٰ ہشام بن زہرہ سے روایت ہے کہ وہ سیدنا ابوسعید خدری رضی اللہ عنہ کے ہاں گئے۔اور مذکورہ بالا حدیث کی مانند بلکہ اس سے کامل روایت کیا۔کہا: ’’اسے تین دن تک متنبہ کرو۔اگر اس کے بعد تمہارے سامنے آئے تو قتل کر دو۔بلاشبہ وہ شیطان ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (2236)";
abudawood.description = ``;