var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَهْدِيٍّ،حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَمِعَ الْمُؤَذِّنَ يَتَشَهَّدُ،قَالَ: وَأَنَا وَأَنَا";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ جب مؤذن کو سنتے اور وہ شہادت کے کلمات کہتا،تو آپ ﷺ فرماتے ’’اور میں بھی اور میں بھی (یعنی شہادت دیتا ہوں)۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (677)
وأخرجہ البیھقي (1/409) من حدیث أبي داود بہ وسندہ حسن`;