var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْوَزَغِ وَسَمَّاهُ فُوَيْسِقًا";
abudawood.urdu = "سیدنا عامر بن سعد اپنے والد سیدنا سعد بن ابووقاص رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے چھپکلی (اور گرگٹ) کو قتل کر دینے کا حکم دیا ہے اور اسے چھوٹا فاسق بتایا۔‘‘ (مضرت رساں اور نقصان دہ جانور)۔";
abudawood.hukam = "صحیح مسلم (2238)";
abudawood.description = ``;