var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ سُهَيْلٍ قَالَ حَدَّثَنِي أَخِي أَوْ أُخْتِي عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي أَوَّلِ ضَرْبَةٍ سَبْعِينَ حَسَنَةً";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’جس نے چھپکلی (یا گرگٹ) کو پہلی ہی چوٹ میں مار دیا اس کے لیے ستر نیکیاں ہیں۔‘‘";
abudawood.hukam = "صحیح مسلم (2240)";
abudawood.description = ``;