var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ قَتْلِ أَرْبَعٍ مِنْ الدَّوَابِّ النَّمْلَةُ وَالنَّحْلَةُ وَالْهُدْهُدُ وَالصُّرَدُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے منقول ہے کہ نبی کریم ﷺ نے چار قسم کے جانوروں کو قتل کرنے سے منع فرمایا ہے چیونٹی،شہد کی مکھی،ہد ہد اور لٹورا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (3224)<br>الزھري عنعن<br>وللحدیث شواھد ضعیفۃ`;
abudawood.anwaar = [182,1];