var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عُقْبَةَ بْنِ صُهْبَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَذْفِ قَالَ إِنَّهُ لَا يَصِيدُ صَيْدًا وَلَا يَنْكَأُ عَدُوًّا وَإِنَّمَا يَفْقَأُ الْعَيْنَ وَيَكْسِرُ السِّنَّ";
abudawood.urdu = "سیدنا عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے کنکریاں مارنے سے منع فرمایا ہے۔آپ ﷺ نے فرمایا ’’اس سے کسی کا شکار نہیں ہوتا،نہ کوئی دشمن زخمی ہوتا ہے،البتہ کسی کی آنکھ پھوٹ سکتی ہے،یا دانت ٹوٹ سکتا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (6220) صحیح مسلم (1954)";
abudawood.description = ``;