var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ عَنْ دَاوُدَ بْنِ أَبِي صَالِحٍ الْمَدَنِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَمْشِيَ يَعْنِي الرَّجُلَ بَيْنَ الْمَرْأَتَيْنِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم ﷺ نے اس بات سے منع فرمایا کہ کوئی آدمی دو عورتوں کے درمیان ہو کر چلے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف جدًا<br>داود بن أبي صالح : منکر الحدیث (تق: 1791) وقال أبو حاتم :’’ مجہول حدّث بحدیث منکر‘‘ (الجرح والتعدیل 416/3)`;
abudawood.anwaar = [183,1];