var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ إِهَابٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْوَلِيدِ الْعَدَنِيُّ،حَدَّثَنَا الْقَاسِمُ بْنُ مَعْنٍ،حَدَّثَنَا الْمَسْعُودِيُّ،عَنْ أَبِي كَثِيرٍ مَوْلَى أُمِّ سَلَمَةَ،عَنْ أُمِّ سَلَمَةَ،قَالَتْ: عَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُولَ عِنْدَ أَذَانِ الْمَغْرِب:ِ اللَّهُمَّ إِنَّ هَذَا إِقْبَالُ لَيْلِكَ،وَإِدْبَارُ نَهَارِكَ،وَأَصْوَاتُ دُعَاتِكَ, فَاغْفِرْ لِي.";
abudawood.urdu = "ام المؤمنین سیدہ ام سلمہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے مجھے تعلیم دی کہ مغرب کی اذان کے وقت یہ (درج ذیل) دعا پڑھا کروں «اللہم إن ہذا إقبال لیلک وإدبار نہارک وأصوات دعاتک فاغفر لی» ’’اے اللہ! بیشک یہ وقت ہے کہ تیری رات آ رہی ہے،تیرا دن جا رہا ہے اور تیری طرف پکارنے والوں کی صدائیں ہیں،لہٰذا تو مجھے بخش دے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (669)
أبو کثیر مولٰی أم سلمۃ حسن الحدیث وثقہ الحاکم والذھبي، والمسعودي حدث بہ قبل اختلاطہ`;