var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ،عَنْ شَدَّادٍ مَوْلَى عِيَاضِ بْنِ عَامِرٍ،عَنْ بِلَالٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: لَا تُؤَذِّنْ حَتَّى يَسْتَبِينَ لَكَ الْفَجْرُ هَكَذَا وَمَدَّ يَدَيْهِ عَرْضًا.\nقَالَ أَبو دَاود: شَدَّادٌ مَوْلَى عِيَاضٍ لَمْ يُدْرِكْ بِلَالًا.";
abudawood.urdu = "شداد مولیٰ عیاض بن عامر،سیدنا بلال رضی اللہ عنہ سے راوی ہیں کہ رسول اللہ ﷺ نے انہیں فرمایا ’’جب تک فجر اس طرح نمایاں نہ ہو جایا کرے،اذان نہ کہا کرو۔‘‘ اور آپ ﷺ نے اطراف عرض میں اپنے دونوں ہاتھوں کو پھیلا کر اشارہ فرمایا۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ شداد مولیٰ عیاض نے سیدنا بلال رضی اللہ عنہ کو نہیں پایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سندہ مرسل،شداد مولی عیاض لم یدرک بلا لاً کما قال أبو داود`;
abudawood.anwaar = [33,1];