var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،أَنَّ ابْنَ أُمِّمَكْتُومٍ كَانَ مُؤَذِّنًا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ أَعْمَى.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ سیدنا ابن ام مکتوم رضی اللہ عنہ رسول اللہ ﷺ کے مؤذن تھے اور نابینا تھے۔";
abudawood.hukam = "صحیح مسلم (381)";
abudawood.description = ``;