var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،حَدَّثَنَا سُفْيَانُ،عَنْ إِبْرَاهِيمَ بْنِ الْمُهَاجِرِ،عَنْ أَبِي الشَّعْثَاءِ،قَالَ: كُنَّا مَعَ أَبِي هُرَيْرَةَ فِي الْمَسْجِدِ،فَخَرَجَ رَجُلٌ حِينَ أَذَّنَ الْمُؤَذِّنُ لِلْعَصْرِ،فَقَالَ أَبُو هُرَيْرَةَ: أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
abudawood.urdu = "جناب ابوالشعثاء بیان کرتے ہیں کہ ہم سیدنا ابوہریرہ رضی اللہ عنہ کے ساتھ مسجد میں بیٹھے تھے کہ مؤذن نے عصر کی اذان کہی تو اس کے بعد ایک شخص مسجد سے نکل گیا،سیدنا ابوہریرہ رضی اللہ عنہ نے کہا: اس نے سیدنا ابوالقاسم ﷺ کی نافرمانی کی ہے۔";
abudawood.hukam = "صحیح مسلم (655)";
abudawood.description = ``;