var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا شَبَابَةُ،عَنْ إِسْرَائِيلَ،عَنْ سِمَاكٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَال:َ كَانَ بِلَالٌ يُؤَذِّنُ ثُمَّ يُمْهِلُ،فَإِذَا رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ خَرَجَ،أَقَامَ الصَّلَاةَ.";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ سیدنا بلال رضی اللہ عنہ اذان کہتے،پھر ذرا دیر رکتے،جب دیکھتے کہ نبی کریم ﷺ تشریف لا رہے ہیں تو اقامت کہتے۔";
abudawood.hukam = "صحیح مسلم (606)";
abudawood.description = ``;