var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،حَدَّثَنَا سُفْيَانُ،حَدَّثَنَا أَبُو يَحْيَى الْقَتَّاتُ،عَنْ مُجَاهِدٍ،قَالَ: كُنْتُ مَعَ ابْنِ عُمَرَ،فَثَوَّبَ رَجُلٌ فِي الظُّهْرِ أَوِ الْعَصْرِ،قَالَ: اخْرُجْ بِنَا, فَإِنَّ هَذِهِ بِدْعَةٌ .";
abudawood.urdu = "جناب مجاہد کہتے ہیں کہ میں (ایک بار) سیدنا ابن عمر رضی اللہ عنہما کے ساتھ تھا کہ ایک شخص نے ظہر یا عصر میں تثویب کی (یعنی اذان کے بعد دوبارہ اعلان کیا) تو انہوں نے فرمایا مجھے یہاں سے لے چلو،بیشک یہ بدعت ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `قال أحمد بن حنبل في أبي یحیی القتات: ’’ واما حدیث سفیان عن عنہ فمقاربۃ‘‘ (الضعفاء الکبیر للعقیلی: 2/ 330، سندہ صحیح/ معاذ علي زئي)`;