var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى،حَدَّثَنَا عِيسَى،عَنْ مَعْمَرٍ،عَنْ يَحْيَى بِإِسْنَادِهِ مِثْلَهُ... قَالَ: حَتَّى تَرَوْنِي قَدْ خَرَجْتُ.\nقَالَ أَبو دَاود: لَمْ يَذْكُرْ قَدْ خَرَجْتُ إِلَّا مَعْمَرٌ وَرَوَاهُ ابْنُ عُيَيْنَةَ،عَنْ مَعْمَرٍ لَمْ يَقُلْ فِيهِ قَدْ خَرَجْتُ.";
abudawood.urdu = "یحییٰ نے اپنی سند سے مذکورہ بالا حدیث کے مثل روایت کیا کہا کہ ’’(اس وقت تک کھڑے نہ ہو) حتیٰ کہ مجھے دیکھ لو کہ میں گھر میں سے نکل آیا ہوں۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا کہ «قد خرجت» کے لفظ صرف معمر نے روایت کیے ہیں۔ابن عیینہ نے معمر سے روایت کیا تو اس میں «قد خرجت» کے لفظ بیان نہیں کیے۔";
abudawood.hukam = "صحیح بخاری (637) صحیح مسلم (604)";
abudawood.description = ``;