var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا الْوَلِيدُ،قَالَ: قَالَ أَبُو عَمْرٍو ح،وحَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ،حَدَّثَنَا الْوَلِيدُ وَهَذَا لَفْظُهُ عَنِ الْأَوْزَاعِيِّ عَنِ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ الصَّلَاةَ كَانَتْ تُقَامُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَيَأْخُذُ النَّاسُ مَقَامَهُمْ قَبْلَ أَنْ يَأْخُذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ کے لیے نماز کی اقامت کہی جاتی اور لوگ نبی کریم ﷺ کے مصلے پر تشریف لانے سے پہلے ہی اپنی جگہیں لے چکے ہوتے تھے۔(یعنی صفیں برابر کر چکے ہوتے تھے)۔";
abudawood.hukam = "صحیح بخاری (640) صحیح مسلم (605)";
abudawood.description = ``;