var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عَبْدُ الْوَارِثِ،عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ،عَنْ أَنَسٍ،قَالَ: أُقِيمَتِ الصَّلَاةُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَجِيٌّ فِي جَانِبِ الْمَسْجِدِ،فَمَا قَامَ إِلَى الصَّلَاةِ حَتَّى نَامَ الْقَوْمُ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ نماز کے لیے اقامت کہ دی گئی اور رسول اللہ ﷺ مسجد کی ایک جانب میں (کسی کے ساتھ) سرگوشی میں مشغول رہے اور نماز کے لیے آئے تو لوگوں کو نیند آ رہی تھی۔";
abudawood.hukam = "صحیح بخاری (642) صحیح مسلم (376)";
abudawood.description = ``;