var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِسْحَاقَ الْجَوْهَرِيُّ،أَخْبَرَنَا أَبُو عَاصِمٍ عَنِ ابْنِ جُرَيْجٍ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ سَالِمٍ أَبِي النَّضْرِ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُقَامُ الصَّلَاةُ فِي الْمَسْجِدِ إِذَا رَآهُمْ قَلِيلًا جَلَسَ لَمْ يُصَلِّ،وَإِذَا رَآهُمْ جَمَاعَةً صَلَّى.";
abudawood.urdu = "سالم ابوالنصر (تابعی) کہتے ہیں کہ رسول اللہ ﷺ اقامت کہے جانے کے بعد مسجد میں حاضرین کو کم محسوس کرتے تو بیٹھ جاتے اور نماز نہ پڑھاتے اور جب دیکھتے کہ جمع ہو گئے ہیں،تو نماز پڑھا دیتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن جریج عنعن<br>و السند مرسل<br>وانظر الحدیث الآتي (546)`;
abudawood.anwaar = [33,1];