var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِسْحَاقَ،أَخْبَرَنَا أَبُو عَاصِمٍ عَنِ ابْنِ جُرَيْجٍ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ نَافِعِ بْنِ جُبَيْرٍ،عَنْ أَبِي مَسْعُودٍ الزُّرَقِيِّ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِي اللَّهُ عَنْهُ مِثْلَ ذَلِكَ.";
abudawood.urdu = "نافع بن جبیر،ابومسعود زرقی سے وہ سیدنا علی بن ابی طالب رضی اللہ عنہ سے اسی مثل روایت کرتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن جریج صرح بالسماع عند البیھقي (20/2) ولکن فی السند إلیہ عبد المجید بن عبد العزیز بن أبي رواد مدلس وعنعن(راجع الفتح المبین ص 55)<br>وانظر الحدیث السابق (545)`;
abudawood.anwaar = [33,1];