var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي سَهْلٍ يَعْنِي عُثْمَانَ بْنَ حَكِيمٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ،عَنْ عُثْمَانَ بْنِ عَفَّانَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ, كَانَ كَقِيَامِ نِصْفِ لَيْلَةٍ،وَمَنْ صَلَّى الْعِشَاءَ وَالْفَجْرَ فِي جَمَاعَةٍ, كَانَ كَقِيَامِ لَيْلَةٍ.";
abudawood.urdu = "سیدنا عثمان بن عفان رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے عشاء کی نماز جماعت سے پڑھی تو یہ آدھی رات کے قیام کی طرح ہے اور جس نے عشاء اور فجر کی نمازیں باجماعت پڑھیں تو یہ پوری رات کے قیام کی طرح ہے۔“";
abudawood.hukam = "صحیح مسلم (656)";
abudawood.description = ``;