var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ أَبِي ذِئْبٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: الْأَبْعَدُ فَالْأَبْعَدُ مِنَ الْمَسْجِدِ أَعْظَمُ أَجْرًا.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جو شخص جتنا مسجد سے دور ہوتا ہے اتنا ہی زیادہ ثواب کا حقدار ہوتا ہے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ أحمد (1/68 وسندہ حسن) ولہ شاھد في صحیح مسلم (662)`;