var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ،عَنْ زُرَارَةَ بْنِ أَوْفَى،عَنْ سَعْدِ بْنِ هِشَامٍ،عَنْ عَائِشَةَ،«أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوضَعُ لَهُ وَضُوءُهُ وَسِوَاكُهُ،فَإِذَا قَامَ مِنَ اللَّيْلِ تَخَلَّى ثُمَّ اسْتَاكَ»";
abudawood.urdu = "ام المومنین سیدہ عائشہ رضی اللہ عنھا بیان کرتی ہیں:کہ(رات کو)نبی اکرمﷺکے لیےوسواک اور وضو کا پانی تیار رکھا جاتا تھا‘چناچہ جب حضورنبی کریمﷺرات کو اٹھتے تو پہلےقضائے حاجت کرتے اورپھرمسواک کیا کرتے تھے";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `انفرد بہ ابو داود`;