var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ،حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ،حَدَّثَنَا إِسْمَاعِيلُ أَبُو سُلَيْمَانَ الْكَحَّالُ،عَنْ عَبْدِ اللَّهِ بْنِ أَوْسٍ،عَنْ بُرَيْدَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: بَشِّرِ الْمَشَّائِينَ فِي الظُّلَمِ إِلَى الْمَسَاجِدِ بِالنُّورِ التَّامِّ يَوْمَ الْقِيَامَةِ.";
abudawood.urdu = "سیدنا بریدہ رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’خوشخبری دو۔قیامت کے روز کامل نور کی،ان لوگوں کو جو اندھیروں میں مسجدوں کی طرف چل چل کے آتے ہیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (721)
ولہ شاھد عند ابن خزیمۃ (1499) وسندہ حسن`;