var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ،وَلَكِنْ لِيَخْرُجْنَ وَهُنَّ تَفِلَاتٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’اللہ کی بندیوں کو اللہ کی مسجدوں سے مت روکو،لیکن انہیں چاہیئے کہ زیب و زینت کے بغیر نکلیں۔‘‘ (یعنی سادہ کیفیت میں آئیں)۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `صححہ ابن خزیمۃ (1679 وسندہ حسن)`;