var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا الْعَوَّامُ بْنُ حَوْشَبٍ،حَدَّثَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَمْنَعُوا نِسَاءَكُمُ الْمَسَاجِدَ،وَبُيُوتُهُنَّ خَيْرٌ لَهُنَّ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’اپنی عورتوں کو مساجد سے مت روکو،مگر ان کے گھر ان کے لیے بہتر ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `سندہ ضعیف<br>حبیب بن أبي ثابت مدلس و عنعن<br>و للحدیث شواہد ضعیفۃ عند البیہقي (3/ 131) وغیرہ`;
abudawood.anwaar = [185,1];