var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا هَمَّامٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أُمِّ مُحَمَّدٍ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْقُدُ مِنْ لَيْلٍ وَلَا نَهَارٍ فَيَسْتَيْقِظُ إِلَّا تَسَوَّكَ قَبْلَ أَنْ يَتَوَضَّأَ";
abudawood.urdu = "ام المومنین سیدہ عائشہ رضی اللہ عنہا سےمروی ہے:نبی ﷺ دن یارات میں جب بھی سوکر اٹھتے تووضوسےپہلے مسواک کیاکرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>علي بن زید بن جدعان ضعیف (تقدم: 54) والجمھور علی تضعیفہ<br>وأم محمد لم أجد من وثقھاوھي مجہولۃ<br>وانظر الحدیث الآتي (4898)`;
abudawood.anwaar = [15,1];