var abudawood = {};
abudawood.arabic = "َدَّثَنَا ابْنُ الْمُثَنَّى أَنَّ عَمْرَو بْنَ عَاصِمٍ حَدَّثَهُمْ،قَالَ:،حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ،عَنْ مُوَرِّقٍ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: صَلَاةُ الْمَرْأَةِ فِي بَيْتِهَا أَفْضَلُ مِنْ صَلَاتِهَا فِي حُجْرَتِهَا،وَصَلَاتُهَا فِي مَخْدَعِهَا أَفْضَلُ مِنْ صَلَاتِهَا فِي بَيْتِهَا.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ وہ نبی کریم ﷺ سے راوی ہیں کہ آپ ﷺ نے فرمایا ’’عورت کی نماز اس کے اپنے گھر میں صحن کے بجائے کمرے کے اندر زیادہ افضل ہے،بلکہ کمرے کی بجائے (اندرونی) کوٹھری میں زیادہ افضل ہے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن<br>ولأصل الحدیث شواھد کثیرۃ`;
abudawood.anwaar = [34,1];