var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا وُهَيْبٌ،عَنْ سُلَيْمَانَ الْأَسْوَدِ،عَنْ أَبِي الْمُتَوَكِّلِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ أَبْصَرَ رَجُلًا يُصَلِّي وَحْدَهُ،فَقَالَ: أَلَا رَجُلٌ يَتَصَدَّقُ عَلَى هَذَا فَيُصَلِّيَ مَعَهُ!.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے دیکھا،ایک آدمی اکیلے ہی نماز پڑھ رہا ہے تو آپ ﷺ نے فرمایا ’’کیا کوئی آدمی اس پر صدقہ نہیں کر سکتا کہ اس کے ساتھ مل کر نماز پڑھے؟‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1146)
صححہ ابن خزیمۃ (1632 وسندہ صحیح)`;