var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا شُعْبَةُ،عَنْ يَعْلَى بْنِ عَطَاءٍ،عَنْ جَابِرِ بْنِ يَزِيدَ،عَنْ أَبِيهِ قَالَ: صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ بِمِنًى... بِمَعْنَاهُ.";
abudawood.urdu = "جناب جابر بن یزید اپنے والد سے روایت کرتے ہیں وہ کہتے ہیں کہ میں نے نبی کریم ﷺ کے ساتھ منٰی میں فجر کی نماز پڑھی۔اور اوپر والی حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `صححہ ابن خزیمۃ (1279 وسندہ صحیح)`;