var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،حَدَّثَنَا حُسَيْنٌ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ-يَعْنِي: مَوْلَى مَيْمُونَةَ-،قَالَ: أَتَيْتُ ابْنَ عُمَرَ عَلَى الْبَلَاطِ وَهُمْ يُصَلُّونَ،فَقُلْتُ: أَلَا تُصَلِّي مَعَهُمْ؟ قَالَ: قَدْ صَلَّيْتُ،إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, يَقُولُ: لَا تُصَلُّوا صَلَاةً فِي يَوْمٍ مَرَّتَيْنِ.";
abudawood.urdu = "سلیمان یعنی مولیٰ میمونہ کہتے ہیں کہ میں سیدنا ابن عمر رضی اللہ عنہما کے پاس ان کی بیٹھک پر آیا،وہاں لوگ نماز پڑھ رہے تھے (اور ابن عمر رضی اللہ عنہما نماز میں شریک نہ تھے) میں نے ان سے کہا: کیا آپ ان کے ساتھ نماز نہیں پڑھتے؟ انہوں نے کہا کہ میں پڑھ چکا ہوں۔میں رسول اللہ ﷺ سے سن چکا ہوں آپ ﷺ فرماتے تھے ’’ایک نماز کو ایک دن میں دو بار مت پڑھو۔“";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1157)
صححہ ابن خزیمۃ (1641 وسندہ صحیح)`;