var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ،حَدَّثَنَا ابْنُ وَهْبٍ،أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ،عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّ،قَالَ: سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول:ُ مَنْ أَمَّ النَّاسَ فَأَصَابَ الْوَقْتَ فَلَهُ وَلَهُمْ،وَمَنِ انْتَقَصَ مِنْ ذَلِكَ شَيْئًا فَعَلَيْهِ وَلَا عَلَيْهِمْ.";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ سے سنا فرماتے تھے ’’جو شخص لوگوں کی امامت کرائے اور بروقت کرائے تو یہ اس کے لیے،اور نمازیوں کے لیے باعث اجر ہے اور جس نے اس میں کوئی کمی کی تو اس کا گناہ امام پر ہے نمازیوں پر نہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;