var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ،حَدَّثَنَا مَرْوَانُ حَدَّثَتْنِي طَلْحَةُ أُمُّ غُرَابٍ،عَنْ عَقِيلَةَ امْرَأَةٍ مِنْ بَنِي فَزَارَةَ مَوْلَاةٍ لَهُمْ،عَنْ سَلَامَةَ بِنْتِ الْحُرِّ-أُخْتِ خَرَشَةَ بْنِ الْحُرِّ الْفَزَارِيِّ-،قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول:ُ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَتَدَافَعَ أَهْلُ الْمَسْجِدِ لَا يَجِدُونَ إِمَامًا يُصَلِّي بِهِمْ.";
abudawood.urdu = "طلحہ ام غراب،عقیلہ سے جو کہ بنی فزارہ کی ایک خاتون تھی اور ان کی آزاد کردہ لونڈی تھی،وہ سلامہ بنت حر سے جو خرشہ بن حر فزاری کی بہن تھی،بیان کرتی ہیں کہ میں نے رسول اللہ ﷺ کو سنا آپ ﷺ فرما رہے تھے ’’(قرب) قیامت کی علامات میں سے (یہ بھی) ہے کہ اہل مسجد امامت کو ایک دوسرے پر ٹالیں گے اور کسی کو نہیں پائیں گے جو ان کی امامت کرائے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (982)<br>أم غراب وعقیلۃ لا یعرف حالھما (تقریب 8631،8642)`;
abudawood.anwaar = [34,1];