var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ مُعَاذٍ،حَدَّثَنَا أَبِي،حَدَّثَنَا شُعْبَةُ بِهَذَا الْحَدِيثِ... قَالَ: فِيهِ ... وَلَا يَؤُمُّ الرَّجُلُ الرَّجُلَ فِي سُلْطَانِهِ.\nقَالَ أَبو دَاود: وَكَذَا قَالَ يَحْيَى الْقَطَّانُ،عَنْ شُعْبَةَ: أَقْدَمُهُمْ قِرَاءَةً.";
abudawood.urdu = "جناب ابن معاذ راوی ہیں کہ میرے والد نے شعبہ سے یہ حدیث بیان کی اس میں انہوں نے کہا ’’کوئی آدمی دوسرے کی حکومت (سربراہی) کی جگہ میں امامت نہ کرائے۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا اور اسی طرح یحییٰ القطان نے شعبہ سے «أقدمہم قراءۃ» روایت کیا ہے۔(یعنی قرآت میں پرانا ہو)۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;