var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ،عَنْ عَمْرِو بْنِ سَلَمَةَ بِهَذَا الْخَبَرِ, قَالَ: فَكُنْتُ أَؤُمُّهُمْ فِي بُرْدَةٍ مُوَصَّلَةٍ فِيهَا فَتْقٌ،فَكُنْتُ إِذَا سَجَدْتُ خَرَجَتِ اسْتِي.";
abudawood.urdu = "جناب عاصم احول،سیدنا عمرو بن سلمہ رضی اللہ عنہ سے یہی حدیث روایت کرتے ہیں اس میں ہے کہ میں ان کی امامت کراتا اور مجھ پر ایک پیوند لگی چادر ہوتی تھی جس میں ایک سوراخ تھا۔جب میں سجدے میں جاتا تو میری مقعد اس سے ننگی ہو جاتی تھی۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;