var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقْبَلُ اللَّهُ عَزَّ وَجَلَّ صَدَقَةً مِنْ غُلُولٍ وَلَا صَلَاةً بِغَيْرِ طُهُورٍ";
abudawood.urdu = "ابویلیح اپنے والد (سیدنا اسامہ بن عمیر ہذلی رضی اللہ عنہ) سے روایت کرتے ہیں کہ نبی کریم ﷺ نے فرمایا ’’اللہ تعالیٰ خیانت کے مال سے کوئی صدقہ قبول نہیں فرماتا اور نہ کوئی نماز وضو کے بغیر قبول کرتا ہے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `وروایۃ شعبۃ عن قتادۃ محمولۃ علی السماع`;