var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا حُسَيْنُ بْنُ عِيسَى الْحَنَفِيُّ،حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ،عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لِيُؤَذِّنْ لَكُمْ خِيَارُكُمْ،وَلْيَؤُمَّكُمْ قُرَّاؤُكُمْ.";
abudawood.urdu = "جناب عکرمہ نے سیدنا ابن عباس رضی اللہ عنہما سے روایت کیا انہوں نے کہا کہرسول اللہ ﷺ نے فرمایا ’’چاہیئے کہ تمہارے بھلے اور عمدہ لوگ اذان کہیں اور تمہارے قراء (حافظ و عالم) امامت کرائیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (726)<br>حسین بن عیسی الحنفي : ضعیف (تقریب:1341) وقال الھیثمي : وضعفہ الجمھور (مجمع الزوائد 10/ 55)`;
abudawood.anwaar = [34,1];