var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ،حَدَّثَنَا ابْنُ وَهْبٍ،حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ عَنِ الْعَلَاءِ بْنِ الْحَارِثِ،عَنْ مَكْحُولٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الصَّلَاةُ الْمَكْتُوبَةُ وَاجِبَةٌ خَلْفَ كُلِّ مُسْلِمٍ،بَرًّا كَانَ،أَوْ فَاجِرًا،وَإِنْ عَمِلَ الْكَبَائِرَ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’فرض نماز ہر مسلمان کے پیچھے واجب ہے خواہ نیک ہو یا بد،اگرچہ وہ کبائر کا مرتکب ہو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>مکحول لم یسمع من أبي ہریرۃ رضي اللّٰہ عنہ کما سیأتي(2533)`;
abudawood.anwaar = [34,2];