var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَنْبَرِيُّ أَبُو عَبْدِ اللَّهِ،حَدَّثَنَا ابْنُ مَهْدِيٍّ،حَدَّثَنَا عِمْرَانُ الْقَطَّانُ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَخْلَفَ ابْنَ أُمِّ مَكْتُومٍ،يَؤُمُّ النَّاسَ وَهُوَ أَعْمَى.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے (اپنے سفر غزوہ کے موقع پر) سیدنا عبداللہ ابن ام مکتوم رضی اللہ عنہ کو اپنا جانشین بنایا تھا اور یہی لوگوں کو امامت کراتے تھے اور یہ نابینا تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1121)
ولہ شاھد عند ابن حبان (370 وسندہ صحیح)`;