var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَأَحْمَدُ بْنُ الْفُرَاتِ أَبُو مَسْعُودٍ الرَّازِيُّ الْمَعْنَى،قَالَا: حَدَّثَنَا يَعْلَى،حَدَّثَنَا الْأَعْمَشُ،عَنْ إِبْرَاهِيمَ،عَنْ هَمَّامٍ،أَنَّ حُذَيْفَةَ أَمَّ النَّاسَ بِالْمَدَائِنِ عَلَى دُكَّانٍ،فَأَخَذَ أَبُو مَسْعُودٍ بِقَمِيصِهِ،فَجَبَذَهُ،فَلَمَّا فَرَغَ مِنْ صَلَاتِهِ،قَالَ: أَلَمْ تَعْلَمْ أَنَّهُمْ كَانُوا يُنْهَوْنَ عَنْ ذَلِكَ؟ قَالَ: بَلَى،قَدْ ذَكَرْتُ حِينَ مَدَدْتَنِي.";
abudawood.urdu = "جناب ہمام سے روایت ہے کہ سیدنا حذیفہ رضی اللہ عنہ مدائن میں ایک چبوترے پر کھڑے ہو کر لوگوں کی امامت کرا رہے تھے کہ سیدنا ابومسعود رضی اللہ عنہ نے ان کو قمیص سے پکڑ کر کھینچ لیا۔جب وہ نماز سے فارغ ہوئے تو کہا: کیا تمہیں معلوم نہیں کہ لوگوں کو اس سے منع کیا جاتا تھا۔انہوں نے جواب دیا: کیوں نہیں،جب آپ نے مجھے کھینچا تو مجھے بھی یاد آ گیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الأ عمش عنعن`;
abudawood.anwaar = [35,1];