var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ مُحَمَّدِ بْنِ عَجْلَانَ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنَّ مُعَاذَ بْنَ جَبَلٍ: كَانَ يُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ،ثُمَّ يَأْتِي قَوْمَهُ فَيُصَلِّي بِهِمْ تِلْكَ الصَّلَاةَ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ سیدنا معاذ بن جبل رضی اللہ عنہ رسول اللہ ﷺ کے ساتھ عشاء کی نماز پڑھا کرتے تھے۔پھر اپنی قوم کے پاس آتے اور انہیں وہی نماز پڑھاتے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;