var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ النَّضِرِ بْنِ أَنَسٍ عَنْ زَيْدِ بْنِ أَرْقَمَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ هَذِهِ الْحُشُوشَ مُحْتَضَرَةٌ فَإِذَا أَتَى أَحَدُكُمْ الْخَلَاءَ فَلْيَقُلْ أَعُوذُ بِاللَّهِ مِنْ الْخُبُثِ وَالْخَبَائِثِ";
abudawood.urdu = "سیدنا زید بن ارقم رضی اللہ عنہ رسول اللہ ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا: ’’یہ بیت الخلاء جنوں اور شیطانوں کے آنے جانے کی جگہیں ہیں،لہٰذا تم میں سے جب کوئی بیت الخلاء جانا چاہے تو یہ کلمات کہہ لیا کرے: «أعوذ باللہ من الخبث والخبائث» میں خبیث جنوں اور جنیوں (کے شر) سے اللہ کی پناہ میں آتا ہوں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (357)`;