var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ،عَنْ عَمْرِو بْنِ دِينَارٍ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ: إِنَّ مُعَاذًا كَانَ: يُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،ثُمَّ يَرْجِعُ فَيَؤُمُّ قَوْمَهُ.";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ سیدنا معاذ رضی اللہ عنہ نبی کریم ﷺ کے ساتھ نماز پڑھتے اور پھر واپس جا کر اپنی قوم کو امامت کراتے۔";
abudawood.hukam = "صحیح بخاری (700، 701) صحیح مسلم (465)";
abudawood.description = ``;