var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ ابْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الْمَعْنَى أَنَّ اللَّيْثَ حَدَّثَهُمْ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ: اشْتَكَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ،وَأَبُو بَكْرٍ يُكَبِّرُ،لِيُسْمِعَ النَّاسَ تَكْبِيرَهُ.... ثُمَّ سَاقَ الْحَدِيثَ.";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ بیمار ہو گئے تو ہم نے آپ ﷺ کے پیچھے نماز پڑھی جبکہ آپ ﷺ بیٹھے ہوئے تھے اور سیدنا ابوبکر رضی اللہ عنہ تکبیر کہتے تھے تاکہ لوگوں کو آپ ﷺ کی تکبیر سنوائیں۔پھر حدیث بیان کی۔";
abudawood.hukam = "صحیح مسلم (413)";
abudawood.description = ``;