var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ،عَنْ مُوسَى بْنِ أَنَسٍ يُحَدِّثُ،عَنْ أَنَسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّهُ وَامْرَأَةً مِنْهُمْ،فَجَعَلَهُ عَنْ يَمِينِهِ،وَالْمَرْأَةَ خَلْفَ ذَلِكَ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے ان کی اور ان میں سے ایک خاتون کی امامت کرائی تھی۔پس آپ نے انس رضی اللہ عنہ کو اپنی دائیں جانب اور عورت کو پیچھے کھڑا کیا تھا۔";
abudawood.hukam = "صحیح مسلم (660)";
abudawood.description = ``;