var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ ابْنِ عَقِيلٍ عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِفْتَاحُ الصَّلَاةِ الطُّهُورُ وَتَحْرِيمُهَا التَّكْبِيرُ وَتَحْلِيلُهَا التَّسْلِيمُ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’نماز کی کنجی وضو ہے،اس کی تحریم «اللہ اکبر» کہنا اور اس کی تحلیل «السلام علیکم» کہنا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (312)
ابن عقیل ضعفہ الجمھور  وللحدیث شواھد کثیرۃ منھا قول ابن مسعود رضی اللہ عنہ، رواہ البیہقی (2/ 16) وسندہ صحیح ولہ حکم المرفوع، فالحدیث حسن`;