var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ،أَخْبَرَنَا هُشَيْمٌ،عَنْ أَبِي بِشْرٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ, فِي هَذِهِ الْقِصَّةِ،قَالَ: فَأَخَذَ بِرَأْسِي،أَوْ بِذُؤَابَتِي،فَأَقَامَنِي عَنْ يَمِينِهِ.";
abudawood.urdu = "جناب سعید بن جبیر،سیدنا ابن عباس رضی اللہ عنہما سے اس قصے میں بیان کرتے ہیں کہ آپ ﷺ نے مجھے میرے سر سے پکڑا یا میرے بال پکڑے اور مجھے اپنی دائیں جانب کھڑا کر لیا۔";
abudawood.hukam = "صحیح بخاری (5919 من حدیث ھشیم بہ وصرح بالسماع)";
abudawood.description = ``;