var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي يَعْلَى بْنُ عَطَاءٍ عَنْ جَابِرِ بْنِ يَزِيدَ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ قَالَ صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا انْصَرَفَ انْحَرَفَ";
abudawood.urdu = "جناب جابر بن یزید بن اسود اپنے والد سے نقل کرتے ہیں،کہا کہ میں نے رسول اللہ ﷺ کے پیچھے نماز پڑھی تو (دیکھا کہ) آپ ﷺ جب نماز سے فارغ ہوتے تو قبلے کی طرف سے (مقتدیوں کی طرف) پھر جایا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;