var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا مِسْعَرٌ عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنْ عُبَيْدِ بْنِ الْبَرَاءِ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْبَبْنَا أَنْ نَكُونَ عَنْ يَمِينِهِ فَيُقْبِلُ عَلَيْنَا بِوَجْهِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "۔سیدنا براء بن عازب رضی اللہ عنہ سے مروی ہے کہ ہم جب رسول اللہ ﷺ کے پیچھے نماز پڑھتے تو پسند کرتے کہ آپ ﷺ کی دائیں جانب کھڑے ہوں کہ آپ (بعد از سلام) ہماری طرف رخ کریں گے۔";
abudawood.hukam = "صحیح مسلم (709)";
abudawood.description = ``;