var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الْمَلِكِ الْقُرَشِيُّ حَدَّثَنَا عَطَاءٌ الْخُرَاسَانِيُّ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّ الْإِمَامُ فِي الْمَوْضِعِ الَّذِي صَلَّى فِيهِ حَتَّى يَتَحَوَّلَ قَالَ أَبُو دَاوُد عَطَاءٌ الْخُرَاسَانِيُّ لَمْ يُدْرِكْ الْمُغِيرَةَ بْنَ شُعْبَةَ";
abudawood.urdu = "عطاء خراسانی،سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’امام نے جس جگہ نماز پڑھائی ہو،اسی جگہ (سنت یا نفل) نہ پڑھے،حتیٰ کہ وہاں سے ہٹ جائے۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ عطاء خراسانی نے مغیرہ بن شعبہ رضی اللہ عنہ کو نہیں پایا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1428)<br>سندہ مرسل،عطاء الخراساني لم یدرک المغیرۃ بن شعبۃ قالہ أبو داود`;
abudawood.anwaar = [35,1];