var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ وَبَكْرِ بْنِ سَوَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَضَى الْإِمَامُ الصَّلَاةَ وَقَعَدَ فَأَحْدَثَ قَبْلَ أَنْ يَتَكَلَّمَ فَقَدْ تَمَّتْ صَلَاتُهُ وَمَنْ كَانَ خَلْفَهُ مِمَّنْ أَتَمَّ الصَّلَاةَ";
abudawood.urdu = "۔سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’امام نے جب نماز پوری کر لی ہو اور (آخری) قعدہ میں بیٹھ گیا ہو اور کلام کرنے (یعنی سلام پھیرنے) سے پہلے ہی بے وضو ہو جائے تو اس کی نماز ہو گئی اور اس کے مقتدیوں کی بھی جنہوں نے نماز پوری پڑھی ہو،نماز کامل ہو گی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (408)<br>الإ فریقي : ضعیف`;
abudawood.anwaar = [35,1];