var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ يَخْطُبُ النَّاسَ قَالَ حَدَّثَنَا الْبَرَاءُ وَهُوَ غَيْرُ كَذُوبٍ أَنَّهُمْ كَانُوا إِذَا رَفَعُوا رُءُوسَهُمْ مِنْ الرُّكُوعِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامُوا قِيَامًا فَإِذَا رَأَوْهُ قَدْ سَجَدَ سَجَدُوا";
abudawood.urdu = "جناب عبداللہ بن یزید خطمی لوگوں کو خطبہ دے رہے تھے۔انہوں نے کہا کہ ہمیں سیدنا براء رضی اللہ عنہ نے بیان کیا۔اور وہ جھوٹے نہیں تھے۔کہ صحابہ کرام رضی اللہ عنہم جب رسول اللہ ﷺ کے ساتھ رکوع سے سر اٹھاتے تو کھڑے رہتے۔جب دیکھتے کہ آپ سجدے میں چلے گئے ہیں تب سجدے کے لیے جھکتے۔";
abudawood.hukam = "صحیح بخاری (747) صحیح مسلم (474)";
abudawood.description = ``;