var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَهَارُونُ بْنُ مَعْرُوفٍ الْمَعْنَى قَالَا حَدَّثَنَا سُفْيَانُ عَنْ أَبَانَ بْنِ تَغْلِبَ قَالَ زُهَيْرٌ حَدَّثَنَا الْكُوفِيُّونَ أَبَانُ وَغَيْرُهُ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا يَحْنُو أَحَدٌ مِنَّا ظَهْرَهُ حَتَّى يَرَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ";
abudawood.urdu = "جناب عبدالرحمٰن بن ابی لیلیٰ،سیدنا براء رضی اللہ عنہ سے بیان کرتے ہیں کہ ہم نبی کریم ﷺ کے ساتھ نماز پڑھا کرتے تھے اور ہم میں سے کوئی اپنی پیٹھ نہ جھکاتا تھا جب تک کہ نبی کریم ﷺ کو نہ دیکھ لیتا کہ انہوں نے اپنی پیشانی زمین پر رکھ دی ہے۔";
abudawood.hukam = "صحیح مسلم (474)";
abudawood.description = ``;