var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا يَخْشَى أَوْ أَلَا يَخْشَى أَحَدُكُمْ إِذَا رَفَعَ رَأْسَهُ وَالْإِمَامُ سَاجِدٌ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ أَوْ صُورَتَهُ صُورَةَ حِمَارٍ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جو شخص (امام سے پہلے) اپنا سر اٹھاتا ہے جبکہ وہ امام سجدے میں ہو،اسے ڈرنا چاہیئے کہ کہیں اللہ تعالیٰ اس کا سر گدھے کے سر جیسا نہ بنا دے یا اس کی شکل گدھے کی شکل نہ بنا دے۔‘‘";
abudawood.hukam = "صحیح مسلم (427)";
abudawood.description = ``;