var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصُ بْنُ بُغَيْلٍ الْمُرْهِبِيُّ حَدَّثَنَا زَائِدَةُ عَنْ الْمُخْتَارِ بْنِ فُلْفُلٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَضَّهُمْ عَلَى الصَّلَاةِ وَنَهَاهُمْ أَنْ يَنْصَرِفُوا قَبْلَ انْصِرَافِهِ مِنْ الصَّلَاةِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے منقول ہے کہ نبی کریم ﷺ نے صحابہ کرام رضی اللہ عنہم کو نماز کی ترغیب دی ور انہیں منع فرمایا کہ آپ کے اٹھ کر جانے سے پہلے اٹھ کر جائیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (954)
ورواہ أحمد (3/240 وسندہ صحیح) والبیھقي (2/192)`;