var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الصَّلَاةِ فِي ثَوْبٍ وَاحِدٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَلِكُلِّكُمْ ثَوْبَانِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ سے ایک کپڑے میں نماز کے متعلق پوچھا گیا تو آپ ﷺ نے فرمایا ’’کیا تم میں سے ہر ایک کے پاس دو دو کپڑے ہیں؟‘‘";
abudawood.hukam = "صحیح بخاری (358) صحیح مسلم (515)";
abudawood.description = ``;