var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّ أَحَدُكُمْ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى مَنْكِبَيْهِ مِنْهُ شَيْءٌ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے کوئی شخص ایک کپڑے میں نماز نہ پڑھے اس حال میں کہ اس میں سے کچھ اس کے کندھوں پر نہ ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (516)";
abudawood.description = ``;