var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ الْمَعْنَى عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ فِي ثَوْبٍ فَلْيُخَالِفْ بِطَرَفَيْهِ عَلَى عَاتِقَيْهِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی ایک کپڑے میں نماز پڑھے تو اس چادر کے دونوں پلوؤں میں سے دائیں پلو کو بائیں کندھے پر اور بائیں پلو کو داہنے کندھے پر ڈال لے۔‘‘";
abudawood.hukam = "صحیح بخاری (360)";
abudawood.description = ``;