var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُلْتَحِفًا مُخَالِفًا بَيْنَ طَرَفَيْهِ عَلَى مَنْكِبَيْهِ";
abudawood.urdu = "سیدنا عمر بن ابی سلمہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ایک کپڑا لپیٹے نماز پڑھ رہے تھے اور آپ نے اس کے دونوں پلوؤں (کناروں) کو ایک دوسرے کی مخالف سمت سے اپنے کندھوں پر ڈالا ہوا تھا۔";
abudawood.hukam = "صحیح مسلم (517)";
abudawood.description = ``;