var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ مُوسَى بْنِ إِبْرَاهِيمَ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَصِيدُ أَفَأُصَلِّي فِي الْقَمِيصِ الْوَاحِدِ قَالَ نَعَمْ وَازْرُرْهُ وَلَوْ بِشَوْكَةٍ";
abudawood.urdu = "سیدنا سلمہ بن اکوع رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اے اللہ کے رسول! میں شکاری آدمی ہوں۔کیا میں صرف ایک قمیض میں نماز پڑھ لیا کروں؟ آپ ﷺ نے فرمایا ’’ہاں اور اسے بٹن لگا لیا کرو خواہ کانٹے ہی کے ہوں۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (760)
صححہ ابن خزیمۃ (777، 778 وسندہ حسن) موسیٰ بن إبراھیم صرح بالسماع عند أحمد (4/49)`;