var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ قَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ إِذَا كَانَ لِأَحَدِكُمْ ثَوْبَانِ فَلْيُصَلِّ فِيهِمَا فَإِنْ لَمْ يَكُنْ إِلَّا ثَوْبٌ وَاحِدٌ فَلْيَتَّزِرْ بِهِ وَلَا يَشْتَمِلْ اشْتِمَالَ الْيَهُودِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا،یا یہ کہا کہ سیدنا عمر رضی اللہ عنہ نے کہا ’’جب تم میں سے کسی کے پاس دو کپڑے ہوں تو ان میں نماز پڑھے۔اگر ایک ہی ہو تو اسے تہبند بنا لے اور یہودیوں کی طرح نہ لپیٹے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (771)`;