var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ الذُّهْلِيُّ حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو تُمَيْلَةَ يَحْيَى بْنُ وَاضِحٍ حَدَّثَنَا أَبُو الْمُنِيبِ عُبَيْدُ اللَّهِ الْعَتَكِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلِّيَ فِي لِحَافٍ لَا يَتَوَشَّحُ بِهِ وَالْآخَرُ أَنْ تُصَلِّيَ فِي سَرَاوِيلَ وَلَيْسَ عَلَيْكَ رِدَاءٌ";
abudawood.urdu = "جناب عبداللہ بن بریدہ اپنے والد (سیدنا بریدہ رضی اللہ عنہ) سے بیان کرتے ہیں کہ رسول اللہ ﷺ نے منع فرمایا ہے کہ آدمی چادر میں ایسے نماز پڑھے کہ اسے لپیٹا نہ ہو۔دوسرے یہ کہ صرف پاجامے میں نماز پڑھے اور اس پر چادر نہ ہو۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ البیھقي (2/236 وسندہ صحیح)`;