var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ قُنْفُذٍ عَنْ أُمِّهِ أَنَّهَا سَأَلَتْ أُمَّ سَلَمَةَ مَاذَا تُصَلِّي فِيهِ الْمَرْأَةُ مِنْ الثِّيَابِ فَقَالَتْ تُصَلِّي فِي الْخِمَارِ وَالدِّرْعِ السَّابِغِ الَّذِي يُغَيِّبُ ظُهُورَ قَدَمَيْهَا";
abudawood.urdu = "ام المؤمنین سیدہ سلمہ رضی اللہ عنہا سے سوال کیا گیا کہ عورت کن کپڑوں میں نماز پڑھے؟ تو انہوں نے کہا ’’اوڑھنی اور پوری قمیص میں نماز پڑھے جو اس کے پاؤں تک کو ڈھانپ لے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أم محمد بن زید اختلف قول الذہبي فیھا ووثقھا الحاکم وحدہ فھي مجھولۃ الحال`;
abudawood.anwaar = [36,1];