var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ قَالَ أَبُو كَامِلٍ ابْنُ الزُّبَيْرِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْمَاءِ يَكُونُ فِي الْفَلَاةِ فَذَكَرَ مَعْنَاهُ";
abudawood.urdu = "جناب عبیداللہ بن عبداللہ بن عمر رضی اللہ عنہما اپنے والد (سیدنا عبداللہ بن عمر رضی اللہ عنہما) سے روایت کرتے ہیں کہ رسول اللہ ﷺ سے اس پانی کے بارے میں پوچھا گیا جو جنگل میں ہوتا ہے،تو انہوں نے گزشتہ حدیث کی مثل روایت کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (477)
وصححہ ابن خزیمۃ (92) وابن الجارود (45) ولہ علۃ غیر قادحۃ والحدیث السابق شاھد لہ وانظر الحدیث الآتی (65)`;