var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ صَفِيَّةَ بِنْتِ الْحَارِثِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَقْبَلُ اللَّهُ صَلَاةَ حَائِضٍ إِلَّا بِخِمَارٍ قَالَ أَبُو دَاوُد رَوَاهُ سَعِيدٌ يَعْنِي ابْنَ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’اللہ تعالیٰ کسی بالغ عورت کی نماز اوڑھنی کے بغیر قبول نہیں فرماتا۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: اس حدیث کو سعید یعنی ابن ابی عروبہ نے قتادہ سے انہوں نے حسن سے انہوں نے نبی کریم ﷺ سے روایت کیا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (762)
قتادۃ عنعن بل لم ینفرد  بہ، بل تابعہ أیوب السختیاني فی المعجم ابن الأعرابي (ح 1996)`;