var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَكْثَرُ مَا رَأَيْتُ عَطَاءً يُصَلِّي سَادِلًا قَالَ أَبُو دَاوُد وَهَذَا يُضَعِّفُ ذَلِكَ الْحَدِيثَ";
abudawood.urdu = "ابن جریج کہتے ہیں کہ میں نے جناب عطاء (عطاء ابن ابی رباح تابعی) کو بارہا دیکھا کہ وہ سدل کیے ہوئے نماز پڑھتے تھے۔امام ابوداؤد رحمہ اللہ نے کہا کہ عطاء کا یہ فعل (گویا) مذکورہ بالا حدیث (ابوہریرہ رضی اللہ عنہ) کو ضعیف ثابت کرتا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;