var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَشْعَثُ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي فِي شُعُرِنَا أَوْ لُحُفِنَا قَالَ عُبَيْدُ اللَّهِ شَكَّ أَبِي";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ ہمارے (یعنی ازواج مطہرات کے زیر استعمال) کپڑوں میں یا ہمارے لحافوں میں نماز نہ پڑھا کرتے تھے۔عبیداللہ نے کہا کہ «شعرنا أو لحفنا» کے الفاظ میں میرے والد کو شک ہوا ہے (اس لیے لفظ «أو» سے روایت کیا ہے)۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;