var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادِ بْنِ جَعْفَرٍ عَنْ ابْنِ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي يَوْمَ الْفَتْحِ وَوَضَعَ نَعْلَيْهِ عَنْ يَسَارِهِ";
abudawood.urdu = "سیدنا عبداللہ بن سائب رضی اللہ عنہ کہتے ہیں کہ میں نے نبی کریم ﷺ کو فتح مکہ والے دن دیکھا کہ آپ ﷺ نماز پڑھ رہے تھے اور آپ ﷺ کے جوتے آپ کی بائیں جانب رکھے ہوئے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;