var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَاصِمُ بْنُ الْمُنْذِرِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ حَدَّثَنِي أَبِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ الْمَاءُ قُلَّتَيْنِ فَإِنَّهُ لَا يَنْجُسُ قَالَ أَبُو دَاوُد حَمَّادُ بْنُ زَيْدٍ وَقَفَهُ عَنْ عَاصِمٍ";
abudawood.urdu = "جناب عبیداللہ بن عبداللہ بن عمر کہتے ہیں کہ مجھ سے میرے والد نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا: ’’پانی دو مٹکوں کے برابر ہو تو ناپاک نہیں ہوتا۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ حماد بن زید نے اسے عاصم سے موقوفاً روایت کیا ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (477)`;