var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنِي بَكْرُ بْنُ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا قَالَ فِيهِمَا خَبَثٌ قَالَ فِي الْمَوْضِعَيْنِ خَبَثٌ";
abudawood.urdu = "جناب بکر بن عبداللہ رحمہ اللہ نے نبی کریم ﷺ سے یہ مذکورہ حدیث بیان کی تو انہوں نے اس میں جہاں لفظ «قذر» آیا ہے وہاں دونوں جگہ «خبث» استعمال کیا۔(اور معنی ان سب کا ’’نجاست‘‘ ہے)۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السند مرسل<br>و الحدیث السابق (الأصل : 650) یغني عنہ`;
abudawood.anwaar = [36,1];