var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ عَنْ هِلَالِ بْنِ مَيْمُونٍ الرَّمْلِيِّ عَنْ يَعْلَى بْنِ شَدَّادِ بْنِ أَوْسٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالِفُوا الْيَهُودَ فَإِنَّهُمْ لَا يُصَلُّونَ فِي نِعَالِهِمْ وَلَا خِفَافِهِمْ";
abudawood.urdu = "سیدنا شداد بن اوس رضی اللہ عنہ سے روایت ہے انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’یہود کی مخالفت کرو۔یہ لوگ اپنے جوتوں یا موزوں میں نماز نہیں پڑھتے ہیں۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (765)
مروان بن معاویۃ الفزاري صرح بالسماع عند ابن حبان (357)`;