var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَافِيًا وَمُنْتَعِلًا";
abudawood.urdu = "جناب عمرو بن شعیب (عن ابیہ عن جدہ) کے واسطے سے مروی ہے وہ روایت کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ جوتے اتار کر نماز پڑھتے تھے اور پہن کر بھی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (769)
ورواہ أحمد بن جعفر بن حمدان القطیعي في جزء الألف دینار (144) عن الفضل بن حباب عن مسلم بن إبراھیم بہ بلفظ: ’’رأیت رسول اللہﷺ یصلي منتعلًا ویشرب قائمًا وقاعدًا ویصوم فی السفر ویفطر وینصرف فی الصلاۃ عن یمینہ وشمالہ‘‘`;