var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا صَالِحُ بْنُ رُسْتُمَ أَبُو عَامِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ قَيْسٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلَا يَضَعْ نَعْلَيْهِ عَنْ يَمِينِهِ وَلَا عَنْ يَسَارِهِ فَتَكُونَ عَنْ يَمِينِ غَيْرِهِ إِلَّا أَنْ لَا يَكُونَ عَنْ يَسَارِهِ أَحَدٌ وَلْيَضَعْهُمَا بَيْنَ رِجْلَيْهِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی نماز پڑھے تو اپنے جوتوں کو اپنی دائیں جانب نہ رکھا کرے اور نہ بائیں جانب کہ اس طرح وہ کسی دوسرے کی دائیں جانب ہوں گے۔ہاں اگر اس کی بائیں جانب کوئی اور نہ ہو تو اس طرف رکھ لے ورنہ انہیں اپنے دونوں قدموں کے درمیان میں رکھے۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (767)
صححہ ابن خزیمۃ (1016 وسندہ حسن) `;