var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا خَالِدٌ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ حَدَّثَتْنِي مَيْمُونَةُ بِنْتُ الْحَارِثِ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَنَا حِذَاءَهُ وَأَنَا حَائِضٌ وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ وَكَانَ يُصَلِّي عَلَى الْخُمْرَةِ";
abudawood.urdu = "ام المؤمنین سیدہ میمونہ بنت حارث رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نماز پڑھتے تو میں آپ ﷺ کے قریب برابر ہی میں ہوتی،اور ایام سے ہوتی۔آپ ﷺ سجدے کو جاتے تو بسا اوقات آپ ﷺ کا کپڑا بھی مجھے لگتا اور آپ ﷺ چھوٹی چٹائی پر نماز پڑھا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (379) صحیح مسلم (513)";
abudawood.description = ``;