var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ الذَّارِعُ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَزُورُ أُمَّ سُلَيْمٍ فَتُدْرِكُهُ الصَّلَاةُ أَحْيَانًا فَيُصَلِّي عَلَى بِسَاطٍ لَنَا وَهُوَ حَصِيرٌ نَنْضَحُهُ بِالْمَاءِ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ سیدہ ام سلیم رضی اللہ عنہا کی ملاقات کے لیے جایا کرتے تھے تو بعض اوقات ان کے ہاں نماز کا وقت بھی ہو جاتا۔پس آپ ﷺ ہماری ایک چٹائی پر نماز پڑھا کرتے تھے،وہ اس چٹائی پر پانی چھڑک دیا کرتی تھیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (612)`;