var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ بِمَعْنَى الْإِسْنَادِ وَالْحَدِيثِ قَالَا حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ عَنْ يُونُسَ بْنِ الْحَارِثِ عَنْ أَبِي عَوْنٍ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الْحَصِيرِ وَالْفَرْوَةِ الْمَدْبُوغَةِ";
abudawood.urdu = "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ چٹائی اور رنگے ہوئے چمڑے پر نماز پڑھتے تھے –";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یونس بن الحارث ضعفہ الجمہور وقال فی التقریب(7902) ’’ ضعیف ‘‘<br>وفي سماع عبد اللّٰہ بن سعید من المغیرۃ نظر : انظر ھامش اتحاف المھرۃ (13/ 421)`;
abudawood.anwaar = [36,1];