var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ حَدَّثَنَا غَالِبٌ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شِدَّةِ الْحَرِّ فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ وَجْهَهُ مِنْ الْأَرْضِ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے کہ سخت گرمی کے موسم میں ہم رسول اللہ ﷺ کے ساتھ نماز پڑھا کرتے تھے تو جب کوئی ہم میں سے اپنی پیشانی زمین پر نہ ٹکا سکتا ‘ تو اپنا کپڑا بچھا لیتا پھر اس پر سجدہ کرتا۔";
abudawood.hukam = "صحیح بخاری (385) صحیح مسلم (620)";
abudawood.description = ``;