var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ أَبِي صَغِيرَةَ عَنْ سِمَاكٍ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَوِّي صُفُوفَنَا إِذَا قُمْنَا لِلصَّلَاةِ فَإِذَا اسْتَوَيْنَا كَبَّرَ";
abudawood.urdu = "سیدنا نعمان بن بشیر رضی اللہ عنہ بیان کرتے ہیں کہ جب ہم نماز کے لیے کھڑے ہوتے تو رسول اللہ ﷺ ہماری صفوں کو برابر کرتے۔جب ہم درست ہو جاتے تو آپ ﷺ تکبیر کہتے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1097)`;