var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُصُّوا صُفُوفَكُمْ وَقَارِبُوا بَيْنَهَا وَحَاذُوا بِالْأَعْنَاقِ فَوَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَرَى الشَّيْطَانَ يَدْخُلُ مِنْ خَلَلِ الصَّفِّ كَأَنَّهَا الْحَذَفُ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’اپنی صفوں میں خوب مل کر کھڑے ہوا کرو۔انہیں قریب قریب بناؤ اور گردنوں کو بھی برابر رکھو۔قسم اس ذات کی جس کے ہاتھ میں میری جان ہے،میں شیطان کو دیکھتا ہوں کہ خالی جگہوں میں سے تمہاری صفوں میں گھس آتا ہے گویا وہ بکری کا بچہ ہو۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1093، 1100)
قتادۃ صرح بالسماع عند النسائي (816)`;