var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَسُلَيْمَانُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصَّفِّ مِنْ تَمَامِ الصَّلَاةِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’صفوں کو سیدھا اور برابر کرو۔بلاشبہ صفوں کو برابر کرنا نماز کی تکمیل کا حصہ ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (723) صحیح مسلم (433)";
abudawood.description = ``;