var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حُمَيْدُ بْنُ الْأَسْوَدِ حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَنَسٍ بِهَذَا الْحَدِيثِ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ أَخَذَهُ بِيَمِينِهِ ثُمَّ الْتَفَتَ فَقَالَ اعْتَدِلُوا سَوُّوا صُفُوفَكُمْ ثُمَّ أَخَذَهُ بِيَسَارِهِ فَقَالَ اعْتَدِلُوا سَوُّوا صُفُوفَكُمْ";
abudawood.urdu = "جناب محمد بن مسلم نے سیدنا انس رضی اللہ عنہ سے مذکورہ حدیث بیان کی اور کہا کہ رسول اللہ ﷺ جب نماز کے لیے کھڑے ہوتے تو اس لکڑی کو دائیں ہاتھ سے پکڑ لیتے پھر (دائیں صف کی طرف) متوجہ ہو کر کہتے ’’سیدھے کھڑے ہو جاؤ،اپنی صفوں کو برابر کر لو۔‘‘ پھر اپنے بائیں ہاتھ سے پکڑتے (اور بائیں جانب متوجہ ہوتے) اور فرماتے ’’سیدھے کھڑے ہو جاؤ اور اپنی صفوں کو برابر کر لو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (669)`;
abudawood.anwaar = [37,1];