var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتِمُّوا الصَّفَّ الْمُقَدَّمَ ثُمَّ الَّذِي يَلِيهِ فَمَا كَانَ مِنْ نَقْصٍ فَلْيَكُنْ فِي الصَّفِّ الْمُؤَخَّرِ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’(پہلے) پہلی صف کو پورا کرو پھر جو صف اس کے بعد ہو۔اور جو کمی ہو تو وہ آخری صف میں ہو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1094)
سعید بن أبي عروبۃ تابعہ شعبۃ عند ابن خزیمۃ (1547) وأبان بن یزید العطار عند ابن حبان (موارد: 391)`;