var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا جَعْفَرُ بْنُ يَحْيَى بْنِ ثَوْبَانَ قَالَ أَخْبَرَنِي عَمِّي عُمَارَةُ بْنُ ثَوْبَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِيَارُكُمْ أَلْيَنُكُمْ مَنَاكِبَ فِي الصَّلَاةِ قَالَ أَبُو دَاوُد جَعْفَرُ بْنُ يَحْيَى مِنْ أَهْلِ مَكَّةَ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’تم میں بہترین لوگ وہ ہیں جن کے کندھے نماز میں نرم ہوں۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں کہ راوی حدیث جعفر بن یحییٰ اہل مکہ میں سے ہیں۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (1099)
صححہ ابن خزیمۃ (1566) وللحدیث شواھد`;