var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَلِنِي مِنْكُمْ أُولُو الْأَحْلَامِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ";
abudawood.urdu = "سیدنا ابومسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’چاہیے کہ تمہارے اہل عقل و دانش میرے قریب کھڑے ہوا کریں۔پھر وہ جو ان کے قریب ہیں۔ان کے بعد وہ جو ان کے قریب ہیں۔‘‘";
abudawood.hukam = "صحیح مسلم (432)";
abudawood.description = ``;