var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ وَزَادَ وَلَا تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ وَإِيَّاكُمْ وَهَيْشَاتِ الْأَسْوَاقِ";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ نبی کریم ﷺ سے اسی کے مثل روایت کیا اور مزید بیان کیا کہ ’’آگے پیچھے مت ہو،ورنہ تمہارے دلوں میں اختلاف آ جائے گا اور بازاروں کے شور و شغب سے بچو۔‘‘";
abudawood.hukam = "صحیح مسلم (432)";
abudawood.description = ``;