var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى مَيَامِنِ الصُّفُوفِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’بیشک اللہ تعالیٰ صفوں کے دائیں اطراف والوں پر اپنی رحمت (خاص) نازل فرماتا ہے اور فرشتے ان کے لیے دعائیں کرتے ہیں۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ماجہ (1005)<br>سفیان الثوری عنعن<br>و روی ابن خزیمۃ (1550) بلفظ : ((إن اللّٰہ و ملائکتہ یصلون علی الذین یصلون الصفوف)) و سندہ حسن`;
abudawood.anwaar = [37,1];