var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا خَالِدٌ وَإِسْمَعِيلُ بْنُ زَكَرِيَّاءَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’مردوں کی بہترین صف (اجر و فضیلت میں) پہلی صف ہے اور کم تر آخری صف ہے۔اور عورتوں کی بہترین صف وہ ہے جو سب سے آخر میں ہو اور (اجر و فضیلت میں) کم تر وہ ہے جو سب سے پہلی ہو۔‘‘";
abudawood.hukam = "صحیح مسلم (440)";
abudawood.description = ``;