var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ قَوْمٌ يَتَأَخَّرُونَ عَنْ الصَّفِّ الْأَوَّلِ حَتَّى يُؤَخِّرَهُمْ اللَّهُ فِي النَّارِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جو لوگ صف اول سے پیچھے رہتے (اور اسے اپنی عادت بنا لیتے) ہیں اللہ انہیں جہنم میں بھی پیچھے کر دے گا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عکرمۃ بن عمار مدلس وعنعن عن یحیی بن أبي کثیر وتکلم الجمھور في روایتہ عنہ أیضًا`;
abudawood.anwaar = [37,1];