var abudawood = {};
abudawood.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ يَحْيَى بْنِ بَشِيرِ بْنِ خَلَّادٍ عَنْ أُمِّهِ أَنَّهَا دَخَلَتْ عَلَى مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ فَسَمِعَتْهُ يَقُولُ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسِّطُوا الْإِمَامَ وَسُدُّوا الْخَلَلَ";
abudawood.urdu = "جناب یحییٰ بن بشیر بن خلاد اپنی والدہ سے راوی ہیں کہ وہ محمد بن کعب قرظی کے پاس آئیں تو انہیں سنا،وہ کہہ رہے تھے کہ مجھ سے سیدنا ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’امام کو (صف سے آگے) درمیان میں کھڑا کرو اور صف کے خلا کو پورا کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أمۃ الواحد مجہولۃ (تقریب : 8534)<br>وابنھا یحیی بن بشیر بن خلاد مستور (تقریب :7515)`;
abudawood.anwaar = [37,1];