var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَحَفْصُ بْنُ عُمَرَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ عَمْرِو بْنِ رَاشِدٍ عَنْ وَابِصَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُصَلِّي خَلْفَ الصَّفِّ وَحْدَهُ فَأَمَرَهُ أَنْ يُعِيدَ قَالَ سُلَيْمَانُ بْنُ حَرْبٍ الصَّلَاةَ";
abudawood.urdu = "سیدنا وابصہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے ایک شخص کو دیکھا کہ وہ صف کے پیچھے کھڑا اکیلا ہی نماز پڑھ رہا تھا آپ ﷺ نے اسے دہرانے کا حکم دیا۔سلیمان بن حرب نے لفظ «الصلاۃ» بھی بیان کیا یعنی «فأمرہ أن یعید الصلاۃ» ’’کہ نماز دہرائے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1105)`;