var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ أَنَّ يَزِيدَ بْنَ زُرَيْعٍ حَدَّثَهُمْ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ زِيَادٍ الْأَعْلَمِ حَدَّثَنَا الْحَسَنُ أَنَّ أَبَا بَكْرَةَ حَدَّثَ أَنَّهُ دَخَلَ الْمَسْجِدَ وَنَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاكِعٌ قَالَ فَرَكَعْتُ دُونَ الصَّفِّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَكَ اللَّهُ حِرْصًا وَلَا تَعُدْ";
abudawood.urdu = "سیدنا ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ وہ مسجد میں داخل ہوئے اور نبی کریم ﷺ رکوع میں تھے،کہا چنانچہ میں صف میں ملنے سے پہلے ہی رکوع میں ہو گیا۔(نماز کے بعد) نبی کریم ﷺ نے فرمایا ’’اللہ تعالیٰ تیری حرص اور زیادہ کرے،آئندہ ایسا نہ کرنا۔‘‘";
abudawood.hukam = "صحیح بخاری (783)";
abudawood.description = ``;