var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِيهِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَعَلْتَ بَيْنَ يَدَيْكَ مِثْلَ مُؤَخِّرَةِ الرَّحْلِ فَلَا يَضُرُّكَ مَنْ مَرَّ بَيْنَ يَدَيْكَ";
abudawood.urdu = "سیدنا طلحہ بن عبیداللہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم اپنے سامنے پالان کی پچھلی لکڑی کے برابر کوئی چیز رکھ لو تو تمہیں کوئی نقصان نہیں کہ کون تمہارے آگے سے گزرتا ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (499)";
abudawood.description = ``;