var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ يَوْمَ الْعِيدِ أَمَرَ بِالْحَرْبَةِ فَتُوضَعُ بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا وَالنَّاسُ وَرَاءَهُ وَكَانَ يَفْعَلُ ذَلِكَ فِي السَّفَرِ فَمِنْ ثَمَّ اتَّخَذَهَا الْأُمَرَاءُ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ جب عید پڑھنے کے لیے نکلتے تو حکم دیتے کہ نیزہ ساتھ لے لیا جائے۔اسے آپ ﷺ کے آگے گاڑ دیا جاتا پھر آپ ﷺ اس کی طرف نماز پڑھتے اور لوگ آپ ﷺ کے پیچھے ہوتے۔سفر میں بھی آپ ﷺ کا یہ معمول ہوتا تھا۔چنانچہ امراء نے یہیں سے یہ عمل اخذ کیا ہے۔";
abudawood.hukam = "صحیح بخاری (494) صحیح مسلم (501)";
abudawood.description = ``;