var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ بِالْبَطْحَاءِ وَبَيْنَ يَدَيْهِ عَنَزَةٌ الظُّهْرَ رَكْعَتَيْنِ وَالْعَصْرَ رَكْعَتَيْنِ يَمُرُّ خَلْفَ الْعَنَزَةِ الْمَرْأَةُ وَالْحِمَارُ";
abudawood.urdu = "جناب عون بن ابی جحیفہ اپنے والد سے بیان کرتے ہیں کہ نبی کریم ﷺ نے انہیں (مکہ کے قریب) وادی بطحاء میں نماز پڑھائی اور آپ ﷺ کے سامنے چھوٹا نیزہ تھا۔(آپ ﷺ نے ہمیں) ظہر اور عصر کی دو دو رکعتیں پڑھائیں۔اس نیزے کے آگے سے عورت بھی گزرتی تھی اور گدھا بھی۔";
abudawood.hukam = "صحیح بخاری (495) صحیح مسلم (503)";
abudawood.description = ``;