var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا إِسْمَعِيلُ بْنُ أُمَيَّةَ حَدَّثَنِي أَبُو عَمْرِو بْنُ مُحَمَّدِ بْنِ حُرَيْثٍ أَنَّهُ سَمِعَ جَدَّهُ حُرَيْثًا يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلْيَجْعَلْ تِلْقَاءَ وَجْهِهِ شَيْئًا فَإِنْ لَمْ يَجِدْ فَلْيَنْصِبْ عَصًا فَإِنْ لَمْ يَكُنْ مَعَهُ عَصًا فَلْيَخْطُطْ خَطًّا ثُمَّ لَا يَضُرُّهُ مَا مَرَّ أَمَامَهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی نماز پڑھنے لگے تو اپنے سامنے کوئی چیز رکھ لے۔اگر کچھ نہ ملے تو کوئی لاٹھی کھڑی کر لے۔اگر اس کے پاس عصا (لاٹھی) نہ ہو تو خط ہی کھینچ لے۔پھر اس کے آگے سے جو بھی گزرے اسے نقصان نہ ہو گا۔“";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (943)<br>ابن عمرو بن حریث وجدہ مجہولان (تقریب : 8272،1183)`;
abudawood.anwaar = [37,1];