var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زَائِدَةُ فِي حَدِيثِ هِشَامٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ ثُمَّ يَغْتَسِلُ مِنْهُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’کوئی شخص ٹھہرے ہوئے پانی میں ہرگز پیشاب نہ کرے کہ پھر اسی سے غسل کرے گا۔‘‘";
abudawood.hukam = "صحیح مسلم (282)";
abudawood.description = ``;