var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ رَأَيْتُ شَرِيكًا صَلَّى بِنَا فِي جَنَازَةٍ الْعَصْرَ فَوَضَعَ قَلَنْسُوَتَهُ بَيْنَ يَدَيْهِ يَعْنِي فِي فَرِيضَةٍ حَضَرَتْ";
abudawood.urdu = "جناب سفیان بن عیینہ کہتے ہیں کہ میں نے شریک (شریک بن عبداللہ بن ابی نمر،یا شریک بن عبداللہ نخعی کوفی) کو دیکھا کہ انہوں نے ہمیں ایک جنازہ کے اجتماع میں عصر کی نماز پڑھائی تو اپنے سامنے اپنی ٹوپی رکھ لی۔یعنی ایک فریضہ میں جس کا وقت ہو چکا تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;