var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَوَهْبُ بْنُ بَقِيَّةَ وَابْنُ أَبِي خَلَفٍ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ عُثْمَانُ حَدَّثَنَا أَبُو خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي إِلَى بَعِيرٍ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ اپنے اونٹ کو سترہ بنا کر اس کی طرف نماز پڑھ لیا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (430) صحیح مسلم (502)";
abudawood.description = ``;