var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ وَالنُّفَيْلِيُّ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ قَالَ أَخْبَرَنِي أَبِي عَنْ سَهْلٍ قَالَ وَكَانَ بَيْنَ مَقَامِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْقِبْلَةِ مَمَرُّ عَنْزٍ قَالَ أَبُو دَاوُد الْخَبَرُ لِلنُّفَيْلِيِّ";
abudawood.urdu = "سیدنا سہل رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ اور آپ ﷺ کے قبلے (یعنی سترے) کے درمیان اتنا فاصلہ ہوتا کہ اس سے ایک بکری گزر سکتی تھی۔امام ابوداؤد رحمہ اللہ نے کہا: یہ حدیث (میرے شیخ) نفیلی کی بیان کردہ ہے (قعنبی کی نہیں)۔";
abudawood.hukam = "صحیح بخاری (496) صحیح مسلم (508)";
abudawood.description = ``;