var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ وَلْيَدْرَأْهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ شَيْطَانٌ";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم میں سے کوئی نماز پڑھ رہا ہو تو کسی کو نہ چھوڑے کہ اس کے آگے سے گزرے۔جہاں تک ہو سکے اس کو روکے۔اگر وہ انکار و اصرار کرے تو چاہیئے کہ اس کے ساتھ لڑائی کرے،بیشک وہ شیطان ہے۔‘‘";
abudawood.hukam = "صحیح مسلم (505)";
abudawood.description = ``;