var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ مُحَمَّدِ بْنِ عَجْلَانَ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَلَا يَغْتَسِلُ فِيهِ مِنْ الْجَنَابَةِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’تم میں سے کوئی شخص کھڑے پانی میں ہرگز پیشاب نہ کرے اور نہ جنابت سے اس میں نہائے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;