var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ حَدَّثَنَا قَتَادَةُ قَالَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍ رَفَعَهُ شُعْبَةُ قَالَ يَقْطَعُ الصَّلَاةَ الْمَرْأَةُ الْحَائِضُ وَالْكَلْبُ قَالَ أَبُو دَاوُد وَقَفَهُ سَعِيدٌ وَهِشَامٌ وَهَمَّامٌ عَنْ قَتَادَةَ عَنْ جَابِرِ بْنِ زَيْدٍ عَلَى ابْنِ عَبَّاسٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے،اسے شعبہ نے مرفوع ذکر کیا ’’نماز کو توڑ دیتی ہے بالغہ عورت اور کتا۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: اسے سعید،ہشام اور ہمام نے قتادہ سے،انہوں نے جابر بن زید سے روایت کرتے ہوئے ابن عباس رضی اللہ عنہما پر موقوف کیا ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `صححہ ابن خزیمۃ (832)`;