var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ مَوْلَى يَزِيدَ بْنِ نِمْرَانَ عَنْ يَزِيدَ بْنِ نِمْرَانَ قَالَ رَأَيْتُ رَجُلًا بِتَبُوكَ مُقْعَدًا فَقَالَ مَرَرْتُ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عَلَى حِمَارٍ وَهُوَ يُصَلِّي فَقَالَ اللَّهُمَّ اقْطَعْ أَثَرَهُ فَمَا مَشَيْتُ عَلَيْهَا بَعْدُ";
abudawood.urdu = "ناب یزید بن نمران نے بیان کیا کہ میں نے تبوک میں ایک آدمی دیکھا جو لنجا تھا۔(یعنی چل پھر نہ سکتا تھا۔) اس نے بتایا کہ میں نبی کریم ﷺ کے آگے سے گزرا تھا،میں گدھے پر سوار تھا اور آپ ﷺ نماز پڑھ رہے تھے۔آپ ﷺ نے کہا ’’اے اللہ! اس کے قدم کاٹ دے۔‘‘ چنانچہ اس کے بعد سے میں اپنے قدموں پر نہیں چل سکا ہوں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سعید مولی لیزید بن نمران مجہول (تقریب : 2430)`;
abudawood.anwaar = [38,1];