var abudawood = {};
abudawood.arabic = "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ يَعْنِي الْمَذْحِجِيَّ حَدَّثَنَا أَبُو حَيْوَةَ عَنْ سَعِيدٍ بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ قَالَ قَطَعَ صَلَاتَنَا قَطَعَ اللَّهُ أَثَرَهُ قَالَ أَبُو دَاوُد وَرَوَاهُ أَبُو مُسْهِرٍ عَنْ سَعِيدٍ قَالَ فِيهِ قَطَعَ صَلَاتَنَا";
abudawood.urdu = "سعید نے مذکورہ سند کے ساتھ اسی کے ہم معنی بیان کیا اور مزید کہا ’’اس نے ہماری نماز توڑ دی،اللہ اس کے قدم توڑ دے۔‘‘ امام ابوداؤد رحمہ اللہ نے کہا: ابومسہر نے سعید سے روایت کیا تو اس نے صرف اس قدر کہا ’’اس نے ہماری نماز توڑ دی۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث الآتي(707)`;
abudawood.anwaar = [38,1];