var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَحَفْصُ بْنُ عُمَرَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي فَذَهَبَ جَدْيٌ يَمُرُّ بَيْنَ يَدَيْهِ فَجَعَلَ يَتَّقِيهِ";
abudawood.urdu = "۔سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نماز پڑھ رہے تھے کہ بھیڑ کا ایک بچہ آپ ﷺ کے آگے سے گزرنے لگا مگر آپ ﷺ اسے ہٹاتے رہے۔";
abudawood.hukam = "حسن";
abudawood.description = `یحیی بن الجزار سمعہ من أبی الصھباء صھیب انظر الحدیث الآتي (716، 717) وأبو الصھباء صدوق حسن الحدیث وثقہ الجمھور`;