var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي صَلَاتَهُ مِنْ اللَّيْلِ وَهِيَ مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ رَاقِدَةٌ عَلَى الْفِرَاشِ الَّذِي يَرْقُدُ عَلَيْهِ حَتَّى إِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَهَا فَأَوْتَرَتْ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ ﷺ رات کو اپنی نماز پڑھتے اور وہ آپ ﷺ کے اور قبلے کے درمیان بستر پر ہوتی تھیں جس پر کہ آپ ﷺ سوتے تھے،حتیٰ کہ جب آپ ﷺ وتر پڑھنا چاہتے تو انہیں جگا دیتے-تب وہ (بھی اٹھ کر) وتر پڑھ لیتیں۔";
abudawood.hukam = "صحیح بخاری (512) صحیح مسلم (512)";
abudawood.description = ``;