var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْ بِئْسَمَا عَدَلْتُمُونَا بِالْحِمَارِ وَالْكَلْبِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ يُصَلِّي وَأَنَا مُعْتَرِضَةٌ بَيْنَ يَدَيْهِ فَإِذَا أَرَادَ أَنْ يَسْجُدَ غَمَزَ رِجْلِي فَضَمَمْتُهَا إِلَيَّ ثُمَّ يَسْجُدُ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کہتی ہیں کہ تم لوگوں نے برا کیا کہ ہمیں (یعنی عورتوں کو) گدھے اور کتے کے برابر کر دیا ہے۔بلاشبہ میں نے دیکھا کہ رسول اللہ ﷺ نماز پڑھتے اور میں آپ ﷺ کے سامنے لیٹی ہوئی ہوتی تھی۔آپ ﷺ جب سجدہ کرنا چاہتے تو میرے پاؤں کو دبا دیتے،میں اپنے پاؤں سمیٹ لیتی پھر آپ ﷺ سجدہ کرتے۔";
abudawood.hukam = "صحیح بخاری (519)";
abudawood.description = ``;