var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ حَدَّثَنَا الْمُعْتَمِرُ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كُنْتُ أَكُونُ نَائِمَةً وَرِجْلَايَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي مِنْ اللَّيْلِ فَإِذَا أَرَادَ أَنْ يَسْجُدَ ضَرَبَ رِجْلَيَّ فَقَبَضْتُهُمَا فَسَجَدَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں سوئی ہوئی ہوتی اور میرے پاؤں رسول اللہ ﷺ کے سامنے ہوتے جبکہ آپ ﷺ رات کو نماز پڑھ رہے ہوتے تھے۔جب آپ ﷺ سجدہ کرنا چاہتے تو میرے پاؤں پر مارتے،میں انہیں سمیٹ لیتی پھر آپ ﷺ سجدہ کرتے۔";
abudawood.hukam = "صحیح بخاری (382) صحیح مسلم (512)";
abudawood.description = ``;