var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَدَاوُدُ بْنُ مِخْرَاقٍ الْفِرْيَابِيُّ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ قَالَ فَجَاءَتْ جَارِيَتَانِ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ اقْتَتَلَتَا فَأَخَذَهُمَا قَالَ عُثْمَانُ فَفَرَّعَ بَيْنَهُمَا وَقَالَ دَاوُدُ فَنَزَعَ إِحْدَاهُمَا عَنْ الْأُخْرَى فَمَا بَالَى ذَلِكَ";
abudawood.urdu = "منصور نے یہی حدیث اپنی سند سے روایت کی،کہا کہ\nبنی عبدالمطلب کی دو لڑکیاں لڑتی ہوئی آئیں تو آپ نے ان دونوں کو پکڑ لیا۔عثمان نے کہا: آپ نے ان دونوں کو جدا کر دیا۔اور ابوداؤد رحمہ اللہ نے کہا انہیں ایک دوسری سے چھڑا دیا اور اس کی کوئی پروا نہ کی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `انظر الحدیث السابق (716)`;