var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُجَالِدٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْطَعُ الصَّلَاةَ شَيْءٌ وَادْرَءُوا مَا اسْتَطَعْتُمْ فَإِنَّمَا هُوَ شَيْطَانٌ";
abudawood.urdu = "سیدنا ابوسعید رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’نماز کو کوئی چیز نہیں توڑتی اور جہاں تک ممکن ہو (آگے سے گزرنے والی شے کو) ہٹاؤ بلاشبہ وہ شیطان ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (785)
أخرجہ البیھقي (2/278) أبو أسامۃ صرح بالسماع عندہ وللحدیث شاھد قوي عند الدارقطني (1/367)`;