var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْمُعْتَمِرُ يَعْنِي ابْنَ سُلَيْمَانَ ح و حَدَّثَنَا مُحَ ہیڈنگ 2 /ہیڈنگ 2 مَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ جَمِيعًا عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ بِمَعْنَاهُ وَلَمْ يَرْفَعَاهُ وَزَادَ وَإِذَا وَلَغَ الْهِرُّ غُسِلَ مَرَّةً";
abudawood.urdu = "جناب محمد بن سیرین نے سیدنا ابوہریرہ رضی اللہ عنہ سے مذکورہ حدیث کے ہم معنی روایت کیا ہے۔اور مرفوع نہیں روایت کیا (بلکہ موقوف بیان کیا) اور اس میں اضافہ یہ ہے: ’’جب بلی منہ مار جائے تو ایک بار دھویا جائے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;