var abudawood = {};
abudawood.arabic = "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ النَّخَعِيِّ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ أَنَّهُ أَبْصَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قَامَ إِلَى الصَّلَاةِ رَفَعَ يَدَيْهِ حَتَّى كَانَتَا بِحِيَالِ مَنْكِبَيْهِ وَحَاذَى بِإِبْهَامَيْهِ أُذُنَيْهِ ثُمَّ كَبَّرَ";
abudawood.urdu = "جناب عبدالجبار بن وائل اپنے والد سے روایت کرتے ہیں،انہوں نے نبی کریم ﷺ کو دیکھا کہ جب آپ ﷺ نماز کے لیے کھڑے ہوئے تو آپ ﷺ نے اپنے دونوں ہاتھ اٹھائے حتیٰ کہ وہ کندھوں کے مقابل ہو گئے اور انگوٹھے کانوں کے برابر آ گئے۔پھر «اللہ اکبر» کہا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبدالجبار بن وائل لم یسمع من أبیہ : قالہ البخاري (سنن الترمذي : 1453)`;
abudawood.anwaar = [38,1];