var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا الْمَسْعُودِيُّ حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ وَائِلٍ حَدَّثَنِي أَهْلُ بَيْتِي عَنْ أَبِي أَنَّهُ حَدَّثَهُمْ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ مَعَ التَّكْبِيرَةِ";
abudawood.urdu = "جناب عبدالجبار بن وائل نے کہا کہ مجھ سے میرے اہل خانہ نے میرے والد (وائل بن حجر رضی اللہ عنہ) سے روایت کیا،میرے والد نے ان سے بیان کیا کہ اس نے رسول ﷺ کو دیکھا تھا کہ وہ تکبیر کے ساتھ ہاتھ اٹھاتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أھل بیت عبدالجبار : مجہولون،کما قال المنذري (عون المعبود 1/ 264)`;
abudawood.anwaar = [38,1];