var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حِيَالَ أُذُنَيْهِ قَالَ ثُمَّ أَتَيْتُهُمْ فَرَأَيْتُهُمْ يَرْفَعُونَ أَيْدِيَهُمْ إِلَى صُدُورِهِمْ فِي افْتِتَاحِ الصَّلَاةِ وَعَلَيْهِمْ بَرَانِسُ وَأَكْسِيَةٌ";
abudawood.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی کریم ﷺ کو دیکھا کہ آپ ﷺ نے جب نماز شروع کی تو اپنے دونوں ہاتھوں کو کانوں کے برابر تک اٹھایا۔کہا کہ میں پھر ان (صحابہ) کے پاس آیا میں نے صحابہ رضی اللہ عنہم کو دیکھا کہ وہ نماز شروع کرتے ہوئے اپنے ہاتھوں کو سینوں تک اٹھاتے تھے اور وہ جبے اور کمبل اوڑھے ہوئے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>شریک عنعن في ھذا المتن وھو مدلس`;
abudawood.anwaar = [38,2];