var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الشِّتَاءِ فَرَأَيْتُ أَصْحَابَهُ يَرْفَعُونَ أَيْدِيَهُمْ فِي ثِيَابِهِمْ فِي الصَّلَاةِ";
abudawood.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ بیان کرتے ہیں کہ میں نبی کریم ﷺ کی خدمت میں حاضر ہوا،سردی کا موسم تھا،میں نے صحابہ کرام رضی اللہ عنہم کو دیکھا کہ وہ کپڑوں کے اندر سے نماز میں اپنے ہاتھ اٹھاتے تھے (یعنی رفع یدین کرتے تھے)۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شواہد منھا الحدیث السابق (727)`;