var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ،عَنْ فِطْرٍ،عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ،عَنْ أَبِيهِ،قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَرْفَعُ إِبْهَامَيْهِ فِي الصَّلَاةِ إِلَى شَحْمَةِ أُذُنَيْهِ»";
abudawood.urdu = "جناب عبدالجبار بن وائل اپنے والد سے روایت کرتے ہیں کہا کہ میں نے رسول اللہ ﷺ کو دیکھا کہ آپ ﷺ نماز میں اپنے انگوٹھوں کو کانوں کی لو تک اونچا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>نسائی (883)<br>عبدالجبار بن وائل لم یسمع من أبیہ`;
abudawood.anwaar = [39,1];