var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ إِذَا ابْتَدَأَ الصَّلَاةَ يَرْفَعُ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَهُمَا دُونَ ذَلِكَ قَالَ أَبُو دَاوُد لَمْ يَذْكُرْ رَفَعَهُمَا دُونَ ذَلِكَ أَحَدٌ غَيْرُ مَالِكٍ فِيمَا أَعْلَمُ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ جب وہ نماز شروع کرتے تو اپنے ہاتھوں کو کندھوں کے برابر تک اونچا کرتے (یعنی رفع یدین کرتے)۔اور جب رکوع سے سر اٹھاتے تو انہیں ذرا کم اونچا کرتے (یعنی رفع یدین کرتے)۔امام ابوداؤد رحمہ اللہ نے کہا: جہاں تک مجھے معلوم ہے،ہاتھوں کو ذرا کم اونچا اٹھانے کا ذکر مالک کے علاوہ کسی اور نے نہیں کیا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;