var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ وَرَفَعَ يَدَيْهِ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما نے کہا کہ رسول اللہ ﷺ جب دو رکعتیں پڑھ کر اٹھتے تو «اللہ اکبر» کہتے اور اپنے دونوں ہاتھوں کو اٹھاتے (یعنی رفع یدین کرتے)۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;