var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا كَبَّرَ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ حَتَّى يَبْلُغَ بِهِمَا فُرُوعَ أُذُنَيْهِ";
abudawood.urdu = "سیدنا مالک بن حویرث رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی کریم ﷺ کو دیکھا کہ جب آپ ﷺ تکبیر (تکبیر تحریمہ) کہتے تو رفع یدین کرتے،اور جب رکوع کو جاتے اور جب رکوع سے سر اٹھاتے تو بھی اپنے ہاتھ اٹھاتے (یعنی رفع یدین کرتے) اور وہ آپ ﷺ کی کانوں کی لوؤں تک پہنچ جاتے،(یا کانوں کے اوپر کے حصے تک پہنچ جاتے تھے)۔";
abudawood.hukam = "صحیح مسلم (391)";
abudawood.description = ``;