var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا شَرِيكٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ إِلَى قَرِيبٍ مِنْ أُذُنَيْهِ ثُمَّ لَا يَعُودُ";
abudawood.urdu = "سیدنا براء بن عازب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب نماز شروع کرتے تو اپنے دونوں ہاتھ اپنے کانوں تک اٹھاتے،پھر دوبارہ نہ اٹھاتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>یزید بن أبي زیاد ضعیف،مدلس،مختلط (انظر التقریب : 7717،وطبقات المدلسین : 112/ 3) و قال البوصیري : وضعفہ الجمھور (زوائد ابن ماجہ : 2116) وانظر ح 1966 وحدث بہ بعد اختلاطہ وعنعن في ھذا اللفظ و قال الحافظ ابن حجر : و الجمہور علی تضعیف حدیثہ(ھدي الساري ص459)`;
abudawood.anwaar = [40,1];