var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ نَحْوَ حَدِيثِ شَرِيكٍ لَمْ يَقُلْ ثُمَّ لَا يَعُودُ قَالَ سُفْيَانُ قَالَ لَنَا بِالْكُوفَةِ بَعْدُ ثُمَّ لَا يَعُودُ قَالَ أَبُو دَاوُد وَرَوَى هَذَا الْحَدِيثَ هُشَيْمٌ وَخَالِدٌ وَابْنُ إِدْرِيسَ عَنْ يَزِيدَ لَمْ يَذْكُرُوا ثُمَّ لَا يَعُودُ";
abudawood.urdu = "عبداللہ بن محمد زہری کی سند سے،یزید سے شریک کی مانند مروی ہے اور «ثم لا یعود» کے لفظ ذکر نہیں کیے (یعنی ’’پھر دوبارہ نہ اٹھاتے‘‘ کے لفظ نقل نہیں کیے)۔سفیان نے کہا: بعد میں کوفہ میں ہم کو «ثم لا یعود» کے لفظ بیان کیے۔امام ابوداؤد رحمہ اللہ نے کہا: اس حدیث کو ہشیم،خالد اور ابن ادریس نے یزید سے روایت کیا ہے مگر ان حضرات نے «لا یعود» کا لفظ روایت نہیں کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق(749)`;
abudawood.anwaar = [40,1];