var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا مُعَاوِيَةُ وَخَالِدُ بْنُ عَمْرٍو وَأَبُو حُذَيْفَةَ قَالُوا حَدَّثَنَا سُفْيَانُ بِإِسْنَادِهِ بِهَذَا قَالَ فَرَفَعَ يَدَيْهِ فِي أَوَّلِ مَرَّةٍ وَقَالَ بَعْضُهُمْ مَرَّةً وَاحِدَةً";
abudawood.urdu = "جناب سفیان نے اسی سند سے اس حدیث کو بیان کیا کہا پس آپ نے پہلی ہی بار اپنے ہاتھ اٹھائے۔اور بعض نے کہا: ایک ہی بار اٹھائے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظرالحدیث السابق (748)`;
abudawood.anwaar = [40,1];