var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبُو أَحْمَدَ عَنْ الْعَلَاءِ بْنِ صَالِحٍ عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ يَقُولُ صَفُّ الْقَدَمَيْنِ وَوَضْعُ الْيَدِ عَلَى الْيَدِ مِنْ السُّنَّةِ";
abudawood.urdu = "سیدنا ابن زبیر رضی اللہ عنہ فرماتے ہیں کہ (نماز میں) قدموں کو برابر رکھنا اور ہاتھ پر ہاتھ رکھنا سنت ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `زرعۃ بن عبد الرحمن وثقہ ابن حبان والضیاء المقدسي والذھبي`;