var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ عَنْ هُشَيْمِ بْنِ بَشِيرٍ عَنْ الْحَجَّاجِ بْنِ أَبِي زَيْنَبَ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ ابْنِ مَسْعُودٍ أَنَّهُ كَانَ يُصَلِّي فَوَضَعَ يَدَهُ الْيُسْرَى عَلَى الْيُمْنَى فَرَآهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى الْيُسْرَى";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے مروی ہے کہ وہ نماز پڑھ رہے تھے اور اپنے بائیں ہاتھ کو دائیں پر رکھے ہوئے تھے،نبی کریم ﷺ نے دیکھا تو ان کے دائیں ہاتھ کو بائیں کے اوپر کر دیا۔";
abudawood.hukam = "حسن";
abudawood.description = `ھشیم بن بشیر صرح بالسماع عند ابن ماجہ (811 وسندہ حسن)`;