var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ زِيَادِ بْنِ زَيْدٍ عَنْ أَبِي جُحَيْفَةَ أَنَّ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ قَالَ مِنْ السُّنَّةِ وَضْعُ الْكَفِّ عَلَى الْكَفِّ فِي الصَّلَاةِ تَحْتَ السُّرَّةِ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ نے فرمایا کہ نماز میں ہتھیلی کو ہتھیلی پر ناف کے نیچے رکھنا سنت ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد الرحمٰن بن إسحاق الکوفی الواسطي ضعیف (تق : 3799) ضعفہ الجمہور<br>وزیاد : مجہول (تقریب التہذیب: 2078)`;
abudawood.anwaar = [40,1];