var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ الْكُوفِيِّ عَنْ سَيَّارٍ أَبِي الْحَكَمِ عَنْ أَبِي وَائِلٍ قَالَ قَالَ أَبُو هُرَيْرَةَ أَخْذُ الْأَكُفِّ عَلَى الْأَكُفِّ فِي الصَّلَاةِ تَحْتَ السُّرَّةِ قَالَ أَبُو دَاوُد سَمِعْت أَحْمَدَ بْنَ حَنْبَلٍ يُضَعِّفُ عَبْدَ الرَّحْمَنِ بْنَ إِسْحَقَ الْكُوفِيَّ";
abudawood.urdu = "جناب ابووائل نے کہا کہ سیدنا ابوہریرہ رضی اللہ عنہ نے کہا: نماز میں ہتھیلیوں سے ناف کے نیچے سے پکڑنا ہے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ میں نے امام احمد بن حنبل رحمہ اللہ کو سنا ‘ وہ (مذکورہ اثر کے ایک راوی) عبدالرحمٰن کوفی کو ضعیف کہتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>عبد الرحمٰن بن إسحاق الواسطي ضعیف`;
abudawood.anwaar = [40,2];