var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا الْهَيْثَمُ يَعْنِي ابْنَ حُمَيْدٍ عَنْ ثَوْرٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ طَاوُسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ يَدَهُ الْيُمْنَى عَلَى يَدِهِ الْيُسْرَى ثُمَّ يَشُدُّ بَيْنَهُمَا عَلَى صَدْرِهِ وَهُوَ فِي الصَّلَاةِ";
abudawood.urdu = "جناب طاؤس (طاؤس بن کیسان یمانی،تابعی) بیان کرتے ہیں کہ رسول اللہ ﷺ نماز کے دوران میں اپنا دایاں ہاتھ بائیں کے اوپر رکھتے اور انہیں اپنے سینے پر باندھا کرتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث شاھد عند أحمد (5/226 وسندہ حسن)`;