var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ مِسْعَرٍ عَنْ مِسْعَرٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ رَجُلٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي التَّطَوُّعِ ذَكَرَ نَحْوَهُ";
abudawood.urdu = "جناب نافع بن جبیر اپنے والد (جبیر بن مطعم) سے بیان کرتے ہیں کہا کہمیں نے نبی کریم ﷺ سے سنا،آپ ﷺ نفل میں مذکورہ بالا دعا پڑھتے تھے۔";
abudawood.hukam = "حسن";
abudawood.description = `انظر الحدیث السابق (764)`;