var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو نُوحٍ قُرَادٌ حَدَّثَنَا عِكْرِمَةُ بِإِسْنَادِهِ بِلَا إِخْبَارٍ وَمَعْنَاهُ قَالَ كَانَ إِذَا قَامَ بِاللَّيْلِ كَبَّرَ وَيَقُولُ حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ قَالَ لَا بَأْسَ بِالدُّعَاءِ فِي الصَّلَاةِ فِي أَوَّلِهِ وَأَوْسَطِهِ وَفِي آخِرِهِ فِي الْفَرِيضَةِ وَغَيْرِهَا";
abudawood.urdu = "جناب عکرمہ (عکرمہ بن عمار عجلی) نے اپنی سند سے«حدثنی» کی صراحت کے بغیر اور اس حدیث کے ہم معنی بیان کیا کہ رسول اللہ ﷺ جب رات کو قیام فرماتے تو (پہلے) «اللہ اکبر» کہتے اور پھر یہ دعا پڑھتے";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (767)`;