var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَنَحْنُ جُنُبَانِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ ’’میں اور رسول اللہ ﷺ ایک ہی برتن سے نہا لیا کرتے تھے جب کہ ہم دونوں جنبی ہوتے تھے۔‘‘";
abudawood.hukam = "صحیح بخاری (299)";
abudawood.description = `وعزاہ المزی فی تحفۃ الأشراف (11/369 ح 15983) إلی صحیح مسلم من حدیث زائدۃ عن منصور بہ`;