var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا عِمْرَانُ بْنُ مُسْلِمٍ أَنَّ قَيْسَ بْنَ سَعْدٍ حَدَّثَهُ قَالَ حَدَّثَنَا طَاوُسٌ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي التَّهَجُّدِ يَقُولُ بَعْدَ مَا يَقُولُ اللَّهُ أَكْبَرُ ثُمَّ ذَكَرَ مَعْنَاهُ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہر سول اللہ ﷺ تہجد میں «اللہ اکبر» یعنی (تکبیر تحریمہ) کہنے کے بعد کہا کرتے تھے۔اور پھر مذکورہ بالا حدیث کے ہم معنی روایت کیا۔";
abudawood.hukam = "صحیح مسلم (769)";
abudawood.description = ``;