var abudawood = {};
abudawood.arabic = "حَدَّثَناأَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ أَشْعَثَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَسْكُتُ سَكْتَتَيْنِ إِذَا اسْتَفْتَحَ وَإِذَا فَرَغَ مِنْ الْقِرَاءَةِ كُلِّهَا فَذَكَرَ مَعْنَى حَدِيثِ يُونُسَ";
abudawood.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہآپ ﷺ دو سکتے فرمایا کرتے تھے۔ایک نماز شروع کرتے ہوئے (قرآت سے پہلے) اور دوسرے جب پوری قرآت سے فارغ ہو جاتے۔اور یونس کی روایت کے ہم معنی ذکر کیا۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (777)`;