var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا وَكِيعٌ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ ابْنِ خَرَّبُوذَ عَنْ أُمِّ صُبَيَّةَ الْجُهَنِيَّةِ قَالَتْ اخْتَلَفَتْ يَدِي وَيَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْوُضُوءِ مِنْ إِنَاءٍ وَاحِدٍ";
abudawood.urdu = "سیدہ ام صبیہ جہنیہ (خولہ بنت قیس) رضی اللہ عنہا کہتی ہیں کہ ایک برتن سے وضو کرتے ہوئے میرا اور رسول اللہ ﷺ کا ہاتھ باری باری برتن میں پڑتا تھا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;