var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ بِهَذَا قَالَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَ سَكْتَتَانِ حَفِظْتُهُمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهِ قَالَ سَعِيدٌ قُلْنَا لِقَتَادَةَ مَا هَاتَانِ السَّكْتَتَانِ قَالَ إِذَا دَخَلَ فِي صَلَاتِهِ وَإِذَا فَرَغَ مِنْ الْقِرَاءَةِ ثُمَّ قَالَ بَعْدُ وَإِذَا قَالَ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ";
abudawood.urdu = "سیدنا سمرہ رضی اللہ عنہ فرماتے ہیں کہدو سکتے ہیں جو مجھے رسول اللہ ﷺ سے یاد ہیں۔سعید کہتے ہیں کہ ہم نے قتادہ سے پوچھا کہ یہ دو سکتے کیا ہیں؟ انہوں نے کہا: جب نماز شروع کرتے اور جب قرآت سے فارغ ہوتے۔پھر اس کے بعد کہا: اور جب «غیر المغضوب علیہم ولا الضالین» کہتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن<br>و الحدیث السابق (الأصل : 777) یغني عنہ`;
abudawood.anwaar = [41,1];