var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ كَانُوا يَفْتَتِحُونَ الْقِرَاءَةَ بِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے مروی ہے کہنبی کریم ﷺ،ابوبکر،عمر اور عثمان رضی اللہ عنہم قرآت کی ابتداء «الحمد للہ رب العالمین» سے کیا کرتے تھے۔";
abudawood.hukam = "صحیح بخاری (743) صحیح مسلم (399)";
abudawood.description = `وأخرجہ البخاري في جزء القراء ۃ (125)`;