var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ وَابْنُ السَّرْحِ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ قُتَيْبَةُ فِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعْرِفُ فَصْلَ السُّورَةِ حَتَّى تَنَزَّلَ عَلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَهَذَا لَفْظُ ابْنِ السَّرْحِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ سورتوں کا فرق نہ پہچانتے تھے حتیٰ کہ « بسم اللہ الرحمن الرحیم » نازل کی جاتی۔یہ ابن سرح کے الفاظ ہیں۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (2218)
أخرجہ الحمیدي (528 وسندہ صحیح)`;