var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ الرِّجَالُ وَالنِّسَاءُ يَتَوَضَّئُونَ فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مُسَدَّدٌ مِنْ الْإِنَاءِ الْوَاحِدِ جَمِيعًا";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ کے دور میں مرد اور عورتیں ایک برتن سے وضو کر لیا کرتے تھے۔مسدد کی روایت ہے ’’مرد اور عورتیں اکٹھے ایک ہی برتن سے وضو کر لیا کرتے تھے۔‘‘";
abudawood.hukam = "صحیح بخاری (193)";
abudawood.description = `(رواہ مسلم مطولاً)`;