var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا طَالِبُ بْنُ حَبِيبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ يُحَدِّثُ عَنْ حَزْمِ بْنِ أُبَيِّ بْنِ كَعْبٍ أَنَّهُ أَتَى مُعَاذَ بْنَ جَبَلٍ وَهُوَ يُصَلِّي بِقَوْمٍ صَلَاةَ الْمَغْرِبِ فِي هَذَا الْخَبَرِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مُعَاذُ لَا تَكُنْ فَتَّانًا فَإِنَّهُ يُصَلِّي وَرَاءَكَ الْكَبِيرُ وَالضَّعِيفُ وَذُو الْحَاجَةِ وَالْمُسَافِرُ";
abudawood.urdu = "جناب حزم بن ابی کعب کا بیان ہے کہ وہ سیدنا معاذ بن جبل رضی اللہ عنہ کے ہاں آئے اور وہ قوم کو مغرب کی نماز پڑھا رہے تھے۔اسی مذکورہ خبر میں بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’اے معاذ! فتنے میں ڈالنے والے نہ بنو،بیشک تمہارے پیچھے بڑی عمر والے،کمزور،کام کاج والے اور مسافر لوگ نماز پڑھتے ہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>طالب بن حبیب ضعیف ضعفہ البخاري والجمھور`;
abudawood.anwaar = [41,1];