var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ لِلنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمْ الضَّعِيفَ وَالسَّقِيمَ وَالْكَبِيرَ وَإِذَا صَلَّى لِنَفْسِهِ فَلْيُطَوِّلْ مَا شَاءَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ نبی کریم ﷺ نے فرمایا ’’جب تم میں سے کوئی شخص لوگوں کو نماز پڑھائے تو ہلکی نماز پڑھائے۔کیونکہ ان میں کمزور،بیمار اور بڑی عمر کے لوگ ہوتے ہیں۔اور جب اپنی اکیلے نماز پڑھے،تو جتنی چاہے لمبی کر لے۔‘‘";
abudawood.hukam = "صحیح بخاری (703)";
abudawood.description = ``;