var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيِّبِ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ لِلنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمْ السَّقِيمَ وَالشَّيْخَ الْكَبِيرَ وَذَا الْحَاجَةِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’جب تم میں سے کوئی لوگوں کو نماز پڑھائے تو ہلکی نماز پڑھائے،کیونکہ ان میں بیمار،بڑی عمر کے اور کام کاج والے ہوتے ہیں۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (794)`;