var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسِ بْنِ سَعْدٍ وَعُمَارَةَ بْنِ مَيْمُونٍ وَحَبِيبٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّ أَبَا هُرَيْرَةَ قَالَ فِي كُلِّ صَلَاةٍ يُقْرَأُ فَمَا أَسْمَعَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْمَعْنَاكُمْ وَمَا أَخْفَى عَلَيْنَا أَخْفَيْنَا عَلَيْكُمْ";
abudawood.urdu = "جناب عطاء بن ابی رباح سے مروی ہے کہ سیدنا ابوہریرہ رسول اللہ ﷺ نے فرمایا ’’ہر نماز میں قرآت کی جاتی ہے۔رسول اللہ ﷺ نے جو ہمیں سنایا،ہم تمہیں سنواتے ہیں اور آپ ﷺ نے جو ہم سے مخفی رکھا ہم تم سے مخفی رکھتے ہیں۔‘‘";
abudawood.hukam = "صحیح بخاری (772) صحیح مسلم (396)";
abudawood.description = ``;