var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ كُنَّا نَتَوَضَّأُ نَحْنُ وَالنِّسَاءُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ نُدْلِي فِيهِ أَيْدِيَنَا";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ کے زمانے میں ہم (مرد) اور عورتیں ایک ہی برتن سے وضو کر لیا کرتے تھے اور اسی (ایک ہی برتن) میں اپنے ہاتھ ڈالتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;