var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ فَظَنَنَّا أَنَّهُ يُرِيدُ بِذَلِكَ أَنْ يُدْرِكَ النَّاسُ الرَّكْعَةَ الْأُولَى";
abudawood.urdu = "جناب عبداللہ بن ابی قتادہ اپنے والد (سیدنا ابوقتادہ رضی اللہ عنہ) سے بیان کرتے ہیں کہ ہم نے (نبی کریم ﷺ کے معمول سے) یہ سمجھا،آپ ﷺ چاہتے تھے کہ لوگ پہلی رکعت پا لیں۔";
abudawood.hukam = "صحیح بخاری (776) صحیح مسلم (451)";
abudawood.description = ``;