var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ عَنْ رَجُلٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُومُ فِي الرَّكْعَةِ الْأُولَى مِنْ صَلَاةِ الظُّهْرِ حَتَّى لَا يُسْمَعَ وَقْعُ قَدَمٍ";
abudawood.urdu = "سیدنا عبداللہ بن ابی اوفی رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ ظہر کی نماز کی پہلی رکعت میں اتنی دیر تک کھڑے رہتے کہ قدموں کی آوازیں نہ سنتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>’’ رجل ‘‘ مجہول،ولم یأت تعینہ فی السند المقبول<br>وحدیث البیہقي (66/2) ضعیف جدًا`;
abudawood.anwaar = [42,1];