var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ بِا لسَّمَاءِ وَالطَّارِقِ وَالسَّمَاءِ ذَاتِ الْبُرُوجِ وَنَحْوِهِمَا مِنْ السُّوَرِ";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ ظہر اور عصر میں سورۃ « والسماء والطارق » اور « والسماء ذات البروج » اور ان کی مثل سورتیں پڑھا کرتے تھے";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ الترمذي (307 وسندہ حسن) والنسائي (980 وسندہ حسن)`;