var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ سَمِعَ جَابِرَ بْنَ سَمُرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَحَضَتْ الشَّمْسُ صَلَّى الظُّهْرَ وَقَرَأَ بِنَحْوٍ مِنْ وَاللَّيْلِ إِذَا يَغْشَى وَالْعَصْرَ كَذَلِكَ وَالصَّلَوَاتِ كَذَلِكَ إِلَّا الصُّبْحَ فَإِنَّهُ كَانَ يُطِيلُهَا";
abudawood.urdu = "سیدنا جابر بن سمرہ رضی اللہ عنہ بیان کرتے تھے کہ رسول اللہ ﷺ جب سورج ڈھل جاتا تو ظہر کی نماز پڑھتے اور سورۃ « واللیل إذا یغشی» جیسی سورتیں پڑھتے تھے۔عصر اور باقی نمازوں میں بھی ایسے ہی قرآت ہوتی تھی،سوائے صبح کے۔اس میں آپ لمبی قرآت کیا کرتے تھے";
abudawood.hukam = "صحیح مسلم (459)";
abudawood.description = ``;