var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ وَيَزِيدُ بْنُ هَارُونَ وَهُشَيْمٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أُمَيَّةَ عَنْ أَبِي مِجْلَزٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي صَلَاةِ الظُّهْرِ ثُمَّ قَامَ فَرَكَعَ فَرَأَيْنَا أَنَّهُ قَرَأَ تَنْزِيلَ السَّجْدَةِ قَالَ ابْنُ عِيسَى لَمْ يَذْكُرْ أُمَيَّةَ أَحَدٌ إِلَّا مُعْتَمِرٌ";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے مروی ہے کہ نبی کریم ﷺ نے نماز ظہر میں سجدہ (تلاوت) کیا،پھر کھڑے ہو گئے پھر رکوع کیا،تو ہمیں معلوم ہوا کہ آپ ﷺ نے الم تنزیل السجدہ تلاوت کی تھی-ابن عیسیٰ کہتے ہیں امیہ کا ذکر صرف معتمر ہی نے کیا ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>سلیمان التیمي لم یسمعہ من أبي مجلز بل سمعہ من أمیۃ (انظر مسند أحمد 83/2)<br>وأمیۃ : مجہول کما فی التقریب (561)`;
abudawood.anwaar = [42,1];