var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِالطُّورِ فِي الْمَغْرِبِ";
abudawood.urdu = "جناب محمد بن جبیر بن مطعم اپنے والد سے روایت کرتے ہیں،انہوں نے کہا کہ میں نے رسول اللہ ﷺ کو سنا،آپ ﷺ مغرب (کی نماز) میں سورۃ والطور کی قرآت کر رہے تھے۔";
abudawood.hukam = "صحیح بخاری (765) صحیح مسلم (463)";
abudawood.description = ``;