var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ أَنَّ أَبَاهُ كَانَ يَقْرَأُ فِي صَلَاةِ الْمَغْرِبِ بِنَحْوِ مَا تَقْرَءُونَ وَالْعَادِيَاتِ وَنَحْوِهَا مِنْ السُّوَرِ قَالَ أَبُو دَاوُد هَذَا يَدُلُّ عَلَى أَنَّ ذَاكَ مَنْسُوخٌ قَالَ أَبُو دَاوُد وَهَذَا أَصَحُّ";
abudawood.urdu = "جناب ہشام بن عروہ کا بیان ہے کہان کے والد (عروہ بن زبیر) مغرب میں اسی طرح کی سورتیں پڑھتے تھے جیسی تم لوگ پڑھتے ہو یعنی «والعادیات» وغیرہ۔امام ابوداؤد رحمہ اللہ نے کہا یہ دلیل ہے کہ مغرب میں تطویل قرآت منسوخ ہے۔اور امام ابوداؤد رحمہ اللہ نے کہا کہ یہی زیادہ صحیح ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ` وقول أبي داود رحمہ اللہ غیر صحیح`;