var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ السَّرْخَسِيُّ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ يُحَدِّثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّهُ قَالَ مَا مِنْ الْمُفَصَّلِ سُورَةٌ صَغِيرَةٌ وَلَا كَبِيرَةٌ إِلَّا وَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّ النَّاسَ بِهَا فِي الصَّلَاةِ الْمَكْتُوبَةِ";
abudawood.urdu = "سیدنا عمرو بن شعیب اپنے والد (شعیب) سے اور وہ اپنے دادا سے روایت کرتے ہیں کہ جزو مفصل کی کوئی چھوٹی بڑی سورت نہیں جو میں نے رسول اللہ ﷺ سے نہ سنی ہو،آپ ﷺ اسے فرض نمازوں کی امامت کراتے ہوئے پڑھتے تھے";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>محمد بن إسحاق عنعن<br>ولحدیثہ شاہد ضعیف،انظر مجمع الزوائد (2/ 114)`;
abudawood.anwaar = [42,1];