var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا قُرَّةُ عَنْ النَّزَّالِ بْنِ عَمَّارٍ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ أَنَّهُ صَلَّى خَلْفَ ابْنِ مَسْعُودٍ الْمَغْرِبَ فَقَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ";
abudawood.urdu = "جناب ابوعثمان نہدی سے مروی ہے کہ انہوں نے سیدنا عبداللہ بن مسعود رضی اللہ عنہ کے پیچھے مغرب کی نماز پڑھی تو انہوں نے «قل ہو اللہ أحد» تلاوت کی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>النزال بن عمار: مستورلم یوثقہ غیر ابن حبان،انظر تحریر تقریب التہذیب (7106)`;
abudawood.anwaar = [42,1];