var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ ابْنِ أَبِي هِلَالٍ عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ أَنَّ رَجُلًا مِنْ جُهَيْنَةَ أَخْبَرَهُ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الصُّبْحِ إِذَا زُلْزِلَتْ الْأَرْضُ فِي الرَّكْعَتَيْنِ كِلْتَيْهِمَا فَلَا أَدْرِي أَنَسِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ قَرَأَ ذَلِكَ عَمْدًا";
abudawood.urdu = "جناب معاذ بن عبداللہ جہنی کا بیان ہے کہ بنو جہینہ کے ایک شخص نے نبی کریم ﷺ کو سنا کہ آپ ﷺ فجر کی نماز میں دونوں رکعات میں «إذا زلزلت الأرض» پڑھ رہے تھے۔مجھے نہیں معلوم کہ آپ بھول گئے تھے یا عمداً اس کی قرآت کی تھی۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (862)`;