var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ إِسْمَعِيلَ عَنْ أَصْبَغَ مَوْلَى عَمْرِو بْنِ حُرَيْثٍ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ كَأَنِّي أَسْمَعُ صَوْتَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الْغَدَاةِ فَلَا أُقْسِمُ بِالْخُنَّسِ الْجَوَارِي الْكُنَّسِ";
abudawood.urdu = "سیدنا عمرو بن حریث رضی اللہ عنہ روایت کرتے ہیں کہ گویا میں نبی کریم ﷺ کی آواز سن رہا ہوں آپ ﷺ فجر کی نماز میں « فلا أقسم بالخنس * الجوار الکنس ‏ » (سورۃ التکویر) پڑھ رہے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `ورواہ مسلم (456) من حدیث الولید بن سریع عن عمرو بن حریث مطولًا`;