var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ أُمِرْنَا أَنْ نَقْرَأَ بِفَاتِحَةِ الْكِتَابِ وَمَا تَيَسَّرَ";
abudawood.urdu = "سیدنا ابوسعید رضی اللہ عنہ بیان کرتے ہیں کہ ہمیں حکم دیا گیا کہ ہم (نماز میں) فاتحہ اور جو میسر ہو (یعنی قرآن میں سے) پڑھا کریں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>قتادۃ عنعن وقال البخاري في جزء القراء ۃ (70) : ’’ ولم یذکر قتادۃ سماعًا من أبي نضرۃ في ھذا ‘‘`;
abudawood.anwaar = [42,1];