var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى عَنْ جَعْفَرِ بْنِ مَيْمُونٍ الْبَصْرِيِّ حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْرُجْ فَنَادِ فِي الْمَدِينَةِ أَنَّهُ لَا صَلَاةَ إِلَّا بِقُرْآنٍ وَلَوْ بِفَاتِحَةِ الْكِتَابِ فَمَا زَادَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے کہا کہ مجھ سے رسول اللہ ﷺ نے فرمایا ’’جاؤ اور مدینے میں اعلان کر دو کہ قرآن (کی قرآت) کے بغیر نماز نہیں خواہ فاتحۃ الکتاب (سورۃ فاتحہ) ہو اور کچھ زیادہ۔خواہ فاتحۃ الکتاب ہو اور کچھ زیادہ۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>جعفر بن میمون ضعفہ الجمہور`;
abudawood.anwaar = [42,1];