var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ يَعْنِي الطَّيَالِسِيَّ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ عَنْ أَبِي حَاجِبٍ عَنْ الْحَكَمِ بْنِ عَمْرٍو وَهُوَ الْأَقْرَعُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ طَهُورِ الْمَرْأَةِ";
abudawood.urdu = "حکم بن عمرو،اور یہ اقرع ہیں،سے روایت ہے کہ نبی کریم ﷺ نے اس بات سے منع فرمایا ہے کہ مرد،عورت کے بچے ہوئے پانی سے وضو کرے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (471)`;