var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا جَعْفَرٌ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُنَادِيَ أَنَّهُ لَا صَلَاةَ إِلَّا بِقِرَاءَةِ فَاتِحَةِ الْكِتَابِ فَمَا زَادَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے مجھے حکم دیا کہ میں اعلان کر دوں کہ قرآت فاتحہ اور کچھ مزید کے بغیر نماز نہیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق(819)`;
abudawood.anwaar = [42,1];