var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ السَّرْحِ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مَحْمُودِ بْنِ الرَّبِيعِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ بِفَاتِحَةِ الْكِتَابِ فَصَاعِدًا قَالَ سُفْيَانُ لِمَنْ يُصَلِّي وَحْدَهُ";
abudawood.urdu = "سیدنا عبادہ بن صامت رضی اللہ عنہ نبی کریم ﷺ کی طرف نسبت کرتے ہوئے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جو شخص سورۃ فاتحہ اور کچھ مزید نہ پڑھے اس کی نماز نہیں۔‘‘ جناب سفیان نے کہا اس سے مراد یہ ہے کہ جب کوئی شخص اکیلا پڑھ رہا ہو (تو یہ حکم ہے";
abudawood.hukam = "صحیح مسلم (394)";
abudawood.description = ``;