var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ أَخْبَرَنَا أَبُو إِسْحَقَ يَعْنِي الْفَزَارِيَّ عَنْ حُمَيْدٍ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا نُصَلِّي التَّطَوُّعَ نَدْعُو قِيَامًا وَقُعُودًا وَنُسَبِّحُ رُكُوعًا وَسُجُودًا";
abudawood.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں کہ ہم نفل پڑھا کرتے تو قیام اور قعود میں دعا کیا کرتے تھے اور رکوع اور سجدے میں تسبیحات۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الحسن البصري مدلس و عنعن ولم یسمع من سیدنا جابر رضي اللّٰہ عنہ`;
abudawood.anwaar = [43,1];