var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ مِثْلَهُ لَمْ يَذْكُرْ التَّطَوُّعَ قَالَ كَانَ الْحَسَنُ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ إِمَامًا أَوْ خَلْفَ إِمَامٍ بِفَاتِحَةِ الْكِتَابِ وَيُسَبِّحُ وَيُكَبِّرُ وَيُهَلِّلُ قَدْرَ ق وَالذَّارِيَاتِ";
abudawood.urdu = "جناب حمید نے مذکورہ بالا حدیث کی مانند روایت کیا اور نفل کا ذکر نہیں کیا یہ بھی کہا کہ حسن بصری رحمہ اللہ ظہر اور عصر میں امام ہوتے ہوئے یا امام کے پیچھے بھی سورہ فاتحہ پڑھتے اور سبحان اللہ ‘اللہ اکبر اورلا الہ الّا اللہ کہتے اور(سورہ‘ ق) اور الذاریات کے بقدر کہتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (833) وثبت عن الحسن البصري القول بالفاتحۃ خلف الإمام،أخرجہ ابن أبي شیبۃ (374/1)`;
abudawood.anwaar = [43,1];