var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ حَسَنٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْمِدُ أَحَدُكُمْ فِي صَلَاتِهِ فَيَبْرُكُ كَمَا يَبْرُكُ الْجَمَلُ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’(کیا) تم میں سے کوئی ایک اپنی نماز میں اس طرح بیٹھنے کا قصد کرتا ہے جس طرح اونٹ بیٹھتا ہے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `أخرجہ النسائي (1091 وسندہ حسن) وانظر الحدیث السابق (840)`;