var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا هُشَيْمٌ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ فِي وِتْرٍ مِنْ صَلَاتِهِ لَمْ يَنْهَضْ حَتَّى يَسْتَوِيَ قَاعِدًا";
abudawood.urdu = "جناب ابوقلابہ،سیدنا مالک بن حویرث رضی اللہ عنہ سے روایت کرتے ہیں کہ انہوں نے نبی کریم ﷺ کو دیکھا تھا جب آپ ﷺ اپنی نماز کی طاق رکعت میں ہوتے تو اس وقت تک کھڑے نہ ہوتے تھے جب تک کہ درست ہو کر بیٹھ نہ جاتے۔";
abudawood.hukam = "صحیح بخاری (823)";
abudawood.description = ``;