var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ طَاوُسًا يَقُولُ قُلْنَا لِابْنِ عَبَّاسٍ فِي الْإِقْعَاءِ عَلَى الْقَدَمَيْنِ فِي السُّجُودِ فَقَالَ هِيَ السُّنَّةُ قَالَ قُلْنَا إِنَّا لَنَرَاهُ جُفَاءً بِالرَّجُلِ فَقَالَ ابْنُ عَبَّاسٍ هِيَ سُنَّةُ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "جناب طاؤس فرماتے تھے کہ ہم نے سیدنا ابن عباس رضی اللہ عنہما سے دو سجدوں کے درمیان ایڑیوں پر بیٹھنے کے متعلق پوچھا: تو انہوں نے کہا: یہ سنت ہے۔ہم نے کہا: ہم تو اسے پاؤں پر بوجھ یا آدمی کے لیے باعث مشقت خیال کرتے ہیں۔سیدنا ابن عباس رضی اللہ عنہما نے کہ یہ آپ کے نبی ﷺ کی سنت ہے۔";
abudawood.hukam = "صحیح مسلم (536)";
abudawood.description = ``;