var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ عَنْ دَاوُدَ عَنْ عَامِرٍ عَنْ عَلْقَمَةَ قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ مَنْ كَانَ مِنْكُمْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْجِنِّ فَقَالَ مَا كَانَ مَعَهُ مِنَّا أَحَدٌ";
abudawood.urdu = "علقمہ کہتے ہیں کہ میں نے سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے دریافت کیا کہ (رسول اللہ ﷺ کی) جنوں سے ملاقات والی رات آپ لوگوں میں سے کون رسول اللہ ﷺ کے ساتھ تھا؟ تو انہوں نے کہا کہ ہم میں سے کوئی بھی آپ ﷺ کے ساتھ نہ تھا۔";
abudawood.hukam = "صحیح مسلم (450)";
abudawood.description = ``;