var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَسْعُودٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا كَامِلٌ أَبُو الْعَلَاءِ حَدَّثَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ بَيْنَ السَّجْدَتَيْنِ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَاهْدِنِي وَارْزُقْنِي";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے روایت ہے کہ نبی کریم ﷺ دو سجدوں کے درمیان یہ دعا پڑھا کرتے تھے «اللہم اغفر لی وارحمنی وعافنی واہدنی وارزقنی » ’’اے اللہ! مجھے بخش دے! مجھ پر رحم فرما! مجھے عافیت دے اور ہدایت دے اور مجھے رزق دے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (284) ابن ماجہ (898)<br>حبیب بن أبي ثابت مدلس وعنعن<br>وقدثبت عن مکحول أنہ کان یقولھا بین السجدتین نحو المعنی (المعجم لابن المقریٔ :1357 وسندہ صحیح)`;
abudawood.anwaar = [43,1];