var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ سُجُودُهُ وَرُكُوعُهُ وَقُعُودُهُ وَمَا بَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ";
abudawood.urdu = "سیدنا براء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ کا سجدہ،رکوع اور دو سجدوں کے درمیان بیٹھنا قریب قریب برابر ہوا کرتا تھا۔";
abudawood.hukam = "صحیح بخاری (792) صحیح مسلم (471)";
abudawood.description = ``;