var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ أَنَّهُ كَرِهَ الْوُضُوءَ بِاللَّبَنِ وَالنَّبِيذِ وَقَالَ إِنَّ التَّيَمُّمَ أَعْجَبُ إِلَيَّ مِنْهُ";
abudawood.urdu = "جناب عطاء بن ابی رباح رحمہ اللہ سے منقول ہے کہ انہوں نے دودھ اور نبیذ سے وضو کو مکروہ کہا ہے۔اور فرمایا کہ مجھے ان سے وضو کرنے کی بجائے تیمم کرنا زیادہ پسند ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `روایۃ ابن جریج عن عطاء محمولۃ علی السماع`;