var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ حُمَيْدٍ،عَنْ الْحَسَنِ،عَنْ رَجُلٍ مِنْ بَنِي سَلِيطٍ،عَنْ أَبِي هُرَيْرَةَ،عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ.";
abudawood.urdu = "بنی سلیط کے ایک شخص نے سیدنا ابوہریرہ رضی اللہ عنہ سے اسی (مذکورہ بالا حدیث) کی مانند روایت کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1425)<br>الحسن البصري مدلس و عنعن وتابعہ علي بن زید بن جدعان وھو ضعیف`;
abudawood.anwaar = [44,1];