var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ،حَدَّثَنَا حَمَّادٌ،عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ،عَنْ زُرَارَةَ بْنِ أَوْفَى،عَنْ تَمِيمٍ الدَّارِيِّ،عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ, بِهَذَا الْمَعْنَى... قَالَ: ثُمَّ الزَّكَاةُ مِثْلُ ذَلِكَ،ثُمَّ تُؤْخَذُ الْأَعْمَالُ عَلَى حَسَبِ ذَلِكَ.";
abudawood.urdu = "جناب زرارہ بن اوفی نے سیدنا تمیم داری رضی اللہ عنہ سے انہوں نے نبی کریم ﷺ سے اسی کے ہم معنی بیان کیا۔کہا ’’پھر زکوٰۃ کا محاسبہ ہو گا۔پھر باقی اعمال اسی انداز سے لیے جائیں گے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1330)
أخرجہ ابن ماجہ (1426 وسندہ حسن)`;