var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ وَمُوسَى بْنُ إِسْمَاعِيلَ الْمَعْنَى،قَالَا: حَدَّثَنَا ابْنُ الْمُبَارَكِ،عَنْ مُوسَى قَالَ أَبُو سَلَمَةَ مُوسَى بْنِ أَيُّوبَ،عَنْ عَمِّهِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،قَالَ: لَمَّا نَزَلَتْ فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ[الواقعة: 74], قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اجْعَلُوهَا فِي رُكُوعِكُمْ،فَلَمَّا نَزَلَتْ سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى[أول سورة الأعلى], قَالَ: اجْعَلُوهَا فِي سُجُودِكُمْ.";
abudawood.urdu = "سیدنا عقبہ بن عامر رضی اللہ عنہ بیان کرتے ہیں کہ جب «فسبح باسم ربک العظیم» نازل ہوئی تو رسول اللہ ﷺ نے فرمایا ’’اسے اپنے رکوع میں کرو۔‘‘ (یعنی «سبحان ربی العظیم» کہا کرو) اور جب «سبح اسم ربک الأعلی» نازل ہوئی تو فرمایا ’’اسے اپنے سجدوں میں کرو۔‘‘ (یعنی «سبحان ربی الأعلی» کہا کرو)۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (879)
أخرجہ ابن ماجہ (887 وسندہ صحیح) وصححہ ابن خزیمۃ (600، 601، 670 وسندھم صحیح)`;