var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا أَبُو خَلْدَةَ قَالَ سَأَلْتُ أَبَا الْعَالِيَةِ عَنْ رَجُلٍ أَصَابَتْهُ جَنَابَةٌ وَلَيْسَ عِنْدَهُ مَاءٌ وَعِنْدَهُ نَبِيذٌ أَيَغْتَسِلُ بِهِ قَالَ لَا";
abudawood.urdu = "ابوخلدہ کہتے ہیں کہ میں نے جناب ابوالعالیہ (تابعی) سے پوچھا کہ ایک شخص جسے جنابت لاحق ہوئی ہو،اس کے پاس پانی نہ ہو مگر نبیذ (کھجور یا کشمش کا پانی) موجود ہو تو کیا وہ اس سے غسل کر لے؟ انہوں نے فرمایا: نہیں۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;