var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ حَدَّثَنَا قَتَادَةُ عَنْ مُطَرِّفٍ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے مروی ہے کہ نبی کریم ﷺ اپنے سجدہ اور رکوع میں یہ دعا پڑھا کرتے تھے ’’«سبوح قدوس رب الملائکۃ والروح» میرا رب شراکت،ساجھے داری اور دیگر تمام نقائص و عیوب سے بالکل پاک ہے۔فرشتوں کا رب ہے اور روح کا بھی۔‘‘";
abudawood.hukam = "صحیح مسلم (487)";
abudawood.description = ``;