var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ أَنْ يَقُولَ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ اپنے رکوع اور سجدے میں کثرت سے یہ دعا پڑھا کرتے تھے «سبحانک اللہم ربنا وبحمدک اللہم اغفر لی» ’’پاک ہے تو اے اللہ! اے ہمارے رب! اور اپنی حمد کے ساتھ۔اے اللہ! مجھے بخش دے۔‘‘ آپ ﷺ اس دعا سے قرآنی تعلیم پر عمل فرماتے تھے۔";
abudawood.hukam = "صحیح بخاری (4968) صحیح مسلم (484)";
abudawood.description = ``;