var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ قَالَ صَلَّيْتُ إِلَى جَنْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ تَطَوُّعٍ فَسَمِعْتُهُ يَقُولُ أَعُوذُ بِاللَّهِ مِنْ النَّارِ وَيْلٌ لِأَهْلِ النَّارِ";
abudawood.urdu = "جناب عبدالرحمٰن بن ابی لیلیٰ اپنے والد سے بیان کرتے ہیں،کہا کہ میں نے (ایک بار) رسول اللہ ﷺ کے پہلو میں کھڑے ہو کر نفل نماز پڑھی۔میں نے آپ ﷺ کو سنا کہتے تھے «أعوذ باللہ من النار ویل لأہل النار» ’’آگ سے اللہ کی پناہ۔ہلاکت ہے دوزخیوں کے لیے۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (1352)<br>ابن أبي لیلی ضعیف`;
abudawood.anwaar = [44,1];