var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ السَّعْدِيِّ عَنْ أَبِيهِ أَوْ عَنْ عَمِّهِ قَالَ رَمَقْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاتِهِ فَكَانَ يَتَمَكَّنُ فِي رُكُوعِهِ وَسُجُودِهِ قَدْرَ مَا يَقُولُ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ثَلَاثًا";
abudawood.urdu = "جناب سعید جریری،سعدی سے وہ اپنے والد یا چچا سے روایت کرتے ہیں،انہوں نے کہا کہ میں نے نبی کریم ﷺ کو ان کی نماز میں بڑے غور سے دیکھا ہے۔آپ ﷺ اپنے رکوع اور سجدے میں اتنی دیر رکتے تھے کہ «سبحان اللہ وبحمدہ» تین بار کہہ لیں۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>السعدي لا یعرف ولم یسم (تقریب التہذیب: 8499) وقال المنذري فیہ : ’’ مجہول ‘‘<br>وأخرج ابن أبي شیبۃ (250/1) بإسناد صحیح عن الحسن البصري قال :’’ التام من السجود قدر سبع تسبیحات والمجزئ ثلاث ‘‘`;
abudawood.anwaar = [44,2];