var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ وَسُلَيْمَانُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ قَالَ حَمَّادٌ أُمِرَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةٍ وَلَا يَكُفَّ شَعْرًا وَلَا ثَوْبًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نبی کریم ﷺ سے روایت کرتے ہیں کہآپ ﷺ نے فرمایا ’’مجھے حکم دیا گیا ہے‘‘ حماد کے الفاظ ہیں،تمہارے نبی ﷺ کو حکم دیا گیا ہے کہ‘‘ سات (اعضاء) پر سجدہ کریں اور اس دوران میں اپنے بالوں یا کپڑوں کو نہ سمیٹیں۔‘‘";
abudawood.hukam = "صحیح بخاری (815) صحیح مسلم (490)";
abudawood.description = ``;