var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ وَرُبَّمَا قَالَ أُمِرَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةِ آرَابٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نبی کریم ﷺ سے روایت کرتے ہیں کہآپ ﷺ نے فرمایا ’’مجھے حکم دیا گیا ہے۔‘‘ اور بعض اوقات کہتے،تمہارے نبی ﷺ کو حکم دیا گیا ہے کہ ’’سات اعضاء پر سجدہ کریں۔‘‘";
abudawood.hukam = "صحیح بخاری (815) صحیح مسلم (490)";
abudawood.description = ``;