var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ عَنْ ابْنِ الْهَادِي عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَجَدَ الْعَبْدُ سَجَدَ مَعَهُ سَبْعَةُ آرَابٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ";
abudawood.urdu = "سیدنا عباس بن عبدالمطلب رضی اللہ عنہ سے مروی ہے انہوں نے رسول اللہ ﷺ کو یہ فرماتے سنا کہ ’’بندہ جب سجدہ کرتا ہے تو اس کے ساتھ سات اعضاء سجدہ کرتے ہیں: چہرہ،دونوں ہاتھ،دونوں گھٹنے اور دونوں پاؤں۔‘‘";
abudawood.hukam = "صحیح مسلم (491)";
abudawood.description = ``;