var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَفَعَهُ قَالَ إِنَّ الْيَدَيْنِ تَسْجُدَانِ كَمَا يَسْجُدُ الْوَجْهُ فَإِذَا وَضَعَ أَحَدُكُمْ وَجْهَهُ فَلْيَضَعْ يَدَيْهِ وَإِذَا رَفَعَهُ فَلْيَرْفَعْهُمَا";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما مرفوعاً بیان کرتے ہیں کہ ہاتھ بھی سجدہ کرتے ہیں جیسے کہ چہرہ سجدہ کرتا ہے۔جب تم میں سے کوئی (سجدے میں زمین پر) اپنا چہرہ رکھے تو ہاتھ بھی (زمین پر) رکھے اور جب (چہرہ) اٹھائے تو انہیں بھی اٹھا لے۔‘‘";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (905)
أخرجہ النسائي (1093 وسندہ صحیح)`;