var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ أَنَّ سَعِيدَ بْنَ الْحَكَمِ حَدَّثَهُمْ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ حَدَّثَنِي يَحْيَى بْنُ أَبِي سُلَيْمَانَ عَنْ زَيْدِ بْنِ أَبِي الْعَتَّابِ وَابْنِ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جِئْتُمْ إِلَى الصَّلَاةِ وَنَحْنُ سُجُودٌ فَاسْجُدُوا وَلَا تَعُدُّوهَا شَيْئًا وَمَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ الصَّلَاةَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تم نماز کے لیے آؤ اور ہم سجدے میں ہوں تو تم بھی سجدہ کرو اور اسے کچھ شمار نہ کرو-اور جس نے رکعت کو پا لیا اس نے نماز کو پا لیا۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `ضعیف<br>یحیی بن أبي سلیمان ضعفہ الجمہور وقال فی التقریب (7565) : ’’ لین الحدیث ‘‘ وللحدیث شواہد ضعیفۃ`;
abudawood.anwaar = [45,1];