var abudawood = {};
abudawood.arabic = "حَدَّثَنَا ابْنُ الْمُثَنَّى،حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى،حَدَّثَنَا مَعْمَرٌ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُئِيَ عَلَى جَبْهَتِهِ وَعَلَى أَرْنَبَتِهِ أَثَرُ طِينٍ, مِنْ صَلَاةٍ صَلَّاهَا بِالنَّاسِ.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے لوگوں کو ایک نماز پڑھائی تو اس میں دیکھا گیا کہ آپ ﷺ کی پیشانی اور ناک کے بانسے پر کیچڑ کا نشان تھا۔";
abudawood.hukam = "صحیح بخاری (813) صحیح مسلم (1167)";
abudawood.description = ``;