var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ قَالَ وَصَفَ لَنَا الْبَرَاءُ بْنُ عَازِبٍ فَوَضَعَ يَدَيْهِ وَاعْتَمَدَ عَلَى رُكْبَتَيْهِ وَرَفَعَ عَجِيزَتَهُ وَقَالَ هَكَذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ";
abudawood.urdu = "جناب ابواسحاق بیان کرتے ہیں کہ سیدنا براء بن عازب رضی اللہ عنہ نے ہمیں سجدہ کر کے دکھایا۔یوں کہ انہوں نے (پہلے) اپنے ہاتھ رکھے،اپنے گھٹنوں پر ٹیک لگائی اور اپنی سرین کو اونچا کیا اور کہا: رسول اللہ ﷺ اس طرح سجدہ کیا کرتے تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>نسائی (1105)<br>شریک عنعن`;
abudawood.anwaar = [45,1];