var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ اعْتَدِلُوا فِي السُّجُودِ،وَلَا يَفْتَرِشْ أَحَدُكُمْ ذِرَاعَيْهِ افْتِرَاشَ الْكَلْبِ.";
abudawood.urdu = "سیدنا انس رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’سجدہ صحیح طرح (سکون) سے کیا کرو۔اور تم میں سے کوئی کتے کی طرح اپنے ہاتھ نہ پھیلائے۔‘‘";
abudawood.hukam = "صحیح بخاری (822) صحیح مسلم (494)";
abudawood.description = ``;