var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا سُفْيَانُ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ عَمِّهِ يَزِيدَ بْنِ الْأَصَمِّ،عَنْ مَيْمُونَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَان:َ إِذَا سَجَدَ جَافَى بَيْنَ يَدَيْهِ،حَتَّى لَوْ أَنَّ بَهْمَةً أَرَادَتْ أَنْ تَمُرَّ تَحْتَ يَدَيْهِ, مَرَّتْ.";
abudawood.urdu = "ام المؤمنین سیدہ میمونہ رضی اللہ عنہا بیان فرماتی ہیں کہ نبی کریم ﷺ جب سجدہ کرتے تو اپنے ہاتھوں کو اپنے پہلوؤں سے دور رکھتے تھے حتیٰ کہ اگر بکری کا بچہ آپ ﷺ کے ہاتھوں کے نیچے سے گزرنا چاہتا،تو گزر سکتا تھا۔";
abudawood.hukam = "صحیح مسلم (496)";
abudawood.description = `مشکوۃ المصابیح (890)`;