var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا أَبُو إِسْحَاقَ عَنِ التَّمِيمِيِّ الَّذِي يُحَدِّثُ بِالتَّفْسِيرِ عَنِ ابْنِ عَبَّاسٍ،قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خَلْفِهِ،فَرَأَيْتُ بَيَاضَ إِبِطَيْهِ،وَهُوَ مُجَخٍّ, قَدْ فَرَّجَ بَيْنَ يَدَيْهِ.";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نے کہا میں نبی کریم ﷺ کے پیچھے سے آیا (جبکہ آپ ﷺ سجدے میں تھے) تو میں نے آپ ﷺ کی بغلوں کی سفیدی دیکھی۔آپ ﷺ نے اپنی کمر کو اٹھایا ہوا تھا،پیٹ زمین سے اونچا تھا اور بازو پہلوؤں سے دور تھے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن<br>والحدیث الآتي فی الأصل (900) یغني عنہ`;
abudawood.anwaar = [45,1];