var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ حَدَّثَنَا الْحَسَنُ حَدَّثَنَا أَحْمَرُ بْنُ جَزْءٍ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ جَافَى عَضُدَيْهِ عَنْ جَنْبَيْهِ حَتَّى نَأْوِيَ لَهُ";
abudawood.urdu = "سیدنا احمر بن جزء رضی اللہ عنہ صحابی رسول ﷺ بیان کرتے ہیں کہ رسول اللہ ﷺ جب سجدہ کرتے تو اپنے ہاتھوں کو اپنے پہلوؤں سے (اس قدر) دور رکھتے تھے کہ ہمیں (آپ کی مشقت کو دیکھتے ہوئے) آپ پر ترس آتا۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `أخرجہ ابن ماجہ (886 وسندہ حسن)`;