var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا اللَّيْثُ عَنْ دَرَّاجٍ عَنْ ابْنِ حُجَيْرَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَجَدَ أَحَدُكُمْ فَلَا يَفْتَرِشْ يَدَيْهِ افْتِرَاشَ الْكَلْبِ وَلْيَضُمَّ فَخْذَيْهِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جب تم میں سے کوئی سجدہ کرے تو اپنے ہاتھوں کو (زمین پر) کتے کی طرح نہ پھیلائے اور اپنی رانوں کو ملا کر رکھے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `صححہ ابن خزیمۃ (653 وسندہ حسن)`;