var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ اشْتَكَى أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَشَقَّةَ السُّجُودِ عَلَيْهِمْ إِذَا انْفَرَجُوا فَقَالَ اسْتَعِينُوا بِالرُّكَبِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ صحابہ کرام رضی اللہ عنہم نے نبی کریم ﷺ سے شکایت کی کہ جب وہ سجدے میں اپنے بازؤوں کو کھلے کرتے ہیں تو اس سے بہت مشقت ہوتی ہے،تو آپ ﷺ نے فرمایا ’’اپنے گھٹنوں سے مدد لے لیا کرو۔‘‘";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (286)<br>ابن عجلان مدلس و عنعن`;
abudawood.anwaar = [45,1];