var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ سَعِيدِ بْنِ زِيَادٍ عَنْ زِيَادِ بْنِ صَبِيحٍ الْحَنَفِيِّ قَالَ صَلَّيْتُ إِلَى جَنْبِ ابْنِ عُمَرَ فَوَضَعْتُ يَدَيَّ عَلَى خَاصِرَتَيَّ فَلَمَّا صَلَّى قَالَ هَذَا الصَّلْبُ فِي الصَّلَاةِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُ";
abudawood.urdu = "جناب زیاد بن صبیح حنفی بیان کرتے ہیں کہ میں نے سیدنا ابن عمر رضی اللہ عنہما کے ساتھ کھڑے ہو کر نماز پڑھی،میں نے اس دوران میں اپنے ہاتھ اپنے پہلوؤں (کوکھوں) پر رکھ لیے۔جب وہ نماز سے فارغ ہوئے تو فرمایا: یہ کیفیت نماز میں صلیب («مصلوب») سے مشابہت ہے اور رسول اللہ ﷺ اس سے منع فرمایا کرتے تھے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `أخرجہ النسائي (892 وسندہ صحیح)`;