var abudawood = {};
abudawood.arabic = "حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ أَخْبَرَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ ثَابِتٍ عَنْ مُطَرِّفٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَفِي صَدْرِهِ أَزِيزٌ كَأَزِيزِ الرَّحَى مِنْ الْبُكَاءِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
abudawood.urdu = "جناب مطرف اپنے والد سے بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا آپ ﷺ نماز پڑھ رہے تھے اور آپ ﷺ کے سینے سے رونے کی وجہ سے ایسے آواز آ رہی تھی جیسے کوئی چکی سی چل رہی ہو";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = `مشکوۃ المصابیح (1000)
أخرجہ النسائي (1215 وسندہ صحیح) والترمذي فی الشمائل (321 وسندہ صحیح) `;