var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ سَمِعْتُ أَبَا الْأَحْوَصِ يُحَدِّثُنَا فِي مَجْلِسِ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ قَالَ أَبُو ذَرٍّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ اللَّهُ عَزَّ وَجَلَّ مُقْبِلًا عَلَى الْعَبْدِ وَهُوَ فِي صَلَاتِهِ مَا لَمْ يَلْتَفِتْ فَإِذَا الْتَفَتَ انْصَرَفَ عَنْهُ";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ہے ’’بندہ جب نماز میں ہوتا ہے تو اللہ عزوجل اس کی طرف برابر متوجہ رہتا ہے جب تک کہ وہ ادھر ادھر نہ دیکھے۔جب وہ ادھر ادھر دیکھنے لگ جائے تو اللہ بھی اس سے منہ موڑ لیتا ہے۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح (995)
أخرجہ النسائي (1196 وسندہ حسن) وصححہ ابن خزیمۃ (481، 482 وسندھما حسن)`;