var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَشْعَثِ يَعْنِي ابْنَ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْتِفَاتِ الرَّجُلِ فِي الصَّلَاةِ فَقَالَ إِنَّمَا هُوَ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ صَلَاةِ الْعَبْدِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،وہ کہتی ہیں کہ میں نے رسول اللہ ﷺ سے پوچھا کہ آدمی کا نماز کے دوران میں ادھر ادھر دیکھنا کیسا ہے؟ آپ ﷺ نے فرمایا ’’یہ اچکنا ہے۔اس طرح سے شیطان بندے کی نماز سے اچک لیتا ہے۔‘‘";
abudawood.hukam = "صحیح بخاری (751)";
abudawood.description = ``;