var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ فِي صَلَاتِهِمْ فَاشْتَدَّ قَوْلُهُ فِي ذَلِكَ فَقَالَ لَيَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ نے بیان کیا کہ رسول اللہ ﷺ نے فرمایا ’’لوگوں کو کیا ہوا ہے کہ اپنی نمازوں کے دوران نظریں اٹھا لیتے ہیں؟‘‘ آپ ﷺ کا فرمان اس بارے میں بڑا سخت ہو گیا اور فرمایا ’’یہ لوگ اپنے اس عمل سے باز آ جائیں ورنہ ان کی نظریں اچک لی جائیں گی۔‘‘";
abudawood.hukam = "صحیح بخاری (750)";
abudawood.description = ``;