var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خَمِيصَةٍ لَهَا أَعْلَامٌ فَقَالَ شَغَلَتْنِي أَعْلَامُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَأْتُونِي بِأَنْبِجَانِيَّتِهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ نے ایک اونی چادر میں نماز پڑھی،اس میں کچھ نقش و نگار تھے-آپ ﷺ نے فرمایا ’’مجھے اس کے نقوش الجھانے لگے تھے۔اسے ابوجہم کے پاس لے جاؤ اور میرے پاس انبجانی چادر لے آؤ۔‘‘ (یعنی جس میں نقش نہیں ہوتے)۔";
abudawood.hukam = "صحیح بخاری (752) صحیح مسلم (556)";
abudawood.description = ``;