var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ أَبِي الزِّنَادِ قَالَ سَمِعْتُ هِشَامًا يُحَدِّثُ عَنْ أَبِيهِ عَنْ عَائِشَةَ بِهَذَا الْخَبَرِ قَالَ وَأَخَذَ كُرْدِيًّا كَانَ لِأَبِي جَهْمٍ فَقِيلَ يَا رَسُولَ اللَّهِ الْخَمِيصَةُ كَانَتْ خَيْرًا مِنْ الْكُرْدِيِّ";
abudawood.urdu = "جناب ہشام نے اپنے والد سے انہوں نے سیدہ عائشہ رضی اللہ عنہا سے یہ حدیث بیان کی کہ آپ ﷺ نے ابوجہم کی (چادروں میں سے) کردی چادر لے لی۔آپ ﷺ سے کہا گیا کہ اونی (منقش) چادر اس کردی سے عمدہ تھی۔";
abudawood.hukam = "إسنادہ حسن، صحیح مسلم (556)";
abudawood.description = ``;