var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،حَدَّثَنَا مَالِكٌ،عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ عَمْرِو بْنِ سُلَيْمٍ،عَنْ أَبِي قَتَادَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَإِذَا سَجَدَ وَضَعَهَا،وَإِذَا قَامَ حَمَلَهَا.";
abudawood.urdu = "سیدنا ابوقتادہ رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ (بعض اوقات اپنی نواسی) امامہ بنت زینب رضی اللہ عنہا کو اٹھا کر نماز پڑھاتے تھے۔جب سجدہ کرتے تو اسے بٹھا دیتے اور جب کھڑے ہوتے تو اسے اٹھا لیتے۔";
abudawood.hukam = "صحیح بخاری (516) صحیح مسلم (543)";
abudawood.description = ``;