var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ بِالصَّاعِ وَيَتَوَضَّأُ بِالْمُدِّ قَالَ أَبُو دَاوُد رَوَاهُ أَبَانُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ صَفِيَّةَ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ ایک صاع پانی سے غسل اور ایک مد سے وضو کر لیا کرتے تھے۔امام ابوداؤد رحمہ اللہ کہتے ہیں کہ جناب ابان نے قتادہ سے روایت کیا تو («عن صفیۃ» کی بجائے) «سمعت صفیۃ» کہا ہے۔(یعنی میں نے سیدہ صفیہ سے سنا)۔";
abudawood.hukam = "صحیح";
abudawood.description = `رواہ البیہقی (1/ 195) من حدیث ابان بن یزید العطار عن قتادۃ،  وقتادۃ صرح بالسماع بہ`;