var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ ضَمْضَمِ بْنِ جَوْسٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اقْتُلُوا الْأَسْوَدَيْنِ فِي الصَّلَاةِ, الْحَيَّةَ وَالْعَقْرَبَ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’نماز پڑھتے ہوئے بھی دو کالے جانوروں کو قتل کر دو یعنی سانپ اور بچھو۔‘‘";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (1004)
أخرجہ النسائي (1203 وسندہ صحیح) یحیی بن أبي کثیر صرح بالسماع عند أحمد (2/473)`;