var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ سُفْيَانَ،عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: لَا غِرَارَ فِي صَلَاةٍ وَلَا تَسْلِيمٍ . قَالَ أَحْمَدُ: يَعْنِي:-فِيمَا أَرَى-: أَنْ لَا تُسَلِّمَ وَلَا يُسَلَّمَ عَلَيْكَ،وَيُغَرِّرُ الرَّجُلُ بِصَلَاتِهِ فَيَنْصَرِفُ, وَهُوَ فِيهَا شَاكٌّ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے روایت کرتے ہیں کہ آپ ﷺ نے فرمایا ’’نماز اور سلام میں نقص نہیں۔‘‘ (یعنی کمی نہ رکھو)۔امام احمد رحمہ اللہ فرماتے ہیں: میں سمجھتا ہوں کہ آپ سلام کریں،نہ آپ پر سلام کیا جائے۔اور نماز میں انسان کا کمی کرنا یوں ہے کہ انسان نماز سے فارغ ہو جائے حالانکہ اسے اس میں شک ہو۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الثوري عنعن`;
abudawood.anwaar = [46,1];