var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،أَخْبَرَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،عَنْ سُفْيَانَ،عَنْ أَبِي مَالِكٍ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ أُرَاهُ رَفَعَهُ،قَال:َ لَا غِرَارَ فِي تَسْلِيمٍ وَلَا صَلَاةٍ. قَالَ أَبو دَاود: وَرَوَاهُ ابْنُ فُضَيْلٍ عَلَى لَفْظِ ابْنِ مَهْدِيٍّ وَلَمْ يَرْفَعْهُ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ معاویہ نے کہا: میرا خیال ہے کہ انہوں نے مرفوع بیان کیا۔’’سلام میں اور نماز میں نقص نہیں۔‘‘ امام ابوداؤد رحمہ اللہ کہتے ہیں: ابن فضیل نے ابن مہدی کی (سابقہ روایت) کی مانند روایت کیا اور مرفوع نہیں کیا۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (928)`;
abudawood.anwaar = [46,1];