var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ بِالصَّاعِ وَيَتَوَضَّأُ بِالْمُدِّ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے مروی ہے،کہتے ہیں کہ نبی کریم ﷺ ایک صاع پانی سے غسل اور ایک مد سے وضو کر لیا کرتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `فیہ یزید بن ابی زیادہ ضعیف ضعفہ الجمھور،  ورواہ حصین عن سالم بن ابی الجعد عند الحاکم (1/ 161) وصححہ علی شرط الشیخین ووافقہ الذھبی وللحدیث شواھد کثیرۃ منھا الحدیث السابق`;