var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ،أَخْبَرَنَا سُفْيَانُ،عَنْ سَلَمَةَ،عَنْ حُجْرٍ أَبِي الْعَنْبَسِ الْحَضْرَمِيِّ،عَنْ وَائِلِ بْنِ حُجْرٍ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَرَأَ: وَلَا الضَّالِّينَ[آخر سورة الفاتحة], قَالَ: آمِين َ،وَرَفَعَ بِهَا صَوْتَهُ.";
abudawood.urdu = "سیدنا وائل بن حجر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جب (سورۃ فاتحہ کے آخر میں) «ولا الضالین» کہتے تو «آمین» کہتے اور اس کے ساتھ اپنی آواز کو بلند کرتے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (845)
رواہ یحیی القطان عن الثوري بہ (سنن الترمذي: 248) وھو لا یروي عنہ إلا ما صرح بالسماع`;