var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،أَخْبَرَنَا صَفْوَانُ بْنُ عِيسَى،عَنْ بِشْرِ بْنِ رَافِعٍ،عَنْ أَبِي عَبْدِ اللَّهِ ابْنِ عَمِّ أَبِي هُرَيْرَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَلَا: غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ[الفاتحة: 7], قَالَ: آمِينَ،حَتَّى يَسْمَعَ مَنْ يَلِيهِ مِنَ الصَّفِّ الْأَوَّلِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ جب «غیر المغضوب علیہم ولا الضالین» پڑھتے تو «آمین» کہتے حتیٰ کہ صف اول کے لوگ جو آپ ﷺ سے قریب ہوتے آپ ﷺ کی آواز سن لیتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن ماجہ (853)<br>بشر بن رافع ضعیف الحدیث (تقریب التہذیب: 685)<br>و أبو عبد اللّٰہ ابن عم أبي ہریرۃ: لا یعرف (میزان الإعتدال 4/ 545)`;
abudawood.anwaar = [46,1];