var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْقَعْنَبِيُّ،عَنْ مَالِكٍ،عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ،عَنْ أَبِي صَالِحٍ السَّمَّانِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَالَ الْإِمَامُ: غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ[الفاتحة: 7], فَقُولُوا: آمِينَ, فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ, غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جب امام «غیر المغضوب علیہم ولا الضالین» کہے،تو تم «آمین» کہو کیونکہ جس کا یہ قول ملائکہ کے قول کے موافق ہو گیا اس کے سابقہ گناہ بخش دیے جائیں گے۔‘‘";
abudawood.hukam = "صحیح بخاری (782) صحیح مسلم (409)";
abudawood.description = ``;