var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ التَّسْبِيحُ لِلرِّجَالِ،وَالتَّصْفِيقُ لِلنِّسَاءِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’تسبیح («سبحان اللہ» کہنا) مردوں کے لیے ہے اور تالی بجانا عورتوں کے لیے۔‘‘";
abudawood.hukam = "صحیح بخاری (1203) صحیح مسلم (422)";
abudawood.description = ``;