var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حَبِيبٍ الْأَنْصَارِيِّ قَالَ سَمِعْتُ عَبَّادَ بْنَ تَمِيمٍ عَنْ جَدَّتِهِ وَهِيَ أُمُّ عُمَارَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَأُتِيَ بِإِنَاءٍ فِيهِ مَاءٌ قَدْرُ ثُلُثَيْ الْمُدِّ";
abudawood.urdu = "سیدہ ام عمارہ رضی اللہ عنہا سے روایت ہے کہ نبی کریم ﷺ نے وضو کرنا چاہا تو آپ ﷺ کے لیے برتن لایا گیا۔اس میں ایک مد کے دو تہائی جتنا پانی تھا۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;