var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ شَبُّوَيْهِ الْمَرْوَزِيُّ وَمُحَمَّدُ بْنُ رَافِعٍ،قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُشِيرُ فِي الصَّلَاةِ.";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نماز میں اشارہ کر دیا کرتے تھے۔";
abudawood.hukam = "صحیح";
abudawood.description = `وللحدیث طریق آخر صحیح عند الدارقطني (2/84) وھو صح الحدیث، وللحدیث شواہد`;