var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ،حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ يَعْقُوبَ بْنِ عُتْبَةَ بْنِ الْأَخْنَسِ،عَنْ أَبِي غَطَفَانَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: التَّسْبِيحُ لِلرِّجَالِ-يَعْنِي: فِي الصَّلَاةِ-وَالتَّصْفِيقُ لِلنِّسَاءِ،مَنْ أَشَارَ فِي صَلَاتِهِ إِشَارَةً تُفْهَمُ عَنْهُ فَلْيَعُدْ لَهَا.-يَعْنِي-الصَّلَاةَ-قَالَ أَبو دَاود: هَذَا الْحَدِيثُ وَهْمٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا ’’«سبحان اللہ» کہنا مردوں کے لیے ہے۔‘‘ یعنی نماز میں۔’’اور تالی بجانا عورتوں کے لیے ہے۔اور جس نے اپنی نماز میں کوئی ایسا اشارہ کیا جو کوئی مفہوم رکھتا ہو تو اپنی نماز دہرائے۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ یہ حدیث وہم ہے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ابن إسحاق عنعن`;
abudawood.anwaar = [46,1];