var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ،عَنْ أَبِي الْأَحْوَصِ شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ أَنَّهُ سَمِعَ أَبَا ذَرٍّ،يَرْوِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَالَ: إِذَا قَامَ أَحَدُكُمْ إِلَى الصَّلَاةِ, فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ, فَلَا يَمْسَحِ الْحَصَى";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ نبی کریم ﷺ سے بیان کرتے ہیں کہ ’’جب تم میں سے کوئی نماز کے لیے کھڑا ہوتا ہے تو (اللہ کی) رحمت اس کے روبرو ہوتی ہے لہٰذا کنکریاں نہ چھوا کرے۔‘‘";
abudawood.hukam = "حسن";
abudawood.description = `مشکوۃ المصابیح (1001)
أخرجہ الترمذي (379 وسندہ حسن) وابن ماجہ (1028 وسندہ حسن) أبو الأحوص اللیثي وثقہ الجمھور ، وللحدیث شواھد منھا الحدیث الآتي (946)`;