var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا هِشَامٌ،عَنْ يَحْيَى،عَنْ أَبِي سَلَمَةَ،عَنْ مُعَيْقِيبٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَال:َ لَا تَمْسَحْ وَأَنْتَ تُصَلِّي،فَإِنْ كُنْتَ لَا بُدَّ فَاعِلًا, فَوَاحِدَةٌ, تَسْوِيَةَ الْحَصَى";
abudawood.urdu = "سیدنا معیقیب رضی اللہ عنہ مروی ہے کہ نبی کریم ﷺ نے فرمایا ’’نماز پڑھتے ہوئے کنکریاں مت چھوو۔اگر ایسا کرنا ہی ہے تو ایک بار برابر کر لو۔‘‘";
abudawood.hukam = "صحیح بخاری (1207) صحیح مسلم (546)";
abudawood.description = ``;