var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ كَعْبٍ،حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،عَنْ هِشَامٍ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَال:َ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الِاخْتِصَارِ فِي الصَّلَاةِ.\nقَالَ أَبو دَاود: يَعْنِي: يَضَعُ يَدَهُ عَلَى خَاصِرَتِهِ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ نے نماز کے دوران میں پہلوؤں پر ہاتھ رکھنے سے منع فرمایا ہے۔امام ابوداؤد رحمہ اللہ فرماتے ہیں «الاختصار فی الصلاۃ» کا معنی ہے اپنے پہلوؤں (یعنی کوکھوں) پر ہاتھ رکھنا۔";
abudawood.hukam = "صحیح بخاری (1220) صحیح مسلم (545)";
abudawood.description = ``;