var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ،حَدَّثَنَا وَكِيعٌ،عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ،عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنِ ابْنِ بُرَيْدَةَ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،قَالَ: كَانَ بِي النَّاصُورُ،فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَال:َ صَلِّ قَائِمًا،فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا،فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ";
abudawood.urdu = "سیدنا عمران بن حصین رضی اللہ عنہما کہتے کہ مجھے ناسور تھا۔پس اس بارے میں میں نے نبی کریم ﷺ سے معلوم کیا تو آپ ﷺ نے فرمایا ’’نماز کھڑے ہو کر پڑھو،اگر ہمت نہ ہو تو بیٹھ کر اور اگر اس کی بھی طاقت نہ ہو تو پہلو کے بل لیٹ کر۔‘‘";
abudawood.hukam = "صحیح بخاری (1117)";
abudawood.description = ``;