var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،قَالَ:،قَالَ: سَمِعْتُ بُدَيْلَ بْنَ مَيْسَرَةَ وَأَيُّوبَ يُحَدِّثَانِ،عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ،عَنْ عَائِشَةَ،قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا،وَلَيْلًا طَوِيلًا قَاعِدًا،فَإِذَا صَلَّى قَائِمًا, رَكَعَ قَائِمًا،وَإِذَا صَلَّى قَاعِدًا, رَكَعَ قَاعِدًا.";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ رات کا لمبا حصہ کھڑے ہو کر نماز پڑھتے اور ایک لمبا حصہ بیٹھ کر پڑھتے۔اور جب کھڑے ہو کر پڑھتے تو رکوع بھی کھڑے ہو کر کرتے اور جب بیٹھ کر پڑھتے تو رکوع بھی بیٹھ کر کرتے۔";
abudawood.hukam = "صحیح مسلم (730)";
abudawood.description = ``;