var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ،عَنْ مَالِكٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،قَال:َ سُنَّةُ الصَّلَاةِ أَنْ تَنْصِبَ رِجْلَكَ الْيُمْنَى،وَتَثْنِيَ رِجْلَكَ الْيُسْرَى.";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان فرماتے ہیں کہ نماز میں سنت یہ ہے کہ آپ اپنے دائیں پاؤں کو کھڑا کر لیں اور بائیں پاؤں کو بچھا کر بیٹھیں۔";
abudawood.hukam = "صحیح بخاری (827)";
abudawood.description = ``;