var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا جَرِيرٌ،عَنْ يَحْيَى بِإِسْنَادِهِ مِثْلَهُ. قَالَ أَبو دَاود: قَالَ حَمَّادُ بْنُ زَيْدٍ،عَنْ يَحْيَى أَيْضًا مِنَ السُّنَّةِ،كَمَا قَالَ جَرِيرٌ.";
abudawood.urdu = "عثمان بن ابی شیبہ نے اپنی سند سے مذکورہ بالا حدیث کہ مانند بیان کیا۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ حماد بن زید نے یحییٰ کی سند میں «من السنۃ» کا لفظ کہا ہے جیسے کہ جریر نے کہا ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `انظر الحدیث السابق (958)`;