var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ،عَنْ وَكِيعٍ،عَنْ سُفْيَانَ عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ،عَنْ إِبْرَاهِيمَ،قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ فِي الصَّلَاةِ افْتَرَشَ رِجْلَهُ الْيُسْرَى،حَتَّى اسْوَدَّ ظَهْرُ قَدَمِهِ.";
abudawood.urdu = "جناب ابراہیم (ابراہیم بن یزید نخعی فقیہ اہل کوفہ) نے بیان کیا کہ نبی کریم ﷺ جب نماز میں بیٹھتے تو اپنے بائیں پاؤں کو بچھا لیا کرتے تھے۔(اور مسلسل اس طرح کرنے سے) ان کے پاؤں کی پشت سیاہ ہو گئی تھی۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>الثوري عنعن<br>والحدیث مرسل`;
abudawood.anwaar = [46,1];