var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنَا مَنْصُورٌ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ أَبِي يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى قَوْمًا وَأَعْقَابُهُمْ تَلُوحُ فَقَالَ وَيْلٌ لِلْأَعْقَابِ مِنْ النَّارِ أَسْبِغُوا الْوُضُوءَ";
abudawood.urdu = "سیدنا عبداللہ بن عمرو رضی اللہ عنہما سے منقول ہے کہ رسول اللہ ﷺ نے کچھ لوگوں کہ دیکھا کہ (وضو میں جلدی کے باعث ان کے پاؤں خشک رہ گئے اور) ان کی ایڑیاں چمک رہی تھیں۔تو آپ ﷺ نے فرمایا ’’(ایسی) ایڑیوں کے لیے آگ کا عذاب ہے۔وضو مکمل کیا کرو۔‘‘";
abudawood.hukam = "صحیح مسلم (241)";
abudawood.description = ``;