var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنِي صَاحِبٌ لِي عَنْ هِشَامِ بْنِ عُرْوَةَ أَنَّ عَائِشَةَ قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَوْرٍ مِنْ شَبَهٍ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں اور رسول اللہ ﷺ ایک برتن سے غسل کرتے تھے جو پیتل کا بنا ہوا تھا۔";
abudawood.hukam = "صحیح";
abudawood.description = `حماد بن سلمۃ سمعہ من شعبۃ عن ہشام عن أبیہ عن عائشۃ بہ عند البیہقی (1/31) وبہ صح الحدیث`;