var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ،حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ،عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زَيْدٍ،عَنْ عُقْبَةَ بْنِ عَمْرٍو بِهَذَا الْخَبَرِ قَالَ: قُولُوا: اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِ مُحَمَّدٍ";
abudawood.urdu = "محمد بن عبداللہ بن زید نے جناب عقبہ بن عمرو رضی اللہ عنہ سے یہ حدیث نقل کی کہ کہا کرو «اللہم صل علی محمد النبی الأمی وعلی آل محمد»۔";
abudawood.hukam = "صحیح";
abudawood.description = `أخرجہ الحاکم (1/268 وسندہ حسن) وانظر الحدیث السابق (980)`;