var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ،حَدَّثَنَا يُونُسُ يَعْنِي ابْنَ بُكَيْرٍ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ،قَال:َ مِنَ السُّنَّةِ أَنْ يُخْفَى التَّشَهُّدُ.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے انہوں نے کہا کہ سنت یہ ہے کہ تشہد کو خاموشی سے پڑھا جائے۔";
abudawood.hukam = "صحیح";
abudawood.description = `مشکوۃ المصابیح (918)
وللحدیث شواھد عند الحاکم (1/230) وغیرہ وھو بھا صحیح`;