var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ إِسْحَقَ بْنَ مَنْصُورٍ حَدَّثَهُمْ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ رَجُلٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ";
abudawood.urdu = "جناب محمد بن علاء کی سند سے بھی مذکورہ بالا حدیث کی مانند مروی ہے۔";
abudawood.hukam = "صحیح";
abudawood.description = `حماد بن سلمۃ سمعہ من شعبۃ عن ہشام عن أبیہ عن عائشۃ بہ عند البیہقی (1/31) وبہ صح الحدیث`;