var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى،حَدَّثَنَا ابْنُ عَجْلَانَ،عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،... عَنْ أَبِيهِ بِهَذَا الْحَدِيثِ،قَالَ: لَا يُجَاوِزُ بَصَرُهُ إِشَارَتَهُ. وَحَدِيثُ حَجَّاجٍ أَتَمُّ.";
abudawood.urdu = "جناب عامر بن عبداللہ بن زبیر اپنے والد سے انہوں نے یہ حدیث بیان کی اور کہا آپ کی نظر آپ کے اشارے سے آگے نہ بڑھتی تھی۔اور حجاج کی حدیث اس سے زیادہ کامل ہے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `ابن عجلان صرح بالسماع عند أحمد (4/3)`;