var abudawood = {};
abudawood.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ،حَدَّثَنَا عَبْدُ الْوَارِثِ،عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ،سَأَلْتُ نَافِعًا عَنِ الرَّجُلِ يُصَلِّي وَهُوَ مُشَبِّكٌ يَدَيْهِ؟ قَالَ: قَالَ ابْنُ عُمَرَ: تِلْكَ صَلَاةُ الْمَغْضُوبِ عَلَيْهِمْ.";
abudawood.urdu = "جناب اسماعیل بن امیہ کہتے ہیں کہ میں نے نافع سے پوچھا کہ اگر کوئی آدمی نماز کے دوران میں تشبیک کیے ہوئے ہو تو؟ (یعنی دونوں ہاتھوں کی انگلیاں ایک دوسرے میں دیے ہوئے ہو؟) انہوں نے کہا: ابن عمر رضی اللہ عنہما فرماتے ہیں کہ یہ«مغضوب علیہم»(یعنی یہودیوں) کی نماز ہے۔";
abudawood.hukam = "إسنادہ صحیح";
abudawood.description = ``;