var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،عَنْ أَبِي عُبَيْدَةَ،عَنْ أَبِيهِ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ،كَأَنَّهُ عَلَى الرَّضْفِ،قَالَ: قُلْنَا: حَتَّى يَقُومَ؟ قَالَ: حَتَّى يَقُومَ.";
abudawood.urdu = "جناب ابوعبیدہ اپنے والد سے راوی ہیں وہ نبی کریم ﷺ کے متعلق بیان کرتے ہیں کہ آپ ﷺ پہلی دو رکعتوں کے بعد (جب بیٹھتے تو) ایسے ہوتے گویا گرم پتھر پر بیٹھے ہوں،ہم نے کہا: حتیٰ کہ کھڑے ہو جاتے کہا: حتیٰ کہ کھڑے ہو جاتے۔";
abudawood.hukam = "ضعیف";
abudawood.description = `إسنادہ ضعیف<br>ترمذی (366) ابن ماجہ (1177)<br>قال الترمذي : ’’ حسن،إلا أن أبا عبیدۃ لم یسمع من أبیہ ‘‘ ! فالسند منقطع`;
abudawood.anwaar = [47,1];