var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،حَدَّثَنَا مُوسَى بْنُ قَيْسٍ الْحَضْرَمِيُّ،عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،عَنْ عَلْقَمَةَ ابْنِ وَائِلٍ،عَنْ أَبِيهِ قَالَ: صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،فَكَانَ يُسَلِّمُ عَنْ يَمِينِهِ: السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ،وَعَنْ شِمَالِهِ: السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ";
abudawood.urdu = "جناب علقمہ بن وائل اپنے والد سے بیان کرتے ہیں کہ میں نے نبی کریم ﷺ کے ساتھ نماز پڑھی۔آپ ﷺ اپنی دائیں طرف سلام پھیرتے تو «السلام علیکم ورحمۃ اللہ وبرکاتہ» کہتے اور اپنی بائیں طرف «السلام علیکم ورحمۃ اللہ» کہتے۔";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = ``;