var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،وَأَحْمَدُ بْنُ مَنِيعٍ،وَإِسْحَاق بْنُ مَنْصُورٍ،وَمَحْمُودُ بْنُ غَيْلَانَ،قَالُوا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏وَأَبَا بَكْرٍ،‏‏‏‏‏‏وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ .";
tirmizi.urdu = "میں نے نبی اکرم ﷺ،ابوبکر اور عمر سب کو جنازے کے آگے آگے چلتے دیکھا ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 1668
الراجح أنہ حدیث صحیح وأعل بما لا یقدح`;