var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ،عَنْ هَمَّامٍ،عَنْ مَنْصُورٍ،وَزِيَادٍ،وَسُفْيَانَ،كلهم يذكر وَبَكْرٍ الْكُوفِيِّ،أَنَّهُ سَمِعَهُ مِنَ الزُّهْرِيِّ،عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ.";
tirmizi.urdu = "میں نے نبی اکرم ﷺ،ابوبکر اور عمر رضی الله عنہما سب کو جنازے کے آگے آگے چلتے دیکھا ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;