var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ،حَدَّثَنَا شُعْبَةُ،عَنْ سِمَاكٍ،قَال:‏‏‏‏ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ،يَقُولُ:‏‏‏‏ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةِ أَبِي الدَّحْدَاحِ وَهُوَ عَلَى فَرَسٍ لَهُ يَسْعَى وَنَحْنُ حَوْلَهُ وَهُوَ يَتَوَقَّصُ بِهِ .";
tirmizi.urdu = "ہم لوگ نبی اکرم ﷺ کے ساتھ ابودحداح کے جنازے میں تھے،آپ لوٹتے وقت ایک گھوڑے پر سوار تھے جو تیز چل رہا تھا،ہم اس کے اردگرد تھے اور وہ آپ کو لے کر اچھلتے ہوئے چل رہا تھا۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;