var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،وَالْفَضْلُ بْنُ مُوسَى،عَنْ حُسَيْنٍ الْمُعَلِّمِ،عَنْ عَبْدِ اللَّهِ بْنُ بُرَيْدَةَ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى امْرَأَةٍ فَقَامَ وَسَطَهَا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَقَدْ رَوَاهُ شُعْبَةُ،عَنْ حُسَيْنٍ الْمُعَلِّمِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے ایک عورت ۱؎ کی نماز جنازہ پڑھائی،تو آپ اس کے بیچ میں یعنی اس کی کمر کے پاس کھڑے ہوئے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-شعبہ نے بھی اسے حسین المعلم سے روایت کیا ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;