var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،أَنَّ أُمَّ سَعْدٍ مَاتَتْ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَائِبٌ،‏‏‏‏‏‏فَلَمَّا قَدِمَ صَلَّى عَلَيْهَا،‏‏‏‏‏‏وَقَدْ مَضَى لِذَلِكَ شَهْرٌ .";
tirmizi.urdu = "ام سعد کا انتقال ہو گیا اور نبی اکرم ﷺ موجود نہیں تھے،جب آپ تشریف لائے تو ان کی نماز جنازہ پڑھی۔اس واقعہ کو ایک ماہ گزر چکا تھا۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن<br>والحدیث مرسل`;
tirmizi.anwaar = [216,1];