var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ،حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ،قَالَ:‏‏‏‏ حَدَّثَتْنَا أُمُّ الْأَسْوَدِ،عَنْ مُنْيَةَ بِنْتِ عُبَيْدِ بْنِ أَبِي بَرْزَةَ،عَنْ جَدِّهَا أَبِي بَرْزَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ عَزَّى ثَكْلَى كُسِيَ بُرْدًا فِي الْجَنَّةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے کسی ایسی عورت کی تعزیت (ماتم پرسی) کی جس کا لڑکا مر گیا ہو،تو اسے جنت میں اس کے بدلہ ایک عمدہ کپڑا پہنایا جائے گا“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اس کی سند قوی نہیں ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>منیۃ بنت عبید بن أبي برزہ: لا یعرف حالھا (تقریب: 8687) <br>اضافہ از معاذ: قال الذہبی رحمہ اللہ فی حدیث ’’أم الأسود سمعت ‌مُنية ‌بنت ‌عبيد تحدث عن جدها‘‘: ’’قلت: هما مجهولتان‘‘ (المھذب فی اختصار السنن الکبیر: 7/ 3471)`;
tirmizi.anwaar = [217,1];