var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ،حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ،عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَفْسُ الْمُؤْمِنِ مُعَلَّقَةٌ بِدَيْنِهِ حَتَّى يُقْضَى عَنْهُ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مومن کی جان اس کے قرض کی وجہ سے اٹکی رہتی ہے جب تک کہ اس کی ادائیگی نہ ہو جائے“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 2915`;