var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ الْحَجَّاجِ،عَنْ مَكْحُولٍ،عَنْ أَبِي الشِّمَالِ،عَنْ أَبِي أَيُّوبَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَرْبَعٌ مِنْ سُنَنِ الْمُرْسَلِينَ:‏‏‏‏ الْحَيَاءُ،‏‏‏‏‏‏وَالتَّعَطُّرُ،‏‏‏‏‏‏وَالسِّوَاكُ،‏‏‏‏‏‏وَالنِّكَاحُ . قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ عُثْمَانَ،‏‏‏‏‏‏وَثَوْبَانَ،‏‏‏‏‏‏وَابْنِ مَسْعُودٍ،‏‏‏‏‏‏وَعَائِشَةَ،‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏‏‏وَأَبِي نَجِيحٍ،‏‏‏‏‏‏وَجَابِرٍ،‏‏‏‏‏‏وَعَكَّافٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي أَيُّوبَ حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”چار باتیں انبیاء و رسل کی سنت میں سے ہیں: حیاء کرنا،عطر لگانا،مسواک کرنا اور نکاح کرنا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-ابوایوب انصاری رضی الله عنہ کی حدیث حسن غریب ہے-";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو الشمال: مجہول (تقریب: 8161)<br>وللحدیث شواہد ضعیفۃ`;
tirmizi.anwaar = [217,1];