var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ وَائِلِ بْنِ دَاوُدَ،عَنْ ابْنِهِ،عَنْ الزُّهْرِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى صَفِيَّةَ بِنْتِ حُيَيٍّ بِسَوِيقٍ وَتَمْرٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے صفیہ بنت حیی کا ولیمہ ستو اور کھجور سے کیا۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3220`;