var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ،حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ،عَنْ إِسْمَاعِيل بْنِ أُمَيَّةَ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ائْتُوا الدَّعْوَةَ إِذَا دُعِيتُمْ . قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ عَلِيٍّ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏‏‏وَالْبَرَاءِ،‏‏‏‏‏‏وَأَنَسٍ،‏‏‏‏‏‏وَأَبِي أَيُّوبَ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب تمہیں دعوت دی جائے تو تم دعوت میں آؤ“۔امام ترمذی کہتے ہیں: ۱-ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے،۲-اس باب میں علی،ابوہریرہ،براء،انس اور ابوایوب رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;