var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ،عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ رَقِيتُ يَوْمًا عَلَى بَيْتِ حَفْصَةَ،‏‏‏‏‏‏فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حَاجَتِهِ مُسْتَقْبِلَ الشَّامِ مُسْتَدْبِرَ الْكَعْبَةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ایک روز میں (اپنی بہن) حفصہ رضی الله عنہا کے گھر کی چھت پر چڑھا تو نبی اکرم صلی الله علیہ وسلم کو دیکھا کہ آپ شام کی طرف منہ اور کعبہ کی طرف پیٹھ کر کے قضائے حاجت فرما رہے ہیں ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;