var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ حَمَّادٍ الْبَصْرِيُّ،حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ جَابِرِ بْنِ زَيْدٍ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ الْبَغَايَا اللَّاتِي يُنْكِحْنَ أَنْفُسَهُنَّ بِغَيْرِ بَيِّنَةٍ . قَالَ يُوسُفُ بْنُ حَمَّادٍ:‏‏‏‏ رَفَعَ عَبْدُ الْأَعْلَى هَذَا الْحَدِيثَ فِي التَّفْسِيرِ،‏‏‏‏‏‏وَأَوْقَفَهُ فِي كِتَابِ الطَّلَاقِ،‏‏‏‏‏‏وَلَمْ يَرْفَعْهُ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”زنا کار ہیں وہ عورتیں جو گواہوں کے بغیر خود نکاح کر لیتی ہیں“۔یوسف بن حماد کہتے ہیں کہ عبدالاعلی نے اس حدیث کو کتاب التفسیر میں مرفوع بیان کیا ہے اور کتاب الطلاق میں اسے انہوں نے موقوفاً بیان کیا ہے،مرفوع نہیں کیا ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن`;
tirmizi.anwaar = [218,1];