var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،عَنْ عَاصِمِ بْنِ كُلَيْبٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُلُّ خُطْبَةٍ لَيْسَ فِيهَا تَشَهُّدٌ فَهِيَ كَالْيَدِ الْجَذْمَاءِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ایسے سبھی خطبے جس میں تشہد نہ ہو اس ہاتھ کی طرح ہیں جس میں کوڑھ ہو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 3150`;