var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْأُمَوِيُّ،حَدَّثَنَا أَبِي،حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ سَيِّدِهِ فَهُوَ عَاهِرٌ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا: ”جس غلام نے اپنے آقا کی اجازت کے بغیر شادی کی وہ زانی ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `۔1112] إسنادہ ضعیف <br>أبی داود (2078)`;
tirmizi.anwaar = [218,1];