var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى،حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ،عَنْ أَبِي حَرِيزٍ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ تُزَوَّجَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ عَلَى خَالَتِهَا . وَأَبُو حَرِيزٍ اسْمُهُ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ حُسَيْنٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے منع فرمایا کہ کسی عورت سے شادی کی جائے اور اس کی پھوپھی یا اس کی خالہ (پہلے سے) نکاح میں ہو۔امام ترمذی کہتے ہیں: ۱-ابوحریز کا نام عبداللہ بن حسین ہے-";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;