var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ أَبِي وَهْبٍ الْجَيْشَانِيِّ،أَنَّهُ سَمِعَ ابْنَ فَيْرُوزَ الدَّيْلَمِيَّ يُحَدِّثُ،‏‏‏‏‏‏عَنْ أَبِيهِ:‏‏‏‏ قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏إِنِّي أَسْلَمْتُ وَتَحْتِي أُخْتَانِ،‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اخْتَرْ أَيَّتَهُمَا شِئْتَ .";
tirmizi.urdu = "میں نبی اکرم ﷺ کے پاس آیا،میں نے عرض کیا: اللہ کے رسول! میں نے اسلام قبول کر لیا ہے اور میرے نکاح میں دو بہنیں ہیں؟ تو رسول اللہ ﷺ نے فرمایا: ”تم ان دونوں میں سے جسے چاہو منتخب کر لو“۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;