var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ زَوْجُ بَرِيرَةَ عَبْدًا،‏‏‏‏‏‏فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَاخْتَارَتْ نَفْسَهَا وَلَوْ كَانَ حُرًّا لَمْ يُخَيِّرْهَا .";
tirmizi.urdu = "بریرہ کے شوہر غلام تھے،رسول اللہ ﷺ نے بریرہ کو اختیار دیا،تو انہوں نے خود کو اختیار کیا،(عروہ کہتے ہیں) اگر بریرہ کے شوہر آزاد ہوتے تو آپ بریرہ کو اختیار نہ دیتے ۱؎۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;