var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى،حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ أَبِي نَصْرٍ،عَنْ مُسَاوِرٍ الْحِمْيَرِيِّ،عَنْ أُمِّهِ،عَنْ أُمِّ سَلَمَةَ،قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا امْرَأَةٍ مَاتَتْ وَزَوْجُهَا عَنْهَا رَاضٍ،‏‏‏‏‏‏دَخَلَتِ الْجَنَّةَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو عورت مر جائے اور اس کا شوہر اس سے خوش ہو تو وہ جنت میں داخل ہو گی“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 3256`;