var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ،عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ،عَنْ كُرَيْبٍ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَنْظُرُ اللَّهُ إِلَى رَجُلٍ،‏‏‏‏‏‏أَتَى رَجُلًا أَوِ امْرَأَةً فِي الدُّبُرِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَى وَكيِعُُُ هَذَا الْحَدِيثَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اللہ اس شخص کی طرف (رحمت کی نظر سے) نہیں دیکھے گا جو کسی مرد یا کسی عورت کی دبر میں صحبت کرے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3195
وانظر مشکوۃ المصابیح (3585)`;