var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ،عَنْ عَبْدِ الْمَلِكِ بْنِ مُسْلِمٍ وَهُوَ ابْنُ سَلَّامٍ،عَنْ أَبِيهِ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا فَسَا أَحَدُكُمْ فَلْيَتَوَضَّأْ،‏‏‏‏‏‏وَلَا تَأْتُوا النِّسَاءَ فِي أَعْجَازِهِنَّ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَعَلِيٌّ هَذَا هُوَ عَلِيُّ بْنُ طَلْقٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب تم میں سے کوئی ہوا خارج کرے تو چاہیئے کہ وضو کرے اور تم عورتوں کی دبر میں صحبت نہ کرو“۔امام ترمذی کہتے ہیں: علی سے مراد علی بن طلق ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 1006`;