var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ،حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ،عَنْ مُوَرِّقٍ،عَنْ أَبِي الْأَحْوَصِ،عَنْ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ الْمَرْأَةُ عَوْرَةٌ فَإِذَا خَرَجَتِ اسْتَشْرَفَهَا الشَّيْطَانُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”عورت (سراپا) پردہ ہے،جب وہ باہر نکلتی ہے تو شیطان اس کو تاکتا ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>قتادۃ مدلس وعنعن<br>وراہ ابن أبي شیبۃ (ح5167،وسندہ صحیح) والطبرانی فی المعجم الکبیر (ح8914،9480 وسندہ حسن) موقوفًا وہو یغني عنہ`;
tirmizi.anwaar = [220,1];