var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ الْأَعْمَشِ،عَنْ أَبِي إِسْحَاق،عَنْ الْأَسْوَدِ،عَنْ عَائِشَةَ قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنَامُ وَهُوَ جُنُبٌ وَلَا يَمَسُّ مَاءً .";
tirmizi.urdu = "رسول اللہ صلی الله علیہ وسلم سوتے اور پانی کو ہاتھ نہ لگاتے اور آپ جنبی ہوتے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (581)<br>أبو إسحاق مدلس وصرح بالسماع عندالبیہقي (1/ 201۔202) ولکن السند إلیہ ضعیف`;
tirmizi.anwaar = [192,1];