var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ،يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا تَسْأَلِ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْفِئَ مَا فِي إِنَائِهَا . قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”عورت اپنی سوکن کی طلاق کا مطالبہ نہ کرے کہ جو اس کے برتن میں ہے اُسے اپنے میں انڈیل لے“۔امام ترمذی کہتے ہیں: ۱-ابوہریرہ کی حدیث حسن صحیح ہے،۲-اس باب میں ام سلمہ سے بھی روایت ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;