var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،أَنْبَأَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ لَاعَنَ رَجُلٌ امْرَأَتَهُ،‏‏‏‏‏‏وَفَرَّقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا،‏‏‏‏‏‏وَأَلْحَقَ الْوَلَدَ بِالْأُمِّ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ.";
tirmizi.urdu = "ایک آدمی نے اپنی بیوی کے ساتھ لعان کیا،تو نبی اکرم ﷺ نے ان دونوں کے درمیان تفریق کر دی اور لڑکے کو ماں کے ساتھ کر دیا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اہل علم کا اسی پر عمل ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;