var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،وَعُثْمَانُ بْنُ عُمَرَ،عَنْ هِشَامِ بْنِ حَسَّانَ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ تُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِرْعُهُ مَرْهُونَةٌ بِعِشْرِينَ صَاعًا مِنْ طَعَامٍ،‏‏‏‏‏‏أَخَذَهُ لِأَهْلِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ کی وفات ہوئی تو آپ کی زرہ بیس صاع غلے کے عوض گروی رکھی ہوئی تھی۔آپ نے اسے اپنے گھر والوں کے لیے لیا تھا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;