var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا ابْنُ الْمُبَارَكِ،أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ،عَنْ أَبِي عُثْمَانَ،عَنْ ابْنِ مَسْعُودٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ:‏‏‏‏ نَهَى عَنْ تَلَقِّي الْبُيُوعِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ عَلِيٍّ،‏‏‏‏‏‏وَابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏‏‏وَأَبِي سَعِيدٍ،‏‏‏‏‏‏وَابْنِ عُمَرَ،‏‏‏‏‏‏وَرَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے مال بیچنے والوں سے بازار میں پہنچنے سے پہلے جا کر ملنے سے منع فرمایا ہے۔امام ترمذی کہتے ہیں: اس باب میں علی،ابن عباس،ابوہریرہ،ابو سعید خدری،ابن عمر،اور ایک اور صحابی رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;