var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،عَنْ الْحَجَّاجِ وَهُوَ ابْنُ أَرْطَاةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْحَيَوَانُ اثْنَانِ بِوَاحِدٍ لَا يَصْلُحُ نَسِيئًا،‏‏‏‏‏‏وَلَا بَأْسَ بِهِ يَدًا بِيَدٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”دو جانور کو ایک جانوروں سے ادھار بیچنا درست نہیں ہے،ہاتھوں ہاتھ (نقد) بیچنے میں کوئی حرج نہیں ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (2271)<br>حجاج ضعیف مدلس <br>و أبو الزبیر مدلس وعنعنا <br>والحدیث السابق (الأصل: 1237) یغني عنہ`;
tirmizi.anwaar = [221,1];