var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ،حَدَّثَنَا أَبُو أَحْمَدَ،حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَهُوَ الْبَجَلِيُّ الكوفي،قَال:‏‏‏‏ سَمِعْتُ أَبَا زُرْعَةَ بْنَ عَمْرِو بْنِ جَرِيرٍ يُحَدِّثُ،‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يَتَفَرَّقَنَّ عَنْ بَيْعٍ إِلَّا عَنْ تَرَاضٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”بائع اور مشتری بیع (کی مجلس) سے رضا مندی کے ساتھ ہی جدا ہوں“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;