var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ الشَّيْبَانِيُّ،حَدَّثَنَا ابْنُ وَهْبٍ،عَنْ ابْنِ جُرَيْجٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَيَّرَ أَعْرَابِيَّا بَعْدَ الْبَيْعِ . وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے بیع کے بعد ایک اعرابی کو اختیار دیا۔یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (2184)<br>أبو الزبیر عنعن<br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [221,1];