var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا شَرِيكٌ،عَنْ أَبِي الْيَقْظَانِ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏أَنَّهُ قَالَ فِي الْمُسْتَحَاضَةِ:‏‏‏‏ تَدَعُ الصَّلَاةَ أَيَّامَ أَقْرَائِهَا الَّتِي كَانَتْ تَحِيضُ فِيهَا ثُمَّ تَغْتَسِلُ،‏‏‏‏‏‏وَتَتَوَضَّأُ عِنْدَ كُلِّ صَلَاةٍ وَتَصُومُ وَتُصَلِّي";
tirmizi.urdu = "نبی اکرم صلی الله علیہ وسلم نے مستحاضہ کے سلسلہ میں فرمایا: ”وہ ان دنوں میں جن میں اسے حیض آتا ہو نماز چھوڑے رہے،پھر وہ غسل کرے،اور (استحاضہ کا خون آنے پر) ہر نماز کے لیے وضو کرے،روزہ رکھے اور نماز پڑھے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (257) ابن ماجہ (625)<br>أبو الیقظان ضعیف مدلس<br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [193,1];