var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ ابْنِ شِهَابٍ. ح وحَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ الزُّهْرِيِّ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ،قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ،‏‏‏‏‏‏وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ . هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے کتے کی قیمت،زانیہ کی کمائی اور کاہن کی مٹھائی سے منع فرمایا ہے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;