var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا عُمَرُ بْنُ زَيْدٍ الصَّنْعَانِيُّ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْهِرِّ وَثَمَنِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏وَعُمَرُ بْنُ زَيْدٍ لَا نَعْرِفُ كَبِيرَ أَحَدٍ رَوَى عَنْهُ غَيْرَ عَبْدِ الرَّزَّاقِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے بلی اور اس کی قیمت کھانے سے منع فرمایا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اور ہم عبدالرزاق کے علاوہ کسی بڑے محدث کو نہیں جانتے جس نے عمرو بن زید سے روایت کی ہو۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4128`;