var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ،وَأَبُو عَامِرٍ الْعَقَدِيُّ،عَنْ ابْنِ أَبِي ذِئْبٍ،عَنْ مَخْلَدِ بْنِ خُفَافٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ الْخَرَاجَ بِالضَّمَانِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ،‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ..";
tirmizi.urdu = "رسول اللہ ﷺ نے فیصلہ کیا کہ فائدے کا استحقاق ضامن ہونے کی بنیاد پر ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-یہ اور بھی سندوں سے مروی ہے،۳-اہل علم کا اسی پر عمل ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 2879`;