var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ ابْنِ عَجْلَانَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الثَّمَرِ الْمُعَلَّقِ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ أَصَابَ مِنْهُ مِنْ ذِي حَاجَةٍ غَيْرَ مُتَّخِذٍ خُبْنَةً فَلَا شَيْءَ عَلَيْهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "نبی اکرم ﷺ سے لٹکے ہوئے پھل کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”جو ضرورت مند اس میں سے (ضرورت کے مطابق) لے لے اور کپڑے میں جمع کرنے والا نہ ہو تو اس پر کوئی مواخذہ نہیں ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;