var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،حَدَّثَنَا سُفْيَانُ،عَنْ السُّدِّيِّ،عَنْ يَحْيَى بْنِ عَبَّادٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏أَيُتَّخَذُ الْخَمْرُ خَلًّا؟ قَالَ:‏‏‏‏ لَا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ سے پوچھا گیا: کیا شراب کا سرکہ بنایا جا سکتا ہے؟ آپ نے فرمایا: ”نہیں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;