var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ،حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،حَدَّثَنَا أَيُّوبُ،عَنْ عِكْرِمَةَ،عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا،‏‏‏‏‏‏أَنَّ ّرَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَيْسَ لَنَا مَثَلُ السُّوءِ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”بری مثال ہمارے لیے مناسب نہیں،ہدیہ دے کر واپس لینے والا کتے کی طرح ہے جو قے کر کے چاٹتا ہے“ ۱؎۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;