var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ،عَنْ مَالِكِ بْنِ أَنَسٍ،عَنْ دَاوُدَ بْنِ حُصَيْنٍ،عَنْ أَبِي سُفْيَانَ مَوْلَى ابْنِ أَبِي أَحْمَدَ،‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ،‏‏‏‏‏‏أَوْ كَذَا.";
tirmizi.urdu = "رسول اللہ ﷺ نے پانچ وسق سے کم میں عرایا کے بیچنے کی اجازت دی ہے یا ایسے ہی کچھ آپ نے فرمایا۔راوی کو شک ہے کہ حدیث کے یہی الفاظ ہیں یا کچھ فرق ہے۔امام ترمذی کہتے ہیں: ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;