var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،حَدَّثَنَا أَيُّوبُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ،‏‏‏‏‏‏وَالْمُزَابَنَةِ،‏‏‏‏‏‏وَالْمُخَابَرَةِ،‏‏‏‏‏‏وَالْمُعَاوَمَةِ،‏‏‏‏‏‏وَرَخَّصَ فِي الْعَرَايَا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے بیع محاقلہ،مزابنہ ۱؎،مخابرہ ۲؎ اور معاومہ ۳؎ سے منع فرمایا،اور آپ نے عرایا ۴؎ کی اجازت دی ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;