var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ،حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ،أَخْبَرَنَا إِسْرَائِيلُ،عَنْ زَيْدِ بْنِ عَطَاءِ بْنِ السَّائِبِ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ للَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ غَفَرَ اللَّهُ لِرَجُلٍ،‏‏‏‏‏‏كَانَ قَبْلَكُمْ،‏‏‏‏‏‏كَانَ سَهْلًا إِذَا بَاعَ سَهْلًا،‏‏‏‏‏‏إِذَا اشْتَرَى سَهْلًا،‏‏‏‏‏‏إِذَا اقْتَضَى . قَالَ:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اللہ تعالیٰ نے ایک شخص کو جو تم سے پہلے تھا بخش دیا،جو نرمی کرنے والا تھا جب بیچتا اور جب خریدتا اور جب قرض کا مطالبہ کرتا“۔امام ترمذی کہتے ہیں: یہ حدیث اس طریق سے حسن،صحیح،غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;