var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ إِسْرَائِيلَ،عَنْ عَبْدِ الْأَعْلَى،عَنْ بِلَالِ بْنِ أَبِي مُوسَى،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ سَأَلَ الْقَضَاءَ وُكِلَ إِلَى نَفْسِهِ،‏‏‏‏‏‏وَمَنْ أُجْبِرَ عَلَيْهِ يُنْزِلُ اللَّهُ عَلَيْهِ مَلَكًا،‏‏‏‏‏‏فَيُسَدِّدُهُ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو قضاء کا مطالبہ کرتا ہے وہ اپنی ذات کے حوالے کر دیا جاتا ہے (اللہ کی مدد اس کے شامل حال نہیں ہوتی) اور جس کو جبراً قاضی بنایا جاتا ہے،اللہ اس کے پاس ایک فرشتہ بھیجتا ہے جو اسے راہ راست پر رکھتا ہے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (3578) ابن ماجہ (2309)`;
tirmizi.anwaar = [223,1];