var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ،عَنْ زَائِدَةَ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ حَنَشٍ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا تَقَاضَى إِلَيْكَ رَجُلَانِ،‏‏‏‏‏‏فَلَا تَقْضِ لِلْأَوَّلِ،‏‏‏‏‏‏حَتَّى تَسْمَعَ كَلَامَ الْآخَرِ،‏‏‏‏‏‏فَسَوْفَ تَدْرِي،‏‏‏‏‏‏كَيْفَ تَقْضِي،‏‏‏‏‏‏قَالَ عَلِيٌّ:‏‏‏‏ فَمَا زِلْتُ قَاضِيًا بَعْدُ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "مجھ سے رسول اللہ ﷺ نے فرمایا: ”جب تمہارے پاس دو آدمی فیصلہ کے لیے آئیں تو تم پہلے کے حق میں فیصلہ نہ کرو جب تک کہ دوسرے کی بات نہ سن لو ۱؎ عنقریب تم جان لو گے کہ تم کیسے فیصلہ کرو“۔علی رضی الله عنہ کہتے ہیں: اس کے بعد میں برابر فیصلے کرتا رہا۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (3582)`;
tirmizi.anwaar = [223,1];