var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ،حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ،عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي سَلَمَةَ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ:‏‏‏‏ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاشِيَ وَالْمُرْتَشِيَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے رشوت دینے والے اور رشوت لینے والے دونوں پر لعنت بھیجی ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 3754`;