var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِذَلِكَ الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ الْحُلْوَانِيُّ،‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ،‏‏‏‏ أَخْبَرَنَا مَعْمَرٌ،‏‏‏‏ عَنْ الزُّهْرِيِّ،عَنْ سَالِمٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي عَبْدٍ،‏‏‏‏ فَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ،‏‏‏‏ فَهُوَ عَتِيقٌ مِنْ مَالِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جس نے مشترک غلام میں سے اپنا حصہ آزاد کیا اور اس کے پاس اتنا مال ہو جو اس کی قیمت کو پہنچ رہا ہو (تو وہ باقی شریکوں کا حصہ بھی ادا کرے گا) اور وہ اس کے مال سے آزاد ہو جائے گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;