var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا شَرِيكٌ،عَنْ خُصَيْفٍ،عَنْ مِقْسَمٍ،عَنْ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَقَعُ عَلَى امْرَأَتِهِ وَهِيَ حَائِضٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ يَتَصَدَّقُ بِنِصْفِ دِينَارٍ";
tirmizi.urdu = "نبی اکرم صلی الله علیہ وسلم نے اس آدمی کے بارے میں جو اپنی بیوی سے حیض کی حالت میں جماع کرتا ہے فرمایا: ”وہ آدھا دینار صدقہ کرے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (266)`;
tirmizi.anwaar = [193,1];