var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ،أَخْبَرَنَا شُعْبَةُ،‏‏‏‏ عَنْ سِمَاكٍ،‏‏‏‏ قَال:‏‏‏‏ سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ يُحَدِّثُ،‏‏‏‏‏‏عَنْ أَبِيهِ،‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَهُ أَرْضًا بِحَضْرَمَوْتَ . قَالَ مَحْمُودٌ:‏‏‏‏ أَخْبَرَنَا النَّضْرُ،‏‏‏‏ عَنْ شُعْبَةَ،‏‏‏‏ وَزَادَ فِيهِ:‏‏‏‏ وَبَعَثَ لَهُ مُعَاوِيَةَ لِيُقْطِعَهَا إِيَّاهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے انہیں حضر موت میں ایک زمین بطور جاگیر دی۔آپ ﷺ نے معاویہ رضی الله عنہ کو بھیجا تاکہ وہ زمین انہیں بطور جاگیر دے دیں۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 2999`;