var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،‏‏‏‏ وَمُحَمَّدُ بْنُ جَعْفَرٍ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ،‏‏‏‏ عَنْ قَتَادَةَ،‏‏‏‏ عَنْ عِكْرِمَةَ،‏‏‏‏ عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ هَذِهِ وَهَذِهِ سَوَاءٌ،‏‏‏‏ يَعْنِي:‏‏‏‏ الْخِنْصَرَ،‏‏‏‏ وَالْإِبْهَامَ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”دیت میں یہ اور یہ برابر ہیں،یعنی چھنگلیا انگوٹھا“ ۱؎۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;