var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ،‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى،‏‏‏‏ عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ،‏‏‏‏ عَنْ يَزِيدَ الرَّقَاشِيِّ،‏‏‏‏ حَدَّثَنَا أَبُو الْحَكَمِ الْبَجَلِيُّ،قَال:‏‏‏‏ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ،‏‏‏‏ وَأَبَا هُرَيْرَةَ،‏‏‏‏ يَذْكُرَانِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْ أَنَّ أَهْلَ السَّمَاءِ،‏‏‏‏ وَأَهْلَ الْأَرْضِ،‏‏‏‏ اشْتَرَكُوا فِي دَمِ مُؤْمِنٍ،‏‏‏‏ لَأَكَبَّهُمُ اللَّهُ فِي النَّارِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اگر آسمان اور زمین والے (سارے کے سارے) ایک مومن کے خون میں ملوث ہو جائیں تو اللہ ان (سب) کو اوندھے منہ جہنم میں ڈال دے گا“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>یزید الرقاشي زاہد ضعیف (تقریب: 7683) و قال الھیثمي: ضعفہ الجمھور (مجمع الزوائد 6/ 226) <br>وللحدیث شواہد ضعیفۃ عند البیہقي (22/8) وغیرہ`;
tirmizi.anwaar = [224,1];