var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ الْحَجَّاجِ بْنِ أَرْطَاةَ،‏‏‏‏ عَنْ عَمْرِو بْنِ شُعَيْبٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ جَدِّهِ،‏‏‏‏ عَنْ عُمَرَ بْنِ الْخَطَّابِ،‏‏‏‏ قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَا يُقَادُ الْوَالِدُ بِالْوَلَدِ .";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو فرماتے سنا: ”باپ سے بیٹے کا قصاص نہیں لیا جائے گا“ ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (2662)<br>حجاج بن أرطاۃ ضعیف مدلس وتابعہ محمد بن عجلان وھو مدلس مشھور`;
tirmizi.anwaar = [224,2];