var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،‏‏‏‏ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ،عَنْ أَبِي سَعْدٍ،عَنْ عِكْرِمَةَ،‏‏‏‏ عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَى الْعَامِرِيَّيْنِ بِدِيَةِ الْمُسْلِمِينَ،‏‏‏‏ وَكَانَ لَهُمَا عَهْدٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ،‏‏‏‏ وَأَبُو سَعْدٍ الْبَقَّالُ اسْمُهُ:‏‏‏‏ سَعِيدُ بْنُ الْمَرْزُبَانِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے قبیلہ عامر کے دو آدمیوں کو مسلمانوں کے برابر دیت دی،(کیونکہ) ان دونوں کا رسول اللہ ﷺ سے عہد و پیمان تھا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،اسے ہم صرف اسی سند سے جانتے ہیں،۲-حدیث کے راوی ابوسعد بقال کا نام سعید بن مرزبان ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `ضعیف<br>أبو سعد البقال: ضعیف مدلس (تقریب: 2389)`;
tirmizi.anwaar = [225,1];