var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،‏‏‏‏ حَدَّثَنَا مَعْنٌ،‏‏‏‏ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ يَهُودِيًّا وَيَهُودِيَّةً . قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْحَدِيثِ قِصَّةٌ،‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "رسول اللہ ﷺ نے ایک یہودی مرد اور ایک یہودی عورت کو رجم کیا۔امام ترمذی کہتے ہیں: ۱-اور یہ حدیث حسن صحیح ہے،۲-حدیث میں ایک قصہ کا بھی ذکر ہے ۱؎۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;