var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،‏‏‏‏ حَدَّثَنَا هَمَّامٌ،‏‏‏‏ عَنْ الْقَاسِمِ بْنِ عَبْدِ الْوَاحِدِ الْمَكِّيِّ،‏‏‏‏ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُقَيْلٍ،‏‏‏‏ أَنَّهُ سَمِعَ جَابِرًا،‏‏‏‏ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُقَيْلِ بْنِ أَبِي طَالِبٍ،‏‏‏‏ عَنْ جَابِرٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مجھے اپنی امت کے بارے میں جس چیز کا سب سے زیادہ خوف ہے وہ قوم لوط کا عمل (اغلام بازی) ہے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اور ہم اسے صرف اسی سند «عن عبد الله بن محمد بن عقيل بن أبي طالب عن جابر» سے ہی جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (2563)<br>ابن عقیل: ضعیف`;
tirmizi.anwaar = [225,1];