var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى،‏‏‏‏ حَدَّثَنَا وَكِيعٌ،‏‏‏‏ حَدَّثَنَا شَرِيكٌ،‏‏‏‏ عَنْ الْحَجَّاجِ،‏‏‏‏ عَنْ الْقَاسِمِ بْنِ أَبِي بَزَّةَ،‏‏‏‏ عَنْ سُلَيْمَانَ الْيَشْكُرِيِّ،‏‏‏‏ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،‏‏‏‏ قَالَ:‏‏‏‏ نُهِينَا عَنْ صَيْدِ كَلْبِ الْمَجُوسِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ،‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ،‏‏‏‏ لَا يُرَخِّصُونَ فِي صَيْدِ كَلْبِ الْمَجُوسِ،‏‏‏‏ وَالْقَاسِمُ بْنُ أَبِي بَزَّةَ هُوَ:‏‏‏‏ الْقَاسِمُ بْنُ نَافِعٍ الْمَكِّيُّ.";
tirmizi.urdu = "ہمیں مجوسیوں کے کتے کے شکار سے منع کیا گیا ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں،۲-اکثر اہل علم کا اسی پر عمل ہے،یہ لوگ مجوسی کے کتے کے شکار کی اجازت نہیں دیتے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا <br>ابن ماجہ (3209)<br>ضعفہ البوصیري لتدلیس حجاج بن أرطاۃ`;
tirmizi.anwaar = [226,1];