var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى،‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ،‏‏‏‏ عَنْ الثَّوْرِيِّ،عَنْ سِمَاكٍ،‏‏‏‏ عَنْ عِكْرِمَةَ،‏‏‏‏ عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏ قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَّخَذَ شَيْءٌ فِيهِ الرُّوحُ غَرَضًا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے کسی جاندار کو نشانہ بنانے سے منع فرمایا ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اہل علم کا اسی پر عمل ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;