var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،‏‏‏‏ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ،‏‏‏‏ فَحِيلٍ يَأْكُلُ فِي سَوَادٍ،‏‏‏‏ وَيَمْشِي فِي سَوَادٍ،‏‏‏‏ وَيَنْظُرُ فِي سَوَادٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَفْصِ بْنِ غِيَاثٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے سینگ والے ایک نر مینڈھے کی قربانی کی،وہ سیاہی میں کھاتا تھا،سیاہی میں چلتا تھا اور سیاہی میں دیکھتا تھا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-ہم اس کو صرف حفص بن غیاث ہی کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `سندہ ضعیف <br>سنن أبي داود (2796) نسائي (4395) ابن ماجہ (3128)`;
tirmizi.anwaar = [317,1];