var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ وَهَنَّادٌ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ،‏‏‏‏ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،‏‏‏‏ عَنْ نَافِعٍ،‏‏‏‏ عَنْ ابْنِ عُمَرَ،‏‏‏‏ قَالَ:‏‏‏‏ أَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ عَشْرَ سِنِينَ يُضَحِّي،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ مدینہ میں دس سال مقیم رہے اور آپ (ہر سال) قربانی کرتے رہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1506)`;
tirmizi.anwaar = [227,1];