var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،‏‏‏‏ حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ السَّمَّانُ،‏‏‏‏ عَنْ ابْنِ عَوْنٍ،‏‏‏‏ عَنْ مُحَمَّدِ بْنِ سِيرِينَ،‏‏‏‏ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَطَبَ ثُمَّ نَزَلَ فَدَعَا بِكَبْشَيْنِ فَذَبَحَهُمَا،‏‏‏‏ قَالَ أَبُو عِيسَى،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے خطبہ دیا،پھر (منبر سے) اترے پھر آپ نے دو مینڈھے منگائے اور ان کو ذبح کیا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔(یہ عید الاضحی کی نماز کے بعد کیا تھا،دیکھئیے اگلی حدیث)۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;