var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ،‏‏‏‏ عَنْ إِسْمَاعِيل بْنِ مُسْلِمٍ،‏‏‏‏ عَنْ الْحَسَنِ،‏‏‏‏ عَنْ سَمُرَةَ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْغُلَامُ مُرْتَهَنٌ بِعَقِيقَتِهِ،‏‏‏‏ يُذْبَحُ عَنْهُ يَوْمَ السَّابِعِ،‏‏‏‏ وَيُسَمَّى وَيُحْلَقُ رَأْسُهُ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ہر بچہ عقیقہ کے بدلے گروی رکھا ہوا ہے ۱؎،پیدائش کے ساتویں دن اس کا عقیقہ کیا جائے،اس کا نام رکھا جائے اور اس کے سر کے بال منڈائے جائیں“۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;