var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،‏‏‏‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،حَدَّثَنِي مُحَمَّدٌ مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ،‏‏‏‏ حَدَّثَنِي كَعْبُ بْنُ عَلْقَمَةَ،‏‏‏‏ عَنْ أَبِي الْخَيْرِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَفَّارَةُ النَّذْرِ إِذَا لَمْ يُسَمَّ كَفَّارَةُ يَمِينٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”غیر متعین نذر کا کفارہ وہی ہے جو قسم کا کفارہ ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>محمد بن یزید،مولی المغیرۃ بن شعبۃ: مجھول الحال (تقریب: 6398) وحدیث مسلم (1645) یغني عنہ`;
tirmizi.anwaar = [228,1];