var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ،عَنْ مُوسَى بْنِ عُقْبَةَ،‏‏‏‏ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ قَالَ:‏‏‏‏ كَثِيرًا مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْلِفُ بِهَذِهِ الْيَمِينِ،‏‏‏‏ لَا وَمُقَلِّبِ الْقُلُوبِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ قسم کھاتے تھے تو اکثر «لا ومقلب القلوب» کہتے تھے ”نہیں،دلوں کے بدلنے والے کی قسم“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;