var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْعَدَنِيُّ الْمَكِّيُّ وَيُكْنَى بِأَبِي عَبْدِ اللَّهِ الرَّجُلِ الصَّالِحِ هُوَ ابْنُ أَبِي عُمَرَ،‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الْمَلِكِ بْنِ نَوْفَلِ بْنِ مُسَاحِقٍ،عَنْ ابْنِ عِصَامٍ الْمُزَنِيِّ،عَنْ أَبِيهِ،وَكَانَتْ لَهُ صُحْبَةٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ جَيْشًا أَوْ سَرِيَّةً يَقُولُ لَهُمْ:‏‏‏‏ إِذَا رَأَيْتُمْ مَسْجِدًا،‏‏‏‏‏‏أَوْ سَمِعْتُمْ مُؤَذِّنًا،‏‏‏‏‏‏فَلَا تَقْتُلُوا أَحَدًا،‏‏‏‏‏‏هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏وَهُوَ حَدِيثُ ابْنِ عُيَيْنَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ جب کوئی لشکر یا سریہ بھیجتے تو ان سے فرماتے: ”جب تم کوئی مسجد دیکھو یا مؤذن کی آواز سنو تو کسی کو نہ مارو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،اور یہ ابن عیینہ سے آئی ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (2635)`;
tirmizi.anwaar = [228,1];