var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ،وَحُمَيْدُ بْنُ مَسْعَدَةَ،قَالَا:‏‏‏‏ حَدَّثَنَا سُلَيْمُ بْنُ أَخْضَرَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَسَمَ فِي النَّفَلِ لِلْفَرَسِ بِسَهْمَيْنِ،‏‏‏‏‏‏وَلِلرَّجُلِ بِسَهْمٍ .";
tirmizi.urdu = "رسول اللہ ﷺ نے مال غنیمت کی تقسیم میں گھوڑے کو دو حصے اور آدمی (سوار) کو ایک حصہ دیا ۱؎۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;