var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ،عَنْ أَبِي مُحَمَّدٍ مَوْلَى أَبِي قَتَادَةَ،‏‏‏‏‏‏عَنْ أَبِي قَتَادَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قَتَلَ قَتِيلًا لَهُ عَلَيْهِ بَيِّنَةٌ،‏‏‏‏‏‏فَلَهُ سَلَبُهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْحَدِيثِ قِصَّةٌ،‏‏‏‏";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو کسی کافر کو قتل کرے اور اس کے پاس گواہ موجود ہو تو مقتول کا سامان اسی کا ہو گا“۔امام ترمذی کہتے ہیں: حدیث میں ایک قصہ مذکور ہے ۱؎۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;