var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل،عَنْ جَهْضَمِ بْنِ عَبْدِ اللَّهِ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ مُحَمَّدِ بْنِ زَيْدٍ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شِرَاءِ الْمَغَانِمِ حَتَّى تُقْسَمَ،‏‏‏‏‏‏وَفِي الْبَاب،‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے تقسیم سے پہلے مال غنیمت کی خرید و فروخت سے منع فرمایا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (2196)<br>محمد بن إبراہیم الباھلي مجہول (تقریب: 5703) و في شیخہ نظر <br>و لبعض الحدیث شواھد`;
tirmizi.anwaar = [229,1];