var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ،عَنْ شُعْبَةَ،أَخْبَرَنِي سِمَاكُ بْنُ حَرْبٍ،قَال:‏‏‏‏ سَمِعْتُ قَبِيصَةَ بْنَ هُلْبٍ يُحَدِّثُ،‏‏‏‏‏‏عَنْ أَبِيهِ،قَالَ:‏‏‏‏ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ طَعَامِ النَّصَارَى؟ فَقَالَ:‏‏‏‏ لَا يَتَخَلَّجَنَّ فِي صَدْرِكَ طَعَامٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "میں نے نبی اکرم ﷺ سے نصاریٰ کے کھانا کے بارے میں سوال کیا تو آپ نے فرمایا: ”کوئی کھانا تمہارے دل میں شک نہ پیدا کرے کہ اس کے سلسلہ میں نصرانیت سے تمہاری مشابہت ہو جائے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 4087`;