var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ أَخْبَرَنِي الصَّعْبُ بْنُ جَثَّامَةَ،قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏إِنَّ خَيْلَنَا أُوطِئَتْ مِنْ نِسَاءِ الْمُشْرِكِينَ وَأَوْلَادِهِمْ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هُمْ مِنْ آبَائِهِمْ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے عرض کیا: اللہ کے رسول! ہمارے گھوڑوں نے مشرکین کی عورتوں اور بچوں کو روند ڈالا ہے،آپ نے فرمایا: ”وہ بھی اپنے آبا و اجداد کی قسم سے ہیں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;