var tirmizi = {};
tirmizi.arabic = "حَدَّثَنِي أبو رجاء قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ،عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ،عَنْ ثَوْبَانَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ مَاتَ وَهُوَ بَرِيءٌ مِنْ ثَلَاثٍ:‏‏‏‏ الْكِبْرِ،‏‏‏‏‏‏وَالْغُلُولِ،‏‏‏‏‏‏وَالدَّيْنِ،‏‏‏‏‏‏دَخَلَ الْجَنَّةَ،‏‏‏‏‏‏وَفِي الْبَاب،‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏‏‏وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو مر گیا اور تین چیزوں یعنی تکبر (گھمنڈ)،مال غنیمت میں خیانت اور قرض سے بری رہا،وہ جنت میں داخل ہو گا“۔امام ترمذی کہتے ہیں: اس باب میں ابوہریرہ اور زید بن خالد جہنی رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 2921
وللحدیث شواھد`;