var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ،حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ الضُّبَعِيُّ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَغْزُو بِأُمِّ سُلَيْمٍ وَنِسْوَةٍ مَعَهَا مِنْ الْأَنْصَارِ،‏‏‏‏‏‏يَسْقِينَ الْمَاءَ،‏‏‏‏‏‏وَيُدَاوِينَ الْجَرْحَى،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ ام سلیم اور ان کے ہمراہ رہنے والی انصار کی چند عورتوں کے ساتھ جہاد میں نکلتے تھے،وہ پانی پلاتی اور زخمیوں کا علاج کرتی تھیں ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ربیع بنت معوذ سے بھی روایت ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;