var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ،حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ،عَنْ إِسْرَائِيلَ،عَنْ ثُوَيْرٍ،عَنْ أَبِيهِ،عَنْ عَلِيٍّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّ كِسْرَى أَهْدَى لَهُ فَقَبِلَ،‏‏‏‏‏‏وَأَنَّ الْمُلُوكَ أَهْدَوْا إِلَيْهِ فَقَبِلَ مِنْهُمْ،‏‏‏‏‏‏وَفِي الْبَاب،‏‏‏‏‏‏عَنْ جَابِرٍ،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏وَثُوَيْرُ بْنُ أَبِي فَاخِتَةَ اسْمُهُ سَعِيدُ بْنُ عِلَاقَةَ،‏‏‏‏‏‏وَثُوَيْرٌ يُكْنَى أَبَا جَهْمٍ.";
tirmizi.urdu = "نبی اکرم ﷺ کے لیے فارس کے بادشاہ کسریٰ نے آپ کے لیے تحفہ بھیجا تو آپ نے اسے قبول کر لیا،(کچھ) اور بادشاہوں نے آپ کے لیے تحفہ بھیجا تو آپ نے ان کے تحفے قبول کئے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-راوی ثویر ابوفاختہ کے بیٹے ہیں،ابوفاختہ کا نام سعید بن علاقہ ہے اور ثویر کی کنیت ابوجہم ہے،۳-اس باب میں جابر سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ثویر: ضعیف`;
tirmizi.anwaar = [229,1];