var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو الْوَلِيدِ الدِّمَشْقِيُّ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ سَعِيدِ بْنِ بَشِيرٍ،عَنْ قَتَادَةَ،عَنْ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ اقْتُلُوا شُيُوخَ الْمُشْرِكِينَ،‏‏‏‏‏‏وَاسْتَحْيُوا شَرْخَهُمْ،‏‏‏‏‏‏وَالشَّرْخُ:‏‏‏‏ الْغِلْمَانُ الَّذِينَ لَمْ يُنْبِتُوا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏وَرَوَاهُ الْحَجَّاجُ بْنُ أَرْطَاةَ،‏‏‏‏‏‏عَنْ قَتَادَةَ،‏‏‏‏‏‏نَحْوَهُ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مشرکین کے مردوں کو قتل کر دو اور ان کے لڑکوں میں سے جو بلوغت کی عمر کو نہ پہنچے ہوں انہیں کو چھوڑ دو“،«شرخ» وہ لڑکے ہیں جن کے زیر ناف کے بال نہ نکلے ہوں۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-حجاج بن ارطاۃ نے قتادہ سے اسی جیسی حدیث روایت کی ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (2670)`;
tirmizi.anwaar = [229,1];