var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ بَجَالَةَ،أَنَّ عُمَرَ كَانَ لَا يَأْخُذُ الْجِزْيَةَ مِنْ الْمَجُوسِ،‏‏‏‏‏‏حَتَّى أَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَخَذَ الْجِزْيَةَ مِنْ مَجُوسِ هَجَرَ،‏‏‏‏‏‏وَفِي الْحَدِيثِ كَلَامٌ أَكْثَرُ مِنْ هَذَا،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "عمر رضی الله عنہ مجوس سے جزیہ نہیں لیتے تھے یہاں تک کہ عبدالرحمٰن بن عوف رضی الله عنہ نے ان کو خبر دی کہ نبی اکرم ﷺ نے مقام ہجر کے مجوسیوں سے جزیہ لیا،اس حدیث میں اس سے زیادہ تفصیل ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;