var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل،عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ،قَالَ:‏‏‏‏ قُلْتُ لِسَلَمَةَ بْنِ الْأَكْوَعِ:‏‏‏‏ عَلَى أَيِّ شَيْءٍ بَايَعْتُمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ؟ قَالَ:‏‏‏‏ عَلَى الْمَوْتِ،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے سلمہ بن الاکوع رضی الله عنہ سے پوچھا: حدیبیہ کے دن آپ لوگوں نے رسول اللہ ﷺ سے کس بات پر بیعت کی تھی؟ انہوں نے کہا: موت پر ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;