var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ،عَنْ أَبِي جَمْرَةَ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِوَفْدِ عَبْدِ الْقَيْسِ:‏‏‏‏ آمُرُكُمْ أَنْ تُؤَدُّوا خُمُسَ مَا غَنِمْتُمْ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْحَدِيثِ قِصَّةٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے وفد عبدالقیس سے فرمایا: ”میں تم لوگوں کو حکم دیتا ہوں کہ مال غنیمت سے خمس (یعنی پانچواں حصہ) ادا کرو،امام ترمذی کہتے ہیں: اس حدیث میں ایک قصہ ہے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;