var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنِ انْتَهَبَ فَلَيْسَ مِنَّا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏مِنْ حَدِيثِ أَنَسٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو لوٹ پاٹ مچائے وہ ہم میں سے نہیں ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث انس کی روایت سے حسن صحیح غریب ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;