var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الْيَهُودَ إِذَا سَلَّمَ عَلَيْكُمْ أَحَدُهُمْ فَإِنَّمَا يَقُولُ:‏‏‏‏ السَّامُ عَلَيْكُمْ،‏‏‏‏‏‏فَقُلْ:‏‏‏‏ عَلَيْكَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”یہود میں سے کوئی جب تم لوگوں کو سلام کرتا ہے تو وہ کہتا ہے: «السام عليک» (یعنی تم پر موت ہو)،اس لیے تم جواب میں صرف «عليک» کہو (یعنی تم پر موت ہو)‘‘۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;