var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ،حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ،أَخْبَرَنَا سُفْيَانُ الثَّوْرِيُّ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَئِنْ عِشْتُ إِنْ شَاءَ اللَّهُ،‏‏‏‏‏‏لَأُخْرِجَنَّ الْيَهُودَ وَالنَّصَارَى مِنْ جَزِيرَةِ الْعَرَبِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اگر میں زندہ رہا تو ان شاءاللہ جزیرہ عرب سے یہود و نصاریٰ کو نکال باہر کر دوں گا“ ۱؎۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;