var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،حَدَّثَنَا أَبُو عَاصِمٍ،وَعَبْدُ الرَّزَّاقِ،قَالَا:‏‏‏‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ،قَالَ:‏‏‏‏ أَخْبَرَنِي أَبُو الزُّبَيْرِ،أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ:‏‏‏‏ أَخْبَرَنِي عُمَرُ بْنُ الْخَطَّابِ،أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَأُخْرِجَنَّ الْيَهُودَ وَالنَّصَارَى مِنْ جَزِيرَةِ الْعَرَبِ،‏‏‏‏‏‏فَلَا أَتْرُكُ فِيهَا إِلَّا مُسْلِمًا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "انہوں نے رسول اللہ ﷺ کو فرماتے سنا: ”میں جزیرہ عرب سے یہود و نصاریٰ کو ضرور نکالوں گا اور اس میں صرف مسلمان کو باقی رکھوں گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;