var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ هِشَامٍ الدَّسْتُوَائِيِّ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا عَدْوَى وَلَا طِيَرَةَ،‏‏‏‏‏‏وَأُحِبُّ الْفَأْلَ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏وَمَا الْفَأْلُ؟ قَالَ:‏‏‏‏ الْكَلِمَةُ الطَّيِّبَةُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ایک کی بیماری دوسرے کو لگ جانے اور بدفالی و بدشگونی کی کوئی حقیقت نہیں ہے ۱؎ اور مجھ کو فال نیک پسند ہے“،لوگوں نے پوچھا: اللہ کے رسول! فال نیک کیا چیز ہے؟ آپ نے فرمایا: ”اچھی بات“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;