var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ،حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ حُمَيْدٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ يُعْجِبُهُ إِذَا خَرَجَ لِحَاجَةٍ،‏‏‏‏‏‏أَنْ يَسْمَعَ يَا رَاشِدُ يَا نَجِيحُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ کو یہ سننا اچھا لگتا تھا کہ جب کسی ضرورت سے نکلیں تو کوئی یا راشد یا نجیح کہے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;