var tirmizi = {};
tirmizi.arabic = "قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ،‏‏‏‏‏‏عَنْ إِسْمَاعِيل ابْنِ عُلَيَّةَ،‏‏‏‏‏‏عَنْ ابْنِ جُرَيْجٍ،‏‏‏‏‏‏عَنْ ابْنِ أَبِي مُلَيْكَةَ،‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ نَحْوَهُ. وَوَجَدْتُ فِي كِتَابِي،‏‏‏‏‏‏أَخْبَرَنِي عَلِيُّ بْنُ حُجْرٍ،عَنْ إِسْمَاعِيل بْنِ إِبْرَاهِيمَ،عَنْ ابْنِ جُرَيْجٍ.";
tirmizi.urdu = "یہ حدیث اسماعیل بن علیہ سے بطریق «ابن جريج عن ابن أبي مليكة عن أم سلمة» اسی طرح روایت کی گئی ہے۔اور مجھے اپنی کتاب میں اس کی سند یوں ملی کہ مجھے علی بن حجر نے خبر دی انہوں نے اسماعیل بن ابراہیم سے اور اسماعیل نے ابن جریج سے روایت کی ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;