var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا الْوَلِيدُ بْنُ جَمِيلٍ،عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ،عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ،‏‏‏‏‏‏جَعَلَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ خَنْدَقًا كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ،‏‏‏‏‏‏هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي أُمَامَةَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جہاد میں جو شخص ایک دن روزہ رکھے گا اللہ تعالیٰ اس کے اور آگ کے درمیان اسی طرح کی ایک خندق بنا دے گا جیسی زمین و آسمان کے درمیان ہے“۔یہ حدیث ابوامامہ کی روایت سے غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 2064`;