var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ ابْنِ أَبِي لَيْلَى،عَنْ عَطَاءٍ،عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ أَوْ خَلَفَهُ فِي أَهْلِهِ،‏‏‏‏‏‏فَقَدْ غَزَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے کسی مجاہد کا سامان سفر تیار کیا،یا اس کے گھر والے کی خبرگیری کی حقیقت میں اس نے جہاد کیا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 3826`;