var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ بُسْرِ بْنِ سَعِيدٍ،عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ فَقَدْ غَزَا،‏‏‏‏‏‏وَمَنْ خَلَفَ غَازِيًا فِي أَهْلِهِ فَقَدْ غَزَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے کسی مجاہد کا سامان سفر تیار کیا حقیقت میں اس نے جہاد کیا اور جس نے غازی کے گھر والے کی خبرگیری کی حقیقت میں اس نے جہاد کیا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;