var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا ابْنُ الْمُبَارَكِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ الْمَسْعُودِيِّ،عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ عِيسَى بْنِ طَلْحَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَلِجُ النَّارَ رَجُلٌ بَكَى مِنْ خَشْيَةِ اللَّهِ حَتَّى يَعُودَ اللَّبَنُ فِي الضَّرْعِ،‏‏‏‏‏‏وَلَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَمُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ هُوَ مَوْلَى أَبِي طَلْحَةَ مَدَنِيٌّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اللہ کے ڈر سے رونے والا جہنم میں داخل نہیں ہو گا یہاں تک کہ دودھ تھن میں واپس لوٹ جائے،(اور یہ محال ہے) اور جہاد کا غبار اور جہنم کا دھواں ایک ساتھ جمع نہیں ہوں گے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 3828
وانظر مشکوۃ المصابیح (5346)`;