var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ الْمَرْوَزِيُّ،أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ الْحِمْصِيُّ،عَنْ بَقِيَّةَ،عَنْ بَحِيرِ بْنِ سَعْدٍ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنْ كَثِيرِ بْنِ مُرَّةَ،عَنْ عَمْرِو بْنِ عَبَسَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ شَابَ شَيْبَةً فِي سَبِيلِ اللَّهِ،‏‏‏‏‏‏كَانَتْ لَهُ نُورًا يَوْمَ الْقِيَامَةِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏وَحَيْوَةُ بْنُ شُرَيْحٍ ابْنُ يَزِيدَ الْحِمْصِيُّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو شخص اللہ کی راہ میں بوڑھا ہو جائے قیامت کے دن اس کے لیے ایک نور ہو گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 3385`;