var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ الزُّهْرِيِّ،عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ،عَنْ أَبِيهِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ أَرْوَاحَ الشُّهَدَاءِ فِي طَيْرٍ خُضْرٍ تَعْلُقُ مِنْ ثَمَرِ الْجَنَّةِ أَوْ شَجَرِ الْجَنَّةِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”شہداء کی روحیں (جنت میں) سبز پرندوں کی شکل میں ہیں،جو جنت کے پھلوں یا درختوں سے کھاتی چرتی ہیں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;