var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي بِشْرٍ،عَنْ بَشِيرِ بْنِ ثَابِتٍ،عَنْ حَبِيبِ بْنِ سَالِمٍ،عَنْ النُّعْمَانِ بْنِ بَشِيرٍ،قَالَ:‏‏‏‏ أَنَا أَعْلَمُ النَّاسِ بِوَقْتِ هَذِهِ الصَّلَاةِ،‏‏‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهَا لِسُقُوطِ الْقَمَرِ لِثَالِثَةٍ .";
tirmizi.urdu = "اس نماز عشاء کے وقت کو لوگوں میں سب سے زیادہ میں جانتا ہوں،رسول اللہ صلی الله علیہ وسلم اسے تیسری تاریخ کا چاند ڈوبنے کے وقت پڑھتے تھے ۱؎۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 613`;