var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ،حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ سُلَيْمَانَ بْنِ مُوسَى،عَنْ مَالِكِ بْنِ يُخَامِرَ السَّكْسَكِيِّ،عَنْ مُعَاذِ بْنِ جَبَلٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ سَأَلَ اللَّهَ الْقَتْلَ فِي سَبِيلِهِ صَادِقًا مِنْ قَلْبِهِ،‏‏‏‏‏‏أَعْطَاهُ اللَّهُ أَجْرَ الشَّهِيدِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جو شخص سچے دل سے اللہ کی راہ میں قتل ہونے کی دعا مانگے تو اللہ تعالیٰ اسے شہادت کا ثواب دے گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;