var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ ابْنِ عَجْلَانَ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ثَلَاثَةٌ حَقٌّ عَلَى اللَّهِ عَوْنُهُمْ:‏‏‏‏ الْمُجَاهِدُ فِي سَبِيلِ اللَّهِ،‏‏‏‏‏‏وَالْمُكَاتَبُ الَّذِي يُرِيدُ الْأَدَاءَ،‏‏‏‏‏‏وَالنَّاكِحُ الَّذِي يُرِيدُ الْعَفَافَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تین آدمیوں کی مدد اللہ کے نزدیک ثابت ہے ۱؎ ایک اللہ کی راہ میں جہاد کرنے والا،دوسرا وہ مکاتب غلام جو زر کتابت ادا کرنا چاہتا ہو،اور تیسرا وہ شادی کرنے والا جو پاکدامنی حاصل کرنا چاہتا ہو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 3089`;