var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَأَحْمَدُ بْنُ نَصْرٍ النَّيْسَابُورِيُّ،‏‏‏‏ وغير واحد،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى،حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ،عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا يَجِدُ الشَّهِيدُ مِنْ مَسِّ الْقَتْلِ،‏‏‏‏‏‏إِلَّا كَمَا يَجِدُ أَحَدُكُمْ مِنْ مَسِّ الْقَرْصَةِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”شہید کو قتل سے صرف اتنی ہی تکلیف ہوتی ہے جتنی تکلیف تم میں سے کسی کو چٹکی لینے سے ہوتی ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>نسائي (3163) ابن ماجہ (2802)<br>محمد بن عجلان مدلس وعنعن<br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [230,2];