var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَاصِمِ بْنِ مُحَمَّدٍ،عَنْ أَبِيهِ،عَنْ ابْنِ عُمَرَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَوْ أَنَّ النَّاسَ يَعْلَمُونَ مَا أَعْلَمُ مِنَ الْوِحْدَةِ،‏‏‏‏‏‏مَا سَرَى رَاكِبٌ بِلَيْلٍ،‏‏‏‏‏‏يَعْنِي:‏‏‏‏ وَحْدَهُ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اگر لوگ تنہائی کا وہ نقصان جان لیتے جو میں جانتا ہوں تو کوئی سوار رات میں تنہا نہ چلے“ ۱؎۔امام ترمذی کہتے ہیں: ابن عمر کی حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;