var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ،حَدَّثَنَا يَحْيَى بْنُ إِسْحَاق وَهُوَ السَّالِحَانِيُّ،حَدَّثَنَا يَزِيدُ بْنُ حَيَّانَ،قَال:‏‏‏‏ سَمِعْتُ أَبَا مِجْلَزٍ لَاحِقَ بْنَ حُمَيْدٍ يُحَدِّثُ،‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ كَانَتْ رَايَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوْدَاءَ،‏‏‏‏‏‏وَلِوَاؤُهُ أَبْيَضَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏‏‏مِنْ حَدِيثِ ابْنِ عَبَّاسٍ.";
tirmizi.urdu = "رسول اللہ ﷺ کا جھنڈا کالا اور پرچم سفید تھا۔امام ترمذی کہتے ہیں: ابن عباس کی یہ روایت اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3887`;