var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،وَابْنُ أَبِي عَدِيٍّ،وأبو داود،قَالُوا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ كَانَ فَزَعٌ بِالْمَدِينَةِ،‏‏‏‏‏‏فَاسْتَعَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا لَنَا يُقَالُ لَهُ:‏‏‏‏ مَنْدُوبٌ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا رَأَيْنَا مِنْ فَزَعٍ وَإِنْ وَجَدْنَاهُ لَبَحْرًا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "مدینہ میں گھبراہٹ کا ماحول تھا،چنانچہ رسول اللہ ﷺ نے ہمارے «مندوب» نامی گھوڑے کو ہم سے عاریۃ لیا ہم نے کوئی گھبراہٹ نہیں دیکھی اور گھوڑے کو چال میں ہم نے سمندر پایا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;