var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ الْبَصْرِيُّ،‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا شَيْبَانُ يعْنِي ابْنَ عَبْدِ الرَّحْمَنِ،حَدَّثَنَا عِيسَى بْنُ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ،عَنْ أَبِيهِ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُمْنُ الْخَيْلِ فِي الشُّقْرِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ شَيْبَانَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”سرخ رنگ کے گھوڑوں میں برکت ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے اس سند سے صرف شیبان کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 3879`;