var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،أَخْبَرَنَا ابْنُ لَهِيعَةَ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ عَلِيِّ بْنِ رَبَاحٍ،عَنْ أَبِي قَتَادَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ خَيْرُ الْخَيْلِ:‏‏‏‏ الْأَدْهَمُ الْأَقْرَحُ الْأَرْثَمُ،‏‏‏‏‏‏ثُمَّ الْأَقْرَحُ الْمُحَجَّلُ طَلْقُ الْيَمِينِ،‏‏‏‏‏‏فَإِنْ لَمْ يَكُنْ أَدْهَمَ،‏‏‏‏‏‏فَكُمَيْتٌ عَلَى هَذِهِ الشِّيَةِ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”بہتر گھوڑے وہ ہیں جو کالے رنگ کے ہوں،جن کی پیشانی اور اوپر کا ہونٹ سفید ہو،پھر ان کے بعد وہ گھوڑے ہیں جن کے چاروں پیر اور پیشانی سفید ہو،اگر گھوڑا کالے رنگ کا نہ ہو تو انہیں صفات کا سرخ سیاہی مائل عمدہ گھوڑا ہے“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3877`;