var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا وَكِيعٌ،عَنْ ابْنِ أَبِي ذِئْبٍ،عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا سَبَقَ إِلَّا فِي نَصْلٍ،‏‏‏‏‏‏أَوْ خُفٍّ،‏‏‏‏‏‏أَوْ حَافِرٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "نبی اکرم ﷺ فرمایا: ”مقابلہ صرف تیر،اونٹ اور گھوڑوں میں جائز ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 3874`;