var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا كَلْبٌ،‏‏‏‏‏‏وَلَا جَرَسٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ عُمَرَ،‏‏‏‏‏‏وَعَائِشَةَ،‏‏‏‏‏‏وَأُمِّ حَبِيبَةَ،‏‏‏‏‏‏وَأُمِّ سَلَمَةَ،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”فرشتے مسافروں کی اس جماعت کے ساتھ نہیں رہتے ہیں جس میں کتا یا گھنٹی ہو“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں عمر،عائشہ،ام حبیبہ اور ام سلمہ رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;