var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا ابْنُ أَبِي عُمَرَ،وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ،قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ الزُّهْرِيِّ،عَنْ السَّائِبِ بْنِ يَزِيدَ،قَالَ:‏‏‏‏ لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ تَبُوكَ،‏‏‏‏‏‏خَرَجَ النَّاسُ يَتَلَقَّوْنَهُ إِلَى ثَنِيَّةِ الْوَدَاعِ،‏‏‏‏‏‏قَالَ السَّائِبُ:‏‏‏‏ فَخَرَجْتُ مَعَ النَّاسِ وَأَنَا غُلَامٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "جب رسول اللہ ﷺ غزوہ تبوک سے واپس آئے تو لوگ آپ کے استقبال کے لیے ثنیۃ الوداع تک نکلے: میں بھی لوگوں کے ساتھ نکلا حالانکہ میں کم عمر تھا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;