var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ نَافِعٍ،عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ،عَنْ أَبِيهِ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ نَهَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْقَسِّيِّ وَالْمُعَصْفَرِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ أَنَسٍ،‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏‏‏وَحَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے مجھے قسی کے بنے ہوئے ریشمی اور زرد رنگ کے کپڑے پہننے سے منع فرمایا ۱؎۔امام ترمذی کہتے ہیں: ۱-علی رضی الله عنہ کی حدیث حسن صحیح ہے،۲-اس باب میں انس اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;