var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ،قَال:‏‏‏‏ سَمِعْتُ ابْنَ عَبَّاسٍ،يَقُولُ:‏‏‏‏ مَاتَتْ شَاةٌ،‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِهَا:‏‏‏‏ أَلَا نَزَعْتُمْ جِلْدَهَا ثُمَّ دَبَغْتُمُوهُ فَاسْتَمْتَعْتُمْ بِهِ .";
tirmizi.urdu = "ایک بکری مر گئی،رسول اللہ ﷺ نے بکری والے سے کہا: تم نے اس کی کھال کیوں نہ اتار لی؟ پھر تم دباغت دے کر اس سے فائدہ حاصل کرتے ۱؎۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;