var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ،عَنْ يُونُسَ،عَنْ ابْنِ شِهَابٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ كَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ وَرِقٍ،‏‏‏‏‏‏وَكَانَ فَصُّهُ حَبَشِيًّا،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ،‏‏‏‏‏‏وَبُرَيْدَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "نبی اکرم ﷺ کی انگوٹھی چاندی کی تھی اور اس کا نگینہ (عقیق) حبشہ کا بنا ہوا تھا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے حسن صحیح غریب ہے،۲-اس باب میں ابن عمر اور بریدہ رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;