var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا حَفْصُ بْنُ عُمَرَ بْنِ عُبَيْدِ اللَّهِ الطَّنَافِسِيُّ،حَدَّثَنَا زُهَيْرٌ أَبُو خَيْثَمَةَ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ كَانَ خَاتَمُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ،‏‏‏‏‏‏فَصُّهُ مِنْهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ کی انگوٹھی چاندی کی تھی،اس کا نگینہ بھی اسی کا تھا۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;