var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل،عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ كَانَ الْحَسَنُ وَالْحُسَيْنُ يَتَخَتَّمَانِ فِي يَسَارِهِمَا،‏‏‏‏‏‏هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "حسن اور حسین اپنے بائیں ہاتھ میں انگوٹھی پہنتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>السند منقطع،محمد بن علي الباقر لم یدرک الحسن والحسین رضي اللّٰہ عنہما`;
tirmizi.anwaar = [232,1];