var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ،وَالْحَجَّاجُ بْنُ مِنْهَالٍ،قَالَا:‏‏‏‏ حَدَّثَنَا هَمَّامٌ،عَنْ ابْنِ جُرَيْجٍ،عَنْ الزُّهْرِيِّ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ نَزَعَ خَاتَمَهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ جب پاخانہ جاتے تو اپنی انگوٹھی اتار دیتے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (19) نسائي (5216) ابن ماجہ (303)`;
tirmizi.anwaar = [232,1];