var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ،حَدَّثَنَا أَبِي،عَنْ ثُمَامَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ كَانَ نَقْشُ خَاتَمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مُحَمَّدٌ سَطْرٌ،‏‏‏‏‏‏وَرَسُولُ سَطْرٌ،‏‏‏‏‏‏وَاللَّهِ سَطْرٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ کی انگوٹھی کا نقش اس طرح تھا «محمد» ایک سطر،«رسول» ایک سطر اور «اللہ» ایک سطر میں،امام ترمذی کہتے ہیں: انس کی حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;