var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ إِنَّمَا كَانَ فِرَاشُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَنَامُ عَلَيْهِ أَدَمٌ حَشْوُهُ لِيفٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ حَفْصَةَ،‏‏‏‏‏‏وَجَابِرٍ.";
tirmizi.urdu = "نبی اکرم ﷺ جس بچھونے پر سوتے تھے وہ چمڑے کا تھا،اس کے اندر کھجور کے درخت کی چھال بھری ہوئی تھی۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں حفصہ اور جابر رضی الله عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;