var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا أَبُو دَاوُدَ،حَدَّثَنَا هَمَّامٌ،عَنْ قَتَادَةَ،قَالَ:‏‏‏‏ قُلْتُ لِأَنَسِ بْنِ مَالِكٍ:‏‏‏‏ كَيْفَ كَانَ نَعْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟،‏‏‏‏‏‏قَالَ لَهُمَا:‏‏‏‏ قِبَالَانِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے انس بن مالک رضی الله عنہ سے پوچھا: رسول اللہ ﷺ کے جوتے کیسے تھے؟ کہا: ان کے دو تسمے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس اور ابوہریرہ سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = `مشکوۃ المصابیح: 4413`;