var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،أَخْبَرَنَا حَبَّانُ بْنُ هِلَالٍ،حَدَّثَنَا هَمَّامٌ،حَدَّثَنَا قَتَادَةُ،عَنْ أَنَسٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ نَعْلَاهُ لَهُمَا قِبَالَانِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ کے جوتے کے دو تسمے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس و ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;