var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،عَنْ مَالِكٍ. ح وحَدَّثَنَا الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكٌ،عَنْ أَبِي الزِّنَادِ،عَنْ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَمْشِي أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ لِيُنْعِلْهُمَا جَمِيعًا أَوْ لِيُحْفِهِمَا جَمِيعًا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ جَابِرٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تم میں سے کوئی آدمی ایک جوتا پہن کر نہ چلے،دونوں پہن لے یا دونوں اتار دے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں جابر رضی الله عنہ سے بھی احادیث آئی ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;