var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو جَعْفَرٍ السِّمْنَانِيُّ،حَدَّثَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ الرَّقِّيُّ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ،عَنْ مَعْمَرٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَنْتَعِلَ الرَّجُلُ وَهُوَ قَائِمٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏وقَالَ مُحَمَّدُ بْنُ إِسْمَاعِيل:‏‏‏‏ وَلَا يَصِحُّ هَذَا الْحَدِيثُ،‏‏‏‏‏‏وَلَا حَدِيثُ مَعْمَرٍ،‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ،‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے کھڑے ہو کر جوتا پہننے سے منع فرمایا۔ٍ امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-محمد بن اسماعیل بخاری کہتے ہیں: یہ حدیث صحیح نہیں ہے،اور نہ ہی معمر کی حدیث جسے وہ عمار بن ابی عمار سے اور عمار ابوہریرہ سے روایت کرتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>قتادۃ عنعن`;
tirmizi.anwaar = [233,1];