var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ،حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ السَّلُولِيُّ كُوفِيٌّ،حَدَّثَنَا هُرَيْمُ بْنُ سُفْيَانَ الْبَجَلِيُّ الْكُوفِيُّ،عَنْ لَيْثٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ رُبَّمَا مَشَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَعْلٍ وَاحِدَةٍ .";
tirmizi.urdu = "بسا اوقات نبی اکرم ﷺ ایک جوتا پہن کر چلتے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>لیث بن أبي سلیم: ضعیف`;
tirmizi.anwaar = [233,1];