var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ أَنَّهَا مَشَتْ بِنَعْلٍ وَاحِدَةٍ،‏‏‏‏‏‏وَهَذَا أَصَحُّ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَكَذَا رَوَاهُ وَغَيْرُ وَاحِدٍ سُفْيَانُ الثَّوْرِيُّ،‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ مَوْقُوفًا وَهَذَا أَصَحُّ.";
tirmizi.urdu = "وہ ایک جوتا پہن کر چلیں۔امام ترمذی کہتے ہیں: ۱-یہ روایت زیادہ صحیح ہے ۱؎،۲-سفیان ثوری اور کئی لوگوں نے اسی طرح اس حدیث کو عبدالرحمٰن بن قاسم کے واسطہ سے موقوف طریقہ سے روایت کیا ہے اور یہ موقوف روایت زیادہ صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سفیان بن عیینۃ مدلس و عنعن و لم أجد تصریح سماعہ (أبي داود:295)`;
tirmizi.anwaar = [233,1];