var tirmizi = {};
tirmizi.arabic = "حَدَّثَنِي ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ ابْنِ أَبِي نَجِيحٍ،عَنْ مُجَاهِدٍ،عَنْ أُمِّ هَانِئٍ قَالَتْ:‏‏‏‏ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ لَا أَعْرِفُ لِمُجَاهِدٍ سَمَاعًا مِنْ أُمِّ هَانِئٍ.";
tirmizi.urdu = "رسول اللہ ﷺ مکہ اس حال میں آئے کہ آپ کی چار چوٹیاں تھیں ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-محمد بن اسماعیل بخاری کہتے ہیں: ام ہانی سے مجاہد کا سماع میں نہیں جانتا ہوں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (4191) ابن ماجہ (3631)`;
tirmizi.anwaar = [233,1];