var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،حَدَّثَنَا مُحَمَّدُ بْنُ حُمْرَانَ،عَنْ أَبِي سَعِيدٍ وَهُوَ عَبْدُ اللَّهِ بْنُ بُسْرٍ،قَال:‏‏‏‏ سَمِعْتُ أَبَا كَبْشَةَ الْأَنْمَارِيَّ يَقُولُ:‏‏‏‏ كَانَتْ كِمَامُ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُطْحًا قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ مُنْكَرٌ،‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ بُسْرٍ بَصْرِيٌّ هُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ ضَعَّفَهُ يَحْيَى بْنُ سَعِيدٍ وَغَيْرُهُ،‏‏‏‏‏‏وَبُطْحٌ يَعْنِي وَاسِعَةً.";
tirmizi.urdu = "رسول اللہ ﷺ کے صحابہ کی آستینیں کشادہ تھیں۔امام ترمذی کہتے ہیں: ۱-یہ حدیث منکر ہے،۲-عبداللہ بن بسر بصرہ کے رہنے والے ہیں،محدثین کے نزدیک ضعیف ہیں،یحییٰ بن سعید وغیرہ نے انہیں ضعیف کہا ہے،۳-«بطح» چوڑی اور کشادہ چیز کو کہتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو سعید عبد اللّٰہ بن بسر: ضعیف (تقریب: 3230) و قال الھیثمي: وضعفہ الجمھور (مجمع الزوائد 405/9)`;
tirmizi.anwaar = [233,1];