var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ،عَنْ عَاصِمِ بْنِ كُلَيْبٍ،عَنْ ابْنِ أَبِي مُوسَى،قَال: سَمِعْتُ عَلِيًّا يَقُولُ: نَهَانِي رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَسِّيِّ وَالْمِيثَرَةِ الْحَمْرَائِ وَأَنْ أَلْبَسَ خَاتَمِي فِي هَذِهِ وَفِي هَذِهِ وَأَشَارَ إِلَى السَّبَّابَةِ وَالْوُسْطَى.";
tirmizi.urdu = "مجھے رسول اللہ ﷺ نے «قسي» (ایک ریشمی کپڑا) سرخ (رنگ کا ریشمی) زین پوش اور اس انگلی اور اس انگلی میں انگوٹھی پہننے سے منع فرمایا اور انہوں نے شہادت اور بیچ کی انگلی کی طرف اشارہ کیا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;