var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،قَالَ:‏‏‏‏ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ مَعْمَرٍ،عَنْ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب تم میں سے کوئی کھائے تو دائیں ہاتھ سے کھائے اور دائیں ہاتھ سے پیئے،اس لیے کہ شیطان اپنے بائیں ہاتھ سے کھاتا ہے اور بائیں ہاتھ سے پیتا ہے“۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;