var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَسَقَطَتْ لُقْمَةٌ فَلْيُمِطْ مَا رَابَهُ مِنْهَا ثُمَّ لِيَطْعَمْهَا وَلَا يَدَعْهَا لِلشَّيْطَانِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب،‏‏‏‏‏‏عَنْ أَنَسٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جب تم میں سے کوئی کھانا کھائے اور نوالہ گر جائے تو اس میں سے جو ناپسند سمجھے اسے ہٹا دے ۱؎،اسے پھر کھا لے،اسے شیطان کے لیے نہ چھوڑے“۔امام ترمذی کہتے ہیں: اس باب میں انس سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;