var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ،‏‏‏‏ وَأَبُو النَّضْرِ،‏‏‏‏ عَنْ مُحَمَّدِ بْنِ طَلْحَةَ بْنِ مُصَرِّفٍ،عَنْ زُبَيْدٍ،‏‏‏‏ عَنْ مُرَّةَ الْهَمْدَانِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَلَاةُ الْوُسْطَى صَلَاةُ الْعَصْرِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ صلی الله علیہ وسلم نے فرمایا: ’’«صلاة وسطیٰ» عصر کی صلاۃ ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = `مشکوۃ المصابیح: 634`;