var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا عَبْدَةُ،عَنْ مُحَمَّدِ بْنِ إِسْحَاق،عَنْ ابْنِ أَبِي نَجِيحٍ،عَنْ مُجَاهِدٍ،عَنْ ابْنِ عُمَرَ قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْجَلَّالَةِ وَأَلْبَانِهَا،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَى الثَّوْرِيُّ،‏‏‏‏‏‏عَنْ ابْنِ أَبِي نَجِيحٍ،‏‏‏‏‏‏عَنْ مُجَاهِدٍ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا.";
tirmizi.urdu = "رسول اللہ ﷺ گندگی کھانے والے جانور کے گوشت کھانے اور ان کے دودھ پینے سے منع فرمایا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-ثوری نے اسے «عن ابن أبي نجيح عن مجاهد عن النبي صلى الله عليه وسلم» کی سند سے مرسل طریقہ سے روایت کی ہے،۳-اس باب میں عبداللہ بن عباس سے بھی حدیث مروی ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (3785) ابن ماجہ (3189)`;
tirmizi.anwaar = [234,1];