var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ أَيُّوبَ،عَنْ أَبِي قِلاَبَةَ،عَنْ زَهْدَمٍ،عَنْ أَبِي مُوسَى،قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ لَحْمَ دَجَاجٍ ‏.‏ قَالَ وَفِي الْحَدِيثِ كَلاَمٌ أَكْثَرُ مِنْ هَذَا ‏.‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَى أَيُّوبُ السَّخْتِيَانِيُّ هَذَا الْحَدِيثَ أَيْضًا عَنِ الْقَاسِمِ التَّمِيمِيِّ وَعَنْ أَبِي قِلاَبَةَ عَنْ زَهْدَمٍ (الْجَرْمِيِّ) ‏.‏";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو مرغ کا گوشت کھاتے دیکھا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس حدیث میں کچھ اور باتیں بھی ہیں،۳-ایوب سختیانی نے بھی اس حدیث کو «عن القاسم التميمي عن أبي قلابة عن زهدم» کی سند سے روایت کی ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;