var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ الْأَعْرَجُ الْبَغْدَادِيُّ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ،عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ بْنِ سَفِينَةَ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ:‏‏‏‏ أَكَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمَ حُبَارَى،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَإِبْرَاهِيمُ بْنُ عُمَرَ بْنِ سَفِينَةَ رَوَى عَنْهُ ابْنُ أَبِي فُدَيْكٍ،‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ بُرَيْدُ بْنُ عُمَرَ بْنِ سَفِينَةَ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کے ساتھ حباری کا گوشت کھایا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-ہم اسے صرف اسی سند سے جانتے ہیں،۳-ابراہیم بن عمر بن سفینہ سے ابن ابی فدیک نے بھی روایت کی ہے،انہیں برید بن عمر بن سفینہ بھی کہا گیا ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (3797)`;
tirmizi.anwaar = [235,1];