var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ،عَنْ أَبِيهِ،أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَزَّ مِنْ كَتِفِ شَاةٍ فَأَكَلَ مِنْهَا ثُمَّ مَضَى إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب:‏‏‏‏ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ.";
tirmizi.urdu = "انہوں نے نبی اکرم ﷺ کو دیکھا کہ آپ نے بکری کی دست کا گوشت چھری سے کاٹا،اور اس میں سے کھایا،پھر نماز کے لیے تشریف لے گئے اور وضو نہیں کیا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں مغیرہ بن شعبہ سے بھی روایت ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;