var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ،حَدَّثَنَا مُبَارَكُ بْنُ سَعِيدٍ هُوَ أَخُو سُفْيَانَ بْنِ سَعِيدٍ الثَّوْرِيِّ،‏‏‏‏‏‏عَنْ سُفْيَانَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ نِعْمَ الْإِدَامُ الْخَلُّ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَائِشَةَ،‏‏‏‏‏‏وَأُمِّ هَانِئٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”سرکہ کیا ہی بہترین سالن ہے“ ۱؎۔امام ترمذی کہتے ہیں: اس باب میں عائشہ اور ام ہانی سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;