var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ الْبَصْرِيُّ،حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،عَنْ سُفْيَانَ،عَنْ مُحَارِبِ بْنِ دِثَارٍ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ نِعْمَ الْإِدَامُ الْخَلُّ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا أَصَحُّ مِنْ حَدِيثِ مُبَارَكِ بْنِ سَعِيدٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”سرکہ کیا ہی بہترین سالن ہے“۔امام ترمذی کہتے ہیں: یہ حدیث مبارک بن سعید کی حدیث سے زیادہ صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;