var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى الْفَزَارِيُّ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعِدٍ.";
tirmizi.urdu = "نبی اکرم ﷺ تازہ کھجور کے ساتھ ککڑی کھاتے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-ہم اسے صرف ابراہیم بن سعد کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;