var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ،عَنْ أَبِي طَالُوتَ قَالَ:‏‏‏‏ دَخَلْتُ عَلَى أَنَسِ بْنِ مَالِكٍ وَهُوَ يَأْكُلُ الْقَرْعَ وَهُوَ يَقُولُ يَا لَكِ شَجَرَةً مَا أَحَبَّكِ إِلَيَّ لِحُبِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّاكِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ حَكِيمِ بْنِ جَابِرٍ،‏‏‏‏‏‏عَنْ أَبِيهِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "میں انس بن مالک کے پاس گیا،وہ کدو کھا رہے تھے،اور کہہ رہے تھے: اے بیل! کس قدر تو مجھے پسند ہے! کیونکہ رسول اللہ ﷺ تجھے پسند کرتے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے غریب ہے،۲-اس باب میں حکیم بن جابر سے بھی روایت ہے جسے حکیم اپنے والد سے روایت کرتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو طالوت: مجہول (تقریب: 8183) <br>والحدیث الآتي (سنن الترمذي/ الأصل: 1850) شاہد لبعضہ`;
tirmizi.anwaar = [235,1];