var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَبَانَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ،عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ الْعُقَيْلِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ،عَنْ أُمِّ كُلْثُومٍ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلْيَقُلْ بِسْمِ اللَّهِ فَإِنْ نَسِيَ فِي أَوَّلِهِ فَلْيَقُلْ بِسْمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِهِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب تم لوگوں میں سے کوئی کھانا کھائے تو «بسم اللہ» پڑھ لے،اگر شروع میں بھول جائے تو یہ کہے «بسم الله في أوله وآخره»۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4202`;