var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ،عَنْ ابْنِ شِهَابٍ،عَنْ أَبِي سَلَمَةَ،عَنْ عَائِشَةَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الْبِتْعِ فَقَالَ:‏‏‏‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ سے شہد کی نبیذ کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”ہر شراب جو نشہ پیدا کر دے وہ حرام ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;