var tirmizi = {};
tirmizi.arabic = "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جس نے بغیر عذر کے دو نمازیں ایک ساتھ پڑھیں وہ کبیرہ گناہوں کے دروازوں سے میں ایک دروازے میں داخل ہوا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-حنش ہی ابوعلی رحبی ہیں اور وہی حسین بن قیس بھی ہے۔یہ محدّثین کے نزدیک ضعیف ہے،احمد وغیرہ نے اس کی تضعیف کی ہے،۲-اور اسی پر اہل علم کا عمل ہے کہ سفر یا عرفہ کے سوا دو نمازیں ایک ساتھ نہ پڑھی جائیں،۳-تابعین میں سے بعض اہل علم نے مریض کو دو نمازیں ایک ساتھ جمع کرنے کی رخصت دی ہے۔یہی احمد اور اسحاق بن راہویہ بھی کہتے ہیں،۴-بعض اہل علم کہتے ہیں کہ بارش کے سبب بھی دو نمازیں جمع کی جا سکتی ہیں۔شافعی،احمد،اور اسحاق بن راہویہ کا یہی قول ہے۔البتہ شافعی مریض کے لیے دو نمازیں ایک ساتھ جمع کرنے کو درست قرار نہیں دیتے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا<br>حنش ھو حسین بن قیس الواسطي وھو متروک (تقریب: 1342)`;
tirmizi.anwaar = [194,1];