var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا هُشَيْمٌ،حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ،وَمُغِيرَةُ،عَنْ الشَّعْبِيِّ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ مِنْ زَمْزَمَ وَهُوَ قَائِمٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ،‏‏‏‏‏‏وَسَعْدٍ،‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏‏‏وَعَائِشَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے کھڑے ہو کر زمزم کا پانی پیا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں علی،سعد،عبداللہ بن عمرو اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;