var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا سُفْيَانُ،عَنْ الزُّهْرِيِّ،عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،عَنْ أَبِي سَعِيدٍ رِوَايَةً أَنَّهُ نَهَى عَنِ اخْتِنَاثِ الْأَسْقِيَةِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرٍ،‏‏‏‏‏‏وَابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "(رسول اللہ ﷺ نے) مشکیزوں سے منہ لگا کر پینے سے منع کیا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں جابر،ابن عباس اور ابوہریرہ رضی الله عنہ سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;