var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ ثَابِتٍ الْبُنَانِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ،عَنْ أَبِي قَتَادَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ أَبِي أَوْفَى،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”پلانے والے کو سب سے آخر میں پینا چاہیئے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن ابی اوفی سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;