var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ مَعْمَرٍ،عَنْ الزُّهْرِيِّ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ أَحَبُّ الشَّرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحُلْوَ الْبَارِدَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَكَذَا رَوَى غَيْرُ وَاحِدٍ،‏‏‏‏‏‏عَنْ ابْنِ عُيَيْنَةَ مِثْلَ هَذَا،‏‏‏‏‏‏عَنْ مَعْمَرٍ،‏‏‏‏‏‏عَنْ الزُّهْرِيِّ،‏‏‏‏‏‏عَنْ عُرْوَةَ،‏‏‏‏‏‏عَنْ عَائِشَةَ،‏‏‏‏‏‏وَالصَّحِيحُ مَا رُوِيَ عَنْ الزُّهْرِيِّ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا.";
tirmizi.urdu = "رسول اللہ ﷺ کو میٹھا اور ٹھنڈا مشروب سب سے زیادہ پسند تھا۔امام ترمذی کہتے ہیں: ابن عیینہ سے کئی لوگوں نے اسی طرح «عن معمر عن الزهري عن عروة عن عائشة» روایت کی ہے،لیکن صحیح وہی ہے جو زہری کے واسطہ سے نبی اکرم ﷺ سے مرسلاً مروی ہے (جو آگے آ رہی ہے)۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>الزہري عنعن <br>وللحدیث شاہد ضعیف عند أحمد (338/1)`;
tirmizi.anwaar = [237,1];