var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ،حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،حَدَّثَنَا شُعْبَةُ،عَنْ يَعْلَى بْنِ عَطَاءٍ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ رِضَا الرَّبِّ فِي رِضَا الْوَالِدِ،‏‏‏‏‏‏وَسَخَطُ الرَّبِّ فِي سَخَطِ الْوَالِدِ،‏‏‏‏";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”رب کی رضا والد کی رضا میں ہے اور رب کی ناراضگی والد کی ناراضگی میں ہے“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 4928`;