var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ أَبُو الْقَاسِمِ الْمَكِّيُّ الْقُرَشِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ،عَنْ أَبِيهِ،عَنْ سَهْلِ بْنِ سَعْدٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ كَهَاتَيْنِ وَأَشَارَ بِأُصْبُعَيْهِ،‏‏‏‏‏‏يَعْنِي:‏‏‏‏ السَّبَّابَةَ وَالْوُسْطَى،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”میں اور یتیم کی کفالت کرنے والا جنت میں ان دونوں کی طرح ہوں گے ۱؎ اور آپ نے اپنی شہادت اور درمیانی انگلی کی طرف اشارہ کیا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;