var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَبَانَ،حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،عَنْ مُحَمَّدِ بْنِ إِسْحَاق،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَيْسَ مِنَّا مَنْ لَمْ يَرْحَمْ صَغِيرَنَا،‏‏‏‏‏‏وَيَعْرِفْ شَرَفَ كَبِيرِنَا .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”وہ شخص ہم میں سے نہیں ہے جو ہمارے چھوٹوں پر مہربانی نہ کرے اور ہمارے بڑوں کا مقام نہ پہچانے“۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;