var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ إِسْمَاعِيل بْنِ أَبِي خَالِدٍ،عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ،عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى إِقَامِ الصَّلَاةِ،‏‏‏‏‏‏وَإِيتَاءِ الزَّكَاةِ،‏‏‏‏‏‏وَالنُّصْحِ لِكُلِّ مُسْلِمٍ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ سے نماز قائم کرنے،زکاۃ دینے اور ہر مسلمان کے ساتھ خیر خواہی کرنے پر بیعت کی ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;