var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ،وَغَيْرَ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ،عَنْ جَدِّهِ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ایک مومن دوسرے مومن کے لیے عمارت کی طرح ہے،جس کا ایک حصہ دوسرے حصہ کو مضبوط کرتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;