var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ،عَنْ لُؤْلُؤَةَ،عَنْ أَبِي صِرْمَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ ضَارَّ ضَارَّ اللَّهُ بِهِ،‏‏‏‏‏‏وَمَنْ شَاقَّ شَاقَّ اللَّهُ عَلَيْهِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو دوسرے کو نقصان پہنچائے اللہ اسے نقصان پہنچائے گا اور جو دوسرے کو تکلیف دے اللہ تعالیٰ اسے تکلیف دے گا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اس باب میں ابوبکر سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (3635) ابن ماجہ (2342)`;
tirmizi.anwaar = [238,1];