var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ أَبِي بَكْرٍ هُوَ ابْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ،عَنْ عَمْرَةَ،عَنْ عَائِشَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مجھے جبرائیل علیہ السلام پڑوسی کے ساتھ حسن سلوک کرنے کی ہمیشہ وصیت (تاکید) کرتے رہے،یہاں تک کہ مجھے گمان ہونے لگا کہ یہ اسے وراثت میں (بھی) شریک ٹھہرا دیں گے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;