var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ هَمَّامِ بْنِ يَحْيَى،عَنْ فَرْقَدٍ السَّبَخِيِّ،عَنْ مُرَّةَ،عَنْ أَبِي بَكْرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏وَقَدْ تَكَلَّمَ أَيُّوبُ السَّخْتِيَانِيُّ،‏‏‏‏‏‏وَغَيْرُ وَاحِدٍ فِي فَرْقَدٍ السَّبَخِيِّ مِنْ قِبَلِ حِفْظِهِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”وہ شخص جنت میں داخل نہیں ہو گا جو خادموں کے ساتھ برا سلوک کرتا ہے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-ایوب سختیانی اور کئی لوگوں نے راوی فرقد سبخی کے بارے میں ان کے حافظے کے تعلق سے کلام کیا ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (3691)<br>فرقد ضعیف`;
tirmizi.anwaar = [238,1];