var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،حَدَّثَنَا الرَّبِيعُ بْنُ مُسْلِمٍ،حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ لَا يَشْكُرُ النَّاسَ لَا يَشْكُرُ اللَّهَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو لوگوں کا شکر یہ ادا نہ کرے وہ اللہ کا شکر ادا نہیں کرے گا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;