var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ،عَنْ عَبْدِ الْمُنْعِمِ نَحْوَهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ جَابِرٍ هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عَبْدِ الْمُنْعِمِ،‏‏‏‏‏‏وَهُوَ إِسْنَادٌ مَجْهُولٌ،‏‏‏‏‏‏وَعَبْدُ الْمُنْعِمِ شَيْخٌ بَصْرِيٌّ.";
tirmizi.urdu = "عبدالمنعم سے اسی طرح کی حدیث مروی ہے۔امام ترمذی کہتے ہیں: جابر رضی الله عنہ کی حدیث کو ہم صرف اسی سند سے یعنی عبدالمنعم ہی کی روایت سے جانتے ہیں،اور یہ مجہول سند ہے،عبدالمنعم بصرہ کے شیخ ہیں (یعنی ضعیف راوی ہیں)۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا<br>عبد المنعم صاحب السقاء: متروک (تقریب: 4234)<br>وشیخہ یحیی بن مسلم البکاء : ضعیف (تقریب: 7645)<br>وللحدیث شواہد ضعیفۃ عند الحاکم (204/1) وغیرہ`;
tirmizi.anwaar = [195,1];