var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ،أَخْبَرَنَا أَبُو دَاوُدَ،حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى،حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ،عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ الْحُدَّانِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَصْلَتَانِ لَا تَجْتَمِعَانِ فِي مُؤْمِنٍ:‏‏‏‏ الْبُخْلُ،‏‏‏‏‏‏وَسُوءُ الْخُلُقِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ صَدَقَةَ بْنِ مُوسَى،‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مومن کے اندر دو خصلتیں بخل اور بداخلاقی جمع نہیں ہو سکتیں“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،ہم اسے صرف صدقہ بن موسیٰ کی روایت سے ہی جانتے ہیں۔۲-اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>صدقۃ بن موسی: ضعیف`;
tirmizi.anwaar = [238,1];