var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى،عَنْ فَرْقَدٍ السَّبَخِيِّ،عَنْ مُرَّةَ الطَّيِّبِ،عَنْ أَبِي بَكْرٍ الصِّدِّيقِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يَدْخُلُ الْجَنَّةَ خِبٌّ وَلَا مَنَّانٌ وَلَا بَخِيلٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”دھوکہ باز،احسان جتانے والا اور بخیل جنت میں نہیں داخل ہوں گے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>صدقۃ بن موسی ضعیف وفرقد السبخي ضعیف`;
tirmizi.anwaar = [238,2];