var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكٌ،عَنْ صَفْوَانَ بْنِ سُلَيْمٍ يَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ،‏‏‏‏‏‏أَوْ كَالَّذِي يَصُومُ النَّهَارَ وَيَقُومُ اللَّيْلَ .";
tirmizi.urdu = "آپ نے فرمایا: ”بیوہ اور مسکین پر خرچ کرنے والا اللہ کی راہ میں جہاد کرنے والے کی طرح ہے،یا اس آدمی کی طرح ہے جو دن میں روزہ رکھتا ہے اور رات میں عبادت کرتا ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;