var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ،قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ،عَنِ الْأَعْمَشِ،قَال:‏‏‏‏ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ،‏‏‏‏‏‏عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خِيَارُكُمْ أَحَاسِنُكُمْ أَخْلَاقًا،‏‏‏‏‏‏وَلَمْ يَكُنِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاحِشًا وَلَا مُتَفَحِّشًا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تم میں سب سے بہتر وہ لوگ ہیں جو اخلاق میں بہتر ہیں،نبی اکرم ﷺ بےحیاء اور بدزبان نہیں تھے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;