var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا هِشَامٌ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَلَاعَنُوا بِلَعْنَةِ اللَّهِ،‏‏‏‏‏‏وَلَا بِغَضَبِهِ،‏‏‏‏‏‏وَلَا بِالنَّارِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏‏‏وَابْنِ عُمَرَ،‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تم لوگ (کسی پر) اللہ کی لعنت نہ بھیجو،نہ اس کے غضب کی لعنت بھیجو اور نہ جہنم کی لعنت بھیجو“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس،ابوہریرہ،ابن عمر اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (4906)`;
tirmizi.anwaar = [239,1];