var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْوَضَّاحِ الْكُوفِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنْ شُعْبَةَ،عَنْ أَبِي التَّيَّاحِ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ أَنْ كَانَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُخَالِطُنَا حَتَّى إِنْ كَانَ لَيَقُولُ لِأَخٍ لِي صَغِيرٍ:‏‏‏‏ يَا أَبَا عُمَيْرٍ،‏‏‏‏‏‏مَا فَعَلَ النُّغَيْرُ .";
tirmizi.urdu = "رسول اللہ ﷺ ہمارے گھر والوں کے ساتھ اس قدر مل جل کر رہتے تھے کہ ہمارے چھوٹے بھائی سے فرماتے: ابوعمیر! نغیر کا کیا ہوا؟ ۱؎۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;