var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ الْبَغْدَادِيُّ،حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ أُسَامَةَ بْنِ زَيْدٍ،عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏إِنَّكَ تُدَاعِبُنَا،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنِّي لَا أَقُولُ إِلَّا حَقًّا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ مَعْنَى قَوْلِهِ:‏‏‏‏ إِنَّكَ تُدَاعِبُنَا:‏‏‏‏ إِنَّمَا يَعْنُونَ إِنَّكَ تُمَازِحُنَا.";
tirmizi.urdu = "لوگوں نے عرض کیا: اللہ کے رسول! آپ ہم سے ہنسی مذاق کرتے ہیں؟ آپ نے فرمایا: ”میں (خوش طبعی اور مزاح میں بھی) حق کے سوا کچھ نہیں کہتا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 4885`;