var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ،عَنْ حُمَيْدٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ رَجُلًا اسْتَحْمَل رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ إِنِّي حَامِلُكَ عَلَى وَلَدِ النَّاقَةِ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏مَا أَصْنَعُ بِوَلَدِ النَّاقَةِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ وَهَلْ تَلِدُ الْإِبِلَ إِلَّا النُّوقُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "ایک آدمی نے رسول اللہ ﷺ سے سواری کی درخواست کی،آپ نے فرمایا: ”میں تمہیں سواری کے لیے اونٹنی کا بچہ دوں گا“،اس آدمی نے عرض کیا: اللہ کے رسول! میں اونٹنی کا بچہ کیا کروں گا؟ رسول اللہ ﷺ نے فرمایا: ”بھلا اونٹ کو اونٹنی کے سوا کوئی اور بھی جنتی ہے؟“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4887
وللحدیث شاھد حسن عند الطبراني فی الکبیر (1/ 240 ح 662)`;