var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ شَرِيكٍ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ:‏‏‏‏ يَا ذَا الْأُذُنَيْنِ،‏‏‏‏‏‏قَالَ مَحْمُودٌ:‏‏‏‏ قَالَ أَبُو أُسَامَةَ:‏‏‏‏ يَعْنِي مَازَحَهُ،‏‏‏‏‏‏وَهَذَا الْحَدِيثُ حَدِيثٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے ان کو مخاطب کرتے ہوئے فرمایا: ”اے دو کان والے!“ محمود بن غیلان کہتے ہیں: ابواسامہ نے کہا،یعنی آپ ﷺ نے اس سے مزاح کیا۔امام ترمذی کہتے ہیں: یہ حدیث صحیح غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;