var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا فَضَالَةُ بْنُ الْفَضْلِ الْكُوفِيُّ،حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنِ ابْنِ وَهْبِ بْنِ مُنَبِّهٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَفَى بِكَ إِثْمًا أَنْ لَا تَزَالَ مُخَاصِمًا،‏‏‏‏‏‏وَهَذَا الْحَدِيثُ حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تمہارے لیے یہی گناہ کافی ہے کہ تم ہمیشہ جھگڑتے رہو“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن وھب بن منبہ: مجہول (تقریب: 8491)`;
tirmizi.anwaar = [240,1];