var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ،حَدَّثَنَا الْمُحَارِبِيُّ،عَنِ اللَّيْثِ وَهُوَ ابْنُ أَبِي سُلَيْمٍ،عَنْ عَبْدِ الْمَلِكِ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تُمَارِ أَخَاكَ وَلَا تُمَازِحْهُ وَلَا تَعِدْهُ مَوْعِدَةً فَتُخْلِفَهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ،‏‏‏‏‏‏وَعَبْدُ الْمَلِكِ عِنْدِي هُوَ ابْنُ أَبِي بَشِيرٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اپنے بھائی سے مت جھگڑو،نہ اس سے ہنسی مذاق کرو،اور نہ اس سے کوئی ایسا وعدہ کرو جس کی تم خلاف ورزی کرو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>لیث بن أبي سلیم: ضعیف`;
tirmizi.anwaar = [240,1];