var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ مُعَاوِيَةَ بْنِ يَحْيَى الصَّدَفِيِّ،عَنْ الزُّهْرِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يُؤَذِّنُ إِلَّا مُتَوَضِّئٌ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اذان وہی دے جو باوضو ہو“ ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>قال البیہقي فی السنن الکبری (397/1): ’’ھکذا رواہ معاویۃ بن یحیی الصدفي وھو ضعیف‘‘ وقال الھیثمي: وأحادیثہ عن الزھري مستقیمۃ کما قال البخاري و ھذا منھا وضعفہ الجمھور (مجمع الزوائد 2/ 84)<br>قلت: انظر الکامل لابن عدي (2395/6،والنسخۃ الأخری 138/8) فیہ الجنیدي وھو محمد بن عبد اللّٰہ بن الجنید: ذکرہ ابن حبان فی الثقات (155/9۔156) یعني فیما روی عنہ ھقل بن زیاد،انظر التاریخ الکبیر للبخاري (336/7) و الضعفاء الکبیر للعقیلي (182/4۔183) و في قول البخاري نظر۔`;
tirmizi.anwaar = [195,1];