var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ عُمَرَ بْنِ رَاشِدٍ،عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَزَالُ الرَّجُلُ يَذْهَبُ بِنَفْسِهِ حَتَّى يُكْتَبَ فِي الْجَبَّارِينَ فَيُصِيبُهُ مَا أَصَابَهُمْ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”انسان ہمیشہ اپنے آپ کو تکبر (گھمنڈ) کی طرف لے جاتا ہے،یہاں تک کہ ظالموں کی فہرست میں اس کا نام لکھ دیا جاتا ہے،اور اس لیے اسے وہی عذاب لاحق ہوتا ہے جو ظالموں کو لاحق ہوا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عمر بن راشد الیمامي: ضعیف (تقریب: 4894) وقال العراقی: ضعفہ الجمھور (تخریج الإحیاء 370/1) <br>وقال الھیثمی: وضعفہ الجمھور (مجمع الزوائد 46/10)`;
tirmizi.anwaar = [240,1];