var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،حَدَّثَنَا نُوحُ بْنُ قَيْسٍ،عَنْ عَبْدِ اللَّهِ بْنِ عِمْرَانَ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ الْمُزَنِيِّ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ السَّمْتُ الْحَسَنُ وَالتُّؤَدَةُ وَالِاقْتِصَادُ جُزْءٌ مِنْ أَرْبَعَةٍ وَعِشْرِينَ جُزْءًا مِنَ النُّبُوَّةِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اچھی خصلت،غور و خوص کرنا اور میانہ روی نبوت کے چوبیس حصوں میں سے ایک حصہ ہے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5059
وانظر مشکوۃ المصابیح (5060)`;