var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ،حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ،عَنْ قُرَّةَ بْنِ خَالِدٍ،عَنْ أَبِي جَمْرَةَ،عَنِ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَشَجِّ عَبْدِ الْقَيْسِ:‏‏‏‏ إِنَّ فِيكَ خَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ:‏‏‏‏ الْحِلْمُ وَالْأَنَاةُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏وَفِي الْبَابِ عَنِ الْأَشَجِّ الْعَصَرِيِّ.";
tirmizi.urdu = "نبی اکرم ﷺ نے منذر بن عائذ اشج عبدالقیس سے فرمایا: ”تمہارے اندر دو خصلتیں (خوبیاں) ایسی ہیں جو اللہ تعالیٰ کو پسند ہیں: بردباری اور غور و فکر کی عادت ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-اس باب میں اشج عصری سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;