var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ مِنْ شَرِّ النَّاسِ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ ذَا الْوَجْهَيْنِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ أَنَسٍ،‏‏‏‏‏‏وَعَمَّارٍ،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”قیامت کے دن اللہ کی نظر میں دو رخے شخص سے بدتر کوئی نہیں ہو گا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں انس اور عمار رضی الله عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;