var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ سُفْيَانَ،عَنِ الْأَعْمَشِ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ مَا عَابَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا قَطُّ كَانَ إِذَا اشْتَهَاهُ أَكَلَهُ وَإِلَّا تَرَكَهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو حَازِمٍ هُوَ الْأَشْجَعِيُّ الْكُوفِيُّ وَاسْمُهُ سَلْمَانُ مَوْلَى عَزَّةَ الْأَشْجَعِيَّةِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے کبھی بھی کسی کھانے میں عیب نہیں لگایا،جب آپ کو پسند آتا تو کھا لیتے نہیں تو چھوڑ دیتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;