var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،عَنْ عَمْرِو بْنِ الْحَارِثِ،عَنْ دَرَّاجٍ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا حَلِيمَ إِلَّا ذُو عَثْرَةٍ،‏‏‏‏‏‏وَلَا حَكِيمَ إِلَّا ذُو تَجْرِبَةٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”غلطی کرنے والے ہی بردبار ہوتے ہیں اور تجربہ والے ہی دانا ہوتے ہیں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5056`;