var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا بَكْرُ بْنُ يُونُسَ بْنِ بُكَيْرٍ،عَنْ مُوسَى بْنِ عَلِيٍّ،عَنْ أَبِيهِ،عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تم اپنے بیماروں کو کھانے پر مجبور نہ کرو،اس لیے کہ اللہ تعالیٰ انہیں کھلاتا پلاتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (3444)<br>بکر بن یونس بن بکیر ضعیف (تقریب: 754) ضعفہ الجمہور <br>ولحدیثہ شواھد ضعیفۃ عندالحاکم (4/ 410) وغیرہ`;
tirmizi.anwaar = [241,1];