var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْكَيِّ،‏‏‏‏‏‏قَالَ:‏‏‏‏ فَابْتُلِينَا فَاكْتَوَيْنَا فَمَا أَفْلَحْنَا وَلَا أَنْجَحْنَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے بدن داغنے سے منع فرمایا ۱؎،پھر بھی ہم بیماری میں مبتلا ہوئے تو ہم نے بدن داغ لیا،لیکن ہم کامیاب و کامران نہیں ہوئے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;