var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ،حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ،حَدَّثَنَا هَمَّامٌ،وَجَرِيرُ بْنُ حَازِمٍ،قَالَا:‏‏‏‏ حَدَّثَنَا قَتَادَةُ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَجِمُ فِي الْأَخْدَعَيْنِ وَالْكَاهِلِ،‏‏‏‏‏‏وَكَانَ يَحْتَجِمُ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَمَعْقِلِ بْنِ يَسَارٍ،‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ گردن کی دونوں جانب موجود دو پوشیدہ رگوں اور کندھے پر پچھنا لگواتے تھے،اور آپ مہینہ کی سترہویں،انیسویں اور اکیسویں تاریخ کو پچھنا لگواتے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اس باب میں ابن عباس اور معقل بن یسار رضی الله عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (3860) ابن ماجہ (3483)`;
tirmizi.anwaar = [241,1];