var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا سُفْيَانُ،عَنْ مَنْصُورٍ،عَنْ مُجَاهِدٍ،عَنْ عَقَّارِ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنِ اكْتَوَى أَوِ اسْتَرْقَى فَقَدْ بَرِئَ مِنَ التَّوَكُّلِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ،‏‏‏‏‏‏وَابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے بدن داغا یا جھاڑ پھونک کرائی وہ توکل کرنے والوں میں سے نہ رہا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن مسعود،ابن عباس اور عمران بن حصین رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (3489)<br>مجاہد سمعہ من عقار ولکن لم یضبطہ جیدًا فثبتہ فیہ حسان بن أبي وجزۃ وھو مجھول الحال`;
tirmizi.anwaar = [317,1];