var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ،عَنْ حُصَيْنٍ،عَنِ الشَّعْبِيِّ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ حُصَيْنٍ،عَنِ الشَّعْبِيِّ،عَنْ بُرَيْدَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏بِمِثْلِهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جھاڑ پھونک صرف نظر بد اور پسلی میں نکلنے والے دانے کی وجہ سے ہی جائز ہے“ ۱؎۔امام ترمذی کہتے ہیں: شعبہ نے یہ حدیث «عن حصين عن الشعبي عن بريدة عن النبي صلى الله عليه وسلم» کی سند سے اسی کے مثل روایت کی ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4557`;