var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هِشَامُ بْنُ يُونُسَ الْكُوفِيُّ،حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ،عَنِ الْجُرَيْرِيِّ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي سَعِيدٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنَ الْجَانِّ وَعَيْنِ الْإِنْسَانِ حَتَّى نَزَلَتِ الْمُعَوِّذَتَانِ،‏‏‏‏‏‏فَلَمَّا نَزَلَتَا أَخَذَ بِهِمَا وَتَرَكَ مَا سِوَاهُمَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ أَنَسٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ جنوں اور انسان کی نظر بد سے پناہ مانگا کرتے تھے،یہاں تک کہ معوذتین (سورۃ الفلق اور سورۃ الناس) نازل ہوئیں،جب یہ سورتیں اتر گئیں تو آپ نے ان دونوں کو لے لیا اور ان کے علاوہ کو چھوڑ دیا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اس باب میں انس سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>نسائي (5496) ابن ماجہ (3511)<br>الجریري اختلط (د 1555) و لم أجد راویًا عنہ في ھذا الحدیث قبل اختلاطہ`;
tirmizi.anwaar = [242,1];