var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ،عَنِ الزُّهْرِيِّ،عَنْ أَبِي خُزَامَةَ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏أَرَأَيْتَ رُقًى نَسْتَرْقِيهَا وَدَوَاءً نَتَدَاوَى بِهِ وَتُقَاةً نَتَّقِيهَا:‏‏‏‏ هَلْ تَرُدُّ مِنْ قَدَرِ اللَّهِ شَيْئًا؟ قَالَ:‏‏‏‏ هِيَ مِنْ قَدَرِ اللَّهِ!،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏";
tirmizi.urdu = "میں نے رسول اللہ ﷺ سے پوچھا: اللہ کے رسول! جس دم سے ہم جھاڑ پھونک کرتے ہیں،جس دوا سے علاج کرتے ہیں اور جن بچاؤ کی چیزوں سے ہم اپنا بچاؤ کرتے ہیں (ان کے بارے میں آپ کا کیا خیال ہے؟) کیا یہ اللہ کی تقدیر میں کچھ تبدیلی کرتی ہیں؟ آپ نے فرمایا: ”یہ سب بھی اللہ کی لکھی ہوئی تقدیر ہی کا حصہ ہیں“ ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (3437 وسیأتي: 2148)<br>ابن أبي خزامۃ مجھول الحال،وثقہ الترمذي وحدہ`;
tirmizi.anwaar = [242,1];