var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُعَاذ،حَدَّثَنَا أَبِي،عَنْ قَتَادَةَ،قَالَ:‏‏‏‏ حُدِّثْتُ،‏‏‏‏‏‏أَنَّ أَبَا هُرَيْرَةَ،قَالَ:‏‏‏‏ أَخَذْتُ ثَلَاثَةَ أَكْمُؤٍ،‏‏‏‏‏‏أَوْ خَمْسًا أَوْ سَبْعًا فَعَصَرْتُهُنَّ فَجَعَلْتُ مَاءَهُنَّ فِي قَارُورَةٍ فَكَحَلْتُ بِهِ جَارِيَةً لِي فَبَرَأَتْ .";
tirmizi.urdu = "میں نے تین،پانچ یا سات کھنبی لی،ان کو نچوڑا،پھر اس کا عرق ایک شیشی میں رکھا اور اسے ایک لڑکی کی آنکھ میں ڈالا تو وہ صحت یاب ہو گئی۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>السند منقطع`;
tirmizi.anwaar = [242,1];