var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنِ ابْنِ شِهَابٍ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ،قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ،‏‏‏‏‏‏وَمَهْرِ الْبَغِيِّ،‏‏‏‏‏‏وَحُلْوَانِ الْكَاهِنِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے کتے کی قیمت،زانیہ عورت کی کمائی اور کاہن کے نذرانے لینے سے منع فرمایا ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;