var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ،حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ أَبِي عَبْدِ اللَّهِ،عَنْ زَيْدِ بْنِ أَرْقَمَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْعَتُ الزَّيْتَ وَالْوَرْسَ مِنْ ذَاتِ الْجَنْبِ،‏‏‏‏‏‏قَالَ قَتَادَةُ:‏‏‏‏ وَيَلُدُّهُ مِنَ الْجَانِبِ الَّذِي يَشْتَكِيهِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو عَبْدِ اللَّهِ اسْمُهُ مَيْمُونٌ هُوَ شَيْخٌ بَصْرِيٌّ.";
tirmizi.urdu = "نبی اکرم ﷺ ذات الجنب ۱؎ کی بیماری میں زیتون کا تیل اور ورس ۲؎ تشخیص کرتے تھے،قتادہ کہتے ہیں: اس کو منہ میں ڈالا جائے گا،اور منہ کی اس جانب سے ڈالا جائے گا جس جانب مرض ہو۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-ابوعبداللہ کا نام میمون ہے،وہ ایک بصریٰ شیخ ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (3467)<br>میمون أبو عبد اللّٰہ:ضعیف (تقریب: 7051)`;
tirmizi.anwaar = [242,1];