var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،قَالَ:‏‏‏‏ أَخْبَرَنَا الْوَلِيدُ بْنُ مُحَمَّدٍ الْمُوَقَّرِيُّ،عَنِ الزُّهْرِيِّ،عَنِ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا مَثَلُ الْمَرِيضِ إِذَا بَرَأَ وَصَحَّ كَالْبَرْدَةِ تَقَعُ مِنَ السَّمَاءِ فِي صَفَائِهَا وَلَوْنِهَا .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب مریض صحت یاب اور تندرست ہو جائے تو شفافیت اور رنگ میں اس کی مثال اس اولے کی طرح ہے جو آسمان سے گرتا ہے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا<br>الولید بن محمد: متروک (تقریب: 7453)`;
tirmizi.anwaar = [243,1];