var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ،قَالَ:‏‏‏‏ أَخْبَرَنَا عَبْدُ الرَّحْمَنُ بْنُ مَهْدِيٍّ،عَنْ سُفْيَانَ الثَّوْرِيِّ،عَنْ هِشَامِ بْنِ حَسَّانِ،عَنِ الْحَسَنِ،قَالَ:‏‏‏‏ كَانُوا يَرْتَجُونَ الْحُمَّى لَيْلَةً كَفَّارَةً لِمَا نَقَصَ مِنَ الذُّنُوبِ .";
tirmizi.urdu = "ایک رات صحابہ یہ امید ظاہر کر رہے تھے کہ بخار چھوٹے گناہوں کے لیے کفارہ ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سفیان الثوري وشیخہ ھشام بن حسان مدلسان و عنعنا`;
tirmizi.anwaar = [243,1];