var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلٍ،حَدَّثَنَا مُحَمَّدُ بْنُ الْقَاسِمِ الْأَسَدِيُّ،حَدَّثَنَا الْفَضْلُ بْنُ دَلْهَمٍ،حَدَّثَنَا عَوْفٌ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَعَلَّمُوا الْقُرْآنَ وَالْفَرَائِضَ،‏‏‏‏‏‏وَعَلِّمُوا النَّاسَ فَإِنِّي مَقْبُوضٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ فِيهِ اضْطِرَابٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”قرآن اور علم فرائض سیکھو اور لوگوں کو سکھاؤ اس لیے کہ میں وفات پانے والا ہوں“۔امام ترمذی کہتے ہیں: اس حدیث میں اضطراب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `ضعیف<br>محمد بن القاسم: کذبوہ والفضل: ضعیف <br>ولبعض الحدیث شواہد ضعیفۃ عند ابن ماجہ (2719) وغیرہ<br>وفی السند الآخر سلیمان بن جابر: مجہول (تقریب: 2541) وکذا تلمیذہ: مجہول`;
tirmizi.anwaar = [243,1];