var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،حَدَّثَنَا وُهَيْبٌ،حَدَّثَنَا ابْنُ طَاوُسٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا،‏‏‏‏‏‏فَمَا بَقِيَ فَهُوَ لِأَوْلَى رَجُلٍ ذَكَرٍ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اللہ کی جانب سے متعین میراث کے حصوں کو حصہ داروں تک پہنچا دو،پھر اس کے بعد جو بچے وہ میت کے قریبی مرد رشتہ دار کا ہے“۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;