var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ،عَنِ الزُّهْرِيِّ. ح وَحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا هُشَيْمٌ،عَنِ الزُّهْرِيِّ،عَنْ عَلِيِّ بْنِ حُسَيْنٍ،عَنْ عَمْرِو بْنِ عُثْمَانَ،عَنْ أُسَامَةَ بْنِ زَيْدٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ،‏‏‏‏‏‏وَلَا الْكَافِرُ الْمُسْلِمَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مسلمان کافر کا وارث نہیں ہو گا اور نہ کافر مسلمان کا وارث ہو گا“ ۱؎۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;