var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ،عَنِ ابْنِ أَبِي لَيْلَى،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ جَابِرٍ إِلَّا مِنْ حَدِيثِ ابْنِ أَبِي لَيْلَى.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”دو مختلف مذہب کے لوگ ایک دوسرے کے وارث نہیں ہوں گے“ ۱؎۔امام ترمذی کہتے ہیں: ہم اس حدیث کو صرف ابن ابی لیلیٰ کی روایت سے جانتے ہیں جسے وہ جابر رضی الله عنہ سے روایت کرتے ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 3047`;