var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَرِثُ الْوَلَاءَ مَنْ يَرِثُ الْمَالَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ولاء کا وارث وہی ہو گا جو مال کا وارث ہو گا“۔امام ترمذی کہتے ہیں: اس حدیث کی سند زیادہ قوی نہیں ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن لھیعۃ ضعیف لاختلاطہ و لہ شاھد عند أحمد (22/1ح 147) وسندہ معلل بالإنقطاع`;
tirmizi.anwaar = [244,1];