var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي إِسْحَاق الْهَمْدَانِيِّ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى بِالدَّيْنِ قَبْلَ الْوَصِيَّةِ،‏‏‏‏‏‏وَأَنْتُمْ تُقِرُّونَ الْوَصِيَّةَ قَبْلَ الدَّيْنِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ أَنَّهُ يُبْدَأُ بِالدَّيْنِ قَبْلَ الْوَصِيَّةِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے وصیت (کے نفاذ) سے پہلے قرض کی ادائیگی کا فیصلہ فرمایا،جب کہ تم (قرآن میں) قرض سے پہلے وصیت پڑھتے ہو ۱؎۔امام ترمذی کہتے ہیں: عام اہل علم کا اسی پر عمل ہے کہ وصیت سے پہلے قرض ادا کیا جائے گا۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (2739)<br>الحارث الأعور ضعیف رافضي (سنن أبي داود : 908) <br>و أبو إسحاق لم یسمع منہ <br>و حدیث ابن ماجہ (الأصل: 2433) یغني عنہ`;
tirmizi.anwaar = [244,1];