var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَرَادَ اللَّهُ بِعَبْدٍ خَيْرًا اسْتَعْمَلَهُ،‏‏‏‏‏‏فَقِيلَ:‏‏‏‏ كَيْفَ يَسْتَعْمِلُهُ يَا رَسُولَ اللَّهِ؟ قَالَ:‏‏‏‏ يُوَفِّقُهُ لِعَمَلٍ صَالِحٍ قَبْلَ الْمَوْتِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب اللہ تعالیٰ کسی بندے کے ساتھ بھلائی کا ارادہ کرتا ہے تو اس سے عمل کراتا ہے“،عرض کیا گیا: اللہ کے رسول! کیسے عمل کراتا ہے؟ آپ نے فرمایا: ”موت سے پہلے اسے عمل صالح کی توفیق دیتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5288`;