var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ،عَنْ أَبِي صَخْرٍ حُمَيْدِ بْنِ زِيَادٍ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَكُونُ فِي أُمَّتِي خَسْفٌ وَمَسْخٌ،‏‏‏‏‏‏وَذَلِكَ فِي الْمُكَذِّبِينَ بِالْقَدَرِ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”میری امت میں «خسف» اور «مسخ» کا عذاب ہو گا اور یہ عذاب تقدیر کے جھٹلانے والوں پر آئے گا“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 106`;