var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكٌ،عَنْ ابْنِ شِهَابٍ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ صَلَاةَ الرَّجُلِ فِي الْجَمَاعَةِ تَزِيدُ عَلَى صَلَاتِهِ وَحْدَهُ بِخَمْسَةٍ وَعِشْرِينَ جُزْءًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”آدمی کی باجماعت نماز اس کی تنہا نماز سے پچیس گنا بڑھ کر ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;