var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مَيْمُونٍ،عَنِ ابْنِ طَاوُسٍ،عَنِ أَبِيهِ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَدُ اللَّهِ مَعَ الْجَمَاعَةِ،‏‏‏‏‏‏هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ ابْنِ عَبَّاسٍ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اللہ کا ہاتھ (اس کی مدد و نصرت) جماعت کے ساتھ ہوتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے ابن عباس رضی الله عنہما کی روایت سے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;