var tirmizi = {};
tirmizi.arabic = "قَالَ مُجَاهِدٌ:‏‏‏‏ قَالَ مُجَاهِدٌ:‏‏‏‏ وَسُئِلَ ابْنُ عَبَّاسٍ عَنْ رَجُلٍ يَصُومُ النَّهَارَ وَيَقُومُ اللَّيْلَ لَا يَشْهَدُ جُمْعَةً وَلَا جَمَاعَةً؟ قَالَ:‏‏‏‏ هُوَ فِي النَّارِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بِذَلِكَ هَنَّادٌ،حَدَّثَنَا الْمُحَارِبِيُّ،عَنْ لَيْثٍ،عَنْ مُجَاهِدٍ،‏‏‏‏ قَالَ:‏‏‏‏ وَمَعْنَى الْحَدِيثِ أَنْ لَا يَشْهَدَ الْجَمَاعَةَ وَالْجُمُعَةَ رَغْبَةً عَنْهَا وَاسْتِخْفَافًا بِحَقِّهَا وَتَهَاوُنًا بِهَا.";
tirmizi.urdu = "ابن عباس رضی الله عنہما سے اس شخص کے بارے میں پوچھا گیا جو دن کو روزہ رکھتا ہو اور رات کو قیام کرتا ہو۔اور جمعہ میں حاضر نہ ہوتا ہو،تو انہوں نے کہا: وہ جہنم میں ہو گا۔مجاہد کہتے ہیں: حدیث کا مفہوم یہ ہے کہ وہ جماعت اور جمعہ میں ان سے بے رغبتی کرتے ہوئے،انہیں حقیر جانتے ہوئے اور ان میں سستی کرتے ہوئے حاضر نہ ہوتا ہو۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف موقوف<br>عبد الرحمن بن محمد المحاربي عنعن وھو مدلس<br>ولیث بن أبي سلیم ضعیف مدلس`;
tirmizi.anwaar = [196,1];