var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ الْمُعَلَّى بْنِ زِيَادٍ،رَدَّهُ إِلَى مُعَاوِيَةَ بْنِ قُرَّةَ،رَدَّهُ إِلَى مَعْقِلِ بْنِ يَسَارٍ،رَدَّهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْعِبَادَةُ فِي الْهَرْجِ كَالْهِجْرَةِ إِلَيَّ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ،‏‏‏‏‏‏عَنِ الْمُعَلَّى.";
tirmizi.urdu = "نبی کریم ﷺ نے فرمایا: ”قتل و خوں ریزی کے زمانہ میں عبادت کرنا میری طرف ہجرت کرنے کے مانند ہے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث صحیح غریب ہے،۲-ہم اسے صرف حماد بن زید کی روایت سے جانتے ہیں،جسے وہ معلی سے روایت کرتے ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;