var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَقُومُ السَّاعَةُ حَتَّى لَا يُقَالَ فِي الْأَرْضِ:‏‏‏‏ اللَّهُ اللَّهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”قیامت اس وقت تک قائم نہیں ہو گی جب تک روئے زمین پر اللہ اللہ کہا جائے گا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;