var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ،عَنْ الْحَسَنِ،عَنْ جُنْدَبِ بْنِ سُفْيَانَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ صَلَّى الصُّبْحَ فَهُوَ فِي ذِمَّةِ اللَّهِ،‏‏‏‏‏‏فَلَا تُخْفِرُوا اللَّهَ فِي ذِمَّتِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم صلی الله علیہ وسلم نے فرمایا: ”جس نے فجر پڑھی وہ اللہ کی پناہ میں ہے تو تم اللہ کی پناہ ہاتھ سے جانے نہ دو“ ۱؎۔امام ترمذی کہتے ہیں: حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;