var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى،عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ،عَنْ عَبْدِ اللَّهِ بْنِ عُصْمٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فِي ثَقِيفٍ كَذَّابٌ وَمُبِيرٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ يُقَالُ الْكَذَّابُ:‏‏‏‏ الْمُخْتَارُ بْنُ أَبِي عُبَيْدٍ،‏‏‏‏‏‏وَالْمُبِيرُ:‏‏‏‏ الْحَجَّاجُ بْنُ يُوسُفَ،‏‏‏‏";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”بنو ثقیف میں ایک جھوٹا اور ہلاک کرنے والا ہو گا“۔امام ترمذی کہتے ہیں: کہا جاتا ہے کذاب اور جھوٹے سے مراد مختار بن ابی عبید ثقفی اور ہلاک کرنے والا سے مراد حجاج بن یوسف ہے ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5993`;