var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ الْعَبْدِيُّ،حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ،عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ،عَنْ عُمَرَ بْنِ الْحَكَمِ،قَال:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ،يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَذْهَبُ اللَّيْلُ وَالنَّهَارُ حَتَّى يَمْلِكَ رَجُلٌ مِنَ الْمَوَالِي،‏‏‏‏‏‏يُقَالُ لَهُ:‏‏‏‏ جَهْجَاهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”رات اور دن اس وقت تک باقی رہیں گے (یعنی قیامت نہیں آئے گی) یہاں تک کہ جہجاہ نامی ایک غلام بادشاہت کرے گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;