var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ تُقَاتِلُكُمْ الْيَهُودُ فَتُسَلَّطُونَ عَلَيْهِمْ حَتَّى يَقُولَ الْحَجَرُ:‏‏‏‏ يَا مُسْلِمُ،‏‏‏‏‏‏هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”یہود تم سے لڑیں گے اور تم ان پر غالب ہو جاؤ گے یہاں تک کہ پتھر کہے گا: اے مسلمان! میرے پیچھے یہ یہودی ہے اسے قتل کر دو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;