var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ،عَنْ شُعْبَةَ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ فَتْحُ الْقُسْطَنْطِينِيَّةِ مَعَ قِيَامِ السَّاعَةِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏هِيَ مَدِينَةُ الرُّومِ،‏‏‏‏‏‏تُفْتَحُ عِنْدَ خُرُوجِ الدَّجَّالِ،‏‏‏‏‏‏قَدْ فُتِحَتْ فِي زَمَانِ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
tirmizi.urdu = "قسطنطنیہ قیامت کے قریب فتح ہو گا۔محمود بن غیلان کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5436
وقال محمود (بن غیلان) فیہ: ’’ھذا حدیث غریب، والقسطنطنیۃ ھي مدینۃ الروم تفتح عند خروج الدجال، والقسطنطنیۃ قد فتحت في زمان بعض أصحاب النبي ﷺ‘‘`;