var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،قَال:‏‏‏‏ سَمِعْتُ أَنَسًا،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا مِنْ نَبِيٍّ إِلَّا وَقَدْ أَنْذَرَ أُمَّتَهُ الْأَعْوَرَ الْكَذَّابَ،‏‏‏‏‏‏أَلَا إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ،‏‏‏‏‏‏مَكْتُوبٌ بَيْنَ عَيْنَيْهِ ك ف ر،هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”کوئی نبی ایسا نہیں تھا جس نے اپنی امت کو کانے اور جھوٹے (دجال) سے نہ ڈرایا ہو،سنو! وہ کانا ہے،جب کہ تمہارا رب کانا نہیں ہے،اس کی دونوں آنکھوں کے بیچ ’’«ک»،‏‏‏‏ «ف»،‏‏‏‏ «ر»‘‘ لکھا ہوا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;