var tirmizi = {};
tirmizi.arabic = "وقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ أَنَّ النَّاسَ يَعْلَمُونَ مَا فِي النِّدَاءِ وَالصَّفِّ الْأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عَلَيْهِ لَاسْتَهَمُوا عَلَيْهِ قَالَ:‏‏‏‏ حَدَّثَنَا بِذَلِكَ إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكٌ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ،‏‏‏‏";
tirmizi.urdu = "نبی اکرم صلی الله علیہ وسلم نے فرمایا: ”اگر لوگوں کو معلوم ہو جائے کہ اذان اور پہلی صف میں کیا ثواب ہے،اور وہ اسے قرعہ اندازی کے بغیر نہ پا سکتے تو اس کے لیے قرعہ اندازی کرتے“۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;