var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا عَلَى الْأَرْضِ نَفْسٌ مَنْفُوسَةٌ،‏‏‏‏‏‏يَعْنِي الْيَوْمَ تَأْتِي عَلَيْهَا مِائَةُ سَنَةٍ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ،‏‏‏‏‏‏وَأَبِي سَعِيدٍ،‏‏‏‏‏‏وَبُرَيْدَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”آج روئے زمین پر جو بھی زندہ ہے سو سال بعد نہیں رہے گا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-اس باب میں ابن عمر،ابو سعید خدری اور بریدہ رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;