var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ،حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ عَلِيِّ بْنِ زَيْدٍ،عَنِ الْحَسَنِ،عَنْ جُنْدَبٍ،عَنْ حُذَيْفَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَنْبَغِي لِلْمُؤْمِنِ أَنْ يُذِلَّ نَفْسَهُ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ وَكَيْفَ يُذِلُّ نَفْسَهُ؟ قَالَ:‏‏‏‏ يَتَعَرَّضُ مِنَ الْبَلَاءِ لِمَا لَا يُطِيقُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مومن کے لیے مناسب نہیں ہے کہ وہ اپنے نفس کو ذلیل کرے“،صحابہ نے عرض کیا: اپنے نفس کو کیسے ذلیل کرے گا؟ آپ نے فرمایا: ”اپنے آپ کو ایسی مصیبت سے دو چار کرے جسے جھیلنے کی وہ طاقت نہ رکھتا ہو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (4016)<br>علي بن زید بن جدعان: ضعیف <br>وللحدیث شاہد ضعیف عند الطبراني فی الکبیر (408/12 409 ح 13507)`;
tirmizi.anwaar = [248,1];