var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى الْفَزَارِيُّ ابْنُ بِنْتِ السُّدِّيِّ الْكُوفِيِّ،حَدَّثَنَا عُمَرُ بْنُ شَاكِرٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ الصَّابِرُ فِيهِمْ عَلَى دِينِهِ كَالْقَابِضِ عَلَى الْجَمْرِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏‏‏وَعُمَرُ بْنُ شَاكِرٍ شَيْخٌ بَصْرِيٌّ،‏‏‏‏‏‏قَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”لوگوں پر ایک ایسا زمانہ آئے گا کہ ان میں اپنے دین پر صبر کرنے والا آدمی ایسا ہو گا جیسے ہاتھ میں چنگاری پکڑنے والا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے غریب ہے،۲-عمر بن شاکر ایک بصریٰ شیخ ہیں،ان سے کئی اہل علم نے حدیث روایت کی ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عمر بن شاکر ضعیف (تقریب: 4917) <br>والحدیث الآتي (الأصل: 3058) یغني عنہ`;
tirmizi.anwaar = [248,2];