var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَقَالَ:‏‏‏‏ هَاهُنَا أَرْضُ الْفِتَنِ،‏‏‏‏‏‏وَأَشَارَ إِلَى الْمَشْرِقِ،‏‏‏‏‏‏يَعْنِي حَيْثُ يَطْلُعُ جِذْلُ الشَّيْطَانِ،‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ قَرْنُ الشَّيْطَانِ،‏‏‏‏‏‏هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ منبر پر کھڑے ہوئے اور فرمایا: ”فتنے کی سر زمین وہاں ہے اور آپ نے مشرق (پورب) کی طرف اشارہ کیا یعنی جہاں سے شیطان کی شاخ یا سینگ نکلتی ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;