var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ،عَنْ يُونُسَ،عَنِ ابْنِ شِهَابٍ الزُّهْرِيِّ،عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَخْرُجُ مِنْ خُرَاسَانَ رَايَاتٌ سُودٌ لَا يَرُدُّهَا شَيْءٌ حَتَّى تُنْصَبَ بِإِيلِيَاءَ،‏‏‏‏‏‏هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”خراسان سے کالے جھنڈے نکلیں گے،ان جھنڈوں کو کوئی چیز پھیر نہیں سکے گی یہاں تک کہ (فلسطین کے شہر) ایلیاء میں یہ نصب کیے جائیں گے“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>رشدین بن سعد: ضعیف ضعفہ الجمھور (مجمع الزوائد 5 / 66)`;
tirmizi.anwaar = [249,1];