var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ،حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ الْأَعْلَى،عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ أُرَاهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ كَذَبَ فِي حُلْمِهِ كُلِّفَ يَوْمَ الْقِيَامَةِ عَقْدَ شَعِيرَةٍ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جو شخص جھوٹا خواب بیان کرے،قیامت کے دن اسے جو کے درمیان گرہ لگانے پر مکلف کیا جائے گا“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 5459`;