var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ عَبْدِ الْأَعْلَى،عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ،عَنْ عَلِيٍّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏‏‏وَأَبِي شُرَيْحٍ،‏‏‏‏‏‏وَوَاثِلَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا أَصَحُّ مِنَ الْحَدِيثِ الْأَوَّلِ.";
tirmizi.urdu = "علی رضی الله عنہ نبی اکرم ﷺ کے واسطہ سے اسی جیسی حدیث روایت کرتے ہیں۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-یہ حدیث پہلی حدیث سے زیادہ صحیح ہے،۳-اس باب میں ابن عباس،ابوہریرہ،ابوشریح اور واثلہ رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;