var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الْوَهَّابِ،حَدَّثَنَا أَيُّوبُ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ تَحَلَّمَ كَاذِبًا كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ،‏‏‏‏‏‏وَلَنْ يَعْقِدَ بَيْنَهُمَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جو شخص جھوٹا خواب بیان کرے تو قیامت کے دن دو جو کے درمیان گرہ لگانے پر مکلف کیا جائے گا اور وہ ان دونوں کے درمیان گرہ ہرگز نہیں لگا سکے گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;