var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ،عَنْ أَبِيهِ،عَنْ صَالِحِ بْنِ كَيْسَانَ،عَنِ الزُّهْرِيِّ،عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا أَصَحُّ.";
tirmizi.urdu = "ابو سعید خدری رضی الله عنہ نبی اکرم ﷺ سے اسی جیسی اور اسی معنی کی حدیث روایت کرتے ہیں۔امام ترمذی کہتے ہیں: یہ زیادہ صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;