var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ،وَسُوَيْدُ بْنُ نَصْرٍ،قَالَ صَالِحٌ:‏‏‏‏ حَدَّثَنَا،‏‏‏‏‏‏وَقَالَ سُوَيْدٌ:‏‏‏‏ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عَبَّاسٍ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ الصِّحَّةُ وَالْفَرَاغُ .";
tirmizi.urdu = "رسول اللہ ﷺ نے ارشاد فرمایا: ”دو نعمتیں ایسی ہیں جن میں اکثر لوگ اپنا نقصان کرتے ہیں“۔\nایک تندرستی اور دوسری فراغت";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;