var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَكْثِرُوا ذِكْرَ هَاذِمِ اللَّذَّاتِ،‏‏‏‏‏‏يَعْنِي الْمَوْتَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”لذتوں کو توڑنے والی (یعنی موت) کو کثرت سے یاد کیا کرو“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب،۲-اس باب میں ابو سعید خدری رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 1607`;