var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ الْفَلَّاسُ،حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا،‏‏‏‏‏‏وَلَبَكَيْتُمْ كَثِيرًا،‏‏‏‏‏‏هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو میں جانتا ہوں اگر تم لوگ جان لیتے تو ہنستے کم اور روتے زیادہ“۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;