var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ مُحَمَّدِ بْنِ إِسْحَاق،حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ،عَنْ عِيسَى بْنِ طَلْحَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ لَا يَرَى بِهَا بَأْسًا يَهْوِي بِهَا سَبْعِينَ خَرِيفًا فِي النَّارِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”آدمی کبھی ایسی بات کہہ دیتا ہے جس میں وہ خود کوئی حرج نہیں سمجھتا حالانکہ اس کی وجہ سے وہ ستر برس تک جہنم کی آگ میں گرتا چلا جائے گا“ ۱؎۔امام ترمذی کہتے ہیں: اس سند سے یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;