var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ،حَدَّثَنِي أَبِي،عَنْ جَدِّي،قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ وَيْلٌ لِلَّذِي يُحَدِّثُ بِالْحَدِيثِ لِيُضْحِكَ بِهِ الْقَوْمَ فَيَكْذِبُ،‏‏‏‏‏‏وَيْلٌ لَهُ وَيْلٌ لَهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "میں نے نبی اکرم ﷺ کو فرماتے سنا ہے: ”تباہی و بربادی ہے اس شخص کے لیے جو ایسی بات کہتا ہے کہ لوگ سن کر ہنسیں حالانکہ وہ بات جھوٹی ہوتی ہے تو ایسے شخص کے لیے تباہی ہی تباہی ہے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-اس باب میں ابوہریرہ سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 4834`;