var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الْجَبَّارِ الْبَغْدَادِيُّ،حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ،حَدَّثَنَا أَبِي،عَنْ الْأَعْمَشِ،عَنْ أَنَسٍ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ تُوُفِّيَ رَجُلٌ مِنْ أَصْحَابِهِ،‏‏‏‏‏‏فَقَالَ يَعْنِي رَجُلًا:‏‏‏‏ أَبْشِرْ بِالْجَنَّةِ،‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَوَلَا تَدْرِي فَلَعَلَّهُ تَكَلَّمَ فِيمَا لَا يَعْنِيهِ،‏‏‏‏‏‏أَوْ بَخِلَ بِمَا لَا يَنْقُصُهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "ایک صحابی کی وفات ہو گئی،ایک آدمی نے کہا: تجھے جنت کی بشارت ہو،رسول اللہ ﷺ نے فرمایا: ”شاید تمہیں نہیں معلوم کہ اس نے کوئی ایسی بات کہی ہو جو بےفائدہ ہو،یا ایسی چیز کے ساتھ بخل سے کام لیا ہو جس کے خرچ کرنے سے اس کا کچھ نقصان نہ ہوتا“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>الأعمش عنعن ولم یسمع من أنس رضي اللّٰہ عنہ`;
tirmizi.anwaar = [251,1];