var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ سُلَيْمَانَ،عَنْ أَبِي حَازِمٍ،عَنْ سَهْلِ بْنِ سَعْدٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كَانَتِ الدُّنْيَا تَعْدِلُ عِنْدَ اللَّهِ جَنَاحَ بَعُوضَةٍ مَا سَقَى كَافِرًا مِنْهَا شَرْبَةَ مَاءٍ،‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اللہ تعالیٰ کے نزدیک دنیا کی وقعت اگر ایک مچھر کے پر کے برابر بھی ہوتی تو وہ کسی کافر کو اس میں سے ایک گھونٹ پانی بھی نہ پلاتا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے صحیح غریب ہے،۲-اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (4110)<br>عبد الحمید بن سلیمان: ضعیف و لہ شاھد ضعیف في مسند الشھاب للقضاعي (1439) فیہ أبو نصر أحمد بن الحسن بن محمد الشاھي و لم أجد من و ثقہ،لا الخطیب و لا غیرہ`;
tirmizi.anwaar = [251,1];