var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا سُفْيَانُ،عَنِ الْأَعْمَشِ،عَنْ شِمْرِ بْنِ عَطِيَّةَ،عَنْ الْمُغِيرَةِ بْنِ سَعْدِ بْنِ الْأَخْرَمِ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَتَّخِذُوا الضَّيْعَةَ فَتَرْغَبُوا فِي الدُّنْيَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جائیداد ۱؎ کو مت بناؤ کہ اس کی وجہ سے تمہیں دنیا کی رغبت ہو جائے گی“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 5178`;