var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ،حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ،حَدَّثَنَا شُعْبَةُ،عَنْ عَلِيِّ بْنِ زَيْدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ،عَنْ أَبِيهِ،أَنَّ رَجُلًا،‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏أَيُّ النَّاسِ خَيْرٌ؟ قَالَ:‏‏‏‏ مَنْ طَالَ عُمُرُهُ وَحَسُنَ عَمَلُهُ قَالَ:‏‏‏‏ فَأَيُّ النَّاسِ شَرٌّ؟ قَالَ:‏‏‏‏ مَنْ طَالَ عُمُرُهُ وَسَاءَ عَمَلُهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ایک شخص نے عرض کیا: اللہ کے رسول! لوگوں میں سب سے بہتر شخص کون ہے؟ آپ نے فرمایا: ”جس کی عمر لمبی ہو اور عمل نیک ہو“،اس آدمی نے پھر پوچھا کہ لوگوں میں سب سے بدتر شخص کون ہے؟ آپ نے فرمایا: ”جس کی عمر لمبی ہو اور عمل برا ہو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>علي بن زید بن جدعان ضعیف <br>والحدیث السابق (الأصل: 2329) یغني عنہ`;
tirmizi.anwaar = [252,1];