var tirmizi = {};
tirmizi.arabic = "حدثنا سويد بن نصر اخبرنا عبد الله بن المبارك عن حماد بن سلمة عن عبيد الله بن ابي بكر بن انس عن انس بن مالك قال:‏‏‏‏ قال رسول الله صلى الله عليه وسلم:‏‏‏‏ هذا ابن آدم وهذا اجله ووضع يده عند قفاه ثم بسطها فقال:‏‏‏‏ وثم امله وثم امله وثم امله قال ابو عيسى:‏‏‏‏ هذا حديث حسن صحيح وفي الباب عن ابي سعيد.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”یہ ابن آدم ہے اور یہ اس کی موت ہے“،اور آپ نے اپنا ہاتھ اپنی گدی پر رکھا پھر اسے دراز کیا اور فرمایا: ”یہ اس کی امید ہے،یہ اس کی امید ہے،یہ اس کی امید ہے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابو سعید خدری رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5277`;