var tirmizi = {};
tirmizi.arabic = "حدثنا احمد بن منيع حدثنا الحسن بن سوار حدثنا ليث بن سعد عن معاوية بن صالح ان عبد الرحمن بن جبير بن نفير حدثه عن ابيه عن كعب بن عياض قال:‏‏‏‏ سمعت النبي صلى الله عليه وسلم يقول:‏‏‏‏ إن لكل امة فتنة وفتنة امتي المال قال ابو عيسى:‏‏‏‏ هذا حديث حسن صحيح غريب إنما نعرفه من حديث معاوية بن صالح.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا: ”ہر امت کی آزمائش کسی نہ کسی چیز میں ہے اور میری امت کی آزمائش مال میں ہے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-اس حدیث کو ہم معاویہ بن صالح کی روایت ہی سے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5194`;