var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنِ ابْنِ عَجْلَانَ،عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ قَلْبُ الشَّيْخِ شَابٌّ عَلَى حُبِّ اثْنَتَيْنِ:‏‏‏‏ طُولُ الْحَيَاةِ وَكَثْرَةُ الْمَالِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”دو چیزوں کی محبت میں بوڑھے کا دل جوان رہتا ہے: لمبی زندگی کی محبت،دوسرے مال کی محبت“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;