var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَهْرَمُ ابْنُ آدَمَ وَيَشِبُّ مِنْهُ اثْنَتَانِ:‏‏‏‏ الْحِرْصُ عَلَى الْعُمُرِ،‏‏‏‏‏‏وَالْحِرْصُ عَلَى الْمَالِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”آدمی بوڑھا ہو جاتا ہے البتہ اس کے اندر دو چیزیں جوان رہتی ہیں ایک (لمبی) زندگی کی خواہش،دوسرے مال کی حرص“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;