var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ،حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ،عَنْ شُرَحْبِيلَ بْنِ شَرِيكٍ،عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ قَدْ أَفْلَحَ مَنْ أَسْلَمَ وَكَانَ رِزْقُهُ كَفَافًا وَقَنَّعَهُ اللَّهُ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”کامیاب ہوا وہ شخص جس نے اسلام قبول کیا اور بقدر «كفاف» اسے روزی حاصل ہوئی اور اللہ نے اسے (اپنے دئیے ہوئے پر) «قانع» بنا دیا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;