var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْبَصْرِيُّ،حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ،عَنِ الْأَعْمَشِ،عَنْ عَطِيَّةَ،عَنْ أَبِي سَعِيدٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فُقَرَاءُ الْمُهَاجِرِينَ يَدْخُلُونَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِخَمْسِ مِائَةِ سَنَةٍ،‏‏‏‏ وفي الباب عن أَبِي هُرَيْرَةَ،‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏‏‏وَجَابِرٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مہاجر فقراء جنت میں مالدار مہاجر سے پانچ سو سال پہلے داخل ہوں گے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے حسن غریب ہے،۲-اس باب میں ابوہریرہ،عبداللہ بن عمرو اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (4123)<br>عطیۃ العوفي ضعیف <br>وسلیمان الأعمش عنعن <br>و حدیث مسلم (2979) و الحدیث الآتي (الأصل: 2354) یغنیان عنہ`;
tirmizi.anwaar = [253,1];