var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا قَبِيصَةُ،حَدَّثَنَا سُفْيَانُ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَدْخُلُ الْفُقَرَاءُ الْجَنَّةَ قَبْلَ الْأَغْنِيَاءِ بِخَمْسِ مِائَةِ عَامٍ نِصْفِ يَوْمٍ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”فقراء جنت میں مالداروں سے پانچ سو برس پہلے داخل ہوں گے اور یہ قیامت کے آدھا دن کے برابر ہو گا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;