var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا الْمُحَارِبِيُّ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَدْخُلُ فُقَرَاءُ الْمُسْلِمِينَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِنِصْفِ يَوْمٍ وَهُوَ خَمْسُ مِائَةِ عَامٍ،‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”فقیر و محتاج مسلمان جنت میں مالداروں سے آدھا دن پہلے داخل ہوں گے اور یہ آدھا دن پانچ سو برس کے برابر ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;