var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ،حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ،عَنْ عَمْرِو بْنِ جَابِرٍ الْحَضْرَمِيِّ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَدْخُلُ فُقَرَاءُ الْمُسْلِمِينَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِأَرْبَعِينَ خَرِيفًا،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے ارشاد فرمایا: ”فقیر و محتاج مسلمان جنت میں مالداروں سے چالیس سال پہلے داخل ہوں گے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عمرو بن جابر: ضعیف شیعي (تقریب: 4996) <br>و حدیث مسلم (2979) یغني عنہ`;
tirmizi.anwaar = [253,1];