var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ،حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ،عَنْ هِلَالِ بْنِ خَبَّابٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَبِيتُ اللَّيَالِي الْمُتَتَابِعَةَ طَاوِيًا وَأَهْلُهُ لَا يَجِدُونَ عَشَاءً وَكَانَ أَكْثَرُ خُبْزِهِمْ خُبْزَ الشَّعِيرِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ اور آپ کے گھر والے مسلسل کئی راتیں خالی پیٹ گزار دیتے،اور رات کا کھانا نہیں پاتے تھے۔اور ان کی اکثر خوراک جو کی روٹی ہوتی تھی۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;