var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ،حَدَّثَنَا وَكِيعٌ،عَنِ الْأَعْمَشِ،عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ،عَنْ أَبِي زُرْعَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اللَّهُمَّ اجْعَلْ رِزْقَ آلِ مُحَمَّدٍ قُوتًا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے یہ دعا کی «اللهم اجعل رزق آل محمد قوتا» ”اے اللہ! محمد ﷺ کے گھر والوں کو صرف اتنی روزی دے جس سے ان کے جسم کا رشتہ برقرار رہ سکے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;