var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدَّخِرُ شَيْئًا لِغَدٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ جَعْفَرِ بْنِ سُلَيْمَانَ،‏‏‏‏‏‏عَنْ ثَابِتٍ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا.";
tirmizi.urdu = "نبی اکرم ﷺ آنے والے کل کے لیے کچھ نہیں رکھ چھوڑتے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-یہ حدیث «عن جعفر بن سليمان عن ثابت عن النبي صلى الله عليه وسلم» کی سند سے مرسلا بھی مروی ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5825`;