var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،أَخْبَرَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو،حَدَّثَنَا عَبْدُ الْوَارِثِ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ مَا أَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى خِوَانٍ،‏‏‏‏‏‏وَلَا أَكَلَ خُبْزًا مُرَقَّقًا حَتَّى مَاتَ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ سَعِيدِ بْنِ أَبِي عَرُوبَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے چوکی (یا میز) پر کھانا کبھی نہیں کھایا اور نہ ہی کبھی باریک آٹے کی روٹی کھائی یہاں تک کہ دنیا سے کوچ کر گئے۔امام ترمذی کہتے ہیں: یہ حدیث سعید بن ابی عروبہ کی روایت سے حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;