var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَخَفِّ النَّاسِ صَلَاةً فِي تَمَامٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَاسْمُ أَبِي عَوَانَةَ وَضَّاحٌ،‏‏‏‏‏‏. قَالَ أَبُو عِيسَى:‏‏‏‏ سَأَلْتُ قُتَيْبَةَ قُلْتُ:‏‏‏‏ أَبُو عَوَانَةَ مَا اسْمُهُ؟ قَالَ وَضَّاحٌ:‏‏‏‏ قُلْتُ ابْنُ مَنْ؟ قَالَ:‏‏‏‏ لَا أَدْرِي كَانَ عَبْدًا لِامْرَأَةٍ بِالْبَصْرَةِ.";
tirmizi.urdu = "رسول اللہ ﷺ لوگوں میں سب سے زیادہ ہلکی اور سب زیادہ مکمل نماز پڑھنے والے تھے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;