var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ،حَدَّثَنَا سَيَّارُ بْنُ حَاتِمٍ،عَنْ سَهْلِ بْنِ أَسْلَمَ،عَنْ يَزِيدَ بْنِ أَبِي مَنْصُورٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنْ أَبِي طَلْحَةَ،قَالَ:‏‏‏‏ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُوعَ وَرَفَعْنَا عَنْ بُطُونِنَا عَنْ حَجَرٍ حَجَرٍ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ حَجَرَيْنِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "ہم نے (جنگ خندق کے دوران) رسول اللہ ﷺ سے بھوک کی شکایت کی اور اپنے پیٹ سے کپڑا اٹھایا جن پر ایک ایک پتھر بندھا ہوا تھا سو آپ نے اپنے مبارک پیٹ سے کپڑا اٹھایا تو اس پر دو پتھر بندھے ہوئے تھے۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،اسے ہم صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5254
سیار بن حاتم: حسن الحدیث، وثقہ الجمھور`;