var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ سِمَاكِ بْنِ حَرْبٍ،قَال:‏‏‏‏ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ،‏‏‏‏ يَقُولُ:‏‏‏‏ أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئْتُمْ؟ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يَجِدُ مِنَ الدَّقَلِ مَا يَمْلَأُ بِهِ بَطْنَهُ،‏‏‏‏ قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "تم لوگ جو چاہتے ہو کھاتے پیتے ہو حالانکہ میں نے نبی اکرم ﷺ کو اس حال میں دیکھا کہ ردی کھجوریں بھی اس مقدار میں آپ کو میسر نہ تھیں جن سے آپ اپنا پیٹ بھرتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;