var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ بُدَيْلِ بْنِ قُرَيْشٍ الْيَامِيُّ الْكُوفِيُّ،حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ أَبِي حَصِينٍ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ،‏‏‏‏‏‏وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو حَصِينٍ اسْمُهُ:‏‏‏‏ عُثْمَانُ بْنُ عَاصِمٍ الْأَسَدِيُّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مالداری ساز و سامان کی کثرت کا نام نہیں ہے،بلکہ اصل مالداری نفس کی مالداری ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;