var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا وَكِيعٌ،عَنْ جَعْفَرِ بْنِ بُرْقَانَ،عَنْ يَزِيدَ بْنِ الْأَصَمِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ يَقُولُ:‏‏‏‏ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اللہ تعالیٰ فرماتا ہے: میں اپنے بندے کے گمان کے مطابق ہوں جیسا وہ گمان مجھ سے رکھے،اور میں اس کے ساتھ ہوں جب بھی وہ مجھے پکارتا ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;