var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بُنْدَارٌ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ،حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ،عَنْ حَبِيبِ بْنِ عُبَيْدٍ،عَنْ الْمِقْدَامِ بْنِ مَعْدِ يكَرِبَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَحَبَّ أَحَدُكُمْ أَخَاهُ فَلْيُعْلِمْهُ إِيَّاهُ،‏‏‏‏ وفي الباب عن أَبِي ذَرٍّ،‏‏‏‏‏‏وَأَنَسٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ الْمِقْدَامِ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏وَالْمِقْدَامُ يُكْنَى:‏‏‏‏ أَبَا كَرِيمَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب تم میں سے کوئی اپنے کسی مسلمان بھائی سے محبت کرے تو وہ اپنی اس محبت سے آگاہ کر دے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-مقدام کی حدیث حسن صحیح غریب ہے،۲-اس باب میں ابوذر اور انس رضی الله عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5016
[ترمذی: 2392 ب] إسنادہ ضعیف، السند مرسل: یزید بن نعامۃ تابعي رحمہ اللہ`;