var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْكُوفِيُّ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،عَنْ سَالِمٍ الْخَيَّاطِ،عَنِ الْحَسَنِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَحْثُوَ فِي أَفْوَاهِ الْمَدَّاحِينَ التُّرَابَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے ہمیں حکم دیا کہ ہم بے جا تعریف کرنے والوں کے منہ میں مٹی ڈال دیں۔امام ترمذی کہتے ہیں: یہ حدیث ابوہریرہ رضی الله عنہ کی روایت سے غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;