var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا ابْنُ الْمُبَارَكِ،ح وحَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ،أَخْبَرَنَا ابْنُ الْمُبَارَكِ،عَنْ يَحْيَى بْنِ أَيُّوبَ،عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ،عَنْ عَلِيِّ بْنِ يَزِيدَ،عَنِ الْقَاسِمِ،عَنْ أَبِي أُمَامَةَ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ مَا النَّجَاةُ؟ قَالَ:‏‏‏‏ أَمْسِكْ عَلَيْكَ لِسَانَكَ وَلْيَسَعْكَ بَيْتُكَ وَابْكِ عَلَى خَطِيئَتِكَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "میں نے عرض کیا: اللہ کے رسول! نجات کی کیا صورت ہے؟ آپ نے فرمایا: ”اپنی زبان کو قابو میں رکھو،اپنے گھر کی وسعت میں مقید رہو اور اپنی خطاؤں پر روتے رہو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>علي بن یزید و عبید اللّٰہ بن زحر: ضعیفان<br>وللحدیث شواہد ضعیفۃ`;
tirmizi.anwaar = [255,1];