var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو زَكَرِيَّا يَحْيَى بْنُ دُرُسْتَ الْبَصْرِيُّ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ حَمَّادٌ:‏‏‏‏ وَهُوَ عِنْدَنَا مَرْفُوعٌ:‏‏‏‏ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ سورة المطففين آية 6،‏‏‏‏ قَالَ:‏‏‏‏ يَقُومُونَ فِي الرَّشْحِ إِلَى أَنْصَافِ آذَانِهِمْ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے اس آیت کریمہ کی تلاوت فرمائی: «يوم يقوم الناس لرب العالمين» ”جس دن لوگ رب العالمین کے سامنے کھڑے ہوں گے“ (المطففین: ۶)،اور کہا: ”اس دن لوگ اللہ کے سامنے اس حال میں کھڑے ہوں گے کہ پسینہ ان کے آدھے کانوں تک ہو گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;