var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِنَّكُمْ مَحْشُورُونَ رِجَالًا وَرُكْبَانًا وَتُجَرُّونَ عَلَى وُجُوهِكُمْ،‏‏‏‏ وفي الباب عن أَبِي هُرَيْرَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا: ”تم لوگ میدان حشر میں پیدل اور سوار لائے جاؤ گے اور اپنے چہروں کے بل گھسیٹے جاؤ گے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب کے میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;