var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏‏‏وفي الباب عن جَابِرٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”میری شفاعت میری امت کے کبیرہ گناہ والوں کے لیے ہو گی“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے حسن صحیح غریب ہے،۲-اس باب میں جابر رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5598`;