var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ الْكُوفِيُّ،قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ،عَنْ جِسْرٍ أَبِي جَعْفَرٍ،عَنْ الْحَسَنِ الْبَصْرِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَشْفَعُ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يَوْمَ الْقِيَامَةِ بِمِثْلِ رَبِيعَةَ،‏‏‏‏ وَمُضَرَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”عثمان بن عفان رضی الله عنہ قیامت کے دن قبیلہ ربیعہ اور مضر کے برابر،لوگوں کے لیے شفاعت کریں گے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>جسر بن فرقد: ضعیف ضعفہ الجمہور من جھۃ حفظہ،انظر لسان المیزان(104/2،105) وغیرہ <br>والخبر مرسل`;
tirmizi.anwaar = [256,2];