var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ،أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى،عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ،عَنْ عَطِيَّةَ،عَنْ أَبِي سَعِيدٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ مِنْ أُمَّتِي مَنْ يَشْفَعُ لِلْفِئَامِ مِنَ النَّاسِ،‏‏‏‏‏‏وَمِنْهُمْ مَنْ يَشْفَعُ لِلْقَبِيلَةِ،‏‏‏‏‏‏وَمِنْهُمْ مَنْ يَشْفَعُ لِلْعَصْبَةِ،‏‏‏‏‏‏وَمِنْهُمْ مَنْ يَشْفَعُ لِلرَّجُلِ،‏‏‏‏‏‏حَتَّى يَدْخُلُوا الْجَنَّةَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”میری امت کا کوئی شخص کئی جماعت کے لیے شفاعت کرے گا،کوئی ایک قبیلہ کے لیے شفاعت کرے گا،کوئی ایک گروہ کے لیے شفاعت کرے گا،اور کوئی ایک آدمی کے لیے شفاعت کرے گا،یہاں تک کہ سب جنت میں داخل ہوں جائیں گے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عطیۃ العوفي: ضعیف`;
tirmizi.anwaar = [257,1];