var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَهْرَمُ ابْنُ آدَمَ وَيَشِبُّ مِنْهُ اثْنَانِ الْحِرْصُ عَلَى الْمَالِ،‏‏‏‏‏‏وَالْحِرْصُ عَلَى الْعُمُرِ،‏‏‏‏‏‏هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”آدمی بوڑھا ہو جاتا ہے لیکن اس کی دو خواہشیں جوان رہتی ہیں: ایک مال کی ہوس دوسری لمبی عمر کی تمنا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;