var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو صَفْوَانَ،عَنْ يُونُسَ،عَنِ الزُّهْرِيِّ،عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ:‏‏‏‏ ابْتُلِينَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالضَّرَّاءِ فَصَبَرْنَا،‏‏‏‏‏‏ثُمَّ ابْتُلِينَا بِالسَّرَّاءِ بَعْدَهُ فَلَمْ نَصْبِرْ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "ہم رسول اللہ ﷺ کے ساتھ تکلیف اور تنگی میں آزمائے گئے تو اس پر ہم نے صبر کیا،پھر آپ کے بعد کی حالت میں کشادگی اور خوشی میں آزمائے گئے تو ہم صبر نہ کر سکے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>الزھري مدلس وعنعن <br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [258,1];