var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا عَبْدَةُ،‏‏‏‏ عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَتْ وِسَادَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّتِي يَضْطَجِعُ عَلَيْهَا مِنْ أَدَمٍ حَشْوُهَا لِيفٌ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ کے پاس چمڑے کا ایک تکیہ (بستر) تھا جس پر آپ آرام فرماتے تھے اس میں کھجور کی پتلی چھال بھری ہوئی تھی ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;