var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا هَارُونُ بْنُ إِسْحَاق الْهَمْدَانِيُّ،حَدَّثَنَا عَبْدَةُ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ إِنْ كُنَّا آَلَ مُحَمَّدٍ نَمْكُثُ شَهْرًا مَا نَسْتَوْقِدُ بِنَارٍ إِنْ هُوَ إِلَّا الْمَاءُ وَالتَّمْرُ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "ہم آل محمد ( ﷺ ) ایسے تھے کہ ایک ایک مہینہ چولہا نہیں جلاتے تھے،ہمارا گزر بسر صرف کھجور اور پانی پر ہوتا تھا۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;