var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ عَبَّاسٍ الْجُرَيْرِيِّ،قَال:‏‏‏‏ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ يُحَدِّثُ،‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ،أَنَّهُ أَصَابَهُمْ جُوعٌ فَأَعْطَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمْرَةً تَمْرَةً،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "صحابہ کو ایک مرتبہ بھوک لگی تو رسول اللہ ﷺ نے ان سب کو صرف ایک ایک کھجور دی۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5255`;