var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا الْجَارُودُ بْنُ مُعَاذٍ،حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى،عَنْ سُفْيَانَ الثَّوْرِيِّ،عَنْ أَبِي حَمْزَةَ،عَنْ إِبْرَاهِيمَ النَّخَعِيِّ،قَالَ:‏‏‏‏ الْبِنَاءُ كُلُّهُ وَبَالٌ،‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أَرَأَيْتَ مَا لَا بُدَّ مِنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا أَجْرَ وَلَا وِزْرَ .";
tirmizi.urdu = "ابراہیم نخعی کہتے ہیں: گھر مکان سب کا سب ہر عمارت باعث وبال ہے،میں نے کہا: اس مکان کے بارے میں آپ کا کیا خیال ہے،جسے بنائے بغیر چارہ نہیں انہوں نے کہا: نہ اس میں کوئی اجر ہے اور نہ کوئی گناہ۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>أبو حمزۃ میمون الأعور القصاب: ضعیف`;
tirmizi.anwaar = [259,1];