var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ،حَدَّثَنَا زَافِرُ بْنُ سُلَيْمَانَ،عَنْ إِسْرَائِيلَ،عَنْ شَبِيبِ بْنِ بَشِيرٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ النَّفَقَةُ كُلُّهَا فِي سَبِيلِ اللَّهِ إِلَّا الْبِنَاءَ فَلَا خَيْرَ فِيهِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏هَكَذَا قَالَ مُحَمَّدُ بْنُ حَمَيْدٍ،‏‏‏‏‏‏شَبِيبُ بْنُ بَشِيرٍ وَإِنَّمَا هُوَ شَبِيبُ بْنُ بِشْرٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”نفقہ سب کا سب اللہ کی راہ میں ہے سوائے اس نفقہ کے جو گھر بنانے میں صرف ہوتا ہے کیونکہ اس میں کوئی خیر نہیں ہے“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>زافر: ضعیف یعتبر بہ،کما فی التحریر (1979)`;
tirmizi.anwaar = [259,1];