var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ الْمَدَنِيُّ الْغِفَارِيُّ،حَدَّثَنِي أَبِي،‏‏‏‏ عَنْ سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الطَّاعِمُ الشَّاكِرُ بِمَنْزِلَةِ الصَّائِمِ الصَّابِرِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”کھانا کھا کر اللہ کا شکر ادا کرنے والا (اجر و ثواب میں) صبر کرنے والے روزہ دار کے برابر ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 4205`;