var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ شُعْبَةَ،عَنْ الْحَكَمِ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ بْنِ يَزِيدَ،‏‏‏‏ قَالَ:‏‏‏‏ قُلْتُ عَائِشَةَ:‏‏‏‏ أَيُّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ إِذَا دَخَلَ بَيْتَهُ؟ قَالَتْ:‏‏‏‏ كَانَ يَكُونَ فِي مَهْنَةِ أَهْلِهِ فَإِذَا حَضَرَتِ الصَّلَاةُ قَامَ فَصَلَّى،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے عائشہ رضی الله عنہا سے پوچھا کیا: رسول اللہ ﷺ جب اپنے گھر میں داخل ہوتے تھے تو کیا کرتے تھے؟ کہا: آپ ﷺ اپنے گھر والوں کے کام کاج میں مشغول ہو جاتے تھے،پھر جب نماز کا وقت ہو جاتا تو کھڑے ہوتے اور نماز پڑھنے لگتے تھے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;