var tirmizi = {};
tirmizi.arabic = "قَالَ أَبُو عِيسَى:‏‏‏‏ حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَبَانَ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،حَدَّثَنَا الْعَلَاءُ بْنُ صَالِحٍ الْأَسَدِيُّ،عَنْ سَلَمَةَ بْنِ كُهَيْلٍ،عَنْ حُجْرِ بْنِ،عَنْ وَائِلِ بْنِ حُجْرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏نَحْوَ حَدِيثِ سُفْيَانَ،‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ كُهَيْلٍ.";
tirmizi.urdu = "وائل حجر رضی الله عنہ سے سفیان کی (پچھلی) روایت جیسی روایت ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;