var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَلِيِّ بْنِ الْأَقْمَرِ،عَنْ أَبِي حُذَيْفَةَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا أُحِبُّ أَنِّي حَكَيْتُ أَحَدًا وَأَنَّ لِي كَذَا وَكَذَا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو حُذَيْفَةَ هُوَ كُوفِيٌّ مِنْ أَصْحَابِ ابْنِ مَسْعُودٍ وَيُقَالُ اسْمُهُ:‏‏‏‏ سَلَمَةُ بْنُ صُهَيْبَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”میں یہ نہیں پسند کرتا کہ میں کسی انسان کی نقل کروں اور مجھے اتنا اور اتنا مال ملے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4857`;