var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ،حَدَّثَنَا أَبُو أُسَامَةَ،حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللَّهِ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،قَالَ:‏‏‏‏ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْمُسْلِمِينَ أَفْضَلُ؟ قَالَ:‏‏‏‏ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ،‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبِي مُوسَى.";
tirmizi.urdu = "رسول اللہ ﷺ سے پوچھا کیا گیا کہ مسلمانوں میں سب سے زیادہ افضل کون ہے؟ آپ نے فرمایا: ”جس کی زبان اور ہاتھ سے دوسرے مسلمان محفوظ ہوں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث ابوموسیٰ کی روایت سے اس سند سے صحیح غریب ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;