var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،وَوَكِيعٌ،‏‏‏‏ عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ انْظُرُوا إِلَى مَنْ هُوَ أَسْفَلَ مِنْكُمْ،‏‏‏‏‏‏وَلَا تَنْظُرُوا إِلَى مَنْ هُوَ فَوْقَكُمْ،‏‏‏‏‏‏فَإِنَّهُ أَجْدَرُ أَنْ لَا تَزْدَرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ،‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ان لوگوں کی طرف دیکھو جو دنیاوی اعتبار سے تم سے کم تر ہوں اور ان لوگوں کی طرف نہ دیکھو جو تم سے اوپر ہوں،اس طرح زیادہ لائق ہے کہ تم اللہ کی ان نعمتوں کی ناقدری نہ کرو،جو اس کی طرف سے تم پر ہوئی ہیں“۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;