var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،عَنْ شُعْبَةَ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”کوئی شخص مومن کامل نہیں ہو سکتا یہاں تک کہ وہ اپنے بھائی کے لیے وہی پسند کرے جو اپنی ذات کے لیے پسند کرتا ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;