var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا اللَّيْثُ،عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍ،‏‏‏‏ وفي الباب عن أَنَسٍ وَأَبِي سَعِيدٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جنت میں ایسے درخت ہیں کہ سوار ان کے سایہ میں سو برس تک چلتا رہے (پھر بھی اس کا سایہ ختم نہ ہو گا“)۔امام ترمذی کہتے ہیں: ۱-یہ حدیث صحیح ہے،۲-اس باب میں انس اور ابو سعید خدری رضی الله عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;