var tirmizi = {};
tirmizi.arabic = "حدثنا علي بن حجر حدثنا علي بن مسهر عن عبد الرحمن بن إسحاق عن النعمان بن سعد عن علي قال:‏‏‏‏ قال رسول الله صلى الله عليه وسلم:‏‏‏‏ إن في الجنة لغرفا يرى ظهورها من بطونها وبطونها من ظهورها فقام إليه اعرابي فقال:‏‏‏‏ لمن هي يا رسول الله؟ قال:‏‏‏‏ هي لمن اطاب الكلام واطعم الطعام وادام الصيام وصلى لله بالليل والناس نيام،قال ابو عيسى:‏‏‏‏ هذا حديث غريب وقد تكلم بعض اهل العلم في عبد الرحمن بن إسحاق هذا من قبل حفظه وهو كوفي وعبد الرحمن بن إسحاق القرشي مدني وهو اثبت من هذا.";
tirmizi.urdu = "علی رضی الله عنہ کہتے ہیں کہ";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>انظر الحدیث السابق (1984)`;
tirmizi.anwaar = [261,1];