var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا شَرِيكٌ،عَنْ مُحَمَّدِ بْنِ جُحَادَةَ،عَنْ عَطَاءٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ مِائَةُ عَامٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جنت میں سو درجے ہیں،ہر ایک درجہ سے دوسرے درجہ کے درمیان سو سال کا فاصلہ ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5632`;