var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا هَمَّامٌ،حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ عُبَادَةَ بْنِ الصَّامِتِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ الْأَرْضِ وَالسَّمَاءِ،‏‏‏‏‏‏وَالْفِرْدَوْسُ أَعْلَاهَا دَرَجَةً وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ الْأَرْبَعَةُ،‏‏‏‏‏‏وَمِنْ فَوْقِهَا يَكُونُ الْعَرْشُ،‏‏‏‏‏‏فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جنت میں سو درجے ہیں اور ہر دو درجہ کے درمیان اتنا ہی فاصلہ ہے جتنا آسمان اور زمین کے درمیان ہے،درجہ کے اعتبار سے فردوس اعلیٰ جنت ہے،اسی سے جنت کی چاروں نہریں بہتی ہیں اور اسی کے اوپر عرش ہے،لہٰذا جب تم اللہ سے جنت مانگو تو فردوس مانگو“۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5617
وانظر مشکوۃ المصابیح (47)`;