var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ دَرَّاجٍ أَبِي السَّمْعِ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ لَوْ أَنَّ الْعَالَمِينَ اجْتَمَعُوا فِي إِحْدَاهُنَّ لَوَسِعَتْهُمْ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جنت میں سو درجے ہیں،اگر سارے جہاں کے لوگ ایک ہی درجہ میں اکٹھے ہو جائیں تو یہ ان سب کے لیے کافی ہو گا“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن لھیعۃ مدلس و عنعن و حدث بہ قبل اختلاطہ ولم تثبت متابعۃ عمرو بن الحارث لہ و باقي السند حسن لذاتہ`;
tirmizi.anwaar = [261,1];