var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ،عَنْ عَطَاءِ بْنِ السَّائِبِ،عَنْ عَمْرِو بْنِ مَيْمُونٍ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ.";
tirmizi.urdu = "عبداللہ بن مسعود رضی الله عنہ سے اسی جیسی حدیث مروی ہے،اور اسے (ابوالاحوص نے) مرفوع نہیں کیا،یہ عبیدہ بن حمید کی روایت سے زیادہ صحیح ہے۔اسی طرح جریر اور کئی لوگوں نے عطاء بن سائب سے اسے غیر مرفوع روایت کی ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `۔2534] إسنادہ ضعیف <br>عطاء بن السائب اختلط،ولم یحدث بہ قبل اختلاطہ`;
tirmizi.anwaar = [261,1];