var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَأَبُو هِشَامٍ الرِّفَاعِيُّ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ،عَنْ أَبِيهِ،عَنْ عَامِرٍ الْأَحْوَلِ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَهْلُ الْجَنَّةِ جُرْدٌ مُرْدٌ كُحْلٌ لَا يَفْنَى شَبَابُهُمْ وَلَا تَبْلَى ثِيَابُهُمْ،قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جنتی بغیر بال کے،امرد اور سرمگیں آنکھوں والے ہوں گے،نہ ان کی جوانی ختم ہو گی اور نہ ان کے کپڑے بوسیدہ ہوں گے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5638`;