var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،وَهَنَّادٌ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاق،عَنْ النُّعْمَانِ بْنِ سَعْدٍ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ فِي الْجَنَّةِ لَسُوقًا مَا فِيهَا شِرَاءٌ وَلَا بَيْعٌ إِلَّا الصُّوَرَ مِنَ الرِّجَالِ وَالنِّسَاءِ فَإِذَا اشْتَهَى الرَّجُلُ صُورَةً دَخَلَ فِيهَا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جنت میں ایک ایسا بازار ہے جس میں خرید و فروخت نہیں ہو گی،البتہ اس میں مرد اور عورتوں کی صورتیں ہیں،جب آدمی کسی صورت کو پسند کرے گا تو وہ اس میں داخل ہو جائے گا“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>عبد الرحمن بن إسحاق الکوفي: ضعیف <br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [262,1];