var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدٌ،أَخْبَرَنَا عَبْدُ اللَّهِ،أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ،حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ،عَنْ دَرَّاجٍ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَدْنَى أَهْلِ الْجَنَّةِ الَّذِي لَهُ ثَمَانُونَ أَلْفَ خَادِمٍ،‏‏‏‏‏‏وَاثْنَتَانِ وَسَبْعُونَ زَوْجَةً،‏‏‏‏‏‏وَتُنْصَبُ لَهُ قُبَّةٌ مِنْ لُؤْلُؤٍ وَزَبَرْجَدٍ وَيَاقُوتٍ كَمَا بَيْنَ الْجَابِيَةِ إِلَى صَنْعَاءَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”کم درجے کا جتنی وہ ہے جس کے لیے اسی ہزار خادم اور بہتر بیویاں ہوں گی۔اس کے لیے موتی،زمرد اور یاقوت کا خیمہ نصب کیا جائے گا جو مقام جابیہ سے صنعاء (یمن) تک کے برابر ہو گا“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 5648
قلت: ورواہ عبد اللہ بن وھب: أخبرني عمرو بن الحارث بہ (ابن حبان، الإحسان: 7358 / 7401) وسندہ حسن`;