var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ،عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ جَدِّهِ حَفْصِ بْنِ عَاصِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُوشِكُ الْفُرَاتُ يَحْسِرُ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”قریب ہے کہ دریائے فرات سونے کا خزانہ اگلے،لہٰذا (اس وقت) جو موجود ہو وہ اس میں سے کچھ بھی نہ لے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;