var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ،عَنْ أَبِي الزِّنَادِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ،‏‏‏‏‏‏إِلَّا أَنَّهُ قَالَ:‏‏‏‏ يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ سے اسی جیسی حدیث روایت کی ہے،مگر اس میں یہ فرق ہے کہ آپ نے فرمایا: ”سونے کا پہاڑ اگلے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;