var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى،عَنِ ابْنِ لَهِيعَةَ،عَنْ دَرَّاجٍ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الصَّعُودُ جَبَلٌ مِنْ نَارٍ يَتَصَعَّدُ فِيهِ الْكَافِرُ سَبْعِينَ خَرِيفًا وَيَهْوِي فِيهِ كَذَلِكَ مِنْهُ أَبَدًا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ’’«صعود» جہنم کا ایک پہاڑ ہے،اس پر کافر ستر سال میں چڑھے گا اور اتنے ہی سال میں نیچے گرے گا اور یہ عذاب اسے ہمیشہ ہوتا رہے گا“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف ابن لہیعہ کی روایت سے مرفوع جانتے ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 5677`;