var tirmizi = {};
tirmizi.arabic = "حدیث نمبر: 2584 حَدَّثَنَا سُوَيْدٌ بْنَ نَصْرٍ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ،حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ،عَنْ دَرَّاجٍ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ كَالْمُهْلِ سورة الكهف آية 29:‏‏‏‏ كَعَكَرِ الزَّيْتِ فَإِذَا قُرِّبَ إِلَيْهِ سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ’’«كالمهل» یعنی تلچھٹ کی طرح ہو گا جب اسے (جہنمی) اپنے قریب کرے گا تو اس کے چہرے کی کھال اس میں گر جائے گی“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 5678
وانظر مشکوۃ المصابیح (5681، 5682)`;