var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ،حَدَّثَنَا أَبُو دَاوُدَ،عَنْ مُبَارَكِ بْنِ فَضَالَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ،عَنْ أَنَسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَقُولُ اللَّهُ:‏‏‏‏ أَخْرِجُوا مِنَ النَّارِ مَنْ ذَكَرَنِي يَوْمًا أَوْ خَافَنِي فِي مَقَامٍ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اللہ تعالیٰ کہے گا: اسے جہنم سے نکال لو جس نے ایک دن بھی مجھے یاد کیا یا ایک مقام پر بھی مجھ سے ڈرا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 5349`;