var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ،حَدَّثَنَا أَيُّوبُ،عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ،قَال:‏‏‏‏ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ،‏‏‏‏‏‏وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”میں نے جنت میں جھانکا تو دیکھا کہ اکثر جنتی فقیر ہیں اور جہنم میں جھانکا تو دیکھا کہ اکثر جہنمی عورتیں ہیں“۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;