var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا جَرِيرٌ،‏‏‏‏ وَأَبُو مُعَاوِيَةَ،‏‏‏‏ عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ بَيْنَ الْكُفْرِ وَالْإِيمَانِ تَرْكُ الصَّلَاةِ،‏‏‏‏ حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ،عَنِ الْأَعْمَشِ،بِهَذَا الْإِسْنَادِ نَحْوَهُ،‏‏‏‏ وَقَالَ:‏‏‏‏ بَيْنَ الْعَبْدِ وَبَيْنَ الشِّرْكِ أَوِ الْكُفْرِ تَرْكُ الصَّلَاةِ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”کفر اور ایمان کے درمیان فرق کرنے والی چیز نماز کا ترک کرنا ہے“ ۱؎۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;