var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ،عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ،نَحْوَهُ. وَقَالَ: بَيْنَ الْعَبْدِ وَبَيْنَ الشِّرْكِ أَوِ الْكُفْرِ تَرْكُ الصَّلاَةِ . قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،وَأَبُو سُفْيَانَ اسْمُهُ طَلْحَةُ بْنُ نَافِعٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”بندے اور شرک یا بندے اور کفر کے درمیان فرق کرنے والی چیز نماز کا چھوڑ دینا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;