var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ بَيْنَ الْعَبْدِ وَبَيْنَ الْكُفْرِ تَرْكُ الصَّلَاةِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو الزُّبَيْرِ اسْمُهُ:‏‏‏‏ مُحَمَّدُ بْنُ مُسْلِمِ بْنِ تَدْرُسَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”بندے اور کفر کے درمیان فرق کرنے والی چیز نماز کا چھوڑ دینا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;