var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ ابْنِ الْهَادِ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ،عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ،عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ،أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ ذَاقَ طَعْمَ الْإِيمَانِ مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "انہوں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا: ”جو شخص اللہ کے رب ہونے اسلام کے دین ہونے اور محمد ﷺ کے نبی ہونے پر راضی (اور خوش) ہوا اس نے ایمان کا مزہ پا لیا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;