var tirmizi = {};
tirmizi.arabic = "قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ شُعْبَةَ نَحْوَهُ،‏‏‏‏‏‏وَقَدْ رُوِيَ،‏‏‏‏‏‏عَنْ حُذَيْفَةَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ أَنَّهُ صَلَّى بِاللَّيْلِ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَذَكَرَ الْحَدِيثَ.";
tirmizi.urdu = "شعبہ سے اسی طرح مروی ہے۔حذیفہ رضی الله عنہ سے یہ حدیث دوسری سندوں سے بھی مروی ہے کہ انہوں نے نبی اکرم ﷺ کے ساتھ نماز تہجد پڑھی،پھر راوی نے پوری حدیث ذکر کی۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;