var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ،عَنْ أَبِي سُهَيْلِ بْنِ مَالِكٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو سُهَيْلٍ هُوَ عَمُّ مَالِكِ بْنِ أَنَسٍ وَاسْمُهُ:‏‏‏‏ نَافِعُ بْنُ مَالِكِ بْنِ أَبِي عَامِرٍ الْأَصْبَحِيُّ الْخَوْلَانِيُّ.";
tirmizi.urdu = "ابوہریرہ رضی الله عنہ سے اسی جیسی حدیث مروی ہے۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;