var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،عَنْ مَالِكٍ بْنِ أَنَسِ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أَيُّمَا رَجُلٍ قَالَ لِأَخِيهِ كَافِرٌ فَقَدْ بَاءَ بِهِ أَحَدُهُمَا،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏وَمَعْنَى قَوْلِهِ بَاءَ يَعْنِي:‏‏‏‏ أَقَرَّ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اگر کسی نے اپنے مسلمان بھائی کو کافر کہا تو ان دونوں میں سے ایک نے (گویا کہ) اپنے کافر ہونے کا اقرار کر لیا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-«باء»،‏‏‏‏ «أقر» کے معنی میں ہے،یعنی اقرار کیا۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;