var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ،حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،حَدَّثَنَا عَاصِمٌ،عَنْ زِرٍّ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے جان بوجھ کر میری طرف جھوٹ کی نسبت کی تو وہ جہنم میں اپنا ٹھکانا بنا لے“ ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;