var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اتْرُكُونِي مَا تَرَكْتُكُمْ فَإِذَا حَدَّثْتُكُمْ فَخُذُوا عَنِّي فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِكَثْرَةِ سُؤَالِهِمْ وَاخْتِلَافِهِمْ عَلَى أَنْبِيَائِهِمْ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب تک میں تمہیں چھوڑے رکھوں تم مجھے چھوڑے رکھو،پھر جب میں تم سے کوئی چیز بیان کروں تو اسے لے لو،کیونکہ تم سے پہلے لوگ بہت زیادہ سوالات کرنے اور اپنے انبیاء سے کثرت سے اختلافات کرنے کی وجہ سے ہلاک ہو گئے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;