var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ الشَّيْبَانِيُّ الْبَصْرِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،عَنْ عَمْرِو بْنِ الْحَارِثِ،عَنْ دَرَّاجٍ،عَنْ أَبِي الْهَيْثَمِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَنْ يَشْبَعَ الْمُؤْمِنُ مِنْ خَيْرٍ يَسْمَعُهُ حَتَّى يَكُونَ مُنْتَهَاهُ الْجَنَّةُ،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مومن بھلائی سے ہرگز آسودہ نہیں ہوتا یہاں تک کہ وہ اپنے آخری انجام جنت میں پہنچ جاتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 222
دراج أبو السمح: حسن الحدیث عن أبی الھیثم وعن غیرہ`;