var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ الْأَنْصَارِيُّ مُسْلِمُ بْنُ حَاتِمٍ،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ،عَنْ أَبِيهِ،عَنْ عَلِيِّ بْنِ زَيْدٍ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا بُنَيَّ إِذَا دَخَلْتَ عَلَى أَهْلِكَ فَسَلِّمْ يَكُونُ بَرَكَةً عَلَيْكَ وَعَلَى أَهْلِ بَيْتِكَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے مجھ سے فرمایا: ”بیٹے! جب تم اپنے گھر والوں کے پاس جاؤ تو انہیں سلام کیا کرو،یہ سلام تمہارے لیے اور تمہارے گھر والوں کے لیے خیر و برکت کا باعث ہو گا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>تقدم طرفہ (2678)`;
tirmizi.anwaar = [266,1];