var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ بَغْدَادِيٌّ،‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ زَكَرِيَّا،عَنْ عَنْبَسَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ مُحَمَّدِ بْنِ زَاذَانَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ السَّلَامُ قَبْلَ الْكَلَامِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”بات چیت شروع کرنے سے پہلے سلام کیا کرو“";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا<br>عنبسۃ متروک ومحمد بن زاذان: متروک (تقریب: 5882)`;
tirmizi.anwaar = [266,1];