var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تَبْدَءُوا الْيَهُودَ،‏‏‏‏ وَالنَّصَارَى بِالسَّلَامِ،‏‏‏‏‏‏وَإِذَا لَقِيتُمْ أَحَدَهُمْ فِي الطَّرِيقِ فَاضْطَرُّوهُمْ إِلَى أَضْيَقِهِ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”یہود و نصاریٰ کو سلام کرنے میں پہل نہ کرو،اور جب تمہاری ان کے کسی فرد سے راستے میں ملاقات ہو جائے تو اسے تنگ راستے سے ہی جانے پر مجبور کرو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;