var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنْ عُرْوَةَ،أَنَّ أُسَامَةَ بْنَ زَيْدٍ أَخْبَرَهُ:‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِمَجْلِسٍ وَفِيهِ أَخْلَاطٌ مِنَ الْمُسْلِمِينَ وَالْيَهُودِ فَسَلَّمَ عَلَيْهِمْ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ ایک ایسی مجلس کے پاس سے گزرے جس میں مسلمان اور یہود دونوں تھے تو آپ نے انہیں سلام کیا ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;