var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ،أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،أَنْبَأَنَا مَعْمَرٌ،عَنْ هَمَّامِ بْنِ مُنَبِّهٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يُسَلِّمُ الصَّغِيرُ عَلَى الْكَبِيرِ،‏‏‏‏‏‏وَالْمَارُّ عَلَى الْقَاعِدِ،‏‏‏‏‏‏وَالْقَلِيلُ عَلَى الْكَثِيرِ،‏‏‏‏ قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”چھوٹا بڑے کو،چلنے والا بیٹھے ہوئے کو اور تھوڑے لوگ زیادہ لوگوں کو سلام کریں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;