var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ فِي بَيْتِهِ فَاطَّلَعَ عَلَيْهِ رَجُلٌ فَأَهْوَى إِلَيْهِ بِمِشْقَصٍ فَتَأَخَّرَ الرَّجُلُ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ اپنے گھر میں تھے (اسی دوران) ایک شخص نے آپ کے گھر میں جھانکا،آپ ﷺ تیر کا پھل لے کر لپکے (کہ اس کی آنکھیں پھوڑ دیں) لیکن وہ فوراً پیچھے ہٹ گیا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;