var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ،أَخْبَرَنَا ابْنُ الْمُبَارَكِ،أَنْبَأَنَا شُعْبَةُ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ اسْتَأْذَنْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دَيْنٍ كَانَ عَلَى أَبِي،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ هَذَا؟ فَقُلْتُ:‏‏‏‏ أَنَا،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَنَا أَنَا كَأَنَّهُ كَرِهَ ذَلِكَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے نبی اکرم ﷺ سے ایک قرض کے سلسلے میں جو میرے والد کے ذمہ تھا کچھ بات کرنے کے لیے آپ کے پاس حاضر ہونے کی اجازت مانگی تو آپ نے کہا: ”کون ہے؟“۔میں نے کہا: میں ہوں،آپ نے فرمایا: ”میں میں (کیا ہے؟)‘‘ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;