var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَنَصْرُ بْنُ عَلِيٍّ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو أَحْمَدَ،عَنْ سُفْيَانَ،عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ أَنَّ رَجُلًا سَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَلَمْ يَرُدَّ عَلَيْهِ،‏‏‏‏‏‏يَعْنِي:‏‏‏‏ السَّلَامَ .";
tirmizi.urdu = "ایک شخص نے نبی اکرم ﷺ کو اس وقت سلام کیا جب آپ پیشاب کر رہے تھے،تو آپ نے اس کے سلام کا جواب نہیں دیا۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;