var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى،حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ إِذَا سَلَّمَ سَلَّمَ ثَلَاثًا وَإِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلَاثًا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ جب سلام کرتے تو تین بار سلام کرتے اور جب کوئی بات کہتے تو اسے تین بار دھراتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔فائدہ ۱؎: تاکہ بات اچھی طرح سمجھ میں آ جائے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;