var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا سُوَيْدٌ،أَخْبَرَنَا عَبْدُ اللَّهِ،أَخْبَرَنَا هَمَّامٌ،عَنْ قَتَادَةَ،قَالَ:‏‏‏‏ قُلْتُ لِأَنَسِ بْنِ مَالِكٍ:‏‏‏‏ هَلْ كَانَتِ الْمُصَافَحَةُ فِي أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ:‏‏‏‏ نَعَمْ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے انس بن مالک رضی الله عنہ سے پوچھا: کیا رسول اللہ ﷺ کے صحابہ میں مصافحہ کا رواج تھا؟ انہوں نے کہا: ہاں۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;