var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ طَاوُسٍ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ أُمِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ وَلَا يَكُفَّ شَعْرَهُ وَلَا ثِيَابَهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ کو حکم دیا گیا کہ آپ سات اعضاء پر سجدہ کریں اور اپنے بال اور کپڑے نہ سمیٹیں۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;