var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ،أَخْبَرَنَا شُعْبَةُ،أَخْبَرَنِي ابْنُ أَبِي لَيْلَى،عَنْ أَخِيهِ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى،عَنْ أَبِي أَيُّوبَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ،‏‏‏‏‏‏وَلْيَقُلِ الَّذِي يَرُدُّ عَلَيْهِ يَرْحَمُكَ اللَّهُ،‏‏‏‏‏‏وَلْيَقُلْ هُوَ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ،‏‏‏‏";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب کسی کو چھینک آئے تو «الحمد لله على كل حال» (تمام تعریفیں ہر حال میں اللہ کے لیے ہیں) کہے۔اور جو اس کا جواب دے وہ «يرحمك الله» کہے،اور اس کے جواب میں چھینکنے والا کہے «يهديكم الله ويصلح بالكم» (اللہ تمہیں ہدایت دے اور تمہاری حالت درست فرما دے)۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (3715)<br>محمد ابن أبي لیلی ضعیف <br>وحدیث البخاري (6224) یغني عنہ`;
tirmizi.anwaar = [268,1];