var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ،حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ السَّلُولِيُّ الْكُوفِيُّ،عَنْ عَبْدِ السَّلَامِ بْنِ حَرْبٍ،عَنْ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ أَبِي خَالِدٍ الدَّالانِيِّ،عَنْ عُمَرَ بْنِ إِسْحَاق بْنِ أَبِي طَلْحَةَ،عَنْ أُمِّهِ،عَنْ أَبِيهَا،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُشَمَّتُ الْعَاطِسُ ثَلَاثًا،‏‏‏‏‏‏فَإِنْ زَادَ فَإِنْ شِئْتَ فَشَمِّتْهُ وَإِنْ شِئْتَ فَلَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ وَإِسْنَادُهُ مَجْهُولٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”چھینکنے والے کی چھینک کا جواب تین بار دیا جائے گا،اور اگر تین بار سے زیادہ چھینکیں آئیں تو تمہیں اختیار ہے جی چاہے تو جواب دو اور جی چاہے تو نہ دو“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے اور اس کی سند مجہول ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (5036)`;
tirmizi.anwaar = [268,1];