var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ مُحَمَّدِ بْنِ عَجْلَانَ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا عَطَسَ غَطَّى وَجْهَهُ بِيَدِهِ أَوْ بِثَوْبِهِ وَغَضَّ بِهَا صَوْتَهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ کو جب چھینک آتی تھی تو اپنے ہاتھ سے یا اپنے کپڑے سے منہ ڈھانپ لیتے،اور اپنی آواز کو دھیمی کرتے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 4738`;