var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،أَخْبَرَنَا عَفَّانُ،أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ لَمْ يَكُنْ شَخْصٌ أَحَبَّ إِلَيْهِمْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَكَانُوا إِذَا رَأَوْهُ لَمْ يَقُومُوا لِمَا يَعْلَمُونَ مِنْ كَرَاهِيَتِهِ لِذَلِكَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "کوئی شخص انہیں یعنی (صحابہ) کو رسول اللہ سے زیادہ محبوب نہ تھا کہتے ہیں: (لیکن) وہ لوگ آپ کو دیکھ کر (ادباً) کھڑے نہ ہوتے تھے۔اس لیے کہ وہ لوگ جانتے تھے کہ آپ ﷺ اسے ناپسند کرتے ہیں۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4698`;