var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحَلْوَانِيُّ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنِ الزُّهْرِيِّ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَمْسٌ مِنَ الْفِطْرَةِ:‏‏‏‏ الِاسْتِحْدَادُ،‏‏‏‏‏‏وَالْخِتَانُ،‏‏‏‏‏‏وَقَصُّ الشَّارِبِ،‏‏‏‏‏‏وَنَتْفُ الْإِبْطِ،‏‏‏‏‏‏وَتَقْلِيمُ الْأَظْفَارِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”پانچ چیزیں فطرت سے ہیں ۱؎،(۱) شرمگاہ کے بال مونڈنا،(۲) ختنہ کرنا،(۳) مونچھیں کترنا،(۴) بغل کے بال اکھیڑنا،(۵) ناخن تراشنا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;