var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ،حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى أَبُو مُحَمَّدٍ صَاحِبُ الدَّقِيقِ،حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّهُ وَقَّتَ لَهُمْ فِي كُلِّ أَرْبَعِينَ لَيْلَةً تَقْلِيمَ الْأَظْفَارِ وَأَخْذَ الشَّارِبِ وَحَلْقَ الْعَانَةِ .";
tirmizi.urdu = "نبی اکرم ﷺ نے لوگوں کے لیے مدت متعین فرما دی ہے کہ ہر چالیس دن کے اندر ناخن کاٹ لیں۔مونچھیں کتروا لیں۔اور ناف سے نیچے کے بال مونڈ لیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف/ د <br>سنن أبي داود (4200)`;
tirmizi.anwaar = [268,1];