var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ،أَخْبَرَنَا شُعْبَةُ،عَنْ قَتَادَةَ،قَال:‏‏‏‏ سَمِعْتُ أَنَسًا،يَقُولُ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ اعْتَدِلُوا فِي السُّجُودِ وَلَا يَبْسُطَنَّ أَحَدُكُمْ ذِرَاعَيْهِ فِي الصَّلَاةِ بَسْطَ الْكَلْبِ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”سجدے میں اپنی ہیئت درمیانی رکھو،تم میں سے کوئی نماز میں اپنے دونوں ہاتھ کتے کی طرح نہ بچھائے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;