var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،عَنْ إِسْرَائِيلَ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُصُّ أَوْ يَأْخُذُ مِنْ شَارِبِهِ،‏‏‏‏‏‏وَكَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ يَفْعَلُهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ اپنی مونچھیں کاٹتے تھے۔اور فرماتے تھے کہ خلیل الرحمن ابراہیم علیہ السلام بھی ایسا ہی کرتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سلسلۃ سماک عن عکرمۃ: ضعیفۃ`;
tirmizi.anwaar = [269,1];