var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ اشْتِمَالِ الصَّمَّاءِ،‏‏‏‏‏‏وَالِاحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ،‏‏‏‏‏‏وَأَنْ يَرْفَعَ الرَّجُلُ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى وَهُوَ مُسْتَلْقٍ عَلَى ظَهْرِهِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے ایک کپڑے میں صماء ۱؎ اور احتباء ۲؎ کرنے اور ایک ٹانگ دوسری ٹانگ پر رکھ کر چت لیٹنے سے منع فرمایا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;