var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ إِسْمَاعِيل بْنِ رَجَاءٍ،عَنْ أَوْسِ بْنِ ضَمْعَجٍ،عَنْ أَبِي مَسْعُودٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يُؤَمُّ الرَّجُلُ فِي سُلْطَانِهِ وَلَا يُجْلَسُ عَلَى تَكْرِمَتِهِ فِي بَيْتِهِ إِلَّا بِإِذْنِهِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”کسی کے حدود اقتدار و اختیار میں اس کی اجازت کے بغیر امامت نہیں کرائی جا سکتی،اور نہ ہی کسی شخص کے گھر میں اس کی خاص جگہ پر اس کی اجازت کے بغیر بیٹھا جا سکتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;