var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ،عَنْ عَمْرِو بْنِ سَعِيدٍ،عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ،عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظْرَةِ الْفُجَاءَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو زُرْعَةَ بْنُ عَمْرٍو اسْمُهُ هَرِمٌ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ سے (کسی اجنبیہ عورت پر) اچانک پڑ جانے والی نظر سے متعلق پوچھا۔تو آپ نے فرمایا: ”تم اپنی نگاہ پھیر لیا کرو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;