var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا شَرِيكٌ،عَنْ أَبِي رَبِيعَةَ،عَنِ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،رَفَعَهُ قَالَ:‏‏‏‏ يَا عَلِيُّ،‏‏‏‏‏‏لَا تُتْبِعِ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الْأُولَى وَلَيْسَتْ لَكَ الْآخِرَةُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ شَرِيكٍ";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”علی! نظر کے بعد نظر نہ اٹھاؤ،کیونکہ تمہارے لیے پہلی نظر (معاف) ہے اور دوسری (معاف) نہیں ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف شریک کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (2149)`;
tirmizi.anwaar = [269,1];