var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ،عَنْ سُفْيَانَ،عَنِ الْجُرَيْرِيِّ،عَنْ أَبِي نَضْرَةَ،عَنْ رَجُلٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ،‏‏‏‏‏‏وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مردوں کی خوشبو وہ ہے جس کی مہک پھیل رہی ہو اور رنگ چھپا ہوا ہو اور عورتوں کی خوشبو وہ ہے جس کا رنگ ظاہر ہو لیکن مہک اس کی چھپی ہوئی ہو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>نسائي (5120)<br>رجل مجھول وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [269,1];