var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،قَالَ:‏‏‏‏ قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ خَيْرَ طِيبِ الرَّجُلِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ،‏‏‏‏‏‏وَخَيْرَ طِيبِ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ،‏‏‏‏‏‏وَنَهَى عَنْ مِيثَرَةِ الْأُرْجُوَانِ،‏‏‏‏‏‏هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے مجھ سے فرمایا: ”مرد کی بہترین خوشبو وہ ہے جس کی مہک پھیلے اور اس کا رنگ چھپا رہے،اور عورتوں کی بہترین خوشبو وہ ہے جس کا رنگ ظاہر ہو اور خوشبو چھپی رہے“،اور آپ ﷺ نے زین کے اوپر انتہائی سرخ ریشمی کپڑا ڈالنے سے منع فرمایا۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود ( 4048)`;
tirmizi.anwaar = [269,1];