var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ،عَنْ أَبِيهِ،عَنِ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ثَلَاثٌ لَا تُرَدُّ:‏‏‏‏ الْوَسَائِدُ،‏‏‏‏‏‏وَالدُّهْنُ،‏‏‏‏‏‏وَاللَّبَنُ الدُّهْنُ،‏‏‏‏‏‏يَعْنِي بِهِ الطِّيبَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏وَعَبْدُ اللَّهِ هُوَ ابْنُ مُسْلِمِ بْنِ جُنْدَبٍ وَهُوَ مَدَنِيٌّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تین چیزیں (ہدیہ و تحفہ میں آئیں) تو وہ واپس نہیں کی جاتی ہیں: تکئے،دہن،اور دودھ،دہن (تیل) سے مراد خوشبو ہے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-عبداللہ یہ مسلم بن جندب کے بیٹے ہیں اور مدنی ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 3029`;