var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ شَقِيقِ بْنِ سَلَمَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ حَتَّى تَصِفَهَا لِزَوْجِهَا كَأَنَّمَا يَنْظُرُ إِلَيْهَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”عورت عورت سے نہ چمٹے یہاں تک کہ وہ اسے اپنے شوہر سے اس طرح بیان کرے گویا وہ اسے دیکھ رہا ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;