var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ،عَنْ زُرْعَةَ بْنِ مُسْلِمِ بْنِ جَرْهَدٍ الْأَسْلَمِيِّ،عَنْ جَدِّهِ جَرْهَدٍ،قَالَ:‏‏‏‏ مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَرْهَدٍ فِي الْمَسْجِدِ وَقَدِ انْكَشَفَ فَخِذُهُ،‏‏‏‏‏‏فَقَال:‏‏‏‏ إِنَّ الْفَخِذَ عَوْرَةٌ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ مَا أَرَى إِسْنَادَهُ بِمُتَّصِلٍ.";
tirmizi.urdu = "نبی اکرم ﷺ مسجد میں جرہد کے پاس (یعنی میرے پاس سے) سے گزرے (اس وقت) ان کی ران کھلی ہوئی تھی تو آپ نے فرمایا: ”ران بھی ستر (چھپانے کی چیز) ہے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-میرے نزدیک اس کی سند متصل نہیں ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3112`;