var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،عَنِ الْحَسَنِ بْنِ صَالِحٍ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ،عَنْ عَبْدِ اللَّهِ بْنِ جَرْهَدٍ الْأَسْلَمِيِّ،عَنْ أَبِيهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ الْفَخِذُ عَوْرَةٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏‏‏وَفِي الْبَابِ،‏‏‏‏‏‏عَنْ عَلِيٍّ وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ،‏‏‏‏‏‏وَلِعَبْدِ اللَّهِ بْنِ جَحْشٍ صُحْبَةٌ،‏‏‏‏‏‏وَلِابْنِهِ مُحَمَّدٍ صُحْبَةٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”ران بھی ستر (چھپانے کی چیز) ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3114`;