var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ الْأَعْرَجِ،عَنْ أَبِي عُذْرَةَ،وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏عَنْ عَائِشَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى الرِّجَالَ وَالنِّسَاءَ عَنِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ فِي الْمَيَازِرِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَا نَعْرِفُهُ،‏‏‏‏‏‏إِلَّا مِنْ حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ وَإِسْنَادُهُ لَيْسَ بِذَاكَ الْقَائِمِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے مردوں اور عورتوں کو حمامات (عمومی غسل خانوں) میں جا کر نہانے سے منع فرمایا۔پھر مردوں کو تہہ بند پہن کر نہانے کی اجازت دے دی۔امام ترمذی کہتے ہیں: ۱-اس حدیث کو ہم صرف حماد بن سلمہ کی روایت سے جانتے ہیں،۲-اس کی سند ویسی مضبوط نہیں ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 4474
وأبو عذرۃ: حسن الحدیث، والسند قائم والحمد للّٰہ`;