var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ،أَخْبَرَنِي أَبِي،عَنْ مُصْعَبِ بْنِ شَيْبَةَ،عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ غَدَاةٍ وَعَلَيْهِ مِرْطٌ مِنْ شَعَرٍ أَسْوَدَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ.";
tirmizi.urdu = "ایک صبح رسول اللہ ﷺ (گھر سے) نکلے،اس وقت آپ کالے بالوں کی چادر اوڑھے ہوئے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = `مشکوۃ المصابیح: 4359`;