var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ دَلْهَمِ بْنِ صَالِحٍ،عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ،عَنِ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،أَنَّ النَّجَاشِيَّ أَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ،‏‏‏‏‏‏فَلَبِسَهُمَا ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَيْهِمَا،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ دَلْهَمٍ،‏‏‏‏‏‏وَقَدْ رَوَاهُ مُحَمَّدُ بْنُ رَبِيعَةَ،‏‏‏‏‏‏عَنْ دَلْهَمٍ.";
tirmizi.urdu = "نجاشی (شاہ حبشہ) نے نبی اکرم ﷺ کو دو کالے رنگ کے موزے بھیجے،آپ نے انہیں پہنا،پھر آپ نے وضو کیا اور ان دونوں موزوں پر مسح فرمایا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-ہم اسے صرف دلہم کی روایت سے جانتے ہیں،۳-محمد بن ربیعہ نے دلہم (راوی) سے روایت کی ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (155) ابن ماجہ (549)`;
tirmizi.anwaar = [270,1];