var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاق الْهَمْدَانِيُّ،حَدَّثَنَا عَبْدَةُ،عَنْ مُحَمَّدِ بْنِ إِسْحَاق،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى عَنْ نَتْفِ الشَّيْبِ،‏‏‏‏‏‏وَقَالَ:‏‏‏‏ إِنَّهُ نُورُ الْمُسْلِمِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ قَدْ رُوِيَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ،‏‏‏‏‏‏وَغَيْرِ وَاحِدٍ،‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے بڑھاپے کے (سفید) بال اکھیڑنے سے منع کیا،اور فرمایا ہے: ”یہ تو مسلمان کا نور ہے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-عبدالرحمٰن بن حارث اور کئی دیگر لوگوں سے یہ حدیث عمر بن شعیب کے واسطہ سے مروی ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;