var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا وَكِيعٌ،عَنْ دَاوُدَ بْنِ أَبِي عَبْدِ اللَّهِ،عَنْ ابْنِ جُدْعَانَ،عَنْ جَدَّتِهِ،عَنْ أُمِّ سَلَمَةَ،قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُسْتَشَارُ مُؤْتَمَنٌ،‏‏‏‏‏‏وَفِي الْبَابِ،‏‏‏‏‏‏عَنْ ابْنِ مَسْعُودٍ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏‏‏وَابْنِ عُمَرَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أُمِّ سَلَمَةَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مشیر یعنی جس سے مشورہ لیا جائے اس کو امین ہونا چاہیئے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حدیث ام سلمہ رضی الله عنہا کی روایت سے غریب ہے،۲-اس باب میں ابن مسعود،ابوہریرہ اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;