var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ مَا سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ أَبَوَيْهِ لِأَحَدٍ غَيْرَ سَعْدِ بْنِ أَبِي وَقَّاصٍ .";
tirmizi.urdu = "میں نے نبی اکرم ﷺ کو سعد بن ابی وقاص کے سوا کسی کے لیے اپنے ماں باپ کو جمع کرتے ہوئے نہیں دیکھا ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;