var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ،حَدَّثَنَا أَبُو عَاصِمٍ،عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ الْعُمَرِيِّ،عَنْ نَافِعٍ،عَنِ ابْن عُمَرَ،قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ أَحَبَّ الْأَسْمَاءِ إِلَى اللَّهِ عَبْدُ اللَّهِ،‏‏‏‏‏‏وَعَبْدُ الرَّحْمَنِ هَذَا حَدِيثٌ غَرِيبٌ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اللہ تعالیٰ کے نزدیک سب سے زیادہ پسندیدہ نام عبداللہ اور عبدالرحمٰن ہیں“۔امام ترمذی کہتے ہیں: اس سند سے یہ حدیث غریب ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;