var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَكِّيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي الزِّنَادِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْنَعُ اسْمٍ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ رَجُلٌ تَسَمَّى بِمَلِكِ الْأَمْلَاكِ،‏‏‏‏‏‏قَالَ سُفْيَانُ:‏‏‏‏ شَاهَانْ شَاهْ،‏‏‏‏‏‏وَأَخْنَعُ يَعْنِي أَقْبَحُ،‏‏‏‏‏‏هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”قیامت کے دن اللہ کے نزدیک سب سے بدتر نام اس شخص کا ہو گا جس کا نام «ملک الاملاک» ہو گا“،سفیان کہتے ہیں: «ملک الاملاک» کا مطلب ہے: شہنشاہ۔اور «اخنع» کے معنی «اقبح» ہیں یعنی سب سے بدتر اور حقیر ترین۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;