var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ،حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ،عَنْ كَامِلٍ أَبِي الْعَلَاءِ،عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ،عن سَعِيدِ بْنِ جُبَيْرٍ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ بَيْنَ السَّجْدَتَيْنِ:‏‏‏‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاجْبُرْنِي وَاهْدِنِي وَارْزُقْنِي .";
tirmizi.urdu = "نبی اکرم ﷺ دونوں سجدوں کے درمیان «اللهم اغفر لي وارحمني واجبرني واهدني وارزقني» ”اے اللہ! مجھے بخش دے،مجھ پر رحم فرما،میرے نقصان کی تلافی فرما،مجھے ہدایت دے اور مجھے رزق عطا فرما“ کہتے تھے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (850) ابن ماجہ (898)<br>حبیب بن أبي ثابت مدلس وعنعن<br>وقدثبت عن مکحول أنہ کان یقولھا بین السجدتین نحو المعنی (المعجم لابن المقرئ: 1357 وسندہ صحیح)`;
tirmizi.anwaar = [197,1];