var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ،حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى،عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا سَمَّيْتُمْ بِاسْمِي فَلَا تَكْتَنُوا بِي،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب تم میرے نام پر نام رکھو تو میری کنیت نہ رکھو“۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 4770`;