var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا شَرِيكٌ،عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَ:‏‏‏‏ قِيلَ لَهَا:‏‏‏‏ هَلْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَمَثَّلُ بِشَيْءٍ مِنَ الشِّعْرِ؟ قَالَتْ:‏‏‏‏ كَانَ يَتَمَثَّلُ بِشِعْرِ ابْنِ رَوَاحَةَ وَيَتَمَثَّلُ وَيَقُولُ:‏‏‏‏ وَيَأْتِيكَ بِالْأَخْبَارِ مَنْ لَمْ تُزَوِّدِوَفِي الْبَابِ،‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ان سے پوچھا گیا: کیا رسول اللہ ﷺ کبھی کوئی شعر بطور مثال اور نمونہ پیش کرتے تھے؟ تو انہوں نے کہا: ہاں،رسول اللہ ﷺ ابن رواحہ کا شعر بطور مثال پیش کرتے تھے،آپ کہتے تھے: «ويأتيك بالأخبار من لم تزود» ۱؎ امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>شریک بن عبد اللّٰہ القاضي مدلس وعنعن <br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [270,1];