var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ الْحُلْوَانِيُّ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ زَيْدِ بْنِ حُبَابٍ،عَنْ كَامِلٍ أَبِي الْعَلَاءِ نَحْوَهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏وَهَكَذَا رُوِيَ عَنْ عَلِيٍّ،‏‏‏‏‏‏وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ،‏‏‏‏ وَإِسْحَاق يرون هذا جائزا في المكتوبة والتطوع،‏‏‏‏‏‏وروى بعضهم هذا الحديث عَنْ كَامِلٍ أَبِي الْعَلَاءِ مُرْسَلًا.";
tirmizi.urdu = "کامل ابو العلاء سے اسی طرح مروی ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اسی طرح علی رضی الله عنہ سے بھی مروی ہے۔اور بعض لوگوں نے کامل ابو العلاء سے یہ حدیث مرسلاً روایت کی ہے،۳-شافعی،احمد،اسحاق بن راہویہ بھی یہی کہتے ہیں،ان کی رائے ہے کہ یہ فرض اور نفل دونوں میں جائز ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (850) ابن ماجہ (898)<br>حبیب بن أبي ثابت مدلس وعنعن<br>وقدثبت عن مکحول أنہ کان یقولھا بین السجدتین نحو المعنی (المعجم لابن المقرئ: 1357 وسندہ صحیح)`;
tirmizi.anwaar = [197,1];