var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ شُعْبَةَ،عَنْ قَتَادَةَ،عَنْ يُونُسَ بْنِ جُبَيْرٍ،عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَاصٍ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”کسی شخص کے پیٹ کا بیماری کے سبب مواد سے بھر جانا بہتر ہے اس سے کہ وہ شعر سے بھرا ہو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;