var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو أَحْمَدَ،حَدَّثَنَا سُفْيَانُ،عَنِ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ،عَنْ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الْأَيَّامِ مَخَافَةَ السَّآمَةِ عَلَيْنَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ ہم کو وعظ و نصیحت کا سلسلے میں اوقات کا خیال کیا کرتے تھے،اس ڈر سے کہ کہیں ہم پر اکتاہٹ طاری نہ ہو جائے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;