var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ،حَدَّثَنَا ابْنُ فُضَيْلٍ،عَنِ الْأَعْمَشِ،عَنْ أَبِي صَالِحٍ،قَال:‏‏‏‏ سُئِلَتْ عَائِشَةُ،وَأُمُّ سَلَمَةَ أَيُّ كان أحب إلى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَتَا:‏‏‏‏ مَا دِيمَ عَلَيْهِ وَإِنْ قَلَّ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "ام المؤمنین عائشہ اور ام سلمہ رضی الله عنہما سے پوچھا گیا کہ کون سا عمل رسول اللہ ﷺ کو بہت زیادہ پسند تھا؟،ان دونوں نے جواب دیا کہ وہ عمل جو گرچہ تھوڑا ہو لیکن اسے مستقل اور برابر کیا جائے۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;