var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا تَجْعَلُوا بُيُوتَكُمْ مَقَابِرَ،‏‏‏‏‏‏وَإِنَّ الْبَيْتَ الَّذِي تُقْرَأُ فِيهِ الْبَقَرَةُ لَا يَدْخُلُهُ الشَّيْطَانُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اپنے گھروں کو قبرستان نہ بناؤ۔وہ گھر جس میں سورۃ البقرہ پڑھی جاتی ہے اس میں شیطان داخل نہیں ہوتا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;