var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ،عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ،عَنْ إِبْرَاهِيمَ بْنِ يَزِيدَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ،عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قَرَأَ الْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے رات میں سورۃ البقرہ کی آخری دو آیتیں پڑھیں وہ اس کے لیے کافی ہو گئیں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;