var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل،قَالَ:‏‏‏‏ حَدَّثَنَا الْحُمَيْدِيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ فِي تَفْسِيرِ حَدِيثِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا خَلَقَ اللَّهُ مِنْ سَمَاءٍ،‏‏‏‏‏‏وَلَا أَرْضٍ أَعْظَمَ مِنْ آيَةِ الْكُرْسِيِّ،‏‏‏‏‏‏قَالَ سُفْيَانُ:‏‏‏‏ لِأَنَّ آيَةَ الْكُرْسِيِّ هُوَ كَلَامُ اللَّهِ،‏‏‏‏‏‏وَكَلَامُ اللَّهِ أَعْظَمُ مِنْ خَلْقِ اللَّهِ مِنَ السَّمَاءِ وَالْأَرْضِ.";
tirmizi.urdu = "وہ عبداللہ بن مسعود رضی الله عنہ کی اس حدیث «ما خلق الله من سماء ولا أرض أعظم من آية الكرسي» کی تفسیر میں کہتے ہیں: آیت الکرسی کی فضیلت اس وجہ سے ہے کہ یہ اللہ کا کلام ہے اور اللہ کا کلام اللہ کی مخلوق یعنی آسمان و زمین سے بڑھ کر ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;