var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ،عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ،عَنْ أَبِي الدَّرْدَاءِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ قَرَأَ ثَلَاثَ آيَاتٍ مِنْ أَوَّلِ الْكَهْفِ عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جس نے سورۃ الکہف کی ابتدائی تین آیات پڑھیں وہ دجال کے فتنہ سے بچا لیا گیا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `شاذ<br>والصواب ما رواہ مسلم (809) بلفظ:’’ عشر آیات‘‘`;
tirmizi.anwaar = [272,1];