var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ عَبَّاسٍ الْجُشَمِيِّ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ سُورَةً مِنَ الْقُرْآنِ ثَلَاثُونَ آيَةً شَفَعَتْ لِرَجُلٍ حَتَّى غُفِرَ لَهُ،‏‏‏‏‏‏وَهِيَ سُورَةُ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”قرآن کی تیس آیتوں کی ایک سورۃ نے ایک آدمی کی شفاعت (سفارش) کی تو اسے بخش دیا گیا،یہ سورۃ «تبارك الذي بيده الملك» ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 2153`;