var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَرْزُوقٍ الْبَصْرِيُّ،حَدَّثَنَا حَاتِمُ بْنُ مَيْمُونٍ أَبُو سَهْلٍ،عَنْ ثَابِتٍ الْبُنَانِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ قَرَأَ كُلَّ يَوْمٍ مِائَتَيْ مَرَّةٍ قُلْ هُوَ اللَّهُ أَحَدٌ مُحِيَ عَنْهُ ذُنُوبُ خَمْسِينَ سَنَةً إِلَّا أَنْ يَكُونَ عَلَيْهِ دَيْنٌ،‏‏‏‏";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جو شخص ہر دن دو سو مرتبہ «قل هو الله أحد» پڑھے گا تو قرض کے سوا اس کے پچاس سال تک کے گناہ مٹا دیئے جائیں گے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>حاتم بن میمون: ضعیف (تقریب: 999)`;
tirmizi.anwaar = [273,1];