var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ أَبِي أُمَيَّةَ،عَنْ حَسَّانَ بْنِ بِلَالٍ،قَالَ:‏‏‏‏ رَأَيْتُ عَمَّارَ بْنَ يَاسِرٍ تَوَضَّأَ،‏‏‏‏‏‏فَخَلَّلَ لِحْيَتَهُ،‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ أَوْ قَالَ:‏‏‏‏ فَقُلْتُ لَهُ:‏‏‏‏ أَتُخَلِّلُ لِحْيَتَكَ،‏‏‏‏ قَالَ:‏‏‏‏ وَمَا يَمْنَعُنِي وَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَلِّلُ لِحْيَتَهُ .";
tirmizi.urdu = "میں نے عمار بن یاسر رضی الله عنہما کو دیکھا کہ انہوں نے وضو کیا تو اپنی داڑھی میں خلال کیا ۱؎ ان سے کہا گیا یا راوی حدیث حسان نے کہا کہ میں نے ان سے کہا: کیا آپ اپنی داڑھی کا خلال کر رہے ہیں؟ تو انہوں نے جواب دیا کہ میں داڑھی کا خلال کیوں نہ کروں جب کہ میں نے رسول اللہ صلی الله علیہ وسلم کو داڑھی کا خلال کرتے دیکھا ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عبد الکریم بن أبی المخارق ضعیف<br>والحدیث الآتي (الأصل: 31) یغني عنہ`;
tirmizi.anwaar = [189,2];