var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ عَلِيِّ بْنِ رَبَاحٍ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،قَالَ:‏‏‏‏ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقْرَأَ بِالْمُعَوِّذَتَيْنِ فِي دُبُرِ كُلِّ صَلَاةٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے مجھے حکم دیا کہ ہر نماز کے بعد معوذتین پڑھا کروں۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 969`;