var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ،عَنْ مُحَمَّدِ بْنِ إِسْحَاق،عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ:‏‏‏‏ مِنَ السُّنَّةِ أَنْ يُخْفِيَ التَّشَهُّدَ . قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ مَسْعُودٍ حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ.";
tirmizi.urdu = "سنت سے یہ ہے ۱؎ کہ تشہد آہستہ پڑھا جائے۔امام ترمذی کہتے ہیں: ۱-ابن مسعود کی حدیث حسن غریب ہے،۲-اور اہل علم کا اسی پر عمل ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 918
وللحدیث شواھد عند الحاکم (1/ 230) وغیرہ وھو بھا صحیح `;