var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِذَلِكَ إِسْحَاق بْنُ مَنْصُورٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ مُعَاوِيَةَ،عَنِ الْعَلَاءِ بْنِ الْحَارِثِ،عَنْ زَيْدِ بْنِ أَرْطَاةَ،عَنْ جُبَيْرِ بْنِ نُفَيْرٍ،قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّكُمْ لَنْ تَرْجِعُوا إِلَى اللَّهِ بِأَفْضَلَ مِمَّا خَرَجَ مِنْهُ،‏‏‏‏‏‏يَعْنِي الْقُرْآنَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”تم اللہ کی طرف رجوع کرنے کے لیے قرآن سے بڑھ کر کوئی اور ذریعہ نہیں پا سکتے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>السند مرسل،وذکرہ أبو داود فی المراسیل (538)`;
tirmizi.anwaar = [273,1];