var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَليُّ بْنُ حُجْرٍ،أَخْبَرَنَا بَقِيَّةُ بْنُ الْوَلِيدِ،عَنْ بَحِيرِ بْنِ سَعْدٍ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بِلَالٍ،عَنْ عِرْبَاضِ بْنِ سَارِيَةَ،أَنَّهُ حَدَّثَهُ،‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ يَقْرَأُ الْمُسَبِّحَاتِ قَبْلَ أَنْ يَرْقُدَ،‏‏‏‏‏‏وَيَقُولُ:‏‏‏‏ إِنَّ فِيهِنَّ آيَةً خَيْرٌ مِنْ أَلْفِ آيَةٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ سونے سے پہلے مسبحات پڑھتے تھے ۱؎ آپ فرماتے تھے: ”ان میں ایک آیت ایسی ہے جو ہزار آیتوں سے بہتر ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 2151`;