var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمَ،عَنْ عُتْبَةَ بْنِ حُمَيْدٍ،عَنْ عُبَادَةَ بْنِ نُسَيٍّ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ،عَنْ مُعَاذِ بْنِ جَبَلٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَرَأَ هَلْ تَسْتَطِيعُ رَبَّكَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ،‏‏‏‏‏‏وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ،‏‏‏‏‏‏وَرِشْدِينُ بْنُ سَعْدٍ،‏‏‏‏‏‏وَالْأَفْرِيقِيُّ يُضَعَّفَانِ فِي الْحَدِيثِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے پڑھا «هل تستطيع ربك» ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،ہم اسے صرف رشدین کی حدیث سے جانتے ہیں،۲-اور اس کی سند قوی نہیں ہے،رشدین بن سعد اور (عبدالرحمٰن بن زیاد بن انعم) افریقی دونوں حدیث بیان کرنے میں ضعیف ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>رشدین و ابن أنعم الإفریقي ضعیفان`;
tirmizi.anwaar = [275,1];