var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ بَصْرِيٌ،حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ،حَدَّثَنَا أَبُو الْجَارِيَةِ الْعَبْدِيُّ،عَنْ شُعْبَةَ،عَنْ أَبِي إِسْحَاق،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،عَنْ أُبَيِّ بْنِ كَعْبٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ:‏‏‏‏ قَرَأَ قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا سورة الكهف آية 76 مُثَقَّلَةً،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ،‏‏‏‏‏‏وَأُمَيَّةُ بْنُ خَالِدٍ ثِقَةٌ،‏‏‏‏‏‏وَأَبُو الْجَارِيَةِ الْعَبْدِيُّ شَيْخٌ مَجْهُولٌ وَلَا نَعْرِفُ اسْمَهُ.";
tirmizi.urdu = "نبی اکرم ﷺ نے پڑھا: «قد بلغت من لدني عذرا» ۱؎ یعنی «لدني» کو نون ثقیلہ کے ساتھ پڑھا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں،۲-امیہ بن خالد ثقہ ہیں،۳-ابوالجاریہ عبدی مجہول شیخ ہیں،ہم ان کا نام نہیں جانتے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (3985)`;
tirmizi.anwaar = [275,1];