var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ،حَدَّثَنَا نُعَيْمُ بْنُ مَيْسَرَةَ النَّحْوِيُّ،عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ،عَنْ عَطِيَّةَ الْعَوْفِيِّ،عَنِ ابْنِ عُمَرَ أَنَّهُ:‏‏‏‏ قَرَأَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلَقَكُمْ مِنْ ضَعْفٍ سورة الروم آية 54،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مِنْ ضُعْفٍ .";
tirmizi.urdu = "انہوں نے نبی ﷺ کے سامنے «خَلَقَكُمْ مِنْ ضَعْفٍ» (ضاد کے فتحہ کے ساتھ) پڑھا تو آپ نے فرمایا: «مِنْ ضَعْفٍ» نہیں «مِنْ ضُعْفٍ» ۱؎ (ضاد کے ضمہ کے ساتھ) پڑھو“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-ہم اسے صرف فضیل بن مرزوق کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سنن أبي داود (3978)<br>عطیۃ العوفي ضعیف`;
tirmizi.anwaar = [275,1];