var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاق،عَنِ الْأَسْوَدِ بْنِ يَزِيدَ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ يَقْرَأُ فَهَلْ مِنْ مُدَّكِرٍ سورة القمر آية 15،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ «فهل من مدكر» ۱؎ پڑھتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;