var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ،حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ الضُّبَعِيُّ،عَنْ هَارُونَ الْأَعْوَرِ،عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ،عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ،عَنْ عَائِشَةَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ يَقْرَأُ فَرَوْحٌ وَرَيْحَانٌ وَجَنَّةُ نَعِيمٍ سورة الواقعة آية 89،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ هَارُونَ الْأَعْوَرِ.";
tirmizi.urdu = "نبی اکرم ﷺ «فروح وريحان وجنة نعيم» ۱؎ پڑھتے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اسے ہم صرف ہارون اعور کی روایت سے ہی جانتے ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;