var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاق،عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ:‏‏‏‏ أَقْرَأَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَنَا الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے مجھے «إني أنا الرزاق ذو القوة المتين» پڑھایا ہے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5307`;