var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ،حَدثَنَا النَّضْرُ بْنُ شُمَيْلٍ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ يَزِيدَ بْنِ عَبْدِ اللهِ بْنِ الشِّخِّيرِ،عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو،أَنّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلًّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمْ يَفْقَهْ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلاثٍ،‏‏‏‏‏‏قَالَ أَبُو عَيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اس نے قرآن سمجھا ہی نہیں جس نے تین دن سے کم مدت میں قرآن ختم کر ڈالا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 2201`;