var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ،حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِ الْأَعْلَى،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا،‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قَالَ فِي الْقُرْآنِ بِغَيْرِ عِلْمٍ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے بغیر علم کے (بغیر سمجھے بوجھے) قرآن کی تفسیر کی،تو وہ اپنا ٹھکانا جہنم میں بنا لے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عبد الأعلی الثعلبي: ضعیف وقال الھیثمي ’’ الأکثر علی تضعیفہ ‘‘ (مجمع الزوائد 147/1) وانظر ضعیف سنن أبي داود (3208)`;
tirmizi.anwaar = [276,1];