var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا سُوَيْدُ بْنُ عَمْرٍو الْكَلْبِيُّ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ عَبْدِ الْأَعْلَى،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ اتَّقُوا الْحَدِيثَ عَنِّي إِلَّا مَا عَلِمْتُمْ،‏‏‏‏‏‏فَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ،‏‏‏‏‏‏وَمَنْ قَالَ فِي الْقُرْآنِ بِرَأْيِهِ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”میری طرف سے کوئی بات اس وقت تک نہ بیان کرو جب تک کہ تم (اچھی طرح) جان نہ لو کیونکہ جس نے جان بوجھ کر جھوٹی بات میری طرف منسوب کی تو وہ اپنا ٹھکانا جہنم میں بنا لے اور جس نے قرآن میں اپنی عقل و رائے سے کچھ کہا وہ بھی اپنا ٹھکانا جہنم میں بنا لے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>انظر الحدیث السابق (2950)`;
tirmizi.anwaar = [276,1];