var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،أَخْبَرَنَا عَبْدُ الرَّزَّاقِ،عَنْ مَعْمَرٍ،عَنْ هَمَّامِ بْنِ مُنَبِّهٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ:‏‏‏‏ ادْخُلُوا الْبَابَ سُجَّدًا سورة النساء آية 154،‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلُوا مُتَزَحِّفِينَ عَلَى أَوْرَاكِهِمْ،‏‏‏‏‏‏أَيْ مُنْحَرِفِينَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے آیت کریمہ: «ادخلوا الباب سجدا» ”اور جھکے جھکے دروازہ میں داخل ہونا“ (البقرہ: ۵۸) کے بارے میں فرمایا: ”بنی اسرائیل چوتڑ کے بل کھسکتے ہوئے داخل ہوئے“۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;