var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ،حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ،أَنَّ عُمَرَ بْنَ الْخَطَّابِ،قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏لَوْ صَلَّيْنَا خَلْفَ الْمَقَامِ،‏‏‏‏‏‏فَنَزَلَتْ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى سورة البقرة آية 125،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "عمر بن خطاب رضی الله عنہ نے کہا: اللہ کے رسول! کاش ہم مقام (مقام ابراہیم) کے پیچھے نماز پڑھتے،تو آیت: «واتخذوا من مقام إبراهيم مصلى» ”تم مقام ابراہیم کو جائے صلاۃ مقرر کر لو“ (البقرہ: ۱۲۵) نازل ہوئی ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;