var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،حَدَّثَنَا الْأَعْمَشُ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي سَعِيدٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ:‏‏‏‏ وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا سورة البقرة آية 143،‏‏‏‏‏‏قَالَ:‏‏‏‏ عَدْلًا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے آیت: «وكذلك جعلناكم أمة وسطا» ”ہم نے اسی طرح تمہیں عادل امت بنایا ہے“ (البقرہ: ۱۴۳) کے سلسلے میں فرمایا: ’’«وسط» سے مراد عدل ہے“ (یعنی انصاف پسند)۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;