var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،عَنِ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ كَانُوا رُكُوعًا فِي صَلَاةِ الْفَجْرِ،‏‏‏‏‏‏وَفِي الْبَابِ،‏‏‏‏‏‏عَنْ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيِّ،‏‏‏‏‏‏وَابْنِ عُمَرَ،‏‏‏‏‏‏وَعُمَارَةَ بْنِ أَوْسٍ،‏‏‏‏‏‏وَأَنَسِ بْنِ مَالِكٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "لوگ فجر کی نماز ۱؎ میں حالت رکوع میں تھے۔امام ترمذی کہتے ہیں: ۱-ابن عمر کی حدیث حسن صحیح ہے،۲-اس باب میں عمرو بن عوف مزنی،ابن عمر،عمارہ بن اوس اور انس بن مالک رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;