var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا حُصَيْنٌ،عَنِ الشَّعْبِيِّ،أَخْبَرَنَا عَدِيُّ بْنُ حَاتِمٍ،قَالَ:‏‏‏‏ لَمَّا نَزَلَتْ حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ سورة البقرة آية 187،‏‏‏‏‏‏قَالَ لِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا ذَاكَ بَيَاضُ النَّهَارِ مِنْ سَوَادِ اللَّيْلِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "جب آیت: «حتى يتبين لكم الخيط الأبيض من الخيط الأسود من الفجر» نازل ہوئی تو نبی اکرم ﷺ نے مجھ سے فرمایا: ”اس سے مراد رات کی تاریکی سے دن کی سفیدی (روشنی) کا نمودار ہو جانا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;