var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ،عَنِ ابْنِ جُرَيْجٍ،عَنْ ابْنِ أَبِي مُلَيْكَةَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَبْغَضُ الرِّجَالِ إِلَى اللَّهِ الْأَلَدُّ الْخَصِمُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اللہ کے نزدیک سب سے زیادہ قابل نفرت وہ شخص ہے جو سب سے زیادہ جھگڑالو ہو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;