var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ لَا يَقْعُدُ إِلَّا مِقْدَارَ مَا يَقُولُ:‏‏‏‏ اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ ذَا الْجَلَالِ وَالْإِكْرَامِ .";
tirmizi.urdu = "رسول اللہ ﷺ جب سلام پھیرتے تو «اللهم أنت السلام ومنك السلام تباركت ذا الجلال والإكرام» ”اے اللہ تو سلام ہے،تجھ سے سلامتی ہے،بزرگی اور عزت والے! تو بڑی برکت والا ہے“ کہنے کے بقدر ہی بیٹھتے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;