var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو النَّضْرِ،وَأَبُو دَاوُدَ الطَّيَالِسِيُّ،عَنْ مُحَمَّدِ بْنِ طَلْحَةَ بْنِ مُصَرِّفٍ،عَنْ زُبَيْدٍ،عَنْ مُرَّةَ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَلَاةُ الْوُسْطَى صَلَاةُ الْعَصْرِ،‏‏‏‏‏‏وَفِي الْبَابِ،‏‏‏‏‏‏عَنْ زَيْدِ بْنِ ثَابِتٍ،‏‏‏‏‏‏وَأَبِي هَاشِمِ بْنِ عُتْبَةَ،‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ’’«صلاة الوسطى» سے مراد عصر کی نماز ہے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں زید بن ثابت،ابوہاشم بن عتبہ اور ابوہریرہ رضی الله عنہ سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;