var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ،وَيَزِيدُ بْنُ هَارُونَ،وَمُحَمَّدُ بْنُ عُبَيْدٍ،عَنْ إِسْمَاعِيل بْنِ أَبِي خَالِدٍ،عَنِ الْحَارِثِ بْنِ شُبَيْلٍ،عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ،عَنْ زَيْدِ بْنِ أَرْقَمَ،قَالَ:‏‏‏‏ كُنَّا نَتَكَلَّمُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ،‏‏‏‏‏‏فَنَزَلَتْ:‏‏‏‏ وَقُومُوا لِلَّهِ قَانِتِينَ سورة البقرة آية 238 فَأُمِرْنَا بِالسُّكُوتِ .";
tirmizi.urdu = "ہم رسول اللہ ﷺ کے زمانہ میں نماز کے اندر باتیں کیا کرتے تھے،تو جب آیت «وقوموا لله قانتين» (البقرہ: ۲۳۸)،نازل ہوئی تو ہمیں چپ رہنے کا حکم ملا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;