var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ فِرَاسٍ،عَنِ الشَّعْبِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ الْكَبَائِرُ:‏‏‏‏ الْإِشْرَاكُ بِاللَّهِ،‏‏‏‏‏‏وَعُقُوقُ الْوَالِدَيْنِ أَوْ قَالَ الْيَمِينُ الْغَمُوسُ شَكَّ شُعْبَةُ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”کبائر یہ ہیں: اللہ کے ساتھ شریک کرنا،ماں باپ کی نافرمانی کرنا،یا کہا: جھوٹی قسم کھانا“۔اس میں شعبہ کو شک ہو گیا ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;