var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا أَبُو نُعَيْمٍ،حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ،عَنْ أَبِي السَّفَرِ،عَنْ الْبَرَاءِ،قَالَ:‏‏‏‏ آخِرُ آيَةٍ أُنْزِلَتْ أَوْ آخِرُ شَيْءٍ نَزَلَ يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ سورة النساء آية 176،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏وَأَبُو السَّفَرِ اسْمُهُ سَعِيدُ بْنُ أَحْمَدَ الثَّوْرِيُّ،‏‏‏‏‏‏وَيُقَالُ ابْنُ يُحْمِدَ.";
tirmizi.urdu = "آخری آیت جو نازل ہوئی یا آخری چیز جو نازل کی گئی ہے وہ یہ آیت ہے «يستفتونك قل الله يفتيكم في الكلالة» ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;