var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ،عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ،عَنْ أَبِي إِسْحَاق،عَنِ الْبَرَاءِ،قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ سورة النساء آية 176،‏‏‏‏‏‏فَقَال لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تُجْزِئُكَ آيَةُ الصَّيْفِ .";
tirmizi.urdu = "ایک شخص نے رسول اللہ ﷺ کے پاس آ کر کہا: اللہ کے رسول! «يستفتونك قل الله يفتيكم في الكلالة» کی تفسیر کیا ہے،نبی اکرم ﷺ نے فرمایا: ”اس کے سلسلہ میں تو تمہارے لیے آیت صیف ۱؎ کافی ہو گی“۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;