var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ،عَنْ عَلِيِّ بْنِ مُسْهِرٍ،عَنِ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ لَمَّا نَزَلَتْ لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا وَعَمِلُوا الصَّالِحَاتِ سورة المائدة آية 93،‏‏‏‏‏‏قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنْتَ مِنْهُمْ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "جب آیت «ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا وعملوا الصالحات» نازل ہوئی تو رسول اللہ ﷺ نے مجھ سے فرمایا: ”تم انہی میں سے ہو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;