var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ طَاوُسٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ يُلَقَّى عِيسَى حُجَّتَهُ وَلَقَّاهُ اللَّهُ فِي قَوْلِهِ:‏‏‏‏ وَإِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَهَيْنِ مِنْ دُونِ اللَّهِ سورة المائدة آية 116،‏‏‏‏‏‏قَالَ أَبُو هُرَيْرَةَ:‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَلَقَّاهُ اللَّهُ سُبْحَانَكَ مَا يَكُونُ لِي أَنْ أَقُولَ مَا لَيْسَ لِي بِحَقٍّ سورة المائدة آية 116 الْآيَةَ كُلَّهَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ابوہریرہ رضی الله عنہ کہتے ہیں کہ";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سفیان بن عیینۃ عنعن <br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [279,1];