var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ،عَنْ سُفْيَانَ،عَنْ أَبِي إِسْحَاق،عَنْ نَاجِيَةَ بْنِ كَعْبٍ،عَنْ عَلِيٍّ،أَنَّ أَبَا جَهْلٍ،‏‏‏‏‏‏قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّا لَا نُكَذِّبُكَ وَلَكِنْ نُكَذِّبُ بِمَا جِئْتَ بِهِ،‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ تَعَالَى فَإِنَّهُمْ لا يُكَذِّبُونَكَ وَلَكِنَّ الظَّالِمِينَ بِآيَاتِ اللَّهِ يَجْحَدُونَ سورة الأنعام آية 33 .";
tirmizi.urdu = "ابوجہل نے نبی اکرم ﷺ سے کہا: ہم آپ کو نہیں جھٹلاتے ہیں،بلکہ آپ جو (دین قرآن) لے کر آئے ہیں اسے جھٹلاتے ہیں،تو اللہ تعالیٰ نے آیت «فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون» ”وہ لوگ تجھ کو نہیں جھٹلاتے ہیں بلکہ ظالم لوگ اللہ کی آیتوں کا انکار کرتے ہیں“ (الانعام: ۳۳)۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو إسحاق السبیعي عنعن`;
tirmizi.anwaar = [279,1];