var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ،عَنْ دَاوُدَ الْأَوْدِيِّ،عَنِ الشَّعْبِيِّ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى الصَّحِيفَةِ الَّتِي عَلَيْهَا خَاتَمُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيَقْرَأْ هَذِهِ الْآيَاتِ قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ إِلَى قَوْلِهِ لَعَلَّكُمْ تَتَّقُونَ سورة الأنعام آية 151 ـ 153،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "جسے اس بات سے خوشی ہو کہ وہ صحیفہ دیکھے جس پر محمد ﷺ کی مہر ہے تو اسے یہ آیات «قل تعالوا أتل ما حرم ربكم عليكم» سے «لعلكم تتقون» ۱؎ تک پڑھنی چاہیئے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>داود: اثنان أحدھما ضعیف فالسند معلل لعدم تعین الراوي`;
tirmizi.anwaar = [279,1];