var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا أَبِي،عَنِ ابْنِ أَبِي لَيْلَى،عَنْ عَطِيَّةَ،عَنْ أَبِي سَعِيدٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ:‏‏‏‏ أَوْ يَأْتِيَ بَعْضُ آيَاتِ رَبِّكَ سورة الأنعام آية 158،‏‏‏‏‏‏قَالَ:‏‏‏‏ طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَاهُ بَعْضُهُمْ وَلَمْ يَرْفَعْهُ.";
tirmizi.urdu = "نبی اکرم ﷺ نے آیت: «أو يأتي بعض آيات ربك» ”یا تیرے رب کی بعض نشانیاں آ جائیں“ (الانعام: ۱۵۸)،کے بارے میں فرمایا کہ اس سے مراد سورج کا پچھم سے نکلنا ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-بعض دوسرے لوگوں نے بھی اس حدیث کو روایت کیا،لیکن انہوں نے اسے مرفوع نہیں کیا۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;