var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ،حَدَّثَنَا أَبِي،عَنْ أَبِيهِ،عَنْ مُحَمَّدِ بْنِ إِسْحَاق،عَنْ أَبِي إِسْحَاق،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ يَوْمِ الْحَجِّ الْأَكْبَرِ؟ فَقَالَ:‏‏‏‏ يَوْمُ النَّحْرِ .";
tirmizi.urdu = "میں نے رسول اللہ ﷺ سے پوچھا: حج اکبر کا دن کون سا ہے؟ آپ نے فرمایا: ”نحر (قربانی) کا دن ہے“ ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;