var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،عَنْ إِسْرَائِيلَ،عَنْ عَامِرِ بْنِ شَقِيقٍ،عَنْ أَبِي وَائِلٍ،عَنْ عُثْمَانَ بْنِ عَفَّانَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخَلِّلُ لِحْيَتَهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم صلی الله علیہ وسلم اپنی داڑھی میں خلال کرتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 409`;