var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ الْبَرَاءِ بْنِ عَازِبٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي الْعِشَاءِ الْآخِرَةِ بِ التِّينِ وَالزَّيْتُونِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم صلی الله علیہ وسلم نے عشاء میں سورۃ «والتين والزيتون» پڑھی۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;