var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ،عَنْ مَالِكِ بْنِ مِغْوَلٍ،عَنْ جُنَيْدٍ،عَنِ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لِجَهَنَّمَ سَبْعَةُ أَبْوَابٍ بَابٌ مِنْهَا لِمَنْ سَلَّ السَّيْفَ عَلَى أُمَّتِي أَوْ قَالَ عَلَى أُمَّةِ مُحَمَّدٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مَالِكِ بْنِ مِغْوَلٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جہنم کے سات دروازے ہیں،ان میں سے ایک دروازہ ان لوگوں کے لیے ہے جو میری امت یا امت محمدیہ پر تلوار اٹھائیں“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-ہم اسے صرف مالک بن مغول کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>قال أبو حاتم الرازي: ’’ جنید عن ابن عمر: مرسل ‘‘(الجرح والتعدیل 527/2)`;
tirmizi.anwaar = [281,2];