var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ،عَنِ ابْنِ أَبِي ذِئْبٍ،عَنْ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْحَمْدُ لِلَّهِ أُمُّ الْقُرْآنِ وَأُمُّ الْكِتَابِ وَالسَّبْعُ الْمَثَانِي،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”سورۃ الحمدللہ (فاتحہ)،ام القرآن ہے،ام الکتاب (قرآن کی اصل اساس ہے) اور «السبع المثانی» ہے (باربار دہرائی جانے والی آیتیں) ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;