var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكٌ،عَنْ أَبِي نُعَيْمٍ وَهْبِ بْنِ كَيْسَانَ،أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ،يَقُولُ:‏‏‏‏ مَنْ صَلَّى رَكْعَةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَلَمْ يُصَلِّ إِلَّا أَنْ يَكُونَ وَرَاءَ الْإِمَامِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "جس نے کوئی رکعت ایسی پڑھی جس میں سورۃ فاتحہ نہیں پڑھی تو اس نے نماز ہی نہیں پڑھی،سوائے اس کے کہ وہ امام کے پیچھے ہو ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;