var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،حَدَّثَنَا أَبُو تُمَيْلَةَ،عَنِ الزُّبَيْرِ بْنِ جُنَادَةَ،عَنْ ابْنِ بُرَيْدَةَ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَمَّا انْتَهَيْنَا إِلَى بَيْتِ الْمَقْدِسِ،‏‏‏‏‏‏قَالَ جِبْرِيلُ:‏‏‏‏ بِإِصْبَعِهِ فَخَرَقَ بِهِ الْحَجَرَ وَشَدَّ بِهِ الْبُرَاقَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ’’(معراج کی رات) جب ہم بیت المقدس پہنچے تو جبرائیل علیہ السلام نے اپنی انگلی کے اشارے سے پتھر میں شگاف کر دیا اور براق کو اس سے باندھ دیا۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5921`;