var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا جَرِيرٌ،عَنْ قَابُوسَ بْنِ أَبِي ظَبْيَانَ،عَنْ أَبِيهِ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ ثُمَّ أُمِرَ بِالْهِجْرَةِ فَنَزَلَتْ عَلَيْهِ:‏‏‏‏ وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا سورة الإسراء آية 80،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ مکہ میں تھے،پھر آپ کو ہجرت کا حکم ملا،اسی موقع پر آیت: «وقل رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانا نصيرا» ”دعا کر،اے میرے رب! مجھے اچھی جگہ پہنچا اور مجھے اچھی طرح نکال،اور اپنی طرف سے مجھے قوی مددگار مہیا فرما“ (بنی اسرائیل: ۸۰)،نازل ہوئی۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>قابوس: ضعیف`;
tirmizi.anwaar = [282,1];