var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّكُمْ مَحْشُورُونَ رِجَالًا وَرُكْبَانًا وَيُجَرُّونَ عَلَى وُجُوهِهِمْ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تم (قیامت میں) جمع کئے جاؤ گے: کچھ لوگ پیدل ہوں گے،کچھ لوگ سواری پر،اور کچھ لوگ اپنے منہ کے بل گھسیٹ کر اکٹھا کئے جائیں گے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;