var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَليٍّ،حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ،حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَبَّاسِ الْهَمْدَانِيُّ،عَنْ أَبِي إِسْحَاق،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،عَنْ أُبَيِّ بْنِ كَعْبٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ الْغُلَامُ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ يَوْمَ طُبِعَ كَافِرًا،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”وہ لڑکا جسے خضر علیہ السلام نے مار ڈالا تھا پیدائشی کافر تھا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;