var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ فُضَيْلٍ الْجَزَرِيُّ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا صَفْوَانُ بْنُ صَالِحٍ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ يَزِيدَ بْنِ يُوسُفَ الصَّنْعَانِيِّ،عَنْ مَكْحُولٍ،عَنْ أُمِّ الدَّرْدَاءِ،عَنْ أَبِي الدَّرْدَاءِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فِي قَوْلِهِ:‏‏‏‏ وَكَانَ تَحْتَهُ كَنْزٌ لَهُمَا سورة الكهف آية 82،‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَهَبٌ وَفِضَّةٌ .";
tirmizi.urdu = "نبی اکرم ﷺ نے اللہ تعالیٰ کے قول «وكان تحته كنز لهما» ”ان دونوں یتیم بچوں کا خزانہ ان کی اس دیوار کے نیچے دفن تھا“ (الکہف: ۸۲)،کے بارے میں فرمایا: ”کنز سے مراد سونا چاندی ہے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>یزید بن یوسف: ضعیف (تقریب: 7794)`;
tirmizi.anwaar = [283,1];