var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،حَدَّثَنَا شُعْبَةُ،عَنِ السُّدِّيِّ،عَنْ مُرَّةَ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،وَإِنْ مِنْكُمْ إِلا وَارِدُهَا سورة مريم آية 71،‏‏‏‏‏‏قَالَ:‏‏‏‏ يَرِدُونَهَا ثُمَّ يَصْدُرُونَ بِأَعْمَالِهِمْ .";
tirmizi.urdu = "عبداللہ بن مسعود رضی الله عنہ نے «وإن منكم إلا واردها» کے تعلق سے فرمایا: ”لوگ جہنم میں جائیں گے پھر اپنے اعمال (صالحہ) کے ذریعہ نکل آئیں گے“۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;