var tirmizi = {};
tirmizi.arabic = "وَقَدْ رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ مَنْ بَنَى لِلَّهِ مَسْجِدًا صَغِيرًا كَانَ أَوْ كَبِيرًا بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ . حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ،حَدَّثَنَا نُوحُ بْنُ قَيْسٍ،عَنْ عَبْدِ الرَّحْمَنِ مَوْلَى قَيْسٍ،‏‏‏‏‏‏عَنْ زِيَادٍ النُّمَيْرِيِّ،عَنْ أَنَسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جس نے اللہ کے لیے کوئی مسجد بنائی،چھوٹی ہو یا بڑی،اللہ اس کے لیے جنت میں ایک گھر بنائے گا“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>زیاد بن عبداللہ النمیري: ضعیف (تقریب: 2087) ضعفہ الجمہور (مجمع الزوائد 10 / 388)<br>وعبد الرحمن مولی قیس: مجہول (تقریب: 4053)`;
tirmizi.anwaar = [198,1];