var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ،عَنِ الشَّعْبِيِّ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَوْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَاتِمًا شَيْئًا مِنَ الْوَحْيِ لَكَتَمَ هَذِهِ الْآيَةَ:‏‏‏‏ وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ سورة الأحزاب آية 37 الْآيَةَ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "اگر رسول اللہ ﷺ وحی میں سے کوئی چیز چھپا لینے والے ہوتے تو آیت «وإذ تقول للذي أنعم الله عليه وأنعمت عليه» کو چھپاتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;