var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ مَا كُنَّا نَدْعُو زَيْدَ بْنَ حَارِثَةَ إِلَّا زَيْدَ ابْنَ مُحَمَّدٍ،‏‏‏‏‏‏حَتَّى نَزَلَ الْقُرْآنُ:‏‏‏‏ ادْعُوهُمْ لآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ سورة الأحزاب آية 5 . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ہم زید بن حارثہ کو زید بن محمد کہہ کر ہی پکارتے تھے یہاں تک کہ قرآن میں یہ آیت نازل ہوئی: «ادعوهم لآبائهم هو أقسط عند الله» ”ایسے لوگوں کو ان کے اصلی باپوں کے ناموں کے ساتھ پکارو یہی اللہ کے نزدیک زیادہ منصفانہ بات ہے“ (الاحزاب: ۵)۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;