var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ قَزَعَةَ البَصْرِيُّ،حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ،عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ،عَنْ عَامِرٍ الشَّعْبِيّ،فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ:‏‏‏‏ مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ سورة الأحزاب آية 40،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا كَانَ لِيَعِيشَ لَهُ فِيكُمْ وَلَدٌ ذَكَرٌ.";
tirmizi.urdu = "عامر شعبی اللہ کے اس قول «ما كان محمد أبا أحد من رجالكم» ’’(لوگو!) تمہارے مردوں میں سے کسی کے باپ محمد ( ﷺ ) نہیں“ (الاحزاب: ۴۰)،کے بارے میں کہتے ہیں: اس سے مراد زندہ نہ رہنے والی نرینہ اولاد ہے ۱؎۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;