var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ زُهَيْرِ بْنِ مُحَمَّدٍ،عَنْ رَجُلٍ،عَنْ أَبِي الْعَالِيَةِ،عَنْ أُبَيِّ بْنِ كَعْبٍ،قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِ اللَّهِ تَعَالَى:‏‏‏‏ وَأَرْسَلْنَاهُ إِلَى مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ سورة الصافات آية 147 قَالَ:‏‏‏‏ عِشْرُونَ أَلْفًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ سے آیت کریمہ: «وأرسلناه إلى مائة ألف أو يزيدون» ”ہم نے انہیں (یعنی یونس کو) ایک لاکھ بلکہ اس سے کچھ زیادہ کی طرف بھیجا“ (الصافات: ۷۷)،کے بارے میں پوچھا تو آپ نے فرمایا: ”ایک لاکھ بیس ہزار تھے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>رجل: مجہول`;
tirmizi.anwaar = [286,1];