var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الْعَقَدِيُّ،حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ سَامٌ أَبُو الْعَرَبِ،‏‏‏‏‏‏وَحَامٌ أَبُو الْحَبَشِ،‏‏‏‏‏‏وَيَافِثُ أَبُو الروم .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ’’«سام» «ابوالعرب» (عربوں کے باپ) ہیں اور «حام» «ابوالحبش» (اہل حبشہ کے باپ) ہیں اور «یافث» «ابوالروم» (رومیوں کے باپ) ہیں“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `ضعیف <br>انظر الحدیث الآتي (3931)<br>قتادۃ عنعن <br>وللحدیث شاہدان ضعیفان عند الطبراني فی الکبیر (254/7،146/18)`;
tirmizi.anwaar = [286,1];