var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ،عَنْ عَبِيدَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَجُّبًا وَتَصْدِيقًا. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "پس نبی اکرم ﷺ تعجب سے اور (اس کی باتوں کی) تصدیق میں ہنس پڑے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "بخاری ومسلم";
tirmizi.description = ``;