var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ،عَنْ قَزَعَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ،‏‏‏‏‏‏مَسْجِدِ الْحَرَامِ،‏‏‏‏‏‏وَمَسْجِدِي هَذَا،‏‏‏‏‏‏وَمَسْجِدِ الْأَقْصَى . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تین مساجد کے سوا کسی اور جگہ کے لیے سفر نہ کیا جائے،۱-مسجد الحرام کے لیے،۲-میری اس مسجد (مسجد نبوی) کے لیے،۳-مسجد الاقصیٰ کے لیے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;