var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،وَابْنُ أَبِي رِزْمَةَ،وأبو نعيم،عَنْ إِسْرَائِيلَ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ مَا كَذَبَ الْفُؤَادُ مَا رَأَى سورة النجم آية 11،‏‏‏‏‏‏قَالَ:‏‏‏‏ رَآهُ بِقَلْبِهِ . قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "انہوں نے آیت «ما كذب الفؤاد ما رأى» ”جو کچھ انہوں نے دیکھا اسے دل نے جھٹلایا نہیں (بلکہ اس کی تصدیق کی)‘‘ (النجم: ۱۱)،پڑھی،کہا: نبی اکرم ﷺ نے اپنے رب کو دل کی آنکھ سے دیکھا۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;