var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ،عَنْ ابْنِ أَبِي نَجِيحٍ،عَنْ مُجَاهِدٍ،عَنْ أَبِي مَعْمَرٍ،عَنِ ابْنِ مَسْعُودٍ،قَالَ:‏‏‏‏ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَقَالَ لَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اشْهَدُوا . قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ کے زمانہ میں چاند دو ٹکڑے ہو تو نبی اکرم ﷺ نے ہم سے فرمایا: ”تم سب گواہ رہو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;