var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ،عَنْ شُعْبَةَ،عَنِ الْأَعْمَشِ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ انْفَلَقَ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اشْهَدُوا . قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ کے زمانے میں چاند دو ٹکڑے ہوا تو رسول اللہ ﷺ نے فرمایا: ”تم سب گواہ رہو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;