var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،أَخْبَرَنَا عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللهِ بْنِ سَعْدٍ الرّازِي،أن أباه أخبره،‏‏‏‏‏‏عن أبيه،قَالَ:‏‏‏‏ رَأَيْتُ رَجُلًا بِبُخَارَى عَلَى بَغْلَةٍ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ وَيَقُولُ:‏‏‏‏ كَسَانِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .";
tirmizi.urdu = "ان کے باب عبداللہ نے ان کو خبر دی،انہوں نے کہا: میں نے ایک شخص کو بخارا میں خچر پر سوار سر پر سیاہ عمامہ باندھے ہوئے دیکھا وہ کہتا تھا: یہ وہ عمامہ ہے جسے رسول اللہ ﷺ نے مجھے پہنایا ہے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (4038)`;
tirmizi.anwaar = [289,1];