var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ دُرُسْتَ بَصْرِيُّ،‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ حَمَّادٌ:‏‏‏‏ هُوَ عِنْدَنَا مَرْفُوعٌ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ سورة المطففين آية 6 قَالَ:‏‏‏‏ يَقُومُونَ فِي الرَّشْحِ إِلَى أَنْصَافِ آذَانِهِمْ .";
tirmizi.urdu = "وہ آیت «يوم يقوم الناس لرب العالمين» ”جس دن لوگ رب العالمین کے سامنے کھڑے ہوں گے“ (المطففین: ۶)،کی تفسیر میں کہتے ہیں کہ لوگ آدھے کانوں تک پسینے میں شرابور ہوں گے۔حماد کہتے ہیں: یہ حدیث ہمارے نزدیک مرفوع ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;