var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْهَمَذَانِيُّ،حَدَّثَنَا عَلِيُّ بْنُ أَبِي بَكْرٍ،عَنْ هَمَّامٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ حُوسِبَ عُذِّبَ . قال:‏‏‏‏ هذا حديث غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ قَتَادَةَ،‏‏‏‏‏‏عَنْ أَنَسٍ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا کہ جس کا حساب ہوا (یوں سمجھو کہ) وہ عذاب میں پڑا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-ہم اسے قتادہ کی روایت سے جسے وہ انس سے،اور انس رضی الله عنہ نبی اکرم ﷺ سے روایت کرتے ہیں صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;