var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنِ ابْنِ لَهِيعَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ،عَنْ أَبَانَ بْنِ صَالِحٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ الدُّعَاءُ مُخُّ الْعِبَادَةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”دعا عبادت کا مغز (حاصل و نچوڑ) ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے،ہم اسے صرف ابن لہیعہ کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>الولیدبن مسلم و ابن لہیعۃ عنعنا`;
tirmizi.anwaar = [291,1];