var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَرْزُوقٍ،حَدَّثَنَا عُبَيْدُ بْنُ وَاقِدٍ،حَدَّثَنَا سَعِيدُ بْنُ عَطِيَّةَ اللَّيْثِيُّ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ سَرَّهُ أَنْ يَسْتَجِيبَ اللَّهُ لَهُ عِنْدَ الشَّدَائِدِ وَالْكَرْبِ فَلْيُكْثِرِ الدُّعَاءَ فِي الرَّخَاءِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جسے اچھا لگے (اور پسند آئے) کہ مصائب و مشکلات (اور تکلیف دہ حالات) میں اللہ اس کی دعائیں قبول کرے،تو اسے کشادگی و فراخی کی حالت میں کثرت سے دعائیں مانگتے رہنا چاہیئے“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 2240`;