var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ،حَدَّثَنَا أَبُو قَطَنٍ،عَنْ حَمْزَةَ الزَّيَّاتِ،عَنْ أَبِي إِسْحَاق،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،عَنْ أُبَيِّ بْنِ كَعْبٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ إِذَا ذَكَرَ أَحَدًا فَدَعَا لَهُ بَدَأَ بِنَفْسِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو قَطَنٍ اسْمُهُ عَمْرُو بْنُ الْهَيْثَمِ.";
tirmizi.urdu = "جب رسول اللہ ﷺ کسی کو یاد کر کے اس کے لیے دعا کرتے،تو پہلے اپنے لیے دعا کرتے پھر اس کے لیے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 2258`;