var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا بَقِيَّةُ بْنُ الْوَلِيدِ،عَنْ بَحِيرِ بْنِ سَعْدٍ،عَنْ خَالِدِ بْنِ مَعْدَانَ،عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بِلَالٍ،عَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ لَا يَنَامُ حَتَّى يَقْرَأَ الْمُسَبِّحَاتِ،‏‏‏‏‏‏وَيَقُولُ فِيهَا آيَةٌ خَيْرٌ مِنْ أَلْفِ آيَةٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ جب تک «مسبحات» ۱؎ پڑھ نہ لیتے سوتے نہ تھے ۲؎،آپ فرماتے تھے: ”ان میں ایک ایسی آیت ہے جو ہزار آیتوں سے بہتر ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;