var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،حَدَّثَنَا أَزْهَرُ السَّمَّانُ،عَنِ ابْنِ عَوْنٍ،عَنْ مُحَمَّدٍ،عَنْ عَبِيدَةَ،عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَتْ فَاطِمَةُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَشْكُو مَجَلًا بِيَدَيْهَا فَأَمَرَهَا بِالتَّسْبِيحِ وَالتَّكْبِيرِ وَالتَّحْمِيدِ .";
tirmizi.urdu = "(آپ کی بیٹی) فاطمہ رضی الله عنہا نبی اکرم ﷺ کے پاس اپنے ہاتھوں میں آبلے پڑ جانے کی شکایت کرنے آئیں تو آپ نے انہیں تسبیح (سبحان اللہ) تکبیر (اللہ اکبر) اور تحمید (الحمدللہ) پڑھنے کا حکم دیا۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;