var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ،حَدَّثَنَا عَثَّامُ بْنُ عَلِيٍّ،عَنِ الْأَعْمَشِ،عَنْ عَطَاءِ بْنِ السَّائِبِ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا،‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُ التَّسْبِيحَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ الْأَعْمَشِ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو تسبیح (سبحان اللہ) انگلیوں پر گنتے ہوئے دیکھا ہے۔امام ترمذی کہتے ہیں: یہ حدیث اعمش کی روایت سے حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `ولہ شاھد حسن عند أحمد (2/ 205 ح 6910) من حدیث شعبۃ عن عطاء بن السائب والنسائی (1349) وابی داود (5065) والترمذی (3410) وابن ماجہ (926) وابن حبان (2018) وسندہ حسن۔`;