var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،‏‏‏‏‏‏حَدَّثَنَا مَسْلَمَةُ بْنُ عَمْرٍو،‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ عُمَيْرُ بْنُ هَانِئٍ يُصَلِّي كُلَّ يَوْمٍ أَلْفَ سَجْدَةٍ،‏‏‏‏‏‏وَيُسَبِّحُ مِائَةَ أَلْفِ تَسْبِيحَة.";
tirmizi.urdu = "عمیر بن ہانی ۱؎ ہر دن ہزار رکعتیں نمازیں پڑھتے تھے،اور سو ہزار (یعنی ایک لاکھ) تسبیحات پڑھتے تھے،یعنی سبحان اللہ کہتے تھے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>مسلمۃ بن عمرو: مجہول (تقریب: 6663)`;
tirmizi.anwaar = [293,1];