var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ الْمُغِيرَةِ الْمَخْزُومِيُّ الْمَدَنِيُّ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ،عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ،عَنِ الْمَقْبُرِيِّ،عَنْ أَبِي هُرَيْرَةَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ إِذَا أَهَمَّهُ الْأَمْرُ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ سُبْحَانَ اللَّهِ الْعَظِيمِ،‏‏‏‏‏‏وَإِذَا اجْتَهَدَ فِي الدُّعَاءِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا حَيُّ يَا قَيُّومُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ جب کسی مشکل معاملے سے دوچار ہوتے تو اپنا سر آسمان کی طرف اٹھاتے پھر کہتے: «سبحان الله العظيم» ”اللہ پاک و برتر ہے“ اور جب جی جان لگا کر دعا کرتے تو کہتے: «يا حي يا قيوم» ”اے زندہ ذات! اے کائنات کا نظام چلانے والے“۔امام ترمذی کہتے ہیں: یہ حدیث غریب۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا<br>إبراہیم بن الفضل: متروک`;
tirmizi.anwaar = [294,1];