var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا أَبُو عَاصِمٍ،حَدَّثَنَا الْحَجَّاجُ الصَّوَّافُ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي جَعْفَرٍ،عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ثَلَاثُ دَعَوَاتٍ مُسْتَجَابَاتٌ:‏‏‏‏ دَعْوَةُ الْمَظْلُومِ،‏‏‏‏‏‏وَدَعْوَةُ الْمُسَافِرِ،‏‏‏‏‏‏وَدَعْوَةُ الْوَالِدِ عَلَى وَلَدِهِ،‏‏‏‏";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تین طرح کی دعائیں مقبول ہوتی ہیں: مظلوم کی دعا،مسافر کی دعا،اور باپ کی بد دعا اپنے بیٹے کے حق میں“۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;