var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ،عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،عَنْ أَبِي مَطَرٍ،عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ،عَنْ أَبِيهِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ إِذَا سَمِعَ صَوْتَ الرَّعْدِ وَالصَّوَاعِقِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ لَا تَقْتُلْنَا بِغَضَبِكَ،‏‏‏‏‏‏وَلَا تُهْلِكْنَا بِعَذَابِكَ وَعَافِنَا قَبْلَ ذَلِكَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ جب بجلی کی گرج اور کڑک سنتے تو فرماتے: «اللهم لا تقتلنا بغضبك ولا تهلكنا بعذابك وعافنا قبل ذلك» ”اے اللہ! تو اپنے غضب سے ہمیں نہ مار،اپنے عذاب کے ذریعہ ہمیں ہلاک نہ کر،اور ایسے برے وقت کے آنے سے پہلے ہمیں بخش دے“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>حجاج ضعیفوسقط ذکرہ من عمل الیوم واللیلۃ للنسائي (927) !`;
tirmizi.anwaar = [294,1];