var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،وَأَبُو خَالِدٍ الْأَحْمَرُ،عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،عَنْ رِيَاحِ بْنِ عَبِيدَةَ،قَالَ حَفْصٌ:‏‏‏‏ عَنْ ابْنِ أَخِي أَبِي سَعِيدٍ،وَقَالَ أَبُو خَالِدٍ،‏‏‏‏‏‏عَنْ مَوْلًى لِأَبِي سَعِيدٍ،‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ .";
tirmizi.urdu = "نبی اکرم ﷺ جب کھا پی چکتے تو کہتے: «الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين» ”سب تعریفیں اس اللہ کے لیے ہیں جس نے ہمیں کھلایا پلایا اور ہمیں مسلمان بنایا“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (3283)<br>مولی لأبي سعید:مجہول <br>وللحدیث شواہد ضعیفۃ`;
tirmizi.anwaar = [295,1];