var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا الْمُقْرِئُ،حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ،عَنْ زَيْدِ بْنِ جَبِيرَةَ،عَنْ دَاوُدَ بْنِ الْحُصَيْنِ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى أَنْ يُصَلَّى فِي سَبْعَةِ مَوَاطِنَ:‏‏‏‏ فِي الْمَزْبَلَةِ،‏‏‏‏‏‏وَالْمَجْزَرَةِ،‏‏‏‏‏‏وَالْمَقْبَرَةِ،‏‏‏‏‏‏وَقَارِعَةِ الطَّرِيقِ،‏‏‏‏‏‏وَفِي الْحَمَّامِ،‏‏‏‏‏‏وَفِي مَعَاطِنِ الْإِبِلِ،‏‏‏‏‏‏وَفَوْقَ ظَهْرِ بَيْتِ اللَّهِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے سات مقامات میں نماز پڑھنے سے منع فرمایا ہے: کوڑا کرکٹ ڈالنے کی جگہ میں،مذبح میں،قبرستان میں،عام راستوں پر،حمام (غسل خانہ) میں اونٹ باندھنے کی جگہ میں اور بیت اللہ کی چھت پر۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `ضعیف<br>ابن ماجہ (746)<br>زید بن جبیرۃ متروک (تقریب: 2122) وحدث عن داود بن الحصین بحدیث منکر جدًا<br>وللحدیث شاھد ضعیف عند ابن ماجہ (747)`;
tirmizi.anwaar = [198,1];