var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ،عَنْ حَجَّاجٍ الصَّوَّافِ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ قَالَ:‏‏‏‏ سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ،‏‏‏‏‏‏غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي الزُّبَيْرِ،‏‏‏‏‏‏عَنْ جَابِرٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جس نے: «سبحان الله العظيم وبحمده» کہا،اس کے لیے جنت میں کھجور کا ایک درخت لگا دیا جائے گا“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب صحیح ہے،۲-اور ہم اسے صرف ابوالزبیر کی روایت سے جسے وہ جابر کے واسطے سے روایت کرتے ہیں جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `[3464۔3465] إسنادہ ضعیف<br>أبو الزبیر مدلس وعنعن <br>وللحدیث شواھد ضعیفۃ عند أحمد (3/ 440) وغیرہ`;
tirmizi.anwaar = [295,1];