var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ،حَدَّثَنَا الْمُؤَمِّلُ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ قَالَ:‏‏‏‏ سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جو شخص: «سبحان الله العظيم وبحمده» کہے گا اس کے لیے جنت میں کھجور کا ایک درخت لگایا جائے گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `۔3465] إسنادہ ضعیف<br>أبو الزبیر مدلس وعنعن <br>وللحدیث شواھد ضعیفۃ عند أحمد (3/ 440) وغیرہ`;
tirmizi.anwaar = [295,1];