var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ،حَدَّثَنَا الْمُحَارِبِيُّ،عَنْ مَالِكِ بْنِ أَنَسٍ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ قَالَ:‏‏‏‏ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ غُفِرَتْ لَهُ ذُنُوبُهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو شخص سو بار: «سبحان الله وبحمده» کہے گا اس کے گناہ بخش دیئے جائیں گے اگرچہ وہ سمندر کی جھاگ کی طرح ہوں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;