var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ،عَنْ هِشَامٍ،عَنْ ابْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَلُّوا فِي مَرَابِضِ الْغَنَمِ وَلَا تُصَلُّوا فِي أَعْطَانِ الْإِبِلِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”بکریوں کے باڑے میں نماز پڑھو ۱؎ اور اونٹ باندھنے کی جگہ میں نہ پڑھو“۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 739`;