var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،‏‏‏‏‏‏حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ عَنْ هِشَامِ بْنِ حَسَّانَ،‏‏‏‏‏‏عَنْ الْحَسَنِ فِي قَوْلِهِ:‏‏‏‏ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً سورة البقرة آية 201،‏‏‏‏‏‏قَالَ:‏‏‏‏ فِي الدُّنْيَا الْعِلْمُ وَالْعِبَادَةُ،‏‏‏‏‏‏وَفِي الْآخِرَةِ الْجَنَّةُ.";
tirmizi.urdu = "اللہ تعالیٰ کی اس آیت: «ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة» کے بارے میں حسن سے مروی ہے،دنیا میں «حسنہ» سے مراد علم اور عبادت ہے،اور آخرت میں «حسنہ» سے مراد جنت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ھشام بن حسان عنعن <br>ولکن مفہوم الحدیث صحیح بأدلۃ أخری`;
tirmizi.anwaar = [296,1];