var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ،حَدَّثَنَا عَبْدَةُ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏يَقُولُ عِنْدَ وَفَاتِهِ:‏‏‏‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الْأَعْلَى . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو آپ کی وفات کے وقت (یہ دعا) پڑھتے ہوئے سنا ہے: «اللهم اغفر لي وارحمني وألحقني بالرفيق الأعلى» ”اے اللہ! بخش دے مجھ کو اور رحم فرما مجھ پر اور مجھ کو رفیق اعلیٰ (انبیاء و ملائکہ) سے ملا دے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;