var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،عَنْ شُعْبَةَ،عَنْ أَبِي التَّيَّاحِ الضُّبَعِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي فِي مَرَابِضِ الْغَنَمِ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو التَّيَّاحِ الضُّبَعِيُّ اسْمُهُ:‏‏‏‏ يَزِيدُ بْنُ حُمَيْدٍ.";
tirmizi.urdu = "نبی اکرم ﷺ بکریوں کے باڑے میں نماز پڑھتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;