var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ حَمَّادٍ الْبَصْرِيُّ،حَدَّثَنَا عَبْدُ الْأَعْلَى،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَبِي رَافِعٍ،عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً غَيْرَ وَاحِدٍ مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اللہ تعالیٰ کے ننانوے ۱؎ نام ہیں،سو میں ایک کم،جو انہیں یاد رکھے وہ جنت میں داخل ہو گا“ ۲؎۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;