var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُكْتِبُ،حَدَّثَنَا أَبُو بَدْرٍ شُجَاعُ بْنُ الْوَلِيدِ،عَنْ الرُّحَيْلِ بْنِ مُعَاوِيَةَ أَخِي زُهَيْرِ بْنِ مُعَاوِيَةَ،عَنِ الرَّقَاشِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَرَبَهُ أَمْرٌ قَالَ:‏‏‏‏ يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ .";
tirmizi.urdu = "نبی اکرم ﷺ کو جب کوئی کام سخت تکلیف و پریشانی میں ڈال دیتا تو آپ یہ دعا پڑھتے: «يا حي يا قيوم برحمتك أستغيث» ”اے زندہ اور ہمیشہ رہنے والے! تیری رحمت کے وسیلے سے تیری مدد چاہتا ہوں“۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;