var tirmizi = {};
tirmizi.arabic = "وَرُوِي عَنْ ابْنِ عُمَرَ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتِ الصَّلَاةُ فَابْدَءُوا بِالْعَشَاءِ قَالَ:‏‏‏‏ وَتَعَشَّى ابْنُ عُمَرَ وَهُوَ يَسْمَعُ قِرَاءَةَ الْإِمَامِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بِذَلِكَ هَنَّادٌ،حَدَّثَنَا عَبْدَةُ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جب شام کا کھانا (تمہارے سامنے) رکھ دیا جائے اور نماز کھڑی ہو جائے تو پہلے کھانا کھاؤ“،ابن عمر رضی الله عنہما شام کا کھانا کھا رہے تھے اور امام کی قرأت سن رہے تھے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;