var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنِ ابْنِ عَجْلَانَ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ اللَّهَ حِينَ خَلَقَ الْخَلْقَ كَتَبَ بِيَدِهِ عَلَى نَفْسِهِ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جب اللہ نے مخلوق کو پیدا کیا تو اس نے اپنے آپ سے اپنی ذات پر لکھ دیا (یعنی اپنے آپ پر فرض کر لیا) کہ میری رحمت میرے غضب (غصہ) پر غالب رہے گی“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;