var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْقُرَشِيِّ الْمُلَيْكِيِّ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ فُتِحَ لَهُ مِنْكُمْ بَابُ الدُّعَاءِ فُتِحَتْ لَهُ أَبْوَابُ الرَّحْمَةِ،‏‏‏‏‏‏وَمَا سُئِلَ اللَّهُ شَيْئًا يَعْنِي أَحَبَّ إِلَيْهِ مِنْ أَنْ يُسْأَلَ الْعَافِيَةَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تم میں سے جس کسی کے لیے دعا کا دروازہ کھولا گیا تو اس کے لیے (گویا) رحمت کے دروازے کھول دیئے گئے،اور اللہ سے مانگی جانے والی چیزوں میں سے جسے وہ دے اس سے زیادہ کوئی چیز پسند نہیں کہ اس سے عافیت مانگی جائے“،";
tirmizi.hukam = "ضعیف";
tirmizi.description = `ضعیف <br>انظر الحدیث السابق (3515)`;
tirmizi.anwaar = [299,1];