var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ أَبِي حَمْزَةَ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ دَعَا عَلَى مَنْ ظَلَمَهُ فَقَدِ انْتَصَرَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي حَمْزَةَ،‏‏‏‏‏‏وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي أَبِي حَمْزَةَ مِنْ قِبَلِ حِفْظِهِ،‏‏‏‏‏‏وَهُوَ مَيْمُونٌ الْأَعْوَرُ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے اپنے اوپر ظلم کرنے والے کے خلاف بد دعا کی تو اس نے اس سے بدلہ لے لیا“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-ہم اسے حمزہ کی روایت سے جانتے ہیں اور حمزہ کے بارے میں بعض اہل علم نے ان کے حافظہ کے تعلق سے کلام کیا ہے،اور یہ میمون الاعور ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو حمزۃ میمون: ضعیف`;
tirmizi.anwaar = [299,1];