var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى،حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ،عَنِ الْقَعْقَاعِ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَجُلًا كَانَ يَدْعُو بِإِصْبَعَيْهِ،‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَحِّدْ أَحِّدْ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏وَمَعْنَى هَذَا الْحَدِيثِ:‏‏‏‏ إِذَا أَشَارَ الرَّجُلُ بِإِصْبَعَيْهِ فِي الدُّعَاءِ عِنْدَ الشَّهَادَةِ لَا يُشِيرُ إِلَّا بِإِصْبَعٍ وَاحِدَةٍ.";
tirmizi.urdu = "ایک شخص اپنی دو انگلیوں کے اشارے سے دعا کرتا تھا تو آپ نے اس سے کہا: ”ایک سے ایک سے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-یہی اس حدیث کا مفہوم یہ ہے کہ آدمی تشہد میں انگلیوں سے اشارہ کرتے وقت صرف ایک انگلی سے اشارہ کرے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>نسائي (1273)<br>محمد بن عجلان عنعن <br>وللحدیث شواھد ضعیفۃ`;
tirmizi.anwaar = [299,1];