var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا أَبِي،عَنْ سُفْيَانَ،عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ،عَنْ سَالِمٍ،عَنِ ابْنِ عُمَرَ،عَنْ عُمَرَ أَنَّهُ اسْتَأْذَنَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعُمْرَةِ،‏‏‏‏ فَقَالَ:‏‏‏‏ أَيْ أُخَيَّ أَشْرِكْنَا فِي دُعَائِكَ وَلَا تَنْسَنَا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "انہوں نے نبی اکرم ﷺ سے عمرہ کرنے کی اجازت مانگی تو آپ نے (اجازت دیتے ہوئے) کہا: ”اے میرے بھائی! اپنی دعا میں ہمیں بھی شریک رکھنا،بھولنا نہیں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (1498) ابن ماجہ (2894)`;
tirmizi.anwaar = [300,1];