var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،وَزَيْدُ بْنُ حُبَابٍ،‏‏‏‏ عَنْ مُوسَى بْنِ عُبَيْدَةَ،عَنْ مُحَمَّدِ بْنِ ثَابِتٍ،عَنْ أَبِي حَكِيمٍ خَطْمِيٌ مَوْلَى الزُّبَيْرِ،‏‏‏‏ عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا مِنْ صَبَاحٍ يُصْبِحُ الْعَبْدُ فِيهِ إِلَّا وَمُنَادٍ يُنَادِي:‏‏‏‏ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”کوئی صبح ایسی نہیں ہے کہ اللہ کے بندے صبح کرتے ہوں اور اس صبح میں کوئی پکار کر کہنے والا یہ نہ کہتا ہو کہ «سبحان الملك القدوس» کی تسبیح پڑھا کرو۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>موسی بن عبیدۃ: ضعیف،وشیخہ محمد بن ثابت: مجہول (تقریب: 5772)`;
tirmizi.anwaar = [300,1];