var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،أَخْبَرَنِي أَبِي،عَنِ الْمُثَنَّى بْنِ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا غَزَا قَالَ:‏‏‏‏ اللَّهُمَّ أَنْتَ عَضُدِي،‏‏‏‏ وَأَنْتَ نَصِيرِي،‏‏‏‏ وَبِكَ أُقَاتِلُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏وَمَعْنَى قَوْلِهِ:‏‏‏‏ عَضُدِي يَعْنِي عَوْنِي.";
tirmizi.urdu = "جب نبی اکرم ﷺ جہاد کرتے (لڑتے) تو یہ دعا پڑھتے: «اللهم أنت عضدي وأنت نصيري وبك أقاتل» ”اے اللہ! تو میرا بازو ہے،تو ہی میرا مددگار ہے اور تیرے ہی سہارے میں لڑتا ہوں“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے ۲-اور «عضدی» کے معنی ہیں تو میرا مددگار ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنن أبي داود (2632)`;
tirmizi.anwaar = [300,1];