var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ هِشَامٍ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قُبِضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ خَمْسٍ وَسِتِّينَ سَنَةً . قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَكَذَا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏‏‏وَرَوَى عَنْهُ مُحَمَّدُ بْنُ إِسْمَاعِيل مِثْلَ ذَلِكَ.";
tirmizi.urdu = "نبی اکرم ﷺ کی وفات ہوئی تو آپ پینسٹھ (۶۵) سال کے تھے ۱؎۔امام ترمذی کہتے ہیں: اسی طرح سے ہم سے محمد بن بشار نے بیان کیا ہے اور ان سے محمد بن اسماعیل بخاری نے اسی کے مثل روایت کی ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `شاذ<br>ہشام بن حسان عنعن<br>والحدیث شاذ مخالف للروایات الصحیحۃ`;
tirmizi.anwaar = [303,1];