var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،وَمَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ قَالَا:‏‏‏‏ أَنْبَأَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ،حَدَّثَنَا سُلَيْمَانُ بْنُ مُعَاذٍ الضَّبِّيُّ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ بِمَكَّةَ حَجَرًا كَانَ يُسَلِّمُ عَلَيَّ لَيَالِيَ بُعِثْتُ إِنِّي لَأَعْرِفُهُ الْآنَ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مکہ میں ایک پتھر ہے جو مجھے ان راتوں میں جن میں میں مبعوث کیا گیا تھا سلام کیا کرتا تھا،اسے میں اب بھی پہچانتا ہوں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;