var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ،حَدَّثَنَا زُهَيْرٌ،عَنْ أَبِي إِسْحَاق،قَالَ:‏‏‏‏ سَأَلَ رَجُلٌ الْبَرَاءَ:‏‏‏‏ أَكَانَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ السَّيْفِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا مِثْلَ الْقَمَرِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ایک شخص نے براء سے پوچھا: کیا رسول اللہ ﷺ کا چہرہ مبارک تلوار کی طرح تھا؟ انہوں نے کہا: نہیں،بلکہ چاند کی مانند تھا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;