var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ،عَنْ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى،عَنْ ثُمَامَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعِيدُ الْكَلِمَةَ ثَلَاثًا لِتُعْقَلَ عَنْهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى.";
tirmizi.urdu = "رسول اللہ ﷺ (بسا اوقات) ایک کلمہ تین بار دہراتے تھے تاکہ اسے (اچھی طرح) سمجھ لیا جائے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے،ہم اسے صرف عبداللہ بن مثنیٰ کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;