var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ عُبَيْدِ اللَّهِ بْنِ الْمُغِيرَةِ،عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ،قَالَ:‏‏‏‏ مَا رَأَيْتُ أَحَدًا أَكْثَرَ تَبَسُّمًا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ سے بڑھ کر مسکرانے والا میں نے کسی کو نہیں دیکھا۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عبداللّٰہ بن لھیعۃ حدث بہ قبل اختلاطہ ولکنہ مدلس و عنعن فالسند ضعیف <br>والحدیث الآتي (الأصل: 3642) یغني عنہ`;
tirmizi.anwaar = [304,1];