var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَعْقُوبَ الطَّالَقَانِيُّ،حَدَّثَنَا أَيُّوبُ بْنُ جَابِرٍ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ:‏‏‏‏ كَانَ خَاتَمُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي الَّذِي بَيْنَ كَتِفَيْهِ غُدَّةً حَمْرَاءَ مِثْلَ بَيْضَةِ الْحَمَامَةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ کی مہر نبوت یعنی جو آپ کے دونوں شانوں کے درمیان تھی کبوتر کے انڈے کے مانند سرخ رنگ کی ایک گلٹی تھی۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `سندہ ضعیف <br>شمائل الترمذي (17)  <br>فیہ أیوب بن جابر ضعیف (سنن أبي داود: 247) <br>والحدیث صحیح دون قولہ: ’’ غدۃ حمراء ‘‘ انظر صحیح مسلم (2344)`;
tirmizi.anwaar = [304,1];