var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ،أَخْبَرَنَا الْحَجَّاجُ هُوَ ابْنُ أَرْطَاةَ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ:‏‏‏‏ كَانَ فِي سَاقَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُمُوشَةٌ وَكَانَ لَا يَضْحَكُ إِلَّا تَبَسُّمًا،‏‏‏‏‏‏وَكُنْتُ إِذَا نَظَرْتُ إِلَيْهِ قُلْتُ أَكْحَلُ الْعَيْنَيْنِ وَلَيْسَ بِأَكْحَلَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ صَحِيحٌ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ کی دونوں پنڈلیاں مناسب باریکی ۱؎ لیے ہوئے تھیں اور آپ کا ہنسنا صرف مسکرانا تھا،اور جب میں آپ کو دیکھتا تو کہتا کہ آپ آنکھوں میں سرمہ لگائے ہوئے ہیں،حالانکہ آپ سرمہ نہیں لگائے ہوتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>حجاج بن أرطاۃ: ضعیف مدلس و عنعن <br>وللحدیث شواہد غیر ’’حموشۃ‘‘`;
tirmizi.anwaar = [304,1];