var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا أَبُو قَطَنٍ،حَدَّثَنَا شُعْبَةُ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَلِيعَ الْفَمِ أَشْكَلَ الْعَيْنَيْنِ مَنْهُوشَ الْعَقِبِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ کا منہ مبارک کشادہ تھا،آپ کی آنکھ کے ڈورے سرخ تھے اور ایڑیاں کم گوشت والی تھیں۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;