var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،‏‏‏‏ قَالَا:‏‏‏‏ أَخْبَرَنَا إِسْمَاعِيل ابْنُ عُلَيَّةَ،عَنْ خَالِدٍ الْحَذَّاءِ،قَالَ:‏‏‏‏ حَدَّثَنِي عَمَّارٌ مَوْلَى بَنِي هَاشِمٍ،‏‏‏‏‏‏قَال:‏‏‏‏ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ:‏‏‏‏ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ خَمْسٍ وَسِتِّينَ .";
tirmizi.urdu = "رسول اللہ ﷺ کی وفات ہوئی تو آپ پینسٹھ (۶۵) سال کے تھے ۱؎۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;