var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ،حَدَّثَنَا خَالِدٌ الْحَذَّاءُ،حَدَّثَنَا عَمَّارٌ مَوْلَى بَنِي هَاشِمٍ،‏‏‏‏‏‏حَدَّثَنَا ابْنُ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُوُفِّيَ وَهُوَ ابْنُ خَمْسٍ وَسِتِّينَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنُ الْإِسْنَادِ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ کی وفات ہوئی تو آپ پینسٹھ (۶۵) سال کے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;