var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ،حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي أُوَيْسٍ،عَنْ سُلَيْمَانَ بْنِ بِلَالٍ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،عَنْ عُمَرَ بْنِ الْخَطَّابِ،قَالَ:‏‏‏‏ أَبُو بَكْرٍ سَيِّدُنَا وَخَيْرُنَا وَأَحَبُّنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "ابوبکر ہمارے سردار ہیں اور ہم میں سب سے بہتر ہیں اور وہ ہم میں رسول اللہ ﷺ کو سب سے زیادہ محبوب تھے۔امام ترمذی کہتے ہیں: یہ حدیث صحیح غریب ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = `مشکوۃ المصابیح: 6027`;