var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنُ سَعِيدٍ الْأُمَوِيُّ،حَدَّثَنَا وَكِيعٌ،عَنْ سَالِمٍ أَبِي الْعَلَاءِ الْمُرَادِيِّ،عَنْ عَمْرِو بْنِ هَرِمٍ،عَنْ رِبْعِيِّ بْنِ حِرَاشٍ،عَنْ حُذَيْفَةَ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ إِنِّي لَا أَدْرِي مَا بَقَائِي فِيكُمْ فَاقْتَدُوا بِاللَّذَيْنِ مِنْ بَعْدِي،‏‏‏‏ وَأَشَارَ إِلَى أَبِي بَكْرٍ،‏‏‏‏ وَعُمَرَ.";
tirmizi.urdu = "ہم لوگ نبی اکرم ﷺ کے پاس بیٹھے ہوئے تھے تو آپ نے فرمایا: ”میں نہیں جانتا کہ میں تمہارے درمیان کب تک رہوں گا،لہٰذا تم لوگ ان دونوں کی پیروی کرو جو میرے بعد ہوں گے اور آپ نے ابوبکر و عمر رضی الله عنہما کی جانب اشارہ کیا“۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 6230
وانظر مشکوۃ المصابیح (6061)`;