var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،قَالَ:‏‏‏‏ ذَكَرَ دَاوُدُ،‏‏‏‏ عَنِ الشَّعْبِيِّ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أَبُو بَكْرٍ وَعُمَرُ سَيِّدَا كُهُولِ أَهْلِ الْجَنَّةِ مِنَ الْأَوَّلِينَ وَالْآخِرِينَ مَا خَلَا النَّبِيِّينَ وَالْمُرْسَلِينَ،‏‏‏‏‏‏لَا تُخْبِرْهُمَا يَا عَلِيُّ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”ابوبکر و عمر جنت کے ادھیڑ عمر کے لوگوں کے سردار ہیں،خواہ وہ اگلے ہوں یا پچھلے،سوائے نبیوں اور رسولوں کے،لیکن علی! تم انہیں نہ بتانا“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>ابن ماجہ (95)<br>الحارث الأعور ضعیف،ضعفہ الجمھور <br>والحدیث السابق (الأصل: 3664) یغني عنہ <br>و للحدیث شواھد ضعیفۃ عند الدولابي (الکنی 2/ 99 ح 1683) وغیرہ <br>الدولابي ضعیف علی الراجح و عبداللّٰہ أبو محمد مولی بني ہاشم لم أعرفہ و إن وثقہ أحد الرواۃ۔!`;
tirmizi.anwaar = [305,1];