var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى الْقَطَّانُ الْبَغْدَادِيُّ،‏‏‏‏‏‏حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيل،عَنْ مَنْصُورِ بْنِ أَبِي الْأَسْوَدِ،حَدَّثَنِي كَثِيرٌ أَبُو إِسْمَاعِيل،عَنْ جُمَيْعِ بْنِ عُمَيْرٍ التَّيْمِيِّ،عَنْ ابْنِ عُمَرَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ:‏‏‏‏ أَنْتَ صَاحِبِي عَلَى الْحَوْضِ،‏‏‏‏ وَصَاحِبِي فِي الْغَارِ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے ابوبکر رضی الله عنہ سے فرمایا: ”تم حوض کوثر پر میرے رفیق ہو گے جیسا کہ غار میں میرے رفیق تھے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن،صحیح،غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>کثیر النواء: ضعیف (تقریب: 5605) وشیخہ: جمیع بن عمیر ضعیف (سنن أبي داود: 241)`;
tirmizi.anwaar = [305,1];