var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ،حَدَّثَنَا أَحْمَدُ بْنُ بَشِيرٍ،عَنْ عِيسَى بْنِ مَيْمُونٍ الْأَنْصَارِيِّ،عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَنْبَغِي لِقَوْمٍ فِيهِمْ أَبُو بَكْرٍ أَنْ يَؤُمَّهُمْ غَيْرُهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”کسی قوم کے لیے مناسب نہیں کہ ابوبکر رضی الله عنہ کی موجودگی میں ان کے سوا کوئی اور ان کی امامت کرے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>عیسی بن میمون: ضعیف`;
tirmizi.anwaar = [305,1];