var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا إِسْحَاق بْنُ يَحْيَى بْنِ طَلْحَةَ،عَنْ عَمِّهِ إِسْحَاق بْنِ طَلْحَةَ،عَنْ عَائِشَةَ،أَنَّ أَبَا بَكْرٍ دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَقَالَ:‏‏‏‏ أَنْتَ عَتِيقُ اللَّهِ مِنَ النَّارِ فَيَوْمَئِذٍ سُمِّيَ عَتِيقًا. هَذَا غَرِيبٌ،‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ،‏‏‏‏‏‏عَنْ مَعْنٍ،وَقَالَ:‏‏‏‏ عَنْ مُوسَى بْنِ طَلْحَةَ،عَنْ عَائِشَةَ.";
tirmizi.urdu = "ابوبکر رضی الله عنہ رسول اللہ ﷺ کے پاس آئے تو آپ نے فرمایا: ”تم جہنم سے اللہ کے آزاد کردہ ہو تو اسی دن سے ان کا نام عتیق رکھ دیا گیا“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-بعض راویوں نے یہ حدیث معن سے روایت کی ہے اور سند میں «عن موسى بن طلحة عن عائشة» کہا ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 6031
إسحاق بن یحیی بن طلحۃ ضعیف و للحدیث شاھد عند ابن الأعرابي فی المعجم (409) وسندہ صحیح فالحدیث صحیح`;