var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ،عَنْ حَمَّادِ بْنِ زَيْدٍ،عَنْ أَيُّوبَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،قَالَ:‏‏‏‏ مَا أَظُنُّ رَجُلًا يَنْتَقِصُ أَبَا بَكْرٍ،‏‏‏‏ وَعُمَرَ يُحِبُّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "میں کسی کو نہیں سمجھتا کہ وہ نبی اکرم ﷺ سے محبت کرتا ہو اور وہ ابوبکر و عمر رضی الله عنہما کی تنقیص کرے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>انظر الحدیث السابق (3684)`;
tirmizi.anwaar = [306,1];