var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ،حَدَّثَنَا الْمُقْرِئُ،عَنْ حَيْوَةَ بْنِ شُرَيْحٍ،عَنْ بَكْرِ بْنِ عَمْرٍو،عَنْ مِشْرَحِ بْنِ هَاعَانَ،عَنْ عُقْبَةَ بْنِ عَامِرٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كَانَ بَعْدِي نَبِيٌّ لَكَانَ عُمَرَ بْنَ الْخَطَّابِ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مِشْرَحِ بْنِ هَاعَانَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اگر میرے بعد کوئی نبی ہوتا تو وہ عمر بن خطاب ہوتے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف مشرح بن ہاعان کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 6047`;