var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ،حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ،عَنْ شَيْخٍ مِنْ بَنِي زُهْرَةَ،‏‏‏‏‏‏عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ،عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ،قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لِكُلِّ نَبِيٍّ رَفِيقٌ،‏‏‏‏ وَرَفِيقِي يَعْنِي فِي الْجَنَّةِ عُثْمَانُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا غَرِيبٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَهُوَ مُنْقَطِعٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”ہر نبی کا ایک رفیق ہوتا ہے،اور میرے رفیق یعنی جنت میں عثمان ہوں گے“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،اس کی سند قوی نہیں اور یہ منقطع ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br> شیخ من بني زہرۃ: لم أعرفہ وشیخہ الحارث بن عبد الرحمن بن أبي ذباب ’’لم یدرک طلحۃ‘‘ (تحفۃ الأشراف 212/4) <br>وللحدیث شاہد ضعیف جدًا عند ابن ماجہ:109`;
tirmizi.anwaar = [306,1];