var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى،حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ،عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ،عَنْ رَبِيعَةَ بْنِ يَزِيدَ،عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ،عَنْ النُّعْمَانِ بْنِ بَشِيرٍ،عَنْ عَائِشَةَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَا عُثْمَانُ إِنَّهُ لَعَلَّ اللَّهَ يُقَمِّصُكَ قَمِيصًا،‏‏‏‏ فَإِنْ أَرَادُوكَ عَلَى خَلْعِهِ فَلَا تَخْلَعْهُ لَهُمْ . وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اے عثمان! شاید اللہ تمہیں کوئی کرتا ۱؎ پہنائے،اگر لوگ اسے اتارنا چاہیں تو تم اسے ان کے لیے نہ اتارنا“،اس میں حدیث ایک طویل قصہ ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 6077
مسند احمد (6/ 86، 87 ح 24566 وسندہ صحیح)`;