var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،حَدَّثَنَا الْعَلَاءُ بْنُ عَبْدِ الْجَبَّارِ،حَدَّثَنَا الْحَارِثُ بْنُ عُمَيْرٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ كُنَّا نَقُولُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيٌّ أَبُو بَكْرٍ،‏‏‏‏ وَعُمَرُ،‏‏‏‏ وَعُثْمَانُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ مِنْ هَذَا الْوَجْهِ يُسْتَغْرَبُ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنِ ابْنِ عُمَرَ.";
tirmizi.urdu = "ہم رسول اللہ ﷺ کی زندگی میں کہتے تھے: ”ابوبکر،عمر،اور عثمان ۱؎۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = `مشکوۃ المصابیح: 6085`;