var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ،حَدَّثَنَا شَاذَانُ الْأَسْوَدُ بْنُ عَامِرٍ،عَنْ سِنَانِ بْنِ هَارُونَ الْبُرْجُمِيِّ،عَنْ كُلَيْبِ بْنِ وَائِلٍ،عَنِ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِتْنَةً،‏‏‏‏ فَقَالَ:‏‏‏‏ يُقْتَلُ فِيهَا هَذَا مَظْلُومًا لِعُثْمَانَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ هَذَا الْوَجْهِ مِنْ حَدِيثِ ابْنِ عُمَرَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے ایک فتنہ کا ذکر کیا تو فرمایا: ”اس فتنہ میں یہ عثمان بھی مظلوم قتل کیا جائے گا“ (یہ بات آپ نے عثمان رضی الله عنہ کے متعلق کہی)۔امام ترمذی کہتے ہیں: ابن عمر رضی الله عنہما کی یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سنان بن ہارون البرجمي ضعیف ضعفہ الجمھور`;
tirmizi.anwaar = [307,1];