var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى،حَدَّثَنَا شَرِيكٌ،عَنْ أَبِي إِسْحَاق،عَنْ حُبْشِيِّ بْنِ جُنَادَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ عَلِيٌّ مِنِّي،‏‏‏‏ وَأَنَا مِنْ عَلِيٍّ،‏‏‏‏‏‏وَلَا يُؤَدِّي عَنِّي إِلَّا أَنَا أَوْ عَلِيٌّ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”علی مجھ سے ہیں اور میں علی سے ہوں اور میری جانب سے نقض عہد کی بات میرے یا علی کے علاوہ کوئی اور ادا نہیں کرے گا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 6092`;