var tirmizi = {};
tirmizi.arabic = "وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ بِهَذَا الْإِسْنَادِ،‏‏‏‏‏‏إِلَّا أَنَّهُ يَقُولُ:‏‏‏‏ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ الْمَرِيضِ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ صَلِّ قَائِمًا،‏‏‏‏‏‏فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا،‏‏‏‏‏‏فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ";
tirmizi.urdu = "اسی سند سے مروی ہے،مگر اس میں یوں ہے: عمران بن حصین کہتے ہیں کہ میں نے رسول اللہ ﷺ سے مریض کی نماز کے بارے میں سوال کیا تو آپ نے فرمایا: ”کھڑے ہو کر پڑھو،اگر اس کی طاقت نہ ہو تو بیٹھ کر پڑھو اور اگر اس کی بھی طاقت نہ ہو تو لیٹ کر پہلو کے بل پڑھو“۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;