var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُخْتَارِ،عَنْ شُعْبَةَ،عَنْ أَبِي بَلْجٍ،عَنْ عَمْرِو بْنِ مَيْمُونٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِسَدِّ الْأَبْوَابِ إِلَّا بَابَ عَلِيٍّ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "رسول اللہ ﷺ نے علی رضی الله عنہ کے دروازے کے علاوہ (مسجد نبوی میں کھلنے والے تمام) دروازوں کو بند کرنے کا حکم دیا ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے شعبہ کی روایت سے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 6105`;