var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ الْعَطَّارُ الْبَصْرِيُّ،حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ،عَنْ إِسْحَاق بْنِ يَحْيَى بْنِ طَلْحَةَ،عَنْ عَمِّهِ مُوسَى بْنِ طَلْحَةَ،قَالَ:‏‏‏‏ دَخَلْتُ عَلَى مُعَاوِيَةَ،‏‏‏‏ فَقَالَ:‏‏‏‏ أَلَا أُبَشِّرُكَ؟ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ طَلْحَةُ مِمَّنْ قَضَى نَحْبَهُ . قَالَ:‏‏‏‏ هَذَا غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ مُعَاوِيَةَ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "میں معاویہ رضی الله عنہ کے پاس آیا تو انہوں نے کہا: کیا میں تمہیں یہ خوشخبری نہ سناؤں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ہے: ”طلحہ ان لوگوں میں سے ہیں جن کے سلسلہ میں اللہ نے فرمایا ہے کہ وہ اپنا کام پورا کر چکے ہیں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے معاویہ رضی الله عنہ کی روایت سے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>انظر الحدیث السابق (3202)`;
tirmizi.anwaar = [309,1];