var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ بْنُ مَنْصُورٍ الْعَنَزِيُّ،عَنْ عُقْبَةَ بْنِ عَلْقَمَةَ الْيَشْكُرِيِّ،قَال:‏‏‏‏ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ،قَالَ:‏‏‏‏ سَمِعَتْ أُذُنِي مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَهُوَ يَقُولُ:‏‏‏‏ طَلْحَةُ،‏‏‏‏ وَالزُّبَيْرُ جَارَايَ فِي الْجَنَّةِ . قَالَ:‏‏‏‏ هَذَا غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "میں نے علی رضی الله عنہ کو کہتے ہوئے سنا ہے کہ میرے کانوں نے رسول اللہ ﷺ کے زبان مبارک سے سنا ہے آپ فرما رہے تھے: ”طلحہ اور زبیر دونوں میرے جنت کے پڑوسی ہیں“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عقبۃ بن علقمۃ الیشکري وأبو عبد الرحمن النضر بن منصور ضعیفان (تقریب: 4646،7150) و صححہ الحاکم (364/3 ح 5562) فتعقبہ الذہبي`;
tirmizi.anwaar = [309,1];