var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا عَبْدَةُ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ،عَنْ الزُّبَيْرِ،قَالَ:‏‏‏‏ جَمَعَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَوَيْهِ يَوْمَ قُرَيْظَةَ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ بِأَبِي وَأُمِّي . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے قریظہ کے دن اپنے ماں اور باپ دونوں کو میرے لیے جمع کیا اور فرمایا: ”میرے ماں باپ تم پر فدا ہوں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;