var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ صَخْرِ بْنِ جُوَيْرِيَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،قَالَ:‏‏‏‏ أَوْصَى الزُّبَيْرُ إِلَى ابْنِهِ عَبْدِ اللَّهِ صَبِيحَةَ الْجَمَلِ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا مِنِّي عُضْوٌ إِلَّا وَقَدْ جُرِحَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى انْتَهَى ذَاكَ إِلَى فَرْجِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ.";
tirmizi.urdu = "زبیر رضی الله عنہ نے اپنے بیٹے عبداللہ (رضی الله عنہما) کو جنگ جمل کی صبح کو وصیت کی اور کہا: میرا کوئی عضو ایسا نہیں ہے جو رسول اللہ ﷺ کی رفاقت میں زخمی نہ ہوا ہو یہاں تک کہ میری شرمگاہ بھی ۱؎۔امام ترمذی کہتے ہیں: حماد بن زید کی روایت سے یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ہشام لم یدرک الزبیر <br>واستظہر المزي في تحفۃ الأشراف (180/3) بأنہ رواہ عن عبد اللّٰہ بن الزبیر بہ وإن صح ھذا فالسند صحیح`;
tirmizi.anwaar = [309,1];