var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ الْبَصْرِيُّ،وَإِسْحَاق بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ بْنِ الشَّهِيدٍ الْبَصْرِيُّ،حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ أَوْصَى بِحَدِيقَةٍ لِأُمَّهَاتِ الْمُؤْمِنِينَ،‏‏‏‏‏‏بِيعَتْ بِأَرْبَعِ مِائَةِ أَلْفٍ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "عبدالرحمٰن بن عوف رضی الله عنہ نے امہات المؤمنین رضی اللہ عنہن کے لیے ایک باغ کی وصیت کی جسے چار لاکھ (درہم) میں بیچا گیا۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;