var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِذَلِكَ مَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا سُفْيَانُ،عَنْ سَعْدِ بْن إِبْرَاهِيمَ،عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ،عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،قَالَ:‏‏‏‏ مَا سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُفَدِّي أَحَدًا بِأَبَوَيْهِ إِلَّا لِسَعْدٍ،‏‏‏‏‏‏فَإِنِّي سَمِعْتُهُ يَقُولُ يَوْمَ أُحُدٍ:‏‏‏‏ ارْمِ سَعْدُ فِدَاكَ أَبِي وَأُمِّي . قَالَ:‏‏‏‏ هَذَا صَحِيحٌ.";
tirmizi.urdu = "میں نے نبی اکرم ﷺ سے اپنے باپ اور ماں کو سعد کے علاوہ کسی اور پر فدا کرتے نہیں سنا،میں نے احد کے دن آپ کو فرماتے ہوئے سنا: ”سعد تم تیر مارو،میرے باپ اور ماں تم پر فدا ہوں“۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;