var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ،حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ إِسْرَائِيلَ،عَنْ عَبْدِ الْأَعْلَى،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْعَبَّاسُ مِنِّي وَأَنَا مِنْهُ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ إِسْرَائِيلَ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”عباس مجھ سے ہیں اور میں ان سے ہوں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے،ہم اسے صرف اسرائیل کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>نسائي (4779) مطولاً  <br> عبد الأعلی الثعلبي: ضعیف`;
tirmizi.anwaar = [310,1];