var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ،حَدَّثَنِي أَبِي،قَال:‏‏‏‏ سَمِعْتُ الْأَعْمَشَ يُحَدِّثُ،‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ،عَنْ أَبِي الْبَخْتَرِيِّ،عَنْ عَلِيٍّ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعُمَرَ فِي الْعَبَّاسِ:‏‏‏‏ إِنَّ عَمَّ الرَّجُلِ صِنْوُ أَبِيهِ . وَكَانَ عُمَرُ كَلَّمَهُ فِي صَدَقَتِهِ. قَالَ:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے عمر رضی الله عنہ سے عباس رضی الله عنہ کے سلسلہ میں فرمایا: ”بلاشبہہ آدمی کا چچا اس کے باپ کے مثل ہوتا ہے“ عمر رضی الله عنہ نے آپ ﷺ سے ان کے صدقہ کے سلسلہ میں کوئی بات کی تھی ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;