var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،حَدَّثَنَا شَبَابَةُ،حَدَّثَنَا وَرْقَاءُ،عَنْ أَبِي الزِّنَادِ،عَنِ الْأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْعَبَّاسُ عَمُّ رَسُولِ اللَّهِ،‏‏‏‏ وَإِنَّ عَمَّ الرَّجُلِ صِنْوُ أَبِيهِ،‏‏‏‏ أَوْ مِنْ صِنْوِ أَبِيهِ . هَذَا حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ أَبِي الزِّنَادِ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”عباس اللہ کے رسول کے چچا ہیں اور آدمی کا چچا اس کے باپ کے مثل ہوتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے،ہم اسے ابوالزناد کی روایت سے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;