var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاق،عَنِ الْبَرَاءِ بْن عَازِبٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِجَعْفَرِ بْنِ أَبِي طَالِبٍ:‏‏‏‏ أَشْبَهْتَ خَلْقِي وَخُلُقِي وَفِي الْحَدِيثِ قِصَّةٌ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ. حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا أُبَيٌّ،عَنْ إِسْرَائِيلَ نَحْوَهُ.";
tirmizi.urdu = "نبی اکرم ﷺ نے جعفر بن ابی طالب سے فرمایا: ”تم صورت اور سیرت دونوں میں میرے مشابہ ہو“،اور اس حدیث میں ایک قصہ ہے ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے۔ہم سے سفیان بن وکیع نے بیان کیا،وہ کہتے ہیں کہ ہم سے والد نے اسرائیل کے واسطہ سے اسی جیسی حدیث روایت کی۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;