var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ،عَنْ سُفْيَانَ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنِ ابْنِ أَبِي نُعْمٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْحَسَنُ،‏‏‏‏ وَالْحُسَيْنُ سَيِّدَا شَبَابِ أَهْلِ الْجَنَّةِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”حسن اور حسین اہل جنت کے جوانوں کے سردار ہیں“ ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 6163`;