var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ،حَدَّثَنِي يُوسُفُ بْنُ إِبْرَاهِيمَ،أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ:‏‏‏‏ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّ أَهْلِ بَيْتِكَ أَحَبُّ إِلَيْكَ؟ قَالَ:‏‏‏‏ الْحَسَنُ وَالْحُسَيْنُ،‏‏‏‏‏‏وَكَانَ يَقُولُ لِفَاطِمَةَ:‏‏‏‏ ادْعِي لِيَ ابْنَيَّ،‏‏‏‏ فَيَشُمُّهُمَا وَيَضُمُّهُمَا إِلَيْهِ. قَالَ:‏‏‏‏ هَذَا غَرِيبٌ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَنَسٍ.";
tirmizi.urdu = "رسول اللہ ﷺ سے پوچھا گیا کہ آپ کے اہل بیت میں آپ کو سب سے زیادہ محبوب کون ہیں؟ تو آپ نے فرمایا: ”حسن اور حسین“ (رضی الله عنہما)،آپ فاطمہ رضی الله عنہا سے فرماتے: ”میرے دونوں بیٹوں کو بلاؤ،پھر آپ انہیں چومتے اور انہیں اپنے سینہ سے لگاتے“۔امام ترمذی کہتے ہیں: انس کی روایت سے یہ حدیث اس سند سے غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>یوسف بن إبراہیم: ضعیف (تقریب: 7855)`;
tirmizi.anwaar = [310,2];