var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا الْأَنْصَارِيُّ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا الْأَشْعَثُ هُوَ ابْنُ عَبْدِ الْمَلِكِ،عَنِ الْحَسَنِ،عَنْ أَبِي بَكْرَةَ،قَالَ:‏‏‏‏ صَعِدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِنْبَرَ فَقَالَ:‏‏‏‏ إِنَّ ابْنِي هَذَا سَيِّدٌ يُصْلِحُ اللَّهُ عَلَى يَدَيْهِ فِئَتَيْنِ عَظِيمَتَيْنِ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ يَعْنِي الْحَسَنَ بْنَ عَلِيٍّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے منبر پر چڑھ کر فرمایا: ”میرا یہ بیٹا سردار ہے،اللہ تعالیٰ اس کے ذریعہ دو بڑے گروہوں میں صلح کرائے گا“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اور «ابني هذا» سے مراد حسن بن علی ہیں رضی الله عنہما۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;