var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ،عَنْ أَبِي جُحَيْفَةَ،قَالَ:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ . هَذَا حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ،‏‏‏‏‏‏وَابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَابْنِ الزُّبَيْرِ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو دیکھا اور حسن بن علی رضی الله عنہما ان سے مشابہت رکھتے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابوبکر صدیق،ابن عباس اور عبداللہ بن زبیر رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;