var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاق،عَنْ هَانِئِ بْنِ هَانِئٍ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ الْحَسَنُ أَشْبَهُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ الصَّدْرِ إِلَى الرَّأْسِ،‏‏‏‏ وَالْحُسَيْنُ أَشْبَهُ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا كَانَ أَسْفَلَ مِنْ ذَلِكَ . هَذَا حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "حسن رضی الله عنہ سینہ سے سر تک کے حصہ میں رسول اللہ ﷺ سے سب سے زیادہ مشابہ تھے،اور حسین رضی الله عنہ اس حصہ میں جو اس سے نیچے کا ہے سب سے زیادہ نبی اکرم ﷺ سے مشابہ تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو إسحاق عنعن`;
tirmizi.anwaar = [311,1];