var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ جَمَعَ الْقُرْآنَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَةٌ كُلُّهُمْ مِنَ الْأَنْصَارِ:‏‏‏‏ أُبَيُّ بْنُ كَعْبٍ،‏‏‏‏‏‏وَمُعَاذُ بْنُ جَبَلٍ،‏‏‏‏‏‏وَزَيْدُ بْنُ ثَابِتٍ،‏‏‏‏‏‏وَأَبُو زَيْدٍ،‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِأَنَسٍ:‏‏‏‏ مَنْ أَبُو زَيْدٍ؟ قَالَ:‏‏‏‏ أَحَدُ عُمُومَتِي. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ کے عہد مبارک میں قرآن کو چار آدمیوں نے جمع کیا اور وہ سب کے سب انصار میں سے ہیں: ابی بن کعب،معاذ بن جبل،زید بن ثابت اور ابوزید ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;