var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا أَبِي،عَنِ الْحَسَنِ بْنِ صَالِحٍ،عَنْ أَبِي رَبِيعَةَ الْإِيَادِيِّ،عَنِ الْحَسَنِ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الْجَنَّةَ لَتَشْتَاقُ إِلَى ثَلَاثَةٍ:‏‏‏‏ عَلِيٍّ،‏‏‏‏ وَعَمَّارٍ،‏‏‏‏ وَسَلْمَانَ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْحَسَنِ بْنِ صَالِحٍ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جنت تین آدمیوں کی مشتاق ہے: علی،عمار،اور سلمان رضی الله عنہم کی“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف حسن بن صالح کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>الحسن عنعن`;
tirmizi.anwaar = [311,1];