var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاق،عَنْ هَانِئِ بْنِ هَانِئٍ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ جَاءَ عَمَّارٌ يَسْتَأْذِنُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ ائْذَنُوا لَهُ مَرْحَبًا بِالطَّيِّبِ الْمُطَيَّبِ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "عمار نے آ کر نبی اکرم ﷺ سے اندر آنے کی اجازت مانگی تو آپ نے فرمایا: ”انہیں اجازت دے دو،مرحبا مرد پاک ذات و پاک صفات کو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 6235`;