var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ الْأَوْزَاعِيِّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ مُعَيْقِيبٍ،قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مَسْحِ الْحَصَى فِي الصَّلَاةِ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَمَرَّةً وَاحِدَةً . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے نماز میں کنکری ہٹانے کے سلسلے میں رسول اللہ ﷺ سے پوچھا تو آپ نے فرمایا: ”اگر ہٹانا ضروری ہی ہو تو ایک بار ہٹا لو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;