var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،أَخْبَرَنَا صَاعِدٌ الْحَرَّانِيُّ،حَدَّثَنَا زُهَيْرٌ،حَدَّثَنَا مَنْصُورٌ،عَنْ أَبِي إِسْحَاق،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كُنْتُ مُؤَمِّرًا أَحَدًا مِنْ غَيْرِ مَشُورَةٍ مِنْهُمْ لَأَمَّرْتُ عَلَيْهِمْ ابْنَ أُمِّ عَبْدٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا غَرِيبٌ،‏‏‏‏‏‏إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ الْحَارِثِ،‏‏‏‏ عَنْ عَلِيٍّ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اگر میں بغیر مشورہ کے ان میں سے کسی کو امیر بناتا تو ام عبد کے بیٹے (عبداللہ بن مسعود) کو امیر بناتا“۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف حارث کی روایت سے جانتے ہیں جسے وہ علی رضی الله عنہ سے روایت کرتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `[3808۔3809 ] إسنادہ ضعیف <br>ابن ماجہ (137)<br>الحارث الأعور: ضعیف`;
tirmizi.anwaar = [312,1];