var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا أَبِي،عَنْ سُفْيَانَ الثَّوْرِيِّ،عَنْ أَبِي إِسْحَاق،عَنْ الْحَارِثِ،عَنْ عَلِيٍّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كُنْتُ مُؤَمِّرًا أَحَدًا مِنْ غَيْرِ مَشُورَةٍ لَأَمَّرْتُ ابْنَ أُمِّ عَبْدٍ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اگر میں بغیر مشورہ کے کسی کو امیر بناتا تو ام عبد کے بیٹے (عبداللہ بن مسعود) کو امیر بناتا“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `۔3809 ] إسنادہ ضعیف <br>ابن ماجہ (137)<br>الحارث الأعور: ضعیف`;
tirmizi.anwaar = [312,1];