var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنِ الْأَعْمَشِ،عَنْ شَقِيقِ بْنِ سَلَمَةَ،عَنْ مَسْرُوقٍ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خُذُوا الْقُرْآنَ مِنْ أَرْبَعَةٍ:‏‏‏‏ مِنَ ابْنِ مَسْعُودٍ،‏‏‏‏‏‏وَأُبَيِّ بْنِ كَعْبٍ،‏‏‏‏‏‏وَمُعَاذِ بْنِ جَبَلٍ،‏‏‏‏‏‏وَسَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ . قَالَ:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”قرآن مجید چار لوگوں سے سیکھو: ابن مسعود،ابی بن کعب،معاذ بن جبل،اور سالم مولی ابی حذیفہ سے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;