var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ مَا كُنَّا نَدْعُو زَيْدَ بْنَ حَارِثَةَ إِلَّا زَيْدَ بْنَ مُحَمَّدٍ حَتَّى نَزَلَتْ:‏‏‏‏ ادْعُوهُمْ لآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ سورة الأحزاب آية 5 . قَالَ:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "ہم زید بن حارثہ کو زید بن محمد ہی کہہ کر پکارتے تھے یہاں تک کہ آیت کریمہ «ادعوهم لآبائهم هو أقسط عند الله» ”تم متبنی (لے پالک) لوگوں کو ان کے اپنے باپوں کے نام پکارا کرو،یہی بات اللہ کے نزدیک زیادہ قرین انصاف بات ہے“ (الاحزاب: ۵)،نازل ہوئی۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;