var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ،حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى،عَنْ طَلْحَةَ بْنِ يَحْيَى،عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ،عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ،‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُنَحِّيَ مُخَاطَ أُسَامَةَ،‏‏‏‏‏‏قَالَتْ عَائِشَةُ:‏‏‏‏ دَعْنِي حَتَّى أَكُونَ أَنَا الَّذِي أَفْعَلُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا عَائِشَةُ أَحِبِّيهِ فَإِنِّي أُحِبُّهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے اسامہ کی ناک پونچھنے کا ارادہ فرمایا ۱؎ تو میں نے کہا: آپ چھوڑیں میں صاف کئے دیتی ہوں،آپ نے فرمایا: ”عائشہ! تم اس سے محبت کرو کیونکہ میں اس سے محبت کرتا ہوں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 6176`;