var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو،حَدَّثَنَا زَائِدَةُ،عَنْ إِسْمَاعِيل بْنِ أَبِي خَالِدٍ،عَنْ قَيْسٍ،عَنْ جَرِيرٍ،قَالَ:‏‏‏‏ مَا حَجَبَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنْذُ أَسْلَمْتُ وَلَا رَآنِي إِلَّا تَبَسَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے جب سے میں اسلام لایا ہوں مجھے (اندر جانے سے) منع نہیں کیا اور جب بھی آپ نے مجھے دیکھا آپ مسکرائے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;