var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،عَنْ خَالِدٍ الْحَذَّاءِ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ ضَمَّنِي إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ:‏‏‏‏ اللَّهُمَّ عَلِّمْهُ الْحِكْمَةَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے مجھے اپنے سینے سے لگا کر فرمایا: «اللهم علمه الحكمة» ”اے اللہ! اسے حکمت سکھا دے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;