var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ شَرِيكٍ،عَنْ عَاصِمٍ الأَحْوَلِ،عَنْ أَنَسٍ،قَالَ:‏‏‏‏ رُبَّمَا قَالَ لِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا ذَا الْأُذُنَيْنِ،‏‏‏‏‏‏قَالَ أَبُو أُسَامَةَ:‏‏‏‏ يَعْنِي يُمَازِحُهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ.";
tirmizi.urdu = "کبھی کبھی نبی اکرم ﷺ مجھے کہتے: ”اے دو کانوں والے“۔ابواسامہ کہتے ہیں: یعنی آپ ان سے یہ مذاق کے طور پر فرماتے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث غریب صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;