var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ،عَنْ مَيْمُونٍ أَبِي عَبْدِ اللَّهِ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ نَحْوَ حَدِيثِ إِبْرَاهِيمَ بْنِ يَعْقُوبَ،‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ:‏‏‏‏ وَأَخَذَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ جِبْرِيلَ .";
tirmizi.urdu = "انس رضی الله عنہ سے ابراہیم بن یعقوب والی حدیث ہی کی طرح حدیث مروی ہے،لیکن اس میں اس کا ذکر نہیں ہے کہ نبی اکرم ﷺ نے اسے جبرائیل سے لیا ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `۔3832] إسنادہ ضعیف<br>میمون بن أبان: مستور (تقریب: 7042) أي مجہول الحال،وثقہ ابن حبان وحدہ`;
tirmizi.anwaar = [313,1];