var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ الْمُقَدَّمِيُّ،حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ شُعْبَةَ،عَنْ سِمَاكٍ،عَنْ أَبِي الرَّبِيعِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَسَطْتُ ثَوْبِي عِنْدَهُ،‏‏‏‏‏‏ثُمَّ أَخَذَهُ فَجَمَعَهُ عَلَى قَلْبِي،‏‏‏‏ فَمَا نَسِيتُ بَعْدَهُ حَدِيثًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "میں نبی اکرم ﷺ کی خدمت میں حاضر ہوا تو میں نے آپ کے پاس اپنی چادر پھیلا دی،آپ نے اسے اٹھایا اور سمیٹ کر اسے میرے دل پر رکھ دیا،اس کے بعد سے میں کوئی چیز نہیں بھولا۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;