var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا يَعْلَى بْنُ عَطَاءٍ،عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ،عَنِ ابْنِ عُمَرَ،أَنَّهُ قَالَ لِأَبِي هُرَيْرَةَ:‏‏‏‏ يَا أَبَا هُرَيْرَةَ أَنْتَ كُنْتَ أَلْزَمَنَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَحْفَظَنَا لِحَدِيثِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "انہوں نے ابوہریرہ رضی الله عنہ سے کہا: ابوہریرہ! آپ ہم سے زیادہ رسول اللہ ﷺ کی خدمت میں حاضر رہنے والے اور ہم سے زیادہ آپ ﷺ کی حدیثیں یاد رکھنے والے ہیں۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;