var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ وَهْبِ بْنِ مُنَبِّهٍ،عَنْ أَخِيهِ هَمَّامِ بْنِ مُنَبِّهٍ،عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَيْسَ أَحَدٌ أَكْثَرَ حَدِيثًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنِّي إِلَّا عَبْدَ اللَّهِ بْنَ عَمْرٍو،‏‏‏‏ فَإِنَّهُ كَانَ يَكْتُبُ وَكُنْتُ لَا أَكْتُبُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ کی حدیثیں مجھ سے زیادہ کسی کو یاد نہیں،سوائے عبداللہ بن عمرو کے کیونکہ وہ لکھ لیتے تھے اور میں لکھتا نہیں تھا ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;