var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،حَدَّثَنَا أَبُو مُسْهِرٍ عَبْدُ الْأَعْلَى بْنُ مُسْهِرٍ،عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ،عَنْ رَبِيعَةَ بْنِ يَزِيدَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عُمَيْرَةَ،وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لِمُعَاوِيَةَ:‏‏‏‏ اللَّهُمَّ اجْعَلْهُ هَادِيًا مَهْدِيًّا وَاهْدِ بِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے معاویہ رضی الله عنہ کے بارے میں فرمایا: ”اے اللہ! تو ان کو ہدایت دے اور ہدایت یافتہ بنا دے،اور ان کے ذریعہ لوگوں کو ہدایت دے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 6244`;