var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ لَا عَيْشَ إِلَّا عَيْشَ الْآخِرَهْ فَأَكْرِمْ الْأَنْصَارَ وَالْمُهَاجِرَهْ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ،‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ.";
tirmizi.urdu = "نبی اکرم ﷺ فرماتے تھے: «اللهم لا عيش إلا عيش الآخره فأكرم الأنصار والمهاجره» ”بار الٰہا زندگی تو آخرت کی زندگی ہے،تو انصار و مہاجرین کی تکریم فرما“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-انس رضی الله عنہ سے یہ حدیث کئی سندوں سے آئی ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;