var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَزْهَرُ السَّمَّانُ،عَنْ سُلَيْمَانَ التَّيْمِيِّ،عَنْ خِدَاشٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَيَدْخُلَنَّ الْجَنَّةَ مَنْ بَايَعَ تَحْتَ الشَّجَرَةِ إِلَّا صَاحِبَ الْجَمَلِ الْأَحْمَرِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جنہوں نے درخت کے نیچے بیعت کی (یعنی بیعت رضوان میں شریک رہے) وہ ضرور جنت میں داخل ہوں گے،سوائے سرخ اونٹ والے کے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو الزبیر عنعن <br>وتلمیذہ خداش: لین الحدیث (تقریب: 1705)`;
tirmizi.anwaar = [313,1];