var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ زَنْجُوَيْهِ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ حَسْبُكَ مِنْ نِسَاءِ الْعَالَمِينَ:‏‏‏‏ مَرْيَمُ ابْنَةُ عِمْرَانَ،‏‏‏‏‏‏وَخَدِيجَةُ بِنْتُ خُوَيْلِدٍ،‏‏‏‏‏‏وَفَاطِمَةُ بِنْتُ مُحَمَّدٍ،‏‏‏‏‏‏وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”ساری دنیا کی عورتوں میں سے تمہیں مریم بنت عمران،خدیجہ بنت خویلد،فاطمہ بنت محمد،اور فرعون کی بیوی آسیہ کافی ہیں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 6190`;