var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدٌ،أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،أَخْبَرَنَا زَكَرِيَّا،عَنِ الشَّعْبِيِّ،عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ جِبْرِيلَ يَقْرَأُ عَلَيْكِ السَّلَامَ،‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ وَعَلَيْهِ السَّلَامُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "مجھ سے رسول اللہ ﷺ نے فرمایا: ”جبرائیل تمہیں سلام کہہ رہے ہیں تو میں نے عرض کیا: ان پر سلام اور اللہ کی رحمتیں اور اس کی برکتیں ہوں“۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;