var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ،حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ،حَدَّثَنَا خَالِدُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ،عَنْ أَبِي بُرْدَةَ،عَنْ أَبِي مُوسَى،قَالَ:‏‏‏‏ مَا أَشْكَلَ عَلَيْنَا أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثٌ قَطُّ فَسَأَلْنَا عَائِشَةَ إِلَّا وَجَدْنَا عِنْدَهَا مِنْهُ عِلْمًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "ہم اصحاب رسول اللہ ﷺ پر جب بھی کوئی حدیث مشکل ہوتی اور ہم نے اس کے بارے میں عائشہ رضی الله عنہا سے پوچھا تو ہمیں ان کے پاس اس کے بارے میں کوئی جانکاری ضرور ملی ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 6194`;