var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ،حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو،عَنْ زَائِدَةَ،عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ،عَنْ مُوسَى بْنِ طَلْحَةَ،قَالَ:‏‏‏‏ مَا رَأَيْتُ أَحَدًا أَفْصَحَ مِنْ عَائِشَةَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "میں نے عائشہ رضی الله عنہا سے زیادہ فصیح کسی کو نہیں دیکھا۔امام ترمذی کہتے ہی: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>عبد الملک بن عمیر عنعن <br>والمفہوم صحیح`;
tirmizi.anwaar = [314,1];