var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاق،عَنْ عَمْرِو بْنِ غَالِبٍ،أَنَّ رَجُلًا نَالَ مِنْ عَائِشَةَ عِنْدَ عَمَّارِ بْنِ يَاسِرٍ،فَقَالَ:‏‏‏‏ أَغْرِبْ مَقْبُوحًا مَنْبُوحًا أَتُؤْذِي حَبِيبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ایک شخص نے عمار بن یاسر رضی الله عنہ کے پاس عائشہ رضی الله عنہا کی عیب جوئی کی تو انہوں نے کہا: ہٹ مردود بدتر،کیا تو رسول اللہ ﷺ کی محبوبہ کو اذیت پہنچا رہا ہے؟ امام ترمذی کہتے ہی: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>سفیان الثوري وأبو إسحاق عنعنا`;
tirmizi.anwaar = [314,1];