var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ أَبِي حُصَيْنٍ،عَنْ عَبْدِ اللَّهِ بْنِ زِيَادٍ الْأَسَدِيِّ،قَال:‏‏‏‏ سَمِعْتُ عَمَّارَ بْنَ يَاسِرٍ،يَقُولُ:‏‏‏‏ هِيَ زَوْجَتُهُ فِي الدُّنْيَا وَالْآخِرَةِ يَعْنِي عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَفِي الْبَابِ عَنْ عَلِيٍّ بْنِ أَبِي طَالِبٍ.";
tirmizi.urdu = "میں نے عمار بن یاسر رضی الله عنہ کو کہتے ہوئے سنا کہ یہ یعنی عائشہ رضی الله عنہا دنیا اور آخرت دونوں میں آپ کی بیوی ہیں ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-اس باب میں علی رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;