var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ،حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ،عَنْ حُمَيْدٍ،عَنْ أَنَسٍ رَضِيَ اللهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ قِيلَ:‏‏‏‏ يَا رَسُولَ اللَّهِ مَنْ أَحَبُّ النَّاسِ إِلَيْكَ؟ قَالَ:‏‏‏‏ عَائِشَةُ،‏‏‏‏‏‏قِيلَ:‏‏‏‏ مِنَ الرِّجَالِ؟ قَالَ:‏‏‏‏ أَبُوهَا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَنَسٍ.";
tirmizi.urdu = "آپ سے عرض کیا گیا: اللہ کے رسول! لوگوں میں آپ کو سب سے زیادہ محبوب کون ہے؟ آپ نے فرمایا: ”عائشہ“،عرض کیا گیا مردوں میں؟ آپ نے فرمایا: ”ان کے والد“۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے یعنی انس کی روایت سے حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;