var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ،حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى،وَالْحُسَيْنُ بْنُ مُحَمَّدٍ،‏‏‏‏ عَنْ إِسْرَائِيلَ،عَنِ السُّدِّيِّ،عَنِ الْوَلِيدِ بْنِ أَبِي هِشَامٍ،عَنْ زَيْدِ بْنِ زَائِدَةَ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يُبَلِّغُنِي أَحَدٌ عَنْ أَحَدٍ شَيْئًا . وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا مِنْ هَذَا مِنْ غَيْرِ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”کوئی کسی کی کوئی بات مجھے نہ پہنچائے“۔امام ترمذی کہتے ہیں: اس حدیث کا کچھ حصہ اس سند کے علاوہ سے بھی عبداللہ بن مسعود رضی الله عنہ سے مرفوعاً آیا ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `۔3897] إسنادہ ضعیف <br>سنن أبي داود (4860)`;
tirmizi.anwaar = [315,1];