var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا أَبُو عَامِرٍ،عَنْ زُهَيْرِ بْنِ مُحَمَّدٍ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ،عَنِ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ،عَنْ أَبِيهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْلَا الْهِجْرَةُ لَكُنْتُ امْرَأً مِنَ الْأَنْصَارِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اگر ہجرت نہ ہوتی تو میں بھی انصار ہی کا ایک فرد ہوتا“ ۱؎۔اسی سند سے نبی اکرم ﷺ سے یہ بھی روایت ہے کہ آپ نے فرمایا: ”اگر انصار کسی وادی یا گھاٹی میں چلیں تو میں بھی انہیں کے ساتھ ہوں گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;