var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ الْبَصْرِيُّ،حَدَّثَنَا أَبُو دَاوُدَ،‏‏‏‏ وَعَبْدُ الصَّمَدِ،قَالَا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ ثَابِتٍ الْبُنَانِيُّ،عَنْ أَبِيهِ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنْ أَبِي طَلْحَةَ،قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَقْرِئْ قَوْمَكَ السَّلَامَ فَإِنَّهُمْ مَا عَلِمْتُ أَعِفَّةٌ صُبُرٌ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "مجھ سے رسول اللہ ﷺ نے فرمایا: ”تم اپنی قوم ۱؎ کو سلام کہو،کیونکہ وہ پاکباز اور صابر لوگ ہیں جیسا کہ مجھے معلوم ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>محمد بن ثابت البناني ضعیف <br>وتابعہ الحسن بن أبي جعفر وھو ضعیف`;
tirmizi.anwaar = [315,1];