var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ،وَالْمُؤَمَّلُ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ،عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَبْغَضُ الْأَنْصَارَ أَحَدٌ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”کوئی شخص جو اللہ اور یوم آخرت پر ایمان رکھتا ہو انصار سے بغض نہیں رکھ سکتا“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 6250`;