var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،قَال:‏‏‏‏ سَمِعْتُ قَتَادَةَ يُحَدِّثُ،‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْأَنْصَارُ كَرِشِي وَعَيْبَتِي،‏‏‏‏‏‏وَإِنَّ النَّاسَ سَيَكْثُرُونَ وَيَقِلُّونَ فَاقْبَلُوا مِنْ مُحْسِنِهِمْ،‏‏‏‏ وَتَجَاوَزُوا عَنْ مُسِيئِهِمْ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”انصار میرے راز دار اور میرے خاص الخاص ہیں،لوگ عنقریب بڑھیں گے اور انصار کم ہوتے جائیں گے،تو تم ان کے بھلے لوگوں کی اچھائیوں کو قبول کرو اور ان کے خطا کاروں کی خطاؤں سے درگزر کرو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;