var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ،عَنِ الْأَعْمَشِ،عَنْ طَارِقِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اللَّهُمَّ أَذَقْتَ أَوَّلَ قُرَيْشٍ نَكَالًا،‏‏‏‏،‏‏‏‏ فَأَذِقْ آخِرَهُمْ نَوَالًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”اے اللہ! قریش کے پہلوں کو تو نے (قتل،قید اور ذلت کا) عذاب چکھایا ہے ۱؎،تو ان کے پچھلوں کو بخشش و عنایت سے نواز دے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 5989`;