var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ،حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،عَنْ جَعْفَرٍ الْأَحْمَرِ،عَنْ عَطَاءِ بْنِ السَّائِبِ،عَنْ أَنَسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ اللَّهُمَّ اغْفِرْ لِلْأَنْصَارِ،‏‏‏‏ وَلِأَبْنَاءِ الْأَنْصَارِ،‏‏‏‏ وَلِأَبْنَاءِ أَبْنَاءِ الْأَنْصَارِ،‏‏‏‏ وَلِنِسَاءِ الْأَنْصَارِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: «اللهم اغفر للأنصار ولأبناء الأنصار ولأبناء أبناء الأنصار ولنساء الأنصار» ”اے اللہ! انصار کو،ان کے بیٹوں کو،ان کے بیٹوں کے بیٹوں کو اور ان کی عورتوں کو بخش دے“۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف <br>عطاء بن السائب اختلط <br>وللحدیث شواھد عند البخاري (4906) ومسلم (2506) وغیرھما دون قولہ ’’ولنساء الأنصار ‘‘`;
tirmizi.anwaar = [315,1];