var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ،حَدَّثَنَا أَحْمَدُ بْنُ بَشِيرٍ،عَنْ مُجَالِدٍ،عَنِ الشَّعْبِيِّ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَيْرُ دِيَارِ الْأَنْصَارِ بَنُو النَّجَّارِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”انصار کے گھروں میں سب سے بہتر گھر بنی نجار کے گھر ہیں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;