var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ كَامِلٍ الْمَرْوَزِيُّ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ الزَّاهِدُ،عَنْ كَثِيرِ بْنِ زَيْدٍ،عَنِ الْوَلِيدِ بْنِ رَبَاحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ .";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”میرے گھر اور میرے منبر کے درمیان جو حصہ ہے وہ جنت کی کیاریوں میں سے ایک کیاری ہے“۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;