var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،حَدَّثَنَا شُعْبَةُ،عَنْ الْحَكَمِ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ خَمْسًا،‏‏‏‏‏‏فَقِيلَ لَهُ أَزِيدَ فِي الصَّلَاةِ،‏‏‏‏‏‏ فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے ظہر پانچ رکعت پڑھی تو آپ سے پوچھا گیا: کیا نماز بڑھا دی گئی ہے؟ (یعنی چار کے بجائے پانچ رکعت کر دی گئی ہے) تو آپ نے سلام پھیرنے کے بعد دو سجدے کئے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;