var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،وَمَحْمُودُ بْنُ غَيْلَانَ،قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ سَجْدَتَيِ السَّهْوِ بَعْدَ الْكَلَامِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ مُعَاوِيَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ جَعْفَرٍ،‏‏‏‏ وَأَبِي هُرَيْرَةَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے سہو کے دونوں سجدے بات کرنے کے بعد کئے۔امام ترمذی کہتے ہیں: ۱-ابن مسعود رضی الله عنہ کی حدیث حسن صحیح ہے ۱؎،۲-اس باب میں معاویہ،عبداللہ بن جعفر اور ابوہریرہ رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;