var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الْعَقَدِيُّ بَصْرِيٌّ،‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ سَامٌ أَبُو الْعَرَبِ،‏‏‏‏‏‏وَيَافِثُ أَبُو الرُّومِ،‏‏‏‏‏‏وَحَامٌ أَبُو الْحَبَشِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ يَافِثُ،‏‏‏‏‏‏وَيَافِتُ،‏‏‏‏‏‏وَيفِثُ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ’’«سام» عربوں کے جد امجد ہیں اور «یافث» رومیوں کے اور «حام» حبشیوں کے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے اور «یافث»،‏‏‏‏ «یافِتُ» اور «یَفِتُ» تینوں لغتیں ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `ضعیف <br>انظر الحدیث السابق (3231)`;
tirmizi.anwaar = [316,1];