var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَتَاكُمْ أَهْلُ الْيَمَنِ هُمْ أَضْعَفُ قُلُوبًا،‏‏‏‏ وَأَرَقُّ أَفْئِدَةً الْإِيمَانُ يَمَانٍ،‏‏‏‏ وَالْحِكْمَةُ يَمَانِيَةٌ . وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ،‏‏‏‏‏‏وَابْنِ مَسْعُودٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تمہارے پاس اہل یمن آئے وہ نرم دل اور رقیق القلب ہیں،ایمان یمنی ہے اور حکمت بھی یمنی ہے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس اور ابن مسعود رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;