var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ،حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ،حَدَّثَنَا أَبُو مَرْيَمَ الْأَنْصَارِيُّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُلْكُ فِي قُرَيْشٍ،‏‏‏‏‏‏وَالْقَضَاءُ فِي الْأَنْصَارِ،‏‏‏‏‏‏وَالْأَذَانُ فِي الْحَبَشَةِ،‏‏‏‏‏‏وَالْأَمَانَةُ فِي الْأَزْدِ يَعْنِي:‏‏‏‏ الْيَمَنَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”سلطنت (حکومت) قریش میں رہے گی،اور قضاء انصار میں اور اذان حبشہ میں اور امانت قبیلہ ازد میں یعنی یمن میں“۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 6001`;