var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ الْعَطَّارُ الْبَصْرِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ الْبَصْرِيُّ،حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ،حَدَّثَنِي غَيْلَانُ بْنُ جَرِيرٍ،قَال:‏‏‏‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ:‏‏‏‏ إِنْ لَمْ نَكُنْ مِنَ الْأَزْدِ،‏‏‏‏‏‏فَلَسْنَا مِنَ النَّاسِ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "اگر ہم ازدی (یعنی قبیلہ ازد کے) نہ ہوں تو ہم آدمی ہیں ہی نہیں ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;