var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ،حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،قَالَ:‏‏‏‏ قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏‏‏أَخْرَقَتْنَا نِبَالُ ثَقِيفٍ فَادْعُ اللَّهَ عَلَيْهِمْ،‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ اهْدِ ثَقِيفًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "لوگوں نے عرض کیا: اللہ کے رسول! ثقیف کے تیروں نے ہمیں زخمی کر دیا،تو آپ اللہ سے ان کے لیے بد دعا فرمائیں،آپ نے فرمایا: «اللهم اهد ثقيفا» ”اے اللہ! ثقیف کو ہدایت دے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو الزبیر عنعن <br>ورواہ عبد الرحمن بن سابط عن جابر بہ مختصرًا (مسند أحمد: 343/3)<br>وعبد الرحمن لم یسمع من جابر رضي اللّٰہ عنہ`;
tirmizi.anwaar = [316,1];