var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ الطَّائِيُّ،حَدَّثَنَا عَبْدُ الْقَاهِرِ بْنُ شُعَيْبٍ،حَدَّثَنَا هِشَامٌ،عَنْ الْحَسَنِ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،قَالَ:‏‏‏‏ مَاتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَكْرَهُ ثَلَاثَةَ أَحْيَاءٍ:‏‏‏‏ ثَقِيفًا،‏‏‏‏‏‏وَبَنِي حَنِيفَةَ،‏‏‏‏‏‏وَبَنِي أُمَيَّةَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ کی وفات ہوئی اور آپ تین قبیلوں ثقیف،بنی حنیفہ اور بنی امیہ کو ناپسند کرتے تھے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ہشام بن حسان والحسن البصري عنعنا <br>ولہ شاھد ضعیف عند الحاکم (4/ 480۔481 ح 8482)`;
tirmizi.anwaar = [316,1];