var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ زَنْجَوَيْهِ الْبَغْدَادِيُّ،وَغَيْرُ وَاحِدٍ،‏‏‏‏ قَالَ:‏‏‏‏ حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ،حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ،عَنْ أَبِي يَحْيَى الْقَتَّاتِ،عَنْ مُجَاهِدٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مِفْتَاحُ الْجَنَّةِ الصَّلَاةُ وَمِفْتَاحُ الصَّلَاةِ الْوُضُوءُ";
tirmizi.urdu = "رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”نماز جنت کی کنجی ہے،اور نماز کی کنجی وضو ہے“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سلیمان بن قرم ھو سلیمان بن معاذ: ضعیف<br>وأبو یحیی القتات: لین الحدیث<br>والحدیث السابق (الأصل: 3) مع شواہدہ یغني عنہ`;
tirmizi.anwaar = [189,1];