var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ،عَنْ يَزِيدَ بْنِ عَمْرٍو،عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ،عَنْ الْمُسْتَوْرِدِ بْنِ شَدَّادٍ الْفِهْرِيِّ،قَالَ:‏‏‏‏ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأَ دَلَكَ أَصَابِعَ رِجْلَيْهِ بِخِنْصَرِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ.";
tirmizi.urdu = "میں نے نبی اکرم صلی الله علیہ وسلم کو دیکھا کہ جب آپ وضو کرتے تو اپنے دونوں پیروں کی انگلیوں کو اپنے «خنصر» (ہاتھ کی چھوٹی انگلی) سے ملتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،اسے ہم صرف ابن لھیعہ کے طریق ہی سے جانتے ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 407`;