var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ،‏‏‏‏‏‏وَعَائِشَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے نبی اکرم ﷺ کے ساتھ ظہر سے پہلے دو رکعتیں ۱؎ اور اس کے بعد دو رکعتیں پڑھیں۔امام ترمذی کہتے ہیں: ۱-اس باب میں علی رضی الله عنہ اور عائشہ رضی الله عنہا سے بھی احادیث آئی ہیں،۲-ابن عمر کی حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;