var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،وَمَحْمُودُ بْنُ غَيْلَانَ،وَغَيْرُ وَاحِدٍ،‏‏‏‏‏‏وَأَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ،قَالُوا:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمِ بْنِ مِهْرَانَ،سَمِعَ جَدَّهُ،عَنْ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ رَحِمَ اللَّهُ امْرَأً صَلَّى قَبْلَ الْعَصْرِ أَرْبَعًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ حَسَنٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”اللہ تعالیٰ اس شخص پر رحم کرے جس نے عصر سے پہلے چار رکعتیں پڑھیں“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث غریب حسن ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 1170`;