var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ،عَنْ أَيُّوبَ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ رَافِعِ بْنِ خَدِيجٍ،‏‏‏‏ وَكَعْبِ بْنِ عُجْرَةَ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "میں نے مغرب کے بعد دونوں رکعتیں نبی اکرم ﷺ کے ساتھ آپ کے گھر میں پڑھیں۔امام ترمذی کہتے ہیں: ۱-ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے،۲-اس باب میں رافع بن خدیج اور کعب بن عجرہ رضی الله عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;