var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،حَدَّثَنَا مَعْنُ بْنُ عِيسَى،حَدَّثَنَا مَالِكٌ،عَنْ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً،‏‏‏‏‏‏يُوتِرُ مِنْهَا بِوَاحِدَةٍ،‏‏‏‏‏‏فَإِذَا فَرَغَ مِنْهَا اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ";
tirmizi.urdu = "رسول اللہ ﷺ رات کو گیارہ رکعتیں پڑھتے تھے ان میں سے ایک رکعت وتر ہوتی۔تو جب آپ اس سے فارغ ہو جاتے تو اپنے دائیں کروٹ لیٹتے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن شھاب الزھري مدلس وعنعن<br>وأخرجہ مسلم (736) بلفظ آخر وھو صحیح<br>وانظر الحدیث الآتي (الأصل: 441) وعندہ ’’الإضطجاع بعد الرکعتین‘‘ وھو الصواب`;
tirmizi.anwaar = [200,1];