var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،قَالَ:‏‏‏‏ حَدَّثَنَا وَكِيعٌ،عَنْ شُعْبَةَ،عَنْ أَبِي جَمْرَةَ الضُّبَعِيُّ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو جَمْرَةَ الضُّبَعِيُّ اسْمُهُ:‏‏‏‏ نَصْرُ بْنُ عِمْرَانَ الضُّبَعِيُّ.";
tirmizi.urdu = "نبی اکرم ﷺ رات کو تیرہ رکعتیں پڑھتے تھے ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-ابوحمزہ ضبعی کا نام نصر بن عمران ضبعی ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;