var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ الْأَسْوَدِ بْنِ يَزِيدَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَزَيْدِ بْنِ خَالِدٍ،‏‏‏‏ وَالْفَضْلِ بْنِ عَبَّاسٍ،‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏";
tirmizi.urdu = "نبی اکرم ﷺ رات کو نو رکعتیں پڑھتے تھے ۱؎۔امام ترمذی کہتے ہیں: ۱-عائشہ رضی الله عنہا کی حدیث اس سند سے حسن غریب ہے،۲-اس باب میں ابوہریرہ،زید بن خالد اور فضل بن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;