var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى الْفَزَارِيُّ،حَدَّثَنَا شَرِيكٌ،عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّةَ،قَالَ:‏‏‏‏ قُلْتُ لِأَبِي جَعْفَرٍ:‏‏‏‏ حَدَّثَكَ جَابِرٌ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ مَرَّةً مَرَّةً،‏‏‏‏ وَمَرَّتَيْنِ مَرَّتَيْنِ،‏‏‏‏ وَثَلَاثًا ثَلَاثًا،‏‏‏‏ قَالَ:‏‏‏‏ نَعَمْ.";
tirmizi.urdu = "میں نے ابو جعفر سے پوچھا: کیا جابر رضی الله عنہما نے آپ سے یہ بیان کیا ہے کہ نبی اکرم صلی الله علیہ وسلم نے اعضائے وضو ایک ایک بار،دو دو بار،اور تین تین بار دھوئے ہیں؟ تو انہوں نے کہا: جی ہاں (بیان کیا ہے)۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا<br>ابن ماجہ (41)<br>ثابت بن أبي صفیۃ : ضعیف رافضي (تقریب: 818)<br>وشریک القاضي عنعن<br>وحدیث البخاري (157،158،159) یغني عنہ`;
tirmizi.anwaar = [190,1];