var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ،عَنْ أَبِيهِ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ نَامَ عَنِ الْوِتْرِ أَوْ نَسِيَهُ فَلْيُصَلِّ إِذَا ذَكَرَ وَإِذَا اسْتَيْقَظَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جو وتر پڑھے بغیر سو جائے،یا اسے پڑھنا بھول جائے تو جب یاد آئے یا جاگے پڑھ لے“۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 1279`;