var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ،عَنْ مَيْمُونِ بْنِ مُوسَى الْمَرَئِيِّ،عَنْ الْحَسَنِ،عَنْ أُمِّهِ،عَنْ أُمِّ سَلَمَةَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْوِتْرِ رَكْعَتَيْنِ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رُوِيَ نَحْوُ هَذَا عَنْ أَبِي أُمَامَةَ،‏‏‏‏‏‏وَعَائِشَةَ وَغَيْرِ وَاحِدٍ،‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.";
tirmizi.urdu = "نبی اکرم ﷺ وتر کے بعد دو رکعتیں پڑھتے تھے ۱؎۔امام ترمذی کہتے ہیں: ابوامامہ،عائشہ رضی الله عنہما اور دیگر کئی لوگوں سے بھی نبی اکرم ﷺ سے اسی طرح مروی ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 1284`;