var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ،عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ،عَنْ عَطِيَّةَ الْعَوْفِيِّ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى حَتَّى نَقُولَ:‏‏‏‏ لَا يَدَعُ وَيَدَعُهَا حَتَّى نَقُولَ:‏‏‏‏ لَا يُصَلِّي . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ چاشت کی نماز پڑھتے تھے۔یہاں تک کہ ہم کہتے کہ آپ اسے نہیں چھوڑیں گے،اور آپ اسے چھوڑ دیتے یہاں تک کہ ہم کہتے کہ اب اسے نہیں پڑھیں گے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عطیۃ العوفي ضعیف مدلس`;
tirmizi.anwaar = [201,1];