var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،أَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَصَلَّى سَجْدَتَيْنِ فِي بَيْتِهِ،‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ابن عمر رضی الله عنہما جب جمعہ پڑھ لیتے تو (گھر) واپس آتے اور دو رکعت اپنے گھر میں پڑھتے پھر کہتے رسول اللہ ﷺ ایسا ہی کرتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = `مشکوۃ المصابیح: 1187`;