var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ،وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ،عَنْ أَبِي حَازِمٍ،عَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اللَّهُ عَنْهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا كُنَّا نَتَغَذَّى فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَقِيلُ إِلَّا بَعْدَ الْجُمُعَةِ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ سَهْلِ بْنِ سَعْدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ہم لوگ رسول اللہ ﷺ کے زمانے میں جمعہ کے بعد ہی کھانا کھاتے اور قیلولہ کرتے تھے۔امام ترمذی کہتے ہیں: ۱-سہل بن سعد کی حدیث حسن صحیح ہے،۲-اس باب میں انس بن مالک سے بھی روایت ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;