var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،وَأَبُو خَالِدٍ الْأَحْمَرُ،عَنْ مُحَمَّدِ بْنِ إِسْحَاق،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا نَعَسَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ فَلْيَتَحَوَّلْ مِنْ مَجْلِسِهِ ذَلِكَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جب تم میں سے کوئی جمعہ کے دن اونگھے تو اپنی جگہ بدل دے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 1394`;