var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا هُشَيْمٌ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ الْبَرَاءِ حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏وَرِوَايَةُ هُشَيْمٍ أَحْسَنُ مِنْ رِوَايَةِ إِسْمَاعِيل بْنِ إِبْرَاهِيمَ التَّيْمِيِّ،‏‏‏‏‏‏وَإِسْمَاعِيل بْنُ إِبْرَاهِيمَ التَّيْمِيُّ يُضَعَّفُ فِي الْحَدِيثِ.";
tirmizi.urdu = "اسی طرح مروی ہے۔امام ترمذی کہتے ہیں: ۱-براء رضی الله عنہ کی حدیث حسن ہے،۲-ہشیم کی روایت (رقم ۵۲۹) اسماعیل بن ابراہیم تیمی کی روایت (رقم ۵۲۸) سے زیادہ اچھی ہے،۳-اسماعیل بن ابراہیم تیمی کو حدیث کے سلسلے میں ضعیف گردانا جاتا ہے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>یزید بن أبي زیاد ضعیف مدلس وعنعن`;
tirmizi.anwaar = [203,1];