var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ،حَدَّثَنَا وَكِيعٌ،عَنْ أَبَانَ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ،عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ وَهُوَ ابْنُ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَهُوَ ابْنُ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ،عَنْ ابْنِ عُمَرَ أَنَّهُ خَرَجَ فِي يَوْمِ عِيدٍ فَلَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا،‏‏‏‏‏‏وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "وہ عید کے دن نکلے تو انہوں نے نہ اس سے پہلے کوئی نماز پڑھی اور نہ اس کے بعد اور ذکر کیا کہ نبی اکرم ﷺ نے ایسے ہی کیا ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;