var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ،سمعا أنس بن مالك،قَالَ:‏‏‏‏ صَلَّيْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَبِذِي الْحُلَيْفَةِ الْعَصْرَ رَكْعَتَيْنِ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ہم نے نبی اکرم ﷺ کے ساتھ مدینہ میں چار رکعتیں پڑھیں ۱؎ اور ذی الحلیفہ ۲؎ میں دو رکعتیں پڑھیں۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;