var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا هُشَيْمٌ،عَنْ مَنْصُورِ بْنِ زَاذَانَ،عَنْ ابْنِ سِيرِينَ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ لَا يَخَافُ إِلَّا اللَّهَ رَبَّ الْعَالَمِينَ فَصَلَّى رَكْعَتَيْنِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ مدینہ سے مکہ کے لیے نکلے،آپ کو سوائے اللہ رب العالمین کے کسی کا خوف نہ تھا۔(اس کے باوجود) آپ نے دو ہی رکعتیں پڑھیں ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;