var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ الْحَجَّاجِ،عَنْ عَطِيَّةَ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فِي السَّفَرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏وَقَدْ رَوَاهُ ابْنُ أَبِي لَيْلَى،‏‏‏‏‏‏عَنْ عَطِيَّةَ،‏‏‏‏‏‏وَنَافِعٍ،‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ.";
tirmizi.urdu = "میں نے نبی اکرم ﷺ کے ساتھ سفر میں ظہر کی دو رکعتیں پڑھیں اور اس کے بعد دو رکعںیی۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-ابن ابی لیلیٰ نے یہ حدیث عطیہ اور نافع سے روایت کی ہے اور ان دونوں نے ابن عمر رضی الله عنہما سے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عطیۃ العوفي: ضعیف`;
tirmizi.anwaar = [204,1];