var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ،عَنْ عَمْرِو بْنِ الْحَارِثِ،عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ،عَنْ عُمَرَ الدِّمَشْقِيِّ،عَنْ أُمِّ الدَّرْدَاءِ،عَنْ أَبِي الدَّرْدَاءِ،قَالَ:‏‏‏‏ سَجَدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى عَشْرَةَ سَجْدَةً مِنْهَا الَّتِي فِي النَّجْمِ .";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کے ساتھ گیارہ سجدے کئے۔ان میں سے ایک وہ تھا جو سورۂ نجم میں ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (1055)<br>عمر الدمشقي: مجہول (تقریب: 4886) وبینہ وبین أم الدرداء رجل مجہول،انظر الحدیث الآتي (569)`;
tirmizi.anwaar = [204,1];