var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،حَدَّثَنَا خَالِدٌ الْحَذَّاءُ،عَنْ أَبِي الْعَالِيَةِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ:‏‏‏‏ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ رات کے وقت قرآن کے سجدوں کہتے: «سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته» ”میرے چہرے نے اس ذات کو سجدہ کیا ہے جس نے اسے بنایا،اور اپنی طاقت و قوت سے اس کے کان اور اس کی آنکھیں پھاڑیں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (1414) نسائي (1130) والحدیث الآتی (3425)<br>رجل: مجہول<br>والحدیث صحیح فی السجود مطلقًا،انظر سنن أبي داود (760) وصحیح مسلم (771)`;
tirmizi.anwaar = [204,1];