var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ جَابِرِ بْنِ سَمُرَةَ،قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الْفَجْرَ قَعَدَ فِي مُصَلَّاهُ حَتَّى تَطْلُعَ الشَّمْسُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ جب فجر پڑھتے تو اپنے مصلے پر بیٹھے رہتے یہاں تک کہ سورج نکل آتا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;