var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا وَكِيعٌ،عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ،عَنْ بَعْضِ أَصْحَابِ عِكْرِمَةَ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْحَظُ فِي الصَّلَاةِ فَذَكَرَ نَحْوَهُ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَنَسٍ،‏‏‏‏‏‏وَعَائِشَةَ.";
tirmizi.urdu = "نبی اکرم ﷺ نماز میں ترچھی نظر سے دیکھتے تھے۔آگے انہوں نے اسی طرح کی حدیث ذکر کی۔امام ترمذی کہتے ہیں: اس باب میں انس اور ام المؤمنین عائشہ رضی الله عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;