var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَاتِمٍ مُسْلِمُ بْنُ حَاتِمٍ الْبَصْرِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ،عَنْ أَبِيهِ،عَنْ عَلِيِّ بْنِ زَيْدٍ،عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ،قَالَ:‏‏‏‏ قَالَ أَنَسُ بْنُ مَالِكٍ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا بُنَيَّ إِيَّاكَ وَالِالْتِفَاتَ فِي الصَّلَاةِ،‏‏‏‏‏‏فَإِنَّ الِالْتِفَاتَ فِي الصَّلَاةِ هَلَكَةٌ،‏‏‏‏‏‏فَإِنْ كَانَ لَا بُدَّ فَفِي التَّطَوُّعِ لَا فِي الْفَرِيضَةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "مجھ سے رسول اللہ ﷺ نے فرمایا: ”اے میرے بیٹے! نماز میں ادھر ادھر (گردن موڑ کر) دیکھنے سے بچو،نماز میں گردن موڑ کر ادھر ادھر دیکھنا ہلاکت ہے،اگر دیکھنا ضروری ہی ٹھہرے تو نفل نماز میں دیکھو،نہ کہ فرض میں“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>علي بن زید بن جدعان: ضعیف`;
tirmizi.anwaar = [204,1];