var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا أَبُو الْأَحْوَصِ،عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ،عَنْ أَبِيهِ،عَنْ مَسْرُوقٍ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الِالْتِفَاتِ فِي الصَّلَاةِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هُوَ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ صَلَاةِ الرَّجُلِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "میں نے رسول اللہ ﷺ سے نماز میں ادھر ادھر (گردن موڑ کر) دیکھنے کے بارے میں پوچھا تو آپ نے کہا: ”یہ تو اچک لینا ہے،شیطان آدمی کی نماز اچک لیتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;