var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ الْبَغْدَادِيُّ الْبَصْرِيُّ،حَدَّثَنَا عَامِرُ بْنُ صَالِحٍ الزُّبَيْرِيُّ هُوَ مِنْ وَلَدِ الزُّبَيْرِ،‏‏‏‏‏‏حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبِنَاءِ الْمَسَاجِدِ فِي الدُّورِ وَأَنْ تُنَظَّفَ وَتُطَيَّبَ .";
tirmizi.urdu = "رسول اللہ ﷺ نے محلوں میں مسجد بنانے،انہیں صاف رکھنے اور خوشبو سے بسانے کا حکم دیا ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 717`;