var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،أَنِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ فَذَكَرَ نَحْوَهُ. وقَالَ سُفْيَانُ:‏‏‏‏ قَوْلُهُ بِبِنَاءِ الْمَسَاجِدِ فِي الدُّورِ يَعْنِي الْقَبَائِلَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے حکم دیا،آگے اسی طرح کی حدیث انہوں نے ذکر کی۔سفیان کہتے ہیں: دور یا محلوں میں مسجدیں بنانے سے مراد قبائل میں مسجدیں بنانا ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;