var tirmizi = {};
tirmizi.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ،عَنْ أَنَسِ بْنِ مَالِكٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلَاءَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم صلی الله علیہ وسلم جب قضائے حاجت کے لیے بیت الخلاء میں داخل ہوتے تو پڑھتے: «اللهم إني أعوذ بك من الخبث والخبائث» ”اے اللہ میں تیری پناہ چاہتا ہوں ناپاک جنوں اور ناپاک جنیوں سے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;