var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ،قَالَ:‏‏‏‏ حَدَّثَنَا نُعَيْمُ بْنُ مَيْسَرَةَ النَّحْوِيُّ،عَنْ خَالِدِ بْنِ زِيَادٍ نَحْوَهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ مِثْلَ هَذَا إِلَّا مِنْ حَدِيثِ مُقَاتِلِ بْنِ حَيَّانَ،‏‏‏‏‏‏عَنْ شَهْرِ بْنِ حَوْشَبٍ.";
tirmizi.urdu = "خالد بن زیاد سے اسی طرح مروی ہے۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے ہم اسے اس طرح مقاتل بن حیان کی سند سے جانتے ہیں انہوں نے اسے شہر بن حوشب سے روایت کیا ہے ۱؎۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;