var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا قَبِيصَةُ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ عَطَاءٍ الْخُرَاسَانِيِّ،عَنْ يَحْيَى بْنِ يَعْمَرَ،عَنْ عَمَّارٍ،أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلْجُنُبِ إِذَا أَرَادَ أَنْ يَأْكُلَ أَوْ يَشْرَبَ أَوْ يَنَامَ أَنْ يَتَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے جنبی کو جب وہ کھانا،پینا اور سونا چاہے اس بات کی رخصت دی کہ وہ اپنی نماز کے وضو کی طرح وضو کر لے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (225)<br>یحیی بن یعمر رواہ عن رجل عن عمار بن یاسر والرجل مجھول`;
tirmizi.anwaar = [205,1];