var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ،‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ أَبَا عُبَيْدَةَ بْنَ عَبْدِ اللَّهِ:‏‏‏‏ هَلْ يَذْكُرُ عَنْ عَبْدِ اللَّهِ شَيْئًا؟ قَالَ:‏‏‏‏ لَا.";
tirmizi.urdu = "میں نے ابوعبیدہ بن عبداللہ سے پوچھا: کیا وہ (اپنے والد) عبداللہ بن مسعود رضی الله عنہ سے کوئی چیز یاد رکھتے ہیں؟ انہوں نے کہا: نہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;