var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ أَكْثَمَ،حَدَّثَنَا جَرِيرٌ،عَنْ قَابُوسَ بْنِ أَبِي ظَبْيَانَ،عَنْ أَبِيهِ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَصْلُحُ قِبْلَتَانِ فِي أَرْضٍ وَاحِدَةٍ وَلَيْسَ عَلَى الْمُسْلِمِينَ جِزْيَةٌ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ایک سر زمین پر دو قبلے ہونا درست نہیں ۱؎ اور نہ ہی مسلمانوں پر جزیہ درست ہے“ ۲؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (3032)<br>قابوس بن أبي ظبیان: فیہ لین (تقریب: 5445) ضعیف ضعفہ الجمہور`;
tirmizi.anwaar = [206,1];