var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ الْأَعْمَشِ،عَنْ أَبِي وَائِلٍ،عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ الْمُصْطَلِقِ،عَنْ ابْنِ أَخِي زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ،عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،‏‏‏‏‏‏قَالَتْ:‏‏‏‏ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ،‏‏‏‏‏‏فَإِنَّكُنَّ أَكْثَرُ أَهْلِ جَهَنَّمَ يَوْمَ الْقِيَامَةِ .";
tirmizi.urdu = "رسول اللہ ﷺ نے ہم سے خطاب کیا اور فرمایا: ”اے گروہ عورتوں کی جماعت! زکاۃ دو ۱؎ گو اپنے زیورات ہی سے کیوں نہ دو۔کیونکہ قیامت کے دن جہنم والوں میں تم ہی سب سے زیادہ ہو گی“۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 1808
وأصلہ عند البخاري (1466) ومسلم (1000)`;