var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ دَاوُدَ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ دَاوُدَ،‏‏‏‏‏‏عَنْ الشَّعْبِيِّ أَصَحُّ مِنْ حَدِيثِ مُجَالِدٍ،‏‏‏‏‏‏وَقَدْ ضَعَّفَ مُجَالِدًا بَعْضُ أَهْلِ الْعِلْمِ وَهُوَ كَثِيرُ الْغَلَطِ.";
tirmizi.urdu = "جریر رضی الله عنہ کے واسطہ سے نبی اکرم ﷺ سے اسی طرح مروی ہے۔امام ترمذی کہتے ہیں: داود کی شعبی سے روایت کی ہوئی حدیث مجالد کی حدیث سے زیادہ صحیح ہے،مجالد کو بعض اہل علم نے ضعیف گردانا ہے وہ کثیر الغلط ہیں یعنی ان سے بکثرت غلطیاں ہوتی ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;