var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِيسَى الْخَزَّارُ الْبَصْرِيُّ،عَنْ يُونُسَ بْنِ عُبَيْدٍ،عَنْ الْحَسَنِ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الصَّدَقَةَ لَتُطْفِئُ غَضَبَ الرَّبِّ وَتَدْفَعُ عَنْ مِيتَةِ السُّوءِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”صدقہ رب کے غصے کو بجھا دیتا ہے اور بری موت سے بچاتا ہے“۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>عبد اللّٰہ بن عیسی الخزاز: ضعیف (تقریب: 3524)<br>والحسن عنعن<br>وللحدیث شواہد ضعیفۃ`;
tirmizi.anwaar = [207,1];