var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ،أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا إِسْمَاعِيل بْنُ زَكَرِيَّا،عَنْ الْحَجَّاجِ بْنِ دِينَارٍ،عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ،عَنْ حُجَيَّةَ بْنِ عَدِيٍّ،عَنْ عَلِيٍّ،أَنَّ الْعَبَّاسَ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ،‏‏‏‏‏‏فَرَخَّصَ لَهُ فِي ذَلِكَ .";
tirmizi.urdu = "عباس رضی الله عنہ نے رسول اللہ ﷺ سے اپنی زکاۃ وقت سے پہلے دینے کے بارے میں پوچھا تو آپ نے انہیں اس کی اجازت دی۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (1624) ابن ماجہ (1795)<br>الحکم بن عتیبۃ عنعن`;
tirmizi.anwaar = [207,1];