var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا سُفْيَانُ،عَنْ عَبْدِالْمَلِكِ بْنِ عُمَيْرٍ،عَنْ زَيْدِ بْنِ عُقْبَةَ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنْ الْمَسْأَلَةَ كَدٌّ يَكُدُّ بِهَا الرَّجُلُ وَجْهَهُ إِلاَّ أَنْ يَسْأَلَ الرَّجُلُ سُلْطَانًا أَوْ فِي أَمْرٍ لاَ بُدَّ مِنْهُ . قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”مانگنا ایک زخم ہے جس سے آدمی اپنا چہرہ زخمی کر لیتا ہے،سوائے اس کے کہ آدمی حاکم سے مانگے ۱؎ یا کسی ایسے کام کے لیے مانگے جو ضروری اور ناگزیر ہو“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 1846`;