var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ عَلِيِّ بْنِ الْمُبَارَكِ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَقَدَّمُوا شَهْرَ رَمَضَانَ بِصِيَامٍ قَبْلَهُ بِيَوْمٍ أَوْ يَوْمَيْنِ،‏‏‏‏‏‏إِلَّا أَنْ يَكُونَ رَجُلٌ كَانَ يَصُومُ صَوْمًا فَلْيَصُمْهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”رمضان سے ایک یا دو دن پہلے (رمضان کے استقبال میں) روزہ نہ رکھو سوائے اس کے کہ آدمی اس دن روزہ رکھتا آ رہا ہو تو اسے رکھے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;