var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ الْأَوْزَاعِيِّ،عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَالَ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ أَحَبُّ عِبَادِي إِلَيَّ أَعْجَلُهُمْ فِطْرًا .";
tirmizi.urdu = "کہ رسول اللہ ﷺ نے فرمایا: ”اللہ عزوجل فرماتا ہے: مجھے میرے بندوں میں سب سے زیادہ محبوب وہ ہیں جو افطار میں جلدی کرنے والے ہیں“ ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>الزہري عنعن`;
tirmizi.anwaar = [208,1];