var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ،حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ،عَنْ قَتَادَةَ،عَنْ أَنَسِ بْنِ مَالِكٍ،عَنْ زَيْدِ بْنِ ثَابِتٍ،قَالَ:‏‏‏‏ تَسَحَّرْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏ثُمَّ قُمْنَا إِلَى الصَّلَاةِ،‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ كَمْ كَانَ قَدْرُ ذَلِكَ؟ قَالَ:‏‏‏‏ قَدْرُ خَمْسِينَ آيَةً .";
tirmizi.urdu = "زید بن ثابت رضی الله عنہ کہتے ہیں: ہم نے نبی اکرم ﷺ کے ساتھ سحری کی،پھر ہم نماز کے لیے کھڑے ہوئے،انس کہتے ہیں کہ میں نے پوچھا: اس کی مقدار کتنی تھی؟ ۱؎ انہوں نے کہا: پچاس آیتوں کے (پڑھنے کے) بقدر ۲؎۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;