var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ هِشَامٍ بِنَحْوِهِ،‏‏‏‏‏‏إِلَّا أَنَّهُ قَالَ:‏‏‏‏ قَدْرُ قِرَاءَةِ خَمْسِينَ آيَةً. قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ حُذَيْفَةَ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ زَيْدِ بْنِ ثَابِتٍ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَبِهِ يَقُولُ الشَّافِعِيُّ،‏‏‏‏‏‏وَأَحْمَدُ،‏‏‏‏‏‏وَإِسْحَاق:‏‏‏‏ اسْتَحَبُّوا تَأْخِيرَ السُّحُورِ.";
tirmizi.urdu = "ہشام سے اسی طرح مروی ہے البتہ اس میں یوں ہے: پچاس آیتوں کے پڑھنے کے بقدر۔امام ترمذی کہتے ہیں: ۱-زید بن ثابت رضی الله عنہ کی حدیث حسن صحیح ہے،۲-اس باب میں حذیفہ رضی الله عنہ سے بھی روایت ہے،۳-یہی شافعی،احمد اور اسحاق بن راہویہ کا قول ہے،ان لوگوں نے سحری میں دیر کرنے کو پسند کیا ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;