var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،وَيُوسُفُ بْنُ عِيسَى،قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ،عَنْ أَبِي هِلَالٍ،عَنْ سَوَادَةَ بْنِ حَنْظَلَةَ هُوَ الْقُشَيْرِيُّ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَمْنَعَنَّكُمْ مِنْ سُحُورِكُمْ أَذَانُ بِلَالٍ وَلَا الْفَجْرُ الْمُسْتَطِيلُ،‏‏‏‏‏‏وَلَكِنْ الْفَجْرُ الْمُسْتَطِيرُ فِي الْأُفُقِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”تمہیں سحری کھانے سے بلال کی اذان باز نہ رکھے اور نہ ہی لمبی فجر باز رکھے،ہاں وہ فجر باز رکھے جو کناروں میں پھیلتی ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = `مشکوۃ المصابیح: 681`;