var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ،قَالَ:‏‏‏‏ وَأَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ،عَنْ الْمَقْبُرِيِّ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ،‏‏‏‏‏‏فَلَيْسَ لِلَّهِ حَاجَةٌ بِأَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَنَسٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جو ( «صائم») جھوٹ بولنا اور اس پر عمل کرنا نہ چھوڑے تو اللہ تعالیٰ کو اس کے کھانا پینا چھوڑنے کی کوئی ضرورت نہیں ہے“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;