var tirmizi = {};
tirmizi.arabic = "حدیث نمبر: 712 حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ،عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي مَسْلَمَةَ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ كُنَّا نُسَافِرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ،‏‏‏‏‏‏فَمَا يَعِيبُ عَلَى الصَّائِمِ صَوْمَهُ وَلَا عَلَى الْمُفْطِرِ إِفْطَارَهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ہم لوگ رسول اللہ ﷺ کے ساتھ رمضان میں سفر کرتے تو نہ آپ روزہ رکھنے والے کے روزہ رکھنے پر نکیر کرتے اور نہ ہی روزہ نہ رکھنے والے کے روزہ نہ رکھنے پر۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;