var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ،عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،عَنْ قَتَادَةَ،عَنْ ابْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَكَلَ أَوْ شَرِبَ نَاسِيًا فَلَا يُفْطِرْ،‏‏‏‏‏‏فَإِنَّمَا هُوَ رِزْقٌ رَزَقَهُ اللَّهُ .";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے بھول کر کچھ کھا پی لیا،وہ روزہ نہ توڑے،یہ روزی ہے جو اللہ نے اسے دی ہے“ ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;