var tirmizi = {};
tirmizi.arabic = "حدیث نمبر: 728 حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا إِسْرَائِيلُ،عَنْ أَبِي إِسْحَاق،عَنْ أَبِي مَيْسَرَةَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَاشِرُنِي وَهُوَ صَائِمٌ،‏‏‏‏‏‏وَكَانَ أَمْلَكَكُمْ لِإِرْبِهِ .";
tirmizi.urdu = "رسول اللہ ﷺ روزے کی حالت میں مجھ سے بوس و کنار کرتے تھے،آپ اپنی خواہش پر تم میں سب سے زیادہ کنٹرول رکھنے والے تھے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;