var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،وَالْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ وَيُبَاشِرُ وَهُوَ صَائِمٌ،‏‏‏‏‏‏وَكَانَ أَمْلَكَكُمْ لِإِرْبِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو مَيْسَرَةَ اسْمُهُ عَمْرُو بْنُ شُرَحْبِيلَ،‏‏‏‏‏‏وَمَعْنَى لِإِرْبِهِ لِنَفْسِهِ.";
tirmizi.urdu = "رسول اللہ ﷺ روزے کی حالت میں بوسہ لیتے اور اپنی بیویوں کے ساتھ لپٹ کر لیٹتے تھے،آپ اپنی جنسی خواہش پر تم میں سب سے زیادہ کنٹرول رکھنے والے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اور «لإربه» کے معنی «لنفسه» ”اپنے نفس پر“ کے ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;