var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ طَلْحَةَ بْنِ يَحْيَى،عَنْ عَمَّتِهِ عَائِشَةَ بِنْتِ طَلْحَةَ،عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ،‏‏‏‏‏‏قَالَتْ:‏‏‏‏ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا،‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَلْ عِنْدَكُمْ شَيْءٌ،‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قُلْتُ:‏‏‏‏ لَا،‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنِّي صَائِمٌ .";
tirmizi.urdu = "رسول اللہ ﷺ ایک دن میرے پاس آئے اور آپ نے پوچھا: ”کیا تمہارے پاس کچھ (کھانے کو) ہے“ میں نے عرض کیا: نہیں،تو آپ نے فرمایا: ”تو میں روزے سے ہوں“۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;