var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي بِشْرٍ،عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ . قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ماہ رمضان کے بعد سب سے افضل روزہ اللہ کے مہینے ۱؎ محرم کا روزہ ہے“۔امام ترمذی کہتے ہیں: ابوہریرہ رضی الله عنہ کی حدیث حسن ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;