var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو أَحْمَدَ،وَمُعَاوِيَةُ بْنُ هِشَامٍ،قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ،عَنْ مَنْصُورٍ،عَنْ خَيْثَمَةَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنَ الشَّهْرِ السَّبْتَ وَالْأَحَدَ وَالِاثْنَيْنِ وَمِنَ الشَّهْرِ الْآخَرِ الثُّلَاثَاءَ وَالْأَرْبِعَاءَ وَالْخَمِيسَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏وَرَوَى عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ هَذَا الْحَدِيثَ،‏‏‏‏‏‏عَنْ سُفْيَانَ وَلَمْ يَرْفَعْهُ.";
tirmizi.urdu = "رسول اللہ ﷺ ایک مہینہ ہفتہ (سنیچر)،اتوار اور سوموار (دوشنبہ) کو اور دوسرے مہینہ منگل،بدھ،اور جمعرات کو روزہ رکھتے تھے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-عبدالرحمٰن بن مہدی نے اس حدیث کو سفیان سے روایت کیا ہے اور اسے مرفوع نہیں کیا ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>قال ابو داود: وخیثمہ (بن عبد الرحمٰن) لم یسمع من عائشۃ (سنن أبي داود: 2128)`;
tirmizi.anwaar = [209,1];