var tirmizi = {};
tirmizi.arabic = "حدثنا قتيبة حدثنا عبد الوارث عن يونس عن الحسن عن ابن عباس قال:‏‏‏‏ امر رسول الله صلى الله عليه وسلم بصوم عاشوراء يوم العاشر . قال ابو عيسى:‏‏‏‏ حديث ابن عباس حديث حسن صحيح واختلف اهل العلم في يوم عاشوراء فقال بعضهم:‏‏‏‏ يوم التاسع وقال بعضهم:‏‏‏‏ يوم العاشر وروي عن ابن عباس انه قال:‏‏‏‏ صوموا التاسع والعاشر وخالفوا اليهود وبهذا الحديث يقول الشافعي واحمد وإسحاق.";
tirmizi.urdu = "رسول اللہ ﷺ نے دسویں تاریخ کو عاشوراء کا روزہ رکھنے کا حکم دیا۔امام ترمذی کہتے ہیں: ۱-ابن عباس کی حدیث حسن صحیح ہے،۲-اہل علم کا عاشوراء کے دن کے سلسلے میں اختلاف ہے۔بعض کہتے ہیں: عاشوراء نواں دن ہے اور بعض کہتے ہیں: دسواں دن ۱؎ ابن عباس سے مروی ہے کہ نویں اور دسویں دن کا روزہ رکھو اور یہودیوں کی مخالفت کرو۔شافعی،احمد اور اسحاق بن راہویہ کا قول اسی حدیث کے مطابق ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>الحسن البصري مدلس وعنعن`;
tirmizi.anwaar = [210,1];