var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ سِمَاكِ بْنِ حَرْبٍ،عَنْ أَبِي الرَّبِيعِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ عَهِدَ إِلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةً:‏‏‏‏ أَنْ لَا أَنَامَ إِلَّا عَلَى وِتْرٍ،‏‏‏‏‏‏وَصَوْمَ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ،‏‏‏‏‏‏وَأَنْ أُصَلِّيَ الضُّحَى .";
tirmizi.urdu = "نبی اکرم ﷺ نے مجھ سے تین باتوں کا عہد لیا: ۱-میں وتر پڑھے بغیر نہ سووں،۲-ہر ماہ تین دن کے روزے رکھوں،۳-اور چاشت کی نماز (صلاۃ الضحیٰ) پڑھا کروں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;