var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ،عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،عَنْ أَبِيهِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ حِينَ يُفْطِرُ،‏‏‏‏‏‏وَفَرْحَةٌ حِينَ يَلْقَى رَبَّهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”روزہ دار کے لیے دو خوشیاں ہیں: ایک خوشی افطار کرتے وقت ہوتی ہے اور دوسری اس وقت ہو گی جب وہ اپنے رب سے ملے گا“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;