var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُوسَى،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ،عَنْ حَبِيبِ بْنِ الشَّهِيدِ،عَنْ مَيْمُونِ بْنِ مِهْرَانَ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ صَائِمٌ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے پچھنا لگوایا،آپ روزے سے تھے۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;