var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ الْبَصْرِيُّ،حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ،حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ،عَنْ أَيُّوبَ،عَنْ مُحَمَّدِ بْنِ سِيرِينَ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ فَلْيُجِبْ،‏‏‏‏‏‏فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ . يَعْنِي الدُّعَاءَ";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جب تم میں سے کسی کو کھانے کی دعوت ملے تو اسے قبول کرے،اور اگر وہ روزہ سے ہو تو چاہیئے کہ دعا کرے“ ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;