var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ إِسْمَاعِيل السُّدِّيِّ،عَنْ عَبْدِ اللَّهِ الْبَهِيِّ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ مَا كُنْتُ أَقْضِي مَا يَكُونُ عَلَيَّ مِنْ رَمَضَانَ إِلَّا فِي شَعْبَانَ حَتَّى تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَدْ رَوَى يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ،عَنْ أَبِي سَلَمَةَ،عَنْ عَائِشَةَ نَحْوَ هَذَا.";
tirmizi.urdu = "رمضان کے جو روزے مجھ پر رہ جاتے انہیں میں شعبان ہی میں قضاء کر پاتی تھی۔جب تک کہ رسول اللہ ﷺ کی وفات نہیں ہو گئی۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;