var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،حَدَّثَنَا شُعْبَةُ،عَنْ حَبِيبِ بْنِ زَيْدٍ،عَنْ مَوْلَاةٍ لَهُمْ يُقَالُ لَهَا لَيْلَى،عَنْ جَدَّتِهِ أُمِّ عُمَارَةَ بِنْتِ كَعْبٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ،‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ حَتَّى يَفْرُغُوا أَوْ يَشْبَعُوا. قَالَ أَبُو عِيسَى:‏‏‏‏ وَأُمُّ عُمَارَةَ هِيَ جَدَّةُ حَبِيبِ بْنِ زَيْدٍ الْأَنْصَارِيِّ.";
tirmizi.urdu = "نبی اکرم ﷺ سے اسی طرح مروی ہے اس میں «حتى يفرغوا أو يشبعوا» کا ذکر نہیں ہے۔امام ترمذی کہتے ہیں: ام عمارہ حبیب بن زید انصاری کی دادی ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;