var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا وَكِيعٌ،حَدَّثَنَا سُفْيَانُ،عَنْ أَبِي إِسْحَاق،عَنْ هُبَيْرَةَ بْنِ يَرِيمَ،عَنْ عَلِيٍّ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوقِظُ أَهْلَهُ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "کہ نبی اکرم ﷺ رمضان کے آخری عشرے میں اپنے گھر والوں کو جگاتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;