var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ،عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ،عَنْ إِبْرَاهِيمَ،عَنْ الْأَسْوَدِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ مَا لَا يَجْتَهِدُ فِي غَيْرِهَا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "رسول اللہ ﷺ آخری عشرے میں عبادت میں اتنی کوشش کرتے تھے جتنی دوسرے دنوں میں نہیں کرتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;