var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ سَعْدِ بْنِ طَرِيفٍ،عَنْ عُمَيْرِ بْنِ مَأْمُونٍ،عَنْ الْحَسَنِ بْنِ عَلِيٍّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تُحْفَةُ الصَّائِمِ الدُّهْنُ وَالْمِجْمَرُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ. لَيْسَ إِسْنَادُهُ بِذَاكَ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ سَعْدِ بْنِ طَرِيفٍ. وَسَعْدُ بْنُ طَرِيفٍ يُضَعَّفُ،‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ عُمَيْرُ بْنُ مَأْمُومٍ أَيْضًا.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”روزہ دار کا تحفہ خوشبودار تیل اور عود کی انگیٹھی ہے“۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اس کی سند قوی نہیں ہے،۳-ہم اسے صرف سعد بن طریف کی روایت سے جانتے ہیں،اور ۴-سعد بن طریف ضعیف قرار دیے جاتے ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف جدًا<br>سعد بن طریف: متروک ورماہ ابن حبان بالوضع وکان رافضیًا (تقریب: 7343)<br>عمیر بن مامون: ضعیف (التحریر تقریب التھذیب: 5187)`;
tirmizi.anwaar = [210,1];