var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ مَنْصُورٍ،عَنْ أَبِي حَازِمٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ حَجَّ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَأَبُو حَازِمٍ كُوفِيٌّ وَهُوَ الْأَشْجَعِيُّ وَاسْمُهُ سَلْمَانُ مَوْلَى عَزَّةَ الْأَشْجَعِيَّةِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”جس نے حج کیا اور اس نے کوئی فحش اور بیہیودہ بات نہیں کی،اور نہ ہی کوئی گناہ کا کام کیا ۱؎ تو اس کے گزشتہ تمام گناہ ۲؎ بخش دئیے جائیں گے“۔امام ترمذی کہتے ہیں: ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;