var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ،حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،عَنْ مُوسَى بْنِ عُقْبَةَ،عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ،عَنِ ابْنِ عُمَرَ،قَالَ الْبَيْدَاءُ الَّتِي يَكْذِبُونَ فِيهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا أَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ مِنْ عِنْدِ الْمَسْجِدِ مِنْ عِنْدِ الشَّجَرَةِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏";
tirmizi.urdu = "بیداء جس کے بارے میں لوگ رسول اللہ ﷺ پر جھوٹ باندھتے ہیں (کہ وہاں سے احرام باندھا) ۱؎ اللہ کی قسم! رسول اللہ ﷺ نے مسجد (ذی الحلیفہ) کے پاس درخت کے قریب تلبیہ پکارا ۲؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;