var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ،عَنْ خُصَيْفٍ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ فِي دُبُرِ الصَّلَاةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُ أَحَدًا رَوَاهُ غَيْرَ عَبْدِ السَّلَامِ بْنِ حَرْبٍ،‏‏‏‏‏‏وَهُوَ الَّذِي يَسْتَحِبُّهُ أَهْلُ الْعِلْمِ أَنْ يُحْرِمَ الرَّجُلُ فِي دُبُرِ الصَّلَاةِ.";
tirmizi.urdu = "نبی اکرم ﷺ نے نماز کے بعد احرام باندھا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-ہم عبدالسلام بن حرب کے علاوہ کسی کو نہیں جانتے جس نے یہ حدیث روایت کی ہو،۳-جس چیز کو اہل علم نے مستحب قرار دیا ہے وہ یہی ہے کہ آدمی نماز کے بعد احرام باندھے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>نسائي (2755)<br>خصیف ضعیف`;
tirmizi.anwaar = [211,1];