var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا عَبْدُاللهِ بْنُ إِدْرِيسَ،عَنْ لَيْثٍ،عَنْ طَاوُسٍ،عَنِ ابْنِ عَبَّاسٍ قَالَ: تَمَتَّعَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَأَوَّلُ مَنْ نَهَى عَنْهَا مُعَاوِيَةُ. قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے حج تمتع کیا ۱؎ اور ابوبکر،عمر اور عثمان رضی الله عنہم نے بھی ۲؎ اور سب سے پہلے جس نے اس سے روکا وہ معاویہ رضی الله عنہ ہیں ۳؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>لیث بن أبي سلیم ضعیف`;
tirmizi.anwaar = [211,1];