var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ،حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ. ح وحَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ،أَخْبَرَنَا ابْنُ أَبِي فُدَيْكٍ،عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ،عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ،عَنْ أَبِي بَكْرٍ الصِّدِّيقِ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْحَجِّ أَفْضَلُ؟ قَالَ:‏‏‏‏ الْعَجُّ وَالثَّجُّ .";
tirmizi.urdu = "نبی اکرم ﷺ سے پوچھا گیا کہ کون سا حج افضل ہے؟ آپ نے فرمایا: ”جس میں کثرت سے تلبیہ پکارا گیا ہو اور خوب خون بہایا گیا ہو“ ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (2924)<br>محمد بن المنکدر لم یسمع من عبد الرحمٰن بن یربوع کما قال الترمذي<br>وللحدیث شواہد ضعیفۃ`;
tirmizi.anwaar = [211,2];