var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ مُحَمَّدِ بْنِ عَلِيٍّ،عَنْ ابْنِ عَبَّاسٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْمَشْرِقِ الْعَقِيقَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏‏‏وَمُحَمَّدُ بْنُ عَلِيٍّ هُوَ أبُو جَعْفَرٍ مُحمَّدُ بنُ عَلِيِّ بنِ حُسَيْنِ بنِ عَلِيِّ بنِ أبِي طَالبٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے اہل مشرق کی میقات عقیق ۱؎ مقرر کی۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-محمد بن علی ہی ابو جعفر محمد بن علی بن حسین بن علی ابن ابی طالب ہیں۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (1740)<br>یزید بن أبي زیاد ضعیف`;
tirmizi.anwaar = [212,1];