var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ،عَنْ عَطَاءٍ،عَنْ يَعْلَى بْنِ أُمَيَّةَ،قَالَ:‏‏‏‏ رَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيًّا قَدْ أَحْرَمَ وَعَلَيْهِ جُبَّةٌ،‏‏‏‏‏‏فَأَمَرَهُ أَنْ يَنْزِعَهَا .";
tirmizi.urdu = "نبی اکرم ﷺ نے ایک اعرابی کو دیکھا جو احرام کی حالت میں کرتا پہنے ہوئے تھا۔تو آپ نے اسے حکم دیا کہ وہ اسے اتار دے ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;