var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،عَنْ مَالِكٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَطَاءِ بْنِ يَسَارٍ،عَنْ أَبِي قَتَادَةَ فِي حِمَارِ الْوَحْشِ مِثْلَ حَدِيثِ أَبِي النَّضْرِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ابوقتادہ سے نیل گائے کے بارے میں ابونضر ہی کی حدیث کی طرح مروی ہے البتہ زید بن اسلم کی اس حدیث میں اتنا زائد ہے کہ رسول اللہ ﷺ نے فرمایا: ”کیا تمہارے پاس اس کے گوشت میں سے کچھ ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;