var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ لَمَّا جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ،‏‏‏‏‏‏دَخَلَ مِنْ أَعْلَاهَا وَخَرَجَ مِنْ أَسْفَلِهَا . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "جب نبی اکرم ﷺ مکہ آتے تو بلندی کی طرف سے داخل ہوتے اور نشیب کی طرف سے نکلتے۔امام ترمذی کہتے ہیں: ۱-عائشہ رضی الله عنہا کی حدیث حسن صحیح ہے،۲-اس باب میں ابن عمر رضی الله عنہما سے روایت ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;