var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،‏‏‏‏‏‏عَنْ أَيُّوبَ السَّخْتِيَانِيِّ،‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانُوا يَعُدُّونَ عَبْدَ اللَّهِ بْنَ سَعِيدِ بْنِ جُبَيْرٍ أَفْضَلَ مِنْ أَبِيهِ،‏‏‏‏‏‏وَلِعَبْدِ اللَّهِ أَخٌ يُقَالُ لَهُ:‏‏‏‏ عَبْدُ الْمَلِكِ بْنُ سَعِيدِ بْنِ جُبَيْرٍ،‏‏‏‏‏‏وَقَدْ رَوَى عَنْهُ أَيْضًا.";
tirmizi.urdu = "لوگ عبداللہ بن سعید بن جبیر کو ان کے والد سے افضل شمار کرتے تھے۔اور عبداللہ کے ایک بھائی ہیں جنہیں عبدالملک بن سعید بن جبیر کہتے ہیں۔انہوں نے ان سے بھی روایت کی ہے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>سفیان بن عینۃ مدلس وعنعن`;
tirmizi.anwaar = [212,1];