var tirmizi = {};
tirmizi.arabic = "أَخْبَرَنَا أَبُو مُصْعَبٍ الْمَدَنِيُّ قِرَاءَةً،‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ بْنِ عِمْرَانَ،عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،عَنْ أَبِيهِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي رَكْعَتَيِ الطَّوَافِ:‏‏‏‏ بِسُورَتَيْ الْإِخْلَاصِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ .";
tirmizi.urdu = "رسول اللہ ﷺ نے طواف کی دو رکعت میں اخلاص کی دونوں سورتیں یعنی «قل يا أيها الكافرون» اور «قل هو الله أحد» پڑھیں ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;