var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْأَجْلَحِ،عَنْ إِسْمَاعِيل بْنِ مُسْلِمٍ،عَنْ عَطَاءٍ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ غَدَا إِلَى عَرَفَاتٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَإِسْمَاعِيل بْنُ مُسْلِمٍ قَدْ تَكَلَّمُوا فِيهِ مِنْ قِبَلِ حِفْظِهِ.";
tirmizi.urdu = "ہمیں رسول اللہ ﷺ نے منیٰ ۱؎ میں ظہر،عصر،مغرب،عشاء اور فجر پڑھائی ۲؎ پھر آپ صبح ۳؎ ہی عرفات کے لیے روانہ ہو گئے۔امام ترمذی کہتے ہیں: اسماعیل بن مسلم پر ان کے حافظے کے تعلق سے لوگوں نے کلام کیا ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;