var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى،وَمُحَمَّدُ بْنُ أَبَانَ،قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ،عَنْ إِسْرَائِيلَ،عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ،عَنْ يُوسُفَ بْنِ مَاهَكَ،عَنْ أُمِّهِ مُسَيْكَةَ،عَنْ عَائِشَةَ،قَالَتْ:‏‏‏‏ قُلْنَا:‏‏‏‏ يَا رَسُولَ اللَّهِ أَلَا نَبْنِي لَكَ بَيْتًا يُظِلُّكَ بِمِنًى،‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا مِنًى مُنَاخُ مَنْ سَبَقَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "ہم نے عرض کیا: اللہ کے رسول! کیا ہم آپ کے لیے منی میں ایک گھر نہ بنا دیں جو آپ کو سایہ دے۔آپ نے فرمایا: ”نہیں ۱؎،منیٰ میں اس کا حق ہے جو وہاں پہلے پہنچے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 2625`;