var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ،حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ،عَنْ أَبِي إِسْحَاق،عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ،أَنَّ ابْنَ عُمَرَ صَلَّى بِجَمْعٍ،‏‏‏‏‏‏فَجَمَعَ بَيْنَ الصَّلَاتَيْنِ بِإِقَامَةٍ،‏‏‏‏‏‏وَقَالَ:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ مِثْلَ هَذَا فِي هَذَا الْمَكَانِ.";
tirmizi.urdu = "ابن عمر رضی الله عنہما نے مزدلفہ میں نماز پڑھی اور ایک اقامت سے مغرب اور عشاء کی دونوں نمازیں ایک ساتھ ملا کر پڑھیں اور کہا: میں نے رسول اللہ ﷺ کو اس جگہ پر ایسے ہی کرتے دیکھا ہے ۱؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابو داود (1929)<br>أبو إسحاق مدلس وعنعن`;
tirmizi.anwaar = [213,1];