var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ،حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ،عَنْ الْحَجَّاجِ،عَنْ الْحَكَمِ،عَنْ مِقْسَمٍ،عَنْ ابْنِ عَبَّاسٍ،قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي الْجِمَارَ إِذَا زَالَتِ الشَّمْسُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "رسول اللہ ﷺ رمی جمار اس وقت کرتے جب سورج ڈھل جاتا ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;