var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،وَعَلِيُّ بْنُ خَشْرَمٍ،قَالَا:‏‏‏‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ،عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي زِيَادٍ،عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ،عَنْ عَائِشَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّمَا جُعِلَ رَمْيُ الْجِمَارِ وَالسَّعْيُ بَيْنَ الصَّفَا،‏‏‏‏‏‏وَالْمَرْوَةِ لِإِقَامَةِ ذِكْرِ اللَّهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”جمرات کی رمی اور صفا و مروہ کی سعی اللہ کے ذکر کو قائم کرنے کے لیے شروع کی گئی ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 2624`;