var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،وَأَبُو سَعِيدٍ الْأَشَجُّ،قَالَا:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ،عَنْ سُفْيَانَ،عَنْ عُبَيْدِ اللَّهِ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى هَدْيَهُ مِنْ قُدَيْدٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ الثَّوْرِيِّ إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ الْيَمَانِ،‏‏‏‏‏‏وَرُوِيَ عَنْ نَافِعٍ،‏‏‏‏‏‏أَنَّ ابْنَ عُمَرَ اشْتَرَى هَدْيَهُ مِنْ قُدَيْدٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا أَصَحُّ.";
tirmizi.urdu = "نبی اکرم ﷺ نے اپنا ہدی کا جانور قدید سے خریدا۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے ثوری کی حدیث سے صرف یحییٰ بن یمان ہی کی روایت سے جانتے ہیں: اور نافع سے مروی ہے کہ ابن عمر نے قدید ۱؎ سے خریدا،اور یہ زیادہ صحیح ہے ۲؎۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (3102)<br>سفیان الثوري عنعن<br>یحیی بن الیمان صدوق عابد یخطئ کثیرًا وقد تغیر`;
tirmizi.anwaar = [213,1];