var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ تُكَفِّرُ مَا بَيْنَهُمَا،‏‏‏‏‏‏وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلَّا الْجَنَّةُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”ایک عمرے کے بعد دوسرا عمرہ درمیان کے تمام گناہ مٹا دیتا ہے ۱؎ اور حج مقبول ۲؎ کا بدلہ جنت ہی ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;