var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى،وَابْنُ أَبِي عُمَرَ،قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَمْرِو بْنِ دِينَارٍ،عَنْ عَمْرِو بْنِ أَوْسٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يُعْمِرَ عَائِشَةَ مِنَ التَّنْعِيمِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے انہیں حکم دیا کہ وہ عائشہ رضی الله عنہا کو تنعیم ۱؎ سے عمرہ کرائیں۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;