var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى،حَدَّثَنَا شَيْبَانُ،عَنْ مَنْصُورٍ،عَنْ مُجَاهِدٍ،عَنْ ابْنِ عُمَرَ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَمَرَ أَرْبَعًا إِحْدَاهُنَّ فِي رَجَبٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ.";
tirmizi.urdu = "نبی اکرم ﷺ نے چار عمرے کیے،ان میں سے ایک رجب میں تھا ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;