var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ،حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ هُوَ:‏‏‏‏ السَّلُولِيُّ الْكُوفِيُّ،‏‏‏‏‏‏عَنْ إِسْرَائِيلَ،عَنْ أَبِي إِسْحَاق،عَنْ الْبَرَاءِ،أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَمَرَ فِي ذِي الْقَعْدَةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَفِي الْبَاب:‏‏‏‏ عَنْ ابْنِ عَبَّاسٍ.";
tirmizi.urdu = "نبی اکرم ﷺ نے ذی قعدہ کے مہینہ میں عمرہ کیا ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس رضی الله عنہما سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;