var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ،أَخْبَرَنِي مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ أَبِيهِ،أَنَّهُ كَانَ يُنْكِرُ الِاشْتِرَاطَ فِي الْحَجِّ،‏‏‏‏‏‏وَيَقُولُ:‏‏‏‏ أَلَيْسَ حَسْبُكُمْ سُنَّةَ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "وہ حج میں شرط لگانے سے انکار کرتے تھے اور کہتے تھے: کیا تمہارے لیے تمہارے نبی اکرم ﷺ کا طریقہ کافی نہیں ہے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;