var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ،قَالَ:‏‏‏‏ مَنْ حَجَّ الْبَيْتَ فَلْيَكُنْ آخِرُ عَهْدِهِ بِالْبَيْتِ إِلَّا الْحُيَّضَ،‏‏‏‏‏‏وَرَخَّصَ لَهُنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ.";
tirmizi.urdu = "جس نے بیت اللہ کا حج کیا،اس کا آخری کام بیت اللہ کا طواف (وداع) ہونا چاہیئے حائضہ عورتوں کے سوا کہ رسول اللہ ﷺ نے انہیں رخصت دی ہے۔امام ترمذی کہتے ہیں: ۱-ابن عمر کی حدیث حسن صحیح ہے،۲-اہل علم کا اسی پر عمل ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;