var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ،سَمِعَ السَّائِبَ بْنَ يَزِيدَ،عَنْ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ يَعْنِي مَرْفُوعًا،‏‏‏‏‏‏قَالَ:‏‏‏‏ يَمْكُثُ الْمُهَاجِرُ بَعْدَ قَضَاءِ نُسُكِهِ بِمَكَّةَ ثَلَاثًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ بِهَذَا الْإِسْنَادِ مَرْفُوعًا.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ”مہاجر اپنے حج کے مناسک ادا کرنے کے بعد مکے میں تین دن ٹھہر سکتا ہے“ ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اور اس سند سے اور طرح سے بھی یہ حدیث مرفوعاً روایت کی گئی ہے۔";
tirmizi.hukam = "متفق علیہ";
tirmizi.description = ``;