var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ،حَدَّثَنَا خَلَّادُ بْنُ يَزِيدَ الْجُعْفِيُّ،حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ،عَنْ هِشَامِ بْنِ عُرْوَةَ،عَنْ أَبِيهِ،عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،‏‏‏‏‏‏ أَنَّهَا كَانَتْ تَحْمِلُ مِنْ مَاءِ زَمْزَمَ،‏‏‏‏‏‏وَتُخْبِرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَحْمِلُهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ،‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "وہ زمزم کا پانی ساتھ مدینہ لے جاتی تھیں،اور بیان کرتی تھیں کہ رسول اللہ ﷺ بھی زمزم ساتھ لے جاتے تھے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف اسی طریق سے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;