var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ،قَالَ:‏‏‏‏ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ،قَالَ:‏‏‏‏ حَدَّثَنَا حُسَامُ بْنُ الْمِصَكِّ،قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو مَعْشَرٍ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،قَال:‏‏‏‏ سَمِعْتُ عَبْدَ اللَّهِ،يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِنَّ نَفْسَ الْمُؤْمِنُ تَخْرُجُ رَشْحًا،‏‏‏‏‏‏وَلَا أُحِبُّ مَوْتًا كَمَوْتِ الْحِمَارِ،‏‏‏‏‏‏قِيلَ:‏‏‏‏ وَمَا مَوْتُ الْحِمَارِ؟ قَالَ:‏‏‏‏ مَوْتُ الْفَجْأَةِ .";
tirmizi.urdu = "میں نے رسول اللہ ﷺ کو فرماتے سنا ہے: ”مومن کی جان تھوڑا تھوڑا کر کے نکلتی ہے جیسے جسم سے پسینہ نکلتا ہے اور مجھے گدھے جیسی موت پسند نہیں“۔عرض کیا گیا: گدھے کی موت کیا ہے؟ آپ نے فرمایا: ”اچانک موت“۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `ضعیف<br>حسام بن مصک: ضعیف یکاد أن یترک (تقریب: 1193)<br>وللحدیث شواہد ضعیفۃ`;
tirmizi.anwaar = [214,1];