var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ،حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ،وَهَارُونُ بْنُ الْمُغِيرَةِ،عَنْ أَبِي حَمْزَةَ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ إِيَّاكُمْ وَالنَّعْيَ فَإِنَّ النَّعْيَ مِنْ عَمَلِ الْجَاهِلِيَّةِ . قَالَ عَبْدُ اللَّهِ:‏‏‏‏ وَالنَّعْيُ أَذَانٌ بِالْمَيِّتِ. وَفِي الْبَاب،‏‏‏‏‏‏عَنْ حُذَيْفَةَ.";
tirmizi.urdu = "نبی اکرم ﷺ نے فرمایا: ’’«نعی» (موت کی خبر دینے) ۱؎ سے بچو،کیونکہ «نعی» جاہلیت کا عمل ہے“۔عبداللہ بن مسعود رضی الله عنہ کہتے ہیں: «نعی» کا مطلب میت کی موت کا اعلان ہے۔امام ترمذی کہتے ہیں: اس باب میں حذیفہ رضی الله عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>أبو حمزۃ مسلم بن کیسان الأعور ضعیف (تقریب: 6641)`;
tirmizi.anwaar = [214,1];