var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ بَكْرِ بْنِ خُنَيْسٍ،حَدَّثَنَا حَبِيبُ بْنُ سُلَيْمٍ الْعَبْسِيُّ،عَنْ بِلَالِ بْنِ يَحْيَى الْعَبْسِيِّ،عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ،قَالَ:‏‏‏‏ إِذَا مِتُّ فَلَا تُؤْذِنُوا بِي إِنِّي أَخَافُ أَنْ يَكُونَ نَعْيًا،‏‏‏‏‏‏فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنِ النَّعْيِ . هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "انہوں نے کہا: جب میں مر جاؤں تو تم میرے مرنے کا اعلان مت کرنا۔مجھے ڈر ہے کہ یہ بات «نعی» ہو گی۔کیونکہ میں نے رسول اللہ ﷺ کو «نعی» سے منع فرماتے سنا ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "ضعیف";
tirmizi.description = `إسنادہ ضعیف<br>ابن ماجہ (1476)<br>في سماع بلال بن یحیی من حذیفۃ رضي اللّٰہ عنہ نظر،واللّٰہ أعلم`;
tirmizi.anwaar = [214,1];