var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا اللَّيْثُ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ سَعْدِ بْنِ سِنَانٍ،عَنْ أَنَسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏‏‏قَالَ:‏‏‏‏ الصَّبْرُ فِي الصَّدْمَةِ الْأُولَى . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”صبر وہی ہے جو پہلے صدمے کے وقت ہو“ ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;