var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ،حَدَّثَنَا أَبُو دَاوُدَ،‏‏‏‏ وَشَبَابَةُ،قَالَا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ،عَنْ خُلَيْدِ بْنِ جَعْفَرٍ،سَمِعَ أَبَا نَضْرَةَ يُحَدِّثُ،‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَطْيَبُ الطِّيبِ الْمِسْكُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.";
tirmizi.urdu = "رسول اللہ ﷺ نے فرمایا: ”سب سے بہترین خوشبو مشک ہے“۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;